{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-16", "description": "Put it to you this way: If you come here expecting to find amazingly high-quality, freshly prepared Thai food, you probably won't find it.  The name of this place is about as unremarkable as it gets when it comes to names of restaurants/cafés/eateries, but, at the same time, the name is self-explanatory and to-the-point.  Here, they serve Thai food to-go.  That's it.\n\nRincon Center, sadly, isn't the same Rincon Center of old, in which there were a number of places from which to choose for food.  Thai-To-Go has been around for a while, however, and I like to come here from time to time for the following reasons:\n\n+ Big portions\n\n+ Very reasonable prices\n\n+ Fast service\n\nYou go in, you place your order, they put your order in a to-go container, and you pay at the end.  Credit/debit cards are accepted.  Most items are seemingly prepared in-advance and sitting atop a food warmer.  They will give you napkins with your order, and there's a small table where you can get cutlery and chopsticks, among other things.  Even though it's to-go, there's plenty of seating both within and without Rincon Center for your convenience.\n\nEach time, I've ordered the vegetarian pad thai noodles with peanuts.  For the amount I got and the price I paid, it was a great deal.  The food itself was just okay -- somewhere between flavorful and flavorless, if that makes sense.\n\n3 stars", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Yelpers rejoice! You have stumbled upon a hidden gem that embodies everything there is to love about fantastic Thai comfort food. All across the board you can find traditional, authentic Thai food that is comprised of fresh ingredients and made with the most love possible. I had the green curry and it was absolutely fantastic! Chicken breast that melts in your mouth and eggplant cooked perfectly go great with a side of their pad thai which has a pretty unique savory flavor. On other occasions I have also tried the panang curry which is great as well. One thing that separates this place from the others is that every day you walk in there is a special. You never know what you're gonna get but it always ends up being worth the try. \n\nThe owner is also always behind the register with a smile! She has been for as long as I have been going and always has the nicest things to say.  Overall, from the service, to the food, to ownership, this place is a must try if you're in the Financial District!", "author": "Serouge P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "I really hate rating this place a 1 star but it is deserved. I stopped by for lunch debating between Thai and Poke. Thai won because I was craving pad thai. Not a lot of choices for protein, the only option with beef was ginger beef and even then it was questionable. It was ground beef and the ginger flavor was overpowering. The pad thai was very acidic and lacked flavor. Wasn't too happy about paying $13+. \n\nPerhaps one day I will be brave and try the curry, but I highly doubt it. Sorry but this is a no-go for me.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "MEALPAL comments:\nThe portion size is pretty good; you get a lot of noodles and chicken. The chicken itself seems to be seasoned differently from the rest of the pad thai. The flavor I think had more of a sour taste. The pad thai is just overall average, but nevertheless an easy place to grab something quickly.", "author": "James N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-22", "description": "They definitely need better people taking orders during lunch. Not only are they not friendly, they also don't listen and give you the wrong food. Then rush you along the line. I got 2 of the three things I added for.", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-17", "description": "Thai-To-Go is an extremely average but quick lunch spot in Rincon Center. I have been here a few times due to the convenient location and quick service. You can order your food and be out of there in just a few minutes! I've found that even when the line is long, the service is quite fast. \n\nThey have a lot of the food out in display cases so you can see what looks good. I usually get the vegetarian Panang curry, but I tried the spicy tofu today as well. There are a lot of vegetarian options. \n\nThe major downside is that the food is just...ok. It's spicy and it will fill you up, but it's not quite as flavorful as I would expect. For the spicy tofu, it feels like the spice is there to provide flavor and beyond that, there isn't much. The things I have tried are a little bit on the oilier side, but it's not too greasy. It also costs around $11 for just one entree over rice, which is average for the area, but feels expensive for mediocre Thai food. \n\nIf you're craving Thai food and want a quick and convenient lunch, I would definitely recommend Thai-To-Go, but just keep in mind that the food is just ok.", "author": "Ayushi A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-11", "description": "I ordered Yellow Curry with Chicken ($9.75). The portion size was decent for its price and it was very hot (temperature wise). The whole bottom part of the container was filled with rice. Curry was poured all over the rice. There was a lot of chicken and not many potato pieces. \n\nThe curry and chicken was very dry though. Half of the curry just stuck onto the rice. The rice was very soft and clumped together. Perhaps, there was too much water added to the rice? The potatoes and carrot pieces were very soft and I was easily able to poke my plastic fork into them. \n\nThe cabbage salad was placed on one side of the container. I would have preferred the salad to be in a separate container. Fortunately, the salad was not very saucy. I was able to eat the cabbage salad without the pieces mixing with the curry.\n\nIn general, this place is very average. I have had better Thai places in the past.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Great food. Love the variety of spices they put in their shrimp. Friendly staff, always greeted with a smile at the front. Good price, hard to find food with the quantity in SF.", "author": "Victor C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-29", "description": "The two entree plate comes out to $12.48 after tax. \n\nEven if it seems like you are getting a decent amount of chicken strips in the Red Chicken Curry you actually aren't. Half of the strips in there are actually bamboo strips.\n\nThe pad see ew is the most mediocre pad see ew I've ever tasted. It looks like it's made of leftover noodles.", "author": "Rica Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Love the salads here. I come at least once a week when I'm working downtown. The Thai chicken salad is my go to and the ladies behind the counter are all super nice. And despite the curiously low reviews on yelp, this place always has a line out the door during lunch!", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-03", "description": "I am vegetarian and have bought green beans with tofu and rice mostly. It feels like the quality of food is going down and the price up as 1 entree came for $11.39. And I am hardly feeling like eating this now as it does not taste good.\nI bought green curry once as well, that is no good either.\nNot going back again!", "author": "MK S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-10", "description": "Thai for lunch!\n\nPeople tend to poo poo food court food, but Thai-To-Go in Rincon Center Annex is a fine place to grab a small box for lunch and get a taste of various flavors in Thai dishes. Yes you can find better Thai food in San Francisco no doubt, but this little place can satisfy your pallet for under $10 until you get a chance to really load up with Thai food in your favorite Thai place.\n\nOn a nice day, you can get your Thai lunch and walk outside where you have a great view of beautiful San Francisco bay and enjoy.", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-09", "description": "Another small restaurant within the famous (or infamous) Rincon Center.\n\nThai-to-Go is a pure takeout place with zero seating, so be forewarned.  TTG is just like any other take out place where you can select a la carte or go with one of their packaged combo specials.  They also have individual entress which I haven't had because combos are so much more convenient.\n\nI've had many things here and if I were to give any piece of advice on what to order, I'd say stay with their spicy curries or anything spicy.  The Pad Thai here is so ordinary that I don't order it anymore.  I've had some of their non-spicy dishes like their tofu, but it again was so ordinary that I just pass on them.  I've had their curries and they're good, but you can't order any of them spicy.  They're pretty much blanded down to accommodate the majority of people.\n\nExpect to pay about $10 - $12 for a meal here which is on par for most of the restaurants in the Rincon Center.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-21", "description": "A-OK because it's fast and cheap and the food is pretty good. if you're looking for more sophisticated Thai food, there are plenty of other choices. but for a quick meal this is fine\n\nif you like some heat, there are a few very spicy curries and also a spicy chicken which is more like a popcorn chicken dish. \n\nfor about $10 you pick two servings and get rice and a small salad. totally worth it IMO for lunch. no seating inside, but it's in the lobby of the Rincon Center which was the old post office and plenty of tables. there are a bunch of other places to eat in this lobby too", "author": "Bob U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "I wish i could rate this less than one star....i never write reviews in yelp much but i felt this one deserves a review...i ordered chicken pad thai in mealpal app and i can comfortable say that this is the worst pad thai i ever ate..i cant even explain how does that taste..i felt i am eating something which was spoiled a week before...mealpalers and regular eaters please avoid this place at any cost...", "author": "S C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Excellent lunch time and to go venue. Organic and natural items, great service, and lots of food for the price.", "author": "Saji J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-06", "description": "Bad rice. Too much water, maybe? The red curry is just all right. The neighborhood lacks its fair share of Asian restaurants, but even so, I'd hesitate to go back.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "Okay.  i know you are busy during lunch hour, but rushing me is not a good approach.  And specially if you are going to get my order wrong.  Nothing frustrates me more than getting back to my desk and finding that you didn't listen to my request.  Please slow down and get my order right.  No rice, means no carbs - I am diabetic!!  \n\nYour food is good.  But maybe the attitude could be toned down a little bit.  I've walked out of there before when one of their staff treated me like I had just asked for her kidney.  \n\nNote:  Spicy means spicy.  No joke.  Don't eat the Chicken Paw-Krow (spelling) and then go be active.  Your soul will hate you.  Hello Heartburn!!", "author": "Inked I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "Thai To Go is a quick to-go restaurant located in the food court amongst many different kinds of foods.  They have one of the best locations, as they are the first restaurant you see when you enter the food court.\n\nI got the rice + 2 order combination.  I ordered the pad thai, which was somewhat really well made.  It had a lot of good veggies in it and the noodles were cooked well.  It's a vegetarian style pad thai so you get plenty of dried tofu in your dish.  Grade:  B\n\nI also got the Green Curry Chicken with eggplant.  I really enjoyed this dish because the flavors were bold and the tastes weren't overwhelming.  It was nice to eat over rice.  Grade:  B+\n\nService - what can you expect from a fast food place. They try to get you through the queue as quickly as possible so they can maximize the number of customers during lunch rush hour.\n\nFood Grade:  B+\nService Grade:  B\nWorth the Money Grade:  B\nOverall Impression Grade:  B", "author": "Marko C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-11", "description": "I was looking to satisfy my Thai cravings during lunch and Osha is too expensive.\n\nUnfortunately, Thai-To-Go is also quite expensive and not that great. Thai-To-Go is exactly what you'd expect from the name: a takeout Thai place.\n\nAnd that's basically it. It's literally just a takeout Thai place, and there's no wow factor in anything. Compared to the restaurants in Berkeley where Thai food is made to order, or even other takeout places, Thai-To-Go just simply doesn't match up. The variety is just limited to the usual curries and pad Thai. I will concede that they seem to have weekly specials, but at the price of something around $10 for a dish, there's nothing really exciting keeping me coming back.\n\nI'll probably be back if I'm ever feeling Thai, but besides that, there really isn't much to write home about for Thai-To-Go.\n\nTIP: Brown rice costs extra.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Reserved a meal here via MealPal. This is a part of the Rincon Food Center.\n\nHighly underrated place. Got the Yellow Chicken Curry. They ensured lots of meat on the plate and the curry was delicious.\n\nDon't know why this place has such a low rating on Yelp though :(. Nice for a quick lunch!", "author": "Debjani B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "Convenient? Yes, rincon center\nFresh food? Not from what I saw\nOily food? Yes\nService? Definitely not\n\nChicken soup: served in a plastic container, with a small amount of rice noodles and a tiny amount of chicken... Not flavorful, mostly tasted like cilantro\n\nService wasn't friendly even though there was no one in line\n\nWill not be coming back, unless I want what tastes like pre-made or frozen Costco soup.", "author": "Kristie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-06", "description": "Non-GMO chicken thumb's up.\nFood & tastes thumb's down.\nSorry to say, worse Thai food I've had in my life and operated by Chinese.", "author": "Patricia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "This is my Thai go-to lunch spot. Compared to Osha (which has a food stall location at 1 Market and a sit down restaurant in the Embarcadero Center), Thai-To-Go is far superior, in my opinion.\n- The grease level is not off the charts, as it is at Osha. \n- I like the two-item combo with brown rice (which is an extra dollar). I get two different veg curries. They have generous helpings of vegetables and big chunks of tofu. \n- The combos come with a a bit of cabbage slaw, a nice, cool palate cleanser.\n\nCaveat: I like spice, but these curries are REALLY hot! I come back from lunch looking like I've been crying. I enjoy the cathartic experience, but it's best to eat this solo so as not to be honking into a kleenex constantly around your dinner guests.", "author": "Elinor A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-26", "description": "The consensus is pretty unanimous for Thai To Go \n\nOver priced, poorly executed proteins, and small portions \n\nThe sauces have flavor but they start to taste too similar with one another (had the panang curry and some sort of sweet/sour chicken)\n\nOverall Thoughts\n\nI could not agree more!", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "Is it the best Thai you'll ever have? Not even close, but it WILL do the job if you're in the area. Their yellow and red curry chicken are both great. The pad thai is pretty good too. I really haven't been blown away by anything, but I also haven't been too disappointed. Simply, A-OK.", "author": "Selena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Yummy! I love Thai food and this place makes it so well. My favorite is the salmon, they only serve on Fridays. I also love the curries, pad Thai and steamed rice! I know that steamed rice is no big deal, but for some reason it tastes very special to me. The spicy ground beef is also to die for!", "author": "Zoha R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-13", "description": "My buddy and I didn't have much time for lunch so we went to the Rincon food court to grab a quick bite.  There's a lot of unique and ethnic options but I was in the mood for Thai.  Fortunately there's a take-out place in the plaza with exactly what I was looking for.\n\nI ordered a 3 item plate with pineapple fried rice, green curry with chicken, and the red curry.  Overall, the food was a huge disappointment.  The fried rice was super sweet, the chicken was really tough, and the curry seemed to have sit for a bit too long.  It was edible, but barely.  In fact, this is definitely a case where I could have made a better meal at home.\n\nService was whatever and nothing particularly special.  Meals are about $10, which is on par with food in SOMA.  I was disappointed with the experience and won't be coming back.\n\nFood: 3/10\n\nService: 3/10\n\nPrice: $$\n\nAtmosphere: 2/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-08", "description": "This is a quick, fast-food type of place at Rincon Center.  Given the type of restaurant it is, I have no problems with the food or service.  I like getting one of the curries over rice, and I like that it comes with a small side salad.  The lines at lunch can be long, but then again, it's the lunch hour and lines are long at other Rincon restaurants (the Mexican food place, Yank Sing).  The line moves pretty fast.", "author": "Donna G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-07", "description": "I've been to Thai-To-Go twice now.  The first time, I had a slightly overpriced (even for the FiDi) but very tasty and satisfying yellow curry.  The second time, I had an even more overpriced (albeit huge, enough for two meals) but decent noodle salad with chicken.  \n\nI should have gone for the curry again.  \n\nOn visit #2, I learned that this is yet another Bay Area eatery whose menu does not list all the ingredients present in a dish.  So if there is something you don't eat, don't like or are allergic to, ask before ordering.  I usually do, I didn't this time, and I should have known.  Argh.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Passed by near lunch time after going to the post office and decided to try it out.\n\nHad the 2 items w/ white rice, spicy chicken and veggie curry. They also include a side of slaw that acts as a great counterbalance to the spiciness of the dishes.\n\nFor $9.75 + tax, it's a little pricey but it's filling. \n\nQuick in and out within 5 minutes.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-05", "description": "It wasn't bad but it wasn't good. \nI was in the mood for Thai and it had the shortest line so I decided to try it. The menu and options are very confusing. They kept asking me what I wanted and I was trying to find the menu and decide but because the line behind me was filling up quickly I just ordered some chicken and rice. I felt so rushed and was shocked that my bill was $9 when the lady rang me up. I didn't even get curry or noodles or anything! Just some chicken with OK seasoning, white rice and some little slaw salad thing they added in there. It was decent but I've definitely had better. Save yourself the disappointment and go to OSHA. It's a 5 minute walk down the road.", "author": "Dusty N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-24", "description": "For a quick lunch, this place is okay.  The curries are typically a pretty good choice.  Combo meals come with rice or pad thai.  While I've enjoyed the salads, they always put on a bit too much dressing.\n\nThere may be a long line at lunch time, but they get through it pretty quickly.  The meals run around $10-15.  Brown rice is $1 extra.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-06", "description": "Its my first time here at Thai-to-go and I got the noodle wonton soup. Its on the menu under specialty noodle soup. Save yourself the curiosity because it does not taste good at all. Going to yank sing or sorabol would've been a better choice. The soup cost me $10.80 and that is with tax. The broth is bland and the stuffed shrimp wonton was hard. It is most different from any wonton soup I have ever eaten. I will not be visiting this place ever again. It is compared to eating soup with water and stuffed cardboard wonton. Maybe it was not a good soup day there but I am not going to try anything else.", "author": "davee c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "I've come here about 5 times already being working in the neighborhood for about 7 months now.\nWhen i want some real good Thai food with no hassle...\nI always get the 3 item combo with Brown rice = (Pad Thai, Chicken w/yellow curry, Chicken w/red curry OR Tofu in red curry) $14 but i get to eat it for snack and dinner too.\nFood is always consistent.\nI always take a few of those containers of spicy sauce on top of the register before I leave. My favorite sauce is the clear one with chilis floating; spicy & tangy", "author": "PreciousSwt P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-02", "description": "Asked for \"vegetarian\" papaya salad, which costed 10 bucks and came with fish sauce (which is not mentioned in the ingredients). When I went back to return the salad, they explained me that fish sauce comes when you ask for vegetarian item, it was my mistake that I didn't mention \"no fish sauce\" explicitly. !! I was like - did you miss the biology class in school? Since when did fish become a vegetable?", "author": "LivelyLajja M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "Decent quick Thai food.  However, just ordered a vegetarian Currey and found chicken in it.  I'm fine with eating chicken, but begs the question of how much care they are giving to what happens to go into the dishes.", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "I ordered the Pad Thai with Kraw Prow over rice. I usually don't order pad thai. I usually get pad see ew or pad kee mao but they didn't have either and I really wanted noodles. I've never had kraw prow but it looked good so I got that.The pad thai tasted a little vinegar-y and the kraw prow was ok. After eating a while my stomach started to hurt. Thank goodness I didn't get sick but anything that makes my stomach hurt must not be that good.", "author": "Kaylan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-26", "description": "I really love Thai food.  I especially love Thai curries.  My favorites are green curry and panang curry.  So, the thought of getting take out Thai curry had me really excited.\n\nThe concept sounded good. You pick from the variety of take out options, they pack your food quickly, and you're on your way out the door, soon-to-be eating your delicious food.\n\nThe one flaw in that concept turned out to be the expectation of delicious food.  Everything else was right on the mark, but who cares if it's quick with lots of options when it tastes bad?  I got the chicken panang curry, and it looked awesome. It just didn't taste awesome, it had no flavor nor spice.", "author": "Nadeem A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-24", "description": "I decided to give Thai-To-Go one more shot.\n\nI was hungry and had a major craving for Thai curry. I should've reminded myself I live in the Sunset, surrounded by LEGIT Thai restaurants. But I gave in to hunger, and went back. It was just not comparable to Chabaa Thai, Marnee Thai, King of Noodle, Bangkok Noodles or Thai Stick. Especially when you are paying ALMOST the same price! \n\nNot a fan.", "author": "Mari S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-03", "description": "The line here moves so quickly even when it looks packed. I was out in under 5 minutes with food!\n\nI got a 2 item box with yellow curry with chicken and pad thai. Both were good and with the big scoop of rice it was plenty of food. \n\nThe people working here are very friendly. \nWill definitely return!", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "I had a hankering for pad thai. This place only has vegetable or chicken pad thai.  I ordered the chicken.  It came with a side of cabbage that I'm not too fond of.   The noodles were good but I didn't care for the chicken.  It was dry!  \n\nNo sprouts in the pad thai.  It's only OK.  I wouldn't say I had the best.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-03", "description": "Price to happiness ratio is horrible. I will likely never go never go back. It didn't make me sick but the Chicken was dry and stringy with lots of gristle.\n\nThe people who work here are nice enough and really the only reason for the extra star. Better than expected considering the Rincon food court location but stay away.\n\nDo not eat here.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-09", "description": "Really awful customer service. Credit card machine wasn't working and I got hounded repeated during my meal so she can make sure that I don't go anywhere while the machine is being fixed.", "author": "Eli H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-10", "description": "Having worked in SOMA-FIDI for half a year now, i have experienced a fair amount of bad food. which goes to show how hard it is to make good food fast or fast food good.\nthis is another example of trying to make fast food good.\nfail\nthe red curry chicken was dry and clumpy due to sitting in a steam table for a couple of hours. at least.\nnot many options in the rincon center have impressed my picky palate other than yank sing.\nbut i cannot afford $50 lunch on a regular basis so i am left to wander the water fountain courtyard in search of lower priced options.\nalas to quote Bono\ni still haven't found what i'm looking for....", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-12", "description": "Decided to treat myself to lunch today, which is super rare because I usually bring my own food to work. I ordered the vegetarian Pad Thai. I had about 4 bites and it had a strong vinegar taste. I ate the 3 little pieces of tofu that I could dig out, and will definitely be throwing the rest away. Too bad because I absolutely hate wasting food, but I just can't finish it.", "author": "Alijah J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-06", "description": "The best way to describe this place is cafeteria Thai food. You know it's not going to be gourmet extravaganza, but it's not like McDonalds quality. I personally wouldn't eat the pad thai because it's pretty dry even with the lime, but the curry dishes are consistently solid.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-11", "description": "Unlike their hot foods, their salads are pretty good. I personally like the green papaya salad with the bbq chicken. I've had it around 3 times and have enjoyed the spicy, fish sauce sauce over American salads from time to time. \n\nBut on my most recent visit here, I got food poisoning. Beware.", "author": "Erin D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-19", "description": "Was expecting more from this place, but was disappointed. I love spicy food that's why I came here yesterday to try. The spicy curry weren't spicy at all even combined with their super spicy sauce (so as they say)...\n\nRather go somewhere else to get some spicy foods.", "author": "Jackie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "Not sure why this has bad reviews. The curries are delicious, and the papaya salad is AMAZING. It's an entire meal (not a side dish) and the chicken is excellent.", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-19", "description": "Strolled in to this place for lunch about a month ago - lured by the fact that the prices seemed low and the line outside was sizeable.\n\nAll I can say is that you pay for what you get as my Pad-thai was extremely soggy/mushy and strangely flavored.  Also, my curry was extremely runny and equally strange-tasting.  Having to wait in a long line to pay for sub-par quality food merits this place a 2 star review in my book and I definitely will not be returning any time soon.\n\nTo its benefit, this is probably one of the least expensive places to eat in Rincon Center and the staff are in fact very friendly.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "I'm not sure why people hate on this place. I eat here on a pretty regular basis and they have solid Thai food (it's not Lers Ros but it's still quite decent) for a reasonable cost. They have a hot foods line similar to Osha Express and the food is just as good and far less greasy. I also come here often for their Thai salads with BBQ pork or chicken. The salads are big and totally fill you up for lunch and are a cheaper alternative to Mixt Greens if you're looking for a salad lunch.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-15", "description": "I really like Thai takeout for lunch; this place is right across the street from my office in Rincon Center; yet it's so bad and overpriced I won't be back.  It feels like everything they do has been sitting in steam trays for far too long, including their noodle dishes.  It's also quite overpriced; probably $2 more per lunch than it really should be for a quick take-out place.  It tastes no more authentic than the food at Lee's Deli.  \n\nThis review is part of a series on lunch places near my office.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-13", "description": "Ordered chicken pad thai for lunch. I've spent the last four years in college eating the sh**iest delivery pad thai so I know a little bit about what a low standard chicken pad thai should taste like. This particular one didn't even meet the bar for the 2am reheated pad thai I used to eat. I'm very disappointed. They can definitely do better for that price.", "author": "Polina S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-05", "description": "Maryanne, this one' s for you ... today, I just had to try out Thai-to-go.\n\nThis place is a rip-off, especially it being a Thai version of Panda Express. They offer special platters and combinations that start @ $8.\n\nI ordered red curry chicken, but they would not allow me to select their spicy and sour soup (like Tom Yum) as a 2nd item; instead, they charged me $7.35/one item plus $3.15 for a small soup. I paid $11.50 for to-go food. Rip-off. The 1 item combo came with the chicken curry over rice, with a side of salad. \n\nIt tastes okay, but IMO, they cooked with too much coconut. Load up with the chili sauce- trust me, it tastes better. \n\nI just discovered there's an Osha in the Embarcadero center that I'm going to try out next week.", "author": "Rochelle B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-26", "description": "Was there a Go/No Go decision made on Thai-to-Go? ...or did everyone go to a Go-Go to avoid the choice? ...or did they go to Togo's to forgo the craving for Thai? In any case, this is not one of the better eateries when maneuvering the lunchtime rush at the Rincon Center. They serve fast-food Thai in leaky styrofoam containers, and for goodness sakes, keep the line moving, will ya?\n\nI ordered the $6.50 Pad Thai, a spillage accident waiting to happen. First the noodles are severely overcooked to the point of turning into a massive blob. Along with the small tofu chunks and the chicken (for which they charge an extra fifty cents), they are slathered with a hot sauce that has little kick, and there is an odd side of shredded cabbage which made me crave real cole slaw.\n\nI barely ate half of it since I was worried a stray noodle would land on my near-white shirt thus jeopardizing my credibility and raising unnecessary questions about my hygiene habits during a presentation I had to make in front of my boss soon after lunch. Thank goodness I had a stick of Tide-to-Go at my desk. Better to reserve your taste buds for the far more appetizing places you could get Thai food in this city.\n\nFOOD - 2 stars...overcooked, oversauced and a drippy styrofoam container...who took my Tide-to-Go stick?\nAMBIANCE - 3 stars...it's Rincon Center...not much room to break out of the conformity of this workplace food court\nSERVICE - 2.5 stats..kinda surly if you ask me \nTOTAL - 2.5 stars...if you really need Thai badly, I'd still skip it and head over to King of Thai Noodle pretty much anywhere in the city", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "Ok, came back and got the Red Curry.... better than the pad thai. It was actually edible which was a plus. I'd probably get it again if I'm in the mood... \n\nI just can't be too happy with this place cause the food isn't too good, and I always feel a little ripped off when I pay $8+ for not that big of a portion and not that good of food, especially when I've gotten thai dishes that were less than that, 2x as big and 10x as good.\n\nOverall... decent. I guess.", "author": "Alison B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-01", "description": "In the world of lunches eaten out of styrofoam containers, this is acceptable but barely. Yellow curry chicken was decent; pad thai was tasteless.\n\nAnd it is no wonder why, with food options like these, many folks in the FiDi look just one step away from the brink of insanity.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-12", "description": "The only reason I come here is because sometimes I crave curry badly and unfortunately there is no where else to go that's near my office. All their curries are decent. I'd say the red curry is probably the most flavorful and best. They claim to use all natural non-pesticides & fillers chicken breast. I don't know how much of this is true, but the chicken's pretty dry and healthy tasting. They offer brown rice which is great. \n\nThe Pad Thai is also decent, although I only recommend the vegetarian Pad Thai. The shrimp & chicken tastes a little odd. I've tried a few other dishes and can't say they are even decent. Everything always tastes like it has been sitting for quite some time and the veggies are always super hard and raw. I only like raw veggies in a salad, not a hot stew-y dish. The portions are pretty small. They fill your box up with 80 percent rice, 10 percent entree, and 10 percent salad.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-04", "description": "I almost don't want to rate this mediocre takeout only Thai restaurant in Rincon Center food court because this place is just boring.  Nothing special about this place and I don't really care for their food, but there aren't any specific critical things I can say about this place.  I guess it's popular because there isn't too many other cheap Thai restaurants in the area.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-11", "description": "Go to option.\n\nBetter than expected considering the Rincon food court location.\n\nMenu features plenty of noodles, curries, meats and rice dishes. BBQ chicken with steamed veggies on the side was above average. Not quite great.\n\nPortion generous. Oil light. Eight dollar price reasonable. Salad instead of rice appreciated.\n\nLack time and other options? Thai To Go is A-OK to go.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-30", "description": "Decent place to grab thai lunch. I ordered red curry with brown rice and it was okay - prices are slightly on the higher side for to-go", "author": "Kumar K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-01", "description": "For $8ish, I had the Pad See Ew.  It had a lot of broccoli, yellow squash and pieces of tofu mixed with chili sauce.  Hardly any noodles and it was missing the sweet taste that I like. First taste, I was disgusted and had to throw it away.  I'm against wasting food so I gave it to a homeless man nearby.  Hopefully, he liked it better than I did.  Gross, never again.  Service was prompt, 2 star for now because taste is very important, but I can't speak upon anything else they serve.  Not sure if I will get that opportunity.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-01", "description": "Not so bad for the wayward Thai food junkie, quick and affordable.  However, depending on who ladles out the curry depends on the portions received.\n\nCase in point.  \n\nI ran over here with a friend and while I was busy wasting my time looking over the food, I realized a line had already formed.  Wow.  So I slipped to the back of the line, deciding upon the Pad See Ew noodles.  Much to my chagrin, it had already sold out.  What, it was only 12:00.  Sheesh.\n\nSo I ordered the Pad Thai for around $7 and added on the green papaya salad, for a grand total of around $13.00.  I looked at the Pad Thai and I know I was charged extra for the chicken.......was very sad to watch her actually count out the small pieces of red meat (ie, the leg or the thigh).  But the tofu pieces were large and chunky.  I appreciated that.\n\nMy friends ordered the same Pad Thai and then the Penang Curry over rice. It was a dismal portion over an even more dismal portion of rice.  Shat, is there a shortage here?\n\nAlthough, Thai food portions have always been minute and one of the eyesores for a person such as myself, but then again, it may explain why they are teeny tiny women and I'm out here like a medium boned gorilla.\n\nFor a quick Thai fix, not too bad.  But, I would not choose this over other fast Thai places in Union, such as King of Thai or Marnee Thai.  Most definitely.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "I am addicted to this place.  The yellow curry is to die for.  Every time I go to Rincon, I think... I should eat at another place.  Then I see the Thai-To-Go sign calling me... and yellow curry it is again.  I definitely never regret my decision tho!\n\nI've also had the green curry.  One time the eggplants were SO delicious that it was like nothing I'd ever eaten before.  Another time, the eggplants were so soggy and disgusting that I never had green curry again.\n\nIf you like spicier, try the red curry.  It's not extremely spicy, but definitely  a lot spicier than the yellow or green.\n\nThe line moves really quickly, but if you go right at lunchtime, you'll have a tough time trying to find a place to sit.  I usually go after one and can sit almost anywhere.  The Rincon seating area is really pretty and I love the waterfall.  I definitely recommend giving this place a try.\n\nOh and awesome side note, the containers they serve your food in are sturdy and microwaveable.  They make awesome free tupperware!  LOL", "author": "JM R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-18", "description": "I've only been here once and would never come back.  I ordered the steak Pad Kee Mao.  Pad Kee Mao is one of my favorite dishes and i order it regularly so I have had it at many different Thai restaurants.  This was far and away the worst example of Pad Kee Mao I have ever had the displeasure of tasting.  The \"steak\" consisted of ground beef that taco Bell would have blanched at serving.  The noodles were greasy and bland; the vegetables overly steamed and tasteless.  Phat Si Lo?  More like Pad See Ewwwwww!", "author": "Cody P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-08", "description": "I would not have ever visited this place if it wasn't for absolute necessity. I was in the area for a business meeting and did not have my car. The food court which Thai to go located in seemed like a good choice, plus it was one of the few things within walking distance.\n\nThe food court has a good selection of various food. It's got pretty much all the major cuisines. Why I picked Thai to go that day is still a mystery to me. I should've known better when there wasn't even a line during the peak lunch hours. \n\nThe food was really what the deal breaker was. They have a choice of various curry. I ended up trying the yellow n red curry n let me tell you my face was bout to turn red n yellow. The taste was pretty awful. I was not able to eat it because of the strange after taste it had. I also tried their satay chicken on a stick. It had a peanut sauce that was just awful. When I poured it on the chicken it just floated off because of the amount of oil that was i it. Gross! \n\nNot to mention, the staff there was just rushing you out the door as soon as you walk in, trying to rush ur ordering. Is not like they have a long like going. \n\nI ended up wasting ~$10 dollar for a lunch that I couldn't really eat. I was disappointed in the food as well as my overall experience. If you are coming in here for lunch, try something else. There are many choices in here. \n\nNote: nice looking food court with a pretty waterfall in the middle.", "author": "Charlie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-19", "description": "I'm done with this place. I've always been bugged by the huge premium they charge for brown rice -- does it really cost them $1.10 more for a scoop of brown rice?! And they've always been expensive. But my last visit was the closer: got yelled out from a mile away for my order when the line to pay was so long it really didn't matter when I gave them my order, the food was barely warm, and ended up paying $12 for veggie curry with two spring rolls.", "author": "Mathew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "I was really psyched to see that this place serves sustainable meats.  Around downtown, it seems that fast, cheap(er), no ambience places are satisfying, but not terribly environmentally conscious.  \n\nI had the red curry chicken and veggie curry combo over rice.  I liked the flavor - a little sweet, a little spicy, and they have red chili sauce and jalapenos for you to add.  Nothing special, but great for a quick lunch.  The sauce was quite thick and maybe too heavy on the coconut flavor.  Towards the end, the dish started getting a little intolerably glutinous.  They serve pretty large portions, and I ended up uncomfortably full.  But just don't eat your whole dish.", "author": "Pearl L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-29", "description": "YUCK!!! DO NOT GET THE PUMPKIN CURRY!!! It's pumpkin with beef, but it's really like ground beef they roll up and throw in the curry. The pumpkin is undercooked and hard. blah!", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-23", "description": "Pad thai will satisfy a basic craving, and you can get it veggie, with chicken, or with shrimp. If you're a vegetarian they mark up their menu to indicate meatless dishes.\n\nThe last time I came here I had the chicken salad with lime dressing. They were going to put it over rice but I asked them not to, for once craving the greens over the carbs.  They still filled the box up to the top with chicken and lettuce, instead of shafting me with the normal portion size that comes with rice. This was enough food for lunch and a sizable afternoon snack. Not the best thai chicken salad but it's good.\n\nYou can get better thai food pretty much anywhere else, but it's nice to have a to-go version available during the lunch rush.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-11", "description": "I'm surprised to see the Hateraide being dispensed on this place.  I found the staff to be friendly, the portions well sized, and the Yellow Chicken to be just as good as you'd get at any restaurant.  The basic dishes run 7.35 or so and are filling enough for most people.\n\nMuuuch tastier and healthier than Yank Sing to Go.  I'll be back.", "author": "John H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-04", "description": "I was at Rincon center with hubby and felt that Thai craving kickin in,so decided to go for their Veggie curry with rice and some Sweet and sour soup.\n\nBAD IDEA.\n\nThe food was pretty reasonable and portions are filling.The veggie curry was a little bland but tasty nonetheless and I loved my soup with loads of veggies, wholesome goodness makes me happy. What didnt make me happy was the staff. The lady who took our order was the grouchiest lady I have ever seen. As we told her our preference she actually scowled at us! And then as she ladled our food in the to-go-boxes she kept glaring at us. Unnerving as hell. And when my peanut lover husband asked for extra crushed peanuts to go by the side she was so curt !!! And slammed the box shut. I mean WTF? Horrid woman why did you do that?\n\nI liked the food but I cant ever go back there.", "author": "Natasha I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-19", "description": "Every time I walk by I see mountains of food behind those steamed up glass window and that is a turnoff. However, they must be have been either really busy or it's a Friday and the food was actually in decent volumes sitting and waiting to be consumed. So I decided to walk in and pick something spicy in this cooler weather. \n\nThe fish (no description) was firm but the spicy basil Thai chicken was actually very good and decent spicy! Rice was soft, my like as I can eat a lot more. I don't understand why all Asian places like to put cabbage and carrot as a side veggie plate. Maybe it's the cheapest veggie they can put on?! \n\nOverall it's an alright lunch but $9.17 is a bit steep for the fast food.", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-01", "description": "Its just like Chinese take out, but it's Thai-to-go. \n\nThis is your mission if you choose to accept it.\n\nWait for the lines to die down, then walk in, no need to speak anything from your mouth. Head motion is all you need.\n\nPoint to the curry you want. Then they will ask you if you want salad. Nod your head up and down. Good! Then walk to the Caucasian lady near the register and shake your head left to right when she bugs you about a drink. Give her $7 and walk out.\n\nYou did it!!\n\nThat's all you need to know. Don't even need to speak English to them. Once you do, they'll ask you a billion other questions..\n\nEnjoy the curry, but never get the vegetable curry. Too boring and not enough veggies to sacrifice your protein fro your diet", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-20", "description": "Once I claimed this place had the best Thai food in the FiDi. I might still believe this if Thai-to-Go hadn't started putting way too much salt in their food. Once upon a time their panang chicken (with nice pieces of chicken breast and peas and rice) was exceptional. And then one day the sauce was way too salty. After \"the salt episode\" I would check on Thai-to-Go every couple months by requesting samples of panang, but every time it was too salty. What a sad story indeed.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-20", "description": "At 11:00am, my stomach started to grumble and I thought to myself, \"What would satisfy this hunger I feel?\"  For whatever reason, I craved pad thai.  A relatively simple dish - a standard that appears on every Thai restaurant's menu.\n\nSo, I went to Thai-To-Go and ordered a pad thai with chicken.  NOT, I repeat, NOT a blob of congealed goo smothered in tasteless orange-red sauce with cubes of fried tofu and a gathering of shredded cabbage on the side.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-03", "description": "Yuck. Had the chicken ka prow.  It looked like bolognese sauce and was so spicy i could barely eat it.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-04", "description": "When you walk into Thai-To-Go it's a bit deceiving, everything looks and smells really good. There's so many entrees to choose from, it took me a minute to narrow down what I wanted. Maybe I should have taken a few more minutes, because this was the most flavorless Thai food I've ever eaten. I was shocked when I took my first bite of spicy basil chicken and there was no flavor. How is it even possible for SPICY BASIL chicken to be flavorless? The veggies were also completely overcooked and the sauces were just greasy. The total bill was $11 (Brown Rice + 2 Entrees) and it was a complete waste of money. I ended up tossing more than half of it. My friend ordered the Yellow curry and was equally disappointed.", "author": "Krystal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "Red Curry. #9 baby.\n\nGet this and you'll be ok.\n\nOrder anything else and I wash my hands of you.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-25", "description": "Hungry for thai food and in a hurry? Then this place is for you. For any other situation, you probably shouldn't come here. Search for something else on yelp!", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-15", "description": "Before I write this review I should tell you that I'm easy to please. I can eat frozen dinners, and leftovers no prob.\n\nThe food was bad.\n\nThis was the first Pad Thai I had a prob finishing. Before coming here, I thought Pad-Thai was unsinkable. This place had the Titanic Pad-Thai.\n\nI had two side items...the chicken basil was ok, but the smell coming from my plate reeked! Not sure which item gave off the smell. The other item was the lamb. I hardly touched it.\n\nLunch....Almost $13.00.\n\nIf it was $3.00, I'd still have a problem paying for it.\n\nGo to one of the many other food items in the bldg.", "author": "Nick V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-08", "description": "There is something about this place that gives me a food coma for the rest of the afternoon.  I would have to get a large coffee to remain awake.  I've tried both their white and brown rice and the effect is the same.  \n\nMy suggestions is the lamb, though a bit oily.  Their penang curry is probably the best, though I'm not sure how authentic it is.  Sometimes, the staff isn't really listening carefully to what you're requesting and I feel rushed ordering lunch.  You need to be very decisive before hand regardless of whether they have two or twenty people in line.", "author": "H L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-02", "description": "bleh...if you're that desperate for Thai food, go here. I got the yellow chicken curry and it was kind of flavorless and the veggies were undercooked. Hard as rocks.", "author": "Maria K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-11", "description": "If you're desperate for Thai food near work @ the Embarcadero, it's a to-go, I was not satisfied with my lemon chicken. I only taste something sweet. The red curry too wasn't appetizing and I ordered that with veggies with peanut sauce, the Peanut Sauce was good, that's all, har har. The pricing is not decent for the meal, good luck going there.", "author": "Pierre B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-08", "description": "I actually quite like the place. The red curry is nice with the little side of cabbage salad. Good hot sauce too. A little overpriced, but solid. They have an old-school, really slow credit card machine.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "I wasn't expecting much from this place but really felt like eating Thai food when I came to the Rincon Center with a bunch of co-workers.  I wanted something hot, filling, and soup/stew-like so Thai curry it was.\n\nI got the Panang curry (which isn't on the menu, so I panicked a bit) w/ chicken.  The chicken was extremely tender, way more than I expected.  The portion was quite large, esp. for lunch, and the panang curry was just right.  I've had a lot of panang curry in my day, and this lived up and surpassed my expectations.\n\nMy co-worker and I both got this (so 2 panang curry's for about $15 total) and we were both very happy with our decision.\n\nThe menu needs to be updated, but you should just look at what's available on the counter than look at the menu to save time.  Oh, and they have brown rice as an option too (for an extra $1). Not too shabby!", "author": "Naoko M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "I am a Thai to Go VIP. I'll admit that I frequent this place at least once or twice a week. Yup. Maybe I just have spicy, asian craving often or maybe I just like this place! The variety usually sways me toward TTO and away from Yank Sing.\n\nYes, the ladies aren't Miss Congeniality, but the food is pretty damn decent. Good, in fact. For 7 or so bucks, I get a mound of goodness. Rice, veggies and an item of my choice. I like the spicy chicken w/ veggies, chicken pad thai or green curry. I've had the won ton soup, too which was pretty satisfying. \n\nGot a thai craving? Unless you're some thai food expert or super picky, I'd wander over here. I've been to Thailand once or twice but I am no expert, nor am I picky. Listen to me or not. Your choice.", "author": "Deann M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-24", "description": "WORST pad thai I've ever had in my life!  Don't get me wrong, I'm not Thai but I've had enough pad thai and I eat out quite a bit and I think I can tell what's good and not good.  The pad thai was REALLY sour and the noodles were short like they were leftovers and the food wasn't hot and it has a deep orange color to it like spaghetti.  My Thai friend tells me pad thai could be pretty sour with turmeric but a good pad thai should have a good balance of sourness, sweetness and saltiness to it.  I took the food back and told them nicely that it's really sour and the girl who works there said she could change something else for me.  Then, when I went back with my friend who also ordered the pad thai, the lady owner told us this is the way they've been making pad thai for the past twenty years and wouldn't change the food for us.  She said if I wanted something sweeter, I should go to a restaurant for that.  She was not apologetic and wouldn't listen to her customer's suggestions and comments.  She wasn't willing to improve or change.  No wonder her review is so bad, just like what my friend suspected.  Not sure if it's because they're threatened by Osha Express across the street and their quality has gone down and with this kind of attitude and customer service, I don't think their business will last very long.  My friend and I wasted $20 and didn't finish our food.  What a waste of money and food!", "author": "winnie l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-20", "description": "I'm picky about my Thai food, so take that as an initial calibration setting.  The vegetarian curry was reasonably tasty - not overly greasy, nice selection of veggies, nice flavor, and some mild heat.\nThe Panang curry was pretty busted though.  Low-mid grade chicken at best, really really oily, and the flavor was just plain wrong, not to mention too weak.  I was also annoyed that they only had fried rice to accompany (and greasy, kinda nasty fried rice at that), but to their credit that could be because I walked in just as they were about to close.", "author": "Don H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "Thai-to-go is cheap and quick, and the portions are quite large.  Despite my carnivorous status I rather like the vegetarian curry, which has large chunks of stir-fried tofu which tend to be just the right consistency to give the dish a little oomph.  The sweet cabbage-cucumber salad they put on the side is right on, too -- I sometimes wish I could have a whole container of that alone.\n\nI sometimes go to Thai-to-go for lunch for two consecutive days -- a very rare thing in this city of numerous lunch choices.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-18", "description": "its good...for what you pay and the type of \"fast food\" thai place it is. The red curry is good. The thai basil chcken is too. The noodle soup is nothing spectacular..\n\nnice and quick place for lunch.", "author": "cat k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-03", "description": "I've tried this place twice and I like it. You can order from their ready to go buffet or order their daily specials or from the menu. I tried the curried chicken and minced chicken on rice and it was very tasty. They're fairly pricey for lunch, two items on rice, cost me $11 with nothing on the side and no drink. I really miss Cha'am on Kearny street.", "author": "Marc N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-20", "description": "I go for the two-item combo usually.  (Yellow Curry,  Chicken Satay) \n\nVery tasty,  but a little on the expensive side.  Not quite Osha-expensive,  but you'll be paying about ten bucks for your lunch.", "author": "Pete D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-30", "description": "Wasn't amused at all.\n\n2 stars for being quick and trying.\n\nLocated in the Rincon Center between Spear and Mission St.\n\nThey had many options on display..I just was not into it.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-21", "description": "Their Pad Thai is decent, but their Green Curry Chicken should be called Eggplant Green curry.  It mostly has overcooked eggplant (at least I think it was eggplant) in it.  Very disappointing for the green curry chicken.  Chicken was Non-existent.", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-30", "description": "I like how you can get thai food for lunch only after a few minutes of wait here . The enjoyment stops there. As a vegetarian, you only have 2 choices - pad thai (without chicken) or the vegetable curry over rice. They gave you way too much rice and not enough veggie curry in the latter case. The pad thai is just ok. The vegetarian noodle soup with tofu is tolerable on a cold day.The price isn't all that cheap but inline with the hood - almost $8.00 after taxes.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-20", "description": "Good selection of dishes the sauces are really thick but has good flavor. I always get the one item with brown rice it comes to around $9.00, not bad for downtown SF. They don't hold back on the servings either, I usually finish the rice first and have curry and meat & veggies left over. I like the tupperware take-out dish they give you I always give it to a coworker who reuses it so it doesn't go to waste :-)", "author": "Christian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "upgrading to 4 stars due to their incredible salads and attempts at organizing their tiny space for better lunch crowd service.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-25", "description": "Tiny portions, bland food, and over-priced.  Never going back.", "author": "Shin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-07-28", "description": "I wish there were a good Thai restaurant in this area, but this one is not it for me.  I've tried a few veggie entrees and have been disappointed in all of them.  The worst is the very fishy and greasy Pad Thai.  Blecch!", "author": "Andi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-30", "description": "All I've had here is the tom ka gai soup, which they call \"lemongrass chicken soup\" here. It's pretty tasty. Very sweet, but tasty, and if you're at work and NEED to have some tom ka gai soup, where else can you go? Plus it's $3.25 for a bowl.", "author": "Rennie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-13", "description": "Fast service, flexibility with vegetarian options, and close to the office. I usually ask for extra veges or broccoli with the vegetarian pad thai and they are usually accommodating. There is one server, and older woman, who seems to bristle at special requests which causes confusion but I usually avoid her. Otherwise, it's efficient and the guys at the register are friendly so while the food is not great (OK, we all agree Osha Thai is one of the best), it's a convenient To-Go option in the FiDi.", "author": "M.D. L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-01", "description": "Subpar thai food. Ordered the red curry and received a smaller amount of food (for $6 or $7 or however much it cost) than I expected. Was lukewarm since it had been sitting under a lamp for who knows how long. All right if you're in the mood and forced to eat at the Ringcon.", "author": "Reman C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-12", "description": "the first time I went here, it was oookkkk-ish, i got some sort of curry dish and it worked.  Buuut, I just went back yesterday and tried the Chicken soup with noodles and it was really bland and the chicken was all dry, how they managed to make chicken taste dry while suspended in soup, I have no idea.  Maybe they were just rushed, but if you have \"to-go\" in your name you should probably be used to rushing...", "author": "Ian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "Uhm, so yeah - do the Red Curry dish - it is really good.  I also like the Panang Curry, Spicy Chicken with Basil and so on and on.  For the price and convenience - you can't beat it.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-15", "description": "The food is plentiful, but a little expensive.  I like to order the green and yellow combination.  The combination aren't bad but still have the out of the mall feeling.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-16", "description": "If you love Thai cafeteria food you will most definitely love this place. Though, I suspect the prices are about norm one would expect eating lunch during the weekdays in and around the embarcadero area, I believe there are better \"value eats\" adjacent to this place...namely: Lightening Foods. I'm not one who appreciates stingy food servers, but it's apparent that this place qualifies!", "author": "Ted S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-20", "description": "My yellow curry was decent and the serving was big enough for me to finish the other half for dinner.  Also, the containers are a nice touch and all, but they seem to be pretty wasteful unless you take them home and reuse them.", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-30", "description": "Got a quick lunch.  I had the pad thai with chicken.  The portion was pretty decent.  The noodles were a little stiff and wider than I'm used to for pad thai.  This is a basic thai quick lunch bite.", "author": "Ginny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-12", "description": "Hard as it was to do, I had to rouse myself from the food coma I have sunken into after eating here. The yellow chicken curry was amazing! I discovered this place after Robert who sits across from me brought lunch here. Lured by the smells from his cube and a growling tummy I decided to hit the place myself. So good! I think I will be going back here at least once a week,.", "author": "Pooja S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-01", "description": "I went out to lunch with a couple of friends at the Rincon Center's food court; of the many food court options (I specify food court because that establishes a whole different set of expectations), I settled on Thai-to-go and ordered the vegetable phad thai.  The phad thai was average without as many vegetables as I would have liked, but it fulfilled my Thai cravings, at least for the day.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-23", "description": "i go here at least once a week for lunch. i've only had their yellow curry and their pad thai. i enjoy their yellow curry chicken, but their pad thai was sub par. it was lukewarm and kinda mushy and tasteless. sometimes when it gets crowded and there's a long line, it gets rather confusing because you have 3 ladies behind the counter yelling \"next!\" and there seems to be no order. it's also a little on the pricey side - however, everything in the rincoln center food court seems to be expensive. \n\nin all, it satisfies my yellow curry fix once in a while.", "author": "James J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-30", "description": "Super fast service. Pretty good thai food considering the fast-food style and the prices.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-25", "description": "Even though 2 stars seems harsh, the 'Meh I've experienced better' really hits the nail on the head. I got the 2 combo meal with the pad thai and yellow curry for about 9 bucks. The yellow curry was nothing to write home about, and the pad thai was not that great at all. In my extremely amateur opinion, the strength of a Thai restaurant rests on the strength of their Pad Thai. This one fell short. Very short.", "author": "Jenton L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "I have gone out of my way to stop by at this place many times and I must say the food is amazing. \n\nAll chicken is free range and not to mention delicious. The basil chicken is phenomenal and your really haven't lived until you have tried their pad thai. \nPrice is good and portions are large.", "author": "Lilea E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-12", "description": "Ok, not the greatest Thai food I have ever had, but it sure gave me that warm and fuzzy feeling. I got the red curry with chicken over rice. I ate most of it for lunch and then the rest for a afternoon snack. Good thing I love bamboo shoots because there was a lot of them in my container. The sauce is thick and with just a little bit of spice. The only drawback to such a thick sauce is that you go into food coma. I nearly fell asleep at my desk - reminded me of college when in mid-class your head bobbed and you caught yourself asleep for half a second.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-22", "description": "I have always found the staff friendly.  The curry itself is good.  My big complaint is the rice.  It is overcooked to the point of being mush.  On my most recent trip there, I got the food back to my desk and could barely distinguish individual grains of rice it was so mushy. In their defense, some of this may be the result of the hot curry being on top of the rice for 5 minutes on the walk back to my office.", "author": "C A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-21", "description": "Another of the Rincon take-out places--thankfully much better than  Wazwan.  When you're downtown and need to get your Thai fix on for lunch, this is a solid choice.  The set-up is pretty basic--point to what you want and they'll scoop up a healthy portion for you, and at a very reasonable price.  Their pad thai is quite yummy--a little bit dry compared to some others I've had, but with an enticing undercurrent of lime that easily makes up for it.  Their curries are creamy, rich, and flavorful and they don't overcook the veggies so some crunchiness is retained.  Keep an eye out for the salmon dish that they occasionally have out--I don't remember what it's called, but it's well worth ordering on the days when they have it.  For those who like the heat, be sure to pick up a complimentary container of sambal at the register and you'll have all the punch you want.  Then take your food out to the courtyard and grab a seat--you're well-positioned for reading, people-watching, or just soaking up the accompaniment of the pianist du jour while you scarf down your lunch.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-23", "description": "their chicken was dry and their lamb was so gamy it tasted like vomit (i'm not kidding or overexaggerating). never coming back here again. if you're at the rincon center try sorabol, it's a million times better.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-05", "description": "Got into a soup nazi-type situation here today when i tried to order under the 'two dishes with rice' offer and got confused.  i was ordered that i was picking the wrong things and then quickly dismissed for the next customer, not to mention i couldn't understand what ordering instructions she was trying to bark at me.  she must have seen the pissed look on my face and came back to help me.  i defaulted to one dish - the yellow chicken curry.  pretty standard, but good cuts of chicken.  their signs say they use sustainable and free range blah blah blah.  it says it so i guess i have to believe them and so i like that.  goo durable packaging.  got caught late at the office and ended up eating my leftovers for dinner.  not the worst impromptu meal at the office i've ever had.  i want to go back but only when i have time to figure out their system and rules.  not what you want to be encountering on your one moment of peace for the day.  please have patience or better signage.  clena that part up and you are a decent 3*s.", "author": "e w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-20", "description": "i went here for lunch today and received the worst service i have ever had.  when i said i wanted two items, the lady was very mad and said \"you should have told me that before!\" she then handed it to another lady who was just as grumpy and looked very mad at me.  this place is very pricey for what you get- $9 for two items. i'll be looking for another thai lunch place.", "author": "Yummy E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-15", "description": "I've never seen such bad customer service. Terrible. I just got a chicken dish there, and it wasn't fresh. ..I was trying to get something else instead, and the owner of the place was so rude about it. She made a huge scene about it and left me speechless.", "author": "Gaja m."}
