{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "I was enjoying a sunny Saturday up and down Valencia.  I was doing my normal boutique hopping when hunger pangs started hitting.  Fortunately I was in the Mission--so many choices!  I got excited as the prospect of so many taquerias within my reach.  I started to march down Valencia to the nearest taco joint when I walked by a small Vietnamese restaurant.  I looked at the menu posted outside and saw the menu size and prices--small and respectable, respectively.  I peered through the window to see the interior--a Vietnamese family behind the counter, and a small handful of patrons dining in the cramped space.  It was enough to lure me in.  Thanh Tam is a typical Vietnamese restaurant--weathered, lacking in ambiance, but with a healthy waft of Vietnamese food smells hitting you in the face when you walk in.  \n\nI ordered com thit nuong cha gio, and the plate immediately came out hot and freshly dressed (yes, I'm still talking about food).  The portion size was HUGE.  Everything was fresh and just what I expected.  The egg roll had the rice paper wrapper, which is always a huge bonus for me.  I wolfed down the delicious food, but to my surprise, I couldn't clean my plate--there's a fat girl who lives inside me, and if I can't finish a plate, that means it was BIG.  I paid my tab and walked out of Thanh Tam $12 poorer but exponentially happier.  The only bad thing is that this place will undoubtedly continue to distract me from trying the myriad of great tacos in the Mission.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "Place says it's open. \n\nDoor open. \n\nSays open on yelp. \n\nInside, a family is finishing up their meal. \nI sit down and notice that the wait staff and the cooks are sitting down for their lunch/dinner at the table next to mine. \n\nI continue to sit and wait for someone to either take my order or tell me that they're closed. \n\n5 min go by and the only thing I hear from them is their slurping as they eat their soups. \n\nI get up and leave.", "author": "Rusty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Thanh Tam II has $6 bahn mi sandwiches and for that reason I give it 5 stars. (plus they big are freaking delicious too.)\n\nMy friends have eaten the pho and other items and said they were typical and tasty.", "author": "Howie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-24", "description": "Solid Thai place but nothing all that great in my opinion. Came with a party of 8 for a late lunch on a Saturday and was pleasantly surprised that we were seated right away. The service here was overall pretty nice.\n\nMy friend and I split the Spring Rolls, which were alright but tasted kinda bland. There was shrimp and pork in it but I could barely taste anything. The pho here was equally mediocre. The broth was not as flavorful as some other place I've been to, but maybe that's just me be", "author": "Josh B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-21", "description": "I like Thanh Tam II as my hole in the wall place for vegan pho. It's not excellent, but it's not bad, it's just...reasonably priced, OK pho that does the job. It also wasn't exactly the same each time I went, but consistent enough for me.\n\nIt's nice to have a reasonably priced option in SF!", "author": "Christina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "I've been to Thanh Tam twice and had an enjoyable pho experience both times. I love that they have a lot of vegetarian and vegan options. I love their vegan pho! \n\nI didn't have to wait to be seated and the food came out fairly quickly. I will be back!", "author": "Kelly F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "A little Vietnamese joint not far from the Mission BART station that gets insanely busy at lunch.  It's not quite as good as the pho in Little Saigon (I just love Bodega Bistro), but better than a lot of pho outside of Little Saigon.  Great if you're in the hood on a chilly day.\n\nBeef Pho w/ Rare Steak, Beef Ball, Flank: Hit the spot on a rainy winter day!  The large is quite filling with tons of noodles and broth.  I got my reliable trio of meats (since I don't like tripe and tendon).  The beef balls had that satisfying squishiness.  The rare steak wasn't that rare by the time it got to me and was a bit thicker cut than usual, but still tasty.  Wasn't a huge fan of the flank though since it had way more fatty parts than meaty parts.  Broth was on point.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-18", "description": "I've had a lot of Vietnamese food in my lifetime. Like, a lot. So I know what it's like to have THE best. \n\nStopped by this place for the first time with a friend, ordered the beef vermicelli bowl w egg rolls, a fave of mine. \n\nFirst off, it took the waiter forever to come over and ask what we'd wanted to order - didn't let this sway my experience for the negative tho. \n\nGot my bowl and was surprised to see very little meat. Took a couple bites and the meat was so dry it almost tasted and felt like beef jerky. Yikes. \n\nOverall, my experience was just okay. The price was good but I was not impressed by the least. I will not be returning.", "author": "Cody J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "When you're not looking to make it all the way to Oakland or San Jose for some authentic Vietnamese food, Thanh Tam II is a pretty good choice located in the Mission District. I've been a number of times and never needed to wait to be seated since there's ample seating. There's always a few groups eating but takeout is popular as well.\n\nAs for the food, the Bahn Xeo (Vietnamese savory pancake filled with shrimp & bean sprouts and served with lettuce & mint) is delicious and although it's listed under appetizer, it's more than enough food for an entree. The Shrimp & Pork Roll are pretty good as well. \n\nI enjoyed the Grilled Pork Vermicelli w/ Imperial Roll. It does come with a lot of noodles which I couldn't finish. I definitely needed to ask for more fish sauce to soak up the noodles.  \n\nIn terms of the soup, I find them to be a bit lacking. The Pho was decent but didn't have too much variety in terms of the meats (the sliced meat it came with was a bit dry) and the soup also came out room temperature. The Bun Bo Hue looked similar to the pho and was skimpy in terms of what you'd normally expect from the soup. There was no pig's blood as well as all the other meats & veggies that typically come with Bun Bo Hue.\n\nThe staff is friendly.. they speak Vietnamese & Cantonese. There's a t.v. at the front of the restaurant by the cashier so you can likely watch a game if it's on. Street parking in the area is limited so you're better off grabbing an Uber.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-01", "description": "RUDE STAFF - YELLED AT CHILDREN! Our family used to go to this place as much as we could for comfort Vietnamese food in a no frills environment. We went last night with our two young kids (2 & 6), as we sat down, my 2 year old started handing out chopsticks to all of us. In the process, he knocked over the cheap plastic holder for the chopsticks. The waiter was taking an order in the table next door, turned around and started yelling that \"CHILDREN ARE NOT ALLOWED TO PLAY WITH CHOPSTICKS. IT IS AGAINST RESTAURANT POLICY.\" I was so shocked, first of all, when do you have a POLICY not allowing children to play with chopsticks. Secondly, my son was handing over chopsticks to our family, he was not playing. I tried to explain this to the waiter multiple times, and he didn't seem to care. He kept yelling that children are not allowed to use chopsticks in the restaurant. I had enough, picked up my stuff, my two young kids, and walked out, telling him he has lost customers and I will never come back. This is how he responded, \"I don't care. You go, go go, get lost.\" Yes, DISRESPECTFUL MAN, yelling not only at children but a mother who is there in presence of her two kids. Other customers were all shaking their heads and sympathizing with me. Of course, I had a few choice words for him as I walked out, but didn't unleash my wrath because I had to stay as calm as I could in front of my kids. To the workers and owner of the restaurant: I don't care how good or authentic your food is, i am absolutely DISGUSTED by this human who has no decency and does not treat CHILDREN OR WOMEN with respect. NO ONE COMES TO YOUR RESTAURANT TO PUT UP WITH YOUR TERRIBLE BEHAVIOR. You yelled at my kids in front of other customers for something like chopsticks... you are a terrible person. You say your business is good for kids? NO, it's NOT, YOU LIE!\n\nFYI, I have a photo of this guy, once I figure out how I can post photos, I will add it on Yelp for sure.", "author": "Zoey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Legit Viet food at a decent price . Mau is cool Viet spot but not really authentic nor cheap like Vietnamese usually is. Take out the frills and whatever, you're left with some decent food here", "author": "Morethankimchi J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "Decent pho, delicious chicken wings, RUDE service!  Both the waiter and cashier were pills and had a look of disdain on their face.  They both made me feel like I was a burden.  Please get laid!", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Okay I don't know if I've just been getting lucky with this place, but I LOVE it! \n\nHave only had it through delivery twice but it's been so good and flavorful each time. I order the prawn wonton soup with egg noodle and my friend gets the combo beef noodle soup.\n\nBoth of us eat the entire bowl each time haha. Obviously I have no idea how it is to visit in person, but either way I'll keep getting it to go or delivered. \n\nI'm picky when it comes to pho and noodle soup overall and the broth is super yummmm! Crossing my fingers they stay on Doordash and Postmates.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-01", "description": "Went with my friend and was disappointed by the service. Very rude staff.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "This place used to be located in the excelsior district right by the excelsior library and family owned! Growing up, I used to remember walking to this place with my mom to order take out and every time we went inside, it would smell soo good. Then it closed down and we had no idea that it had moved! For the next 10+ years or so, we would often talk about this place and how amazing their broth was and their grilled beef with vermicelli noodles! \n\nOne day, my mom dug up their business card and did a quick Google search and found their new location!!! We knew we had to pay them a visit again. Now for the last few years, kevins noodle house has been my to go favorite. My boyfriend and mom ordered the pho and I ordered spring rolls since I was too full from eating all day. I did try their pho and soup though and it was still as good as I remembered it to be. We asked for beef on the side but they forgot and accidentally put it in with the soup. The owner was nice enough and gave us two extra plates of beef on the side. If youre a fan of kevins, their soup is comparable or even better! This place has a stronger broth taste while kevins has a more clear broth taste. \n\nWill come back again and order my own bowl of pho next time!", "author": "Denise J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Came here as part of my mission to try every Vietnamese place in SF. I probably had been to about 30 before this one, and overall, it was a decent experience. \n\nWe ordered a tofu and mixed veggie plate, beef vermicelli, and rare beef flank pho. The veggies were cooked in a light brown sauce with the Asian style fried tofu I love and the pho was probably the LARGEST bowl I have ever gotten (for less than $9!). However, both dishes lacked a lot of flavor, and I found myself adding more sodium-heavy condiments than I would have liked, in attempts to amp up the flavor. I tried the vermicelli and it also seemed to lack some kick, but overall the portions were generous and reasonably priced. I think I was partially disappointed because several SF guides rate this place's pho in the top 10 or so... but I'm guessing part of that is because of the size to price ratio.", "author": "Quinn Li O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "This place is good for a quick pho fix. The food is satisfying and the service is fast. The reason for the 3 stars is that the flavor just wasn't all there- the soup tasted almost too clean. After adding copious amount of spice to it, it still was just ok. Overall, if you need a quick fix for pho and are in the area- it's a good choice.. but I'll keep looking around the city for some pho.", "author": "Nadia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Wow! This place is delicious. First time eating and ordering off a food app, and I am not disappointed. \n\nI ordered the grilled sliced pork over rice. Weirdly enough the plate I received didn't come with rice - but they must have know I'm on the keto lifestyle! #ThanksForLookingOut\n\nCan't wait to order from this place again. \n\np.s the food was still warm when it arrived #6stars for that!", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "I've been here twice recently, once (#1) for a dine-in dinner and once (#2) for take-out. The first was a 4.5 experience, the other was 3.5, thus the 4-star average you see here. \n\n#1: After a wonderful afternoon of tennis + beers in Dolores Park, took my tennis partner to Thanh Tam for authentic Viet dishes. The restaurant is cozy, with cool lighting and a welcoming atmosphere. Service was quick and friendly. After much deliberation (everything looks so good), decided on sesame beef and shrimp over rice, as well as bbq pork and egg roll over vermicelli (bun). Both dishes  had pretty good portion and lots of flavor. Not much in the spice department, but no worries: chili sauce in ketchup bottles in close reach! Also 100% asked for jalapeños on the side, which were soon provided. We ended up quite satisfied with our dishes. I would give that experience a 4.5, but that could have been influenced by the pleasure of my company :)\n\n#2: I was on the BART back from work (Alameda by way of Fruitvale) and suddenly had a major craving for banh mi. Nothing else could have satiated this desire, so I called Thanh Tam as soon as I hit my station, and ordered the banh mi with everything (pickled carrots and daikon, cilantro, jalapeños, mayo, soy sauce, onions) minus cucumber. I didn't really pick up the onion or soy sauce, but the meat was decent and the sandwich was ultimately enjoyable. However, their $10 minimum was unexpected / not pleasantly stated to me, and the walk home / back / home was less than savory. With that said, at $6.47 after tax, I could see myself warming up to the idea of take-out banh mi from here in the future.\n\nAll in all, a wonderful family-run restaurant with a very local vibe, as opposed to some of the other 'trendy' Viet restaurants in the Mission. Check it out!", "author": "Anish T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-06", "description": "Thanh Tam II is a solid, but un-extraordinary place for pho and Vietnamese food in the Mission. \n\nIt's a bit small and easy to miss, the service is quick and straightforward, and the prices are pretty standard. I've had the Bun Bo Hue and Chicken Pho, and both were exactly what I expected--good, but nothing special. \n\nBe mindful of their $10 credit card minimum. Most main dishes are $9 plus so with tax, you should be good :) I'm still on the hunt for the best Vietnamese joint in the Mission, so will be trying Mau and Sunflower next!", "author": "Tim X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "siiiiiiick viet place. After trying out 2 other bars to watch the warriors game we quietly slipped into a center table at Thanh Tam II. My friend got this fish cakes stir fry (which was amazingly crispy and good), and I got one of those crispy egg noodles with shrimp and chicken and beef which I've been craving for a minute.\n\nCheck it out tho.", "author": "Willy X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "It really bothers me to see all these poor reviews of this restaurant. This place consistently delivers excellent Vietnamese food every single time. I've tried so many Vietnamese restaurants in the city and this one is my favorite and thankfully they're just a couple blocks down from where I live. Their 5  spice chicken is to die for!  At other  restaurants, five spice chicken is super oily and is fried but not here. It's amazing, I believe it's grilled.  Their chicken Pho is so flavorful and everything I've tried on the menu has been excellent.\nHands down this is one of my favorite restaurants  in SF, I come here about once a week.", "author": "Reena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Great little spot to satisfy my pho cravings. I had the Pho Tai large which was a bit smaller than I was expecting (for the price) but plenty to fill me up. Would have been happier with a little more broth. The flavors were spot on and all the normal accompaniments were fresh and plentiful. Will definitely come back to try other combos!", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I found a hidden Vietnamese spot in the mission for some delicious pan fried mix vegetables noodles. I devoured the the plate.", "author": "rob a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Great food! My friend and I didn't know what to expect at the beginning, because the door doesn't have a great sign, only the menu; coming in we didn't see the place crowed, as usually what are considered \"good places are\" (maybe because the time of the day?) but I can say it was great!! It brought us back to Asia. \nThe fried rolls are awesome (the sweet sauce is the best).\nWanton soup was really tasty, fried rice as well. \nI will definitely go back!", "author": "Bella C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "Perfect for cold nights! The pho was extremely satisfying when we were freezing our butts off outside. It's quiet, warm, and service is very fast.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "You can still get a sit down meal for $10! At Than Tam II the portions are extremely generous, very diverse and brought to you super fast. Ideal location for a pretty fresh, very affordable and no fuss kind of meal. \n\nWhile most of San Francisco is waiting in line for a trendy restaurant or grabbing another burrito, mix it up and join the locals in the neighborhood for a basic but also very practical Vietnamese meal. \n\nThe decor is a little weird (it's perpetually Christmas?) but this place is a step up from a straight up hole in the wall. It's also one of the few places I've seen lots of people eating alone. \n\nMost people are ordering vermicelli noodle bowls or the pho. Both quite good. I also usually get a clay pot fish, which is very peppery but compliments the fresh noodle bowl nicely. \n\nThey do delivery at dinner time for orders of $20 and above - haven't tried that option myself but I'm guessing you can get a truckload of food for that price point!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Good value for this small Vietnamese joint in the Mission. Stopped by on a Tuesday afternoon at 4pm as all other pho places were closed (I didn't realize until now that they usually close at 3 or 4 and then open again at 5pm). \n\nThe items on the menu were mostly Vietnamese dishes (rice, vermicelli, noodles, pho) but also Chinese (chow mein). I guess they're trying to cater to the mixed crowd around 17th and Valencia. \n\nPrices were okay-ish (although they offer some starters for $10) - the pho was $9, and vermicelli vegetable dish $10. I liked the portion size which was generous, hence thumbs up for the value.\n\nWould go back if in the Mission during odd hours.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "Although decent for dining in, I can't recommend it for takeout. Portions were meager with my $13 entree, which was principally rice and left me still hungry.", "author": "JayBee L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-30", "description": "It is the worst food I never had to tasted in my life, order the wonton soup this is sooooo disgusting tastes old and ugly sap...I never ever in my life I would order food from this place anymore...", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "This place is really good and consistent. A great go-to for a quick no-frills quality bite.", "author": "N. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "Well, it's a pho option on Valencia in the mission, i'll give it that. The decor is pretty nice as well; definitely not like some of the more hole-in-the-wall places in the tenderloin. It's also open on Sunday, which was convenient.\n\nThe downside of a place like this is that the prices are a little higher than places in less nice areas, like Evergreen or farther places in the tenderloin / chinatown. \n\nI picked up a combo pho here, and the broth was flavorful but more sweet than I was expecting. There was a good variety of beef parts, not just beef slices but also tripe and beef balls as well. Overall, great for a quick fix if you're close to valencia, but not really not worth making a trip for.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Amazing prawn noodle soup and the spicy lemongrass chicken ...and extremely fresh food ...", "author": "Abhilasha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-07", "description": "The food is awesome! But the customer service sucks!!!!! My coworkers eat here often i keep trying to give em a chance. And every time i do it's bad  the host he is soooo rude. Anytime we go we can sit anywhere in the shoebox. But this time he argued us down squeezing us at a 2 person table when we had others joining us!!!! Mind you it was only 1 other person in the restaurant", "author": "Oodles W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Love this pho place in the Mission! It's clean, friendly and good food. Can't get much better than that for a Vietnamese restaurant!", "author": "Vanessa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Came here with a group of friends and we all loved it. We were all craving pho and this was a very solid pho place. Highly recommend. Most of us opted for the house special pho which comes with an assortment of meat. The large is quite large, but finishable. Food came out quite fast as well.", "author": "Vinny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "I was starving and walking down Valencia and found this spot.\n\nI walked in and to the back to place a to go order takeout. They provided me with a menu and my order came out pretty quickly. Everyone else was sitting at small tables in this narrow space.\n\nI got the seafood noodle soup which was really good. It came in a plastic to go container. The broth was separate from the seafood and vegetables so I could mix them together when I got home. Yum!", "author": "Rawlins R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-20", "description": "The pho here is so so. Soup base is not that good. Catfish in claypot was gross. Overly salty and just not the caramelized flavor I was looking for.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-10", "description": "Nope. Sunflower is much better and with better service ( and now more space!) (had the veggie pho). Also, I recently checked out Mao and while it looks \"less authentic\" seems more solid with quality of meat/produce used (had the beef pho + extra veg).", "author": "Vicki T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-15", "description": "I was in the mood for some Vietnamese food earlier this afternoon and Mau, Cha-Ya, and Sunflower were all closed. I've passed Than Tam 2 many times but had never ventured in to try it until today.\n\nOrdered the Vermicelli Noodle dish w/ Pork and an Imperial Roll and a Longan drink. \n\nThe bowl came with ~10 thin pieces of pork over a heaping mound of vermicelli, with cucumber underneath and shredded carrot and peanuts on top. The pork was very greasy and unappealing, the whole dish was a chore to eat.\n\nThe Longan drink was obviously from a can of the fruit in syrup, with maybe a little water added. Very sweet and generic tasting.\n\nIt was pretty disappointing to specifically want some fresh-tasting, nourishing food, and walk out feeling tired with acid reflux. Won't be back.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-13", "description": "Thanh Tam II is a decent place for pho. I would recommend against getting the dry chicken noodles--weirdly flavored and too much peanut. The soups are better. I've definitely had better spring rolls too but it's not bad for the price. Also conveniently located with fairly quick service. The set up is a little tight and they don't want customers sitting too close to the door.", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "In another neighborhood, I'd give this place three stars, but most of the other dives in the Mission are so good that this level doesn't cut it. Food was fast but the beef in the vermicelli noodle bowl was tough and a little weird. Pork fried rice was greasy.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "The menu is extensive for authentic Vietnamese food. Friendly for first-time Vietnamese food-eaters with pictures on the menu that are accurate. I got the spring rolls as an appetizer which were very good. \n\nI've been craving pho for a while so I had the rare beef pho with added meatballs. The broth was decent but there was little meat and vegetables. Still pretty solid meal that satiated a good traditional Vietnamese pho with friendly and fast service!", "author": "Faith L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-24", "description": "In a nut shell: quick service, affordable, and plenty of options. Food was just greasy but still had some flavor. Would like to check out other places first.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-28", "description": "As recent tradition goes, my mom and I get pho together once or twice a month and chat about work / life / family / etc. On this Friday evening, we were attending an arts and improv night at church, which was a refreshing change up to the booziness and general debauchery I usually put myself through on Friday nights. So we stopped in at Thanh Tam II on Valencia as it's super close to our church. \n\nI've only dined at Thanh Tam II once, way back in the day, and I didn't really remember how cramped it is, but now I've noted this. We walked in to the restaurant to the shrill voice of a woman loudly and rapidly speaking Vietnamese, guessed at a place to sit, and began to browse the menu. \n\nI chose Thanh Tam out of the other locations in the area because I remembered that they have the option of thick noodles in their pho. Unfortunately, the only flat noodles they had were \"old\", per our waiter, and so they weren't an option. Why would you have old noodles? Just throw them away if that's the case, or, as a popular Mission restaurant, be stocked with the ingredients to one of your main dishes.\n\nMy mom, always the optomist, ordered a tofu salad and raved about it for the rest of the night. I got the Rare Steak Pho which was bland and had to be drowned with Sriracha, the jalapenos that were served alongside were old, or had been cut the previous day and were drying out and whiteish. When I went to use the restroom, I noticed all the Imperial rolls waiting on a tray to be fried, right next to the restroom, um, okay, yea, that seems sanitary. \n\nFinally, when our bill came, we noticed that the total was hiked up from what should have been $17.89, to $24.95. So I had to show our waiter and the shrill woman from earlier the error, which was corrected. Mistakes happen, I get it, but this was just such an unejoyable experience all around, I will surely not be bringing my dear mom, or our business back anytime soon.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "One of the better Vietnamese restaurants in the city.  Fast service, no wait on a Saturday evening, and yummy food!\n\nWe ordered:\n\nimperial rolls - which came with more pickled veggies than other places.  good crisp and flavor.\n\nfried rice with shrimp - not too greasy, good flavor\n\npho - average, broth could be more flavorful\n\ntofu salad - our favorite dish that we ordered, such a nice light and fresh tasting dish with mint and basil and grilled tofu\n\nNot sure why this place doesn't have a higher rating!  Also looked like they have free delivery, so we definitely know what we're ordering next time.", "author": "Janel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "This place is awesome! Definitely the best Vietnamese food I have tried in San Francisco. \nThe Shaken Beef and Vietnamese pancakes are a must! Shout out to Johnny and his warm and pleasant character that made us feel like home.", "author": "Boban V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-03", "description": "On a stretch of Valencia where you can have pretty much any kind of food you want - hipster tacos, working-class Mexican, upscale French - this little, unassuming Vietnamese spot just doesn't stand a chance of staying in anyone's culinary memory. With Little Saigon just one BART station away, I would be hard pressed to make a return visit here based on what I tried on a lonely weeknight when I was perusing their fairly robust menu on a relatively busy evening. When hamstrung by indecision, I tend to go for the predictable and ordered the $6.75 Goi Cuon (Spring & Pork Rolls) (photo: http://bit.ly/1kli8ke).\n\nIt wasn't terrible but it wasn't very fresh-tasting either. The peanut sauce was its only saving grace. For my main dish, I went for the $9.95 large bowl of Pho Dac Biet (Special Combination Beef Noodle Soup) (photo: http://bit.ly/1huzzic). It contained all the right ingredients - the beef balls, the flank steak, even the tripe - but it was done in by the watery broth which didn't sustain any of the meaty flavor. Like ramen, pho is an artfully satisfying soup when properly executed, but when prepared with indifference, well, you can almost taste the shrug in every slurp. I'm sorry to say that the service matched the quality of the pho. Just not a memorable meal here.\n\nFOOD - 2 stars...spring rolls taste flat but nothing compared to the pho\nAMBIANCE - 2.5 stars...nothing too memorable about the space\nSERVICE - 2.5 stars...nothing wrong with the speed but a sense of ennui surfaced\nTOTAL - 2 stars...packing my bags and leaving for Little Saigon", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "There are no places to eat pho in the Castro District so this was the default choice of restaurant that is walking distance. When my friend and I entered the restaurant, we were directed to sit at a table that had not been cleaned after the last customers. Luckily there were only dirty cups (and not half-eaten food) but that was super unwelcoming.\n\nThe waiter was quick to take our order and bring our food, but the food itself was mediocre. We ordered spring rolls and pho in beef broth. The spring rolls looked fine, but I can't put my finger on what was wrong with them. Maybe it was the dryness or the rubbery texture of the skin that did not taste fresh. The peanut sauce tasted starchy too.\n\nThe beef broth tasted artificial and I realized that maybe I should have tried the chicken broth instead. They actually give you a LOT of noodles and meat for a small size order, so that's the only awesome part of this restaurant. The beef was incredibly dry which made it difficult to eat. By the end, I was full but not satisfied. \n\nWe had to flag down our waiter to get the bill and as soon as that was done, I made a dash for the door. I might come back because it's so close and open relatively late, but I'm better off traveling in the other direction towards the Sunset District.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-07", "description": "If I could I would give this place 3.5 stars. I am rounding down to a 3 mainly because of service. Our waiter was very indifferent and ignored me several times when I tried to flag him down. I had to wait for 20 minutes to get him over to take our order and to ask us what we wanted to drink. I think that's an excessive amount of time to wait before the waiter comes over to introduce himself. I order the spring shrimp rolls and the combination soup with chicken broth. The shrimp rolls were good. The combination soup wasn't anything special, but not too terrible either. I wouldn't come back here because of the terrible service. I am usually quite lax and don't mind if the service is not the most hospitable, as long as they are decently quick and don't ignore me when I try to place my order and have to keep my arm in the air for 15 minutes.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "Now that Sunflower's closed, where oh where will we get our hole-in-the-wall Vietnamese food?\n\nWhat about right across the street?\n\nThanh Tam II is the epitome of hole-in-the-wall, right down to the dudes mixing condiments in the dining area and the torn up upholstery. Beef bowls are more lettuce than meat and it's not particularly fresh. Still, it works in a pinch.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Thanh tam is the restaurant I miss the most in SF. Going to get spicy lemon grass tofu for looking is one of my fondest memories. The space is small and the same 4 guys are always working. The food is garlicky and amazing.", "author": "Hendrix J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "I have been looking for a Vietnamese place that uses the proper rice wrap for imperial rolls for 15 years! I have been sorely disappointed everytime. SF, The Peninsula, East Bay, everywhere I looked just to be saddened once again. I never thought I would find a place comparable to Tu Lan. I had pretty much given up! Boy, was I WRONG.\n\nFrom the appetizers to the Pho nothing disappointed. Service was excellent! Calm atmosphere. I am ashamed that I must've passed by here a MILLION times in my hunt for food and NEVER saw it!\n\nI spent so much of my 20's in this area drinking and carousing within the immediate vicinity and never knew what I was MISSING! Never again. My hats off to you Than Tam II. I now have 2 staple Vietnamese restaurants to go to depending on which I am closest to.\n\nI am sick and asked the girl on the phone which soup would be best. I liked the hot spicy beef. She said a seafood combination is good too and that she could make it spicy. She even asked if I wanted some fresh squeezed OJ! I said yes and a ginger ale too. \n\nShe almost didn't take my order for delivery because they are cash only usually. She made an exception for me. Thank you! She was so very sweet that she included a NOTE iside saying Feel Better with a smiley face! Awwww.... They win my business hands down. Way to go the extra mile for a sick girl. I LOVE you guys!", "author": "Stella T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-19", "description": "Ordered for pick up once and the food was decent. Decided to order delivery today. Apparently it is $25 min and cash only for delivery, which it doesn't say anywhere on their website. Instead of saying it nicely, the person I talked to on the phone started berating me for not ordering $25 worth of food. It's alright, I think I'll pass on this place in the future.", "author": "Kassi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "This is my go-to vietnamese when i'm in the mood for cheap and cheerful (inexpensive food that makes you feel good). I haven't tried everything, but I always get Imperial rolls (nom nom nom) and pho. I know Mau is right down the street, but if you're looking for something well priced, huge portions and no line, Thanh Tam is for you. \n\nAlso they give you fortune cookies after, so there's that.", "author": "S W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Just ate here last night, and I think its the best vermicelli bowl I've every had. We ordered the lemon grass chicken vermicelli. The veggies were slightly cooked, so still a little crunch which I like.  Great taste and ample portion. Also, excellent spring rolls. The place is very authentic--looks like family run Vietnamese. Simple decor and clean.  Our new favorite place to go for very tasty and affordable Vietnamese food.  We had almost gone to another Vietnamese place down the street, but saw that it was trendy and run by non-Vietnamese. Didn't look authentic like this place.  \n\nWas glad the TV wasn't on!  (especially since I didn't have my \"TV Be-gone\" device!)", "author": "Linda n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-12", "description": "The waiter should be given the rudest server award.  He wouldn't accept my order as requested despite citing food allergies, the accommodation was not out of this world and all other restaurants do accommodate me. I am never ever coming to this place.", "author": "Malena P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Unbelievable! Mother's Day lunch with my soon-to-be mother fiancé... When in the Mission we usually go to Mau. However, we opted to try Thanh Tam 2. What a mistake! \n\nWhen we entered, we decided to sit at a four top because it would be less cramped for my pregnant fiancé. Since it wasn't busy and all four tops were available. Right when we sat down the \"Pho Nazi\", the man working scolded us \"NO!\" and moved us to a two top. We reviewed the menus that were already placed on tables and we're ready to order. He was behind the counter and payed us no attention. The woman working with him was kind enough to bring us water but spoke no English so we had to wait for the man to order. 10 plus minutes later... Still no service; HORRIBLE!\n\nI can't remember last time I got up in a restaurant and left. I'm usually pretty tolerant.  But when you're with a hungry pregnant woman on Mother's Day... this did it. We left. He said nothing, no apologies. \n\nOh well, wouldn't recommend based solely on service and would never try again.  We're sticking to Mau. \n\nHappy Mother's Day to all the Moms out there!", "author": "Jason T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "This little gem is my favorite vietnamese spot in the Mission. Everything on the menu is less than $12 and the food is solid! I enjoy eating various dishes from their Rice Plate menu and also their delicious wonton noodle soup with egg noodles (my fave!). \n\nOverall a very satisfying and easy choice if you're in the mood for a quick and affordable bite! Also, they are vegetarian friendly!", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Stumbled upon this place randomly and glad I did because the Pho Tai is so delicious. Perfectly done! I'm so picky when it comes to Pho Tai and constantly have to lower my expectations because there's so many variations but generally this is what it should taste like if done right. Service is very bad because there's only one person waiting on tables but I guess that's the trade off. Poor service for delicious pho broth.", "author": "Briget P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Deliciousness. One of my favorite vermicelli craving spots\nFresh, tasty and you dont have to wait long", "author": "Sherry B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "My boyfriend has always been a usual, but he put me onto this place for our \"anniversary\" lol. Now months later, everyone knows me better. Everyone you come with will be happy.", "author": "Tattiana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Came in here for lunch and ordered a big fat bowl of Pho Tai Sach which was the rare steak and beef tripe pho. $11.50 for the whole thing. It's huge and tasted really good.", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "The Best Pho in SF! Been going here for years... Chicken is bomb fried rice is bomb. Everything is pretty darn good here. You won't be disappointed.", "author": "Rox N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-08", "description": "This review was for a couple weeks back. If I had yelp like I typically do to find a good spot to eat, I wouldn't have ended up here. However, a bunch of us hungover ladies were desperately in need for a cure and left it up to my lovely sissy to pick and she did the executive decision by choosing the closest pho place to us. Which sadly happened to be this one. Although.... when we were done with this place and walked a few doors down... there was an elegant pho restaurant called Mau that looked clean and inviting (yes, I was pissed). lol anyways, this place sucks. Really sucks. The pho is overly salty and it doesn't come with the usual garnishes: no basils! Only bean sprouts. Wth. The only plus was it came with a good amount of meat. My best friend got the bun bo hue, which is typically spicy, but stated there was zero spice + there was a hair in her soup! Also, I don't know if y'all feel weirded out by this, but they keep glasses of water pre-filled in the fridge. So when you come, they just grab one and serve it to you. Just the idea of fridge air all accumulated in my cup of water gives me a gaggy feel, especially with no ice. This restaurant feels really unsanitary, un-tasty, and unsatisfying to me. I wouldn't come back. Ever!", "author": "Kath N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "This is my favorite Vietnamese restaurant . I have been coming here with my family for years and have always received excellent service.", "author": "Jacqueline M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "If I have to rate Thanh Tam II against its cohort in the city then maybe its a 3 but to compare it to the likes of the South bay or Orange County, this place deserve no more than a 1.   \n\nAfter going through process of elimination based on proximity, yelp rating and previous experience, my colleagues and I narrow our list to Mau and Thanh Tam II.   \n\nWe end up opting for Thanh Tam II because it looks like a hole in a wall so we assumed that it would be more authentic. This could be it I thought to myself, no longer will I have to venture out to the south bay to satisfy my craving for pho. \n\nI was wrong. \n \nIf one was to google pho, they will quickly come to the conclusion that it is a noodle soup with a beef broth. Emphasis on beef. That was clearly not the case with the Pho at Thanh Tam II. Not only was it lackluster in proportion of the round tip slice but the there was only a hint of beef in the broth for a soup known as \"Beef noodle soup\". \n\nI definitely do not recommend this place for pho. Stay clear.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Pretty decent pho. It's expensive, but hey, you're in the Mission. If you want something different than burritos you gotta pay up, right? Usually they're pretty consistent, but the last time I went there, the broth wasn't flavorful enough.. it was kinda watery :( \n\nI'll still go back like every weekend though.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "Transported! \n\nLast night my friend and I were transported to Vietnam. I have been craving good pho for so long that I forgot I was craving it. When I sat to review the menu, I was eyeing some more delectable dinner entrees, but in the end I decided on the beef combination pho. Lawd help me! It was perfect. The broth was perfect, everything tasted amazing. \n\nThe quail we started with? Perfectly fried. I always feel like a happy heathen eating small birds and then discarding a pile of bones onto my plate. These made me happy yesterday. So much yum.\n\nIt's funny, we were walking to Mau, of which I'm only a somewhat fan, when my friend said \"Let's go here.\" It was another happy accident, and now I have a home for pho this winter in my neighborhood.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "I can never get enough Pho....when i need my fix this is my go to.\nI love how quick the service is. Cheap eats.\nThe broth for the seafood soup is just right, more noodles than toppings and seafood which is the only draw back.\nI always get either a soup, fried rolls or vermicelli. Never ventured out but those dishes work.\nThey've changed the layout a bit, so now they have new menus and pcitures up so you can see the plates.\nIt's a small space, so when they make fried food-you leave stinky.", "author": "francis c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "This place is legit. I've come here on multiple occasions with friends. It's the best place to come to when you can't think of anywhere to go, or know exactly what you want to eat, but it'll  def. hit the spot.\n\nIt's likely that you've walked by this place on Valencia hundreds of times but never even knew it existed. That was the case for me. Once you step inside, it's seriously like you're in your Vietnamese best friend's parent's house. It's most def. a mom and pop type place.\n\nEvery time I come here I get the sliced BBQ pork, with fried rice, and fried egg. So good. Never fails. The pho and string beans are good here too. Service is pretty quick. All in all, for what you pay, and the satisfaction of the food, I'd say this place is a keeper in my rotation of go-to restaurants on the fly.", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "One of the more authentic Vietnamese restaurants in the bay area. The beef broth is quite tasty and service is quick. Would like to see numbered menu items for efficiency in ordering. Overall I'm satisfied with this restaurant and will probably be back!", "author": "Jonathan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "This is a very decent Vietnamese restaurant.  The service is good, you just have to be agressive about it. If you want to order politely wave. I saw some over privileged bros get offended for their lack of service but they were so rude!\n\nThe hot and sour soup was so good! I recommend getting a side of noodles or rice with it because it doesn't come with it. \n\nThe sandwhiches were not the best. My bf ordered the chicken and pork while I got the tofu. The tofu sandwich was plain and not well seasoned. The bread tasted sour. I'd stick to their phos and bbq plates of I were you.", "author": "Julia Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "I've gone here for lunch and dinner and both are really delicious and the best price for a lot of food on Velencia. It's an intimate space and can get pretty crowded on the weekends for dinner, but that's pretty typical for anywhere on Velencia. The wait staff is attentive and the food comes out fast, but you don't feel rushed while you're in there.\n\nWhat I like about this place is that you can tell it hasn't changed much. It's not giving into all of the yuppies that have bought up all of the property around it and it continues to have customers flowing into it. They haven't raised their prices so people who live in the area can still afford it and they've kept their dishes authentic. I've had their Ga Xao Dau Que (chicken with green beans) and a tofu bowl from their lunch menu, and both were really satisfying in flavor and portion.\n\nDefinitely go here and support the local restaurants!", "author": "Jacqui A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-08", "description": "Quick service, lots of vegetarian options.  I tried the vermicelli and vegetable chow fun dishes.  I wish they had hot oil--that would make the dishes scream with flavor!", "author": "Aeon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "Another restaurant that my company catered lunch from. \n\nWe had some vietnamese sandwiches, as well as tofu vegetable noodle soup.\n\nThe noodle soup was pretty yummy. I like how they separated the soup from the noodles and ingredients so that by the time it was delivered, the ingredients and noodles were still fresh instead of soggy from being in the soup. \n\nThe bahn mi was pretty good too, although it lacked some seasoning, which could be easily fixed with some hot sauce :)\n\nOverall a decent meal!", "author": "Christina N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "After a bad experience with delivery, no longer going to patronize this restaurant.  I prefer the Vietnamese restaurants on Irving over this place.", "author": "michele g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-19", "description": "I'd rather pay a few more bucks and go to Mau. The food here isn't bad, but significantly less satisfying in terms of flavor and quality of food. \n\nSpring rolls (2 stars): dry. \n\nGrilled pork and egg roll over rice (4 stars): this was the best thing we had. Good pork, but wish we had more of it. Egg roll was good albeit very greasy. \n\nCombination pho (2 stars): the broth was soooo bland. I had to put half a bottle of sriracha. Compared to Mau's ginger chicken broth, this was as if they just washed the chicken with the water. Yuck. Avoid!! \n\nI used to really like this place, but after getting spoiled by Mau I can't go back here. Disappointing.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "This place serves basic Vietnamese staples: pho (which they list as \"broth\"), bbq pork over rice (which comes with a nice fresh salad of cucumbers, carrots, lettuce & cilantro), classic imperial rolls. I opted for the imperial rolls (which they call \"egg rolls)5 over vermicelli & sprouts. The rolls were great, but the fish sauce was weak--like watery. The salad needed more cilantro. Fortunately, they had sriracha chili sauce to brighten it up. The service is kinda lax, waiters pretty much ignore you. I ptefer Tu Lan on 6th & Market, but if you're in the Mission & you want a quick, affordable lunch, this is your spot.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "One of the best delivery food spots EVER. Inexpensive, delicious, reliable, and fast. Their Vietnamese veggie pancake is amazing. Enjoy!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "My wife is Vietnamese-American and this is the only place in SF that we can go to get authentic Vietnamese. Their pho, banh xeo, imperial rolls, rice plates - everything on the fantastic. Service is good and food is always ready fast, and never expensive.", "author": "Adam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Had BBQ pork vermicelli and fresh spring rolls. Pretty decent food overall and at a good price. We did delivery and it was delivered pretty fast!\n\nWill probably order here again!", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "The place was nearly full but they seated me right away. They were quick to wait on and check up on me. The vermicelli bowl with pork and egg roll was very good and very affordable.", "author": "Cotter R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-02", "description": "Went here for some pho and decided to get the combination pho (large) and bbq pork and shrimp noodles. The latter was kind of what you expected, nothing special and was fine. However, the pho was definitely disappointing. The bowl was big, but there wasn't much content in it. There wasn't a lot of meat, and it was chunky and not thinly sliced. The tripe was impossible to find since it was smaller than the noodles. The broth also seemed to be extremely diluted. Probably will not come back here for pho at least.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "My New favorite Thai food place in San Fran. Can't believe I've never seen this place before. Their broccoli and shrimp with garlic sauce is out rages yummy. Deep fried egg rolls are the bomb. Family owned and run. Authentic and delicious!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "For when you need tripe in your pho! Look, this place isn't great but they are serving up solid food. Sure, there are better places, but if you are locked in the mission and need more authentic and less americanized, this is your place. It wins by default. Service is spotty. \n\nMau is too hipstery. Jasmine Garden's new revamped menu is too simple. Thanh Tam is the place for all those cold weather cravings. Nothing spectacular but certainly fits the bill.", "author": "William V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-01", "description": "With a legit Vietnamese restaurant a block away one would think they'd step up their game, but their take out service leaves much to be desired. If rice is a must, add it as a side and go a la cart for an additional dollar - I felt robbed looking at my 60% rice 40% tofu curry entree. Or bring Tupperware for them to put that rice in?? Hmmm\n\nTheir imperial rolls are still reliable!", "author": "eVa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Fresh veggies, tasty and refreshing. Will have to come back and try their sandwiches and noodle soups", "author": "tomohisa w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Great spring rolls! Not overly packed with vermicelli noodles like some places. Sesame beef and brown rice plate is my go-to order. Not super fatty meat. Great with fish sauce. Favorite (not overpriced), authentic Vietnamese food spot in the Mission!", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-07", "description": "Worst service ever. Went today for lunch around 1:30 (2/7/15) with my partner. The moment we entered the restaurant, there was no greeting, no smile - just a grunting noise and finger pointing to a table from an older guy sitting at a table cutting basil leaves and TRANSFIXED to the TV. \n\nThe restaurant wasn't even busy - only four tables were filled. We waited and waited and waited for a good eight minutes before we got any acknowledgement from the \"server\" who was also transfixed to the TV (there was an awful, cheesy Nick Nolte movie on). Our supposed server never said hello, never cracked a smile, didn't utter a single word to us. He solely took our food order and quickly went back to watching TV. He didn't even ask us if we needed something to drink! \n\nWhile the food was decent (we got tofu and mixed veggies, fried rice with fried eggs), the vibe was so weird. This is a family run restaurant where the family members would rather watch TV than acknowledge and provide service to customers. We were confused on whether to pay at the table or up front even though the check was dropped at the table. Do they even know what a smile is??? Are they mute? Is Nick Nolte more important than paying customers? \n\nNever going back. Note to the restaurant from someone who manages one, learn steps of service! It's apparent profits are declining here as many patrons are heading to Mau (which is my go to spot for Vietnamese food in the Mission). In the ever changing restaurant business, especially in the Mission, competition is fierce and Thanh Tham II isn't cutting it!!! PASS! And..TURN OFF THE DAMN TV!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-11", "description": "Pho-CK this place! I seriously considered walking out shortly after the meal was served; but held out on a hope and a dream that some part of the dining experience here would/could be salvaged. -- 2 stars for mediocre Vietnamese in the area (+1) and (+1) inexpensive prices. \n\nMinus stars because service would benefit greatly from better communication tactics.\n\nThe three bean drink is SALTY AF (-1) if something is sent back, listen to the reason why, ask whether customer wants a replacement or a write off the check, and communicate it to the cook.  To the cook (-1): don't send passive aggressive parting shots as the customer is settling up. I cannot stress enough how salty BOTH iterations were --there is still a burn in my mouth from where the liquid from the two sips (one from each drink) sat in my mouth. \n\nAlso was pretty miffed that server did not allow us to sit at the end of a larger table, and away from the door as specifically requested (-1)-- and mere minutes later (before being served water) a group of two gets seated at near the front. I've been here plenty of times where larger tables had to be shared. \n\nI will not return anytime soon, and will speak poorly of it to my associates.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "This place is great! It's been a MIssion institution since the early 90s. I've gone to so many Vietnamese restaurants in SF just trying to find some really good Pho (of which there are a few). Thanh Tam II is definitely in my top 3. \n\n* Great service\n* Great food\n* Great atmosphere\n\nI will continue to go back! :)", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "The food is mediocre and the service sucks. The girl who sits up at the register is a classic example of someone who is way hotter in her head than she is in real life. I've been to this restaurant a few times now (not going back!) and she couldn't be less happy to be there - I'd feel sorry for her if she weren't such a jerk.\n\nThis isn't an expensive restaurant (~$10 for a small pho) but it's not a great deal either given the quality and quantity of food - super skimpy on the protein, flaccid veggies and even small portions of noodles. To compare, a Turtle Tower pho is well worth being a $35 dish if Thanh Tam's sad phos are selling for $10.", "author": "Janice J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "Was in the area and randomly chose this place as i found a parking spot across the street. The restaurant is a bit cramped, with a whole row of tables running down 2 aisles.\n\nI had the beef salad which I like.  The beef were very thinly sliced and was not fully cooked but not raw either. Kinda liked it that way. Not fully cooked.\n\n Got a bit dehydrated (probably due to the sugar  & sodium in the ngoc nam) and drank 3 glasses of water with it! I'd consider returning.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-07", "description": "The only reason I got Vietnamese food in the Mission was because I was sick and wanted soup. This place seemed a bit more reasonably priced than the others, so we came here.\n\nI got the rare beef pho. The veggies that came first were obviously not fresh. The second warning sign was how quickly the pho came out. It came out within 5 minutes of me ordering it. Way too fast for pho. Evidently not freshly made, most likely pre-made and just re-warmed. The broth was very bland and not impressive. The \"rare beef\" was not rare. I hate that they put it in the soup without asking me. Usually they ask if you want it on the side - and I always want it on the side. The fact that they put it in the soup before serving it to me completely defeated the \"rare\" purpose.\n\nWas it inedible? No. But would I return for another try? Probably not.\n\nThere are way more choices in the area. Maybe not many more Vietnamese choices, but I rather go further for a better pho.", "author": "Junel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "Ok space, less than amazing food. We had 2 different phos. The rare beef pho wasn't very flavorful and was all noodle, the spicy beef pho tasted almost like a canned soup. Both were really heavy on the noodles and the beef just wasn't of good quality at all.The portions are large and the prices are low, though. Service was fine.", "author": "Disco B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-15", "description": "Delicious, simple, authentic. This is a true Vietnamese restaurant. It's not super fancy-fussy like other restaurants on gentrified Valencia - which holds its nice charm. \n\nGo here for their Pho Dac Biet (house special beef pho), Hu Thieu Ga (chicken noodle soup) and their simple casual atmosphere.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Awesome place, cheap and authentic. My favourite Banh Mi sandwiches in town!\n\nApparently the veggie pancake was kinda boring but that's the worse I could say about the place.", "author": "Greg W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-23", "description": "Thanh Tam II is a block from where I live and it took me over a year before I tried it out (to be fair there are a gazillion restaurants on that street). It's got these weird neon lights in front of it that makes it look like they're in the business of fortune telling instead of Vietnamese food.\n\nThe food wasn't that good - it wasn't horrible, but just not that good. You can tell the ingredients they use aren't really fresh.\n\nThe service is, in typical/authentic Asian restaurant fashion, pretty bad. I've been ignored repeatedly, and the waiter/owner was visibly annoyed when I asked him a question about a menu item. \n\nTo be honest, I recommend going to Mau down the road instead. It's less authentic, but the quality of food and service are better. If you're willing to walk a little further, you can also hit up Jasmine Garden up around Church and Market.", "author": "Don L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "I love the Pho, the Wonton soup is so good, the crispy noodles aren't too heavy but plenty filling and the egg rolls & potstickers are also delicious with a little crunch to them. \n\nI love a big bowl of soup with hearty veggies and fresh ingredients - Thanh Tam does it.", "author": "Autumn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "Ate here with my date the same night as the Academy Awards, walking from the Roxie on 16th, where we saw the whole show projected on the big screen. I remember getting Spicy Beef with Lemon Grass Noodles, and it was absolutely the best meal of the day. I have already been back!\n\nKind of low key, but very delicious, and that's all that matters.", "author": "Garett T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-02", "description": "Reasonable price and average quality! Does the job if you want to save and are not seeking for extraordinary food.", "author": "Solene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Had the bbq vermicelli bowl with chicken and egg rolls. It was pretty good. I should have asked for more sauce, but it was great overall. I'd like to try different their noodle bowls next time.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Went there to taste test for an upcoming event.  Indicated wanted to try certain items without getting the whole orders. Very accommodating. Since I had no idea how much food to order,\nJohnny assisted us with the menu items and how much to order. Day of the event, the food arrived on time.  The large trays of foods were hot and ready to go. He brought us many different sauces to try for each item.  Each tray was plentiful. The guests loved it.\nVery pleased with the service and the food we received.  I recommend this place\nfor lunch or dinner and catering.", "author": "wanda f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "Better than Mau.  Not the best Vietnamese in the city (PPQ FTW), but my go to spot in the mission.  The bun is very good (my usual order) and the pho is also good.  The man who works during lunch hour is always really sweet and get our order in a timely manner.  Sometimes you have to flag them down for the bill, but as far as i'm concerned, that's a a San Francisco problem, because almost every restaurant I ever go to is like that.... Can't really say for the pho, but bun here is WAY better than Mau's.", "author": "Caroline W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Came here for lunch today, was tasty! Chose the BBQ Pork and Shrimp Vermicelli noodle bowl and Imperial roles. Roles came out crispy and hot with a dipping sauce and the noodle bowl had great taste and texture. Food is reasonably priced. Also noting that I really enjoy shrimp so definitely happy this restaurant didn't skimp on those. Overall a great meal. I'd eat here again.", "author": "Margarita R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-05", "description": "Wow that lady is a bitch! \nShe asked me what size I want for my noodle soup over the phone, and she got upset for me to ask her what size they have, she said \"omg\" I asked you what size you want, and rant about the menu, what a dumb ass, I cussed her out on the phone because she deserved that. Fuck this place, and I'm hungry!", "author": "JV Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-04", "description": "Food is only okay and I would probably come back if this place is the only open place in the hood when I am looking for food. So, that pretty much means never. \n\nNoodles are tasteless, egg roles are pretty nasty with dipping grease and beef is meh. The guy who took my order was pretty rude and probably hates what he is doing as much as he hates his customers.", "author": "Gokhan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-21", "description": "Not too many Vietnamese options in the Mission and after a long day of dim sum and walking me friends and I were craving something light. \n\nOrdered:\n\nSpring roll - solid nothing special but yummy\nI ordered the beef goi, crunchy and a large portion size. Celery threw me off though, celery in goi? Strange\n\nSeating is tight and service is prompt.", "author": "Jade W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "You live in the Mission.  You're hungover.  You want pho.\n\nMy test of good pho places is ordering the meat on the side and hoping I don't regret what it looks like when it's not masked by that delicious broth that they concoct in the back.  Thanh Tam delivered!  No sleepless nights having nightmares of sketchy meat here!  \n\nI'm also a frequenter of their vermicelli bowls and they don't disappoint if you're not in the mood for something hot.", "author": "Kamila L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "I had just finished tanning for viatmin D and decided to get my vitamin P, er,  pho on here and boy was I surprised!  The broth was tasty and the beef balls exploded with flavor.  Not only that but when I asked they put the giants game on for me and I got to watch the Giants beat the cubs over a nice steamy bowl of beefy pho while basking in post tan euphoria.  I found my happy place!  I'm looking forward to coming back!", "author": "Theron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "I eat here often. OFTEN. It's quick, cheap and good. It's usually about 80% full so it's busy but you'd never have to wait long for a table. The sir that works there knows my picky order and gets it right everytime. They take credit cards and the service is generally pretty fast. If you're craving viet food but don't have a lot of time or money then this is the place pho you.", "author": "Yuxuan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Was positively surprised by warmth, cleanliness and good food. It look nothing like it from the outside. \nBest imperial rolls ($6.75) I've had. Simply delicious, not greasy at all and very light. \nFresh spring rolls $6.75)  were good, freshly made, warm. The peanut butter sauce was perfect! \nChicken Pho ($7.95) was somewhat disappointing, not enough chicken flavor, no richness, but it wasn't bad. \nService was fast, attentive enough.\nFree delivery in 1 mile radius.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-15", "description": "This has a nice selection on the menu for a neighborhood rest., but I don't plan to return after the last 3 visits. cigarette smoke always seems to comes from the kitchen and into the dining area. The waiter denied anyone was smoking. Please fix the ventilation so diners don't have to breath cigarette smoke with their meal.", "author": "Yelika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "I always have great food here especially the spicy beef pho. Slow service so don't go when it's busy.", "author": "Lu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "Before visiting, I use to have to leave the Mission to find decent Pho. (I'm not a fan of sunflower, mau, or the lotus garden)\n\nThis is now my defacto place when I crave pho/Bon mi/vermicelli. It hasn't been perfect everytime, but it's been great more than not.\n\nThe broth is amazing and my favorite Pho tai is never dried out and overcooked. If I ever feel too lazy to leave the house delivery is super quick.", "author": "Dane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "very good from service to meal. Got the combo meat in beef broth with rice noodle. And my only complaint is the quality of the beef (thick and cheap, I'm use to thin slices. ) I asked for no beef balls and he gladly left them out. The chicken was good and the tripe too. Taste of the soup was perfect before I added sriracha and hoisen sauce.  ILL BE BACK", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "If I could give 0 stars I defiantly would. For starters the container was cracked at the bottom and burnt my leg. I told the owner that I was not pleased with my food because it taste freezer burnt and I asked to have the food remade the owner replied \"I give you yo money back you no come back here you tell me my food no good\" what the hell how do you tell a customer that? Would not recommend this place to my worst enemy!!!!!!!!", "author": "Carmina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "Thought babe and I would come here for a quick dinner before we catch a movie, but they have suuuuppper slow service here. \nAfter we sat down and got our menus, we spent a lot of effort to flag the waiter down for him to take our order since we've been sitting awhile. I noticed that the lady behind the cash register can see us trying to get someones attention, but she made no acknowledgments nor try to tell another worker to come to our attention. So we waited... till someone finally came. \n\nAnd the food also took a while took, so we ended up asking them to just box our food to go, because we had to get to our showtime. \n\nI ate a few bites in the car ride and food was average. Oh yes, I had the pork chop rice, and babe had the pork chop rice combo thing. \n\nNot quite impressed with this place. Not sure if there will be a next time.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-31", "description": "Very good Chicken Pho, light broth, nice sliced chicken breast, roasted shallots add nice layer of flavor \n\nBUT, is it worth $11 (with tax) before tip? No. There isn't a bowl of chicken pho in the world worth that price. Let alone, a bowl that is filled only barely halfway with the broth. I was nowhere near satisfied or full.  I'm coming from Seattle, where a gigantic MSG free bowl of chicken pho costs $6 at most.", "author": "Earls C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "Got veggie pho from here the other night, was pretty delicious! Enjoyed that it came with fresh tofu, broth was delicious large size was huge portion. I would eat their pho again!", "author": "Coco J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-13", "description": "Pho was decent; I ordered the #42, so it was pretty simple. Kind of expensive for a medium, $9+, but they did provide a lot of noodles. They don't have a lot of condiments like what I'm used to in Sacramento, so it felt like it was missing something. I had a bite of the curry chicken and lemon chicken, they were both good. Service was A-OK. Bathroom was only one stall in the back of the restaurant and it's a bit cramped in there overall, but the food is good", "author": "Nani V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Very impressed by this place, both for the pho (quantify and quality), the imperial roll and the grilled pork. very cute casual date spot for a midweek meet up or just catching up with a friend. tables are TINY though, so if you get a big bowl of pho, be prepared to carefully feng shui the hell out of your table when other courses arrive!", "author": "Mike V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-05", "description": "Here's the thing. I spent 9 days in the middle of a desert and after all that, I'm sick of eating steak, bacon (I know, I know shut up) and beef jerky. I was craving Asian food like mutha and the thing I wanted most was pho.\n\nAlthough I was told Thanh Tam was better for bun, I had to have some noodle soup. I'm not a pho ga lover (unless it's TT) so I said surprise me. Brought back for me was a large pho dac biet (special combo.. all the goodies! you know, rare steak, tendon, tripe, beef balls etc). Cac dam even for take out it was pretty big. I couldn't finish it. They definitely don't skimp with the meat. This may sound weird, but I liked the fact that they boxed up the noodles in a clear ,flat take out container as opposed to most Viet places that will squash your noodles into a Chinese take out box. Why does this even matter? Well my noodles didn't end up sticking upright in a cube formation, that's why! \nStandard condiments were given, basil, bean sprouts, sliced jalapenos, lime, etc. I don't know if it was just because I just came back from the desert or something but the broth was extremely satisfying on its own (without the noodles). \n\nSplit an order of cha gio. Decent, but I felt it should have been a little crispier. Also, the nuoc mam was on the sweeter side, but still slightly bland. I prefer it a bit saltier.. \n\nIt's Vietnamese food in the Mission, have low expectations.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "Stumbled onto this place on my way to meet some friends for ice cream at Bi-Rite. My name is Thanh Tam so of course I had to try it. Ordered a banh mi, or Vietnamese sandwich. It was a little more pricey than what i'm used to (I'm from sacramento) but it turned out to be perfect banh mi. The bread was crunchy, the meat was well seasoned and generous, and the veggies were fresh. Must now find the original Thanh Tam restaurant to try.", "author": "Teresa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "(See pics)\n\nReview #1025.\n\nThis is an excellent Vietnamese joint with very delicious banh xeo (egg pancake), really good chewy rice on beef and egg rolls, delicious clay pot, very good pho, and very strong sharp Vietnamese iced coffee.\n\nA place I dream of and will go there even it's not super close by me.\n\nI do like this place better than Sunflower(s) across the street because of the dishes are more flavorful.\n\nService was also pretty good and without a sign standing outside, it's easy to miss.", "author": "T L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-25", "description": "Update from my June review regarding food poisoning from Thanh Tam: my housemate filed a complaint with the SF Department of Public Health, and we are not the only case of food poisoning from this establishment.", "author": "Yea A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-10", "description": "I already forgotten this place.. It is pure clean inside,but the BBQ chicken was not tasteful as you see on the menu..\nMost Vietnamese that I've eaten are on the good side.... Their  chicken was plain and tasted old.. Not for me...", "author": "Pedro D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Personally I think they have the some of the best grilled pork Banh mi in the city, though they do have their off days. Also, there is almost never a wait to be seated.\n\nBut pretty much all I get here is the sandwiches.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "My go to banh mi (Vietnamese sub sandwich) place in the Mission. Best value for under $6. And will separate out be veg from the rest of the sandwich if you want to rebuild it for a later treat.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "We got a delivery order from them last night and were super happy!  Our order arrived at our front door 25 minutes from when we called it in, which was quite fast.  (We do live a few blocks away.). The spicy lemon grass chicken and tofu with vegetables were both delicious!  We also liked the sweet corn chicken soup.  This may very well become our go to spot for delivery!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-02", "description": "So a friend and I stepped in here tonight because we took a look at the menu, liked what we saw, and the prices were good. He got a sandwich and I got the beef, egg roll, and noodle bowl. The food was alright, though mine was lukewarm by the time it got to me. That surprised me because as I saw other people being served, their bowls were steaming hot. Maybe I just don't know that much about Vietnamese food.\n\nAnyway, the prices were pretty groovy. Very affordable, as our check came to just under $15 for two people. The food was okay... Not a huge motivator to come back, but I would like to try a couple of their soups as the weather gets colder. I liked the ambiance. It's a small restaurant, tastefully decorated, though it did get a little loud as the seats filled up.\n\nService was \"eh.\" The guy took our order promptly, and refilled our water glasses a couple of times, but we waited and waited to get the check. My friend actually had to flag him down after we'd sat there for about ten minutes after finishing our meal.\n\nOne really unfortunate thing about tonight, though, was a breeze coming from the back of the restaurant towards the front door. That draft carried smoke from the kitchen, which should have been carried off by the vent over the cook top, into the restaurant. It was a really unpleasant smell for me, and before long I had a throbbing headache from it.\n\nI might go back, but it's not a place I'd really recommend.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "Delivery ordering here is a mess. They never deliver in the time they commit to. And prices conveniently change every time I've ordered the exact same items. Oh well. Plenty of other Vietnamese options in SF.", "author": "Anil C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "Not bad. There is nothing about this place that really jumps out as being excellent or standout good to me. I wouldn't say the food is bad here either.\n\nThere are plenty of other places in SF that I'd say are better. Whenever we are hungry for vietnamese this place never really jumps out.\n\nMaybe I'll try so more different things on the menu.\n\nYeah...", "author": "Mario W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "Stopped by while heading home to pick up some viet food to-go. I didn't want to go to Sunflower so we decided to try this place out. Plus - they are actually Vietnamese here (unlike the aforementioned place). Minus - the food is sub par. Our nuoc mam was on the salty side (it's usually the opposite, as it's typically made with sugar), the thit nuong (grilled pork) wasn't too bad but nothing to rave about, and the pho was just ok.\n\nPrices are comparable to Sunflower, so if I had to choose between the 2 in the area, I'd probably go with the former based on proximity to me.", "author": "Johanna L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-18", "description": "Echoing some of the other reviewers, I recommend you steer clear of Thanh Tam II. I ate here on Sunday and lost three days of my life to food poisoning. The suspect condition of the kitchen and back area should've clued me in on my impending doom (you pass these on your way to the restroom in the back of the restaurant). I ate the pork & egg roll vermicelli and some of the fried wontons. It's hard to say exactly which one did me in, but it wasn't worth being tethered to the bathroom for three days.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "Great value for what you get. Their regular steak pho is terrific. And their pricing and portions are terrific!", "author": "Charles T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-30", "description": "Good menu choices with decent food and prices. Nothing really WOWED me about this place which is why its 3 stars. It should be 3.5 because the place is really reasonable for the food quality. \nThe place is small, cramped, and kinda loud. Could be done way better and yet same time in the Mission so could have been way worse. The service is OK. I would go here again and for sure grab it as take out or delivery. \nThe pho is great, the grill is too. The food in general is great to share and really its all under $10 a dish pretty much.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "The CLASSIC CUTS (a poem):\n\nThey call me \"Da Cutz\", no not like the \"Butcher\"\nButchers cut meat, \"Da Cutz\" begs to differ\nQuicker than termites that cut through your home\nAnd sharp like the dark that'll pierce thru your soul\nYell \"Cut\" to signify the acting is done\nAs night ends the day where new day has begun\nAnd since you'll find me in the cut more often than not\nLet's go down the list of cuts just in case you forgot:\n\nThe front lawn? \"I cut that\"\nBasketball defense? \"I cut that\"\nTime for class? \"I cut that\" \nThe cheese? \"Yea, I cut that all the time man!\"\n\nI am always one to cut against the grain. So tho many have told tales of the Pho at Thanh Tam II, for me the grilled pork reigns supreme. Hence...the CLASSIC CUTS.\n\nWhen having Pho, the broth is so important; it flavors everything in bowl. But this broth lacks richness. The rice noodles are limpy and lack elasticity.\n\nThe tender grilled pork is well marbled, juicy, thin cut, and cooked to perfection (much like the cuts in Vietnam!) The egg rolls are crisp and filling. Go easy on the fish sauce as it can get really salty really fast.", "author": "Robin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-13", "description": "Had a stroll around the late dinner evening time with the love one, and decided to have some Pho. It was about 30 mins before closing time but felt we can work in the meal and leave before the proverbial \"we need to go home, hurry up\" service. Anyways, we ordered the Pho Bowls and they were decent. Nothing stood out, just the basic Vietnamese recipe meal. I don't drink alcohol nor soda, just plain old water. For some reason, the water tasted God awful. I took one strong sip, and I as done. I understand tap water is the default for most restaurants, however, this was some questionable water. It was cloudy, it was tasted really really really bad. Overall the experience was average.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-26", "description": "I'm still looking for a go-to Vietnamese spot in the Mission. This isn't it.\n\nI went here with a large group. No one seemed overly enthused about their food. I had spring rolls, which were fine but not very flavorful. My entree was the Vietnamese pancake/crepe. It looked beautiful and had a nice, crispy texture--but again, it was just kind of bland and over-reliant on bean sprouts, which are great for crunch but not as the primary flavor profile.\n\nThe server didn't write down the orders and a got a couple things wrong. [An aside: it does *not* impress me when waiters don't write things down. Is this some kind of baller feat to show off their memories? Invariably, they get something wrong.] The server also was on the dour side. He does get points for not laughing when someone at our table asked for \"whole wheat rice.\" [He meant brown rice.]\n\nAnother group rolled into the restaurant and it got extremely loud, we all had to shout to be heard. It also smelled very smoky in there.\n\nAll in all, not the most pleasant dining experience.", "author": "Elinor A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "Food is mediocre for a Vietnamese food. Guy who served me never smiled, I feel like he never liked me to be here thus my taste bud wasn't happy that made the good 1 star. Mix feeling if I will go back here. I miss Sunflower Restaurant, glad Tu-Lan reopened. There's hope!", "author": "Mann E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Your typical Vietnamese hole in the wall, where service isn't necessarily great but then the food comes out and it makes up for everything. Pho is simple but delicious and the imperial rolls are deep fried yumminess, and they're big. Everything on the menu is worth a try, and the pho will bring you back to life after a long night of partying or a nasty cold!", "author": "Carmen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-07", "description": "One star for their customer service for food delivery. \nThey are horrible on the phone. They yelled at me when I was trying to place an order, complaining that I was too slow. Also they are reluctant to take credit cards but it says they will on Yelp.", "author": "Hugh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "This is a case where a 3.5 would come in handy. Totally serviceable and tasty pho. Veggie pho comes in chicken broth tho so heads up.  They brought cilantro instead is basil, too, but gave me some when I asked. \n\nQuick service, hit the spot.  Nothing mind blowing but not bad at all.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "I've been here with my girlfriend twice now. The first time I had the grilled pork and fried spring roll vermicelli dish, and the second time I had the beef ball pho. My girlfriend had the rare flank steak pho both times, and both times we had the shrimp and pork spring roll appetizer.\n\nSpring Roll Appetizer - Plump, fresh, and delicious. Really satisfying spring rolls served with a typical peanut sauce on the side. A good appetizer for two, or a nice light appetizer for four (with two decently sized spring rolls cut in half).\n\nPork and Fried Spring Roll Vermicelli - One of my favorite \"Pho restaurant\" dishes. Yummy grilled pork, and crunchy rolls. Hard to mess up, really. This one did not disappoint.\n\nPho dishes (Beef Ball and Rare Beef) - Not the best Pho I've had, but the price is right. Broth may be a bit on the sweet side for some, but I found it to be flavorful. Really hit the spot. I'd say the rare beef version is the superior dish. We've only tried the \"medium\" size (there is also a large version), but it was more than enough food for one person.\n\nAtmosphere - The first time we visited it was cramped and smokey (from the BBQ in the kitchen), but was kind of a fun atmosphere because of it. The second time was a quiet Saturday afternoon with barely anyone else in the restaurant. A very small establishment.\n\nService - Average. Had to flag down a server behind the counter for refills, but that's about the worst we could say. Wait staff is friendly. Kinda adds to the very laid-back atmosphere.\n\nOverall, I could see myself returning to this restaurant once again. You can get a nice bowl of food and a drink for around $10. Very convenient, walking distance from BART.", "author": "Luke G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "The food is good! The delivery estimated time sucks. Waited 1.5 hours for pho delivery. No calls to let me know and vet poor customer service. When I called to check in on the status one lady was so quick to get me off the phone. Rude.", "author": "Rena D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "We came here for a work lunch with 4 of us.\n\nI got the spicy chicken with lemongrass noodle dish. Tons of flavor, very good chicken, and fresh veggies as well. The service is fast. \n\nAlso tried the eggplant and rice dish - highly recommend for vegetarian, eggplant lovers. The eggplant was not too saucy.\n\nThe bahn mi sandwiches are a great bang for your buck. Seasoned great (I tried the chicken) and big for like 5-6 bucks", "author": "Harmony P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-10", "description": "I went in after work for a bowl of pho.  I ordered a pho with rare steak and beef balls.  The pho came out quickly.  I counted 3 pieces of rare steak, and 3 half-pieces of beef balls (or 1.5 beef balls).\n\nThe broth was extremely watery.  It was readily apparent that the broth was watered down, either deliberately (to save effort and cost) or inadvertently (by adding too much water during the cooking process).  I could taste nearly no meaty flavor.\n\nI quickly gestured to a waiter, a middle-aged Vietnamese gentlemen.  I asked him why the broth was so watery today.  The waiter's face went through an odd series of pained contortions as he stuttered out:  \"I don't know.  Like that every day.\"  He quickly walked away.\n\nAt the cashier, I said, somewhat loudly, \"the pho broth was very watery today.  What happened?\"  The cashier looked at me.  We locked eyes.  He said nothing, and he looked down as he continued to count money to give me my change.  He then handed the change to me without a word.  I wish I were exaggerating.  Sadly, no.\n\nNever going back.", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Best Pho I've had in the Mission.  Defiantly better then Sunflower.  Broth had a great flavor and their was a ton of noodles.\n\nMy girlfriend had beef over rice and it was really good as well.\n\nPrice was right and the service and decor where fine.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "These guys are my go-to place for delivery when I'm not feeling awesome and just want some warm soup. I *love* the pho broth. I usually get the special combo pho but the beef balls are my favorite. And they deliver pretty quickly (when they're not too busy). I've been eating here for years and they are consistently awesome.", "author": "Kathy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-26", "description": "Had the pho with beef tripe and steak and it was good. Wish there were more noodles and especially more beef because they are expensive. I wouldn't recommend this place unless as a last resort...", "author": "Edwin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-09", "description": "Don't put three colored drink on your menu, when you don't even serve it. Quit playing games with my heart. Stop frontin'. Otherwise your food is good, too.", "author": "Zooey I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Like to come here for some super cheap gritty vietnamese and chinese food.  Not the best pho in town, but for only $5-7 you can get a plate of chow fun or stir fried eggplant dish.  Also, there's usually no wait.  Has sort of a weird led light atmosphere that actually reminds me of restaurants in vietnam.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Wandering around the mission looking for a place to eat is like wandering around a candy store looking for some sugar. It can be highly disorienting but rewarding. On a whim, we ended up at this place, and I was happy we did. I got the rare beef and beef ball pho, and my wife got one of the grilled pork rice dishes. Both were pretty tasty and good portions. Nothing that will really be burned into your memory, but pretty good Vietnamese at a decent price. I'm sure there are other good places around, but if you end up here, you'll be allright.", "author": "Brent W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "Thanh Tam! I'm in amore with you. \n\nEgg rolls, spring rolls are a little over priced but I get here for the pho almost on the daily.\n\nWhy I love the beef pho(pho tai):\n1.Good clean broth, always hot enough to cook the meat.\n2.Noodles al-dente to perfection, doesn't bloat up too bad.\n3.Consistency.\n4.Nice people.\n\nI like the atmosphere, and the ease of access.", "author": "Jacqueline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "Amazing rare beef pho. Great flavor and good amount of everything. My friend got the grilled beef with egg roll & noodles and it was awesome. Would definitely come back to try that beef on the sandwich. 4 stars for service. Wasn't really even existing tonight. Maybe it's normal but I'd still come back despite that.", "author": "Jess B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-15", "description": "This place is a let down. How can someone have such a prime real estate for a restaurant and serve crappy food? Valencia st is a prime real estate because of so much competition, restaurants here are always on top of their game. Unfortunately, not for this restaurant. This restaurant is pretty much a let down. If you are in the mood for vietnamese, there is so much good restaurant around the city besides this one. But if you are in the mood for vietnamese and happened to be on Valencia St without any means of transportation then I say, better changed that mood to Mexican. \n\nAnd why do I dislike this restaurant so much? You may ask.. well the food was so salty. The only things that I liked here was their beverage - Thai iced tea... The crab and asparagus soup tasted like it has been sitting at the kitchen for days and lastly when they say grilled meat, they smother it with salt. I left the restaurant with a stomach ache and thirst for water due to all the msg or salt. This is the reason why I am giving this establishment a 2 star.", "author": "J C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-19", "description": "This place is pretty bad. Corn starch supreme. Not sure how they call it Vietnamese as tastes like bad Chinese. Staff is nice that's about it", "author": "andrew s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "As we live a couple of blocks away and stroll the \"Valencia corridor\" almost daily, I've noticed Thanh Tam many times.  This Saturday night, my husband felt like take out and I felt like Vietnamese so we tried it.  And for pretty cheap, take-out food, I think Thanh Tam is damn good!  \n\nWe both had vermicelli noodles with roast pork and imperial rolls-- standard order.  The pork was really flavorful and not too chewy.  The imperial rolls were delicious AND didn't give me indigestion (I'm looking at you, Tu Lan).  We also had spring rolls, which were ok-- clearly made several hours before, the skins were a little tough.  \n\nCan't speak to the quality of service (although other Yelpers seem unimpressed), but we will absolutely add this place to our regular take-out rotation (which currently includes Taqueria Cancun, Yamo, and occasionally Mission Chinese Food for interested parties).", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "This is the kind of place my Wonder Twin & I can come back to again & again. Decor is uncheesy, chairs are not rickety, tables are clean & new. We like those (seemingly unimportant) details. \n\nFor $24, the two of us had dinner here Saturday night. Edibles:\n-- imperial rolls: they do not mess around! Crispy, bubbly wrappers chock-full of pork. Probably some of the best I've had. Not too greasy=major plus. \n-- wonton soup w/ rice noodles (vermicelli): loved the chicken broth, tasted very light & clean. Baby bok choy was crunchy. Noodles were plentiful. Pork & shrimp won tons were okay, meaning it didn't taste the way I'm used to...a little more firm & had less shrimp than I'm used to. Okay, nonetheless. \n-- Wonder Twin got BBQ chicken over rice & we had a long discussion about how well they prep their chicken & only serve lean, appetizing-looking pieces. I'd definitely order that based on looks alone. \n\nWarm, cozy atmosphere (like you're being hugged!) Attentive servers. No MSG-induced headache. Easily five stars.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "What a great place! Great food, although I could stand a bit more spice. It's a perfect 1 $ restaurant. Fairly un-yupfied and no zagat's sign! Yea! The food is down home style.\nMy buddy had 5 spice chicken, done perfectly! The dish I had was shrimp and vegetables. The brown rice was as good as b' rice gets. Good portions, good prices, good people. EAT THERE", "author": "Richard W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "I don't know why this spot only has 3.5 stars.  I've tried all the Vietnamese spots in the Mission, and this is by far the best.  Awesome service once you get to know the people working.  Amazing food, very affordable.", "author": "Van P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-06", "description": "Solid vietnamese food. The pho is not quite as good as at nearby Sunflower, but everything else is comparable and it's less expensive. Also, the banh mi is quite good.\n\nWatch out for the dangerously low health inspection score -- according to health records (available on Yelp) the latest routine inspection found a \"high risk vermin infestation\" and lots of other health code violations.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-17", "description": "This is as good as it gets from a cheap eats vietnamese style.\nPho was legit, so was the Bun. I couldn't ask for anything more.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-07", "description": "Ordered delivery from Thanh Tam II for Beef Pho and Grilled 5 spice chicken and rice. Delivery time was about an hour. The pho beef broth left much to be desired. It was watery and did not have much flavor. I had to douse the broth with Sriracha to pull the flavors out. Grilled 5 spice chicken was better than the pho. \n\nI would order again only because this is one of the only pho places that deliver to me. But would definitely stay away from the pho.", "author": "S P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-17", "description": "This place is a nice alternative to Sunflower.  HOWEVER, if you're a vegetarian in search of pho, don't bother.\n\nI had two bizarre experiences here regarding their vegetarian pho.  First, I noticed that their menu had a \"tofu and vegetable\" pho, but it only came with chicken broth.  I asked the waitress if they had an option with vegetarian broth, and she said yes but told me that if I wanted it, I had to order a large.  When I asked for an explanation of this unusual rule, she said, \"That's just the way it is.\"  When I asked, \"But why???\", she just repeated herself and gave me a look that made it clear she really could not care less.  I knew I wouldn't get anywhere trying to negotiate, so I just ordered the large.  It tasted fine.\n\nIn the second encounter, I called to order the veggie pho for takeout.  The guy on the phone didn't impose the bizarre \"large only\" rule, but he did say, \"You know our vegetable broth comes from a can, right?\"  Uh, no, I didn't know that.  I ordered it anyway out of hunger and desperation.  Although the broth surely came from a can the previous time I ate it, somehow the knowledge of the canned broth made it taste like crap to me.  \n\nI guess if you don't care about canned broth and/or being subject to tyrannical rules regarding the size of your pho, then order it.  Otherwise stick to the banh mi and spring rolls.", "author": "Mara E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-12", "description": "Alright prices. \n\nService wasn't complainable until it came to waters. Took a while for refills.\n\nFood was tasty. We got the garlic eggplant with tofu added, no problem. Also a mixed vegetable plate that I don't remember the name of. Both were served with white rice. No option of brown rice that I saw.\n\nPretty okay.", "author": "Melanie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "After reading some of the reviews I thought I might offer my opinion.\nHad very little exposure to Vietnamese food. Lived in the mission for over five years and often pass by this restaurant...not much to look at but the food was remarkable! (The foods that I tried, I haven't tried the entire menu).\n\nThe quail is delicious; all of their soups are extremely flavorful and just plain tasty (better on a cold San Francisco night).\nThe crispy Style Chow Mein was very nice and crispy. (plenty to share with two people, if you are watching your weight, as I am).\nThe Grilled Beef and Egg roll noodle was very different to any other noodle dish that I've tried. It was flavorful, aromatic and a delight. (again, plenty for two)\n\nNow, don't think their food is design to dazzle you visually (in my opinion)...and their restaurant front isn't very inviting. But my grandmother would tell your to f...k yourself if that is only reason why you didn't try a place. Haha\nSure, some of you will find some dishes that you are not use to, like me, and a lot of the reviews are right, their customer service needs work. But if your first visit was not a pleasant one I invite you to try some of the dishes that I suggested. Now I find myself going to this place often. \n\nTwo weeks ago it was freezing and I was feeling sick....on my way home I picked up their wonton soup and I couldn't help but to smile as I stuffed my mouth with this aromatic elixir.  Woke up feeling like running around Dolores Park! MAGICAL ...  (I hate running) lol", "author": "Ruben B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "Good Vietnamese food in the MISSION! score! The soup is delish, the servers are friendly and remember to fill up your water. We are some thirsty people! Thank you! Will be back for sure.", "author": "Sharon N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-18", "description": "I've never been here but this above review makes me think I'll refrain from going. I hate food poisoning! Eek! Methinks not.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "Across the street from Sunflower, where the crowds pour out into the street, even in rainy weather, this little Mission gem is one of the best kept secrets for no way, better-than-Sunflower, Vietnamese food. \n\nI recommend the Lemongrass Tofu and the Vem bowls!", "author": "Nicole d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Hidden gem in the mission. Hands down best beef pho. Shrimp chow mein came out pipping hot and was some of the best I've ever had. Service - impeccable! Treat yo self - eat here!", "author": "Kathleen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-25", "description": "Hot Thursday at 5pm in the mission. I've got an hour to kill before a cooking class. I'm starved. I'm low energy.\n\nBahn me for $5 with a Vietnamese iced coffee for $2.75? Heaven. \n\nQuiet spot, but then again it is early and I'm dining solo. Fast service. Clean spot. 4 sauces to pick from to heat up my sandwich. Fresh cilantro and carrots. The chicken was similar to teriyaki chicken, but I'm not well versed in this cuisine. All I know is that it was tasty. If I lived near by I'd definitely explore the rest of the menu.", "author": "Jacqueline S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-14", "description": "My friend took me here one day.  She said she liked \"Tofu Lemon Glass over Vermicelli\" so I tried.  I really loved it!!  its soy-sauce based sauce is excellent.  I can have every day!  I've been here only 4 times and had it 3 times.  I also tried their hot and sour soup too.  It's a bit different than the Chinese one but I like theirs more.  Oh, another important thing is their dishes are reasonable.  I'm excited to try other dishes!!!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "This place is quieter and cleaner than Sunflower.\n\nThe garlic noodles aren't very greasy and the pho was fresh and delicious.\n\nGo here if you want Vietnamese but want to skip the crowded, dive-y, louder Sunflower.", "author": "Shawn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "It ain't fancy. Or pricey. It's easy and consistently A-OK. \n\nI don't know why anyone seeing it from the outside (or the inside for that matter), or looking at just the font and layout of the menu, would expect it to be anything more than A-OK or be disappointed by what they ate here. \n\nIt's like a greasy-spoon diner, but for Vietnamese food. Capiche?", "author": "Will R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "I love both Sunflower and Thanh Tam II, but for entirely different reasons.\n\nThanh Tam II wins in the soup category.  Their pho broth is tastier and their Vietnamese hot and sour soup with fish is very good.  I can't say that it's the best I've ever had, but it is the best on Valencia St.\n\nIt's really good for lunch because it's usually empty and fast.  I can get in and back to work within 30 minutes.\n\nI've heard of people feeling unwell after eating here, but it's usually a feeling of giddiness, euphoria and a little stomach upset, not your typical food poisoning.", "author": "D. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "I've come here multiple times before and each time the shrimp pho has the right consistency between broth, noodles, vegetables and shrimp. Their vegetarian spring rolls are great as are the deep fried prawn in rice paper wrap. \n\nThe boyfriend likes their meatball pho and they've always had great consistency in flavor in that as well. Generally it's busy, but service is always great, prices are decent and they deliver, which for San Francisco this is a steal! \n\nMinus one star because of two things: 1. Once the let the door open and an uninvited bum came in which then the owner had to come out and asked him to leave. 2. Agreeing with Cyn W's comment, their cleaning solution for the tables is potent for such a small restaurant, but the food and convenient location is worth the stop.", "author": "Carolina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-08", "description": "It isn't that my first experience wasn't a wonderful one, it's that it was the first Vietnamese restaurant experience where Pho was not involved in about 2 decades.\nThe Banh Xeo was good, but since that time I've gone to at least 5 other places, 2 this week.  The bahn xeo tastes good, but the inside is kinda mushy.  What I was looking for was crisp on the outside and cooked on the inside.  Also the bean spourts though tasty, needed a little cook time.  I guess the assumption is they cook inside the crepe, but they didn't.  I've had delivery and they are nice, but food not great.\nThe restaurant is good, the staff friendly, but the food is not the best around.  I will order from here again, but not the best around.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Let's be honest, here. I'm from Boston. Pho is pretty much Campbell's there. \n\nStill, I thought the chicken noodle soup I had was pretty amazing. The chicken was perfectly sliced and cooked, the broth had the right amount of tang, and the service was incredibly fast. I don't think I've been served that fast in my life. I'm totally okay with that.\n\nAlso, I left my credit card there, and the waiter ran after me. Major bonus points for that.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-30", "description": "Omg was craving pho so badly today but don't want to drive 30 mins to our usual spot. Opened yelp to help me locate the closest pho joint and this was the closest place. It only had 3.5 stars and usually I don't go for restaurants under 4 stars. Today I realize I've been yelping wrong my whole life. Dude this place is amazing. I don't understand why it only have 3.5 stars. Each savory bite hits the spot so hard I almost got bruised. Their soup is perfect. The pho doesn't have that strong ricey taste. Best of all, the meat flank was soooooo tender and yummy! I am going to make this my new spot now. Nice and close to home and DELICIOUS! It is very clean too! Unlike most authentic Vietnamese restaurant haha.", "author": "Yaboo Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Really good rare Steak Pho. Very inexpensive, probably best Pho in and around the district.", "author": "Nik M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Such a cozy, simple and fast place to get pho.", "author": "Dolores Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-26", "description": "Pho was okay; not mind-blowing or cheap by any means but a good Vietnamese spot in the Mission.", "author": "Xteethx B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-10", "description": "Nothing beats a hot bowl of pho on a cold/rainy day, or really any time one has a craving.\n\nThis place is a little pricer than I'm used to for pho, about $8-9 for a medium size bowl. The broth is good, but a little oily, however if you're craving pho and you're in The  Mission, this place does the trick.", "author": "Shira O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-12", "description": "The pho was meh. Should have held out for Turtle Tower.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "My favorite restaurant hands down. Great family owned Vietnamese in the Mission - I go there about once a week and never get tired of the shrimp sugar cane wrap and lemon grass tofu.", "author": "Rita C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Last week, some friends and I stumbled upon this place while trying to find a place to eat dinner (after learning our go-to Vietnamese place was closed). \n\nWe walked in and were seated almost immediately. We ordered a round of Sapporo's and the Vietnamese pancakes (banh xeo) to start. The pancakes were interesting, in a good way, lots of flavors and textures going on. We didn't realize they had meat in them, which was unfortunate since one of our members is a vegetarian. \n\nFor our entrees, three of us ordered the Tofu Vegetable noodle soup (hu tieu chay) and the fourth ordered the Spicy Chicken Chow Mein (mi xao ga cay). Overall, we were all perfectly satisfied. My soup was just what I needed with a generous amount of sriracha and jalapenos added, it was delicious.\n\nDefinitely a great place to stop in on a chilly San Francisco evening and warm up.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "As a self-proclaimed connoisseur of salads, I must say their shaken beef salad is top notch. Juicy, peppered steak pieces, large quarters of fresh tomato, and spicy soy dipping sauce with slices of jalapeños. It's a hefty amount of beef, which merits the $10.95 price tag.\n\nThe lettuce of the salad leaves something to be desired, which is why I went 4 stars instead of 5.", "author": "Ross A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Solid neighborhood Vietnamese option with affordable dishes and friendly service. We had a lovely family style meal for 4 with the pancake appetizer, eggplant side, clay pot catfish and grilled pork and shrimp noodles. Clay pot catfish felt the most authentic but the other dishes were quite good nonetheless. This is a great add to our regular rotation.", "author": "Aman H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-21", "description": "I've been coming here for about 10 years.Not bad despite some of the\nother reviewers horror stories.Maybe I'm not one for soup & noodles! I\nsuggest trying the chow mein,meat & seafood stir fry plates with white\nrice,eggs rolls,& grilled BBQ pork (sliced & whole).The last is heavily \nmarinated,so might make you burp for a day! Otherwise,good & above\naverage in taste.Just wish the take out portions were complete filled boxes and not 3/4 of the way filled.Take a chance on this place.", "author": "Buddha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-20", "description": "It started with a craving for a vietnamese sandwich.  This assuaged it.  End of story.  Prices are somewhat on the pricey end for vietnamese food and you don't get a lot but the food was enough.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-01", "description": "As a native to San Jose and a possessor of a Vietnamese mother, my expeditions for pho have been very hit or miss in San Francisco. Maybe I need to put all my claws out and explore the Tenderloin or trek super far to Clement. But luckily we found this 10-minute-to-walk-to spot in the Mission.\n\nI had their pho. (I love noodles btw). And I could not complain. The noodles weren't soggy (I hate, loathe, despise, want to kill soggy noodles and/or those who produce it) and the broth was tasty. The beef was pretty tender too. It was exactly what I had been wanting. Just a pleasant bowl of pho. I think I want this again tonight, but it's only Wednesday and I'm only allowed to eat out on Fridays and Saturdays now. Wah. \n\nI can't say it's the best pho I've ever had. I don't know if the best pho ever actually exists. But I left pretty happy.", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "Great neighborhood restaurant.  I come here once a week for the soup. It is consistently good.... And no gristle, which is my pet peeve with pho. I would dare say I like the soup better than Slanted Door's.", "author": "H G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "Very good egg rolls, and chicken chowmein. Good quantity in cheap price... Can't beat that!", "author": "Darshz N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "My go-to place for a good banh mi. They strike just the right balance -- not too healthy, not too greasy.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-11", "description": "Mmmmm, pho. \n\nIt doesn't take much, pho-wise, to keep me happy. Give me a generous portion of sides and sizeable chicken pieces (done and done) and I'm happy. \n\nThis place delivered pho-wise. I also split some spring rolls, which were good as well. Granted, I haven't ever had bad spring rolls... But still.\n\nService was prompt and friendly, and we were seated right away on a Thursday evening.", "author": "Sonia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "If you get a la carte it's a ton of meat and veggies (no rice). Great for two meals. Vermicelli bowls, pho, and five spice chicken are all delicious.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "I LOVE this place.  I wish I lived in Mission so I could hang out here more.  \n\nI had some fried rice thing with beef.  Who cares about the beef.  I am a fried rice fanatic and this is the best one I have had in the bay!   The beef was great too but I almost forgot about it because of the rice.\n\nMy friend got the vermacelli which he loved too.  But who cares about him...back to the rice.  Tender, just enough veg and spice.  I always add some sriracha, that's just the way it is.  Man, I am having dreams about this rice.  I have to go back soon!\n\nLove!", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-26", "description": "So, it states loud and proud that it is a Vietnamese establishment and we had had a delicious meal at Sunflower the other night in Potrero Hill so we just ducked in here one Saturday night. It was hot and sweaty inside, quite loud, and a very chill and laid back atmosphere that was pleasantly promising for some good cheap eats. \nUpon closer inspection of the menu it seemed to be a whole lot of your standard Chinese food restaurant offerings so we went with Tofu Hot and Sour Soup and a BBQ pork & imperial roll vermicelli noodle bowl. The noodle bowl was underwhelming and went largely ignored but OMG that was some of the best hot and sour soup I've ever had!! We were literally competing for the last slurp! It would've been even tastier if it was served with real porcelain soup spoons, not flimsy plastic ones, but given the environment and price point, it was all good. \nI really appreciate the large assortment of sauces on every table. \nI would probably not seek out this place again amongst all of the other fine Vietnamese restaurants in the city.", "author": "Libra J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-08", "description": "I cannot imagined not living next door to this Thai restaurant. The perfect mom's cooking place where you can just do that -- eating mom's home cooked dishes. The service is homely, there's nothing extra special about the service to entice you to come back, etc, but it is quick and simple --  'what do you want to eat today, sir? ' From padhai to pho to lemongrass BBQ pork sub, this place is a gem for the Valencia/Mission residents. For a quick fix, and if you are craving thai, head here. Satisfaction guaranteed.", "author": "Ambrose A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "This is one great place to have vermicelli noodle bowls.  My bf ordered the lemongrass beef over vermicelli and it was like grabbing a bowl from my mom's kitchen!  The meat was so tender and the flavors were right on!  I had the (usually can't go wrong dish) egg roll and BBQ chicken over vermicelli, which was seasoned well and included very fresh veggies.  The service on this particular night was slow, but with great authentic meals in our bellies, we weren't too disappointed. \n\nTo conclude, skip the line at Sunflower and enjoy your Vietnamese food fix at Thanh Tam!  Delicious!!!", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "I love coming here to get my #39 Special Combination Beef noodle soup. The Combination Wonton noodle soup is awesome also. I haven't found another pho place in the Mission with a selection as good as the one at Thanh Tam II. The service is always attentive and I never wait more than 10 minutes for my food!! The prices are right and the serving sizes are proper.  Make a trip to Thanh Tam II ! \n\nDelivery Service is on hit too, especially for those rainy days.", "author": "Raymon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "BEWARE: They don't deliver until after 5pm!!!!!!!!!!!!!!!\n\nThat was not clear on their website or Yelp.", "author": "Erika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "Super-fast delivery in the Mission!!!\n\nI really liked this pho. The combo was great -- the rare beef was sooo tender and tasty, there was tripe but not too much, plus enough tendon and the well-done meat too. \n\nAND, they gave some cock sauce + hoisin sauce, bonus points.\n\nI would've preferred some lime to the tiny bit of lemon, but the broth is tasty so I'll forgive them this time.\n\nThe cold pork & shrimp rolls were nice. The lemongrass beef was just OK -- I've had better.", "author": "Dina G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-25", "description": "I was absolutely craving a Vietnamese Sandwhich last night and the closest place to get one was Thanh Tam. It is a standard Vietnamese restaurant with the offerings of pho, vermicelli, and rice plates. \n\nI was upset that there was a hunk of cucumber in my sandwhich, instead of a julienne cut that has been in every single place that I've eaten at... texture makes that sandwhich what it is! \n\nThe space is a bit crammed. I went up to pay for my bill and the older woman at the counter had 6 in front of her... apparently she gestured to me which one was mine... but it took an awkward 3 minutes of me standing in front of her to actually get my bill [I had no idea what she meant... don't we usually get handed our bills?] \n\nThe reason I gave them two stars is because nothing really stood out to me. It didn't entirely suck, but neither my experience or my food left me with an impression to come back.", "author": "Megan V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-01", "description": "I can only rate the Pho. Having come from LA, I have had some good pho in my day. I thought the meat here was very average and the soup was somewhat bland. I ordered takeout (pho is usually better in person, admittedly) but they got my order totally wrong (I specifically asked for no tripe and beef balls, and they added tripe and no beef balls). As the order was wrapped in a bag and boxed, I didn't go through to check the order. \n\nIn summary: Pho is very average. Check your order if you're ordering take out.", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "It's a hit or miss with this place.  My usual order is the bun this nuong cha gio (rice noodles with eggrolls and bbq pork) and it hits the spot.  They are authentic vietnamese and so service is quick, but sparse.  I would recommend.", "author": "A B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-12", "description": "Food was good, but it took over 15 minutes to get our check.   The waiter was taking care of everyone else and ignoring us.  Would probably go back for take-out.", "author": "Frances F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-28", "description": "quality is going down...the pho broth, meat are not fresh anymore...ingredients pitifully small in quantities. Everything else may still be ok...but i don't really go there anymore...", "author": "Xiu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "I wouldn't say it's the best vietnamese restaurant but I think it is in this neighborhood! If ur around and u r craving vietnamese food this is the place ;)", "author": "Rio S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-09", "description": "I've walked by and passed up a meal at Thanh Tam II  a numnber of times because it was always too busy, but  the place was empty this afternoon and I was able to get a seat at the only window table.  \n\nI was a little confused by the menu because they have a variety of Chinese dishes listed --  fried rice and chow mein, chow fun, won ton, hot & sour soup and other things that didn't sound very Vietnamese to me but I didn't  try any of them. \n\nThank Tam apparently specializes in cheap $5 Vietnamese sandwiches for lunch, which a couple of guys ordered after I arrived, but I was in the mood for pho.  So, I ordered a medium bowl of steak & tripe pho (my favorite) w/the steak on the side (so it's not overcooked).  \n\nThe pho came quickly.  My immediate reaction was that it was kinda small -- even for a med sized pho - and that there wasn't much meat (steak or tripe).  Only a few slivers of tripe and 5 slices of steak for $7.95.  Came w/the side plate of basil, bean sprouts, sliced peppers and a wedge of lemon (instead of lime).  The flavor of the broth was very good and tasted as it should, but I was still hungry after finishing the bowl.\n\nService after the pho was delivered was indifferent.  After I was done, I had to walk back to the counter where the waitress was \"busy\" reading texts or emails on her phone.  I'm usually pretty good about tipping, especially at Asian restaurants, but I didn't give her a tip because of that. \n\nPoor service but decent food is apparently a hallmark of this restaurant. which would rate 3 stars, but the relatively high price and small serving size drop it a notch in my book. \n\nSo, 2 stars from me because I've definitely experienced better but if you're in the mood for pho and are in the area, you should be satisfied w/the quality of the dish but, if you're hungry, order a large bowl for a buck more just to make sure you get enough to eat.", "author": "Martin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-31", "description": "Came here after watching The Nutcracker with my girls (5). \n\nIt was definitely small inside, but the waiter was friendly. There was a decent amount of pho noodles, but rarely any meat. The price was okay, but if I paid this much for a bowl of pho in chinatown, I would've gotten more.\n\nOverall, this place is okay, and i'll come here again if i'm hungry for vietnamese cuisine and am in the mission district, but i'm not a fan.", "author": "Diane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "I love pho and always looking around for new Vietnamese places but still always come back here. . .", "author": "Colin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Excellent food and pretty cheap.  We got the salt &. Pepper pork chops, beef sandwich, and eggplant with spicy sauce/basil.  They were all excellent and we have enough left for a one of us to have a big lunch tomorrow.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-18", "description": "Well,\n\nwhere do I start? I went here last night with some friends, i ordered the salt and pepper shrimp as an appetizer. The shrimps were whole, unskinned, heads on, w/o mud vain removed, deep fried in a tempura type batter almost to hide the fact they came right out of the bag they were delivered in. I decided to ask kindly for another dish, the manager, told me that what they have cooked, you have to pay for. All I wanted was a replacement dish.\n\nShe was not budging. I told her that I would not pay for it and demanded either for it to be dropped from the bill or replaced, she told me that she would call the police if i didnt pay for it.\n\nWhen we made more of an issue, she started going around to other tables at the restaurant asking them if we were being irrational and yelling at us the whole time. \n\nWhat a joke of an establishment, we paid our bill and left all the while getting yelled at.\n\nhonestly, if you want crap food, and terrible service, check this place out.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-01", "description": "I wanted to like this place, since they had an exciting vegetarian menu, and Sunflower was unexpectedly closed. \n\nNow I know why Sunflower seems much more popular...the Vietnamese crepe was greasy and gummy in the middle. The vegetarian spicy eggplant rice plate was more than half rice with what seemed like only a few bites of (not spicy) eggplant.  All in all, the portions were not worth the price (maybe it's better to get soup?) and the food, while we ate all of it, was not that tasty.\n\nAlso, I know this place is apparently famous for flies in the entry, and I can excuse that, but there were not one, but two, dead fruit flies floating in the crepe dipping sauce. Kinda gross that there are so many in the kitchen apparently as well.\n\nI'll stick to Sunflower, when it isn't Tuesday.  Even though the service is probably worse, the food is better, at least for a veggie, as far as I can tell.", "author": "Tamara F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-24", "description": "I walked in not expecting much, and maybe that's why I was so happy with the meal.  True, the decor is generic-asian-stripmall-restaurant, and the TV above the counter was a distraction, but the food was tasty and even on a Friday night there was no wait. \n\nWe got the salt and papper calamari, which was spicy and tender and wonderful, grilled shrimp bun, which had tons of shrimp, fresh veggies, and a balanced flavor, and lemongrass tofu, which was also very good.  \n\nAfter eating here, I'm just over Sunflower.  This was better, cheaper, and I didn't have to cower in a corner waiting for a table.  Tho next time I might opt for take out.", "author": "Dana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-12", "description": "Came here on a cold and windy Tuesday night to decompress a little bit, dine with myself, watch the Giants game close-captioned while eating a delicious bowl of hot something. \n\nThanh Tam delivered all this and more. The pho was solid - light, brothy, umami, filled with meaty goodies - and decently priced. The cooks accidentally made an extra order of fried bananas and the waiter walked from table to table distributing them for free! A great SF attitude here.\n\nI probably wouldn't seek this place out if I didn't live two blocks from here. It's not a destination restaurant, just a good option in the neighborhood.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "Came here with Corey V last week, and all I could think was: why haven't I eaten here before?? I'm a pho lover who lives about one block from this restaurant.  It just makes no sense.  I think I tried Sunflower nearby, and ended up sticking with that one. Bad choice!\n\nThe pho here was pretty darned good. TTII also has egg noodle dishes when you're having a craving for more Hong Kong-style noodle soups.\n\nHowever, the smell of cleaning solution did dampen my enjoyment of the meal.", "author": "Sid D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-19", "description": "Wandering over here during an off period (between lunch and dinner) and this place looked pretty crowded, which to me is a good sign. Their pan-fried Crispy style noodles House Special was more Chinese than Vietnamese but was quite good with fresh quality ingredients.\n\nTheir \"Appetizer\" Vietnamese Pancake was almost $9.00 but was a huge folded omelet and again freshly prepared with beansprouts and cilantro, mint, green leafy lettuce, and shrimp with of course the terrific fish sauce on the side. Actually, if the fish sauce weren't there, the pancake would have been under-seasoned. My wife rated that pancake about 2.5 but I liked it more and guess who wrote this up :)?\n\nThe service was quick if perfunctory and the value was pretty good. \n\nI would certainly go again if in this neighborhood.", "author": "Glenn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-10", "description": "I've tasted better Vietnamese dishes than the ones offered here.  But the price is good.  Parking is not so good for those not familiar with the Mission area.  There's definitely room to improve on the food - so maybe I wil come back after and make another review.", "author": "Nixon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-17", "description": "It's not great, it's not bad.  Just kind of average.  A little confusing regarding the seating policy, but on the plus side, the food was out quickly.  \n\nThe pho was okay, very little meat in the medium size portion--only 3 or 4 slices. Also, my friend and I had our bowls mixed up, but we weren't entirely certain until it was a little too late.  She needs the calories more than I do, anyway!\n\nNot sure if I'll be back, but not against it, either.", "author": "Aim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-03", "description": "I really like this place.  The five spice chicken is the best dish I've had there.  The chicken is super tender and grilled to perfection.  They don't skimp on the chicken portions, but it's not too much either.  \n\nThey recently started selling Vietnamese sandwiches for $5.  They put plenty of grilled chicken in there.\n\nI've had their bun with beef and imperial rolls.  Imperial rolls are great.  I love their marinade.  \n\nReasonable prices, really good Vietnamese food.  I really recommend this place.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-24", "description": "Minus two stars. \n\nHere's how the first got dropped: \n\nI can say \"no peanuts\" in Vietnamese. So I did, in addition to English. And I still got peanuts on my vermicelli. Ugh. It's not just a preference; if I eat peanuts I WILL DIE. I've learned my lesson. I just stopped ordering anything that requires me to make this request. This means my food options here have been cut by about a quarter. Too bad. The vermicelli with imperial roll and shrimp is sooooooo good.\n\nMinus the other star for this....\n\nWhen I order pho, I expect:\n* broth\n* meat\n* noodles\n* veggies and sauces\n\nThis time, I got:\n* broth\n\nWhen I called to ask nicely for the rest of my food, I got:\n* a hard time\n* harassed about how I was trying to get free food.\n\nEventually the lady on the phone relented and the driver returned with the rest of my friend's pho. He got there about 2 minutes later, which suggests to me that he just forgot the rest in his car. He was nice and apologetic about it, unlike his co-worker the Pho Harpy.\n\nLessons learned:\n* don't eat here if you have food restrictions\n* beware the delivery; it's fast, but make sure the driver sticks around while you inspect the order.\n\nI also discovered recently that Jasmine Garden delivers. They're at least as tasty, know how to leave the peanuts off, and do more accurate deliveries.\n\nOriginal review:\n\nThe only place I know of that will deliver me pho.  I alternate between the special combination pho and the rice vermicelli with grilled shrimp and egg roll.  Christ, that's good.  They tell me they use gluten-free rice paper for the egg rolls, which I will presume to be true because my tummy doesn't hurt after eating here.  We've had some miscommunication in the past about my need for no peanuts on my food, but they have served me a new bowl of food minus the peanuts when they've brought me a death bowl by accident.\n\nAnd yeah, the service here isn't awesome, but I haven't had a problem with it.  They've always refilled my water glass and brought me the check without grumbling.  Plus, if they are willing to bring me de-peanutted food, they can't be all bad.\n\nOh, did I mention they will DELIVER PHO????  Which is awesome since I am sitting at home sick right now and only pho can fix me.", "author": "Polly Enmity P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "These guys know their stuff. They have an extensive menu - all of your Vietnamese favorites are here, plus some Chinese ones.\n\nMy girlfriend had the vegetable tofu soup, which probably isn't actually vegetarian since it definitely tastes of chicken broth, but it was delicious nevertheless. I had the grilled pork and egg roll noodle bowl and it was awesome. The egg roll was especially crispy and filled with goodness. Vietnamese places usually pad these noodle bowls with lettuce at the bottom, and while Thanh Tam II doesn't escape this fate, they don't fill it to the brim with the stuff either. Oh, and their egg soda ain't half bad.\n\nI'm taking one star off for the decor, which is kind of dark and gloomy. Purple walls and overhanging mood lights. Glad we got a seat by the window because we might have been too depressed to eat our food otherwise.", "author": "Jeffrey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Review for Pho- It's great pho, it's fast and tastes yummy. The fried rolls and fresh rolls are also very tastey. I work near here and would come in anytime I'm craving pho.", "author": "Chayne J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "Dropped in here on a whim and had Bún ch and a good bowl of Pho...both were extremely filling and...surprisingly good!! For some reason I didn't think this little place could deliver, but it did and then some!\n\nBottomline, order either one or the other, or you will explode!", "author": "Paolo D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-10", "description": "Tranh Tam II is a good place to come in two circumstances.  \n\n1.  Your name is Tranh Tam I, the prince of Persia, or at any rate, of some actually Asian country, and you wish to eat at a place named after your family. \n\n2.  If you want cheap, fast Vietnamese food and don't really want to wait for Sunflower across the street.  The food isn't amazing, but then, it's cheap and fast, and their Imperial Rolls are better than average.  Who's complaining?  Not I!  \n\n3 Imperial (roll) Stars.", "author": "Leon K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-07", "description": "Last time I was here it was pretty good, but my last experience was a grease factory & bland for the Combination Chow Ho Fun :(", "author": "S. R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-17", "description": "i don't know what they did but their veggie and tofu rice plate that i had become obsessed with while attending school down the street has morphed and is now less flavorful.\n\nthis makes me sad.\n\nalso, i'm a little over the service issue.  whenever the yelling lady is taking orders and delivering dishes i'm a bit frightened.  she's not only a yeller she's a scowler and will make you wait an eternity for the check.\n\ni'm heading back to sunflower on the regular now.  the dudes at the valencia street side of sunflower rock it with a smile no matter how busy the joint is and they at least have one veggie friendly pho.", "author": "Jen I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-22", "description": "* 3.5 stars *\n\nI like the food here better than the last place I reviewed up the street.\n\nLarge portions, friendly service, all around yum.\n\nThe shrimps here are pretty zesty.\n\nI dunno, something about appeals to me (not enough to make me jump in joy but still decent eats).\n\nHas a cool atmosphere, too.\n\nI recommend 'em.", "author": "Kai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "I love this place. I cannot stand Sunflower across the street. This place's Pho is consistent and always delicious. VERY good prices and always fresh food. I love this place!", "author": "William M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Best banh mi I've ever had! 5 for the food (very substantial portions). Service was a little slow, so 4 overall. I'll definitely be back.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "there's a reason some places survive when bubbles hit a neighborhood...good food!  had the bo luc lac (shaken beef) and it was really good. quick, tasty, not too expensive. friendly staff; looks mom and pop.  def a go-to type place for mission.  2 other vietnamese in the hood worth visiting, but can't go wrong here.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-26", "description": "OK, it's kind of weird to review a place from which you've only had one dish, and always get take out  But the Tofu Banh Mi is $5 and SO FREAKING GOOD.  Super fresh, full of amazing pickled vegetables, and with a serious kick.  (If you don't like spicy, have 'em leave off the jalapenos.) I guess if you eat at Thanh Tam, 1) have a thick skin (the service sounds brusque) and 2) don't order the Pho.  That is all.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-09", "description": "Uhhh-mazing.\n\nOnce you get over the queasiness that fluorescent-green lighting seems to induce, you will LOVE this cheap and yummy delight. In fact, I have been twice in one week.\n\nVietnamese spring rolls--a standard, and the peanut sauce tops it beautifully. \n\nPho--pretty standard as well, a perfect dish if you're looking to keep it light--i.e. holding back on sweet and sticky sauces.\n\nThe chow mein and the garlic eggplant dishes use the afore-mentioned sauces with great gusto, and I wasn't disappointed. I love the crispy veggie chow mein and the (wet?) shrimp chow mein.\n\nFinal LOVE: Asparagus and Crab soup. SLURP! An eggy delight, although it skimped a little on the crab.\n\nFinally: Extremely disappointed by the beef and bok choy. The beef was the pinnacle of tenderized grossness. But I was so into the other dishes that I still think this place deserves 5 stars in relation to price, quantity and taste ratios.\n\nThe service was rapid-fire both times I went and the ladies in the back were super-sweet about making sure we had ordered everything we needed before they closed the kitchen.", "author": "Liane G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "I like this place. It's cheap and small and fast. Nothing fancy. Just good vietnamese food. I go here whenever Sunflower has that weird B.O. smell that sometimes plagues it.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-31", "description": "Bad. Just bad. Hot and Spicy beef noodle soup was neither hot&spicy nor had much beef in it.\nNot satisfied, I ordered the pancake which was just plain disgusting.\nStay away.", "author": "Pramod S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "Affordable, fast dinner spot\n\nFOOD:\nRice plate with five-spice chicken\n~$7\nChicken was flavorful and not dry. I couldn't tell what made this dish particularly Vietnamese. It came with a side salad, which was the normal lettuce with carrots, cucumber, etc. and a small dish with a sweet and sour dipping sauce. The plate had a lot of rice, which I couldn't finish. Overall, good value for the quality and quantity of food you get.\n\nAMBIANCE: Small narrow restaurant. Pretty quiet. No fancy decor. The single bathroom was only so-so clean.\n\nSERVICE: Fine.\n\nVISIT DETAILS:  Late-ish dinner", "author": "C L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-19", "description": "Discussion of quality of the food is made obsolete by a negative encounter I had with their management.  \n\nI tried them for a take away order, two dishes.    (can one order chicken with some reprieve from the wheel of life?)\n\nThe container for one of the dishes, my dish, was broken at the bottom.  Specifically, equal damage to a clean knife slice across the length of the base of the food container.  This resulted in mess and embarrassment.  \n\nI returned to the restaurant with the damaged food container, asking if the manager would give me an apology.  The manager gave an evasive sideways apology.  I asked for a beer that I would drink in restaurant.  The manager was evasive, with garbled unintelligible language while jerkily making small movements, along with his staff who backed him, similarly to the nervous scanning movements of desert gerbils who rise on haunches nervously scanning horizons for predators.  The manner was unfriendly.  My tone  conveyed accusation, though was also expository. \n\nAfter a 20 second delay, instead of bringing me a beer, the owner asked me how he could know that I didn't drop the container, which hypothesized I was in error for complaining about damaged containers (indeed the container looked like it had been sabotaged).  I asked the manager why I would complain about a damaged container if I had dropped it myself, and if he was calling me a liar.  There was no beer served.  Then the dinner I had brought over in transferred container was dropped by my clumsiness onto the floor.   I thought I would leave the restaurant without the beer I wanted;  I ended up leaving without my dinner as well.  There was no offer to replace my spilled food.\n\n\nPerhaps I would not be inflamed if I had not had civil rights violated by san francisco police in recent history, whose violence considering context and evidence that was available to them could only be judged as paradigmatic.  There is a police station across the street from this viet namese restaurant.   Incidentally, I am looking for a lawyer to assist me in organizing some form of retaliatory legal action against members of the police department, the sheriff's department, and some legal officers.  \n\nI suppose when forthright communications fail to willful evasions and malpractice of state-empowered groups it's yelp or bruce wayne.", "author": "Nicholas B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "the good news is: extensive menu, delicious spring rolls and chicken noodle soup.  the bad news is:  NOTHING without MSG.  Which relegated one member of our party to watching, sighing, and wiping the occassional tear from his eye as we ate.  (Sure, we could have gone to another place, but we had already ordered before we remembered to enquire AND hell, the kids were hungry.)  Dang.  Also:  service was pretty good.", "author": "Deidre S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "For those who insist on going to Sunflower Cafe, they are doing themselves a GREAT disservice by not going to Thanh Tam II. Thanh Tam's pho broth is richer and they offer more ingredients to throw in the mix. The fact that they can put put tripe in their pho already puts them at an advantage over Sunflower. The ingredients are fresher and their menu selection is much broader. Next time, I will definitely try their rice plates (pork chop and egg. yum!) and their banh mi.\n\nNot only that, it's much cleaner and the service is better. You can actually touch the menus without feeling like you have to wear gloves.\n\nPLEASE do yourself a favor and just walk across the street to Than Tam.", "author": "Faustomatic d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "One of my favorite Vietnamese restaurants in San Francisco.  The way I know if it is real authentic Vietnamese is by ordering the imperial rolls.  Theirs definitely passed the test: big, tasty, spiced right and more importantly rolled in rice paper.  I also enjoy the noodle dishes (pork and shrimp are my favorite) and my girlfriend loves the crepe.  If you go there for lunch try the Vietnamese sandwich.  This place is unpretentious, delicious and affordable.  Please keep it this way...", "author": "Monkey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "Mmmm... Vegetarian Spring Rolls.\nFast and Free Delivery over $15\n\nNuff Said", "author": "Sara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-13", "description": "The folks here are really nice. They totally understood when we changed our order to a to go one because my BF couldn't find parking. I ordered the grilled chicken and egg roll over rice and my BF got chicken fried rice. Both were served piping hot and they tasted decent. It wasn't too busy either which was a bonus because we had to be somewhere later. Their menu has a good selection of dishes so there's something for everyone, especially if you're not a big pho fan. The prices were pretty reasonable, we spent just under twenty bucks including a tip for two items. Not bad for a recommendation of one of my BF's friends.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-20", "description": "Best pho in the city. I stumbled across Thanh Tam one night by accident and after I had their pho I was hooked. I told the owner one day that their pho broth was the best I'd ever had and she told me it was because they cook their broth for 10 hours. The broth is so good that you need not add siracha or hoysin to it at all, just a couple chili slices and basil leaves and you are set. Their chicken and seafood soups are really good as well, although not as excellent as the pho. Other great dishes are the salt and pepper prawns or salt and pepper pork chops, and grilled chicken and fried eggs over rice (be sure to order the eggs cooked only on one side and break the yolks all over the chicken and rice - outstanding). I used to go to sunflower across the street, but after discovering Thanh Tam I wouldn't go into sunflower to ask for parking meter change.", "author": "Benny A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "Very good shrimp and pork rolls, very good pho, very good rice vermicelli dishes!", "author": "CatsPjs Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "lovely neighborhood place. affordable and quick and tasty!", "author": "Danielle J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-23", "description": "Hole-in-the wall and walking by you will mistake it for another Valencia dive bar, especially right next to the well-lit Urbun Burger join next door.  Have no fear, step inside and order yourself a plate of shaking beef salad or bun thit nuong because they're pretty good! They marinate the meat it just right and the fish sauce is superb (it's what makes bun thit nuong for me and my dad).  The other dishes on the encyclopedic menu are ok, and the soups are nothing to write home about, so try these two dishes first! :)  I will have to come back to try their banh xeo :)", "author": "Ben T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-20", "description": "The vegetarian spring rolls with peanut sauce are to die for.  My support group orders take-out from here a lot and we always order the vegetarian spring rolls...they are SO damn good.  They're big, filling, and extremely tasty.  Most def. a culinary treat!\n\nThe only thing is, the place needs some cleain'.  The walls are pretty dirty.  Not pleasant if you go in for a meal and you're sitting next to a wall of gunk.  Gross.", "author": "Jenna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "I have officially lifted my embargo on Vietnam.  I vowed to vehemently abhor all things Vietnamese, including restaurants, after a college roommate experience gone bad.  Khanh was her name, and deception was her game.  She befriended my mom and would call her when I came home too late or when I spiked my breakfast lemonade with Apple Pucker before finals.  Said ratting earned her the nickname Khanhvict, which I called her behind her back, like a mature 18 year old.\n\nSomehow, after 8 years of boycotting an entire country, I have decided to make peace with Vietnam - and all because of Thanh Tam II and $14 worth of tasty food.  How my life has been worth living these past few years, I am unsure.  Grilled pork noodle & chicken with mixed vegetables?!  Heck yes!  For introducing me, and evidently half of the Yelp staff, I think a certain yelper deserves an extra fortune cookie. \n\nFree delivery on orders over $20.  But it's hard to order $20 worth of food here.  Give it a shot - You'll need to order at least 3 dishes, and after you finish, considering the portion sizes, you'll be the size of Vietnam.\n\nThey also serve Chinese food.  Which both confuses and intrigues me.", "author": "Janney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "Hello, lemongrass tofu. Pleased to meet you. Look forward to seeing you again. And again. And again. \n\nHey, who was your friend? Vegetarian Spring Rolls? Nice. Be sure to bring him around, too. That package (of fresh vegetables and mild tofu) was stuffed! and oozing! (with peanut sauce that isn't anything special, but happens to be PEANUT SAUCE, which always deserves the gesture of caps lock). \n\nQuick, easy, relatively clean, tasty... the qualities I look for in Casual Encounters posts and my lunch spots. Perhaps someday I could kill two birds with one Thanh Tham stone. 'Til then, I'll satisfy my need for girth with rice paper-wrapped bites.", "author": "haley d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-01", "description": "Ya wanna know what's wrong with a dinner for $14.37? \n\nAbsolutely nothing. Yep, thanks to some recent splurgin' in the ol' wallet department, I have found my social outings fallin' on some hard times. As a result, cutting back is a necessity at the moment, but never fear because dining on the cheap is yet another one of my favorite past times! :)\n\nAnd so, my platonic hubby suggested Thanh Tam II and since he wears the hypothetical pants in our hypothetical marriage, I played the part of the good woman and followed him there...4 steps behind. What did we order? The chicken fried rice and the chicken with mixed vegetables. Yum. We took our orders back to his house, cracked open a bottle of vino and dined in excellence. \n\nWas it the best Vietnamese exploration for my palate I've ever had? Naaah, but for under $15.00 for 2 people to eat and be full, sign me up! :)", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-06", "description": "A majority of my teenage years was spent dishwashing in my mom's restaurant. It is my \"whoa is me\" Abe Lincoln story. I'd take a bus an hour and a half each way to make minimum wage cleaning other people's disgusting glop in a hot box of foul smelling trash. If you ask my parents, this experience was supposed to teach me the importance of hard work, sacrifice, yada yada yada. Fuck No. It taught me RESTAURANT WORK IS FOR SUCKERS.\n\nSo since I've been on the other side, I usually cut a restaurant a lot of slack when it comes to \"service\". I've never returned a wrong order, asked for more water, or generally complained about my food. Until my experience at Thanh Tam II, that is. Everything about my experience was AWFUL. The dining room is dirty, the service was rude and took forever, the food barely passable.  \n\nI've never been to Thanh Tam I on mission street, but if it's anything like Thanh Tam II, don't expect to see a Thanh Tam III anytime soon. I'd rather sit through another viewing of \"Legally Blonde II: Red, White and Blonde\" than eat here again.\n\nOn a positive note, the dishwashing was superb. 1 star.", "author": "John T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "I like this place better than sunflower!\n\nwhy?\n\n1.Better customer service (not rude)\n2. They Deliver\n3, Food presentation yummy \n4. Not crowded (has better seating room)\n5. You will not smell like the food when you leave (not smokey)", "author": "Aemar E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-05", "description": "I'll admit it - I'm a bit of a pho snob.  (Faux snob?)  Having spent years in the 408 and hanging out with Vietnamese friends, I've gained quite an appreciation for this ubiquitous Vietnamese treat, and I've had a handful of favorite spots in the South Bay and Peninsula.  After moving to the city, I've been searching for a bowl of noodles, beef broth, and meat that'll really tickle my fancy.\n\nThe search continues...\n\nThanh Tam's food is unbelievably average. It's the Jay Leno of Vietnamese restaurants: Acceptable enough to tolerate on occasion, but completely lacking any sort of flair. A meal that you'll put down, but not hear anyone at the table saying, \"Mmm, you've gotta try this.\" Admittedly, the imperial egg rolls here are mighty tasty, but when aren't they?\n\nI would've awarded two stars for overall mediocrity + the imperial egg rolls... But a day after eating here, I had a little group email with the friends who had accompanied me. \n\nMe: \"Hey guys - anyone else have a funky stomach last night or today?\"\n\nFriend 1: \"Yeah, I did.\"\n\nFriend 2: \"Me, too. It started hitting me on the drive home last night!\"\n\nSo after a series of inquisitive emails and hard hitting questions and finding common threads, we deduced that our respective cases of the runs were not caused by the beer at Zeitgeist. Nor were they caused by the beer at Kilowatt. Hmmm, what could it be?  God damn Thanh Tam!", "author": "Omid T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-10", "description": "They make their egg rolls with traditional rice paper - not lumpia wrappers.   That's enough for 4 stars for me.  I sometimes come here to get 1 order of egg rolls - that's it.  \n\nOther tips:  Stick with the Vietnamese rice plates and bun (cold noodle dishes).  They are really good here, particularly the grilled pork dishes.  Pass on the Chinese food - it's average at best.  \n\n**Also, this is not a pho house.  Rule of thumb for pho is to ONLY get it at a place that specializes in it.   Those who come here and order pho, well....don't.  That's just not their specialty - you'll be disappointed.", "author": "Chi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "This is an awesome Vietnamese restaurant.  I would definitely go back.  I liked the spicy eggplant.  The Ho Chow Fun.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Small and friendly family owned spot. Love the pho, imperial rolls and five spiced chicken.\n\nI'm not a fan of the potstickers which are deep fried instead of pan fried.", "author": "Evan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-02", "description": "Ate lunch a couple of times over here too. Seems like they were putting less and less flank and meat on their pho that I ordered although the menu mentioned that it had these ingredients. I can't believe I kept on coming back here even after I started noticing this. I guess it must be the starbucked-type lighting that had my brainwashed for awhile.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-17", "description": "Get the Sugar Cane Shrimp appetizer and thank me later, son!\n\nBasically it's a do-it-yourself spring-roll with rice-noodle-paper you even moisten in a warm-water bowl yourself.\n\nBombest shit ever. \n\n#12 on the menuuuuuuuuu!", "author": "B S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-05", "description": "Pho broth should NOT be brown, sweet and milky, but that's how Thanh Tam served it. It's almost as if the secret ingredient were molasses! Don't taunt me with experimental crap in my pho! A good pho broth, as we all know, should be clear (or nearly clear), with an aromatic hint of ginger and anise. In this bowl, I could sense neither. Then the bill taunted me a second time! Too expensive for 1 bowl of pho-king pho.\n\nI ordered pho with raw beef on the side (pho bo tai). The beef was very high quality, which unfortunately I couldn't say for the broth. The Vietnamese coffee I ordered came out already prepared. GOD! I hate that. I wanted the damned Vietnamese filter at my table, so I could watch the coffee percolate as I ate my pho. But I guess this is my fault, since I don't seem to know how to order what I want.  \n\nAnd no, I didn't yell \"Pho Q!\" at the waitress, don't even start with the bad Pho jokes. But I do admit I am a little pho-king irritated. ;)", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "Review strictly for the soup and fresh spring rolls.\n\nI love soup, and I love a good BBQ pork fun noodle soup. It was excellent broth, excellent thick noodles, good vegetables and wonderful broth. And it was steaming hot. SCORE. The fresh spring rolls were awesome,  thickly filled and very fresh., I will be back.", "author": "Charlene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "Yes, their menus are a little creepy with a woman staring vapidly at you from the front cover, but it just adds to the charm, right? \n\nPho is the the go-to hangover cure, naturally, and this place is one of the best for it. Cheap for a giant bowl of pho and all the fixins, and a myriad of sauces for those in my life that prefer their pho tasting like Roosters and Plums. I can never finish a bowl, and believe me I try. For pho I'd definitely head here over Sunflower. Its a working man's food, and by work I mean drinking and by man I mean liver. This hits the spot every time.\n\nAside from this, service is good, and the water, for some reason, is extra satisfyingly cold and delicious. Its never crowded, good for me, maybe not so good for Thanh Tam but never completely empty either.", "author": "sholeh m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-08", "description": "Oh, how I wish there were decent Vietnamese in the Mission.  \n\nSometimes I just crave it, but can't drag myself to the Richmond or Sunset to get the real deal. Like yesterday. So again, I end up at Thanh Tam II, someplace I considered reliable, if not particularly spectacular, to address my pho needs.  \n\nOy vey. Maybe it's gone downhill, or maybe my eyes weren't open wide enough before. I've never expected fancy, but I do want a basic level of sanitation. \n\nFirst bad sign: when we sat down, my friend said, \"Do you smell that? it's...the rags they used to wipe the table.\" Indeed, there was a mix of inglorious stink wafting through --I'm not sure where it was from.  \n\nNext: I had been sipping my tea and chatting when I noticed a pink smear on my teacup. Just lipstick, I thought. Wait, I'm not wearing any lipstick... So that's... someone else's.   I almost threw up.  \n\nWe received a clean cup with no acknowledgment or apology. Now, I'm not expecting a lot from a hole-in-the-wall, not thinking there will be great service or even someone to explain anything on the menu (and there certainly wasn't).  But I do expect NOT to have someone else's rancid lipstick in my mouth!!!\n\nOh, and the chicken pho broth tasted like soap.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-06", "description": "We ordered shaken beef, fried prawns, imperial rolls, catfish and bok choy and grilled pork chops with fried eggs over rice. Everything was good and well-cooked, but some of the items were not what i expected. I'm used to shaken beef served in a pepper-y sauce with a side of pepper and lime wedges. For the fried prawns, I was expecting the type that is usually served with garlic noodles, instead, the prawns were more like large, crispy fried shrimp you could get a seafood restaurant.\n\nIt was all solid though, and despite not getting exactly what I was expecting, I would still eat there again, especially considering that they deliver.\n\nUPDATE: I've been back several times now, and, based on other yelpers, ordered the lemongrass tofu and the scrambled shrimp and egg (a la carte). The tofu dish was light and flavorful, with crazy-huge portions. The scrambled eggs and shrimp? SCRUMPTIOUS. These 2 dishes alone are unique enough and yummy enough that I would up the rating to 3.5 stars.\n\nSeems like with any restaurant, if you know what to order, you'll come away happy.", "author": "Sabine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-07", "description": "Although I still give it 3 stars, it's actually lower than my original 3 star rating if that makes any sense.\n\nI got a rare beef and beef ball pho here the other night. $8.20 for the stinjiest amount of noodles and meat EVER. I don't recall getting such a small portion the last time I came here. Maybe I was expecting more because I was super hungry and craving pho. Anyway, the beef ball was literally ONE BEEF BALL. CUT IN HALF to make it look like you got two. About 4-5 small slices of rare beef, and a handful of noodles.\n\nSUPER LAME. I'm really disappointed. Now I don't know where I'll get my pho in the Mission that's not far away from my place. =(", "author": "Angela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-06", "description": "Came here last night and we ordered the BBQ Chicken plate over rice and the BBQ Chicken and Imperial Roll with Vermicelli noodles. The dishes were yummy but the BBQ chicken was a little on the salty side.\n\nWe had to get at least 2 refills on iced water to wash the saltiness down...that's why I'm taking away one star.\n\nPlace was tiny, service was ok, food was good but a little on the expensive side for Vietnamese food. I could find other Vietnamese restaurants that are better and cheaper elsewhere.\n\nOh...and they deliver....I guess that would be a bonus but the minimum order for delivery is $20.", "author": "V M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-04", "description": "I have only ever eaten the pho at this little place, and so maybe I'm not the best authority on their overall performance... but I maintain that this is some of the tastiest pho in the Mission.  There's always a table, it's very fast, it's exactly what you'd expect to pay, and it's good.  That, when it comes to a place servicable to my craving for pho, is good enough for me.\n\nShould you kill yourself to eat here?  Heavens no.  If you're in the neighborhood on a budget and need a bowl of the good stuff, this will definitely do the trick better than Sunflower ever could.\n\nAnd, you can have a beer.", "author": "Laura F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-07", "description": "A cozy, perfectly fine little Vietnamese place to chat with a friend, or read. You can be in/out in 20 minutes start to finish, so don't plan on it being an \"outing\" in and of itself unless you can't stand your dining partner.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-29", "description": "If you're into service and ambience, don't bother...\n\nFood here is awesome, though.  Cheapest decent lunch on the block. What El Toro and some of the other \"cheaper\" places around here charge is asinine...\n\nSunflower opens at noon. WTF???", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-23", "description": "I left San Francisco last year, and Thanh Tam II was one of the first things I missed about the city (along with Taqueria La Cumbre, fernet, and good Manhattans).  \n\nFor a few years, this place was a twice-weekly ritual for me.  Some combination of chicken salad, spicy curry chicken, lemongrass chicken, BBQ beef, and/or springrolls.  Always amazing food, and really cheap.  \n\nTo be fair, I got into a rut with my favorites, and I haven't tried even 20% of the menu items.  I ordered soup a few times, and it was just okay--nowhere near as good as, say, Tu Lan.  But I didn't really care... damn, I miss that lemongrass chicken.\n\nAnd in the interest of full disclosure, I should also admit that the service wasn't always fabulous here--though there was a young male waiter who was great... and I should be shot for not remembering his name.  But you probably wouldn't wander into a cheap Vietnamese restaurant expecting four-star service, would you?\n\nBut yeah... crazy good food.  I'm praying that they open Thanh Tam III in my new neighborhood in DC.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-02", "description": "The vegetable noodle soup here is better here than the one at Sunflower.  \n\nDifferences:\n\n- Tofu isn't fried\n- Noodles taste fresher\n- Vegetables are bigger and fresher\n- The soup is better\n\nAlso, if you are a advocate for eating fried eggs on top of some kind of meat and rice.  You can order two fried eggs for any of their rice and meat combos.  It's the BOMB!!\n\nService can be a little slow because there is typically just one person on the floor hosting, waiting, and busing so I would cut him some slack.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-22", "description": "It seemed like everyone in San Francisco was getting sick - my friends, my co-workers, my fellow Muni riders. By the middle of February I was surprised and a little elated that I managed to make it through unscathed. That started to change Tuesday, and by 4:45am this morning I was hacking and coughing while calling work to leave a voice mail letting my boss know I wasn't going to make it in. I finally succumned to the flu of 2008.\n\nWhich meant pho was on the agenda for tonight. I wasn't going far from home, which made Thanh Tam the perfect choice.\n\nOverall, not bad. It was crowded, but they whipped up my takeout order in less than 10min. Service was great, the guy immediately suggested the shredded chicken soup when I mentioned I was sick. Why that is listed under seafood noodle soup on the menu I have no idea. I wish there was more chicken, but it didn't seem oiled up, which was nice.\n\nNothing outstanding, but above average. Though if I wake up tomorrow back to normal, I'll revise with a fifth star. Wishful thinking....", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-13", "description": "No wait on a Friday night. \n2 drinks + apps (veggie crepe, yum!) + 2 HUGE entrees = $20.\nLots of fresh veggies .\nStir-fried (as opposed to deep-fried) tofu & chicken.\n\nI loved the spicy chicken lemongrass bun dish. Pair it with a Saigon beer and you have yourself a meal!", "author": "Anika K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "I will walk many blocks just for a thai iced tea from here.   Very refreshing!  Not too sweet, not too flat- juuuust right.", "author": "Nadiyah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "We ordered dinner to be delivered and I must say I am impressed. Our food arrived in a timely fashion, the portions are large (I had enough to reheat and eat the next day!), the flavor was great, and the prices are perfect. \n\nI want to give them five stars, but I am going to reevaluate after I eat at the restaurant and get the full effect of Thanh Tam II!\n\nAs a dedicated vegetarian with vegan tendencies, I am more than satisfied with the tofu lemongrass noodles and the fried veggie spring rolls.\n\nUPDATE: November 20, 2008\nWe went to Thanh Tam II before we left for our trip to NY. Spring rolls and a Thai iced tea and I was so full! I took the rest of my rolls, rice, and some noodles with me to the airport and ate them as a pre-flight snack. Slept soundly the whole way there, woke up refreshed and ready to go!\n\nNot only is their food delicious, the restaurant cozy, and the service prompt - they were playing football on the TV. Everything was just perfect.", "author": "Rikki W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "I really enjoyed my first experience here.\n\nWe started off with the deep fried pork spring rolls, delicious!  Crispy and well done.  Reminded me of the fried rolls at the Slanted Door.\n\nOur main dish was 2 orders of the Beef Pho, thankfully I had the best company ever to show me how to season and eat it correctly.  It was delicious, the broth was so flavorful!  And ofcourse we enjoyed our meal with a Vietnamese beer, 33 Export Lagar (fantastic btw). \n\nSmall, cozy place.  Nothing to rave about inside or outside appearance wise.  But those are usually the best places to eat anyhow.", "author": "Inga B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-07", "description": "It's no Saigon Saigon, but neither are they:  they're gone, and the space is being ripped apart to be made into something new.  They weren't spectacular, but they were pretty damn good for the price.\n\nThe food at Thanh Tam was all right.  Rice bowl.  Meat.  You know.\n\nIt was okay.  It's no Saigon Saigon.....they're gone.\n\nI miss that crazy paint job.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "Lemongrass tofu over vermicelli is my fav food in the city. It's always good. I go here all the time and I'm not tired of it yet. Sometimes I get the spicy version instead, and it's pretty spicy but I manage to eat it! Salt and pepper tofu is a good appetizer too. Fried bananas are good for desert. The service is very friendly, they remember me and my regular order. I like the atmosphere here too.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "My prefered Vietnamese restaurant over Sunflower which is close by. The family who run it are really sweet, the place is clean (my big complaint about Sunflower), the portions are large, well made, fresh and quiet. I don't know why this place isn't more crowded - I've been on weekends and during the week and I can always get  a table.\n\nGreat value for all the meals, I can't say more about this little spot.", "author": "Spoon G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-24", "description": "Food was all right but when checking my credit card statement they charged us more tip than we put. It wasn't much but the intention is what counts. Definitely not going back to this place.\nRomy", "author": "Roman O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "This place is consistently Delicious. If you're in the Mission and looking for some cheap, tasty Vietnamese, this is your place.", "author": "Mere H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "Awkward date.  Great food.  Pretty cheap, which is good, since we went dutch.\n\nCheck it out.", "author": "Jill K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-19", "description": "I have frequented this place on many occasions, not necessarily because the food is great, or the ambiance is great, but simply because it's one of the only places in the inner mission (Sunflower being the other)  to get a bowl of pho soup. It's not the best bowl of pho I've had but It does the trick for when it's much needed. The food menu always reminds me of a mail-order bride catalog.  There are two things that are always consistent about this place, service is always quick and the fortune cookies are always stale.", "author": "Glenda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "I finally got around to trying this place just a couple weeks before moving out of the Mission, and I wish I'd tried it earlier. As it was, I went three times in about ten days. I love the beef and egg roll vermicelli noodles, served over a delicious salad with a nice amount of cilantro. My girlfriend loved the tofu noodle soup (especially because the tofu was not fried), and we both liked the potstickers (the sauce for which goes great with everything). I also stopped in for lunch one day and had a delectable Vietnamese pork sandwich for $5. All that in a nice, quiet atmosphere. I never had it so good at Sunflower.", "author": "Marco L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-20", "description": "The combination beef pho was excellent, and the service friendly and quick.  Can't really complain about the prices either.  I was the only one in the restaurant for a late lunch, and the waiter left me alone by the window for most of my meal.  That was perhaps the best bit, as I got to watch Valencia traffic for a half hour or so.\n\nThe subtle decorations and accessories--lamps, mirrors, etc.--aren't much to write about, although they are clearly from Ikea.  (How often does one need to visit a store or its website to recognize its merchandise?  I promise I'm not in Ikea all that often!)", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-14", "description": "Quality beef + rice dish. The cashier lady actually smiles.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-16", "description": "I was truly surprised by some of the \"not so good\" reviews for Thanh Tam II. I love this place. The vermicelli bowl with shrimp and egg roll is delicious. The pho is great. The spring rolls are very fresh. This place is rarely crowded and there is never a wait. If you are torn between Sunflower and this place, give Thanh Tam II a try. I doubt you will be disappointed.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "been here a few times. i liked the Bun dishes better than the Pho i had. the Pho was OK, but not exceptional. the Bun was above average with perfectly grilled pork and an excellent Imperial Roll. decent amount of fixens below the noodles. i've had that the last couple times i've been here and it was consistently very good.\n\ninteresting Discovery Channel shows on TV too! ;-)\n\ndefinitely better than Sunflower down the block. Sunflower's Pho Ga was bland broth with tough meat and well below average.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "You don't go here for amazing service or ambiance..you go here for the amazing Pho and cold rolls. I've been going around town to try to beat this place. Personally hands down the best Vietnamese food all around. It's totally resonably priced and you can always get a seat! My fave!! YAy!", "author": "Deandra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "In a city FULL of great Vietnamese restaurants- this is the only one I've found that actually DELIVERS. And I mean that literally. I must have called about 10 places (that list themselves as delivery ) before I got to Thanh Tam II.  6 let the phone ring forever, 2 wouldn't make the 3 mile pilgrimage to my house, one number was disconnected, one was closed for Valentine's Eve. Really. But this glorious little gem came through! I ordered Rare steak Pho' , a vermicelli bbq beef plate and imperial rolls- everything was fresh and delicious and came in about 20 mins. sooo happy!", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Do not go for the decor.\n\nDo not go for the service.\n\nBut please, oh please go for the food. This hole in the wall would never attract you, with its garish neon sign and nondescript interior. And the plastic ugly menu might even scare you off once you were inside. But once your food comes (and at lightening speed!) You will change your mind.\n\nI don't know why I haven't reviewed this place, I've been coming her for Pho for years. I am also a huge fan of any of the lemongrass noodles (Spicy Chicken lemongrass?? YUM).\n\nAlso, it is ridiculously cheap. It's never crowded. And you might not be charmed by the wait staff, but you will certainly feel satisfied.", "author": "Patrice S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-28", "description": "This review, my very first, is for Felix.  He's Kristi's old roomie who had the privilege of hearing me go on and on about food all afternoon, Vietnamese food to be specific.  Felix's parents are both ethnic Chinese peeps who lived in Vietnam for a while.  Felix, like me, was lucky enough to grow up eating Vietnamese food.  \n\nToday has been very cold and the beers I had this afternoon have worn off leaving me colder than cold and in the mood for some noodle soup.  I have to agree with most of the posts about Thanh Tam II - the food is by far sub-par and the service is not great - however, I live in the Mission and this is one of my default places for inexpensive Vietnamese food.  \n\nThey can be a little heavy handed on the msg (mostly in noodle soups) but for the most part the experience is fulfilling.  Today's Mi Won Ton Hai San - egg noodle soup with wontons and seafood - hit the spot.  The msg was not overwhelming and the soup not only warmed me up but I enjoyed it in the process.  Felix had the Bun Thit Nuong Chay Gio - Vermicelli with BBQ Pork and Imperial Rolls - which he enjoyed but the pork was strange (which I've noticed in the past.)  \n\nFrom past experience: the fried squid and the imperial rolls (fried egg rolls) are good.", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-24", "description": "Wednesday afternoon at 12:00 sharp.  No wait.  \n\nFor the two of us, me - rice with tofu, curry sauce and veggies and my friend - seafood rice/noodles, plus tea for both of us - bill came out to be under $14!\n\nNothing spectacular.  Good lunch meal that's quick and not hard on the wallet.  Plus portion size is great!", "author": "Swetha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-20", "description": "I came here for a bowl of Bun last week.  The egg roll on top was big but super-greasy.  The chicken was mostly gristle and the fish sauce was mediocre.  I've had much better, but Vietnamese options in the Mission are limited.  Probably won't be back.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-22", "description": "Excellent Mission cheap eats with friendly service\n\nI ate here twice. The quantity and quality of food is excellent. First trip I had fish soup, vegetarian spring rolls and iced coffee. It was almost more than I could eat. \n\nThe second time, I just ordered the vegetarian spring rolls. They were served to me fresh, the tofu was warm inside and the vegetables and wrapper were cold. The peanut dipping sauce was slightly spicy and had shreds of carrot. My meal with tip came to $8. That makes this place a winner in my book!", "author": "Lane G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-28", "description": "Went here last night and my thoughts where this...\n\nIt was empty during dinner rush but the food was pretty good.\n\nThe wait staff was pretty friendly but lacked service.\n\nI had to ask for more water than once.\n\nThe thai ice tea was pretty good\n\nFairly cheap \n\nThe shrimp and pork rolls were actually good, lots of shrimp and pork.\n\nThe place had a good feel to it and it didn't smell funny.\n\nThese were the thoughts that were running through my head when i left. it wasn't anything that wowed me or made me tingle. it was a cold night in the city and i was in the mood for pho. I refuse to go to sunflower since i'm scared of fugly waiter guy. i would come back but i hope i find something a lil better in the mission.", "author": "Lucky M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-16", "description": "Cute little restaurant but spotty service and the food wasn't that great for the price. Both my boyfriend and I had noodle soups. \nI had the large rare steak & beef ball noodle soup.  I like the taste of the noodles and the broth is really yummy. I didn't like how they cut the beef balls in half and the skimpy portions of steak. I wished I had more noodles in my bowl. For $7, I expected a bit more food. I liked how they constantly filled up my water and the Thai ice is really good too.", "author": "Gladys C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "I admit to not knowing a whole lot about Vietnamese food and whether or not it is authentic, but I know I like it and have eaten a range from fusion to just weird stuff so H and I decided to pop in and yeah, it's a hole in the wall - but hey, it's the Mission, right? - and yeah, there was a party of 12 but really, I couldn't really fault it. \n\nThe waiter was a bit harried because of the party and said he'd get the appetizer out quickly but the dinner would take a few minutes because of the party - because they cook the dinners fresh each time! Good sign.\n\nThe Deep Fried Quail appetizer was superb! It was juicy meat and crunchy skin, flavorful but not gamey, and, with a squirt of fresh lime, delightful! After they had a tug of war to get the plates with little piles of bones off the table (we were sucking on them, it was so good) they served the main course, which, by the way, wasn't any a longer wait than most restaurants. \n\nHad eggplant with some tofu thrown in (tasty), and fresh steaming rice (I am a rice snob), and the chicken lemongrass vermicelli noodles (we'd ordered beef but, whatever!) - all of which were good...\n\nbut the quail! The quail! I'd go there just for the quail (and order two!).", "author": "Mi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-13", "description": "The only thing better then pho when you are hung over is pho delivered when you are hung over.  TT2 delivers piping hot pho to your door steps.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "Cheap, good vietnamese food in the heart of the mission. I always get the medium sized pho, and i am plenty full afterwards. Today I ordered the seafood noodle soup and got only few bits of seafood here and there, but the broth was yum. Quick service, clean place. Would recommend if you're in the area and want a warm tummy full of pho.", "author": "Kat D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "The food here is fantastic. With this on the same block as Sunflower, I would never go back when this is right down the block.  I think the real win here that they truly grill their meats and seafood.  The service is seriously lacking, but that won't stop me.  Too bad I don't live closer I would get takeout every damn day.  Go.", "author": "e w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-24", "description": "UPDATED REVIEW: \nI'm sad to say I'm docking 2 stars from Thanh Tam II. I stopped by for a late lunch today, after a long hiatus from my last visit, and had a pretty disappointing experience. The dining room was a mess, it took the owner a while to notice me and take my order. She may have been in a bad mood, as she was pretty curt with me, and I just felt negative vibes from her. \n\nDespite the experience, the iced coffee was a delicious as I remember, and my grilled shrimp & pork over cold noodle was yummy. Lovely char on the shrimp, but not chewy and tender grilled pork with lots of garlic and peanuts on top. I still maintain good for takeout, but I don't think I'll be popping in to dine ever. :(\n-----------------------------------\n\nORIGINAL REVIEW:\ni've been eating at thanh tam on and off since it opened. i used to come weekly, and sometimes even on the weekends. i feel i've patronized this place enough to figure out what works and what doesn't.\n\nthanh tam knows how to grill meat. order anything with grilled meat and it will arrive beautifully charred on the edges and carmelized, as grilled meat should. that said, any of the cold noodle (bun) dishes with grilled pork are very tasty. if you can, stick with grilled pork -- it's their specialty. i'm not crazy about the 5spice chicken or grilled beef, and have had a rogue bowl of bun with \"warm\" noodles, that was just wrong. my personal fave is bun with grilled pork & shrimp -- yum!\n\na few of the appetizers and specialty dishes are hits and kick my ass hard.\napps:\n- shrimp & pork spring roll, vegetarian spring roll (look under veg dishes). the peanut sauce w/a little chili added is too good.\n- fried wontons\n- fried quail (my friend swears by this)\n- salt & pepper squid (tender, salty & spicy -- sublime when it's done right)\n- vietnamese pancake w/mint & lettuce\n\nsalads: any of the beef salads with a squeeze of lemon\n\nsoup: most of the soups won't knock your socks off, but they're okay, and filling. try the westlake soup.\n\nentrees:\n- any of the grilled pork dishes under the vietnamese specialty section\n- butter garlic chow mein under vegetarian (garlicky!)\n\ndrinks:\n- the iced coffee is the bomb, and i cannot get enough\n- the lemon soda can be sweet, but dilute it on a hot day and it's very refreshing\n\na few observations and expectations:\n- avoid the chinese dishes (they're mediocre and often bland)\n- dishes can be inconsistent especially when the owner is not around\n- it's not a true pho joint, so i don't expect fireworks in this area, but most folks come here just for pho (although the beef stew is very good)\n- the bathroom is always clean\n\nthanh tam is a family-run restaurant, so do not have mission hipster expectations when dining here. the owner's son runs the dining room, her photo watches over the restaurant, and her niece is pictured on the menu (a little factoid). service can sometimes be slow, and not totally on top of their game, but i forgive them for these shortcomings. they've always served a good meal, and it doesn't pretend to be what it is not.\n\ni liken this place to a real neighborhood, getting-to-know-you kind of place. i often run into friends here, and sometimes meet new people. that's rare on valencia, these days.", "author": "Antoi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "This place is yumlicious.. and cheaplicious!  I love the great selection of pho.  Beef, tripe, seafood, chicken, combo... There are some Chinese dishes, too, but I almost always stick to the pho whenever I come here. my other half always orders the grilled chicken and whatever over rice.  Whenever I sneak a bite, it's always really good - always containing the five flavors essential to Asian cuisine.  \n\nThe wine selection isn't very good, but have their Vietnamese beer - Saigon or Tiger - with your meal.", "author": "B Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "I can think of few things more appealing than pho when I'm feeling under the weather.  Whether my lethargy is from a simple lack of sleep, a nasty hangover, or the common cold, sitting down to a steaming bowl of broth redolent of that magical combination of fish sauce and lemongrass makes me sigh with relief.  Now this may not be the superlative \"best\" pho out there; this distinction seems to be a point of contention amongst the pho lovers out there (personally, my loyalty lies with Turtle Tower), but the pho at Thanh Tam is pretty satisfying regardless.  I have yet to try anything else aside from the chicken pho/pho ga (I think its called \"shredded chicken noodle soup\" on this menu) so this review is primarily for that, although I have been tempted by their other offerings.  Serving sizes are large;I have yet to finish the medium bowl, and it comes with the requisite assortment of bean sprouts, Thai basil, lemon wedges, and slices of Jalapeño (standard sauces one might expect at a Vietnamese restaurant are also on the table).\n\nMy main quibble with Thanh Tam II lies in the service, which seems to echo throughout others reviews of this restaurant.  The last time I ate here (last night) the staff started to turn away customers at 9 PM, despite having their posted hours of business listed as not closing til 10.  We were the last ones there at 9:30 and I felt a bit rushed, but it wasn't a deal breaker for me.  Otherwise (and on other occasions) I've found that the staff here do an acceptable job, though without any flourish that one might expect from a more upscale joint.  Honestly though, I kind of appreciate the hands-off approach they take here service wise, I'm here to eat my food, not to chat it up with the waiter/waitress.  The ambiance is so-so, not remarkable one way or another.  \n\nBonus point: they scored 92 (out of 100) on their restaurant inspection, which isn't perfect, but certainly hasn't skeeved me out from returning (and is a few points higher than my beloved Turtle Tower at 88). \n\nBottom line: come here expecting good food with relatively slow but otherwise unremarkable (hands-off?) service and you'll leave satisfied.  Get the chicken pho!", "author": "Nicole P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-04", "description": "This review is for \nSpicy chicken with Lemon Grass Noodle: $6.50\nBeef with Broccoli: $5.95\n\nBroccoli beef was bland.  Spicy chicken with lemon grass noodle was yummy, reminiscent of Thai beef salad.  Service was poor.  We waited and waited to order, our forks and chop sticks were slammed down in the middle of the table, and Jeff G. waited and waited to get his coke while the waiter watched tv.  The dining room was also extensively smoky with burnt oil smoke.  Pretty expensive for Vietnamese, but a good alternative to Tu Lan after 9pm or on Sundays.  Free delivery is always nice as well, but there is a $15 dollar minimum on delivery and  $10 dollar minimum on credit cards.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-01", "description": "Evergreen is my Vietnamese restaurant of choice in Mission, but it doesn't open on Sundays.  We tried to go to Sunflower next based on yelper recommendations, but the place wasn't open until 1230, and we were hungry at noon.\n\nThis was not a bad alternative.  Very clean, and we didn't have much problem with service.  Then again, we lucked out by being the only customers.\n\nMy out-of-town guest loved his pho, and I enjoyed my shrimp cake sugar cane rice noodle.  Will probably still go to Evergreen b/c it has better entrees.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "I only eat one thing so thats why i give it a 4. I use to get the broccoli chicken with fried rice. then i changed it up to broccoli tofu w/ fried rice. Its 7 bucks but i crave the shit. I love it. the Fried rice is bomb too. its that soft mushy kind. So if you want chinese food got to Yum Yums next door but order the fried rice at this place. Yum yums fried rice blows. \n\nThe Eggrolls here are bomb . the to go packages are reusable too. \n\n-Tons of food on your plate\n-fried rice is the yepa yepa yepa\n-reusable togo packaging\n\nonly delivers after 5 so that sucks...", "author": "Richard J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-27", "description": "Had the pho here and it really hit the spot.  It's a good place to go to get your Vietnamese food fix and the service is quick. \nThe night I went, they had a Jackie Chan movie from Hong Kong playing on a tv mounted in the corner of the restaurant.  It had spanish subtitles.  Weird.", "author": "Naomi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "So we came here after church. I guess this is the place to be for dinner for most people who are hungry for vietnamese/chinese. Very attentive service and good food. I had the usual bbq chicken vermicelli and my husband ordered the rice dish with the bbq chicken. We also ordered the spring rolls and egg rolls. Everthing was very good. Only a buck more than your usual pho places. We didn't mind since the portions were very generous.\nI didn't give it the full 5 stars because they didn not have the banh mi sandwiches on the menu. Too bad, but we still will come back again.", "author": "Mauling W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "My friend and I fell in to Thanh Tam on a rainy afternoon. The pho was fabulous, the vietnamese sandwich very authentic - even though the meat was ... well ... not perfect. The service was a bit slow and the waitress ... a bit chilly... but I'd still go back for the Pho. My friend, a Pho afficianado, deemed the Pho \"very good.\"", "author": "joan g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-19", "description": "it's a pho stop in the middle of mission. it has no competition, so it can be whatever it wants and it will still be in business.\n\nmsg was just right in my soup, but besides the flavor of the msg, i really didn't taste much beef broth, or any other spices for that matter. i'm just glad i didn't walk out with a numb elbow.\n\nthis district is known for its dirty mexican food, and bacon wrapped hot dog, not really for the vietnamese dishes. but an abundant amount of bars for the fodder that you're about to have with the guy who sells books at the corner of Valencia and 16th.\n\nbe careful if you're driving. the parking Nazi's are always out to brand you with their fines. side walk blocking, street cleaning, or if your car is jewish, you're not getting any mercy from them.  GrRrRR", "author": "Noy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "Best tofu vermicelli in the mission and they deliver!  Price is super reasonable. They almost always have a table available and their food is yummy.  Its great for super casual, but certainly not upscale.", "author": "Foreign D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-20", "description": "Excellent lemongrass over noodles and yellow curry.  Some dishes are very bland.", "author": "Ziadee C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-25", "description": "I wasn't drunk like the time I enjoyed \"Vietnam\" in North Beach so that's the preface. I had the pork chop over rice, Very ok, of course the Vietnamese version of pork chop can be a bit deceiving, it's 3 thin slices of pork, does have some with bone, the meat is uneven, some is really good, some fat (not bad) and some be dryness\n\nThere's some cucumbers and carrots, the ngoc mam is just ok\n\nI like that they take credit card, $6 and change", "author": "xo x."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-10", "description": "Finding this place was a serendipitous mistake - a friend and I were aiming for Yum-yum House next door but got distracted.\n\nThis is officially my favorite Vietnamese place in the city.  Yes, I've been to Sunflower down the street, but I've never craved anything on their menu like I crave Thanh Tam II's tofu lemongrass over noodles.  I require it with monthly (if not weekly) regularity.  It completes me.  \n\nThis place is very low-key, no-frills, hole-in-the-wall, and that's my idea of a good time.  The staff is really friendly and attentive and the food is tasty, not expensive and a nice not-greasy alternative to other food joints in the area.  My partner swears by the clay pots and vegetable pho (which is not on the menu, but which they will make for her whenever she wants it).  \n\nI'm getting hungry just writing about it.", "author": "Dani B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "Just two buildings down from my fiancee's place, this nook of Vietnamese goodness makes delightful dishes. Personally unfamiliar with \"authentic\" Vietnamese cuisine, Than Tam receives a strong four stars solely on good eats.  Their dishes food, whether it's the second time back or the fiftieth, are consistent.\n\nI enjoy the rice dishes chicken, pork, beef or vegetable.  They're all good.  I've had better pho at other places, but it's decent here.  My one complaint would have to be the women staff.  The last time I was here and the restaurant was being \"handled\" by the women staff, shit was hitting the fan.  They were behind on orders, in a panic, unapologetic, and openly avoiding the continuously ringing phone.  Granted it could have been a bad night, but the fact that they were in a major panic and melt down is very disheartening. To think that they were in such upheaval that they refused to answer the phones makes me genuinely angry.  So, every time I plan on eating here, I have to peer through the window to see who's \"running\" the restaurant (just to make sure it's not them).", "author": "Darkie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "Tofu sandwich is delicious, lemongrass tofu dishes are good.  Just had price increases on their newly printed menus.  Staff is not very friendly but the sandwich makes up for it.", "author": "K W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-18", "description": "Order was delivered very quickly.  It took maybe 25 minutes instead of the quoted 40.  That's awesome.  I had the grilled pork & egg roll over rice, beef pho, sesame beef, and some extra imperial rolls.  All of it was exactly what I was craving.  And it's all reasonably priced, too.  I'm very happy to know this place delivers to my place.", "author": "Richard Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "I'd call it three and a half stars - but with an extra half star for the squid we had.  I love that there's vietnamese in the mission, but at the same time the price points are a little high for vietnamese. The pho was serviceable, the broth was ok, but not insanely great depth of flavor. Overall, the pho was good. No tendon was on offer though, only tripe and rare steak, brisket and meatball. They did have a nice array of pho ga though and a HUGE selection of bun, rice dishes and other items. We sampled the salt and pepper squid which was DELISH. Salty, peppery, superbly crisp batter and big pieces of squid that were tender and cut just right. FAB.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-11", "description": "I love bun, especially the Imperial Roll and BBQ Beef bun, and Thanh Tam II makes a fair representative of the species.\n\nImperial Rolls are decently sized and well fried, but seem under spiced to my taste and unvaried in their consistency --- porky, pork pork.\n\nThe BBQ beef is a perky  reddish color, plenty beefy and tender, but again lacking in any special flavor.\n\nThe Bun base is great though, not simply a limp pile of noodle --- it's got a solid salad under-layer with cilantro, mint, and pickly cucumber and carrot.   All normal Bun toppings are included, but are not especially numerous or memorable.\n\nThe price is super (in the mission its really exceptional), and the menu is expansive, including several bun varieties I havn't found elsewhere .  The Pho is also excellent.", "author": "Gustie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "I got the pork and rice and it was delicious.  It was fresh and simply made.  My friends' food looked awesome as well..and the eggplant dish was great.   Lots of sauce, just like a like it, but without it being MSG-y and overpowering.  \n\n The price is completely affordable.  The decor and atmosphere is not impressive so do not take a first date there, however,  it's a great place to go with friends.   The service is a little off...I think she was confused with the amount of tables she had.", "author": "Ann M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "This place wins. I tried the tofu salad and my partner in crime got the vegetable noodles. We don't know what they put in each, but they were significantly more interesting than our usual at Sunflower. More tang, more spice... f yes.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-13", "description": "I go back and forth about Thanh Tam II. I get take-out from here a lot (okay, I live upstairs...it's just so damned convenient!), and some things are definitely better than others.\n\nThe good:\n- curry tofu. The tofu is a good spongy texture and soaks up sauce perfectly. The sauce is flavorful, has the right amount of spice, and the dish has a good assortment of veggies.\n- vermicelli with grilled chicken and egg rolls. Tasty chicken (dark meat, which I prefer, but not too fatty), nicely crispy pork \"egg rolls\" (imperial rolls), an allover good combination of meat, rolls, noodles and lettuce/cucumber.\n\nThe not-so-good:\n- The grilled pork (tried with vermicelli and alone) is just too fatty/greasy for me.\n- spicy chicken with lemongrass. It's okay, but not as flavorful as it should be, and doesn't hold a candle to Sunflower across the street.\n\nThe menu is ridiculously and needlessly huge, given that the \"Vietnamese Style BBQ Meat\" section is mostly a repeat of the \"BBQ Meat Vermicelli Noodle\" section, except over rice rather than noodles. I find that more and more when I order from here, I really only get the \"good\" items listed above. The taller half also orders and enjoys the Combination Wonton Soup, which I think is okay, but a little salty. I\n\nf you live in the neighborhood, it's worth getting food here a few different times to figure out what you like, since it's cheap and fast, but if not it's kind of hit or miss.", "author": "Valerie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "This place is great in my book. Better than Sunflower across the street, and featuring totally rad service. I had the herb & squid salad, and the squid was perfectly cooked. The server overheard my friend and I talking about delivery service (or rather, my bemoaning that my husband would never allow it) and he deftly tucked a takeout menu under my plate as he passed. Awesome. This is great food, fairly priced, served by nice people - you can rarely get all three in the Mission.", "author": "Jess F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-18", "description": "My review is based on the service - they are very rude and impatient.  I've ordered food from them two times and it's been the same - they blamed me for them getting lost upon delivery.  I live in a pretty well known area (Caltrain station).  Who's fault is that?", "author": "Sandy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-13", "description": "I love this place.  Come here at least once a month.  Home cooking vietnamese food.  I love the spring rolls, the vietnamese crepes (banh xeo) and grill pork with vermicelli noodles.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "Goodness. Fish filets in black bean sauce, supreme fried rice, and veggie imperial rolls. And a 33. Delicious. Excellent waiter, too.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "My wife and I wanted some classic noodle soup. This place delivered and how. It took a little over an hour, but the thinly-sliced raw beef that cooked through when combined with the tangy broth and the bean sprouts and Thai basil.....yum. All of it yum. \n\nOrder from this place when you're sick and want noodle soup.\n\nCan't speak much to anything else on the menu though. Well, we had the shrimp spring rolls, those were good too. But that's it.", "author": "Mr. R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "my go to spot for vietnamese food near mission dolores not because it's good, just because it will satisfy my taste for vietnamese food within walking distance.  Relatively expensive compared to tenderloin vietnamese, but i'll pay the extra few dollars for convenience.  Good sign is that there are mostly asians eating there.", "author": "LT B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-21", "description": "ordered a chicken salad $9.  way over priced.  right when i stuck my fork in to grab a bite... guess what i found?  a piece of hair.  that's it for me.  not coming back!!!!!", "author": "Mimi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "Y'know, this place actually doesn't suck.  For the price, it's pretty decent Vietnamese food.  The service / ambiance / decor left me looking for more, but the food and price made up for it.  I'd come back but probably go for take out.", "author": "Ankur P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-14", "description": "we been ordering from the mission store for over 5 years but now it closed down... store no.2 is still up and running, still remember the first time order me the two pork chop, shredded pork, two eggs and meat loaf for $7 it was well worth it... almost could finish it every time, no i tired to order the same thing well its $8 now and it doesn't come with two eggs anymore, well you add it just pay more. everything on the plate just got smaller thru the years, used to be like the bomb but now its just ok... kinda went down hill but we still order from this place once in the blue moon...", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-09", "description": "Spicy beef on lemon vermicelli with very fresh vegetables was light, crisp, refreshing.", "author": "A J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-16", "description": "Man.  Anyone who doesn't give Thanh Tam five stars is a psycho.  This place is awesome to the core.  I've never eaten there though.  \n\nThat said, I order delivery from them at least once a week, between school and work and all, they're consistently awesome, and that never changes.  The delivery, although I'm up at the top of a very high hill in Noe, pretty far away from the restaurant, never takes more than 30 minutes.  The best part is the food is delicious.  The vietnamese eggrolls are awesome, the vegetarian spring rolls are awesome, the pot stickers are awesome, and every single ala carte dish is awesome.  (that i've had).  My favorite dish here is the Spicy curry tofu, its creamy and delicious crammed with bok choy, mushrooms, pea shoots, broccoli, carrots, baby corns and delicious tofu.  Every single time I have it I'm like \"Dang.  This is a good curry.\"\n\nI guess the lesson is, don't judge this joint on the inside.  Stay at home and rent a movie and order it for delivery and you'll fall in love", "author": "Devon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-07", "description": "went here or brunch....got the spicy beef with lemongrass noodles (vermicelli) okay food here..i've had better- the prices are same for any vietnamese restaurant...\n\nin conclusion, the place is alright, not a must eat place but if you're starving and have no choice, i guess this place will do", "author": "AK M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-02", "description": "My vermicelli bowl wasn't bad, and neither were my dining companions' Pho dishes.  But the service, or lack thereof, left a bad taste in my mouth.  You're on your own after they take your order.  Head to Sunflower on 16th for a better dining experience with Vietnamese cuisine.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-27", "description": "petite portions...premium pricing...bored bland.....pork lacking light char....flame broiled taste none... egg rolls fine crisp out and nice texture in...though tasteless and uneventful flavoring....no fresh drip..iced coffee poor....business appearance mostly from delivery making....simple meal average $ten after tax/tip...plus couple $dollars add drink....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-20", "description": "This place will always be memorable because it was the place where I had my last lunch of 2007 and first dinner of 2008 with a newly found mentor/artist friend. After a day of priming walls and nailing wooden panels together while feet stomp heavily from above (poor neighbors who live above SoEx Gallery). Okay, so that has nothing to do with the food at Thanh Tam II but I was never good at intros. Overall, I had a blast eating the yummy noodle chicken soup (rice noodles, I wouldn't have it any other way) on Day One. Then, on Day Two, I had the #52 (thanks to my friend's recommendation). What a great dish! Rice noodles topped with barbecued chicken, julienned carrots, sprouts and a super crispy pork egg roll! Ugh, can it get any better than that? Who knew I could have a gluttonous affair with one dish. Anyway, order #52!", "author": "Dorothy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-18", "description": "My favorite, fast, cheap.. well not cheap, vietnamese restaurant in the mission.  The staff is really nice and the fish sauce is fresh.  I like to order the rare beef salad.  Oh boy, they give a huge portion.  Other then that, i enjoy their bbq port cutlet on rice.  I love the authentic aunt in the background screaming at the nephew. it's classic.", "author": "kevin h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "Found our Pho place in the Mission! We had the Imperial Rolls, Wonton Soup and the Five Spice Chicken and they were great! Nice ambiance - neat & clean. Much better than Sunflower across the street which we found a tad dirty.", "author": "Fiona D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-11", "description": "thanh tam II serves up some tasty pho.  i'd give them five stars if they offered tendon, but their rare beef & tripe pho is still pretty darn yummy - very flavorful broth with well made (tender, but firm) bun lurking in huge quantity underneath.  an unfinishably large portion for only $5.99 - an astoundingly cheap price for any quality food in the mission.  and it's a hell of a lot better than the flavorless pho offered over at sunflower up the block.\n\nthe service kind of sucks, but only insofar as they let you know that they don't care about you as a person.  but i've never been kept waiting for an interminable length of time, or been left wanting for eating utensils or sri cha.\n\ni've also been quite pleased with their fresh spring rolls, and i noticed that they have sugar cane shrimp bun on the menu (which i never order because i'm always fiending for some pho when i dine here).  i'll be coming back whenever i'm around 16th and valencia and in need of pho...", "author": "genevieve g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-10", "description": "i don't think i'll be coming back here again since there are two sunflower outposts across the street.  i gave it a shot tho.  went in for lunch and i was the only person there which made it somewhat lonely and depressing.  not so much that i was eating alone as sometimes i really enjoy eating my myself but when i am the ONLY diner, i start thinking about why there are no other diners, are the owners making a profilt, will they be serving me leftovers, will they have to shut down since no one seems to want to eat there, will they have to collect unemployment soon, and then be on foodstamps......\n\nanyway, the food seemed fresh enough despite my anxiety but it just wasn't anything worth venturing back form.  the spring roll was pretty good but really, it's pretty hard to mess up a spring roll.  the seafood pho i had was really mediocre.  i tasted a scallop that was weird texturally and the broth was fairly greasy.  they didn't give the standard plate of bean sprouts and basil.  they just threw some scant spouts in the soup along w/some cilantro.\n\nthey serve \"chinese cuisine\" as well.  go figure......", "author": "Bird B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Excellent Fuh! Fast service.. always grab this on the way home from work.", "author": "Manoj L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-23", "description": "Some really good Vietnamese food in its own right. This cozy little spot in the Mission is clean and cheap and makes for a perfect quiet weeknight dinner. Little family owned business (their cute little wide-eyed girl kept popping over to our table to say hello) that is charming and has some really tasty spring rolls as well as some fantastic bun thit nuong (pork vermicelli) and pho. My only complaint is that the pork was a little fatty and it took them awhile to get us our check, so in reality this would be about 3.5 stars, but I'll generously round up. I definitely like this place better than Sunflower down the block...", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-22", "description": "Yum Yum! My sister took me to this place and it was awesome! I loved it! As you walk in all you smell are these incredible smells--so divine! I had the butter and garilc chow mein.  The garlic wasn't overpowering at all and it was all the way delicious! I tried some of my sister's. She had the #52. Rice noodles with veggies, beef, and egg roll...OMG..good. My mouth is watering as I write this. Seriously. Just seriously. Try this...Oh, and it's affordable too.", "author": "Mel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-24", "description": "Cheap and average Vietnamese food with quick service. No ambience, no wait. I prefer this spot to the Chinese restaurant next door that's supposed to be \"yum\", but not really.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-17", "description": "Oh you heard the name alright.. the place is called 'Thanh Tam II'.  Don't know where the first location is, but I've been to this spot several times in the last few months. After a long day of running errands or kicking it with my friends, we usually roll up to this spot on a Saturday afternoon.  For me the ultimate objective for lunch is to get something good and cheap to eat, this place takes care of both those key requirements.\n\nThe options on the food menu is your typical vietnamese items, I mean if you want Pho, five spice herb chicken, vietnamase rolls, etc... you get the point they probably have it.  \n\nThe one killer item though that we always get and come back to, has got to be the appetizer item ' shrimp lobster sugar cane roll'  something along that line.   Just check under the appetizer section and look for those elements you can't miss it.  Anywho,  they bring out a bowl of hot water which is then followed by a stack of dry rice transluscent paper.  Then the ingredients follow..  shrimp lobster meat, vermicelli, mint, basil, jooeaned carrots, fish sauce, crushed peanuts.... the ingredients are all separated.    Oh you know where I'm going with this......   yeah, so the dry rice paper is dipped into the water to make the shell of the roll, followed by the ingredients of your choice...  you make it, if you got skills you can make a good wrap, if not the shit slips out of your hands when you eat.  In either case, that shit is off the hook!  After a long day of activities that appetizer hits the spot, straight to the dome.\n\nMan when shit is good you gotta do the right thing and let the peoples know, check the spot out if you like this type of joint.   One!!", "author": "marcus o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-11", "description": "I went over to check this place out only to realize I'd already been here. The first time I had some pretty mediocre food. I think we ordered two rice plates - a chicken and a veggie one. Was definitely disappointed with the food. However, I went back today and ordered the cold spring rolls and pho to go, and was pleasantly surprised. They give you four reasonable sized rolls in one order of spring rolls, and these were really good with some yummy sauce. The pho was great too, the medium was plenty big and I still have some leftover for lunch tomorrow. I'd def consider getting delivery from here for these two items, assuming they deliver to where I live.", "author": "Humaira M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-20", "description": "I wish I could rate the food here, but unfortunately we were completely ignored the entire 15 mins we were there. Walked in (there was ONE other occupied table). Girl at counter sees us, but doesn't acknowledge. So we sit at a table with menus. After about 5 mins, we had picked our dishes and closed our menus. Waited another 10 mins. No one. How disappointing. We left an went across the street to Sunflower. They might be a little more expensive, but at least they acknowledged us. **shrug**", "author": "CAM T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-08", "description": "I am giving this place three stars because it has a cheap menu, which makes me happy.  They are pretty speedy about bringing you the food, but not so speedy about bringing you the check.  I had the vermicelli with tofu, which I thought was a good portion (enough for two meals, really) and filled me up.  Also, the spring rolls are quite good; the best part by far was the peanut sauce.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "Still my favorite after 3 years. I keep their number in my cell phone even though I now live in Oakland, because you never know when you are going to need some damn good vietnamese take out on your way home from the city. mmmmm.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "this place is a hole in the wall.  i have lived in the mission a year and just recently noticed it.  \n\nthis rainy weekend was the perfect weather for pho.  \n\nif you are hungry and cold...stop by and order the medium plate.  prices are reasonable, service is good and we left content and full.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-04", "description": "Pretty decent, authentic Vietnamese food. The pho broth was delicious and the shrimp with scrambled eggs over rice was right up there with the best I've had. The service was slow, as can be expected at a one man show and my tablecloth was ridiculously dirty (I had to force myself not to look down), but it's all about the food at a place like this.", "author": "Alicia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-23", "description": "This restaurant has exceptionally good fried rice.  I know that seems pathetically pedestrian, but they really do. Their fresh veggie rolls also have just veggies in them, no noodles or tofu or whatnot, and their Imperial Rolls are fantastic.  I have never tried anything more experimental there, but a friend of mine swears by the five-spice chicken and the barbequed pork.", "author": "Jude F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-18", "description": "great neighborhood noodle place...\nit's clean and they have good pho and vermicelli noodle dishes...\ndefinately preferred over sunflower across the street", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-06", "description": "I was a little scared to walk into this place but my girlfriend said she'd been there before and that it was pretty good. I ordered a bbq chicken plate over rice with shrimp. The dish was yummy and they gave a pretty large portion. The chicken wasn't too dry and the shrimp weren't over cooked. Pretty cheap and fast service.", "author": "elizabeth j."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-20", "description": "I am a bit spoiled, since I live in the \"Little Saigon\" area of the TL, but this place was decent.  Shared the deep fried quail appetizer with a friend and, though it looked scary, it tasted really good.  I got a BBQ pork and shrimp vermicelli (bun) bowl which was okay - the shrimp were very tasty, but instead of big green lettuce leaves and bean sprouts in the bottom of the bowl, there was just shredded iceberg, which was a disappointment.", "author": "claire l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-27", "description": "Depressing decor that combined with a gloomy gray San Francisco day feels like the life has been drained from you. The service is awful the waitresses and waiters spend more time watching Vietnamese television than tending to your needs (i.e. more water please). Three stars because I come here often about twice a month. The chicken noodle soup ($5) is huge and the vermicelli noodle dishes are super tasty. Eating here is better and cheaper than making food at home.", "author": "Kat F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "My favorite vietnamese restaurant in the city! We dine here at least twice a week and we always order the imperial rolls (mmmhhhhhm), grilled pork w/vermicelli and grilled beef vermicelli. I think they have the best imperial rolls around. They're always consistent with the food and the service is awesom!", "author": "Dhoris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "A sudden jones for cripsy noodles lead me to this place last Sunday.   Been here a handful of times.  Quick, cheap(er) and good.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-19", "description": "Great Vietnamese hole in the wall, almost lost amongst the many restaurants around Valencia and 16th/17th.  They do a good job of my staple go-to dish at Vietnamese restaurants: grilled sliced pork with rice.  Good (typical) Thai iced tea and excellent yummmmy candied fried banana with ice cream.  Cheap too (as implied by \"hole in the wall\").", "author": "Chris P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-11", "description": "food was average. tasted a-ok, nothing that blew our socks off. got some soup, one veggie and one chicken dish (a la carte), and there were leftovers. \n\nthe food came quickly, portions were decent... we especially enjoyed the low production war movie on the tv, though it didn't seem to fit in with the whole restaurant motif.\n\nonly thing was our waitress. she seemed to be really pissed off or uninterested or annoyed. :(. sad.", "author": "monkey l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-30", "description": "Lemongrass tofu is .... amazing!!   Fabulous soups.  Fresh ingredients, vibrant flavors.  Very informal, family-run atmosphere.  Inexpensive and extremely tasty.    Two can eat well here for under $20.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-22", "description": "After one of my friends threw a fit we decided to eat here. I didn't really get that adventurous with their food though. Just simple beef and broccoli which was pretty good for the most part. But the restaurant was so smokey it was kind of unpleasant.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-21", "description": "My new favorite neighborhood Vietnamese! My BF and I by chance ended up going there with then intent on going to another, more crowded restaurant. We were really in a rush to have a quick dinner before heading to a friend's party and came across Thanh Tam. It is definitely no frills, and cheap. But, service is efficient and friendly and they serve all the basics. I am addicted to the raw beef in lemon sauce appetizer and my BF loves their imperial egg rolls.  The also have 33 beer! Try not to get seated by the door as it is very drafty. They should get a curtain to prevent this.", "author": "Sally T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-11", "description": "this place gave me horrible customer service. The waiter left our table in the middle of ordering our food to answer a phone when there's 3 other people standing next to the phone doing nothing. I mean, is it that hard to just pick it up and say hello this is thanh tam??\n\nThe food here is only okay at best. I can't give this place one star only because at the very least they gave us free dessert at the end. I suppose that can count for something. \n\nin short: one time only restaurant, don't bother coming here if you want some good food to fill your tummy.", "author": "tim y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-14", "description": "As a Vietnamese person marooned in the land of taquerias, it's really nice to have a serviceable Vietnamese restaurant nearby. It's not the greatest in the world but they do the simple noodle and rice dishes well.  A real Vietnamese joint that caters to its compatriots would serve more fatty questionable cuts of meat where this place serves more lean, boring cuts of meat that suit the modern western palate.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-04", "description": "i thought this place was decent for the price and location. i had the chicken with lemon grass and noodles. i thought it was pretty good, but it had too many red onions. everyone else i can with seemed to have enjoyed their meals too.\n\nthe restaurent itself was smokey for the most part, which was uncomfortable.", "author": "selma s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-24", "description": "Deserves 5 stars, not because you go there expecting the most amazing meal you've eaten in your life, but because its fast, cheap, and the grilled pork is damn tasty. That's bout it. If you're in the Mission and needing a good cheap noodle joint, search no further.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-20", "description": "Thursday night, around 8pm\nI called to get an order delivered but the server couldn't understand me nor my boyfriend. Nicely, another person from the restaurant called me back without my asking. \n\nAnyway, we decided that we'd go along and eat in. When we arrived the place was full of BBQ chicken smoke. Because we'd heard that the food was good we decided to stay, otherwise we would have left. There was 1 other couple and 1 solo person in the large restaurant when we arrived. \n\nWe ordered Beef with Lemon Grass and Chicken and Egg Roll Vermicelli. Instead of beef, chicken was delivered. We sent it back. The beef when it arrived was tender, but tasted only of hot sauce. The chicken was bland. \n\nWe left smelling like a barbecue and sweating hot sauce. My advice... go to Sunflower.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "Good Service, Great Spring Rolls and Pork with Noodles.  Great Price.  Worth it every time.", "author": "M K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "I LOVE Thanh Tam's Vietnamese crepe (Banh Xeo); it's got wonderful texture and all of the flavor.  The pho is good here; basic soup is easy. Try their salt and pepper ribs; they are AMAZING!  Highly recommend this place; yes, great Vietnamese in the Mission!", "author": "Amy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-02", "description": "Although Elle Decor may never step foot in this restaurant, they are missing something....which is the best beef pho broth in the mission.   All the hipsters can head over to sunflower for their vegetarian fares, but this Vietnamese pho snob is sipping Thanh Tam II's soup with the Cheshire cat's grin at what the ignorantis are missing...I certainly don't mind not having to wait in a long line since the secret is not out.", "author": "Dat P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "We eat here all the time - before kids, sometime multiple times a week, now maybe every other week.  I think the beef pho is better at sunflower, but here they have the best noodle bowls EVER.  Get the one with egg rolls and bbq pork.  Also, their soups other than the pho.  Also, spicy eggplant and tofu.  also the salt and pepper ribs appetizer.  also their chow fun is pretty decent.", "author": "korin y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-07", "description": "not too shabby, good for a quick pho fix. phooooooo....", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-16", "description": "not bad pho. meat quality could have been better on the pho tai, but service was quick. soup was on the table in no time. did the trick for my pho fix.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-22", "description": "i come to satisfy my pho craving when i don't feel like going to clement area, which is pretty much the case usually. i discovered a new dish there  that is ubberly tasty. when i go back there and find out what it's called, i'll name it. it's fried noodles shaped like a bowl with veggies and/or meat on top. super tasty. otherwise, i like their vermicelli noodles, eggplant and things. service is good, food tasty.  a solid 4 stars", "author": "Jen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-03", "description": "Great place for Vietnamese in the Mission. One of the closest thing to an authentic Vietnamese restaurant. Craving pho is a common problem for me...and when it happens, I usually come here. The service has never been that great (I usually have to wave down one of the staff watching TV for the check), but overall the experience is good. Food is generally good to excellent. I get the large pho dac biet most of the time. I can probably have two of these. Lately I've been ordering up a storm with rice plates. The grilled pork here is pretty awesome. I haven't been disappointed yet.", "author": "Young T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-17", "description": "so this is a quick fix vietnamese joint with good pho. good thai iced tea too, they give you a parfait glass with only a little ice. i came here for pho tai and i got what went for. it was perfectly lit and i sat against a wall in a small corner that just made me feel good. i had a nice dinner and you should go there and do the same. it's pretty cheap, compared to other places in the neighborood. it's also the most i've ever paid for pho in my entire life.", "author": "oskar p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-09-12", "description": "another unsuccesful attempt at finding an enjoyable vietnamese meal. the food was unexceptional, the waitstaff was elsewhere and the four crazed drug addicts at the next table were loud and distracting. and to really add insult to injury, my fortune cookie was stale.", "author": "Alex D."}
