{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Ordered a Grey Hound with soda & lime here & I absolutely LOVED that they had a huge juice squeezer behind the bar & served me some freshly squeezed the grapefruit right then & there. You really can't beat fresh squeezed juice from good quality fruit-- Nice cozy little bar with a back patio that is in construction, excited to see what they put back there*", "author": "Celine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-14", "description": "After Outsidelands, my group and I ventured to Outer Richmond in order to avoid the Uber surge charge going home. The bar was crowded as many others had the same idea. The back outdoor area was open and had a makeshift bar, which served only beer and hard liquor for cash only. The drinks were cheap as beers were $4 and I had a half full cup of Jameson for only $8.\n\nWe eventually made our way inside the bar for some mixed drinks. A Jameson and Gingerale was only $8 as well. While drinks were cheap and bartenders were friendly, the place was like any regular neighborhood bar. My biggest disappointment here was the jukebox they had. My friend had put in $2 to request 3 songs, which never came on after waiting for over an hour. I even complained to the bartender who said the songs don't have an order. A guy nearby overheard me and showed me the list of songs on an app, which I noticed our song picks coming up. With hopes, we waited a few more songs yet it still never came on. We eventually gave up, finished our drinks, and just went home. What a waste!", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-15", "description": "Chase sux. This bar sux. Slow at cleaning the bar, never asked if I wanted another. Chase kept game on that no one GAF about. This is a bar for Chase to keep a check and watch his sports.", "author": "Alejandro R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Don Julio with grapefruit, ketel one with oj and grapefruit and last but not least Bloody Mary (I'm not a fan of bloody Mary's but this is so BOMB and legit. Bartender CHASE was very welcoming and friendly! Must give this place a try", "author": "Diane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "The Blarney stone is a great local bar. Amazing irish breakfast on weekends(also best bloody Mary in the city). The staff actually cares about the bar and as a result give great Service.  Usually has music without forcing its customers to scream over it. Also one of the rare sf bars to have a back patio. For eating in the sun or having a smoke without bugging others.", "author": "Mason W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "I love Irish bars. I want to like this place. It looks like a proper Irish bar. And imo the best part about an authentic Irish bar is the people, culture, and friendly conversation that Irish bars are famous for. However, I've been here twice and both times, there was VERY LOUD and RUDE drunk guys arguing and yelling drunk-talk. This time, the bar was empty besides a small group at one end with two extremely loud drunk guys yelling at each other and saying things that should start a fight (rudely insulting practically every nationality, especially Americans). The amazing thing was that the owner was standing there with them, chuckling nervously. Jon Tapper would have a field day visiting this mess.", "author": "Rikk C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Great local dive bar. Perfect for what it is ya know? Yeah you can't eat a cake of the bathroom seats but go to the palace hotel if that's your jam.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Awesome pub with really good priced drinks. Perfect spot to catch up with an old friend & toss a few back. \n\nHuge bonus: You can bring food in! Tons of great food on Geary to grab if you get the munchies.", "author": "Adam O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-03", "description": "Came here to grab some bar food after a long day of traveling and was saddened to be told that this establishment does not serve food (except for brunch on the weekends) - however, the top photo on Yelp is a photo of tater tots which was basically the main reason we stopped in. Still was able to have a beer with my travel buddies and enjoy the company of the lovely fellow behind the bar.", "author": "Jamie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Awesome Place! Great service. Bartenders are very knowledgeable and attentive. Great conversations. Place to be.", "author": "Jeremy O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-01", "description": "Everything about this pub says it's a solid, inoffensive, neighborhood sports bar where you can have a beer with some buddies on a Sunday afternoon. If you happen to be in the neighborhood and want to grab casual drinks it's a decent choice, but there is really no reason to seek it out, unless you just need a bar with an outdoor area (a small back patio with a canopy and high-top barrel tables).\n\nIf the service were comparably decent, I would have no problem giving this place 3 stars, but the bartender's attitude definitely downgraded the experience for me. As soon as I tried to order, the bartender's tone was blunt and impatient. It took her at least five minutes to pour me one Guinness (all the while I'm standing patiently at the bar), even taking and serving other patrons' orders before mine (it was not busy either, maybe 5 other people at the bar). \n\nNormally all this would be slightly annoying but unmemorable. Service is pretty low on the totem pole of what I care about in a bar experience. However, when my friend tried to order and realized he forgot his ID, the bartender, in an aggravated tone, basically told him he had to get out. Now, I fully understand that the liquor business is heavily regulated and a bar has every reason to play by the rules. However, the bartender made absolutely no effort to be service-oriented or gracious about it. After my friend (who looks pretty clearly of age) offered to show a picture of his passport or ID, her response was, essentially, \"I don't care, get out of here.\"\n\nAgain, I have no issue with a bar requiring all their patrons to have ID. That's the law. But when you see a group of respectful people trying to have a good time at your bar, you don't just tell them they have to get out, in a blunt tone as if we're trespassers. The least you can do is say, \"sorry, but that's our policy, we don't want to get in trouble.\" I don't necessarily want to play this card, but we were also the only group of non-white people in the place.\n\nI will say that the place is fairly clean and looks inviting. There's a shuffleboard table in the back and I saw one table of people in an intense game of Magic the Gathering. I like chill neighborhood bars where people can lounge and play games, so if that's all you're looking for then by all means give it a try. Just don't forget your ID.", "author": "Terry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Cool Irish pub in the outer Richmond.  \n\nWent here for St. Paddy's Day and was able to score a booth up front.  The peeps behind the counter were efficient with getting to everyone at the bar.  We basically stuck to shots of whiskey and beer...a combo for a pretty eventful night.\n\nThe vibes were friendly.  There was corned beef and other items cooking out back if you had some cash on you.  Super convenient to the bakery next door to grab some bread to try to sober up.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Great old school SF bar... strong cheap(ish) drinks and the best part: you can get food next door at John Cambell's - they will heat it up and BRING TO YOU! So great. I hope this place never changes.", "author": "stephany m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Fun pub to watch a game in and spend a few hours. Plus, it doesn't hurt that an amazing bakery is connected. There's nothing special to say about The Blarney Stone other than you'll find really down-to-earth people and cheap, strong drinks. There are stools, booths, tables, flat screens, and a shuffleboard table to boot. I haven't had any of the food here, but I can vouch for the beef and curry pasties next door, which they'll actually carry over to you while you're drinking in the pub. You won't have to drop a pretty penny while you're here, and you can drink all day while you watch football. No frills.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "Great bar in the Richmond--came in on a Sunday while waiting for a place around the corner to open (for food)--which unfortunately this place wasn't serving any but now that I look, apparently they serve food sometimes? Not sure where the kitchen was :O but oki.\n\nThey've got some good beers on tap and a nice little outdoor patio in the back plus some little entertainment inside the bar (shuffleboard, jukebox, etc.) Took a Harp Lager (it's sweet!) and a Pilsner. Solid beers for fair prices ($6.50ish + tip), not too crowded and nice little sports bar (TVs were all up and playing) Good vibessss", "author": "Nerissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-21", "description": "Pretty neat place in outer Richmond if you ask me! This place has a cool vibe. Perfect for hanging out, grabbing a drink, and talking. We came here on a Tuesday night after work. They didn't serve food at this time, but we did get drinks.\n\nThe bartender was super friendly, the place was clean, and the people are cool! I would definitely suggest coming here especially if you live in the city. I'd come here for a nice chill atmosphere an drink after work.\n\nNext time I hope they'll be serving food at the time cause I was super hungry hah", "author": "Lori R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Our favorite bar in SF! All the bartenders are great. Tori, Laci, and Chase are the best. And Vince who works the door and is a bar back is always hustling to help the staff. I love that we are always greeted with a smile, the regulars are friendly, the drinks are priced well, and there is never a line for the bathrooms.", "author": "Jaqueline R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "This is a great Irish pub. Never had a bad time here and I like the outdoor area. They have shuffleboard. The bathroom is also nice and clean although it's single stall so sometimes there's a wait. they also take cards (I think there's a $10 minimum). Try to check out the bakery next door it's amazing!!!!", "author": "Emma B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "Decent Irish pub in the Richmond. Came here with friends on a Saturday night and got seats at the bar. It didn't seem that busy, surprisingly. I ordered one of their featured cocktails (though I forget the name) that had ginger beer and whiskey. Pretty strong and price was reasonable. I had already had a few drinks by this point so forgive me if my memory of this experience is a bit hazy, lol.. the bartender was friendly and the space is pretty big. I see from the photos that they have games, but we didn't partake in any that night. Great place to just chill with friends and grab a drink!", "author": "Pooja C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "What can I say? I've been going here for years and it just gets better and better.\n\nNow, I'll be the first to admit that I have a certain bias towards Blarney's. It was the first bar I went to after turning 21 (almost 3 years ago) and years later I'm as much of a regular as it gets. All the bartenders know my name and so do most of the other regulars that go there. But, even before I did get to that point, I always loved everything about this bar. It's located in my favorite district in San Francisco, The Richmond. Now, to many people, they look for bars that are trendy, hipster and filled with a bunch of people. That's not my style. This place is nothing close to hipster and the only time it gets truly packed is during big sporting events- but that's what I love about it. It's the perfect place to go for a Sunday brunch, or for a late night drink to chat with the bartenders, or if you want to watch the latest playoff game. It's a versatile bar.\n\nThe staff...they are incredible people. All very friendly, down for a conversation and skilled at making drinks. Prices here are very reasonable. Happy hour usually goes a bit afternoon until 7pm and most drinks are $5. Pretty great deal. This place is also amazing for sporting events. Though it's usually not too packed on most days, it get's totally stuffed if a big game is happening. Always a fun time! It will get loud and even claustrophobic at times, so this is more of a recommendation for people who enjoy that type of environment.\n\nObviously, this place is not for everyone, but I can confidently say it's the best bar in the Richmond District. The bartenders are nothing short of amazing, the drinks are cheap yet good and if you ever become a regular, you'll never run out of stories to tell to the awesome people that go to this bar.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-07", "description": "GO ANYWHERE ELSE OTHER THAN HERE!!!\n\nI love Irish pubs, and I stopped in to have some food from the bakery next door and a pint at the Blarney Stone. I never write reviews, but this was so horrible I had to warn other people away. \n\nFrom the moment I sat down the bartender was an a**hole, I ordered a drink, and clarified how I would like it prepared- he cut me off curtly to tell me he \"knows how to make it\" He then presents me with a poorly mixed drink and tells me it's $6. I give him $10, and do not receive any change. I shrug it off, because I was going to tip for the food and drink anyway. I finish my food in uncomfortable silence as every time I look up the bartender is glaring at me. I finally finish and get up to leave, and he tells me I need to tip the bartender. I tell him I never received change, he then verbally harasses me as I exit the bar. Rudest bartender I've ever had. \n\nI just moved to the neighborhood and had planned on making this a regular place, I now have no plan on ever returning and will advise anyone I meet to do the same.", "author": "Burke G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Super affordable and on-it drinks with the coolest owner and cozy atmosphere. Easy Parking and we can even get snacks from next door to munch on", "author": "Max B. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "There was one point in our athletic prime when our ambitions of turning pro burned brightest. Maybe it was that one time at elementary school when we slugged a ball out of the sandlot. Or that time when we rushed for a 40 yard return at the homecoming game. It was a time when the dream was most vivid and the hope least far-fetched.\n\nBut we got older and dreams gave way to reality. Our locker room became a cubicle and the lucky pair of dirty cleats are now a sparkling pair of dress shoes. The X's and O's? Spreadsheets now. The congratulatory slaps on the behind? Cordial handshakes. Then one day, we realize we are no longer an athlete. Just another guy at Blarney Stone, looking up at ESPN with a $5 pint.  \n\nBut our passion for the game remains resilient. Buried beneath a man faced with reality, it is ever ready to be unearthed by a timely play. \n\nThe passion begins to surface as the Giants field a perfect 6-4-3 double play. We adjust our baseball cap proudly and order another pint.\n\nIt inches even further out when a certain quarterback throws yet another interception. We furiously lament our hopes of the Lombardi to the nearest Niners jersey, but find our hopes clinging back on to the television screen by the very next play.\n\nAnd on rare occasions, when the play is so spectacular, the passion fully emerges. We slap high fives as hard as we can around the bar through shouts and cheers. Three to our left, and five to our right. One for the fan across the counter who just so happens to be the bartender that night. The adrenaline rushes through our veins and feeds our passion with euphoria. And for just a moment, we feel like the slugger back in the sandlot, the star receiver back in homecoming.\n\nNo, we may never be professional athletes, but we will be the next best thing. We will be fans at The Blarney Stone.", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Dewey is representing Dublin very well from the Blarney stone. \n\nHe didnt tell me that he was from Dublin, only that Heavy weight UFC fighter Conor McGregor was from his own town. \n\nDewey also pours an incredibly comptent Guinness that settles slow and goes down smooth. Hard to pour a bad Guinness, but he looks so good doing it that it needed to be mentioned. His arms have muscles in cords. His voice is melodious and charming. \n\nHes got a huge pull, and after I received a hand kiss that would have made anyones knees weak and palms sweaty, I am certain that he knows. \n\nA game was on the tv. multiple games. the enviornment is casual and friendly. \n\n10/10 would go again.", "author": "Selah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "I don't know how I haven't rated this bar yet! My boyfriend works here; it's actually where we met. I keep coming for his coworkers and our friends that come in as regulars. The bloody Mary's here are also amazing! And their fresh squeezed juices for mimosas and greyhounds, etc is what originally drew me to come back.", "author": "Alexandra R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "Girl was nice, overshadowed by douchebag manager, no phone charging on outsidelands weekend, u r not really that busy! 5 stars for bartender,0 for guy n black with wedding band, let's the crew around him down", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "There's no Blarney at the Blarney stone...just a good pour of Guiness...and a shot of Jamieson.\n\nI was so buzzed after watching Paul McCartney at outsidelands...that I had to come here and get a drink or two or three. It was pretty busy but service was stellar.\n\nGreat atmosphere, Great help and good drink selection. 8 days a week!", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-16", "description": "We're boycotting this place even though it's the closet bar to the house. The people are way to bugie for the area and the bartender is unpleasant. We came in with our dogs an hour before close. And asked for a seat. He proceeded to berate us and ask illegal questions. He broke Federal law and I'm going to sue the pants off this place. That's no way to treat the disabled. Might as well just sign the lease over to me now,cuz the owner of this place is done. The Feds don't play.", "author": "Jason O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Bart, what a great guy. Had an awesome time there, meeting new people, chatting it up. Good beer selection. Out back area. Great neighborhood spot.", "author": "ODHRAN M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "Good for the traditional Irish dark bar feel. Try the pickle-backs which are whiskey shots chased by pickle juice. Nothing too special but def a good local spot.", "author": "Brittini S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "I'm always a fan of a good neighborhood bar surrounded by lots of poppin restaurants. Blarney Stone has provided me with a place to go drink and chill for many years now. They get busy during games, but there's a lot of seating and an outdoor area, so not too hard to grab a spot.\n\nUsually my pal Jeremy P and I will grab a burrito at Gordo's down the block and bring it in. You can do this with whatever food you like, which is nice. I think B Stone just started serving food, which is why I give only 3 stars. The food is HIGHLY mediocre. But I guess if you don't know that a place serves food, there's probably a reason for that.\n\nI was on the struggle bus (but what's new) and ordered the Fried Chicken Sandwich ($11) with a side of Tater Tots. I expected fresh fried chicken, though thinking about it now, I'm not sure why given it's bar food, but got an *obviously* pre frozen, breaded hockey puck with wilted lettuce and an old slice of red onion. Truly a sad excuse for a chicken sando. The only redeeming quality of the meal were the tots: crispy, crunchy, freshly hot out of the fryer. \n\nMy friend Mike had the Chicken Tenders ($9) and they were just awful. Salty to the max, drenched in some kind of salty \"buffalo sauce\". Someone in the kitchen really used a heavy hand, this stuff was puddling in thick pools around the plate. They were also extremely tough to bite, as he offered me one and I nawed for a while. With a side of soggy fries, this dish was no bueno.\n\nBut I digress as The Bloody Mary and all the beers on tap make B Stone a great place to hang your hat for a while. Just maybe save your appetite for a Sheppard's Pie from next door, pho for Turtle Tower down the street, or any other local restaurant. Or just stick with a side of taters to share.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "I never write reviews.. But I just went here for my second time and had a less than pleasant experience... for the second time. I see that others have also commented on the rude bartender. I went here with my boyfriend (maybe that's the problem). We took a seat at the bar and said hello to him. He answered with asking for our IDs and what we wanted. We said thank you and gave him a tip but both noticed that he was seemingly unhappy to serve us. Literally five minutes later two men walked in and stood at the bar right next to me. The bartender happily greeted them \"hey guys what's up?! What can I get for you? here's the beers we have on tap\" etc etc. They paid and he thanked them for their business and said he appreciated them coming in- it was almost like he wanted to show us that we were not welcome. That's definitely how we felt and we will not be back again. There are too many bars in this city to go to one with a dick bartender. I want to add that I live a few blocks away from here and if I had good experiences, I would frequent it more often. Try plough & the stars on clement instead!!!", "author": "Sammy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-03", "description": "A compact Irish pub that's got tons of big-screen TVs and beers on tap. Perfect for watching games with a great crowd of people and some cool, super-positive bartenders too. \n\nOne caveat: the food preparation can veer way off course. Chicken tenders came out fried to a radioactive, brittle burnt-brown crisp. Even if it's fairly early in the day, say 11am or noon, maybe it's a good idea to change the cooking oil a bit more often.\n\nStill, Blarney Stone has a cool game-day atmosphere and the *correct* partisan affiliation: nothing like hailing to the Leaders and Best while the Victors gets blasted over the loudspeakers after every score. ;)", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "What a great neighborhood bar!  My friend and I got a spot at the bar where Shannon our bartender took such great care of us.  The pours are super generous and they use fresh fruit in their cocktails. I saw them bring out a ton of grapefruits which inpired me to order a greyhound (vodka with grapefruit juice). Boy, fresh fruit juice makes a whole lot of a difference in the quality of the drink. I can tell that the workers love their job and the ambiance was great. It was very busy but it wasn't uncomfortably crowded, which I loved. \n\nOne thing to point out, I noticed Shannon kept making margaritas, which my friend ended up ordering. It was really good! I swear I saw her make over 30 of those so it looks like a very popular drink of hers. If you like a good margarita on the rocks. you should try hers.  You wont be dissapointed.\n\nI plan to go back to try their food. I'll update my review once I do, by looking at the pictures, I look forward to trying their breakfast one day. They have tater tots! Yum!!", "author": "Mel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "At first glance, an Irish sports bar would not be at the top of my list of fun places to spend a Saturday night but we had a fabulous time!  The bar staff are friendly and they were playing totally old school 80s tunes (I mean, c'mon - Toto's Africa came on at one point). There is a very cool shuffle board table at the back and an open air smoking patio as well. This is a very fun bar for a raucous time!", "author": "Ada C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "First time here! Like the place and warm atmosphere. 4 stars on Yelp that really makes sense! I just got a glass of IPA draft which is my favorite. If next time I have something to do around here, I'll be back to this place again. Lots of drinks to try!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-12", "description": "*Don't come for the food!* \n\n*Probably a really cool bar/pub for evening activities but don't expect much for early morning brunch*\n\nArrived on Sunday at 10am and wasn't greeted and seemed to be ignored by the one waitress and bartender working (party of 8). Had to take initiative to ask for waters and coffees. Then we had to request menus. Then after 15 minutes of looking at the menus and being ready to order we had to wave waitress over only to be told that chef wasn't going to be ready until 10:30am. Even though menu said they start serving food at 10am. Once 10:30am rolled around, waitress took our orders. First round of food, 4 of the orders came out around 11am. The next 4 orders didn't come out until around 11:20am. Waitress didn't remember anyone's order and had to \"auction\" off the items and was very unprofessional. For refills of coffee and water, she seemed to not notice when cups were nearly empty so we had to take them to the bar and ask the bartender to refill them. \n\nFood was 6/10. Very greasy omelettes, the \"sourdough toast\" was barely warm and minimal sourdough taste to it. The only good thing we're the tater tots but she forgot two orders of them and we had to remind her to bring them out. \n\nOverall great atmosphere but terrible service and average food.", "author": "Jered L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Got served literally as soon as we walked up\nTo the bar. The bartender is a super cool dude too. Very diverse crowd. It's cool inside and not stuffy. Inside is nice, looks like a little hole in the wall bar but it's roomy as well.", "author": "Lynelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "What a fabulous place to go after grabbing dinner right across the street. I rarely go out to drink, so when I decide to go, I heavily make my decision on atmosphere. Upon walking in, it's a \"typical\" bar scene - loud music, wooden chairs/tables, and the like. However, the energy of the bartenders and clientele alike are positive and welcoming. \nMy initial decision to sit down for only one drink for the night ended up being two and quite a few hours of hanging out and casually chatting with the friendly, attentive bartenders. \nIt's rare to find a place that makes a decent Irish coffee, so it was nice to be able to order one and have it made the right way. \nBeing a female in a bar is usually cause for major anxiety, but this place definitely made me feel safe and comfortable. \nI will be back!", "author": "Krystyna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-23", "description": "I have been here twice now and both my experiences were similar, so figured a Yelp review is in order.\n\nService/Price\nIt's ok.  I found the mixed drinks to be a little weak and the pours of whiskey neat to be a little light.  Prices are decent - good pint of beer is around $5, well booze is $5 or $6, decent spirits will run you $7 to $10.\n\nTypical experience on my visit the other night - while drinking my beer I asked the cure female bartender to see the whiskey list, she replies \"Sure\" then goes about her business.  Several minutes later she comes over and asked if I made a choice - \"um, well I never got the list.\"  \"oops, sorry, just a moment.\"  Several more minutes pass and the same question from her to which I reply \"still haven't seen the list\".  This was all done with smiles and we laughed about it, but ... well you see what I mean.\n\nThen when she left and the guy took over, he completely ignored us.  I think he could tell we were wrapping up and thus there was no business here.  I just wanted a refill on my water and he ignored my polite motions to get his attention - he walked by at least 6 times and served the person next to me while never looking at me.  I finally spoke up loudly and got his attention - he refilled my water and said not a single word.  Usually when there is a shift change and I get a glass of water, I'll tip the bartender a buck, cause they have to make a living too.  Not this time.\n\nNot really complaining about the service, just showing why I think that it is not top notch.\n\nBar Stock - Beer\nPretty good.  They have 8 to 10 on tap (didn't really count them).  But they have a good range of selections, pretty much for everyone's taste.  I got the Smithwicks - one of my favorites.  This is clearly the reason to come here.\n\nBar Stock - Spirits\nAgain I will use the descriptor \"ok\".  They have a decent though not extensive selection - the core holdings you find in most bars and a couple higher end selections.  But the list is nothing to write home to father about.  In the whiskey department they have 3 Irish, and handful of scotch, and a handful of American (mostly bourbon).  The list has them all listed together with no differentiation between them.  Also, the first two bourbons I asked for, they were out.  Similar selection of other spirits - decent but light on the higher quality gins, vodka, etc.\n\nClientele\nThe crowd both times was an interesting mix of older (drunk) locals at the bar, young (drunk) partiers towards the back, couples canoodeling in the corner, and a few lonely hearts spread around.  I have had a few interesting conversations there, in the interesting way of having a debate with someone much younger and drunker can only go.  It was entertaining at least.\n\nDécor\nI would describe this as a poor imitation of an Irish pub crossed with a sports bar.  Lots of wood - bar, floor, tables, walls.  It's basically a standard large \"Neighborhood\" bar/pub.  Plenty of TV's to watch the current sporting event, and TV's are usually turned to sports.  My only complaint in this regards is that the TV's mounted above the bar are too high to watch comfortably while sitting at the bar.  Since the bar is not that deep and the TV's are pretty high, the viewing angle is pretty steep - leading t a sore neck\n\nAlso, it seems that the younger set thinks that \"dive bars\" are cool and therefore calls most any local place that is older and not high end a \"dive\" bar.  This is not a dive bar.  Believe me, I have been a many a dive bar, and you can look up the common definitions of a dive bar - this is not one.  It is way too well lit, has way too many TVs, etc, etc.\n\nCleanliness\nThe place is kept reasonably clean and the bathrooms were not too bad.  But I will say that both visits were earlier in the evening - 7:00 to 9:30 range.  I would wager that by the time midnight rolls around, the back patio and the bathrooms will start to get fairly rank and you may catch an occasional whiff of the love smell of urine or puke.\n\nParking\nBest to walk because:\n1. Parking can be a bitch in this area\n2. You are drinking\n\nSo, three stars it is.  I enjoyed it there and will likely be back on occasion, but there are (IMHO) better places to go.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "Mostly, I come here out of convenience since I live nearby. But it is a fun Irish pub to go to on a weekday night, play some shuffleboard with friends, have decently priced drinks (fresh-squeezed grapefruit and vodka is $5-ish), and meet some unpretentious people of varied ages. \n\nI've come here on a Sunday morning to watch football and have brunch, and the food is pretty great (first time trying fried pickles, an amazing would-be heart attack) with $7 mimosas. Great for sports, unhealthy food, and a chill night where you don't want to put too much effort.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Ah good old Blarney Stone. I love this bar", "author": "Anonymous ?."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-14", "description": "Busy busy busy place when the Niners are playing. I'm not sure how we managed to snag a table, but we did and we were happy to have a good view of several TVs.\n\nIf I were just rating this place on the service or its value as a place to watch sports, I would give it 5 stars. But, alas, I was starving after soccer practice and needed to eat while I watched the Niners eek out a painful win, and the food was just not good. \n\nTwo things were good, in my opinion: the burger and the tater tots. Unfortunately, my so-called \"friends\" ordered me french fries instead of tater tots while I was in the bathroom (come on, guys. Really? French fries over tater tots? What is this? Communist Russia?). The fries were terrible, lukewarm, and just not my kind of potato (which is saying a lot). \n\nMy boyfriend got the chicken tenders and they were god awful. First of all, they were soaked in buffalo sauce...ummm...did we order chicken tenders or the world's largest boneless buffalo wings? (Who even wants regular sized boneless wings?) That part wouldn't have been so bad if the buffalo sauce was actually good but it was so salty, I wouldn't have been surprised if that sauce recipe called for equal parts salt and buffalo jizz. Just gross. And the chicken sandwich was also gross. Just a poorly heated piece of freezer meat.\n\nSoooo...just go to Blarney Stone for the beer and the sports and you'll be fine. If you order food, you'll most likely be severely disappointed.", "author": "Stephenie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Whoo hope y'all wore green yesterday! I definitely had little splashes of green on myself to avoid being pinched. Keisha and I were trying to find a bar to hit up for our first stop of St. Patty's day and I chose this place cause of the name. Haha.. It was definitely happening here when we arrived. Loads of people in this little bar. There's also a patio in the back where you can purchase food & smoke obviously. I had their Skyy Blood Orange Refresher which was really refreshing- just like juice. Then I got a Bloody Mary - spicy, and OMG...it was the best Bloody Mary I've ever had (although this was my 2nd time having a Bloody Mary). It was very tasty & had a nice kick to it. Mmm ... I'll definitely hit this place up for more Bloody Marys if I'm ever in this area again which is rarely. haha...but if I was, I definitely would! :)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Awesome Irish bar. Walking by and decided to stop in. Great bartender  who was super friendly and poured great drinks. Really great spot with a nice patio outback", "author": "Rebecca B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Okay - they will fresh squeeze large cup of orange juice and charge me less than a place that just pours it out of a pre-packaged container. Blarney wins!", "author": "Jess W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-23", "description": "(See pics) Review #1253. Local lively bar but you can still relax if you choose to with pockets of people choose one vibe over the other.\n\nDrinks were slightly weak but service was friendly.", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-23", "description": "For some reason I kept thinking that this place was called Foley Catheter. I don't know why. Sorry if you're one of those people who think writing thoughts like that is a waste of your time as you look for an actual informative Yelp review.\n\nAnyway, this place was fun. I like how it's not in a fast-paced part of SF. It's a straight up dive bar with decent beer and a dartboard. It was too crowded around 7:00PM and the bartender was efficient.\nMy friend and I used a Scoutmob. Those things are pretty useful.\n\nI might come back if I'm in the area, but at least for me it's not really an end-point destination. It's more of an on-the-way type joint.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Came in here for a drink and to watch the Giants game.  They had four flat screens and a large projection TV tuned to the Giants and the Olympic games.  \n\nAfter ordering a Guinness and a mimosa with fresh squeezed orange juice, we decided to order some food after checking out their menu.  We ordered a grilled ham and cheese sandwich with tater tots and the FFS, which was two eggs, two slices of bacon, a sausage patty, tater tots, blackforest ham and toast.  The food to our surprise, was very good.  The bartender, who also took our food order, was friendly and provided great service.  \n\nOverall, a great experience at a neighborhood bar with some pretty good food.", "author": "Al L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "I TOOK A SHOT OF OUT THE DEER'S ASS!! There, I've said it and darn proud of it! This place is awesome, you got whiskey coming out of an animal's bum hanging on the wall, air hockey table at the end of the bar, plenty seatings, and great bartenders. What more do you ask for in a local bar?\n\nDefinitely not a place for deep-in-thought conversations because really? you're going to come here for a nice long conversation over a shot of vodka? Let me know how that turns out....", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Great locks place with lots of beers and very social atmosphere. Bar tender is very nice as well!", "author": "Jim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "Awesome place to grab some drinks! The bartenders are super friendly, drinks are well priced, awesome atmosphere and they've got shuffleboard and free air hockey! \n\nI missed the fact that the air hockey is free but saw it mentioned in someone else's review. I must go back just to take advantage of that!", "author": "Pauline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "Cool spot.  Irish bakery next door has awesome sausage rolls and Shepard pies.   Beer Jameson and Irish snacks.  Great stop.", "author": "Bobby O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "I've been coming here since I turned 21. I love it!!! Nice bartenders, every seating has a good view of the TVs, back patio for a smoke, laid back regulars, and the area has good food. \nBest part of Blarneys is the fresh squeezed grapefruit for a greyhound! It's the best!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Intricately awesome Bloody Mary with a giant pickle!  \n\nBefore we went to Aziza, just near there, we hopped into this place.  It was honestly pretty cool.  It is a nicer dive type place - complete with an outdoor patio.  Inside is rich in color, tons of random Irish or sports team stuff every where and of course, a wooden bar.  It isn't a tiny place, but it isn't huge either.  I would have a had time bringing a group.\n\nThe outside is fairly nice and I always love being outdoors, so it was a huge plus for me.  It was also clean, had a few tables and a little greenery.  \n\nThe bartender was pretty cool too.  He made the most elaborate Bloody Mary I've ever had . . .  seriously!  And it was so unexpected to.\n\nCool place.\nCool drinks.\nCool staff.", "author": "Sabrina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Fun; relaxed, not too hard to get a drink. Free shuffle board is fun for groups. Sports playing on screen . Was fun!", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "Blarney Stone is one of my new favorite bars! We came on Saturday morning to watch the Bruins hockey game, and there was a good amount of people already there at 11:30am. We were pleasantly surprised by their brunch menu and their egg and cheese sandwich was SO good. Their bloody mary is also fantastic, and they have great beers on tap. The bartender was so friendly and we ended up chatting with him most of the time. It was a pretty good crowd for the rest of the game, and the place filled up once the Giants game started. There are a lot of TVs and they are very accommodating in terms of changing the channel. If we lived in the area, we'd be there all the time!", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Great neighborhood bar for watching the game. Friendly staff and good drink selection.", "author": "Iain A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "This bar is a place that I am proud to call home on Saturday mornings. As THE definitive Michigan bar in SF, The Blarney Stone meets all of my needs and exceeds my expectations.\n\nWhen it comes to sports the atmosphere is great. It invites a truly energetic crowd that turns up regardless of the kick- off time. Viewing angles are great as every seat has a clear view of the five LED TVs that surround the perimeter. Without a doubt , the best sportsbar in the Outer Richmond.\n\nDrinks are great and the mimosas are created with freshly squeezed orange juice. Their bar food is serviceable, flanked by their excellent tater tots and buffalo chicken strips.\n\nI have to conclude this review by mentioning the great service from Bart, the bartender, and Kelly the main waitress. Even when things get crowded, they always find a way to make sure you're taken care of.", "author": "Charlie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "I will now review the Blarney Stone, to the theme of Cheers:\n\nMaking your way to the Blarney Stone today pull up a chair and take a spot.\nTaking a break from all your worries, sure a drink would help a lot. \n\nWouldn't you like to get away? \n\nSometimes you want to go \n\nThe Blarney stone is it's name, \nand they're always glad you came. \nSmoke in the back patio as you can see, \nNot each bar is all the same \nYou wanna be at the Blarney Stone\nThat's its name.\n\nDamn I love this place.", "author": "Jenny U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "Awesome local pub; glad we stumbled across it. Fresh squeezed juice for cocktails at super reasonable prices, Guinness/Harp/Smithwicks on tap along with Lagunitas and the standards, and a great shuffle board table. \n\nAll around great spot; stop in for a pint if you're in the area.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Love this spot.  Great service and lots of drink options.  TV's are in abundance so its a good spot to watch sports as well.  Really nice back patio as well that also has TV.  Overall its a great spot to hang with friends.", "author": "Tim H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "Good first impression when we walked in, several TVs playing Sunday football and pretty busy. I knocked off a star because there was a large group of chargers fans trying to watch their game, and the bartender switched it off at least twice and turned it to a game that was already on 3 other TVs. If it were me, I would have also been upset. I wasn't there to watch any game in particular, however, there were 3 games in OT that i would have liked to see (especially given there are 6 TVs) that they didn't  have on. To be fair, I didn't ask them to change the game so I can't complain too much. \nWaitress was very attentive and nice. Food was average bar fare. They have a nice patio but it was chilly today so I didn't check it out. \nThe best part of this place--shuffleboard! And air hockey.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "This is my favorite bar in San Francisco.\n\nI will admit that there was some bias in the beginning because it was the first bar I went to when I turned 21, but after going there 50+ times over the last year, this five star review still stands, and is not biased at all.  \n\nThe Staff: \nAmazing....Nothing more I can really say.  I have personally met everyone who works there and they are all very nice, down to earth people.  They all remember who I am every time I arrive for a Sharks game and always remember to turn on the channel so we don't miss the game.\n\nThe People:\nAmazing...Just as the staff.  all very awesome people of the Richmond (and other) districts just stopping by for a drink.  There are also a BUNCH of regulars who go to Blarneys and they all rock!  I've made plenty of friends there and the conversation is always amazing.  The people and environment of this bar make it feel completely awesome and it barely feels like a dive bar because it's very well kept and clean.\n\nService:\nAmazing....Yes, the 3rd amazing in a row.  Great drinks and for a good price - especially during happy hour! \n\nThe cons:\nThe only real con of this place, which does not take away from it's 5 star rating, is that it is COMPLETELY packed during any major sports games (during playoffs) to the point that you can barely even find a place to stand.  This is NOT a huge deal at ALL but more of a warning for people that get cluster phobic or don't like being in a huge group.\n\nI'm a regular here now.  Love this place.  5/5", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Great service and great bloodies!!! Haven't had the chance to eat here yet but when we are here for drinks, the food always looks amazing.", "author": "Liz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-24", "description": "Best bar to watch a Michigan game!! The bartenders are friendly and wore Michigan shirts.\n\nOn Michigan game day, all TVs are playing the Michigan game!! \n\nFood here is not good, so come here only to drink! Would recommend you go next door to the Irish or German bakery and bring some food back to the bar if you are hungry!", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "I had a great experience here and will certainly be back! The crowd is very richmond- young, white and asian, and relaxed. I just feel like it's a safe place to get a drink without having to worry about walking around the neighborhood at night (as opposed to SoMa).\n\nThe bartenders were very friendly and efficient...I never had to wait longer than 2 minutes for a drink (and it was a busy night). The drinks were strong! Wow.wow.wow. \nGreat prices too.\nLoved the modern jukebox.\nThe outdoor patio is totally legit! Bring your drink outside and drink under the stars.\n\nSide note: There's a small step to the patio, but big enough for girls in heals to miss a  step and fall to the ground. I saw 4 girls (including me -_-) do gymnastics as we try not to kiss the concrete. A  \"watch your step\" sign would be great for the future :)", "author": "Wanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-25", "description": "Happy Hour all the time!\n\nWell, not all the time... it just seems like every time I come here, there's a drink special for something at some point. Free shuffleboard! I love that game!\n\nSlow Guinness tap (check out the one at Bitter End). It takes about 5 minutes to get one. Also, sometimes it takes a while to get the bartender's attention, even if it isn't really busy. He (no matter who) is usually talking/laughing/joking with a group of friends/regulars on the end of the bar and doesn't really look at the rest of the customers as often as a bartender should. Don't get me wrong, they're all very nice people here, and there's nothing wrong with shooting the shit with your buddies while you work, but at least keep an eye out for a customer making eye contact with you to request for something.\n\nWith that said, overall, it's still a pretty cool place to hang out. It's laid back for the most part, and it's really clean! The jukebox has music catered to a... younger crowd. Another downside, to me at least.\n\nBrunch was delicious. Those tater tots... Wow. I dream about those things. \n\nI can eat tater tots, drink Guinness (order them in advance), and play shuffleboard all day and night!", "author": "Sara K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "Nice place !!! BUT : they have banners hanging at the pole to the the wall which blocks the view onto the large screen and do not consider taking it down even on request. So either you have a good seat from begin with or you can enjoy seeing 40% of the screen. So basketball... relay on the crowd who can see the screen to realize who scored.", "author": "Sfo993 B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "One of the better bars in the Outer Richmond. All the other bars are real divey. Lots of seats and stuff. Basic stock of liquor. I always love places that have smoking sections inside the establishment, even though this could bother people with the smell and all, but cmon, it's a bar, not a day care. Super chill, accepts cards, juke box!", "author": "Elton F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "After enjoying a drink at Trad'r Sams my besties and I headed down Geary and landed up at Blarney Stone. The place was laid back and spacious and the crowd was chill (I hate using that word, but it was the best one to use to describe the people). A woman approached us and asked us to participate in a blind test of 3 samples of whiskey and scotch (gross!) but what kind of crazy person denies complimentary alcohol?!\n\nAfterwards we indulged in shots and beers from an extremely nice bartender who participated in our \"Best Friends For Live MoFucka!\" shots. It was fun! We had a blast and this is where the night ended for my besties...I helped their staggering drunk asses out back to the car, haha. I can't wait to head down to Blarney again!", "author": "Surge C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "Best bloody Mary in the city. Love.\n\nWarning: if you say spicy, they give it to you SPICY.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "NIce bartender, cheap happy hour.  Only serve food on the weekends.  Plenty of TV's if your looking to watch a Giants game.\nDecent.", "author": "Song H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "A good, consistent bar in the neighborhood to go watch sports and start a night of drinking! \nPlus, you get to bring outside food into the bar and having the bakery next door is a def pro!", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-11", "description": "They have a lot of tv's which is great for sporting events, but there isn't a whole lot of seating. The back patio is kind of hidden, so I didn't even realize it existed until I'd been here a few times. \n\nThe drinks are delicious. They have a Skyy Blood Orange drink that is really phenomenal and they're only $6 which is nice. If I lived nearby I'd probably go more often. \n\nI've heard they also have really great brunch, but haven't been able to check it out yet.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Great bartenders. Happy hour prices are fantastic. Fresh squeezed huge mimosas. Outside patio.", "author": "Me M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "Best.  Bar. Evar!  (Or at least on this block)\n\nI'm a huge fan of this bar.  They squeeze their own oranges, limes, lemons and grapefruits and when they're in season, blood oranges.  The bartenders are awesome.\n\nA half star off for the accoustics.  With a few sound treatments, 5 stars.  :)", "author": "Theron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "I came here for St. Patrick's Day and the place was, expectedly, a zoo. The owner was really cool, super friendly and personable given all the craziness inside. I've been here other times since then when it's much calmer and I really like the place. It's really big and open. They have a cool outdoor patio area which makes it a perfect place to day drink. Lots of tvs and a big screen projector that they put games on. They have pool tables too. They do have a virtual jukebox but they need to replace that thing asap because it sucks. The screen is broken and it takes like five minutes to select one song. Drinks are good and bartenders are friendly but one pissed me off because she just blatantly skipped two songs that I had played on the jukebox. I don't care if you don't like Britney Spears; I paid for that shit. Not cool. \n\nAll in all this is a good bar for pretty much any occasion.", "author": "Kelsey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "Good crew . Chill holiday night . Owners work behind bar mostly neighborhood fellas. Good for groups and big screen sporting events .", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "I am not a local, but came here with a group of friends who are in order to watch the SF 49ers win the NFC Championship. We got there about an hour before the big game and the place was packed. The bouncer told us that people were there hours before they even opened just to get a good seat. The only downside was that there was not enough seating for everyone and even standing space was a little tight.\n\nThey have numerous TVs which made it easy to keep an eye on the game. The bartenders were very friendly and incredibly speedy. Considering the bar was packed I never had to wait more than a minute or two to get a drink. The prices are very fair and they also had a good specials. There were also serving beer and food on the back patio which was great because all the football fans were quite hungry.\n\nThe atmosphere was very casual and fun. I really enjoyed my time here. I will be visiting again in the future.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "My friends and I stumbled upon the Blarney Stone when another place nearby was packed full of people. But I'm glad we came here instead because I was craving a good snakebite (cider topped with Guinness) and space.  \n\nThe atmosphere is your typical pub ambiance. And I was surprised about the cleanliness.  To top it all off, the drinks prices are reasonable (my snakebite was $6).\n\nI didn't see any creepy men there.  The people that I encountered were late 20s/mid 30s having a great time amongst friends.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "Great spot for those seeking the nectar of the gods. Featuring their respectable variety on tap for the bros and broads, and generously heavyhanded cocktails kept tasty by fresh squeezed juices for any and all in need of a \"refresher\", The Blarney Stone greets all thirst with a thorough quenching  embrace.  \n\nThis neighborhood bar is comfortable. It has a curling rig, ~10 tables, 2  booths and accomidates to the nicofiend on their back patio. If your like me and find it a nuisance to have to leave a bar to breath, you'll appriciate their patio. I love the fact that if one so chooses one can get some air without interrupting their regiment of intoxication. \n\nThese freindly neighborhood bartenders take goooood care of you. Tip well!", "author": "Jp K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Great spot to relax and watch a game. Go here with my boyfriend to watch Notre dame play we love it. Bartender Nate is awesome.", "author": "Erin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "Not that I frequent the Richmond too often to go out- but Blarney Stone gets my vote of awesomeness.\n\nWe decided to double-date last night and headed here after some Korean BBQ down the street. For $26.00 I ordered us our four drinks- Jameson on the Rocks, Old-Fashioned, Vodka/Soda, and a Speciality drink. Not so bad Blarney Stone- not so bad!\n\nWe also placed our card with the bar to play Shuffle Board- which is awesome! A dumb game, but a ton of fun to enjoy while enjoying a cocktail.\n\nThe staff is friendly, the price is right, and the atmosphere is laid back and fun. I also LOVE that they have a jukebox! \n\nIn the event I venture back to the Richmond, I'll certainly venture back to the Blarney Stone!", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Stopped in with some friends last night since we were in the neighborhood and had no regrets.  Nice chill bar, nice chick behind the bar who provided good service, pretty standard prices, and nice pours.  Nothing outstanding mind you, but if I were in the area wanting a pint and a whiskey or three I'd be more than happy to return.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "Pretty loud, but good prices on drinks. I checked in on foursquare and whammo! Check In deal! 50% off from Scoutmob. \n\nIt's clear that the bar is UM and CSU bar. That's a weird combination. I'm sure there is a good explanation, but also, an unlikely pairing.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-21", "description": "The place is jam packed, shoulder to shoulder and all that jazz.\nThey play pretty good music but its LOUD. don't expect to old a conversation with your friends unless you're having a screaming session. But, you can still talk in close proximity. We were fortunate to grab a table near the corner and the drinks were amazing! I had their cherry bomb (yum) and irish car bombs AGAIN. Their irish car bombs were AMAZING. Better than tradr' sams.  The people were nice and strangers do offer to help you take pics! \n\nWe stayed their for an hr or so and just talked. loud music. fun times. good company.  You have to push your way to the bartender, because its super crowded and people don't move in there! \n\nI would definitely come back to hang out. but, if you're looking for a conversation with friends- dont' go here..lol", "author": "Julie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "I have been to this bar quite a few times since moving to the outer richmond. All the bartenders are great + drinks aren't overpriced.  My favorite thing about it is the outdoor patio.", "author": "Dana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "The Blarney Stone is a nice, chill Irish bar in the Outer Richmond district. The bartenders are very friendly, down to earth and always down for a good conversation. \n\nThis is a great bar to just grab a drink at with friends or coworkers when you don't want anything too crazy. \n\nThey allow you to bring in food, which is always a plus & for games (Giants, Soccer, Olympics) they have tvs & a big screen. \nThis bar gets packed with crazy drunks whenever there is a big event Golden Gate Park (but hey, what bar doesn't). \n\nThis is the kind of bar I've recently become a fan off. I realize I'm getting \"too old\" for the crazy drunken nights and now just want a drink here and there. This is the perfect place for such nights.", "author": "Helen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-06", "description": "It's Cinco de Mayo, and of course, you'd go to an Irish bar, right? HUH? \nYou read correctly or may be completely hungover from last night, but yes, in honor of this Mexican Holiday, my friends and I hit up the Blarney. \nTrust me, we were in the Avenues, and Tommy's Mexican Restaurant and Tia Margarita's were our \"Go-To\" places for tequila y cervezas, but it wasn't meant to be. Crazy crowds inside and outside of both Mexican restaurants, and we weren't willing to wait a gazillion minutes for a table. \n*So, what's this Pinay Paddy and her friends to do? Go with Plan C - Blarney Stone! Our hearts were definitely in the right place, but we opted for no margaritas at this Irish bar, and instead settled for the brewskies. \n\nAnywho, when I used to live in the 'hood,' I'd frequent this place, and always solid good fun! I love the chill and relaxed vibe, and the patio area out in the back. Crowd can be a mix of locals, students, and even a few tourists. Decent selection of draft and bottled beers and lots of hard alcohol for your drinking pleasure. There is a jukebox and various tvs for your futbol or other sport watching, and oh BTW trivia is held on Tuesday nights. I also think there is karaoke night, but can't recall which day. No unisex bathrooms here (thank goodness), but one drunken evening, I walked into the Men's room by accident. Oopsies! When I realized where I was, I exited immediately to enter the ladies room, hoping no one saw. Boy oh boy, was I wrong. My friends got a good laugh at my expense. Whateves! :) \n\nAs you may (or not) recall, a few months back, I yelped all Irish establishments in honor of St. Paddy's Day. I inadvertently missed yelping Blarney. Erin Go Braugh and Salud to you Blarney! \nA lovely Irish bar in the heart of the Inner Richmond, and next to John Campbells Irish bakery, a wonderful Irish bakery that I also hold near and dear to my heart!", "author": "Gill C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "Best. Tots. Ever. Living in the Richmond district, this is the default spot for a great night out within walking distance, or a great place to grab a weekend brunch with XL fresh-squeezed mimosas and awesome bloody marys. Doey is a great bartender. Oh yeah, and did I mention the best tots ever?...because yeah. BEST TOTS EVER.", "author": "Dorian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "Solid neighborhood bar. \n\nAll your standard pub essentials: beer specials, irish references, multiple TVs for watching the game. But this place is really clean- it doesn't even smell like a bar. There's a ton of seating, plenty of space for large groups and a back patio.", "author": "Chrissy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "I love watching Michigan football here. Besides having my fellow Wolverine fans surrounding me, the entire staff is very friendly (they even know my name from frequenting there every college-football Saturday), and the food is great (way better than it was last year -- I hope they keep this new cook).\n\nYou can tell they get along great with the customers, and it's a nice, comfy neighborhood bar. They have plenty of nice HDTVs around, so you won't miss any action. I love this place!", "author": "Dan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-01", "description": "Cool neighborhood bar located in the Richmond district!\nIt's a nice hangout spot that doesn't get too crowded and attentive bartenders.  There are flat screens around the bar for you to watch SportsCenter on ESPN as well as air hockey tables for entertainment. \n\nI liked the big tables set up against the walls and they have some good deals at the bar for specific beers.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "I wish I could give this bar 10 stars. Beyond the awesome bartenders to the great (affordable) drinks to the weekend brunches this place is a haven. Having gone here since turned 21 and moved recently to the neighborhood I not once in my 2.5 years had a bad experience. EVERYONE is really friendly and nice, there's ample seating and even if there's a game on and it gets rowdy, there's still a maintainer crowd control feeling. Nothing bad to say about this place AT ALL. EVER. NEVER.", "author": "Katerina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-30", "description": "I was visiting from out of town and came here to watch the Michigan game vs OSU with my family of Michigan fans.  I was looking for a bar that was lively without being packed to the brim with college students, and this place hit the mark! \n\nAlso, mimosas with hand squeezed orange juice?! yes please!", "author": "Alex Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "Many people were worried (including myself) when this place changed ownership a few months back, but I think it got better.  No more Irish brunches on the weekend, though they do have BBQs on occaision and my understanding was that they did plan to serve food \"soon.\"  Outside food is still welcome.  \n\nMy favorite part of the change? Greyhounds and screwdrivers now include fresh-squeezed grapefruit and orange juices, and by fresh-squeezed I mean they have an actual juicer juicing actual fruit.  Score! I miss this neighborhood, this spot is one reason.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "I find myself frequenting Irish bar's quite often lately. Hmm... I wonder why...\n\nBlarney Stone gets a solid four stars, although it has a tendency to be hit and miss. I went in one Friday night, and was quite impressed with the sassy menfolk, and then went in the following week and was utterly dismayed when the only people to hit on were a group of Indian men and some totally inebriated Feminem wannabe. Gross.\n\nKeep in mind, I did go in around last call... so that may have something to do with it. \n\nEither way, I'm a fan. Thank you San Francisco for all the beautiful Irish men. And  by beautiful, I mean drunk.", "author": "Jillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-01", "description": "Candlelight!  With real candles!  And real candle wax!  Ohhh, this could get naughty...\n\nThe cover of darkness and vast selection of alcoholic beverages gives this place an ambience of debauchery and madness, further evidenced by the lingering smell of regurgitated consumption.  \n\nI met a reallly hot guy here on Tuesday night for some drinks and convo, and was excited to see that they had trivia.  Then the RHG told me he's not that into trivia, so my little trivia balloon deflated.  No matter, as we managed to talk about a plethora of subjects while partaking in two of the many beers that were on tap (in case you're taking notes, it was Widmer for me- from my brief stint living in Oregon, and Sam Adams Octoberfest for him- I could only imagine was to toast our mutual Boston connection).  \n\nSuffice it to say, this is yet another Irish bar that I like.  It was virtually empty when we came here, and I don't know how I'd feel if it was packed (less opportunity to use the candle wax in ways other than to hold up a wick), but I definitely dug the vibe.  They have an excellent selection of liquor, and had I not been trying to impress RHG with my beer knowledge, I would have liked to get an irish coffee.  Perhaps next time.  \n\nAlthough we moved on to bigger and better things that evening, I will look back on the Blarney Stone fondly, although I'm going to have to take away a couple of stars....\n\n1 for the occasional wafts of vomit odor- this may make it an authentic Irish pub, but it's not that pleasant\n\n1 for them not taking credit cards- this may also make it authentic, but I try to deposit all those ones I get from my other other job as soon as possible.  It's tough carrying around money in your thong, so I stick with the cards.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-04", "description": "We hands down loved this place. The food is great. The people are friendly and the bar tender was helpful. \n\nGranted it wasn't very busy when we went in on a Monday afternoon so at times the bar tender disappeared when we wanted service. But we weren't too picky about that, so it still stays up in stars.\n\nWe ended up playing cards and laughing our time away at a table once we got a bit bored sitting at the bar.\n\nThe cutest thing that happened: when I walked up to the bar and asked for our check, the bar tender handed me a napkin.\n\nHe drew two lines separating three columns and said \"Dis is da one for yew, dis is the one fer da boyee in the middle, and dis is da one fer da other lass.\" I smiled and laughed. He did bill exactly what we each asked for and since I did share quite a bit of whiskey with the \"boyee in da middle\" we put our totals together and split it evenly.\n\nI wished there were a few more Irish whiskey selections, but I suppose I've been a bit spoilt by the Black Rose Irish pub back home. I stuck with drinking the Tullamore Dew happily. But there were the other usuals like Powers Gold, Bushmills, and Michael Collins. I missed my favorite Red Breast though.\n\nIt does seem all the Irish bars we frequented over the day are cash only, and this one was no exception. However, this was our last stop so we had plenty of cash in hand after getting used to the idea.\n\nThe afternoon impression: Cool, Comfortable, Friendly, Warm, and worth stopping by again.\n\nOh and high recommendation to the curry chicken pasty. We just wished it came with more curry sauce instead of HP.", "author": "Marlene T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "I freakin' LOVE this place! it is THE quintessential neighborhood pub.\n\nThe Bartenders: In my opinion, a bar and your experience within is only as good as the 'tenders. Doey (I know I'm spelling this wrong), Bart, and Nate. There are more, but these are they guys I see and I love 'em. Super friendly, while still being real. (Sidenote: People, ALWAYS be nice to your bartenders and servers. They are people, they are your servers, not your servants, and they yield way more power than you bother to acknowledge!)\n\nThe Atmosphere: For me, it's the perfect balance. Neighborhood vibe, comfortable and non-pretentious, but clean and not dive-y. (Don't get me wrong, I love a good dive bar, but I'm just clarifying.) I can come here with friends, alone for a chill beer, watch the games (lots of T.V.s and one is a HUGE screen!). There's free shuffleboard and air hockey, a jukebox (although I feel the volume on this can be too loud) and a back patio with great atmosphere. My only wish is that they had a kitchen, but I get why they don't, and I don't care because what they do, they do well. There are still plenty of food options to get for take-out, too.\n\nThe Crowd: I've seen a little of everyone in here. Barely legals to gray-haired regulars. I love that there seems to be a lot of neighborhood folk, who the guys behind the bar know by name. It's been pretty non-douche-y every time which has me breathing a sigh of relief. Even if there are a few, they tend to stay together in a little douche-y cluster. Any drunk regulars are harmless. \n\nOn a personal note: I love that this place is two blocks from my house in a safe neighborhood. I love that Doey promised my cousin that he would watch out for me when I stayed behind one night. That's good people. I love that I've actually made friends out of strangers. I think this place is getting to be my Cheers. \n\n\"Norm!\"", "author": "Suganthi J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-02", "description": "Okay people, let's get some definitions down--just because a bar is old and not trendy, this does not make it a \"dive bar.\"  As a matter of fact, I have consulted with the experts, Mr. Guinness, Ms. Greyhound, and the Kamikaze and they have all confirmed that you can't really be both a sports bar and a dive bar.  It's in the regulations.  Check'em out www.divebarregs.bs. \n\nThis is not a dive bar.  It is called \"The Blarney Stone,\" and it means it only in a mildly ironic way. Now if it were called the \"Blarney Stud\"--then maybe it could be a gay dive bar.  \n\nOkay, now that I've vented I can get back to the review.  This is your fairly typical, neighborhood Irish pub. It's got TV's and plays local sports, so it could double as sports bar.  It has a trivia night which is yet another sign that it is not a dive bar.  The only trivia nights that dive bars...\n\nOkay, okay, back on my meds.  We've established that it's an Irish pub.\n\nNow even though it is fairly run of the mill, it is light years better than Hooky Hell (my new name for Hockey Haven) just a few blocks to the west.  Blarney has okay atmosphere.  Good lighting.  Nice wooden décor and Guinness served the right way--to me.\n\nNow I would never leave the city to come here, but if you happen to be in the Richmond District it is one of three fairly similar bars within a few blocks.  You don't really feel like you are in the city here, which is both good and bad.  Bad because the crowd is maybe a little too low key and cliquey.  Good because you can get away from the pretentiousness of the city and just have fun with your friends.  This is not really a pick up spot, I don't think.\n\nI wouldn't mind hanging out here every so often.\n\nOh yeah and here's a tip for the gals--there's a secret way to get the bartenders attention here. It's called flirting with them.  They will keep an eye out for you and refill your drinks when you're out.  Oh yeah, and they're hot too...(see how well it works).", "author": "Nikki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "LOVE this place. It's not stinky and dank like a lot of other pubs in the city. It's actually super clean and spacious.  The staff is really friendly and there's always an interesting mix of patrons from locals to The ENTIRE SFGG Rugby Club....yummmm...but I digress...\n\nCrowning moment: with literally 3 mins. until our bus arrived my friend and I ran in to grab a drink,  laughing our heads off.  The bartender didn't look at us like \"what the f- is up with you mofos??\", but instead was all smiles and served us on the spot-pronto. He didn't want us to miss that bus. Now that's the kind of bar I like. Not pretentious. All fun.\n\nThank you, Blarney Stone for being the coolest bar in my neighborhood.", "author": "Shree R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "Good bar and good crowds on game nights. They play the Giants game WITH sound on a large projection tv and it's fairly easy to get a drink in the joint. \n\nOrder beer, the usual bartender is lacking in the common sense and brain department.", "author": "Mafia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "The Blarney Stone just became the official Michigan bar for San Francisco (GO BLUE) and though it's kind of far out there, it's a great place to watch a game. Several flat screens, plus a pull down screen that most folks in the bar can see. It also has a square layout which lends itself really well to a lot of folks watching the game at the same time.\n\nAlso outdoor patio which is awesome - I just wish that the TV they have out there was a bit bigger. Still cool that they have one at all.\n\nBartenders are friendly and seemed thrilled to have the extra business. \n\nWolverines, head for the Blarney Stone on Saturdays this fall. Notre Dame fans...you probably don't want to.", "author": "ramya r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "We stopped by here for a quick drink and to kill some time. Unfortunately they were having problems with many of their draft beers, but the bartender was friendly and apologetic. He did a great job given his circumstances!", "author": "A. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "Every time I walk into this place, I feel like I need to have a biker leather jacket to complete the look of the regulars that often come here.\n\nI do like coming to this local, low-key sports bar in the Outer Richmond. It is very spacious even when busy, with plenty of seating inside and outside. They also have a free shuffleboard AND air hockey, which is good for groups. They also have lots of TVs that will easily distract you if you are riding solo here. You will either be watching a sports game or Fuse TV.\n\nI also give them mad props for showing Wimbledon/US Open and other tennis games from time to time (when it's slow/daytime, don't worry late night drinkers) on one of their TVs. I am a HUGE tennis fan, and combing that with my love for drinking beer, it's bliss coming here.\n\nI also appreciate the fact that they make their drinks from STRACH. When I order a Whiskey Sour or Lime Margarita, they squeeze fresh juice into my drink, not whip out a bottle of syrup. It gives the drink a bit more character. Way to go Blarney Stone!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "Cool place, not too crowded and have some cool spots to sit at. They have a little backyard so if you're a smoker that's another star for you. \nI love that they have blue moon and the bartenders are really nice. \nI usually go here when traders is way too crowded.", "author": "Lana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-12", "description": "Friendly serve and a good time... a few blocks away from Tommy's so hit this place up after we shut down the Mexican Restaurant.  The owner recommended it!", "author": "Shiho F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Pretty chill place. I would go here again, but I wasn't too crazy about it. Service is good.", "author": "Nemesis J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "Come one come all!  My coworkers & I dropped in to catch Game 6 of the NLCS. Can we say Awesome! Low key, good crowd, multiple  tv screens , plenty of seating , pitchers on tab all around.  Since they didn't serve food that day, the staff allowed us to bring in take-out from Volcano Curry across the street.  You can't beat this.  Def a fan.  We'll be back!!!", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-18", "description": "Year after year, I'm lured downtown to gawk at the pig pen that is Front St. on St. Patrick's Day. $13 beers in a giant boot while crammed against bros declaring their love for Journey? \n\nNo thanks, holmes.\n\nThe result is the same. I grab the fastest bus I can and head for an Irish pub as far away as possible from the 'Di.\n\nI've been to Blarney Stone for St. Patrick's Day twice and it's been a consistent joy. A cozy patio with food and beer gets a drink in your hand faster than a normal night at any other bar. The crowd is friendly and it's festive enough to feel like you're getting crunk for a reason on a Wednesday night.\n\nAnd I really love the staff, from the friendliness of the door guy to the woman serving booze outside. Per esempio: \n\n---\n\n[ordering beer in the garden]\n\nKeane: You can just reuse the cup I have...\n\nBeerwoman: Are you sure?\n\nKeane: Yeah... I try to be green when I can.\n\nBeerwoman: Ah! Today is a good day to be green!! *winks and smiles*\n\n---\n\nPoint, Blarney Stone.\n\nFor the night's battle of wits has been won.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "I fall everytime I leave this place. \nLike many things Irish, Does not disappoint.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-14", "description": "I drank here in the morning a couple times and also in the afternoon.  I have only been in the front section, i didn't know they had a back area.  the front interior has a lot of wood, which I don't really like.  Good bartenders who know their Irish stouts.  \n\nA good Irish bar in the morning.  I used to always get the half Bass Ale, half Guiness drinks there.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-19", "description": "We ate our food from John Campbell Irish Bakery here.  They didn't say a word.  That's cool.  Heard they own it too.\n\nWe got a Guinness beer $4 & an iced tea $3 = $7.\n\nSeparate lad (men) & lasses (women: 1 toilet/sink) bathroom.\n\nThink there was 4 TVs in the place.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "This bar is my favorite neighborhood bar in San Francisco.  The bartenders could not be better. The atmosphere is spacious yet cozy, and boasts large screens for sporting events (go giants!)There are an assortment of fun bar games to play, and locals to converse with. They also have an awesome brunch. I have nothing but amazing things to say about the Blarney Stone!", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-25", "description": "Mostly a locals bar, nice neighborhood vibe, I have meet a handful of very cool folks here since I moved to the neighborhood. The staff is awesome, really customer focused.\n\nGood place to catch some sports, they have four flat screens and a big projector tv. You will always find live sports, ESPN or Fuse on the tvs when you walk in. Saturday and Sunday they do brunch for college and NFL football. The NFL crowd is pretty fun, mostly 49er fans but there was a scattering of people rooting for every other team that was being televised. The food wasn't great but decent for bar food to fill you up while throwing a few back. \n\nYears ago when it was run by Irish, we used to come here underage and drink. Now I try to avoid bars packed with 20 somethings so I stay away on Friday and Saturday but any other night I have been there the crowd can be decent sized but not annoying. \n\nI'd give their staff 5 stars, the atmosphere 4 stars and the food 3 stars, that averages out to 4 stars in end I suppose.", "author": "Richie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "03.05.10\n\n$5 margarita specials all night.\n\nHigh ceilings, no drunk patrons, just people enjoying themselves and their drinks.\n\nAwesome bouncer :)", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "My favorite place in the Richmond district! This Irish bar features cool bartenders, a nice patio, and a shuffleboard. There is plenty of space to enjoy your drinks and watch your favorite team! They also have brunch on Saturday and Sunday, and the food is good too. Cool atmosphere overall! Go check it out! :)", "author": "Silvia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-04", "description": "If you want one of the best bloody mary's come on a Sunday morning and for $5 your mouth can experience it. I like coming on  a game day and being surrounded by other fans. Sometimes there will be people... but you can't really avoid that part of going to a bar I guess. Not a great update to my review... but oh well... p.s. doey is still sexy.", "author": "Marie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "Good priced drinks and plenty of TVs including a projector screen to watch all your fav sports.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-15", "description": "Fine if you're just looking for tap beer, don't ask for anything too complex.", "author": "Cassandra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "Nice bar with great attentive bartenders.  Never wait for a drink.  Giants bar mostly but they don't discriminate because I'm an A's fan.  Always have a game on and multiple tv's.  Nice people, younger crowd most nights.  Just the kind of place I like.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "Great bartenders, lots of TVs, a patio, jukebox, table shuffleboard, darts...it's like someone put everything I love in this bar. PLUS, they take credit cards, which always puts a little smile on my face. \n\nBlarney Stone is a low-key joint prone to regulars and the assorted passers-by. It's a great place to meet for a drink and catch up, as you're never drowned out by the music or fending off (too many) drunk people.\n\nI've been watching a lot of the World Cup/NBA Finals here and it's been great. The only negative is that there's no food served (except in the morning for the World Cup), but they allow you to bring/order food from outside. Problem solved. \n\nGo forth and imbibe!", "author": "Tom A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "I had an excellent time at this bar. Bartenders are friendly and promote a good atmosphere. Excellent pub local bar feel.", "author": "dack t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-12", "description": "About a month ago stopped in to try the Irish breakfast; it is a huge thing, of irish sausages ( so fatty juicy, the oil just burbles out), generous amount of cheese and eggs in a freshly made hunk of bread. I thought it tasted ok, however, its' too much food. When it goes down, it will hit your tummy like a Hand Grenade.\nI came with my Irish buddy , who at 285 lbs, could not finish his food. Better bet is to split the sandwich and get your own pint of Guinness. \nDecor: pool hall.\nService: very very slow. They served other people who arrived after us, before us.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "Alright, the Blarney Stone got sold in November.. its run by new people and has new management. It's been no secret I've been unhappy about the change, but only because I don't do well with change in general.. I've been going because it's local and I've felt dirty doing it.. But like Pavlov's dog, I've been trained to walk over to 21st and Geary to relax.. and I tell you... It's actually just as good as its always been. Just cleaner.\n\nThey hot Irish guy still works there on Monday nights, and they still have awesome brunch on Saturdays and Sundays to go along with the game... You will no doubt find me milling about..", "author": "Zee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "After using Yelp for well over a year, I decided to join you all and start judging myself! \n\nMy first review... phew, it's a lot of pressure.. I wish this thing had spell check.. oh it does! \n\nFour stars because: \n1 because the service is good, \n2 because the drinks are good, \n3 because they use fresh ingredients, even if those juicers totally get in the way. And I got sprayed! \n\nAnd 4 stars because of the following analysis on new leadership and direction:\n\nThe Blarney Stone has been the local spot for years now, I've always gone in when I had the chance to grab a bite (ha! the portions are huge, there will be no nibbling here!) of brunch on the weekends. Though they do not have the same rush of people frequenting, as they used to, when I first moved here, they still have an amazing Irish breakfast/brunch. Get the Ulster, it's amazing. \n\nI've read the reviews, and yes, Bart seems to have a hard shell, but at least he's real. He doesn't just cozy up to anyone who throws a dollar down, and I appreciate that.\n\nThat goes for that new Indian chick too, who seemed to be handling the brunch and the bar! Woo, that girl can move! (I think her name is Rasha.. She's cute.) The're both efficient and courteous and seem to handle the drunks well. They ask you the basics any bartender will ask.. and will talk with you if you have something interesting to say (not as though you need to bring up the Zeitgeist conspiracy or anything. But I think they figure if you want to talk you will talk.) \n\nThe atmosphere is different, not bad, just different. They have not really found their own new identity yet, seemingly riding off the old one. It's like an old friend who has undergone a drastic life changing event, and they themselves, in turn, have changed.. But it's still your old friend the Blarney.\n\n\nStay tuned for my next review!", "author": "Rascal F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "I had a great time on Saint Patty's day.\n\nI also found a watch and a memory card. If one or both belong to you, call the bar and tell them. They have my contact info.", "author": "Sierra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "I would never have found The Blarney Stone were it not for a warm day in SF and a long, ambling walk from Sutros Baths.\n\nWe walked along the Lands End Trail from Sutros Baths to Baker Beach through the Seacliff neighborhood. At that point we decided to saunter back to the beach through Golden Gate Park (it was quite a long walk) and as we were heading to Golden Gate Park we spotted the Blarney Stone. Of course we stopped for a pint mid afternoon because it was a warm day, it was a Saturday and it didn't seem too unacceptable to drink at 3 in the afternoon.\n\nThe interior is well lit and the bartenders are friendly. Everyone seems to have an Irish accent (bartenders and patrons) and they had Smithwicks on tap (my absolute favorite Irish beer though it will never compare to the stuff you get in the UK). They had a nice selection of ales and an even better selection of Irish whiskeys. They even had a few shitty domestic beers all relegated to the corner like a bastard child--obviously neglected but necessary in this country and our expectations. \n\nIt seems like the sort of place that would be fun in the evenings with live music, quiz night and darts. We sat for about half an hour with a pints and we chatted, listened to other conversations and watched the bartender pull an expert pint of Guinness. I'm impressed.\n\nAlso impressed that the bathrooms are surprisingly clean for pub restrooms, but we'll see how clean they are if I'm back in the evening.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-02", "description": "An awesome, awesome place to watch a game.  We were lucky enough to snag a table here for Giants/Rangers World Series Game 4.  \n\nUnlike a lot of bars in the city, The Blarney Stone is square shaped, not long and narrow, so they can fit a nice amount of tables in their main area.  Plus, the ceiling is very high, and they have a nice big movie screen hanging from the ceiling on which they project the game.  Add in a few flat panel TVs along the bar, and you find yourself with multiple angles from which to watch the action.\n\nThe place was filled to the brim the night we were there, with everyone cheering on the Giants.  They had happy hour prices going on during the game, plus a burger/hot dog menu to keep our bellies full.  The Blarney Stone definitely took advantage of the World Series opportunity, and made for a fantastic venue to watch the game.  Thanks guys!", "author": "Tim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "Two more days until MICHIGAN FOOTBALL. I love this bar. See you guys Saturday!", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "I'm biased. It's close to my place, but after Doey poured the drinks it was great. I told them about my trip to Ireland coming up and he was super friendly about what not to miss in Dublin.  It is hella loud sometimes, but it's a sports bar.  I prefer the male-tenders personally, but it's got some charm.  Lucky charm? ok, bad joke.", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-15", "description": "5 stars for being one of the best bars to hit up in the Richmond\n\nNice, clean and laid back place\n\nThe environment can be to come and watch a sports game or spend an evening with friends\n\nBartenders are really friendly and make good strong drinks at decent prices", "author": "Charles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "This place is super fun! Our kickball league goes here after each game on Sundays to play Flip cup in their  outside patio area-which is awesome! Inside the drinks are served really fast, pitchers are cheap, the bartender was really friendly, and the patrons were fun to talk to. I was also allowed to bring my doggie in, so that's always a perk as well. There were plenty of seats inside to accompany our large group, so it's great for this reason as well. I'm excited that this will be a new Sunday Funday watering hole!", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-18", "description": "Not bad!\nThe space is great with lots of open space and seating, some great flat screen tvs and decent music playing.  However not very friendly and although the young women and man working the bar were nice, it was hard for them to keep up with all the orders and hard to get there attention.", "author": "Red R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "Hospitable bartenders serving fresh-squeezed citrus drinks, numerous HD TVs tuned to all key sporting events, Irish-style weekend breakfast/brunch, parlor games from free shuffleboard to air hockey, spacious and landscaped back patio, clean restrooms, and many other positive attributes are maintained by Vince and Bart, the co-owners originally from San Francisco who provide all types of patrons a great experience visiting this Outer Richmond watering hole. Whether you are a regular, a post-Outside Lands party goer, or a group of Mission-district residents looking to switch it up, all walks of life will have an amazing time at the Stone. Mix it with the amazing nearby food options (e.g., Tommy's Mexican, Aziza, Hot Sauce and Panko, etc.), you can spend quite some time in the neighborhood. I'm a Mission resident and thrive on spending free time at my local joints, but visiting the Outer Richmond every so often is a must, and the Stone, along with Trad'r Sam, are dissimilar Little Russia-inhabiting bar twins within walking distance that will leave you smiling.", "author": "Michael B. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "Great neighborhood bar for me and the roomies. Cash only, but there are like 5 banks in a 3 block radius, so shouldn't be a problem.  There are definitely some regulars that are there all the time, but never felt out of place when walking in there since the bartenders are so friendly. Also, it connects to the Irish bakery so they will sometimes bring in free samples or you can just buy some deliciousness and they walk it in when it's ready.\n\nSometimes the girls and I go for \"one pint\" then end up staying there for hours upon hours, proving our attraction to this local establishment. It's just so relaxing there during the day on weekends. And, hey guess what? I wannna tell you something. I love booze.\n\nIt's usually a pretty chill bar unless one of the Irish teams they sponsor has had a big game, and then it gets good and rowdy.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-19", "description": "I'm glad not very many Yelpers made it to this happy hour....so there! \n\nFirst off, there wouldn't have been enough room because it was crowded with Irish people dancing to an Irish band, drinking Irish Car Bombs and passing out on the Irish bar then receiving Irish kisses* from the few Yelpers that did attend.\n\nSecond, we wouldnt have all had a place to sit on the cool outside patio, chit chatting the night away in a more intimate group than you normally get at a DYL.\n\nMost importantly, it wouldn't have been as special to share with tons of people the moment I found out that Black Irish G. is actually White English G. (yep, uh huh, his Momma told him so, on the phone, I was there...I heard it with my own ears). \n\n*Irish kisses are sort of like French kisses. You still use tongue, but you use it to lick various body parts of passed ot Irish guys. HOT!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-17", "description": "This is a great Irish Pub, proper style.\n\nShow up early, drink lots, pass out on the freaking bar if you'd like.  The bartenders won't bother you.  Be warned: other patrons might use you for photo ops.\n\nThey have a small terrier who resides on the spacious patio out back.  He's got the most awesome non-threatening, \"I'm all excited but slightly annoyed\" snarl.  I think someone fed him after midnight.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-03", "description": "I dig this place when it's not crowded.  The staff is really friendly and the drinks are alright.  I wish they poured a bit stiffer but I'm a hard person to please in that regard.  My idea of mixing drinks is 1 parts Jack mixed with 1 parts Jack.  \n\nThe atmosphere is relaxing, but you can yell and sing along to whatever is playing without too many dirty looks.  If you're there and it is not too late, there is an Irish bakers right next door so that is a huge plus as well.", "author": "alex l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-19", "description": "This was my truly first DYL experience from start to fin...one of the first 4 to arrive around 7ish where i was openly extended with warm fuzzies by Eric W, Black Irish G and Jennifer s. (actualy i think Christopher K was there b4 all of us at the bar)  A bartender was sweet enough to roast me very own fresh irish coffee-yummmm!\n\nLike 45 minutes later and being amused by BIG's rendition of a black leprechaun http://images.yelp.com/photo?id=qajOBCTxWKwMbyc_IT1bWg&s=l\nother Yelpers rolled in with the adjoining of many tables and downing of Guiness, Jameson, and Irish Coffee...oh..oh a live Irish band is playing tonite--hot!!!!\n\nLater in the eve we had taken over the dance floor, most of the seating area and the back patio.  I got to meet tons of new faces and share in the laughs of much DYL zanyness.  \n\nYes!  I actually caught Rommy G's famous worm in action--smooth as hell!!  Got to stomp, march and clap all night to smokin' jams with everyone and learn how to bust some real, authentic jig-shit from Mark a p!!!  Killah!!!!!\n\nThe patio was very comfy, tho the heating lamps weren't on...i was just buzzed enough to get egged on by NISHisHOT to try and ignite some power into the battery with my ass..uh thanks!  Yo Todd!!  Great pick and to the staff at BS--big ups!!!  Had a decked out dude playing the pipes and a harem of miller-lite girls--hooray!!! \n\nWe were all having way too much fun and ended up heading over to Gabriel R's for the afterparty...thanks Kathryn for helping me get there in one piece!!!", "author": "omar b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-17", "description": "The Blarney Stone is a good Irish bar.\nI really like the patio out back...  the drinks were very strong.  I had a good time here.  It is a haul to this bar from my apartment, so I doubt that I will make a regular habit of hanging out there.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-17", "description": "I don't know how to say this other than Blarney Stone is the standard I will now use for other bars. It's not trying to be some trendy club bar neither is it a dive. It's a bar through and through.\n\nThe hard wood layout is classic. The juke box selection is plentiful. The live band is a group of lively octogenarians. The bartendress is polite and service is swift. Drinks are clean, just strong enough and moderately priced. \n\nIt's a lively good time, and may only have been as good as it was because of it is St. Patrick's Day weekend. Regardless, I would come again in a heart beat.", "author": "Keith M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "Solid 4 starts for the boys.  The do a good job and they were there for the hood when the hood needed them.  I loved the previous owners as well but it was a bit depressing at times.  I do miss live music Friday night so bring that back eh?", "author": "jd h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "One of the best bloody mary in town. All the bartenders here are super friendly. It's a great hangout place for watching games.", "author": "Jun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-08", "description": "Stopped by on a Saturday afternoon in April.  Good for a draft and to warm up a bit.  Nice assortment of sports on the TVs.  Only a few folks at the bar so great service.  Wish they had had something other than bags of chips to snack on, but the beer certainly hit the spot.", "author": "Geralyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-04", "description": "Disclaimer... 99.9% of my adventures to the Blarney Stone have been on Sundays... \n\nWhy?? (No, I'm not an alcoholic)\n\n1. Irish Breakfast: They get the breads from their Irish Bakery (conveniently located next door) beans and home fries among other things.. mmm\n2. FOOTBALL: I am from Wisco and therefore an avid Packer fan, and a huge football fan in general. They have lots of TVs all the games, and you even get volume (I know some bars have the game, but play music.. just not the same) \n3. I get a nice hot tea.. and once feeling in the mood.. grab a guiness \n\nWhy else do I enjoy the Blarney stone?\n\nThe employees are amazing, the owner/manager Ger is a great guy, and the ladies are all super friendly (And Im a sucker for accents, so that helps too) It has a really great home atmosphere.. I can show up in sweats or whatever I want, and just hang out like I'm sittin in my living room :)", "author": "Hailey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "The Blarney Stone is the perfect place in Outer Richmond where you just want to hang out and drink. This place can get pretty crowded, but the Blarney is pretty roomy, with higher ceilings so you don't feel too crowded. A classic dive bar!", "author": "Bridget B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "I was sad when I moved from Downtown to the Richmond because I was leaving my favorite Irish Pub behind. And then I came across Blarney Stone and what I consider the Best Happy Hour in SF, the bartenders are really nice pour strong drinks and play great musi, plus they have plenty of TV's and a big projector for the games. Make sure to grab some Shepard's pie from the bakery next door and bring it over.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-20", "description": "LOVED our time at The Blarney Stone. Bartendar Shannon is nothing short of amazing! A warm welcome, super enthusiastic and fun, and makes one of the best margaritas I've ever had! What a surprise for an Irish pub! Topped off the evening with an Irish Coffee, custom made with an individual, freshly brewed cup of coffee. Our crew consisted of 40 year olds and it was nice to find a lively place that wasn't too crowded or noisy...granted we were there on a Friday around 7pm. Can't wait to go back again!", "author": "Megan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-07", "description": "Sorry to see that  you can no longer bring dogs into the Blarney Stone!  The owner,  \"Brat\"  has movie cameras all over the place,  (some of us are hoping they are not in the bathroom!)  and apparently when he reviewed the film a few weeks ago he caught \"Murphy\"  a well-loved Irish Setter,  doing his business in the back garden.  So all dogs are now forever banned.\n\nHowever:  certain dogs are still allowed.  One is a dear Rotweiller owned by one of the bartenders.  The other is a lapdoodle named \"Jamison\"  who actually sits at the bar. ( I have noticed that Jamison tips very well.) The other dog who gets under the ban is an english bulldog who is reputed to be a direct descendant of Lady DI.\n\nSo, what some of us were thinking, as we sit there, watching dogowners turn away,  is that the rule should either be DOGS  or NO DOGS.  Can't have it both ways.\n\nI own a beautiful cat, and although I would never consider bringing her to a bar,  it would make me angry if  I was told I could not bring my pussy in  when other pussies were sitting at the bar.", "author": "Alice M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "A new addition to the Brainstormer pub quiz scene, and still nicely uncrowded.  Plus it's a cozy place with good lighting, and has authentic Irishness without being all insular like Costello's or Shannon Arms.  All in all, it's easily my second favorite pub quiz venue after the Chieftain.  Sadly, we still weren't able to grab first place--we lost on the tiebreaker: How much was the fine imposed by Emperor Norton for calling SF \"Frisco\"?  A lot more than we thought, it turns out.\n\nBut at least we scored a free pitcher of Pilsner Urquell, which, when added to the 2 other $10 pitchers we had, made it a pretty fun night overall.  Throw in the impressive list of friday night happy hour specials, and the back patio, and I wouldn't hesitate to come back here even without the pub quiz.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-26", "description": "I can walk here from my new apartment so that's one reason why I would come here. Other than that there is nothing extremely exciting pulling me back. It's a decent bar, decent prices, decent drinks, good people who work there, yes. The brunch was nothing too great. My Denver omelet had a very generous portion of all of the toppings, but it just did WOW me. \nYa know?  They have a small patio out back which would be nice when the weather is warm. \n\nSo, it is a good place to stop by if you're in the neighborhood, but I wouldn't go out of my way to get here.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-22", "description": "When the sun comes up the streets are full of Chinese and Russians sharing the neighborhood.  But when the sun goes away, the Irish leave the construction site and come to the Blarney Stone.  I don't think I've met and Irish person at this bar that has been out of Ireland for more than a couple months.  \nIf you go alone, you'll spend your night listening to some poor Irish bastard's sob story all night.  \n\nIf you see Clive, tell him to hang in there.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-10", "description": "This is a true Irish bar and pub, and yet very hospitable to \"yanks\".\n\nMy Irish housemates and I make this our regular bar for Sunday morning breakfast which they start serving at 11AM.  The food is excellent, even for a vegetarian (try their house fries!).  The bar itself is very clean and spacious, with a long bar, a few high tables, and a family sized sit down table.  There's two large and clean bathrooms, a loud jukebox with great musical selections, numerous tvs, plus a smoking patio outside with picnic tables and a little smoking atrium in front of the bar.  The service is fast, and attentive, though make sure to smile at the Irish baristas just to be sure not to get on their bad side.  There's a lively spirit in the air, and generally the place isn't packed so it's great for communication and a good round of Magners.\n\nHonestly, a perfect place to drink and eat + with the added plus of being Irish!", "author": "Vicky B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-07", "description": "Favorite Irish pub so far in the city, sorry Napper!\n\nI came here for NYE and that particular event stands out, probably because it's the clearest memory (yeah, booze). I was actually going to not go out, but Dave and Jill dragged me out (thank you!). I danced the night away and at the end of the night totally made out with a girl while her brother watched in horror, she was moving to Spain the next day (yea right, thinks me) so we didn't ever see each other again, but I'll be damned if she didn't call me from her Spanish cell phone in the awesome bar I worked at briefly in Nerja, Spain to thank me for recommending it to her and for making her New Years Eve extra special. Talk about an awesome call!\n\nthe bar is great, they have an outdoor seating area which is sweet. It gets packed pretty easy, but always a crucial stop on the Geary crawl. I really should make a list of the Geary crawl hot spots -- it's a fun freaking night. Maybe Someday.", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "One of my favorite bars in the city, and not just because it's within stumbling distance of my house!  It's a proper local Irish pub with many local regulars and a fun trivia night every tuesday.  Friendly bartenders and a great music selection in the jukebox and a smoking patio/beer garden out back make it an excellent spot.  They show Setana Pub channel for all you soccer and rugby fans.  They also serve breakfast on weekends made fresh from the Irish bakery next door (also fantastic!) - it's the best breakfast in the entire neighborhood!  Try the Belfast Bap!\n\nCASH ONLY, and NO ATM!  Make sure you stop at the bank on your way to the bar!", "author": "Patrick P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-04", "description": "It's okay; almost got into a fight here because of some drunk morons.  I usually prefer getting my drinks without getting into a fight.  \n\nAtmosphere\nThe place is pretty big which is an awful reminder of how empty it can be on a slow night.\n\nDrinks\nThey do not have my Remy XO but that's to be expected in an Irish dive bar.  Generous pours of J. Walkers.\n\nService\nAverage, except for the J Walker pours of course.\n\nI'm still half and half on whether to come back here again--who knows?", "author": "Billy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "We love the Blarney Stone!  Prices are reasonable and the bar tenders are friendly (and remember you!).  I think it's a good place to go for a low key drink, watch a baseball game, or bring a group on Saturday night.  It's not pretentious whatsoever, but has a nice atmosphere.  Hihgly recommended!", "author": "Annika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-05", "description": "Good for a pint and hanging out on the patio.  Pretty much the only bar that I go to in my hood.  Friendly folks and they pour a good Guinness. They loose a star for usually smelling kinda funky (the bar not the people).", "author": "Julienne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-10", "description": "The Blarney is an Irish Pub that tends to feature live bands and or DJ's. Yes, that is kind of a strange, combo. Come in here on a Saturday night and you're never quite sure what you're going to run into in terms of the venue. I think in the nights I've happened in I've seen, in no particular order. House music DJ, Lounge singer, Karaoke contest, Irish Fiddle band, Hip Hop Dance DJ, Rock band. Oh and other times it's been dead. Random! Aside from all that, during the week it's a pretty laid back place. \n\nOn a side note, I don't know what the deal is here but they always have the music cranked up to 11, so don't expect to be able to hold much of a conversation on the busy nights. \n\nThe bar itself is very solid, dark and 'pub-like' with a big back patio that you'd never know was where unless you frequent the place.  If you're in the neighborhood, check it out and be prepared for anything in terms of entertainment.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-26", "description": "The coefficient-of-Irishness at the Blarney Stone is one of the highest I've seen in any San Francisco drinking establishment.  It's not a classic facade whose extent of Gaelic culture is a shamrock over the door and a barmaid with an accent.  No indeed...I've come by the Blarney Stone half-a-dozen times, and each time my ability to join a conversation has been utterly neutered by my inability to understand some of the most incomprehensibly thick brogues I've ever heard.  The crowd is very Irish...and very local too.\r\n\r\nThe authenticity doesn't stop there either....a SETANA-like sports channel seems to grace the best-positioned television, while numerous types of athletic jerseys (I'm guessing soccer) hang behind the bar.  A largely wood interior with tasteful decoration contributes to a musty but pleasant vibe, and a lovely outdoor patio sits beyond double glass doors in the back.   The patrons tend to be friendly amongst those of their own ilk, but they seem wary of strangers; During my drop-ins at the Blarney Stone, I've gone 1-for-6 in striking up conversation.  It's overall feel is somewhat like Durty Nelly's on Irving, but the crowd reminds me of the somewhat quieter lot at the Sam McGuire on Noriega.\r\n\r\nWell-moderated music and civilized patrons make this place a great retreat from the noisier spots along Geary and Clement.  If you're Irish, you'll no doubt find kindred souls, and if you live near 20th and Geary, It's worth it to break in as a regular.  But if you stop by as an outsider without a brogue, bring a date or come with a group.  It's a tough crowd to crack....and one that's left me sitting with little more than my own thoughts on more than one occasion.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "Who goes to an Irish bar for Cinco de Mayo?!?! I do!! Our group enjoyed SEVERAL coronas in honor of the holiday. Blarney even had a special mexican bbq with tacos and chips and salsa! It was the best spot to be! I'll definitely be back next year, and probably a few times in between!", "author": "Casi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-20", "description": "This review is for breakfast only.\nDid you know that they serve breakfast at the Blarney Stone? My roommate comes here all the time for their irish breakfast and I finally came long to try it. It's pretty darn good, it's like regular American breakfast but with more meat. What's not to like about that? You get eggs, home fries, beans AND four different kinds of meat. Yum! They also have the most delicious shortbread cookies ever here.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-18", "description": "We came here last night for St. Patty's day.... I don't usually go out to celebrate it cuz' I'm not Irish or a lush so I try to avoid the hyped up drinking days, but my brother wanted to hang out so we ended up here.  It was crowded, but not so bad that you couldn't find some standing room.  \n\nThere's actually a nice patio out back lit by white lights and good conversation, but there were too many smokers there for me to hang out.  Funny enough, my brother just wanted to go out for green beer (since he's not a big drinker either), but they didn't have any here (which probably means its more authentic than some other places in the city).  \n\nI got a 16oz. Strongbow for 4.75, which isn't too steep... but nothing really special about this place.  The dj just played 80s music and there wasn't anyone dancing, except for the one drunk old Irish guy that came up to us and starting talking nonsense.....", "author": "Jeannette P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "Anyplace that has $5 mimosas made with orange juice fresh-squeezed by a  bartender I'd happily give up men for gets at least 4 stars. $5 bloodies and irish coffees on weekend days don't suck either. And darts can be fun if you know what you're supposed to be throwing them at.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Blarney Stone is the best pub in the immediate area. The drinks are well-priced, the staff is kool, and the environment is decent.\n\nIt seems that they aren't doing the Irish breakfast on the weekends any more - that's a shame, hopefully they start doing that again.", "author": "C G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "Around the corner from my house, has a pool table, has $5 drinks, and is never crowded.\n\nOH they don't take cards.", "author": "Josie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-14", "description": "Joey the bartender is an awesome guy. He also works at Trader Sams so when I saw him here I was happy. They have a good tap selection as well as a good bottle selection of beers. I have been here twice and both times I had a good time.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "DIVE BAR. Loved it. Great jukebox. Great GREAT GREAT bartenders. Had a blast shooting the breeze with them.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-11", "description": "I was treated so bad! I was there for a couple drinks my phoned died I saw An Iphone charger plug in the wall with no phone on it  so I asked the bartender if he could charge my phone because my husband was home with my son incase something happen I always like to have my phone with me with battery.  He looked at me an said I dont have aniphone charger, I told him  my  story  and pointed to the wall and said its over there would u be able to do that for me please He look at me and said I dont charge phones and walked away. I stayed there staring at him I also work in the industry and I was in shock with the way he treated me, specially because all I wanted was to charge my phone for 2 min to see if my son was ok. He came back and my sister asked again because she couldnt believe the attitude he gave us, and she said she always goes there  and knows all the bartenders and he look at her and said I DONT CHARGE PHONES.\ni ASKED ARE YOU THE OWNER, HE WAS AROUND 25-35 SHAVED BLOND HAIR, and he said walking away yes, I didn't believe him and I hope he is not the owner because to be RUDE like that he should never own a bar. \nI asked for my check and left didn't even finish my beer. Never gonna go back again!", "author": "Pamella P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "This is definitely a very Irish bar. The employees are Irish, the beer is Irish, the whiskey is Irish, and the decor is Irish, but it is also a great neighborhood bar with a surprising amount of variety.\n\nOn your average weeknight, you may walk into this place and see no more than three or four people enjoying a beer and shooting the shit with the bar tender. On another night, you may walk in to find a large group getting rowdy watching a football game (soccer for us Yanks). Sometimes, you'll come in and find me playing dominoes, And, if you come in late on a weekend you'll likely find a full blown dance party complete with DJ and smoke machines.\n\nBasically, this place has something for everyone and great atmosphere to go with it.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-30", "description": "I, typically, am not one to compose short reviews, but in the case of Blarney Stone, the characterization is so simple.  If you're in The Richmond on a weekday, between 2pm and 7pm, and you're seeking a beverage, whether it be something on tap, or a cocktail, then stop in this place.  It's a no-frills bar, but the bartenders are friendly, and the 2-7 prices are cheap.  I did notice a patio on the back of the bar, which I'm sure is good when weather is warm, or if it gets too crowded inside.  I'll likely establish Blarney Stone as my pre-dinner drink meet up spot on nights that I'm dining in The Richmond.", "author": "Damon Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-01", "description": "I have to admit I used to like this place more with the old ownership, but its still a fun spot to go hang out. One of the very few out in the richmond with a patio thats open after dark.\nI watched a couple world cup games here too.\nThe selection is not large, but definately enjoyable.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-23", "description": "Ah yes, the Blarney Stone...  Quite a few good college memories of this place...my friends on the other hand, not so great memories.  One, in his drunken stupor promised me a million dollars... Still waiting to collect on that one.  Another just had a VERY rough night...  Good times though..\n\nIf I'm in the Richmond, I'll pass by this place always contemplating going back in, yet never actually doing so.  Would I go back?  Maybe, as one of my last resort bars...", "author": "Allan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "Just a good ol' neighborhood bar that is obscured in the quiet part of the city. I am sure when people think of partying in SF, they don't think, \"let's go get faded in Richmond!\" So with that said, this place is pretty quiet and not that busy. If you're out to meet or hit on people, you'll be hanging out with yourself and the bartender here. But if you're with some friends in the hood and want to go somewhere to chill, this is a great place. They got a good amount of sports paraphernalia all over so it should be pretty good for sporting events as well.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "Great for watching games! Multiple Tv's, HUGE big screen. A bit small but wasn't crowded at all on a Friday night during the playoffs! Good Whiskey sours...", "author": "Nick C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-15", "description": "Irish pubs are not up my alley, altho this one wasnt particularly irish. we came here on an off night I guess, cause it was almost empty except for a few 30 something drunks, tho not the slump on a stool type, the \"im so much fun, Ive been drinking for 12 hours, whooo\" type. so maybe if Id been here another time I wouldnt be so unimpressed. there are a few  tall tables with barstools to perch on, a decent sized bar, with TVs above it, and a back patio area, which is a plus. \n\nWe had a big group, so we sat at the one large table in the back, which is next to the bathrooms and the jukebox. A creepy guy in his late 30s tried hitting on us and asking us about music, we pretty much ignored him, he played his U2 and we kept talking. later two severely drunk blondes, also about the same age, kept stumbling back to the bathroom. Its pretty sad when you are old enough to be a college student's mom, but you are still acting like one. \n\nThe drunker of the two females stumbled back and tried the bathroom door the third time and found that it was closed, so she went outside and puked over the balcony into some plants. When she came back in, she used this baby voice, and told me that she had thrown up. I was a little taken aback, and complimented her. What do you say to someone like that? You're pathetic and maybe you should pick up a hobby?", "author": "Anna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "Was pleasantly surprised by this place. We randomly stopped by after eating in the Richmond - nice, chill bar, cheap drinks ($5 patron margarita special when we went...yes, I had plenty) and great outdoor patio. We don't go to the Richmond often unless we're craving good Asian food, but will definitely add this place as a post-eating spot for drinks in the future.", "author": "Adrienne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-13", "description": "This is most  likely the friendliest bar in my neighood.  you really never know what kind of night its going to be. Its an Irish Bar with live music on occasion. The Bartender on Monday night rocks! ( we love you ) \n\nso... there are a hand full of dive bars out here. and this one is pretty nice. Its Dim and comfortable and Clean. its Clean. ( not so divey after all.)\nNo fighting and yelling. I like this bar its Chill and well, its nice.", "author": "Joy I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-08", "description": "This is one of the best hidden gems in the city. Its a big Irish pub with a full bar and fairly priced drinks. (try a bloody mary, they're delicious) Its a great place to bring your friends and hang out for a whole night as its normally not too crowded and they have free: air hockey, darts, shuffleboard, and even shake weights! The bartenders are always in a good mood and willing to play. i beat one at darts and he bought me a drink. plus there's a large outdoor patio in which to enjoy the rare warm nights out in the Richmond. totally worth the trip!", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "I don't know where the Irish in this neighborhood live, but they hang out at this bar.  I spent far too many days watching the World Cup games here, and eating the massive \"full Irish breakfast\".  \n\nTheir food is good, and they have the standard beer choices, but half the appeal of the place is the outside seating.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-03", "description": "Stay away from my bar. Honestly go to the inner richmond bars, this one is off limits, if you must come stay away from the dart board or I might just take an eye out...\nSorry for the rant, on to the review:\nGood pub, standard beer selection, stage (never seen anyone actually perform), and patio.  No hipsters or clubers here, just people who love to drink. Aye thats a 5 in my book.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-23", "description": "I went to this place for the first time last night and I really enjoyed it!\n\nIt was the last night of Blarney Idol and a friend's friend was performing. Sadly he didn't win but his competition was really good as well. \n\nIt was a nice little place, seemed to have a really good atmosphere, and loved the  motorcycle sitting up in the door (well not the door but i can't think of what it would be called at the moment).\n\nBut yeah. Good atmosphere, seemed to have really nice people.", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-02", "description": "I love this place!\n\nCitrus drinks are all from fresh-squeezed fruit and if the Giants win happy hour goes until midnight!\n\nCan't beat a deal like that. Cheers!", "author": "Angela G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-31", "description": "Found the bar 2 years ago, been going here for Happy Hour on the weekends.  It was an Irish pub with a friendly group, everyone knows everyone.  Now this place has gone under new management and the atmosphere has changed.  The old bartenders like Julie, Jerry are all gone.  After that experience I was not coming back.   Luckily there were 2 cool bartenders Dre and Chrissy who makes the bar a fun place to goto again.", "author": "Ronald L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "I love the Blarney!  If you are a local in the Richmond - Irish or not - this is the place to be!  Great local pub, good drinks, wonderful music (well - as long as the DJ isn't there).\n\nThe only complaint I have is they have a GREAT beer garden out back with heaters, and everyone used to do out there there smoke, but due to the noise of the DJ - they have closed the beer garden.  No one is allowed out there on Friday or Saturday nights for any reason. This sucks!  I say get rid of the DJ and bring back the beer garden!", "author": "Valerie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-24", "description": "This place is the opposite of Nag's Head - lame on a Tuesday and bumpin' on a Saturday.\n\nThey have a decent selection of beers and they pour a Guinness the RIGHT way. Their whiskey sours are lame, and their Jack and Gingers aren't very good either.\n\nThere was some good live Irish music on Saturday, and overall my buddy and I had a good time. But the crowd that was there on Saturday was kind of douche-baggy. One particular group of people was WAY too drunk -- they were doing handstands, knocking over speakers, and grabbing microphones. I am pretty surprised no one got kicked out. They certainly should have.\n\nI'm sure we'll be back, but I don't think we've yet found that perfect bar around 24th and Clement. The search continues!", "author": "Stu M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "100% Amazing bloody mary. A weird look for ordering it on a saturday night, but what do you expect? Everything you could ever want in a neighborhood bar; good bartenders, alcohol, happy hour that lasts forever.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-20", "description": "One of the few authentic irish pubs ive been to here in the city.  Authentic meaning that not only are the bartenders irish, but all the patrons were as well, accent and all.  I wonder if its like that all the time.  And when i say all, basically, my friend and i were the only non-irish in there.  And damn if everyone didnt seem like they were 7 feet tall.  My friend and i both felt incredibly tiny.  For the most part everyone was very friendly, minus the 2-3 jerk guys.  No joke, as im standing at the bar waiting to get a drink, this really tall guy starts talking to me.  I ignore him...i also couldnt understand a word he was saying his accent was so thick.  But i did understand, very clearly, when he leaned over to his friend and said something along the lines of \"aye, i could get a bj standing up no problem\".  I really could have gone without hearing that tidbit.  My friend looked at me, rolled her eyes, as did i, and we both walked away.  I have many friends that are irish, and I like the irish, but sometimes they really have no filter for their mouths.  \n\nOverall, its your typical bar.  Despite the asshole i came across, everyone else was friendly, including the guy at the door.  They also had live music playing and an outdoor patio.  If i was in the neighborhood, i may stop in for a couple drinks again.  \n\nOriginally, i had this at 3 stars, but i feel i need to bump Blarney up an extra star because i appreciate owners who take pride in their business and really care about their customers enjoying their time at the establishment.  Gerard, is a very kind man who likes to make sure everyone has a good time at his pub.  I have no doubt that he has many loyal regulars as well as new patrons, who im sure upon meeting him, will want to come back again.\n\nNote:  its a cash only bar so make sure to have some handy.", "author": "Juv C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-10", "description": "It's sorta like an Irish Pub...but when I was there, there was a Hip Hop show.  It's out of my neighborhood, but I went cause I know the bartender, she's super hot and Latin (yow), so I guess I really liked it.  There is a patio outside and a big gas grill that gets some use.  It's a typical bar, there is sports on TV, pool, darts, etc.  Come by if you're in the neighborhood, you will have fun!\n\n3.5 stars (extra 1/2 star is for my hot bartender)", "author": "Garrett C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-06", "description": "This bar is about 5 blocks from my house and therefor convenient. My friends and I frequented here before it was bought out. Since the new ownership it feels a bit empty and just doesn't have the same vibe. Two stars until further notice.", "author": "Paige B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "It was quite on Sunday afternoon when we stopped by but I liked it non the less. I heard it was recently redone, they are serving breakfast during the World Cup games and soon will be serving lunch.  It's a definite stop if your thirsty, driving down Geary and see a parking place. Best of all if you only have $2 bucks plus a tip in your pocket you can still quench your thirst with a Miller High Life.", "author": "Dianne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "I can't give it a five because I have only been there on Tuesday nights. But, I have thoroughly enjoyed those Tuesday Nights. In case you aren't aware, that is their Pub Trivia night (if they are still happening. The last time I was there it was a pretty small crowd). \n\nThe bartenders are nice, the atmosphere is pleasant, the soccer on the television is plentiful and they have deals on pitchers.", "author": "Mickey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-21", "description": "I called in for a late drink on the way home after work last Friday - 12am or so. I know, I was late, but well before last call. I couldn't get served a drink. I waited 10 minutes and the two bartenders did not come over. Nor were they busy. They were hanging by the credit card machine; reviewing receipts/tabs and chatting with the regulars seated nearby. The bar back noticed me (nice guy) and others trying to get a drink. He brought it to their attention, but .... no go. They didn't budge. After 10 minutes, I left. I can't comment any further.", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-01", "description": "awesome place! including vince. good vibes, great drinks, extremely fun bar.", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-07", "description": "Nice bar in Outer Richmond.  Staff was very nice.  Not a lot of people there but we went for a birthday and had a huge crowd with us so it was perfect.  There was lots of seating and lots of space and we didn't have to fight thru people to get a drink at the bar.", "author": "Sireenah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-22", "description": "OMG, so I decided to give this place another try even though I said I wouldn't and just when you think things can't get any worse they do!! \nI'm shocked at the other reviews on here, maybe I'm just picking bad nights.", "author": "Cassidy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-16", "description": "As Irish Pubs go, this one isn't on my \"to do\" list anymore.  It might be if I were under 25 and single, but it is loud and full of obnoxious people, so if you fit that, by all means, go there.  The last time my husband and I felt like slumming we went there and the music was so loud and so awful we quickly found the exit.  There were those who seemed to be \"grooving\" to the loud and totally unmusical music, so obviously they have a type of customer.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "After dinner, the wife and I jumped on the Muni limo from the FiDi to the Outer Richmond for The Blarney Stone's NYE Party. I have to say, it was probably the 2nd best New Year's Eve party we've been to in SF, the best being the dearly departed Pat O' Shea's open bar extravaganza in 2003. The biggest reason we chose The Blarney Stone was, unlike most places in the City, they resisted the urge to make easy money by charging a cover, or even worse to make everyone buy overpriced pre-sale tickets for a \"party\" that included nothing more than a glass of $5-a-bottle champagne and a noise maker. It was just crowded enough to have a fun vibe, but not overly packed to the point where it takes an hour to get a pint of Guinness from the bar. We got there about 10:30 and were able to score seats, a special treat on New Year's Eve in the City. The bartenders did a fantastic job of serving patrons in the order they stepped up to the bar, no matter what tricks the drunken masses tried to get even more inebriated faster. The crowd was great, with none of the amatuer, Jersey Shore-ish shenanigans that we experienced on Polk St last NYE. We watched the Ball drop, had a few pints, and checked out before the wait for a taxi got too ridiculous (or the urge to head over to Video Cafe hit us).\n\nWe don't make it in to the Blarney as often as we like, since it's kinda out of the way, but it's a great little Irish pub. The bartenders are super friendly and always treat you like a regular, no matter how infrequently you drop in. The beer prices are pretty standard, $6 for a Guinness and $4 for a Bud Light. They also have a cool outdoor patio that's great for killing those lazy football-less Sundays in the Spring. One bonus is you can order food from John Campbell's Irish Bakery next door and the bartenders will bring it right to your barstool.\n\nOverall, The Blarney Stone is one of the better Irish pubs in San Francisco. A word to the debit card addicted like myself, The Blarney is cash only, but there is a Chase next door and a Wells right down the street.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-25", "description": "Wow.  I just went in there.  There wasn't anyone at the bar - I felt like I was walking into a locals only establishment and definitely didn't feel welcome.  To top in all off as I was leaving I caught some mouth from some Irish guy.  The management did contact me in an attempt to sort things out and I appreciated that.  Perhaps I stopped by on an off night.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-12", "description": "I would go back if the bartender would wash her hands after playing fetch with her dog - dirty tennis ball and drinks do not mix.", "author": "B W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-30", "description": "i've lived in this neighborhood all my life, and well... Patrick S's review is right on the money!! (esp the sob story. i spent a good chunk of Thursday night trying to decipher a sob story from this guy that had the heaviest Irish accent. think brad pitt in snatch.)\n\nThis is definitely a great neighborhood pub - luckily it's right down the road from me. all of my visitors make it here at least once during their stay and all have loved it. make sure you go there on one of the nights that the jaegger spout is broken. FREE SHOTS!", "author": "Karva S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-26", "description": "the space is nice. well positioned tellys and 2$ high life bottles. spot on smoking area outside.", "author": "aidan m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-10", "description": "Just a block from my house this place is a cool little find. We have wondered in here a few times either before heading out for the night or making it our last stop for the evening. After reading the reviews I should I really want to go here on a monday and I didn't know they had breakfast!?! Everyone there is always friendly and it's always something different everytime we go. Not usually crowded which I think can be a good thing depending on what you're lookin for.  I would recommend to anyone stopping in the richmond", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-25", "description": "The only reason I have been here is because of close proximity to a friends apartment, but it is one of the friendliest and cracking bars in the area. St. Patrick's day was absolutely crazy. I have never been on the back deck, but I hear its cool. Unlike alot of other people rating this place I have never ran into obnoxious people besides for a homeless man outside who proposed \"smoking a bowl, OF CRACK!\"", "author": "Craw H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "Blarney stone is great!  I lived right next to this place for 4 months and it became my default spot if my roommates and I were feeling too lazy to venture very far.  The high ceilings and decor give you a european feeling and make for a cool ambiance.  The staff here are always really friendly and welcoming and make you want to keep coming back.  One of the best parts of Blarney is the back patio where you can enjoy a smoke with your drink.  This place def. trumps the pub style places I'm now walking distance from and is one of the main things I miss about the outer richmond.", "author": "Nate W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-20", "description": "Cute place, dark, jukebox gets a 2.5 to 3 stars. Room to dance if you're into that sort of thing.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-21", "description": "The quintessential neighborhood pub- and oh so Irish.  LOUD music all the time except in the AM for world cup and other odd sport games.   No, I don't make a habit of frequenting bars in the morning but when you don't have a tv and have to see a game, this place is a great option.  Also, it makes a great Sunday afternoon post- Ton Kiang hang.   So... I guess this place isn't my choice hang out on a Saturday night, but it still deserves  5 stars because you gotta love it.", "author": "laura a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "The bartender is hot. Stiff cocktails and great selection of cold beer. I repeat, the bartender is hot.", "author": "Kate S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-19", "description": "This place is awesome because it is right around the corner from my house. The first time we went was after a long night of drinking already, and we walzed in, had a jaeger bomb, and left, only noticing the fact that there were only 4 other people there, and the ladies room was more disgusting than i've found at any gas station. We decided to give it another try on a Thursday night a few weeks later, only to find that it was closing, at midnight. Disgruntled, we hit a few other dive bars on Geary and headed home. 2 weeks ago, we had a few sake bombs at Little Tokyo, and went a couple doors down to the blarney stone, where we found about 30 people, many of them foreign, a karaoke singer, and good beer. This once abandoned dive finally wormed its way into my heart, and i'll be sure to go back.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "This is a great bar to hang out and have a Guinness.  I went on an off-night so it wasn't too crowded, but it's a great place to just chill and have a beer or two.", "author": "Mei C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-19", "description": "The bartenders are always friendly here.  I come here sporadically, and never have the same style of experience.  They have darts and a patio as well.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "The Blarney Stone is a welcoming place. Always a greeting and a smile. The service is great and the bar tenders are very friendly. Ger in particular is one of the finest bar tenders in the city and pours an excellent Guinness! It is also a good place to catch up on news of Ireland, sports and gossip.\n\nI like that it rubs up beside the Irish bakery so if you are a little peckish you can hop in next door and order a pasty - they will warm it up and bring it in to you.\n\nDefinitely worth checking out for a pint and a chat.", "author": "C M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-02", "description": "I live right near the blarney stone, and go there frequently. It's always a good time, if a little empty. The bartenders are friendly, they have an outdoor patio, and the drinks are reasonable. All around a great bar.", "author": "osmahn k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "The Blarney is the greatest Irish bar for those stuck in middle Richmond.  The three main attractions:\n\n1) Irish Breakfast\n2) Spacious outdoor patio where smoking is still actually allowed (think Lucky 13 in the Castro).  CAVEAT: If you try to get them to turn on the heating lamps for you, they are likely out of propane.\n3) Bartenders who know how to pour a Guinness!!\n\nSaturdays can actually pretty cool too if you want a live DJ and as an alternative to Abbey Tavern's small dancefloor.\n\nPS: Pay attention to the expert dart players in the back.  I'ts an impressive skill for those too drunk to stand up.", "author": "Heather G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "love the Blarney Stone, bartenders are cool, music is good, and it's a chill place to go to. yaahhh!", "author": "Briana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "Great local Irish pub. Laid back and unpretentious, pub has free food on Monday during football season, darts, and a nice back patio. A bit more class than other Richmond establishments.", "author": "Joel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "amazing service and fresh squeezed fruit...Nothing touches their bloody mary though", "author": "Nick I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "chill spot for an early st. patty's celebration. had a yummy half baileys/half jameson shot while the boys chugged irish car bombs. great little outdoor patio to hang out and smoke. karaoke was questionable, though.", "author": "N. M."}
