{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Second time here in two days. That should tell you how good this breakfast spot is. \n\nHundreds of breakfast spots in San Francisco, and I chose the same one on this short vacation. The sandwich bagels are soft and filled with amazingly tasteful ingredients.\n\nI ordered the good ol bacon egg and cheese on a cheese bagel with cream cheese added(a must for cheese lovers like myself) ... Nothing like any other breakfast sandwich I've ever had. My finance had the San Francisco sandwich on cheese bagel and the look on her face was enough for me to see she was in breakfast heaven(if such a thing exists).\n\nTo accompany our sandwiches we ordered the blended ice Green Tea and Vanilla lattes. These drinks put all other Cafe's to shame. The perfect blend of flavor and ingredients to create the ideal consistency for a blended drink. \n\nThe place is very clean, the staff is very nice and accommodating of any requests for omissions and substitutions.\n\nYou would be crazy to stop in San Francisco and not eat at The Morning Fix!!", "author": "Jose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "I go here pretty much every morning. My bagel is made fast and I always have a place to sit while I wait. The women are all friendly/ quiet. It's not wheelchair accessible but that didn't stop one of the ladies from going to the door, and taking someone in a wheelchair's order. I will try the other breakfasts and the donuts eventually. \n\nI give this place 5 stars, for convenience, service and cleanliness of the establishment! Love Morning Fix!", "author": "Kristal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Morning Fix is the definition of hole in the wall greatness. Ran by Chinese mamas, this is the place to go for the greatest bacon, egg, and cheese bagel of your life for $5. They toast their Einstein bagels to perfection, cook the eggs to order, and use just the right amount of cheese as to not ruin your entire day. \n\nThis place is open early, full of all the locals buying fresh coffee to fill in their mugs, and has plenty of spirit.", "author": "Patty B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Had a crossaint with ham, egg and cheese. It was good. It did cost a lot but again, it's a local business so I'm fine spending it.", "author": "Rose F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "I found the Morning Fix on Yelp.  It was 4 short blocks from out hotel. Every thing was just perfect. No fuss, no waiting and no overpaying. I will come back for every trip to SF. Ps the food was awesome too!", "author": "Glenn M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-20", "description": "If bagels is the main type of food you are selling, then you should make your own in-house or at least hide the Kirkland's wrapper that is in full display when you first walk into this cafe. \n\nI was hoping for a good breakfast this morning, but the lox bagel that I spent a fortune on ended up being only a thin slice of salmon and light fixings. (Photo attached.)\n\nI'm giving them two stars because the bagel wasn't inedible, the caramel macchiato was drinkable, and I got all my steps in for the day to get to this place.", "author": "Avery B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "New to the neighborhood & love this little spot! I had bagel breakfast sandwiches, a cappuccino, and iced chai latte (for 2 of us obviously). The staff is very friendly & helpful and the prices are very reasonable especially for the city. Will be a regular here!", "author": "Christine O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Nice little place, what I ordered and when I got were slightly different, but the food was still good anyway. Staff was kind, I wouldn't mind visiting again the next time I'm in San Francisco", "author": "Kristofer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Delicious, inexpensive and awesome.\n\nGreat breakfast sandwiches.  Good coffee.  Nice pastries.\n\nFriendly people.  Inexpensive prices for the neighborhood.", "author": "Fred B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Waking up today, I wanted to get out of the house early for a quick bite before the gym. Yelling around my place, I found this joint and boy did the pictures help! Best thing of all, it's a block away!\n\nWalking up to this joint, I noticed a bunch of folks sitting outside conversing. What a cool neighborhood joint. Walking inside, it was a bit busy. Electronics that didn't seem to work: an hour of order ATM, a couple of computers a big fan. Aside from that, there are tables and window bar seating, a coffee station, drink station and refrigerated counters filled with pastries. I think the owner just tried packing as much into this small hole in the wall as possible. \n\nFor my breakfast, I got a hot Tea for $2.00. They have 10 different flavors to choose from. I also got the Breakfast croissant for $4.75. You can choose from bacon, sausage or ham. I chose the ham, also came with cheese and egg. Overall it was a good sandwich. Buttery, flavorful. Nothing to jump out of your seat about but I love how quick it was. \n\nThis place offers so much! All your morning staples including bagels, pastries, eggs and more. They do offer lunch items but breakfast seems to be their sweet spot. One thing I liked about this place were the friendly people. It's like everyone knew everyone. Made it feel homey and comfortable. With the location convenience, I'll be coming here often!", "author": "Rockne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "Great bagel and burrito! The cheese of the bagel is so creamy for the source and crispy for the skin, really lovely food!!! Kicks off a wonderful day in SF!!!", "author": "Song L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Discrete little coffee shop with a few tables, friendly atmosphere and simple San Francisco fare - bagels, sandwiches, coffee. Bagels were toasted beautifully - crisp and warm, fresh ingredients: red onion in the bagel and lox added just the right amount of heat, good firm fresh tomato slices. Had a straight coffee - offers five types of filter incl Columbian.\n\nSeveral locals popped in - good sign.\n\nGood spot to drop in, have a break and grab a bite.", "author": "Neil L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-07", "description": "I found it really frustrating that no matter which meal of the day, every single eatery is an order at the counter grab and go kind of place. Pretty good reviews, but I'm instantly put off by grab and go, especially at breakfast. I also have dietary restrictions that were impossible to please during my stay in San Francisco. This is not the fault of The Morning Fix, rather the epiphany I had while \"dining\" here. I ordered a sausage egg and cheese on an English muffin. It was fairly bland so I piled on the hot sauce to make it palatable. Not bad, but I found this basic place more expensive than it needed to be. Also, the menu is a complete disaster. It's mostly pictures, which is fine, but much of it is blocked off by other pictures of what they offer. On top of that, there were printed out pages randomly taped to the menu. Disorganized and strange.", "author": "Brandi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This place is a gem. Cheap breakfast sandwiches (around $5 each) made with quality ingredients. We went here three out of five days for breakfast. No wait. Take it and go or eat there. Friendly lady who ran the counter. Would recommend to anyone. Don't waste time hitting breakfast diners and cafes unless you really want the same eggs, hash browns and bacon breakfasts. Here you choose between bagel breakfast sandwich or English muffin. Also has many other toppings and options. Fresh fruit, cereal, coffee, tea, yoghurt and pastries.", "author": "Stacey R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "This is my neighborhood coffee shop and I love it. The bagel sandwiches are always good as is the coffee. They have many flavors and styles of filter coffee as well as breakfast/lunch choices--especially for the price point! \n\nGreat spot for a grab-n-go or for a quick bite and the staff is always welcoming and cheerful :)", "author": "Tanika T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "I would say this place is four stars only because the lady was really nice. It's the perfect place to go if you live nearby and just want something quick cheap and simple for your regular routine. Otherwise if you're visiting the city you might want to try something a little more fancy. But for me, I thought it was cute, and the food was pretty good. It's four stars only because the cheese was meh. Also the place is pretty tiny and can get a little warm inside if that kind of thing matters to you :)", "author": "Gina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "This palace has great coffee very fresh and hot. They also have bagels of different kinds they are very good. This place is just around the corner from where I stay and makes it easy to grab a cup of coffee before starting my \"hike\" around the city. The staff is friendly and helpful to get orders not on the menu. I will visit this place again when I am in the city", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "I walked by this place for 2 years and never came inside. It took a fire alarm and a hungry me to wander in. I regret not coming here sooner.\n\nI had a breakfast sandwich with english muffin and sausage. Omg so amazing! This makes the egg mcmuffin at McDonalds look bad and I personally like those a lot.\n\nDefinitely come here if you want a Morning Fix!", "author": "Zachery M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "good solid breakfast. Honestly just your average joe place. I saw good reviews online and expected more, but nothing special. They don't even make they're own bagels they were Kirkland lol, pretty sure everything is from Costco. But pretty average prices for pretty average food. Nothing much to say, it's just average lol  \nI do really like the Carmel macchiato.", "author": "Angie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-22", "description": "You need to know that this is not a true restaurant. It is not a breakfast place. It is a 'shop' that has food. There are about 8 seats inside and there are 4 chairs on the sidewalk outside.\nI had a good bagel-Everything Bagel with Cream Cheese and Avocado.\nThe ladies that run the place are nice and my bagel was good, but know what to expect. This is not a tourist spot with sit down service and a hot breakfast. \nIf you want an inexpensive bagel and hot coffee, this is a great option.", "author": "Renae T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "This is the worst breakfast I've ever had.  Do NOT come here for anything like eggs or hashbrowns or meat.  There is no grill !! She microwaved my breakfast.", "author": "Robert W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "Very basic spot but not bad for takeout if you're in a rush. I stopped by for coffee and breakfast sandwiches when staying at a hotel nearby. Because of the good reviews, I was surprised to see Kirkland packaged bagels and self-serve coffee when we got there. But the woman who works there was nice, our order came up quickly and everything was pretty solid but again, very basic.", "author": "S M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "The place is a hidden gem. I went there to quench my thirst and energise for the day.\n\nThe interior looks a bit shabby. There are three small tables that fit max two people and the window bar table for three another people so forget bringing your whole party here.\n\nHowever fear not. Staying here wasn't a waste of time at all. I got a really delicious California Bagel. I chose a cheese crust and it was simply amazing. The crust was just perfect not too dry not too hard. Avocado and veggies inside did a trick as well. Super soft and really good quality ingredients. The berry and banana smoothie also didn't disappoint. Well done!\n\nI managed to have a nice conversation with an Indonesian guy that sat next to me. So cool, so un-British :)\n\nOne interesting point to note is that this venue still offers Internet cafe service. It's 2015 but in this respect time seemed to stop here. Each to their own but the place clearly deserves 4 stars!", "author": "Tom D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-13", "description": "The food was ok, but the bagels are not fresh they are purchased from Costco. \n\nWe got the California bagel and the pesto bagel which were tasty even though there was very little spread on them. Coffee was pretty good as well. Overall pretty good but overpriced for what you actually get. \n\nOther reviews mention free wifi and that's one of the reasons we went, but it turns out you actually have to pay for every 15 minutes.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-22", "description": "If you like Costco Kirkland baked goods and powdered eggs cooked in a microwave, this is a place for you.\nIt may be cheap in price, but you get what you pay for.", "author": "Todd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "We were pressed for time in order to get me back to the airport, so standing in line at a place for breakfast was not an option on Sunday morning. My friend had heard of The Morning Fix, so we headed over.\n\nNo wait! The lady who was working was really nice. We ordered two breakfast sandwiches, I had a bagel sandwich and my friend had a croissant sandwich, plus I got a small white mocha. $13! Unheard of for breakfast in San Francisco!\n\nWe took our food back to her apartment and it was delicious. Mine was a cheese bagel with egg, cheese, and bacon. LOVED IT. My white mocha was very good. Wish this place was near my house so I could grab breakfast here!", "author": "Randi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Solid spot for a an early morning breakfast bagel. There are two small tables with four chairs out front. Bring your dog and listen to the regulars debate North Korea's nuclear proliferation.", "author": "Abe A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "This place is a little hidden gem.  Really cheap, delicious bagel sandwiches with millions of kinds... There are actually only 3.bagel options (everything, plain, and cheese-- and they use Einstein) but with the number of different toppings and such, this is no big deal.  \n\nThey do have wifi, but it's pay by the hour, in case you're really in a bind.  The lady at the front was very smiley and super friendly which is always refreshing in a big city.  I got the salmon lox bagel and it was bomb.", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "We were looking for an inexpensive place to grab some coffee and a pastry. This was an easy place within walking distance of our hotel. We got 20oz iced coffees with room for cream and pastries.", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Cute little breakfast spot with the morning staples.  Cheap, fast and nothing really unexpected here.  Just your standard bagels (Kirkland brand and I happen to be a Costco fan) with a varietal of fixins, English muffin breakfast sandwiches and breakfast burritos.  \n\nNothing particularly memorable to write about.  It's bagels and breakfast sandwiches, we all know them and love them.", "author": "Katie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Cute, quaint little cafe. The bagel sandwiches were delicious and they use Einstein bagels, so I knew right from the start they were gonna be delicious. Already craving another one.", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-24", "description": "Small place with a couple of tables. Not super fast service but really friendly staff. \nCoffee is so so and a little too hot to drink at first. However, I came here to try the breakfast bagel sandwich which hit the spot. Overall poor coffee really impacted my desire to come back again.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "I have been to this place twice in the past two days for breakfast and it's AMAZING.\nTheir croissant sandwiches are so fluffy and the eggs in them taste like home! The coffee here is also pretty frickin fantastic!! I could drink my weight's worth very easily haha! \nNot to mention, it's CHEAP. Cup of coffee and breakfast sandwich was around $6, insane!! Come here for breakfast, you won't regret it", "author": "Makana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Good \"go to\" place for a quick breakfast. I ordered the grilled cheese with ham sandwich, very filing. It's a clean but very small place, service is fast, nothing fancy and definitely not for people who want to try something new.", "author": "Karissa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-09", "description": "Visited on a Friday morning outside of the typical morning rush but by the end of placing the order found a line up of three people behind us.\n\nPros:\n- The egg, ham and cheese croissant and the egg, bacon, and cheese on the everything bagel was hot and tasted like one would expect. Hit the spot. Nothing fancy.\n- The person taking our order was very pleasant and patient when explaining the menu items and available options.\n- Reasonable pricing.\n\nCons:\n- The cappuccinos we requested tasted more like lattes (perhaps a mix-up with the order?) and were extremely hot, requiring several minutes of sitting with lid off before being drinkable.\n- Evidence of a previous customers breakfast was on the table as we sat down, indicating the table had not been recently wiped down.\n\nNote(s):\n- Place is cozy and finding seating might be tricky during peak times. \n- Establishment is dimly lit, but maybe that's nice for those who haven't yet had their morning coffee.\n- There is a nook where internet use on a desktop computer may be rented.", "author": "Pears A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "I love this place for many reasons but the main reason - they are right next door to my apartment! A short walk away, helpful on those dreadful weekend mornings after a night out. \n\nNote: it gets very busy around 10-11 on weekends.. When folks start waking up. I came here on New Year's Day morning and waited an hour! \n\nFirst of all, the ladies that work there are sweethearts! Always smiling and friendly. I always order the lox bagel on an everything bagel with no onions - it is addicting. One weekend, I had it every morning. I recently tried their chicken wrap, I will order this again! The iced coffee is good and the self service coffee is awesome, hard to mess up.  \n\nThey have a couple of tables outside and about 4 inside. They also have an ATM and 2 computers that you can use.. Random but nice!", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-27", "description": "The yelp reviews brought me here but I have to admit that although the food wasn't bad and the service was good you can find better places to grab a bite to eat. While visiting a great food city like SF you need to choose wisely and I'm guessing you can find better option although in a pinch this place will do.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-27", "description": "1.  It's on my walk to work down Bush Street, and I have yet to see it busy.\n\n2.  Very nice patrons and staff.  Quiet and cozy at 8am.  The food is prepared with care, and made to order.  Nice view looking out towards Bush while people are walking to work.  \n\n3.  I moved from Denver, and have been looking for a good breakfast burrito - and I really like this one.  Very good mix of fluffy eggs, potatoes, cheese, pico de gallo and meat (I always go bacon).  Substantial, balanced and fresh for $5.  I would HIGHLY recommend getting this with bacon, and then springing for the extra dollar for avocado.  I think this is the true California Breakfast Burrito.  (and, grab a Sparkling Mineral Water - a really good compliment to the food)\n\n4.  Seems to have a lot of regulars - and I'm quickly joining that crowd.  Very low key.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-02", "description": "This seems to be a mom and pop establishment, which is nice. I came here after some research on what's open at 6.30am in the morning (props to them for that) on my way to the Caltrain station. \n\nI can't comment much about the space since I was pretty much hit and run, but it did look pretty cozy. I had a breakfast sandwich; choice of either bagel or English muffin with egg, cheese, and choice if meat in between. I had mine with the everything bagel and turkey sausage.\n\nI was actually pleased with the overall experience until I got on the Caltrain and dug into my sandwich. I paid an extra dollar to add avocado to my bagel but between the person at the cashier and the person making the bagel, that message never got through. I felt cheated of my money and of my full dollar of tip. Way to ruin my morning before a big meeting.\n\nI mean, it's great that you open this early but if you can't get your act together to be awake enough to get my order right, maybe open later and send me to Flour + Co. instead.", "author": "George G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "We were looking for a place to grab so ethubg quick, but still tasty. We got a bagel sandwich and the spicy chicken sandwich. Everything was delicious and we got our order quick. Very decent prices for the 2 sandwiches 2 drinks and a large coffee it was $20. Plenty of seats inside, recommend this little spot.", "author": "Silvina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "Nothing fancy... Order at the counter breakfast shop.  There's about 6 tables inside and a table outside.  Breakfast sandwiches were very good. Would recommend this place if on the go and you just need a quick bite.", "author": "Joanna D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "Went here for breakfast before heading to the airport to head back to Boston. I was looking forward to a great breakfast after reading through all the reviews--only to be disappointed when I showed up and noticed that they basically sell Costco merchandise (bagels, croissants, muffins, etc.). That being said, my croissant breakfast sandwich was decent, but nothing special and was a bit small for the price. Overall, it took about 10 minutes for the sandwich to come out and the line for ordering was pretty slow as well.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "EaterSF reminded me of this great little café not far from me, and it also pointed out how great their breakfasts, including breakfast sandwiches, are.  I started an internship recently so I wanted to make sure I started my first morning on the job right by fueling up with a good meal.  I got the lox breakfast sandwich with capers sans red onions (love red onions but didn't want to offend anyone with my breath).  The lox was fresh and tasty and all of it together made for a great meal on the run.  I can't wait to try more of their meals!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-27", "description": "Yelpers beware, they serve Costco bagels. Usually I'm not too good for Kirklands finest, but we opted out.", "author": "Faustino S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-23", "description": "There's a lot going on in this little micro-cafe space. First of all it's jam packed with three tables and stools at the counter, in front of the window to the street.  There's also an ATM machine and two Internet access terminals set up for you to pay-by-the-minute,1990s style. But the real story here is their quick breakfast option. A $4.15 breakfast bagel or english muffin offers incredible value when loaded up with your choice of sausage, bacon, ham or turkey and egg and lots of melted cheese on your choice of dough-based goodness. It's not like it tastes incredible or anything  - I'd say it's slightly above average. But at this price, it's a can't miss choice! And the time from order to delivery is almost lightning quick, at least as fast as your lame azz old McDonald's can offer.", "author": "Ted R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Nice place.  Friendly staff.  Quaint, with a few tables outside and inside.  Price for breakfast sandwich and coffee was about $7.75.  That's great compaired to the $33.00 breakfast at my hotel. Coffee is really good. Enjoy!!", "author": "Gary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "The two lovely ladies at the morning fix make great bagels, muffin. & other wonderful breakfast treats.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "The worst cafe ever !\nGo there if you have all the time in the world!\n\nThey were 3 people working there and only 5 customers and it took 20 minutes just to order a coffee!!", "author": "Ali Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "If you're into no bs, fresh ingredient breakfast places you're gonna love this joint. \n\nWe had two bagels, all in. You could taste the freshness of the ingredients and they were served in no time. It's a whole in the wall but perfect for a quick, yummy breakfast before venturing off to SF.", "author": "Kay O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "A sweet little cafe right around the corner from my neighborhood. I swung by on a Saturday morning after a late night out, looking for a quick bite to eat and wow, was I happy to stumble in on this overlooked gem!\n\nAs many reviewers have mentioned before me, the bagel sandwiches are wonderful here. I ordered the Breakfast Bagel Sandwich, which came with eggs & bacon (and a bit of cheese, I believe?). Either way, it was THE perfect start to my morning. Plus, I got my order within 5 minutes (how crazy is that?).\n\nI DEFINITELY see myself coming here more often-- and I'm really excited to try out more of their yummy breakfast items! Will update soon :)", "author": "Lucy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "This spot is aptly named; this is my go-to spot when I'm too tired or out of ingredients to make my own breakfast, or even lunch sometimes.  I've been a regular for two years now and I really like the ladies who run the shop.  \n\nIs this food phenomenal? No.  But does it save the day?  Yes.  Plus, again, I can't stress enough how great those ladies are.", "author": "Becky N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "The Morning Fix is a small hole in the wall dispensary of coffee, eggs, bagels. breakfast sammies, sammies, wraps, salads.\n\na single smiling lady was present when i entered. though i bought only a coffee, she was appreciative and all smiles. so cool! \n\nbrew: \"American's Best\" coffee (1.25)\n-surprisingly drinkable. semi-smooth, low acidity\n-obviously not the low end grade that donut shops brew.\n\nnotes:\n-pricing is a tad higher \n(this side isn't the tenderloin\nthe other side of the street is).\n-hospitable cool service\n-seating available.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "This place is so cozy and inviting! I went for the second time and I it was just as good. I got the breakfast sandwich with sausage and it was amazing. I'm lucky because it is right around the corner from my apartment.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-17", "description": "I noticed this coffee shop yesterday next door to  Cybelles pizzaria . Cute place but not many options I love coffee so I decided to try a cup of the Colombian coffee. It tasted fresh and hot I picked up a Muffin also \nThe cashier was extra friendly but the place missing character .\nGood coffee though.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Service a little slow, went at 11:30am, only 2 women in the back for cooking and working the register, but the were trying their best to accommodate everyone in a timely manner. \n\nFood wise, excellent. We had the bagel sandwich and breakfast burrito. Meats were good quality, not the cheap kind, and the eggs were made fresh, not from the carton. I recommend.", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Yes!!! Friendly welcoming service, simple but yet good breakfast. What you get here is not overthought, it's homemade tasting and easily a great spot for a breakfast sandwich either on a bagel or English muffin!\n\nThe breakfast sandwich with cream cheese egg and bacon on an everything bagel was perfect!!\n\nThe service is like going to a family members house, you'll feel more than welcomed!", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Visiting from out of town and decided to Yelp a breakfast place... This place did not disappoint, the breakfast burrito was bomb, bacon was so good and flavorful. \n\nAlso the Mocha was delicious! I would definitely come back if I come back to visit! Yummy!!!", "author": "Jeanette A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Cool little place to grab a quick bite on the way to work, nice little lady running the place\n\nGot in and out with a big breakfast bagel sandwich and a donut for $5 so pretty much the best deal I've ever seen in SF \n\nCould use some new interior design, but besides that a good place", "author": "Corbin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "This place is a bit pricey (close to $5 for a breakfast sandwich) and it's kind of annoying that they charge a decent amount extra to get it on a croissant, but the food is really good. The iced mocha is also the bomb and the ladies that work here are really sweet.", "author": "Shabnam E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-27", "description": "I went to this place because I was mislead by the reviews.\nI wouldn't consider this place a cafe. More like tiny convenience shop that also brews coffee. The food was VERY mediocre. I tried their breakfast bagel sandwich and their salad. The service was sweet and polite. But the place itself is very small with sold wi-fi (really?) and the food is just not worth going there again. Sorry.", "author": "Maria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "really good service and he food was amazing!! the area is a little shady but it is worth it", "author": "Madelyn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "A tiny family-run shop. They are really friendly and always smiling! I had the sausage English muffin and it was hot, fresh, and delicious.", "author": "Deon N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-12", "description": "Really small shop with few breakfast options. They only serve 3 different kinds of bagels and they used Costco brand when I was there. A bit unimpressed but it was an easy place to grab something. Service is a bit slow", "author": "Hannah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "The people here are lovely, and the food is reliably tasty. My most-frequented breakfast place in the neighborhood.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-24", "description": "One star for breakfast burrito and soy latte.\nI was looking for a relatively cheap but decent breakfast. It was awful... \"salsa\" tasted like canned crushed tomatoes, soy latte tasted like baby formula, and everything just seemed off... like possibly a little rotten. Stay away.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-27", "description": "Quaint little off the street cafe. Super friendly service, but don't expect much else. The coffee was fair & the bagel sandwich I had wasn't anything to write home about. Don't expect anything fresh from the stove because all I saw in the kitchen was a microwave. The bagel was soft but wasn't homemade. Only perk to the food was they don't skimp you on the avocado.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Ordered a breakfast sandwich on a croissant; the croissant was nice and fresh.\nGreat coffee too. Nice little inexpensive place for breakfast!", "author": "Doug S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "This is a friendly neighborhood joint. The price is reasonable and the service is great.\n\nA large ice coffee with cost you $1.80.\n\nI ordered a california bagel, it was delicious. Filed with cream cheese, avacado, onions and tomatoes for $4.50. The only thing disappointing about it was the bagel they used. I was hoping it was baked fresh in-house or locally at some other joint, but instead they are from costco.", "author": "Vay V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Visiting Sf from out of town and my husband and I were looking for a place to grab some breakfast near our hotel. I had the caramel macchiato and the breakfast sandwich on a cheese bagel, it was delicious, fresh, and cheap! I wish we could have found this place sooner!!!", "author": "Martha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "The customer service was very friendly. I tried the breakfast sandwich on the everything bagel with sausage and it was quite delicious. The melted cheese added a delightful  taste to the bagel. I also had the spicy chicken sandwich, which was rather ordinary in taste. The affordability and quality of service qualify this for five stars.", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "The breakfast sausage, egg and cheese croissant sandwich tastes so good. And they're consistent with their quality.", "author": "Darrell D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "We visited Morning Fix today based on the high reviews and left totally perplexed! We ordered one of their bagel sandwiches and  we were directed to choose what type of bagel from the case. The bagels were in their Costco bags. The rest of the ingredients were of similar quality. Our daughter refused to eat her gritty pancakes and bacon. The bacon was really weird - paper thin and floppy- likely frozen and microwaved. It was all manufactured, reheated, gross, and disappointing.", "author": "Julie F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-17", "description": "Are the great reviews of this place to be nice to be nice to the very nice ladies running this shop?\n\nI was in the area for a conference and had a bagel and coffee.  The bagels are from Costco; they are in the recognizable Kirkland packages behind the counter.  The coffee was better than the average truck stop, but clearly not as good as a starbucks.  Ambiance is convenience store.\n\nWhat I had here was OK for a basic breakfast and the service is good.  4.5 stars is crazy too high for this place.  Should perhaps have an average of around 3 stars.", "author": "Franz Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "Nice little coffee shop I only go there when I'm in desperate need of a caffeine fix the inside is too small but the staff are very friendly.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "Good coffee, tasty breakfast options, quick and friendly service, and inexpensive prices. \n\nNeed I say more? \n\nI have lived in this neighborhood for years and always went to a coffee place down the street. After a few frustrating experiences, I happened to yelp for breakfast burritos and found Morning Fix. I am sold. Why didn't I hit up this place earlier?!?  Check it out: you won't be disappointed.", "author": "Laine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "This place is amazing.  Its a morning routine for me at this point!  Breakfast burrito add avocado and a iced coffee.  This place never fails to impress with their fresh ingredients.  Not to mention the two owners (sisters) are the nicest people around.  Definitely start your day right at Morning Fix.", "author": "Garrett F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Cute little place in Nob Hill I hiked to on Sunday morning before heading out to Napa. I was in need of some much needed quality breakfast food and this place was the golden ticket.  Got some English Breakfast tea with a Salmon Lox Bagel Sandwich and it was perfection!  Last night was exhausting and I needed high quality food to energize me for a Napa Excursion that morning.  I patiently waited in a short line and then chilled outside for a bit to people watch on the streets.\n\nThe salmon was so good and fresh it seemed.  The cream cheese or whatever they used was also on point.  The quick brunch was also reasonably priced, it seems like a very well run mom and pops like joint.  There are plenty of other options for bagel breakfast or brunch sandwiches.  Will be back if I'm in the area again for sure!  I love how they are so many great places in this neighborhood within walking distance.  \n\nThere was quite a line and they get relatively busy with many other young people stopping by for a bite or to hang out.  There are some old computers here you can use to get on the internet... I guess it's for travelers.  Can't imagine that they actually charge for use of it, haha.  Anyhow, I ate rather quickly and ran back to get my car from the garage and headed directly to Bauer's like a bat out of hell so I wouldn't miss the departure time... that was fun.", "author": "Kenny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "If you are a New Yorker and are looking for a bacon egg and cheese just like your good ole delis used to make back home! This is the place! Came Here on a wim visiting and I've lived in California about a year and haven't found a place in all of soCal that replicates it. This little spot and little woman works wonders. Coffee is pretty good also for a regular brew not burnt or anything. Gets a little busy since it's a small spot but it's cheap and tasty for a quick bite to eat on your way!", "author": "Erika F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "The food here is FRESH and delicious! Their bagels are very good (I highly recommend their Veggie bagel), but the hidden gem is their wraps! These are consistently fresh, filled with deliciousness, healthful, and warmed, which makes the tortillas nice and chewy. To top it off, the customer service is impeccable.  The two ladies that work the shop are always so nice and greet you with a genuine smile. I don't know how they do it, but this place is becoming my #1 go to place.\n\nTheir coffee is not bad either, considering you serve your own drink. An added plus is they have an organic brew, which I haven't seen offered in other small coffee shops nearby. In summary, despite the size of the cafe (works best for parties of 1-3), I love to come here after a morning workout. The great food, great prices ($5-6 per plate), and friendly staff keeps me coming back!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "they have the best breakfast sandwiches, bagels, and iced coffee. The women that work here are very friendly and I enjoy supporting local businesses", "author": "Drew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "THE BAGELS WERE THE BOMB! I had the California Bagel and it was so refreshing. The lady who took our order was so pleasant. Highly recommend. Though the location is a LONG walk from Union Square, but it was worth it.", "author": "Ximena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "An oasis of simple, affordable, good breakfast food with quick service amidst a sea of expensive, bougie brunch bistros.\n\nIt's not going to be there best coffee or breakfast you have, but you'll get the best bang for your buck.", "author": "Brendan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "It's great for a spontaneous breakfast. Their breakfast sandwiches are awesome. Highly suggest. Super nice people, super chill, definitely coming back.", "author": "Remus B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "This tiny little breakfast stop is definitely no frills. The service is a little slow but the prices are great and food is what you'd expect.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "The food here is fantastic. Their egg/cheese/bacon on an english muffin is consistently fluffy, chewy, and delicious. Their bagels are also very good, and just about everything on the menu is under $5. They don't skimp on any ingredients, which is FANTASTIC if you're like me and love avocados. They will serve you breakfast all day and the woman running it is always very kind.", "author": "Tiffany Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "Honestly the cutest and best place to have a quick breakfast. They have a vast variety of all kinds of breakfast meals. You name it, they got it. They were SUPER sweet to me and I got my order very quick and it was soooooo good. They even took the plate from me right after. So kind. The prices are incredible for the quality of the food. Definitely coming back next time I'm here. I loved it.", "author": "Nona W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Well, now everyone's going to know about them: http://sf.eater.com/maps/best-san-francisco-cheap-breakfast", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "My boyfriend and I love going here on lazy weekends for a quick bite to eat. The ladies who work there are extremely nice and the ingredients are always fresh. It is also one of the best values you'll find in the city! A breakfast croissant at the coffee shop a few blocks away costs $10, whereas you pay the same price at The Morning Fix for two breakfast sandwiches and a coffee! a great little business that we'll continue to support.", "author": "Annie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "This is definitely a small, hole-in-the-wall place, but it is cozy and yummy. \n\nI visited on a Friday morning, and had a bacon breakfast burrito. It wasn't the best burrito I've ever had (I mean, I'm from Texas, so...), but it was pretty good. Really, it was the service that made the place great. The lady behind the counter was genuinely nice and even brought my food out with a smile. \n\nThere are only about 15 seats inside (three, four-seater tables and a small bar) and two small, two-seaters outside, but that didn't keep a steady stream of people from coming in for a bagel, coffee, and donuts. \n\nWifi here was also fast, so I sat a while and did some work. Even though it was small, I didn't feel rushed to move along!", "author": "Dana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "The food here is fast and affordable -- when you're hangry and need to eat it'll get the job done but isn't worth going out of your way for. My bagel and lox was fine but the Kirkland (Costco) bag let me know the bagels weren't baked today. Similarly the iced soy latte was good and I'm glad they had simple syrup. We were getting hangry so this worked out well for bfast. If we had more time/patience I'd've liked a fancier place.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "Can't go wrong with this hole in the wall. Consistent bagels with egg cheese and avocado. They even have Swiss cheese ! They have magazines to choose from , outdoor seating which just makes a perfect morning. \n\nThe lady who works here is friendly and makes a yummy Sammy for my mornings.", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-30", "description": "Costco bagel and cream cheese was good but I left wanting more. Good prices but I'm not sure I'd go back.", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "This place is a wonderful place to stop if you have a few extra minutes in the morning.  The breakfast options are great and the service is quick.  I visited twice while in town since it was right down the street from my hotel.  There is free WIFI as well which makes it a great spot to catch up on the news and emails.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "The Morning Fix is really just a breakfast place, but if you get 2 items, then it's a lunch! I got the SF bagel sandwich (cream cheese, avocado, and sundried tomato) and the chicken Caesar salad. The first thing to know is that the Morning Fix is very generous with ingredients! Unfortunately I'm not the hugest fan of cheese, so I didn't like my salad as much because of that. They certainly don't skimp on the avocado! Way more than I've gotten in any other meal. The sundried tomatoes were also extremely tasty. I got the SF bagel sandwich without cream cheese, and the tomatoes and avocados were so perfect together. \n\nAlso had a bite of my friend's breakfast burrito, and the bacon was cooked perfectly. In my experience, that's hard to do. \n\nOnly issue is that the wait was a lot longer than I expected, especially without a line.\n\nWith everything costing less than $5, the Morning Fix is perfect for breakfasts and snacks! Honestly if I lived around there, I would probably pick up a bagel as a snack every day.", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "This place is delicious, and although it's all clearly costco food, they made it super fast, friendly, and were accommodating to my bacon addiction. \n\nI've heard the coffee is good, and I feel like I goofed by not getting it. \n\nThe breakfast sandwich ran me under $5, and was the same size as any breakfast sandwich I've gotten in the city so far. \n\nThe internet might be free? I saw a sign that said $10/day or $5/hr, which seems a little outrageous, but hey, I didn't go there for the internet.", "author": "Clinton J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Great fresh sandwich and good coffee. The staff was great and service was fast. Whether in a hurry or on a stroll, the morning fix won't disappoint.", "author": "Charlie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Opens earlier than other places in area. Breakfast sandwich was better than average and cappuccino was better than average. The chocolate croissant was good but nothing special.", "author": "Brad S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-17", "description": "small place but great breakfast sandwiches.  Looks like they buy ingredients from COSTCO.  Good quality, coffee was okay but okay for breakfast on the run.", "author": "Todd A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "I love this place! Coffee taste great and will keep me going through the day! II haven't been here when it's really busy but my coffee came quick and they have free wifi and lots of seating (inside & out). I haven't tried any of the food but it all looks great and really affordable! follow up review will come once I do. \n\nUpdate- Food is great! Got the California which was packed full of super fresh vegetables & then I had the spicy chicken & cheese sandwich (not at the same time :) & it was great, tasted like the chicken was just grilled up.\nI just opened up shop next door and think I'll be spending a lot of time here", "author": "Shayana W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "Really good bagels. We had the lox bagel and a sundried tomato and avocado bagel. \nNice job!", "author": "R M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-04", "description": "How can people recommend a breakfast place where the owner admits that the pancakes are pre made!?  I was trying to order a pancake, egg and bacon combo and that's when she admitted she couldn't change from the 3 pancake order bc the pancakes are pre made. I left.", "author": "S M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Great breakfast spot! Tasty breakfast sandwiches for a very reasonable price. Personnel is always super nice and friendly.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "They always made my order just as expected with friendly service!  I've moved from San Francisco, but I will remember them as my go to early morning pre-work coffee and breakfast burrito stop.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "The Morning Fix is basically a hole in the wall and I'm simply talking about the size of the place. It's tucked away in between the Balmoral Residence Club and Fit In The City (which hasn't even been opened yet) and Cybelle's.\n\nDespite the size of the cafe, the food there is pretty good and the prices are reasonable. For anyone who is local, this place is great if you are looking for a place to grab a quick breakfast or a cup of coffee on your way to work.\n\n The two sisters that run the Morning Fix are friendly and nice. If you're a regular, they'll remember you and you'll get to know them.\n\nAlso, try to Mocha Cooler Freeze on a hot day. That drink is delioush!", "author": "Enoch T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Cute little deli! Good breakfast options and coffee at very good prices. I tried a couple of their bagel sandwiches on the menu and they were all great. The service was quick and the people working here are very nice.", "author": "Eleana M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-21", "description": "Bagels are from Costco, eggs are microwaved and cheese is plastic but it is a friendly place", "author": "Terri A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Nob Hill corner breakfast (lunch) spot with clean urban vibe for a fair price.I had Good strong hot coffee & fresh crunchy bagel with creamy hummus. Carry on OR sit @ counter & just people watch.", "author": "Virginia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-17", "description": "I don't really understand why this place receives such high ratings (4.5 *s as I write this). I stopped in this morning for a coffee and bagel sandwich and was underwhelmed. The bagels were nothing special and the toppings just OK. My friend's breakfast bagel sandwich seemed like something you'd get at a fast food joint (premade egg patty, low grade sausage, processed American cheese).", "author": "Lexter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "6 stars if I could! I eat the California sandwich 3 times a week. It's one of the simplest but best things I've ever eaten. The shop is not designer but the service is fast, prices are great, and the ladies who run it work their butt off everyday living the American dream. Just get the California and thank me later!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Came here twice during my four day stay in San Francisco. The woman working there is super nice and the breakfast is delicious. Small and simple but brilliant! Skip the tourist places a few blocks down and head to this neighborhood café instead.", "author": "Linn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Nice food, really nice people but it's not a fun place to sit in - its small and a bit boring.", "author": "Hila E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Took a risk and got the egg salad sandwich with a side caesar salad. It was actually really good! Keep in mind that when they ask you if you want everything on the sandwich that includes. Lettuce, tomatos, onions and pickles. Some might not like the onion/pickle add, but i appreciated the pickle on egg salad taste. Service is a bit slow, but would definitely go back!", "author": "Shu H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-05", "description": "This place is fine if you want Costco Bagels with microwaved eggs. Don't come here if you want real breakfast sandwich from grill.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "Second time having breakfast here while in town for business.  Friendly staff, good food.  Small seating area for 14 people.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Bagel turkey sandwich and sausage breakfast burrito were delicious!  Fluffy eggs, melted cheese, and home fry potatoes.", "author": "Ramses S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "No frills hole in the wall place with good breakfast bagel sandwiches. Had a nice vanilla latte and sat at a table outside early one Saturday morning. Walked over from the Mark Hopkins. It's a small place so it can get crowded. Seemed like an authentic San Fran place to me. I liked it and would return!", "author": "Barbara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "The two ladies who work here (I think they're sisters) are so incredibly sweet. They're always smiling and they make the BEST bagel sandwiches at a really great price. My go-to is a California (avocado, tomato, cucumber, cream cheese, black pepper) on an asiago or sesame bagel followed by a hot tea, which brings me up to their $5 minimum for credit cards. A cheap and delicious fresh breakfast that tides me over so that I'm not thinking about food till 2 PM. I'm such a regular that they've pretty much stopped asking me what I want when I walk in. Definitely give this place a try.\n\nEdit: I moved away from this neighborhood years ago but I still try and drop by whenever I'm around every 8 or 9 months. Somehow they still remember me and my order and it really warms my heart every time.", "author": "Dede G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "The cheese turkey breakfast sandwich (cheese bagel) is the best bagel I've ever tasted!!!! Simply, \"amazing\".", "author": "Sanjaya Gin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "It's a great cafe.. Clean and tasty food... Two sisters run this place and they are friendly and sweet. Any body can spend time here and enjoy tasty food and drinks....\nDaily I am here to have food and drinks....\nYou must try to stop by and check for once and sure you will come over and over...", "author": "Lasantha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "4.5 stars average for this place is nuts. Kirkland bagels and microwaved eggs. Not kidding. Don't get me wrong, it was fine. Good service. Cheap pricing. \n\nI think you need at least a skillet to get 4 stars out of me.\n\nI searched this place out because of the high rating. This actually inspired me to sign up and write my first review. \n\nI guess I'm a tough grader. I wish more of us were.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "This place is ran by some really nice, sweet sisters!\n\nEverything they make is really good but I will point out that they make the best breakfast burritos here! The burrito is less than $5! \n\nAlso, they make the most faaaaaaaaabulos iced blended mochas you've ever tasted ***unlike Starbucks, where half of the blended drink is garbage, the only good part is the top half***\n\nOther great items include their bagel selection, which i must say, all is good and their iced tea is special too! Oh the croissants are super good too!", "author": "Linda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "I had a very tasty California bagel. The owners are extremely friendly and polite and the prices are really good.", "author": "Maurice A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "My favorite to-go breakfast place in Nob Hill. The food is fresh and the lady that works mornings is extremely friendly and knows my \"usual\" order. Only potential issue is when more than 5 people are waiting in line it can take more than the standard 90 second in the door out the door that I'm used to. I've tried many breakfast items and a couple lunch items, prices are reasonable and again service is great. Would definitely recommend.", "author": "Pouyan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "No thrills place, i guess I expected eggs, bacon, hashbrowns etc. they do have pancakes. If u want a basic bkfst with low prices, this is your spot.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "Tasty bagel sandwiches at incredibly reasonable prices. Very satisfying start to a morning.", "author": "Armando I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "I had the San Francisco bagel and my boyfriend had the California bagel. They were both fresh and delicious!  Great coffee selection as well!", "author": "Kaitie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-24", "description": "This place is fantastic.  Friendly service and great food. Sometimes it can take a while because there's only one or two people working so I only come here if I'm not in a rush. I highly recommend the breakfast burritos because they are both delicious and inexpensive.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "The food (I got the breakfast bagel) is nothing special but they are open when other places aren't and the staff is friendly. Everything is inexpensive. Wifi is NOT free.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "My boo bought me a sausage burrito from here (thank you yelpers for the rec) and it was pretty good. It was a good portion. It looked small compared to burritos I've had like from El Farlito but I guess it's the perfect size for breakfast. There was definitely no skimping in this burrito! I love it! Maybe a tad bit too much cheese but that's because I'm not one to go nuts over cheese. I wish i was able to have this be delivered to me every day! After reading everyone's reviews - i really want to try a bagel", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-16", "description": "Had breakfast here last Thursday during the storm! It was a last minute decision based slowly on who had power on in the city and was serving breakfast! I had the Italian bagel which was awesome and my boyfriend had a ham and cheese sandwich which he seemed to enjoy. I would have gave the restaurant four stars because the food was rather good and fresh but from reading the reviews -I didn't expect the place to be a little shop, kind of like a gas station store.", "author": "Diamond G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Randomly stopped in here just for coffee but I ended up grabbing an English muffin with ham/egg/cheese, so yummy! The lady that works that was insanely sweet as well. I always love these little gems, cheap with friendly service, what more could you want?", "author": "Genie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "THE best neighborhood coffee shop a bachelor can ask for! Ive never been let down here. The gals who run the joint are hands down two of the nicest ladies I've ever met.  They are friendly, always smiling and boy, they sure work hard. They are open from 7a-7p on weekdays (...til 5p on weekends) and they are both there usually, or at least one of them...\nThe bagels are fantastic and i love the frozen vanilla coffee drink thing. My staff is going to drink me broke if they keep guzzling them the way they do. \nAnyhow...great spot if you are on Bush and Jones. Stop by, grab a snack and drank! Nothing but smiles and an excellent caffeine fix here...", "author": "Karl H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "This is a great breakfast shop. It has everything you want for your \"Morning Fix,\" a friendly staff, good breakfast options, and a good selection of decent coffee. The menu is straight forward breakfast fare and they also carry cereal, cereal bars, milk, etc. I was in and out quickly and the price was good. I'll be making this one of my morning stops for the weekend.", "author": "Corey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Bacon breakfast burrito was delicious. Sriracha surprise was the best in the morning.", "author": "Gregory M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Great tasting food, quick service, and the best prices you can find for a morning spot.  Also the owners are very nice, which is a plus.\n\nAfter 5 years living in the area, this is hands down my goto breakfast spot.", "author": "Jason k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "Quick service with a smile, FANTASTIC bagels and the coffee is a perfect morning fix. Feel like a SF local and enjoy.", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "Quality of Food 4  **** love their coffees and hot sandwiches   \nAmbience 3    \nPrice 4    \nService 4    \n----------------------------------------     \nAverage 3.75", "author": "Mary W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-17", "description": "What I like about Nob Hill is the many little coffee shops found on every street corner.  You will never get de-caffeinated.  The Morning Fix is one such place.  It's a neat little place to grab a snack or drink, or sit down for a bit to use their internet.  I had their soy chai latte and it was yummy.  I always support mom-n-pop places (or rather, mom-n-mom places in this case), even though the Cash Only policy bugs me a little.  (Hey, I walk through the Tenderloin...can't carry too much dough.)\n\n1 star off: only two tiny tables\n1 star off: ...and I had to share the table with a dude who liked to touch me", "author": "Ally W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Amazing breakfest burritos and sandwiches, great value. A local Gem. We were obviously the only tourists there.", "author": "Jerry G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "Cute and small mom and pop cafe. Not too much seating. Got thr breakfast burrito and their veggie breakfast, but in a crosaaint rather than a bagel. Super great customer service. Quick and fast place.", "author": "Nurit Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "Had breakfast here the other morning while visiting San Fran. It got good reviews on yelp, so my boyfriend and I checked it out. The menu had a variety of options which was nice! Bagel sandwich was very tasty, and they had several options for coffee which was great. They have just about everything for breakfast even items to just grab and go if you are in a hurry. The staff was very friendly, cheap prices, quick breakfast.", "author": "Steph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "Enjoyed the breakfast and the neighborly ambiance in an internet-equipped foyer. Bunch of regulars, apparently, came thru for coffee, etc. and the hostess took it all in stride. Chocolate croissant - 7/10", "author": "Mark 8."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-05", "description": "I come here early in the morning... Because it opens at 7:00am. My boyfriend loves the bagel sandwiches. Good service.", "author": "Stella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "Great combination of price and quality.  I am a big fan of breakfast sandwiches. I had a bacon, egg and cheese bagel sandwich for less than $5 in a neighborhood where breakfast runs in the mid-20's.  The sandwich could not have been better.", "author": "Frank F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "This place is kind of a hole in the wall, but it has the best breakfast burritos and bagels! We sat at the window and people-watched. Great way to start a Saturday in the city!", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-18", "description": "Small place with a small nice staff.  The coffee is sweet and they have plenty of computers with free internet so a great place to stop by if you're from out of town.  \n\nThe food was pretty good too, and came out relatively quickly.  It was slow, and the lady was even nice enough to bring it to me outside!  \n\nNice place to drop by in the morning for... well a fix! (god i'm corny).  I'll be back.", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "Morning Fix is quick, cheap, and yummy! The ladies that work here are super nice. Get the California bagel.", "author": "Angie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "my boyfriend and i ate breakfast there one morning. we got the breakfast bagel sandwich.. one saugage&egg the other bacon&egg. we also got mocha lattes..it was all delicious and reasonable prices! must go:)", "author": "Kayla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-25", "description": "great bagel sandwiches, friendly staff and really affordable prices! they also have a great drink menu including lattes, chai and more!\n\nplus they now accept credit cards!", "author": "Jae C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "This place is absolutely amazing! I love their bacon breakfast sandwich on a sesame bagel! So delicious! I can't decide which my favorite part of this neighborhood cafe is - how incredibly warm the owner is, the great drip coffee varieties, or the tasty food. I definitely recommend popping in here for your morning fix!", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "Ordered a bagel sandwich and a latte on a Sunday morning- wasn't particularly busy. Bagel came out quick but the lady forgot about my latte. Other than that complaint, cool little place.", "author": "Corey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "Walked in to get an iced tea, the place was a little dumpy, the iced tea was just plain old Lipton tea but somehow it was really really good!\n\nThe 4 stars are for the nice ladies behind the counter.  The world needs less starbucks and more of these dingy little mom & pop shops!", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-31", "description": "Not really a cafe, a small hole in the wall place with a couple computers, a few seats and self serve coffee from those warming canisters. The coffee was decent enough and they serve a variety of food that is perfect when you need a quick bite.", "author": "Nosniv X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-08", "description": "I came to The Morning Fix for an afternoon fix.  It's a cool coffeehouse which also happens to offer organic coffee, service from friendly staff with friendly neighborhood regulars. They have free wifi, along with several internet terminals for use.   Although there's only two tables for seating, there are more seats by the window, along with tables outside.  There's not much distraction, so I can easily find myself wasting my time away here.  \r\n\r\nHankering for something other than eggs, a bagel, or a sandwich?  Hit up Cybelle's Pizza right next door.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-16", "description": "Two VERY nice ladies run this place. I came here only to use their internet services, but the aroma of the food got to me. Daaaamn, it smells so good. I've had their tuna melt chicken wrap, turkey wrap, and their hot sandwiches. All were good, and filling. \n\nTheir internet charges are pretty cheap. Anytime after 2pm and the fee is $2 and hour, but the ladies are pretty lax when it comes to collecting. They sometimes don't charge the full amount. What sweethearts!\n\nThe place is small, but the tables are large enough to accommodate four people each. There's also a bar up against the window where one can sit, eat and people watch.", "author": "Audrey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-28", "description": "Perhaps the dingiest cafe in the financial district. Reeks of dust bunnies, cheap chairs, and a distinct lack of taste. The coffee's alright, but don't expect to enjoy being inside the cafe. It's an in-and-out type of place.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "This is a great place to go for a coffee and a bite. Bonus free wifi and a great local spot.", "author": "Brandi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-22", "description": "Moving in to a new place and not having internet for a week is no good.  Luckily, there's good 'ol Morning Fix where I can get cheap, good coffee, a delicious avocado bagel, and free wireless internet.  The two ladies that run the place are as nice as a bushel of cherries and I enjoy listening to the non-stop 90's radio hits they play all morning! Thank you Morning Fix for saving my life.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "I always get the same thing here which is an Avacado and Cheese sandwich on a roll (although occassionaly I get it on whole wheat).  I agree with everyone else - the ladies are awesome...\nand the quality of the food is also VERY good.  consistently good.\n\nHighly recommend for coffee, sandwiches, bagles, internet, muffins, etc.", "author": "Sumit K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-30", "description": "I don't come here to chill, but the two ladies that run it are really great. It's a shabby little place with good cheap coffee. It's right around the corner from my house, and I am very fond of this little shop!", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-24", "description": "When I lived on this block, I used to go here on Sunday mornings all the time for a bagel and a cup of coffee... Their coffee is really good, and their pastries and sandwiches are too... I only knock a star off because their prices are a little high, and there was one weird guy who used to creep me out that worked there... I dunno if he still does or not...", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-10", "description": "I'm sitting here right now. Decent coffee, good (free, wireless) internet connection, and I just had a yummy salad - the veggies were clearly just chopped, fresh and crunchy! Definitely a solid choice for internet-ing.", "author": "zoe s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-11", "description": "What I really like about this place are the two ladies that run the coffee shop! They are just genuinely nice. On the coffee side, they do have organic coffee and the California bagel (cream cheese, avocado, tomato, onion) is delicious.", "author": "Bogee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-01", "description": "four solid stars for the warm service that guides a speedy path to my organic coumbian lover. round, firm, and fully packed; truly one of the best wake up calls I have had in a while. one outstanding star because by chance I happened to be on the route of my former rolling freakshow commute, more commonly known as the 27 bryant. I sip and look up to the lumbering sound of diesel just in time to catch the surly looks of my former bus-mates before they round the corner. it was pre-dawn tranquill except for a soft heh-heh-heh-heh all the way back to my car. somehow the sunrise seemed sort of cheery for once.", "author": "dave p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "Very clean place. Very nice women who work there. Very polite. The salads are great! They are very fresh. The veggie bagels are great too. It's a great place for vegetarians.", "author": "Lisa J."}
