{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "YUM. Another great addition to the restaurant on 9th ave. \n\nIf you're craving korea food in the inner sunset and don't feel like waiting for Manna (which is amazing for their soups btw), the Korean Kitchen is here for your rescue. \n\nComparatively, I think The Korean Kitchen is more of a bar food type of restaurants with amazing friend chicken wings and cheese corn. \n\nWe ended up ordering the following:\nCheese Corn: literally to die for. So cheesy and gooey. \nSoy Flavor Chicken Wings: perfectly fried, nicely seasoned, not too oily, lighter batter, which i enjoyed. I would order this again. \nSoon Tofu soup: The BF wanted something warm. Suprisingly the soup was on par with some of the other joints that we've tried before. Solid dish. The broth was great.\nFish Cake Soup: Not what I imagined originally. I had in mind the fish cake on the stick soup, but this was more of a fish ball soup. Nonetheless, the broth was very clear and pure. It's a nice soup to accompany the various fried dishes we got and a nice soothing dish for the tummy. \n\nAs a former SoCal resident, since moving home, I've always been on the search for good korean food comparable to my LA days. It's nice to find this joint as it definitely hits the spots.", "author": "Diane T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-02", "description": "Finding time to catch up with friends when all of you are in medical school is hard, but everybody's gotta eat, right? My friend was in the mood for Korean so we decided to try this hole-in-the-wall conveniently located in between all of us.\n\nRating Breakdown:\n1.5/2 Stars for Taste --\nWe ordered the kimchi bulgolgi fries, half and half fried chicken (soy ginger + mild spicy), and seafood pancake. I thought the fried chicken would be the highlight of the night, but I was surprised by how much I enjoyed the bulgolgi fries. I especially appreciate how they use curly fries as a base rather than the traditional fry. I preferred the soy ginger to the mild spicy (which wasn't really spicy at all) but honestly I'd probably go to San Tung instead for fried chicken of the \"soy ginger\" variety. The seafood pancake was meh. Now that I'm looking back at the pictures, we didn't get any \"dancing flakes\" on ours. Rude! Also, the panchan was nothing to write home about -- my favorite was the sweet black beans. In general, the food was on the saltier side...but we also inadvertently ordered all fried food so we may have a skewed sample.\n\n0.5/1 Stars for Value --\n$23 for fried chicken is pretty steep, but a normal San Francisco price. The portion sizes are pretty generous. We ordered three dishes (listed above) for three people and ended up paying about $21.50 each with tax and tip.  The half and half chicken also comes with a side of fries and a mini-salad. Skip the seafood pancake.\n\n1/1 Stars for Customer Service --\nWe were seated pretty quickly at 7PM on a Thursday night. There seemed to be one waiter serving the small restaurant. The food came pretty quickly. My favorite thing was the little iPad brought around at the end to pay/register for their rewards program. Convenient...if only my sausage fingers weren't so fat. \n\nNo bonus star because while I would come back for the fries and the fried chicken, I can get them better and cheaper elsewhere.\n\n---\nFor more food pictures, check out @noshameadventures on IG!", "author": "Abby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "I'm giving this 5 stars because this should stand out as one of the best (at least better) options for Korean in SF. To clarify, the food may not be on SoCal level, but it's slim pickings for solid Korean food in the city. I've never had to wait for a table here, unlike Manna and Toyose. Also, this place is quite affordable so it's my go-to Korean spot. However, I don't come here for BBQ - I end up at Han Il Kwan for that.\n\nFood wise, I love the seafood pancake here and the sauce that accompanies it. It's changed over time (the size and the way they cut it), but I typically get a tofu soup for myself and share the seafood pancake with whoever I'm with. One thing I wasn't crazy about was the chicken wings but whatever, I'm coming here for other Korean dishes.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Good korean restaurant in Inner sunset!\n\nThere are two korean restaurants and one kbbq place in inner sunset! When I crave for korean food, I usually debate between manna or this place. I opt for this one if I want to eat korean fried chicken especially because they have more selections of KFC. I've tried all the flavors and my favorite one is hot spicy chicken($11.99 for half). Tbh, there is no difference between mild spicy one and hot spicy one. They taste exactly the same to me..It's gochujang base sauce that is very thick and not too sweet. It's not super good but it's okay here in inner sunset.\n\nMy favorite appetizer is kimchi bulgogi fries($10.99) and this one is really good! Bulgogi is perfectly marinated and fries are crunchy.\n\nTheir stonepot spicy pork and seafood bibimbobs ($14.99) are good. Portion is huge but I wish there is less rice.\n\nTheir both kimchi and seafood pancakes($12.99) are decent. Very crunchy and flavorful!\n\nTheir slow cooked pork($16.99) is okay. I tried it twice. First time it was really good but second time it was all dry and flavorless. I wouldn't get this dish for myself unless I go with group of people. \n\nService is good. Overall, I would be coming back because this one is close to my house.", "author": "Clare L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "The Korean Kitchen was an unexpected experience, partially because it was the backup plan for the nearby Ebisu (SUPER long wait!) and because it did not live up to my expectations with respect to food quality. We were greeted and seated by a very polite hostess. We each got a soondubu and a soy garlic chicken to share. The banchan came quickly and was perfect to get our appetites going. The bean sprouts did not disappoint, although the broccoli was a little bit more bitter than I hoped. However, the soy garlic chicken was quite a disappointment. Much of the white meat portions were so dry and hard, neither of us could even finish it. The wings were a little bit of redemption, but half the plate was left untouched. The soondubu itself was not bad, although perhaps a little heavy handed with the MSG. I was soooo thirsty after finishing, and stuffed because the tofu portion was huge! A little disappointed that they didn't have pork soondubu though. It was a little bit odd that we and the table next to us got asked if everything was okay like five times in the span of 15 minutes, then totally abandoned when we were ready for the bill. All in all, it wasn't a horrible experience, and the price was reasonable for being in such a bustling food-filled area of the city, but I'd much rather just wait for Ebisu next time ):", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Quick Summary\n- Portions are small but it packs volume (especially if you order more meat)\n- Galbi was delicious\n- The tofu in the tofu soup was silk soft\n- Great place to eat when you're hungry but not so much to enter an All-You-Can Eat Restaurant\n\nI was feeling of eating at a Korean Barbecue restaurant for a long time. Unfortunately, I was the only one starving in the family; the rest have eaten a snack or two, so we weren't feeling eating at an All-You-Can-Eat Korean barbecue. \n\nRight across the block we found the Korean Kitchen, which served similar meat as the All-You-Can Eat place, plus it was already cooked after ordering, so it was made just right (without charred burns) The Galbi was tender, fatty, and very delicious! It required minimal chewing, but I did needed a tear when I needed to separate the meat from the bone. If you're not in for oily Galbi like I am, the bulgogi is good too! The meat is lighter and my mother was able to eat it. (she doesn't eat much oily dishes)\n\nWe also ordered the tofu soup (not shown in the picture). I liked how the egg came in separate, so we cracked it in while the bowl was boiling hot. I have noticed that the soup grew saltier as the soup cooled, but I think it was supposed to be eaten when it was boiling. I still liked it because the soup was stuffed with silk tofu.", "author": "Mito I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Hello, \nthe Korean kitchen is a good place to enjoy the Korean cuisine. I have tried several times bulgogi and galbi and I was looking for the same here. The food is delicious, authentic and the portions are big. The service was fast, I ordered bulgogi fries, 3 types of Korean fried chicken. \nEverything was tasty and I will be back.", "author": "Elena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Whoa, what a surprise this spot was. Something comparable to Manna in the Sunset?! Without the crazy lines?! Check. Check. \n\nThe bud and I checked out The Korean Kitchen on a Saturday at 12pm. In terms of the size of their restaurant and overall layout, it's a bit small and a bit awkward. And not even in an oh that's so small and quaint kind of way...a that's so small and cramped kind of way was more like it. And I will say, due to that, service was hindered bc the servers can't get to you! BUT I won't knock on that, bc they did try. I get it. SF is small. Spaces are expensive. \n\nAnyways, on to the fun stuff. FOOD. I'm ALL about the food here. So many places with soondubu. And yet, so many places with TERRIBLE soondubu. AND this isn't one! I tried the soup before even dropping in my egg into the boiling soup...and ppl, it was good. Very flavorful. And sadly, very rare in SF. No one does it right! Then comes the seafood pancake. WHOA, super crunchy and FILLED with seafood. I will say their pancake looked like it was deep-fried vs being pan-fried though? Welp, it was tasty nonetheless. \n\nI'll def be back to try some more dishes in the near future! Yay for more yummy korean food in the Sunset. 4 stars", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Authentic, hip Korean restaurant. \n\nI have been to Manna on Irving and I must say that this Korean restaurant is a fine addition to the area. There's always a long wait at Manna and that makes people hesitant to come here have Korean food. \nCame here with 2 friends on a Saturday afternoon and there was about a 25 minute wait. When we were seated, we were brought banchan, tea, and the menu. The environment was very modern and there were many Korean ads on the wall. They were playing Korean music. \n\nWe ordered: \nJap chae noodles\nSeafood pancake\nBulgogi bibimbap\nSpicy rice cake\n\nOverall, Food was pretty good and comes in decent sized portions. Service was okay, I was worried it would be worse since we were sat near the back of the restaurant. Make sure you check the spiciness of the dishes if you are sensitive to spice. Food was quick to arrive after ordering. Downside is the parking in the area is very limited.", "author": "Jeanette Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Our server is so sweet! She is super attentive and communicative with us. \n\nWe ordered: \n- Galbi\n- Fish cake soup\n- Cheese corn\n- Chicken bibimbop\n- Ramen\n- Potstickers \n\nBe sure if you can't eat spice or spicy food, make sure to let your server know to have the kitchen not add any black pepper to your dishes. Don't say I didn't warn you. \n\nThe wait around 6:30pm on a Friday night wasn't too bad. It was about a fifteen minute.", "author": "Eva O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "When I went to Seoul last year, one of my main objectives (other than watching Starcraft and taking advantage of the cheap soju and nonexistent open container laws) was to eat delicious Korean food. However, everything we had there was just kinda meh, to the point where I was beginning to think I didn't actually like Korean food.\n\nThen last night, since the line was out the door for Nopalito next door, my friend and I decided to go to The Korean Kitchen and I realized once again that Korean food is indeed fantastic.\n\nWe got our traditional Korean beverages (Kass and soju), then ordered a kimchi pancake and the fried spicy grilled chicken with melted cheese. The pancake was okay, it only tasted a little like kimchi and the texture wasn't quite something I was super into, but it overall wasn't bad.\n\nThat chicken tho. , as the kids say. The sauce was deliciously spicy but avoided the \"just make it spicy\" trap; it had a really good flavor to it. The cheese did a great job of keeping the spice under control, and the chicken itself was moist and flavorful.\n\nThis is the best Korean food I've ever had, while my friend insists it's the second-best after some place in NYC. Either way, we loved our time at TKK and will absolutely be back in the near future.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Came here to catch up with an old friend. I decided to come here because I thought I had known the Korean restaurants in the area and I was surprised to see this one. \n\nI had the:\n- banchan: the banchan was good. Average variety. Portions felt small but the waitress did offer to give more if we wanted. I've never had a Korean restaurant be so okay with giving more banchan. \n\n- soybean paste soup: this was really good. I really enjoyed it.  It has a good amount of meat. More than I expected.  It also had some clams and a little baby octopus which I also didn't expect. I really enjoyed it.  They should actually say there is meat and seafood on the menu but it was a really nice surprise! \n\nThe service was really good.  The waitress was so kind.  I was really taken aback by the unprompted  offer for more banchan because usually I get the opposite reaction when I ask for more. \n\nOverall, I think this is my favorite Korean place in the area. It's definitely better than Manna which use to be my go to Korean plance in the area. \n\nTL/DR: The soybean paste soup is delicious and has meat and seafood in it!  It's my new favorite Korean place in the area; it definitely beats manna.  I would recommend it if you're in the area.", "author": "Jon P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "Walked in around 2:30PM and it was empty, but the lady that worked there or in charge was unwilling to seat us because we were waiting on two others. The thing was that it was literally empty and she was unwilling to seat us because I don't know why. Anyways, when we told her that they were five minutes away, she finally sat us down to the table. I ordered the bulgogi stone pot bibimbap and it wasn't super good. The portion was big for the price which was $16.99 I believe, but there could've been more flavor to it. Service was ehh, it turned me off in the beginning already so I didn't really look forward to it being any better during our time there. I probably come back again in the future, but it's almost like your typical Korean food.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Noms. This is a cute little place with soju bottles on the wall. I think it has the perfect atmosphere for lunch/dinner with a small group of friends or a super casual date.\n\nI got a half order of soy garlic chicken ($10.99). I must say, the fried chicken here was very similar to the ones from Korea (but maybe a tad bit smaller). The chicken was fried nicely and it was not overly battered so you can still taste the chicken. I got so full from the side orders that I was able to take more than half of the chicken home for another meal.\n\nOur waitress was very sweet and refilled our side orders once she saw we devoured them. Our water was also never empty. Service was great, although we did come at night (after-dinner hours) and it was somewhat quiet because most people were almost done with their meals. Nonetheless, I'm sure service is just as great when it is busy.\n\nI can't wait to be back to try more things from their menu!", "author": "Julian Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "I ordered the seafood ramen, and it was basically Top Ramen with a handful of prawns thrown in. I would be embarrassed to serve that food to guests. If you're going to phone in a dish like that, just leave it off the menu. With tax and tip I paid $17 for Top Ramen and feel like a complete dope for trying this place out.", "author": "Siobhán K C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-09", "description": "This use to be my favorite korean restaurant in sunset. But recently (I guess with the ownership change), I noticed that the quality changed a rather dramatically... I use to love the seafood pancakes, but now they serve it with some weird fatty tartar sauce (sorry, I don't know what it's called!). It doesn't complement pancake at all, and I would say it actually makes the pancake taste worse...\n\n*BEWARE WHEN ORDERING TAKE OUT: THEY SKIMP OUT ON PORTIONS*\nOne thing that I surprisingly enjoyed was the kimchi bulgogi fries. Aside from it being a tad bit too salty, it was addicting! In fact, I liked it SO much that I got it again for take-out the next day. When I got home and opened the take-out box, I got like two-thirds the portion that I got yesterday! I couldn't believe it! I just paid FULL PRICE for two-thirds.\n\nIt really saddens me to say this, but I will likely not be returning here for my korean food cravings.", "author": "Leesur S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Absolutely supercalifragilisticexpialidocious amazing ! Let me start off by saying that, my sister definitely has a good eye for fantastic restaurants ! \n\nTook my sister here because I promised that I'll treat her like the good sister that I am! First impression when we walked in, atmosphere was pretty festive and the staff all were SUPER friendly! They greeted us all with smiles and sat us down quickly! And they checked on us periodically! Fantastic may I say!\n\nSo we ordered the glazed pork feet (limited amount made each day), fishcake soup, half order of mild chicken wings, ramen, seafood pancakes , and the rice cakes ! As you can tell, we definitely over ordered! The portion size were huge and we couldn't finish it all so leftovers for dinner ! Yummy! My favorite dish was the mild spicy chicken wings ! They were the BOMB.com! It was definitely an amazing lunch and I'll definitely come back! Also super affordable !", "author": "Shirley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Korean food means bimbimbap, bulgogi, banchan, tofu soup, or seafood pancake. I came here since my best friend wanted to check this place out. Personally, Korean food can be on the pricey side even though it is a simple cuisine. I decided to give this restaurant a chance since it was in my vicinity and the mixed Yelp reviews made me wonder which side of the spectrum I'd end up on.\n\n-You can either get a table in a few seconds or maybe the way opposite. Since we were a party of 2, we were given seats fast, but it was at the bar (we didn't mind!). I noticed that the seating area was small.\n\n-I did order the bulgogi bimbimbap, while my friend ordered the spicy bulgogi dish that came with jasmine rice and banchan (side dishes). Both our orders were $14.99 each (no surprise there!). Althought our orders sounded generic, they were both delicious! I loved how they were generous with the banchan, and the ingredients in my bimbimbap.\n\n\nI would come back to try their fried chicken, French fries, or cheesy corn. Parking in general for businesses on Irving are a hassle, so taking the N bus is your golden ticket.", "author": "Erica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "This restaurant is a staple here in Inner Sunset. Whenever I'm craving Korean food, it's either here or Manna. Korean Kitchen always serves a solid serving of bibimbap and soontofu. Their spice level for the soontofu has a pretty quick jump. Levels 1-3 are rather mild, 4 adds a slight kick, and 5 carries that type of spice that builds on itself for a fun trip to the restroom later on. Accompany your meal with a Kloud beer and you're good to go! Service is always timely.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-28", "description": "We got the mild spicy chicken to share. It was pretty good! I liked the fries on this side :P the chicken itself was pretty standard. They were sweet but not spicy enough! But I guess the \"mild\" in \"mild spicy chicken\" is accurate. \n\nI ordered the ramen soft tofu soup for myself. I love soft tofu soup. So I always have very high expectation for it. I can't say that this was my all time fav soft tofu soup but it was good enough. I will def come back for any cravings I have in the future. I tried with spicy level 4 and it wasn't spicy at all so I might increase the heat to 5 next time. I'm not that great with spicy foods. I would say I'm pretty average with spice. So if you normally go for spicy, maybe you can ask for extra spicy!\n\nThe side dishes were really good! I loved the pickled cucumbers and their ripe kimchi.", "author": "Janice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "The roommate and I watch a lot of korean tv shows. At the time, we were watching a cooking one, so we were constantly craving korean food. When Sunday, October 22nd rolled around, we decided to try The Korean Kitchen for lunch. We placed our delivery order via DoorDash at 2:21pm and it arrived at 3:24pm. We live in Outer Richmond.\n\n*Corn Cheese: Sweet corn with melted cheese ($8.99)\n*Fish Cake Soup ($13.99)\n*Galbi Short Rib ($18.99)\n*Fired Spicy Grilled Chicken: Extra Spicy With melted cheese ($15.99)\n*Slow Cooked Pork ($19.99)\n\nI'd been wanting kalbi for some time, so this definitely hit the spot. The meat wasn't too fatty or gristly and the portion was your average size. I adore cheese corn, but for delivery, the cheese ended up a little cold, so it was hard getting that stringy cheesy texture. I also found the corn way too sweet. As if they added sugar to it. The chicken had the same cheese issue. And I didn't really find it spicy at all. I love fish cake, so I wanted to try the soup. It had a good amount of items such as balls, etc. I found the broth in this a tad too sweet for my liking, but it was still tasty. The roommate ordered the slow cooked pork which was one of my favs. The pork was tender and I loved making the lettuce wraps with garlic and jalapeno. The banchan provided was a little lacking for ordering five dishes. We got two small containers with candied sweet potato, cucumber salad, acorn jelly, and kimchee. Good thing we had our own kimchi to supplement our meal.\n\nNice korean spot. I'm glad they had the fish cake soup as that's one of my favorite dishes. I just wish their items weren't so sweet. If you're a fan or pork, I'd say the slow cooked pork is a must! Very tasty!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Stopped here for lunch during our recent visit to the California Academy of Sciences since we were tired of eating museum touristy food.  Only a 5-10 Minute walk which is easy.\n\n'Short ribs were awesome' - daughter.  \n\nTofu was flavorful and they have ramen for my other picky eater.  \n\nHighly recommend.", "author": "LuDogg T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-11", "description": "We came in for lunch on a Saturday. Awesome service and didn't wait long for the food. Great location and ambience.\n\nWe got a whole order of half and half fried chicken. 1/2 plain and 1/2 soy garlic. As you can see from the pic, the chicken pieces were SMALL! They were also over cooked and the breast pieces were dry and inedible. The soy garlic sauce had great flavor but the chicken itself was disappointing. If you don't mind spending $21 on chicken, go for it.\n\nThe kimchi pancake were great too but it was doughy and we couldn't taste the kimchi in it. We ate it either way.\n\nThe banchans were the star of the show. Pickled cucumber was mouth watering, sprouts, etc.\n\nWe'll still come back but skip the fried chicken next time.", "author": "Pam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "This place is amazing!!! I've tried Manna, which is great, too, but can get crowded. I'll continue going there, but if it ever gets crowded or if I want to be closer to GGP, I know where to go. They also have a larger menu selection, but I always get bulgogi which is standard for any Korean cuisine to have. \n\nORDERS:\n- mushroom tofu soup, spicy level 2. They have spice levels (0-5) which I appreciate. ($11.99)\n- corn cheese ($8.99)\n- bulgogi ($15.99)\n- banchan (not an order but worth mentioning)\n\nJUDGEMENT:\n- Overall: huge portions for their prices\n- Mushroom tofu soup. I didn't get it, but my friend did. It wasn't too spicy according to him. He doesn't eat Korean very often so he has nothing to compare it to. I tasted some and it was good. \n- Corn cheese. I really wanted to taste corn cheese. It did not disappoint. I loved seeing the cheese all stretched out. \n- Bulgogi. The last time I went to eat a KBBQ place, I was disappointed. This was the complete opposite experience. Their bulgogi had sesame seeds and vegetables mixed into it. It was tender and juicy and tasty! \n- Banchan. I don't like kimchi but my friend said it was good compared to others. I always love bean sprouts and tofu. They also had cucumber and I think seaweed. I'm not sure. I don't like seaweed so I didn't want to risk tasting it. \n\nSERVICE:\n- Attentive\n- Nice\n\nSPACE\n- crowded, limited seating\n- Love their color scheme\n- There's seating in the back\n- Chairs were't that comfortable. Mine had like a seat hole made by previous patrons' butts. I got used to it though. \n\nOVERALL\n- Food 5/5\n- Service 5/5\n- Space 3.5/5\n\nIS IT WORTH IT?\nYes!!!", "author": "Millissa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "This place use to be a sushi place I recall. I came on a Thursday night around 6PM, there were a decent amount of people, but my friend and I were seated immediately at a 2 seater table. We ordered the corn cheese, kimchee fried rice, and half mild spicy chicken. Ban chan is refillable, though there isn't a lot of items like other korean restaurants.\n\nCorn cheese: SUPER SWEET! it's like they added sugar on it but probably not. The amount was a lot and it tasted yummy with the kimchee fried rice. \nKimchee fried rice: so pretty and actually shareable among 2-3 people. It wasn't spicy at all, and there is this drizzled sauce for some reason made it more better. \nHalf mild spicy chicken: so much meat on it! The pieces are big too. This appetizer comes with fries. It's kind of expensive though. \n\nOverall: worth a try! Food wasn't that oily and everything was sweet. The food came out quick and service is efficient.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "Was so excited to see a snazzy looking Korean place open up in the neighborhood! Went in with high expectations especially off the recommendation of a few friends, but it was most definitely a let down. \n\nIn terms of decor and ambience, the place is super cute and the service is good. But then comes the food...\n\nOverall, the quality wasn't there and seasoning was a little off. As a group, we ordered:\n\n-Chicken wings (half saucy, half fried): the wings themselves came out a bit dry and lackluster in terms of flavor. Wouldn't order these again\n\n-Soondooboo (spicy soft tofu soup): looked great but all kinds of bland! Tasted like they forgot to use salt :(\n\n-Kimchi seafood pancake: just okay. Very average. Some pieces were just the right crisp that you wanted while others were a bit soggy/moist\n\n-Cheese corn: this was probably the best of the dishes; could've been cheesier but always hits the spot :)\n\nOverall it was okay, but disappointing with the hype and good reviews I've heard!", "author": "Jay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "Not a super robust review because I only had a quick soondubu here. You can specify the spice level from 1-5. The flavor was lacking vs. Manna and Korean places I have been to in NYC. They gave a lot of banchan, but some things (fishcakes) didn't seem super fresh. \n\nService was good, but a little slow because the staff is small vs. the restaurant size. No wait though, which makes it great for a quick meal. I'd come back if I had a craving for Korean food and was in the neighborhood!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "We ordered the beef & tofu stew ( ). Standard sized stone pot with a good mix of vegetables, tofu and well prepared beef slices. Asked for medium spicy and they prepared it perfectly. \nThe service was quite nice as well. We were seated in the back area and a little afraid of being forgotten, but the wait staff was very good about checking in on us regularly.", "author": "Abe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "It's a good dinner spot. \n\nI came here on a Friday night and it didn't seem very busy but there was still a wait. I was seated in the back with my friend. We ordered the bulgogi fries, half order of the soy garlic chicken, and the beef tofu soup. \n\nI actually really liked the bulgogi fries! It was sweet and cheesy. I think that there were a little too many fries for the amount of meat/sauce they topped it with, but I can enjoy plain fries. That's not a big deal to me. \n\nThe chicken was a solid choice. It was nice and juicy and the coating of the chicken wasn't too thick. I wish it was a little bit on the sweeter side though. It also came with fries (fry-day was real) and a salad. We left the salad untouched because who are we, gym-goers? \n\nThe tofu soup came with purple rice and an egg to crack into it. I thought that the soup was good, slightly lackluster but still good. I enjoyed the rice because it was chewy and cooked well. I don't think they add as much as other places, like red beans...etc. They only had the white rice and the purple rice mixed in. It was a very high ratio of white rice. \n\nI think the food was good, it wasn't exceptionally amazing, but I enjoyed everything. I definitely had to take stars away for the service. The service throughout the night was good. Something that happened that I thought was weird was that the server gave us our check really early. I definitely know that my friend and I were taking a long time, but you really don't need to give us the check. We took our time regardless but I just don't like being rushed and presented with a check before we stopped touching our food. Maybe next time will be better! If a friend wants to come try, I won't oppose and will happy go with them.", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-16", "description": "I know they recently opened, but I don't think that really should be an excuse for inconsistency or odd service. \n\n-Cheese corn: Taste was there, but definitely not the best out there. When I order cheese corn, I expect CHEEEEEESE corn.. as in, each little tiny kernel is glued to the next little tiny kernel due to the insane amount of stringy, delicious, creamy fatty cheese-ness =)... It didn't happen here.\n-Bulgogi bibimbap: Although I felt portion size was a little smaller than other restaurants, this was delicious... no real complaints here.\n-Dumpling tofu soup: We asked for mild, and this was definitely more than mild. Would have liked a little more substance in here, but other than that, it was okay.\n\nThe restaurant is smaller than expected with limited seating, not to mention the chairs are very uncomfortable?? Is that just us? Haha... ban-chan selection was only 4 plates, and the only one we enjoyed was the kimchi. The spoon that was placed on my side was smaller and shorter than the spoon that my dining companion had. Also, when asked for take-out boxes, the waitress handed take-out boxes to us and then asked if she could take our leftovers away. Um, no, that's the whole reason we asked for take-out boxes???!!?\n\nAnyway, A-OK food, but I don't see myself coming back.", "author": "Kris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "Good spot for late night grubbing and Korean style kitchen! What throws me off a little are the prices which seem kind of above my average spending for Korean food, but if you want a little bit of everything for Korean cravings, this is a good spot to gather as a group!\n\nService was attentive and our food came out at a rapid rate, til we realized we ordered a little too much, but all is well with the world lol. We had a bulgogi craving but the japchae we ordered had a ton of meat on top so if that's your case, save about $10 and just get the japchae. You can order your stews with a certain spice level and I recommend a 3 for what you'd typically get at a tofu house. Multigrain rice on the side was hearty. Enjoy your late night Korean food!", "author": "Krysta M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-02", "description": "I was very excited to try this place but it was definitely a bit of a let down. \nPros: The kimchi is delicious, along with good other side dishes. The wait service was good and attentive. Plus the pot stickers were super good. \nCons: my friends and I got three different types of bibimbap and all of them lacked flavor and spice. Additionally, although the fried chicken was good it  had no spice also.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "When Manna (another amazing Korean restaurant on Irving) is busy, the Korean Kitchen comes to the rescue!! The food is authentic and delicious, the portions are generous, and the service is excellent. \n\nA couple of colleagues and I came by for lunch on a Friday and we were lucky to snag a table for 4 in the front area. It was all our first time at the restaurant, but definitely not strangers to Korean cuisine. We knew exactly what we liked and disliked (but what's to not like about Korean food??!). However, the Korean Kitchen's menu is a bit more extensive than your average Korean restaurant. They had bulgogi fries, 3 types of Korean fried chicken and other amazing menu items! They also offer many types of soup that caught our eye....think fishball soup!\n\nThe menu was pretty creative and extensive, but I opted to remain traditional and ordered the beef bulgogi bimbibap, which is basically a bowl of steamed white rice on the bottom with bbq beef and an extensive array of veggies on top. This also included a fried egg which made the dish even more delicious! My other co-workers enjoyed the veggie bimbibap and the mackerel dish. We also ordered and shared the seafood pancake as an appetizer. All dishes did not disappoint and were quite generous for lunch. Prices of all dishes were pretty consistent with other Korean establishments in the area.\n\nThis place is definitely a contender as one of the BEST Korean restaurants in the Inner Sunset Area! Can't wait to go back.", "author": "La C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-02", "description": "This is a nice place, but lacks a little flavor. I really liked the interior, it was cozy and the music was the right volume. \n\nThe service was good, she visited our table often and our food came out very quickly.\n\nThe food was just okay. None of our spicy dishes were actually spicy and our bibimbap bowls lacked salt. The mandu was delicious and the kimchi was some of the best I've had though! I would return again, but try some different items.", "author": "Kamryn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "The old Korean kitchen can't come to the phone right now. Why? Because she's dead.\n\nSo sad to say this but at our last visit everything was different. The seafood pancake was no longer thick and crispy, it was thin and the dipping sauce was different. \n\nThe delicious fried chicken now tastes slightly different than before - almost too sweet now. Even the Korean fried rice is overly sweet. \n\nThe bo ssam, my favorite dish ever is now just hard pieces of pork instead of the soft, tender pieces I had before. Extra cabbage for the bo ssam is also $2.... \n\nShe's dead guys. I'm so sad.", "author": "A Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "One Cozy Korean Restaurant near the Golden Gate Park..\n\nDecor has a touch of Class. Nicely Decorated..\n\nFood was Good too....True to any Korean Place we eat...\n\nFriends from outside the country Loved this place..", "author": "Donovan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "After a 12k run, my party and I were craving Korean food, and we were not disappointed.\n\nThe Korean Kitchen is a rather small restaurant, and it took a little bit of time for the working staff to seat us, but once seated, we were served pretty quickly. I opted for the Bulgogi Bi Bim Bap in a stone bowl - $15 though (I guess that is SF for ya...). Aside from the onions (personal preference), it was tasty with tender beef and crispy rice from the heat of the bowl. The food stayed warm throughout the meal and was just the right portion after Bay to Breakers.\n\nOverall, pricey for Korean food, but bomb Bi Bim Bap.", "author": "Brandon Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Loved the side dishes here! The fish cake was delicious and they refill it for you upon request. The staff here are also extremely friendly! I got the bulgogi bibimbap in the stone bowl and it was so good! Although prices may be a little higher than other places, portion sizes are huge - lasted me two meals. My friend got the tofu soup and really enjoyed that as well. \n\nWe lucked out and arrived just before the crowds came in (around 6pm on a Saturday). We were offered bar seating if we wanted to get seated immediately, but decided to wait a little extra for a table. Overall, this is a great place to satisfy those korean food cravings. Best of all, this place is at such a convenient location!", "author": "Kris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Why did I just find out about this place ? Originally going to have dinner at Manna and as I was searching on Yelp for \"hot and new\", I came across The Korean Kitchen. I had a good feeling about this place so I ended up changing my mind and decided to go here instead.\n\nPros and Cons\n\nTook us about 20 minutes to find parking, but we also went during peak hours. That's really the only negative thing about this place.\n\nWhat we ordered: \nJap Chae - Oooh lala\nMild Spicy KFC - Amazingly delicious\nSeafood Tofu Soup - Bomb\n\nFood portions are so generous. Service was efficient and excellent and the place is very clean. This might be my new fave Korean restaurant in the city. I would give this place two thumbs up.", "author": "Gwen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Kimchi pancake = MONEY\nTofu = As normal and good as you expect\nFried chicken = i personally don't think the sauced ones are that great but YOU MIGHT LIKE IT\nbut the best...part...and thing...of korean in all of the city....will bee...and more dots.....\n\nBOSSAAAAAM", "author": "Vince L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-16", "description": "With such limited and mediocre Ban-chan this low quality food is over priced.\n\nAt 15.99 the Sautéed Squid/w Vege is very oily and its veggies were unrecognizable.\n\nAt $14.99 the Seafood Hot-stone (Bibimbap) was underwhelming. And, the stone was not hot enough to toast/crisp the limmited rice it contained. I am grateful that I received no attitude when I asked for the egg to be fully cooked, thanks guys.\n\nAnd, at $11.99 the half order of Fried Chicken arrived country style on red & white checker paper with decent fries and a bite of salad. That said, although the chicken arrived heavily coated in a mild/spicy overly sweet sauce the actual meat was far too dry to even eat.\n\nThey're so very many other Korean options in SF; I personally would not return here.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Have lived in the neighborhood for a while, but never came here. Great little spot and surprisingly, the food is great. I don't really understand why it was empty. We ordered Jap chae and Bulgogi and it was fantastic. We will be back!", "author": "Jana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "I was a devotee of their food truck and now a devotee of their restaurant. \n\nTheir staple entrees of bibimbap and soondubu are delicious, but their sides are where they shine and stand apart. I still dream about the umami in their kimchi bulgogi fries and corn cheese. \n\nService is attentive, warm, and genuine.  As a husband and wife team run this establishment, you sense the love and thought not only in their food but also how they treat their customers.  Here you aren't just another number, you are family. Will be back!", "author": "Seira M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "Came here looking for korean fried chicken and unfortunately the fried chicken tasted more like orange chicken. We ordered combination tofu and kimchi fried rice as well. The combination tofu was decent but nothing out of the ordinary. Overall the food was decent but not as good as i expected it to be. \n\nInterior: 4/5\nService: 4.5/5\nFood: 3.5/5", "author": "Victor K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "RECENT CHANGE OF OWNERSHIP!\nVery disappointed at the quality of the veg and mushroom bibimbap, soygarlic chicken. The vegetable bibimbap barely had any vegetable and they charged $12.99 for a few bean sprouts, some sliced carrots, a few pieces of tasteless mushroom, and long-grain rice. The hot stone did not seem hot stone; seemed more like a heated pot with white rice. There was not even any spinach in it anymore. The soygarlic chicken was so dry on the outer layer and the meat part that they could not be swallowed.  All in all, these dishes are vastly different from how the previous owner/chef prepared. Would never visit again.", "author": "Paulette T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Not to be dramatic, but I guess all good things really do come to an end. If some of you didn't know, before the Korean Kitchen took over this location, the restaurant before it was Hanami Brassiere. That restaurant was also near and dear to my girlfriend and I. The good thing about The Korean Kitchen moving in and taking over was that it actually brought with it food that gave me mini orgasms when I ate. \n\n...But since my last climatic dinner there, the Korean Kitchen decided to change ownership. So I say this to you, my fellow humans that will read this post before deciding whether or not to come: \n\nKorean Kitchen? More like Korean Missin'! \n\nLet me just start with the tteok-bokki. First of all, how dare you? I'm sure our waiter had nothing to do with it because he assured us that we were cultured and that he also enjoys his tteok-bokki with ramen in it! You mean to tell me that you simply could not have added ramen to the rice cakes? Ramen. You literally had an entree named 'Ramen' on the menu. Why would you think it would be a good idea to remove that option. North and South Korea didn't truce up for this. I'm appalled. As soon as our waiter said \"sorry, we don't add ramen to the rice cakes anymore,\" I should have said \"I'm calling the cops\" because this is a crime against humanity. Honestly, how could you.. \n\nAt this point, we just hoped to god, love ya Ryan Reynolds, that they didn't do anything different to the fried rice. But just as we were disappointed with the new regime against rice cakes, we were met with another surprise.. Their kimchi fried rice, a meal we once rated as #1 in the Bay Area at this location specifically, tasted like sugar and butter. The kimchi that was in the fried rice actually tasted like cabbage drenched in the sweat of children in PE. It was clear that they didn't even use kimchi in their kimchi fried rice.. Like if you wanted to be sneaky, don't serve the kimchi on the side for comparison. C'mon guys, food crimes 101. And Jesus, whoever cooked the kimchi fried rice, let me ask you something my fellow man: \"Why?\" Jeez you dropped the entire jar of diabetes into that dish. Don't get me wrong, sweet kimchi fried rice is cool. All I gotta say is, I damn near forgot it was kimchi fried rice. I thought I was eating sugar cubes with sweaty cabbage with a sprinkle of rice. \n\nLastly, this is what really broke my heart the most. We ordered the seafood tofu soup. \n\n\"How spicy do you want it?\"\n\nLevel 4, please!\n\n(MIND YOU, this is 4 on a scale from 1 to 5 being the hottest.) \n\nTell me why that thing came out and it tasted like a 0.2 on the gringo scale. I can not believe this. I felt disrespected. I felt dehumanized. I feel betrayed. We paid $13 for this and all that came out was some water with red food coloring and a half-eaten octopus. \n\nI know, I know. This review was incredibly harsh. Just imagine how your favorite customers are going to feel when they come in next time and find out everything is different? It's like that day you found out Obama wasn't going to be in office anymore. I bet you were depressed when you found out how bad it actually was going to get. \n\nEven in bad times, I still saw the good in the restaurant we both once loved. I would have given the place a 1-star rating but I must say, that restroom looked nice. So for that, you get to keep the extra star. What can I say, I prioritize hygiene. \n\nBut please, old owner, if you're reading this.. come back. We miss you, baby.", "author": "Vu N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "I have been coming to this place for the last couple years.  Great seafood pancakes with the bonito flakes and the Korean fried chicken is very tasty.\n\nToday, all the dishes likes smaller and different... no bonito flakes .. pancake with less seafood. Was told they had a change of ownership.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "First time here, but it definitely won't be my last. The food is delicious. Ordered the japchae, kimchi fried rice, corn cheese, and half and half wings. Hands down, favorite dish was the japchae. It was warm and just delectable. The kimchi rice was also very good. The corn cheese was a bit different than what I'm used to. It was extremely sweet, almost as if it had lots of sugar in it. Unfortunately, I was not a fan at all. The half and half wings looked amazing. Chose the spicy flavor and the soy garlic. Boy was the spicy, spicy! Ate one and that was that. Couldn't eat another one. The soy garlic, however, was really good and a bit sweet. Despite a few dislikes, overall I very much enjoyed my meal here.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Great place for delicious Korean food!\n\n1) First Impression\nIt was Monday on Memorial Day around 12:45PM.\nThe hallway entrance was quite narrow in the entrance of the restaurant and there were a few parties ahead of us (a party of 3). Nevertheless, the decoration and overall ambience of the restaurant was nice and consisted of Soju bottles stacked along the wall, along with Korean posters.\n\n2) Wait Time\nIt did take close to 20-30 minutes to get seated, but it was a holiday during prime lunch hours.\nIf you chat with your party, time should fly by.\n\n3) Food & Drinks\nEverything was very good and I was pleasantly surprised by the quality, considering how new this location is.\n\na. Kimchi Fried Rice \n- Not too spicy and great tasting. Must try!\n\nb. Bulgogi Bibimbap \n- Also good! Not sure if it's a must try though.\n\nc. Spicy Pork\n- Not too spicy either (for me), but very nicely flavored. Must try!\n\nd. Seafood Pancake\n- One of my favorite dishes during this meal! Must try!\n\nNot that it really matters, but we asked for water and received tea instead.\nHowever, the tea was rice flavored and a very nice substitute for water in hindsight.\n\n4) Service\nAll the waitresses/hostesses were very nice and courteous!\nWhen we had trouble ordering, she was patient and even added her own insight regarding the specialty dishes. \n\nAs a matter of fact, while we were waiting for our seats, one of the waitresses actually stopped an extremely sketchy homeless lady from entering the restaurant. She chased after the homeless lady halfway through the restaurant and commanded her to exit, threatening to call the police. The homeless lady yelled and threw a bunch of her items on the floor and rushed out. \n\nIt's great to see that the waitress had the courage to confront her and preserve the safety & atmosphere of the restaurant, or else I would have gladly intervened and helped.\n\n5) Pricing\nQuite competitively priced: Menu items were all around 12 dollars or above.\nIt was a bit pricier than I thought, but I believe Korean food is pretty expensive anyways.\nDefinitely worth the value though.\n\nConclusion + Keep in Mind: \n- Parking is extremely tough!!! Take the N or 44 to get here.\n- New restaurant that is definitely worth trying! You won't be disappointed.", "author": "Jeffy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "Food was amazing and delicious! Ambience is warm and welcoming. Service was rather slow, maybe because there were a lot of customers. \n\nFood: we had a party of four and ordered 4 dishes. The side dishes were nothing special, and it came very slow, the same time as our first dish. \n- Mild Korean fried chicken. Really juicy and flavorful, comes with salad and curly fries. \n- Spicy fish cake soup. The color of the soup looks innocent but it's very Spicy! Lots of white pepper flavor. There are variety of fish cakes that comes in skewers\n-Beef Bibimbap. Great dish lots of flavor. Nothing much to say a out this other than it taste good\n-Spicy Korean tofu ramen. Didn't get to try this one but looks delicious.\n\nFood came at a pretty steady pace. The only thing that keeps me putting a 5 star was at the end of our meal we ask the waiter to split the bill and he gave us an annoyed look. Other than that, we had a great time", "author": "Lucy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Update: they had \"bo ssam\" on my second visit here and it was soo delish! The few other restaurants that I've had it at before lacked the freshly cooked feel to the dish. Meaning it was apparent it was microwaved prior to being served but this place is LEGIT. It tasted like my mom's homemade bo ssam. The slow cooked pork belly had just enough fat to meat ratio and was so tender and juicy. It is served with some condiments like cucumbers, carrots, kimchi style radish, bean paste, garlic, jalapenos, and lettuce. \n\nAlong with the bo ssam I also ordered and tried the fried chicken (original and with the spicy sauce) and if I am not mistaken they serve a small portion of fries with this. Whatever sauce they drizzle on the fries are bomb. Their dukbokke (spicy rice cake) was one of the best I've had as well. It is safe to say I have found my go-to Korean restaurant for some bo ssam along with many other dishes. Thank you Korean Kitchen!", "author": "Haena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Girlfriend and I were dying to try this place after seeing it open recently. \n\nYou're greeted by a smiling and friendly staff, Korean advertisement posters, and KPOP playing in the background. \n\nWe ordered the beef bulgogi bibimbap as well as the tofu ramen soup.\n\nThe bulgogi came out steaming hot in its bowl and the tofu ramen was simmering and smelled amazing. The bulgogi was absolutely fantastic, the meat was savory and cooked to perfection. The soup was equally as good; normally I'm not the biggest fan of tofu but this dish changed my mind. \n\nCoupled with the fact that you get a TON of food and really fresh side dishes at an excellent price, Korean Kitchen definitely won a place in my heart.\n\nThe great service was the cherry on top of our dining experience! Highly recommend!", "author": "George K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "I've been here about three or four times, and haven't been disappointed yet! It's a nice Korean/fusion spot on 9th, and I come here, especially if the line at Manna is long. Many times, the service is just okay, but it seems to be that a bit of a language barrier prevents some of the servers from being sociable -- many of them speak in Korean, but seem to be nervous when they speak English (lucky for me, I can order in Korean).\n\nI had the galbi dolsot bibimbap the last time I went, and I'm definitely a fan. The chicken seems to be pretty good each time I went, but I definitely like the bulgogi fries and the corn cheese.\n\nManna is still my preferred Korean restaurant in the area, but this place is a close second!\n\nFood: 9/10\nStaff: 8/10\nAtmosphere: 8/10\nValue: 8/10\nOverall: 8.25/10", "author": "Evan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "Ordered delivery from them via Uber Eats and did not like them at all. \n\nRestaurant kept delaying the estimated delivery time and it took an hour for the food to leave the restaurant and another 15 mins for it to arrive. There's too little bon chon for the order. I ordered 2 galbi and a bimbimbap and only got a very small container of 3 teeny portion of bon chon mixed together. Food was just ok. Will not order again.", "author": "Loretta H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Really good Korean restaurant with authentic flavors! Tried their bulgogi fries, soondubu (tofu stew) and kimchi jjigae (kimchi stew) and what stood out was that everything was really flavorful. Korean places in SF can be pretty pricey but I thought their prices were okay and it was a good value for the price overall. Their tofu stews have 3 levels if you're sensitive to spice, and they refill banchan (side dishes) if you ask. \n\nDownside is that there's only street parking, and it's a very small place! They have a relatively slow turnover and limited tables, so I ended up waiting about 20 minutes to get a table. Food came out quickly once we ordered and the waitress was very friendly though!", "author": "Sara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "EVENT: Just want to go to a new Korean place - ya'll know your girl like new places to eat!!!! Came here with my gf and it's a date!!! Haven't seen each other for agez!!\n\nSERVICE: lovely lady sat us down! Fast service!\n\nFOOD:\n(1) Seafood tofu soup - medium spicy! And so delish! Tons of those calms... tofu medium soft! 4 stars! Crack an egg!\n\n(2) Bibimbap - excellent! Came in a steamy hot stone pot! With rice and tons of stuff \n\n**OVERALL: coming back for the bibimbap & tofu soup!", "author": "Mindy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "Good Korean food. A bit salty, and the Japchae was more like super chewy Chowmein flavored noodles. Seafood pancake was small but had good flavor and seemed to have rice flour in it, which gives it a nice chew. Good prices.", "author": "Rae S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "the server is friendly and the food was okay.\nKimchi fried rice- delicious, but too spicy 8/10\nMild spicy chicken- super yummy not spicy at all if compare to the fried rice 10/10\nThey didn't give us side dishes, maybe we went there around 2:15 and they closed at 3?!\nBut it's ok I still like this cute place", "author": "Khloe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "I have been here twice, and both times I loved the tofu soup. The tofu soup is a lot more flavorful and authentic than that of Manna's. The second time I went I also got the hot spicy fried chicken (half size is 6-7 pieces). It was not super spicy, and the flavor was well distributed except for one larger piece I had. I was surprised that our fried chicken also came with curly fries and a small pile of shredded lettuce/corn/salad dressing, which was probably what filled me up so!\n\nThe downside to this restaurant is it is small and understaffed. Both times I came there was no wait in getting seated, but my bf had some trouble getting the server's attention a few times because they were busy attending to other tables. The food comes out quickly, so hangry people - have no fear! It just may take some time to get started ordering, get a glass of water or additional sharing plates. I will come again, but not when I am in a rush.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "went here saturday night with the hubby before the San Francisco Deltas game. This used to be a sushi restaurant which was pretty decent too. It's def different owners and not a re-invented concept. Service was pretty good but I felt like it took a minute to get the food though. They have a good number of choices for Bibimbop and Soondobu but otherwise menu is limited. It's already changed since opening too. I wanted the steam egg which they used to have but its gone for some reason. We got the below:\n\n1. Veggie BiBimBop - i got it without rice and it was pretty good. a nice variety of veggies and a nicely poached egg\n2. Kimchee soup - ok this was legit really really good but wasn't spicey at all in my opinion\n3. Bulgogi Dolsot BiBimBop - hubs really enjoyed this too. \n\nAs far as bonchons, only 4. I'm not sure what is up with korean restaurants in SF and like 4 bon chones. However, they were really good. My fav was the seaweed mixed with radish and the Hubs really liked the cucumber but could have gone without the fake crab. \n\njust wish they had a more extensive menu. will be back", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Ordered the spicy fried chicken and  ramen.\nThe spicy fried chicken was good. It came with fries and coleslaw. \nThe bowl of ramen was good, but I'm disappointed it's not spicy and I chose it's highest level of spicy ness.", "author": "Kristi A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "Highly not recommend this place. Worst experience ever.\n1. foods were decent....normal Korean food. a little too sweet for me.\n2. charge 20% tips for a group but provide very bad services.... seriously?\n3. one of the waiter was rude\n    - bad attitude\n    - didn't tell us there is a 2hrs dine in time limit and expect we all know!!! \n    - when we asked him to store the cake, he didn't say anything. when we told him please clean the table and bring our cake, he didn't say anything. Until we asked again after 10 mins, he suddenly said we already passed the 2 hrs dine in the time limit (which no one had told us before and I didn't see any sign saying that). The waiter didn't say anything until we passed the 2 hrs time limit and try to force us to leave and refuse to serve the cake...that was very shady.\nAfter I keep telling him no one told us any of these rules otherwise we will make sure we leave within the 2 hrs. He also said usually busy restaurant doesn't serve the cake which none of us had that experience before plus I don't see this restaurant was that busy. after going back and forth, he said: \"I am busy now so I will get back to you after I serve other tables...\" WTF? Is it because we already paid the bill plus the mandatory 20% tips and we are no longer your customers and we are still sitting here? \nSeems like he wanted to just ignore us so we asked the other waiter about the 2hrs limit time and why can't let us have cake. The other waiter said they do have 2 hrs time limit but they do serve cake so he gave us plates to eat the cake. \nIf you told us about your time limit when we sit down which most restaurants will do that, we have no problem with that even we think the rule is a little bit weird since it is not a buffet restaurant. How can you expect people all know your rules and treat the customers like this? \n\nI am sure there are a lot of better restaurants out there...Sorry, I won't go back for sure.", "author": "B B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "3.5 stars.\n\nI first discovered this place while walking by looking for a dinner spot. However, the line was long so I decided to come back another day to try it since I love Korean food.\n\nWhen I got around to coming here for dinner with a dining partner, the wait was pretty short but it was after the dinner rush. The front section has 6 bar seats and tables for 2-4 people. It looked like there was a small back section for big groups. We sat at the bar and it's a tight fit. \n\nI love banchan and this place had really good banchan. We were given five kinds, including one I never had before. You can get refills!\n\nFor my main, I had the ramen tofu soup. It came with a raw egg and black/purple rice which was different from the usual white rice. The soup was nice and hot but not great so I don't see myself getting it again.\n\nMy dining partner had the veggie bibimbap and he said it was good.\n\nWe shared the spicy Korean fried chicken which was disappointing. It tasted more sweet than spicy. It came with fries and cabbage though so it's a good amount of food for the price.\n\nOverall, the food was not great, but I'd be willing to come back to try other options and for their banchan.", "author": "Venna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "A new Korean restaurant in the neighborhood? Had to try it out. To cut to the chase, I'd stick with Manna if I was you. There was a wait for us on a rainy evening, but it was quick. The starting dishes they serve were just okay... I think Manna's is better. The food was also just okay. One of us ordered the mackeral and it just came with mackerel and rice. No veggies. Eh. \n\nPrice was it wasn't worth it, especially with Manna being not that far. I'm going to stick with Manna, but I'm glad I tried this place.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "With today's restaurant culture, the bar is set to near impossible standards with high expectations in San Francisco. So with that being said sometimes I look for three things when I feel like having just a relaxing meal with friends which I believe Korean Kitchen provides:\n\n\n1.  Delicious plates prepared fresh with simplicity. \n2. A genuine San Francisco hospitality created by staff and owner \n3. Moderately priced menu where both the customer and staff feel comfortable. \n\nKorean food is fucking delicious and continuously growing with inspiration through cooks putting there own stamp on what they feel is delicious, nobody ever wants a bland kimchi fried rice! \n\nSo in my humble opinion Korean Kitchen does everything right leaving you with a feeling that you want to come back. I love it! Definitely in my top 20 favorite spots In S.F.", "author": "Breyan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "I had a large party and the waiter asked us \"that's all you're ordering?\" Then told us everyone needed to order something. Problem is, some of the dishes we wanted were definitely not designed for one person; they are priced to be shared. We were already at an average of $15 per person of the grand total.\nThen the waiter told us, \"You're taking up tables. We have people waiting outside. Everyone needs to order something.\" I have never seen this kind of service, or lack thereof. Needless to say, we left. Funny thing is, there wasn't even a line outside.", "author": "Austin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-10", "description": "First time here and I ordered the following:\n\n-Fish Cake Soup (soup were little salty but tasted OK and all the fish cake were just OK)\n-Seafood Pancake (Very good if they can add a little more salt for the taste / w/ Dipping sauce  mild spicy oil)\n\nThe servers were very friendly :)", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-20", "description": "I had high hopes for this place but was a bit disappointed. Everything looks the way it's supposed to & the price was okay and then I have the food.  I don't know if it was the intention, but the bibbinbop and bragogi was overwhelmed by the respective sources so the underlying ingredients could have been anything. Maybe it's a chain store thing & the employees just work there & don't care much about the food.", "author": "Leung T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "We first went into Pacific Catch next door, but even though most tables were empty, they made us wait for a table. The longer  we waited, the more the Korean Kitchen (we had walked by) sounded better and better.  Up and outta there, and so glad we did.\n\nWe were seated right away, and the service was great. They brought out four banchans \n\nWe had a seafood pancake, kimchi bulgogi fries, spicy pork  Bibimbap on hot stone  and mackerel.  Everything was really good, The portions were so huge!  We ended up taking a lot home\n\nWe then walked to Goldn Gate Park and toured the The California Academy of Sciences for our biannual free visit", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "What a great find! The staff is really nice and tend to your needs quickly. Since it's a new restaurant the place is really clean and neat. This place definitely left a good impression on our palates. \n\nThe food was fresh and really good. I really enjoyed their Korean pancake to start off the meal. It wasn't too doughy and just the right amount of spice. I also had the bibimbap which was also good. I am a true believer of balance when it comes to bibimbap and this place knows balance. The rice to veggies proportions was just perfect. We also had the galbi and as a Korean myself, let me say, it was delish!! My hubby really enjoyed it too because it wasn't too overwhelming and was cooked to perfection. \n\nIf I can describe this place in one word it would be balanced. Food is about balance and this place had it. We definitely will be coming here again when we are in town.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "Came here tonight with my family. We ordered a bunch of food:\n1)short ribs on hot stone\n2)bulgogi bibimbap\n3)mackerel on hot stone\n4) chicken wings (sweet and plain) with french fries and coleslaw\n5) cold pork with lettuce wrap\n6) korean pancakes\n7) sweet and spicy squid\n\nMy favorite of all was the mackerel and cold pork. All the flavorings tasted great. My family really enjoyed it. The portions are a bit small compared to other Korean restaurants, but this place isn't necessarily expensive. The service was pretty good, since we arrived an hour earlier than our reservation, and they still seated us within 10 mins (granted its a Monday night). My parents enjoyed the food as well, saying that the sauces they used goes well with the food. My fiance liked the plain fried chicken the most, because it was fall off the bone tender. For us six people, the bill came out to be roughly $140, and they added a 18% gratuity charge. The servers were nice, came multiple times to check on us, and refilled the tea, and the 4 side plates that were provided.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-02", "description": "a simple fistbump or \"yae-eee-yeh-iiiiiie!\" would've sufficed\n\nfunny bc the split second they heard i look part filipino it exploded...\n\nthem: \"boracay [etc etc etc] were so beautiful!\"\nme: \"idk i never went to the philippines...\"\n\nthem: \"and the huge mall!\"\nme: \"i... yeah idk.\"\n\nthem: \"salamat po!\"\nme: (uhh)\n\nthem: \"we can show the pacquiao game!\" ::punching the air::\nme: \"??\"\n\nTHEN AGAIN when i run into q2 blondechicks i typically start yodeling, driving on the left side of the road, and i can no longer dance ooosnapwth ;p\n\nso i'm not hatin\n\n(^_^) Soy Garlic Chicken $10.5\ncould be less sweet more garlicky\n\n(^_^) Kimchi Pancake $10\ncrispy fall apart type\n\n(-_^) Mild Spicy Chicken $10.5\nsuper sweet bring epipen jk\n\nbut honestly just leave the ligo sardine cans baby jebus statues n banana ketchup at home\n\n3 seating areas: FRONT 4 2tops, 2 4tops, 6 bar; BACK summsumm; PATIO coming soon\n\n3.5 stars fun times maybe 4 after try more dishes #fighting !\n\n* empty a green bottle you get to draw / sign it then they put it on the autograph shelf *", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "There wasn't a wait to be seated, but it did take quite some time before our waters were delivered. \n\nThe food itself was delicious. I ordered the garlic wings, and there were just enough to be perfectly filling. The fries were also amazing. \n\nAll in all, I would absolutely return.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "By far, the best Korean restaurant in San Francisco. The decor and atmosphere are nice and welcoming, plus they have a back patio that they're going to refinish.\n\nThe pancakes are delicious, and perfectly crispy. Japchae and the bibimbap were spot on. I'll definitely be back, and recommend that you go!", "author": "C P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "I'm going to give this restaurant the benefit of the doubt that their service will improve over time.  They haven't been open long, and they seem to still be working out the kinks in terms of managing turnover, seating, managing the wait list, etc.  The wait was long despite open tables, my party was skipped over, etc.\n\nFood: We ordered the seafood bibimbap and the bulgogi.  Both were good.  Neither stood out as fantastic.  The banchan was better than at a lot of Korean places in the city - in particular, I thought their kimchi was well-balanced.\n\nWe didn't order the anju/junk food type food - Korean fried chicken wings, kimchi/spicy fries, pajeon (pancake).  To be honest, it looked like that might be the food to order here.  It definitely looked and smelled great, but we were trying to be a little healthier than that.\n\nThe adult beverage options are limited to Korean beers (OB and Hite) and soju.  Would love to see them add wine and some non-Korean/microbrew beers to the menu.\n\nService: It was slow, and as noted above, I assume they will work out the kinks.  If they don't, I will be less inclined to return.\n\nAmbiance: It's nicer (and cleaner) inside than a \"hole in the wall,\" but it's still very casual w brightly lit dining areas and cheerily painted walls. \n\nQuality/Value: The servings are generous, and the prices are reasonable, possibly lower than average for similar fare in the city.  \n\nOverall: I'll go back to see if they improve their service, and I will probably try the more fast food/junk food options.  It's in a great location at 9th and Irving, and is more spacious than Manna down the street.  The food is solid for the price, and it's nice to have another Korean option in the hood.", "author": "Sara E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "If you've never been to South Korean \"joo mak\" or late night watering hole with spicy Korean food in Korea before, check this spot out. Much of the grub served here are to be eaten with plenty of alcohol. I think if you are only going to come here for the food, you're going to the wrong place. \n\nWho wouldn't want a refreshingly fruity soju that pairs nicely with a yummy spicy dish of rice cakes or a licking your fingers good soy glazed fried chicken? \n\nSince The Korean Kitchen's only been open for a few months, I've gotta say the curious hipster crowds are definitely into this spot, while the native SF locals aren't really digging the small portioned fried chicken dishes and expensive bottles of soju. We saw one family split before the food even got to the table. Like, how are you gonna sit a family of 4 who have 2 small kids at a bar? Really? Obviously, ya don't know what a \"family\" seating is. Table or nothing. \n\nE X P E R I E N C E:\n\n\n10.99 for a bottle of soju or flavored soju (pineapple, grapefruit, or peach). Expensive! I can get a good bottle of the same thing at a Korean market for $3! \n\n11.99 for a half or 20.99 for a FULL SIZED game hen. They say its chicken, but the meat was drier than usual. We were unimpressed. To top it off, this dish came with a handful of crispy fries and a shredded cabbage salad w/ mystery dressing. \n\n12.99 Seafood Pancake w/ bonito flakes. Decent. Maybe the only appetizer that really tasted good to me. \n\n8.99 Corn Cheese. This would've been more enjoyable if we had spoons. This didn't faze me too much since my chopsticks skills are quite pro, but I can't say the same for my buddies. \n\n12.99 Mandoo (dumpling) Tofu Soup. Seemed like the dumplings weren't fully cooked after it got to the table. Korean soups like this generally come to your table bubbling hot, yet I couldn't hear the familiar bubbling sound, so I figured someone messed up. \n\nBan Chan. Shredded kimchi where its too salty to distinguish that its really a kimchi. More like wet salty pieces. \n\nS E R V I C E: \n\nAttentive, but slow. Food came out at a moderate pace, but it felt rushed at some point. Since the spot was beginning to fill up, they would dump the check on you before your main course came out. Very Korean, except by American standards; its rude as $hit. \n\nOverall, the hype here was the flavored soju and some decent snacks. We came here twice (one for lunch and one for dinner) to evaluate the service and food quality. It was the same for both, so we decided we're not going to come back after this (or maybe in 5 years).", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-25", "description": "Daughter brought home her leftover bibimbop and it was delicious. So I ordered online for delivery. Just found out if you ate at the restaurant, there's an option to order it cooked in the clay pot. The main thing about this dish for me is the crispiness the rice gets when cooked in the clay pot and the flavor. Online order is just plain rice with the ingredients on top. I wished they would specify that on the delivery app. I was so disappointed. Not everyone knows there's 2 ways of serving it. It was very bland.", "author": "amanda t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "As a Korean American I'm pretty picky when it comes to Korean restaurants. This place is pretty decent. I came here with a group of friends, expecting it to be a typical Korean pub style. It was pretty bright with all the lights turned on and more like a restaurant, which is honestly appropriate as it's next to all the other cute restaurants on 9th. \n\nAs for the food, I recommend getting entrées that have kimchi as the main part, such as the kimchi pancake and the kimchi fried rice. They were both reallyyyyyyy good and def my fave. My friends got the tofu soup and it didn't look that good to be honest. It was also way spicier than they requested.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "I looooove this place!!! So happy to have stumbled across this new korean restaurant in the sunset. their food is so flavorful (their banchan is BOMB, really hard to describe how fresh and pack full of flavor it is). Ordered their half half garlic soy sauce and spicy wings (perfect crispiness and sauce), their seafood pancake (the only thing i was disappointed with, it was a lot of flour and no seafood???), the kimchi soup (SUPERFUL FLAVORFUL and lots of meat+good bits), and the pork feet (passable, wish it had more flavor). My new favorite korean placeeeee", "author": "Iris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "Great food and service. Bit of a wait ok Saturday night but expected. Kimchi pancake also good. Sauces excellent. More ban chan would have topped up to 5 stars. The grapefruit soju was perfect. Btw what type of rice was that?", "author": "Lara D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-05", "description": "Previously occupied by Hanami and other failed Japanese restaurants, The Korean Kitchen is a nice addition to the 9th Avenue block.  \n\nKorean food is unfortunately quite subpar in San Francisco, and The Korean Kitchen is one of the mid-tier options that offers the standard pancakes, bibimbaps, soups, and basic BBQ options. I like the kimchi pancake and the kalbi is not bad, but otherwise The Korean Kitchen is just ok.\n\nIf you're in the area and have a craving for Korean food, it's quick and cheap, but otherwise I wouldn't go out of my way.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "i love this place!!!!! I ordered it through grubhub several several times and every single time i love it more and more. Seafood pancake, portions are HUGE and also, they actually have SEAFOOD. Not those frozen kinds, legit big seafood. \n\nI tried their bean paste soup, super good, they add clams so soup is a whole new level!\n\nHonestly, there are a lot of korean restaurants in sf, but everything i tried here tastes super fresh, and well made. \n\nGoing to order from here many many more times.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "The best Korean food in SF so far.\n\nBanchan (side dishes) on point. Galbi has premium cuts of meat. Decent mild spicy chicken wings.\n\nPleasant service.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "The food was not stellar, but good enough that I'll give this place another try.  The seating order was a little screwy... some people who arrived after us got seated before we were, even though our names were on the board first.  When we finally were seated, we were escorted to the small back room, which definitely lacks the ambiance of the front of house area, which I can deal with. The real reason I knocked off one star was because a small, rambunctious child was being tended to by a babysitter (obviously being the child of the owner or an employee), and made a huge racket the whole time.  It ruined the whole dining experience. That could have been a random incident, but I sure hope that isn't a regular occurrence.", "author": "astrofisica m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "I've gone here on two occasions and enjoyed the experience both times! The first time my friend and I ordered kimchi fried rice, Dumpling tofu soup, and the seafood pancake. We shared the three dishes and they were super filling and we took home leftovers. The second time I went with a different friend, we got the same thing along with spicy rice cake, and I was happy to find that there was fish cake in there as well!! I will say that the seafood pancake is pretty crispy, which my friend didn't really like but I thought it was good. However if you eat a lot of the spicy dishes..along with multiple crispy pancakes...your throat might hurt a little!! (Experiencing this right now, but that's on me) Yeah...there were 4 dishes between the 2 of us and we definitely didn't finish. Which is surprising because our standard is three dishes every time we get Korean food and we order pretty much the same thing at any Korean place, but I would say Korean kitchen has very filling portion sizes. I'd recommend everything! Also, the staff are very sweet and hip :)", "author": "Melody Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Yes this place is worth the wait. Food is amazing. Service is great. Kim Chee fried rice was bomb & so we're the short ribs.", "author": "Mika S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Imagine if you will, a Korean bistro. This is how I would best describe it here. Super small place with smallish menu. You're not gonna get full blown Korean everything, but they offer some greatest hits. Makes sense when you consider the smallness of the space. \n\nWe have to go back to work our way through the rest of the menu.\n\nPro tip:\nPut your name on the waitlist at the end of the chairs . Eventually, someone will call your name to sit.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Get the japchae! It's hella good!\nI usually don't like kimchi but all the stuff we got paired really well and the kimchi itself tasted great. Legit korean food. Glad we went here (even though we hesitated at first).", "author": "Paula Isabel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Went back the other night for bulgogi chicken and it was Amazing! Reasonably priced for a big portion. Super tasty, will be back!", "author": "Dana J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-13", "description": "had a really bad experience with this place this weekend via Grubhub.  First the order was SUPER late.  Now in the defense of the resutrant they did try and call to tell me but the claim of \"traffic\" was kinda BS as I checked Ways and Google Maps.  Whatever, when they did arrive they ignored my clear instructions to \"Hit [my apartment number] on the call box\" and be buzzed in.  My Husband went out to see, couldn't find the delivery person and then had to come back and call her and go out again.  THEN the food made me sick.  Like really sick.\n\nSorry but I am never ordering from here again.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "First time here and will definitely come back! Service was great. Place is very clean and foods were amazing! We had spicy pork and slow cooked pork (bo ssam). They both were 5/5 stars!! I left this place few hours ago and I already crave bossam again!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Friendly waiters. Good environment to eat with friends and coworkers. Close by golden gate park. Didn't have to wait too long to sit and get our food. Definitely would go back for more of their Kimchi Fried Rice! The spicy rice cake is super good! But if you're NOT a spicy person, WATCH OUT!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "One of best Korean restaurant in San Francisco, period! Their korean style fried chicken is best of the best, I assure you. Reasonable price, friendly atmosphere and servers and nice owner(this is mom and pop restaurant). Go try for yourself", "author": "Kwang Hee Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "eck, another disappointment for korean fried chicken. its soggy and the flavors are off. \nalso got kimchi fried rice. this is even worse and just bad.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-02", "description": "Manna was closed, so I decided to check out this new spot which was pretty close by. Oooo another korean place!  My thoughts .....\n\nTofu soup - My friend and I both got the seafood tofu soup and there was a great amount of seafood in it.  However..... the shrimp was really undercooked/not cooked at all.  Trust, I tried to dip it in the soup and keep it submerged, but the shrimp was still translucent in color and I didn't want to risk it.  I told the waitress and she offered to cook the shrimp for me, but at this point, I was kinda over it.\n\nSeafood pancake -  loads of seafood, but also loads of batter.  the ratio was not too even and i felt like i was eating a lot of batter the whole time. =/   \n\nOverall, the food was really mediocre and I would probably not go here next time.  The waitress was really nice and I appreciated her gestures, but overall, the food was just not up to par.", "author": "Josie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Newer neighborhood spot that opened up! Been here twice. I liked the bibimbap here! Stone pot always. :) get the purple rice for sure. The veggie to meat to rice ratio is perfect for me! The side dishes are somewhat basic, not more than the usual Korean spot, and their service was friendly and fairly attentive. Last time I went here I got the Korean Fried Chicken, but it wasn't exactly what we expected. We honestly thought we were going to get wings (like the picture), but we got a mix of fried chicken parts haha. We know now for next time haha. Grateful to have another solid spot in the sunset! See ya again soon, Korean Kitchen!", "author": "Mariel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "Good food. High price. $96 lunch for five orders with water and only one soda. Good service. Bad taste left in my mouth from them automatically adding a 20% tip and then giving a credit card receipt not showing the tip was already added and highlighting a line to add an additional tip. Nice to try once. Wouldn't go again.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "The food was great - tasted like homemade food with great fast service.  We had Galbi, Spicy Pork, Mackerel and Fish cake soup. Portions were more generous than I had expected and everything tasted really good.  We don't live here in SF area but I'd definitely come back when I'm back in the area.", "author": "judy c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Absolutely loved this restaurant. Would highly recommend and surprised that there wasn't a line out the door. We were seated immediately. \n\nFood: Plain tofu soup, Spicy Fried Chicken\n- fried chicken was authentic/juicy/flavorful/meat-falling off bone, wonderfully presented, better than San Tung\n- tofu soup was delicious, just spicy enough, they gave you an egg to break into the soup\n\nService: \n- Very friendly and attentive staff\n- food came out quickly\n- they even provided towelettes to wash your hands after the chicken!\n\nAtmosphere\n- Clean, well decorated and well lit\n- there are only a few tables so the restaurant wasn't too loud", "author": "Yaya W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-24", "description": "We returned with friends for a 2nd try and shared dishes family style. This time we sat in the rear dining area.  \nThe wait staff seem inexperienced and not very customer oriented. We tried:\n1. Whole fried chicken. Overpriced but very good. $22 you get brined chicken mostly white meat with a nice crispy crust and the meat was moist. I would love to order this again but not for that price. \n2. Kim chi fried rice again. Hubby couldn't even eat 1/2 of it as he got full. The rice this time was not soggy nor over cooked.  It was better but I still wouldn't order again.\n3.  Chicken bibimbap hot stone bowl was so much better than the cold bowl but the beef one had better flavor than the chicken. \n4. Mushroom tofu soup. Such a small bowl for the price. I liked the plain tofu one better. \n5. Beef short rib bibimbap. Very little meat. Six small pieces of rib. Would be better to order the meat separately.  I took home the rice as leftover. It was very good with lots of veggies, rice and chicken.  \n\nWe were still eating and the waitress would leave the tray with bill. As noted by another Yelper, this is rather rude since we were still eating.  Hubby says we're not going back anytime soon. I found some dishes tasted too sweet.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-23", "description": "I would give a zero star if I could. This place has horrible service. We were a party with 2 adults and 3 little kids. We went to Korean Kitchen for lunch, but had an ealy dinner reservation later in the day at a different restaurant. We ordered 3 entrees to share family style. The waitress asked us to order 1 more dish because we have 6 people. I told her we only have 5 people and one of them is 3 years old. So she says ok. Then when the bill comes, they automatically added a 20% tip. What are they smoking? This is not a fine dining restaurant.", "author": "T Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "Passed by this place a few times, and the line was out the door. So, I decided to see how it was.\n\nFour stars for service. They look after you pretty well for an Asian restaurant. I'm taking off one star because the food just wasn't worth waiting outside in the cold weather. The food is just ok...not the best, not the worst Korean food. Flavors were just kind of bland.", "author": "Rachelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Eunice (the manager/owner) and the Chef were very accommodating, allowed me to come up with my own dish (Sautéed Chicken, instead of Squid) with vegetables cooked and served on Iron Skillet. Great banchans/sides (Kimchi's and such). Phenominal service by Carla and Roy.", "author": "Rawi M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "Not good. I hate to come down too hard on what I assume is a family-owned business but if the purpose of these reviews is to help others to choose where to spend their hard-earned money, then I have to do it. Poor ingredients prepared poorly. Bland, colorless flavors, even for this middle-aged white guy. If you're trying to choose between this restaurant and any other restaurant in the Sunset, choose the other one. On the positive side, the service was very efficient.", "author": "Craig K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "My party waited 40 minutes for a table even though we were told a 10 minute wait. When available seating opened up at the bar they refused to seat my party of 3. Yet another walk in group comes in and is allowed to take the bar seats, despite my party waiting over 40 minutes. \n\nTerrible service.", "author": "Robin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "We ate here again and I had bulgogi bibimbap, it was heaven.  Beautiful, the gorgeous vegetables had the right amount of crunch and their color was enticing, the perfect egg on top, the meat perfectly seasoned... Sigh. I can't wait to go again.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Eunice is the BOMB, and dem wings?!? What even are those?!?! Soooo GOOOOOD. Easily one of my top three in San Fran.", "author": "Kyle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "The food is super yummy and the price is reasonable. Pretty sure will come back again.", "author": "Shuyi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Wonderful food! It's a great place to enjoy some Korean comfort food! The service was great! 4 of us had pork kutsu, kimchi fried rice, beef tofu soup, spicy fried chicken and spicy pork. We were so stuffed with leftover! The beef soup was very flavorful and the spicy chicken was cripsy with a good spiciness to it. The chicken came with some fries which were cripsy outside and soft inside. The owners used to own the food truck Bobcha and now we can enjoy their yummy food with comfort seating. Glad we went!", "author": "Ping T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-16", "description": "Food is fine. Good customer service. However, the bill is awful because the restaurant add 20% tip without your willing. When the tip become an automatic thing?? And it is 20% now. Also, it is asking for the gratuity on the bill. This is a double tip system. Watch your what you paid for!!!", "author": "Ray J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Have eaten here three times in the last two weeks, and absolutely love the place.  Have had the Ramen with bulgogi and tofu soup and the broth is rich and hearty, not watery, the noodles firm and not mushy, the bulgogi is tender and sweet, and the ramen comes in a variety of spice-heat levels from \"non-spicy\" to \"very spicy hot!\"  Ramen with bulgogi is $13.00 so on the high side, but not unusual for good Korean food.\n\nAtmosphere is informal and the interior design is clean an  pretty modern.  The service is really good and friendly.\n\nTook a star away for the music - Music leaves a bit to be desired, too much teeny bopper pop and not enough cool ambiance groove beat or house.  \n\nBut the awesome food makes up for a lack of groovy music!", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Tried this new Korean restaurant that recently opened in the sunset and I think it is one of the best Korean restaurants in SF. They serve traditional AND street food Korean dishes, which is rare to find in the city. We ordered the seafood pancake, galbi ribs, and dokbukki. All dishes were fresh, delicious and well seasoned. The pancake dish was extra crispy, which made it so good. The prices were affordable and the place inside is very clean and comfortable. oh yeah the service was very friendly and attentive. \n\nI wish they will offer delivery service soon.", "author": "Violet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Decided to check out the new spot in the inner Sunset. I have to say the flavors were amazing... everything was so good! We started off with the Mandoo (pot stickers)... they were off the charts good. The sauce was a blend of spicy and sweet... when you mixed them together... WOW! There were little plates like samples of tasty treats to try, kimchi, cucumbers, fish cake, potatoes. .. etc. Yum! also had the Tofu soup with mushrooms... I couldn't believe how creamy the tofu was and the flavors were on point! The rice looked like it was mixed with  blackbeans... really yummy, and paired nicely with all of the dishes. We also had the bulgogi. .. delicious...the portions are great for at least 2 people. My absolute favorite was the short ribs... out of this world! \nAll in all this place is awesome... a definite must try!\nWe will be back for sure!", "author": "Shannan J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "I love korean fried chicken but this place was disappointing. Sauces were fine but they give you terrible chicken parts that are not fresh. You can taste how old it is when you bite into it. Also, their fried chicken prices are just too much! $24 for measly amount of chicken parts? No thank you.", "author": "Han L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "Over priced and small portion for a whole chicken for $20 but it looks like only half chicken served?  I understand  since they probably have to pay lots money for leasing the space?? \n\nNot many side dishes and no flavor.  Galbi was way way too sweet and again 6 or 8 pieces for $17?  Really? \n\nI am a Korean and this restaurant is not good! If you don't know anything about Korean food?  You may think they are okay??? but still over priced?? \n\nThe staff was sweet and attentive.", "author": "Ichi Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "The food here was pretty damn good. Had the KFC in regular and mild spicy, it wasn't dry No complaints about the Kimchi fried rice. Spicy pork was good. Service was super attentive. And the restaurant just looks good. I need to go back to try more items", "author": "Joey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "Sorry to say, if for food, I can give 3 to 4 stars. But after experienced the bad service today, I have to rate this place down! This is just a normal Korean restaurant like any other ones I went to! The food was not wow nor it was rated Michelin that so many people waiting! They did not info us about their policy of 2 hours limited dining time for a party until we done paying the bill and asked for table clean up and plates for our friends' birthday cake! They are almost like \"kick us out\" by just brought out our cake and left there and want us to leave after they took our bill and the 20% tips! So if anyone plan to have Birthday dinner here, please be aware their \"expected us to know\" policy of 2 hours limitation and they can kick you out once you exceed 2 hours! When we exited the restaurant, we see no one waiting for their table, so all I experienced is we were not welcome to be served here and I don't think they deserved that 20% tips! Plus, if they could serve quick and informed us about this policy when we entered, our party won't exceed this 2 hours limitation!", "author": "Wendy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "After reading all the raving reviews, we planned on going to Manna, another Korean restaurant on Irving. However, it seems like they cater to mostly couples or 2 persons. They had 7 tables for 2 persons and only 2 tables for 3-4. We had the 3 of us, and it was painful to see parties of 2 that were lower on the wait list be seated before you, especially when you have a hungry child.\nAfter having see 3 parties of 2 be seated while you are stuck in limbo, we decided to just find another one of the great restaurants on Irving. We didn't stumble on a great one, but instead, an awesome one - The Korean Kitchen!\nThe Korean Kitchen has a far nicer ambiance than Manna (woohoo!), plus plenty of seating for parties of all sizes. I am no Korean foodie, however the dishes looked just as good or even better than Manna. *Can you tell we were so happy we didn't make it into Manna? Lol!*\nWe had the Kim Chee fried rice, Galbi (nice cuts, not the fatty ones), half fried chicken (deep fried light and crispy), Jap Chae (YUM!), and our daughter ordered a ramen with bulgogi. Every dish was excellent. Not to mention the little condiment dishes with rice that first comes out - great taste teasers!. Roy, our server was super helpful and helped make our dinner very enjoyable.\nOf course for any restaurant on Irving, finding parking is an issue. However, once you do park, you will be happy with the many restaurants to choose from. For Korean food, go to The Korean Kitchen!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "This was our first time dining here. And they had a long line. You can't just seat at the bar. You must wait to be seated. Space is limited to 45 seats. Monica was our server and was very nice . She wondered why we asked for her name. I always like to know my servers name . I'd like to address them by their first name. The bulgogi was delish. The Tofu bibimbop was exotic flavors. And we had the mandarin flavored sake was refreshing. We will definitely be back for more!", "author": "Claire S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "I remember this place as a  sushi restaurant, food was OK. But now, as Korean restaurant, food is excellent. I had the soy garlic fried chicken and the Korean kimchi fried rice, it was delicious. Will definitely be back.", "author": "Gordon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "My favorite Korean spot in the city! Faves I regularly go back for: seafood pancake, tofu soup, jap chae. Reasonably priced and friendly service. Don't think I've ever had a bad meal here.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "Great new Korean restaurant in the neighborhood. I didn't dine in, but the server was very friendly and thoughtful when I came in to pick up my order. \n\nExcellent kimchi pancake. Eggy inside and perfectly crispy outside. A great mix of umami, tang and funk. Also, their kimchi itself stands on its own. Nice mix of banchan, even to-go, and the mandoo potsticker tofu soup was peppery red and spicy, ample tofu, a nice mix of zucchini and onion and really supple potstickers. I'll definitely be back.", "author": "X-topher B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "The service sucks majorly. But the food is spot on so I'm not gonna hate. Only tried the bulgogi bibimbap and japchae. Like I said only draw back was the terrible service. Lucky for them I based my reviews mostly on the food.", "author": "Jake C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "Generic Korean Food.  I ordered the Bimbimbap, and tofu soup.  Its OK flavor.  Its lunch total bill is $27 for the 2 items with tips is $31.  Kind of expensive for simple ingredients of veg and rice and a little seafood with squid and shrimp.  This is a new restaurant before was a Japanese restaurent.  I was surprised that the chair was old.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "My friends and I were looking for a place to each lunch and after looking around for a bit, decided to try this place out, since it's new and my friends love Korean food.\nSo we step inside, looks clean and bright (a plus), and doesn't look too crowded (another plus, since we can get our food quicker?).  Anyway, the server/host led 3 ladies who were in front of us to the back, so we put our name on the list and waited.  And waited. And Waited. And waited.\nIn between all the waiting, the server/host came back, but did not even bother to acknowledge us. I said hello to him, he just ignored me, did his stuff and kept us waiting.  Another server came by, looked at us and walked away.  hmm, not a good start. \nWhat really got me ticked off was that they were saying something in Korean (I understand Korean, by the way), which I will not repeat here, all the while looking at our direction.\nSo, I told my friends we should go some place where we can actually get real service and some real food.\nWell, if your servers are that crappy, I don't care how good your food is, there are plenty of other  restaurants we can go to. \nDidn't eat here and most like not going to spend money where the staff totally ignore you AT THE DOOR!", "author": "Min K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Came on a Saturday and was seated in back. It was not too busy as it was early on a Saturday but the service was quite good. We had the Galbi, Bulgolgi and mild spicy fried chicken. Enjoyed it all and for the price was a good value. Chocking out the restaurants in the inner Sunset but this place is worth coming back to.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Came here for dinner on a sunday after spending the day at the Cali Academy of Science. Food was delicious, service was great, not too busy. The servers were super friendly and attentive, answered a lot of questions and made recommendations on the food and drink. The food was really delicious, we had the tofu bibimbap and the beef bulgogi bibimbap in stone bowls. It was a good amount of food, stone bowl is definitely the way to go! Beef was seasoned perfectly, tofu was a little plain but the rest of the bowl was delicious. Price was good, and actually less than we expected in the city. We were given refills on the banchan without even asking, which was great too. I would definitely come back here and highly recommend.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "The fried chicken was crispy and yummy. I wish they had extra dipping sauce for it like the stuff they drizzled over the fries. The jap chae was a bit on the oily side but the taste was all there. I did see a lot of people ordering the pancake so I will have to come back and try it! Parking is a problem in this area especially on the weekends though.", "author": "W A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "Staff was slow. We walked in and we had eye contact with 2 staffs so i was sure they saw us. But no one cared to greet us or let us know that they will be right with us. We waited about 15min before a waitress finally came up to us and showed us our table. She walked us towards the back of the restaurant and turns out there were 3 empty tables back there.\nMaybe because the ceiling was high and the little girl who sat next to us had a high pitch voice, it was very noisy sitting in the back area. Everybody's voice just echoed back from the ceiling and I can't even hear my sister from the other side of the table. They left the back door opened and little fruit flies wanted some of my kimchee fried rice. So that was a little annoying.\nThe fried chicken was kind of dry. Disappointed. Kimchee fried rice was just ok. Had better. Bugolgi fries was pretty good tho. But overall, it was just ok. Don't see myself coming back.", "author": "R C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "New Korean spot in the Richmond district. \n\nFor a new spot this place will eventually blow up. Their bibimbap and japchae are really good. My favorite is the kaibi good balance of meat and fat and cooked perfectly. \n\nMake sure to wash it all down with a nice bottle of soju.", "author": "Cm Tú Đ."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Probably one of the best Korean restaurants you can find in the city. All the food was absolutely incredible. I HIGHLY recommend the Corn Cheese, Fire Chicken (which is really spicy but delicious), Seafood Tofu Soup, and Kimchi Fried Rice. The presentation and service was great as well. Definitely going to come here with my family again to try their other dishes.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Food: had the fried chicken, and it was great. Sides were delicious too.\n\n\nAtmosphere: fine, nothing special\n\n\nService: pretty good", "author": "Tom D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "WOULLDD be perfect for happy hour (if they had one)..now that kitchen kura closed down. \n\nOrdered kimchi pancake, sesame kfc, kimchi fried rice. Liked everything. The chicken was sooo juicey and the fries that came with was really good as well.  Fried rice ran on the spicier side but i didn't mind. Pancake was flavorful and crispy.", "author": "Yue L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "I would give it 5 stars if it weren't for the ridiculous number of flies. I managed to kill 3. The service was wonderful, the food was tasty and fair priced, the server even helped reheat my soup because he thought it went cold. The place is great, they just need like a screen door or something.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Friendly staff, great prices, and solid food. Very relaxed environment. Food orderer: Japchae had great flavor and included beef, fried chicken was okay, but fried dumplings were great. Will def come back.", "author": "Walt F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "The food is pretty good. My friends and I really enjoyed the fried chicken. Overall, I highly recommend this place.", "author": "Charlene X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "We ordered Bibimbap and the taste are great! Prices are okay. The only thing is that there are not too many choices.", "author": "Danyang W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Love this place! :) Fresh ingredients, decent taste, and great service.", "author": "Yejoo K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "I've been here twice. First time I thought it was mediocre and thought I'd give it a second chance. Went here for lunch with a friend. We had the chicken and the Kalbi. The chicken was cut in these small strips over some shredded cabbage. It was standard but not enough. The kalbi was dry and over cooked. I could tell it was reheated probably from the night before.  Service slow and unpolished. There were only two tables occupied. The waitress would disappear for a long time before returning Then only did once.  You could do a lot better going somewhere else. This is a convenient location but that's about it.", "author": "H L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-07", "description": "Ordered fried chicken and was bland; the 15.99 bulgogi was in a smaller portion than what's it worth. Overall we didn't get full but at least the rice was pretty good. And then you get to eat on a small platter...", "author": "Gian Carlo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Great service. Good location. I recommend getting the hot stone bulgogi bibimbap. The fried chicken looked really good so I'll definitely be ordering that next time!", "author": "Ron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "This review is mostly for the soft tofu soup/Soon Dofu Jigae. I could eat it daily when the weather is cold. I ordered it once with a chicken appetizer and took most of the chicken home. In a group, the Kimchee fried rice, Pancake, cellophane noodles/Jap Chae and a seafood dish was great.", "author": "Ken U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "Was in the neighborhood once and craved for Korean food . The place looks good on the yelp so we decided to give it a try. It was not s long wait so we put our name down and the waiter took a look and told us just few mins . After waiting for 10 mins , they told us the back is closed and there is no sitting for 4 in the front and basically asked us to leave . They could have merged the table and sit us when there is opening . They rather sit small parties and waited 10 mins to tell us ! It's ridiculous and the man did not even say sorry . He is rude and kinda a jerk! I cannot imagine how good their service can be basing on this unpleasant service. There is plenty other place around .", "author": "Tracy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "Our party of 3 were going to dine here on a Thursday night. We arrived at 7 and there was two parties ahead of us and a single diner who came in after us. The waitress seated everyone except for us and for some reason refused to seat us at the bar, which was completely empty except the one lone diner. \n\nShe asked if we were okay with sitting at the bar if the wait was long and we said yes. She looked around and came back and said the wait should be 10 minutes. She looked really lost and didn't know what she was doing. We had already been waiting there awhile but we thought it would be fast or she would just sit us at the empty bar. Waited longer and this old couple walks in. The lady strolls right into the kitchen like she owns the place and points to the seats and says something to the waitress. Then seats herself and her partner at the bar while we've been waiting half an hour for a table. The waitress brings them menus and straight up does not care one bit that these people just walked right in and seated themselves while we waited a really long time. \n\nWe see people leaving and yet STILL no table for us. The waitress then tells us they're cleaning and should have a table soon. Said nothing about the couple that walked straight in and acted like it's nothing. By this point we've waited about 40 minutes for a table and there was only 2 small parties ahead of us, but they've seated the guy behind us AND the couple that strolled in and took the bar seats that the waitress refused to give us. The guy was already eating his meal while we were still waiting. \n\nAbsolutely garbage staff who do not care about you. There's no way we were going to give our money to people who treat us like this. We left angry. Got seated immediately at Marnee Thai across the street.", "author": "Steph Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-15", "description": "I was expecting to have some crispy fried chicken after seeing a photo  on the menu, so I ordered mild spicy chicken. The chicken came out all covered with a brown sauce that I couldn't taste a bit of chicken. Very disappointed! Why the waitress didn't offer me sauce on the side? Why does this cook think that he/she know how much sauce a customer desire? Inform and listen to your customer would be a good rule of thumb!", "author": "Yvon Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "Orded fish cake soup, kimchi fried rice and fried chicken. Kimchi fried rice was really good. The other two dishes are a lot sweeter compared to other Korean places.", "author": "Yanfei Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-03", "description": "Looking for another option besides Manna,  This seems to be OK.  The tofu soup is flavorful without being too spicy.  Manna's tofu soup is too spicy and little meat.  However Manna have better and more banchan.  Over all KK uses more salt and seasoning.  The service is kind of different too.  I notice the waitresses are selected for better looks, more make-up where as Manna have girl next door.  I don't think their looks matter, or make a difference in service.  We need more Korean options in this city.  Hope this restaurant make it because since KK opens, Manna's food tasted better!", "author": "Lantz G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "I don't condone restaurants that think it's okay to seat their acquaintances immediately upon arrival when there are parties that have been waiting close to an hour. \n\nWe arrived around 6:45PM with two parties ahead of us. Four parties of 2-3 left while we were waiting. They must have been understaffed because it took a while before they started seating the parties ahead of us. One of the waitresses asked if we would like to sit at the bar since the previous party of three had just left, and there were now three seats available, and we said yes. She goes to confirm with her manager if that's okay, and she comes back a minute later to tell us we can't sit there, and the next table will be available in 10 minutes. \n\nI thought.. Sure, that's fine. Maybe they want to keep those seats for single parties... Except at this point, we are the only ones waiting, and no one had come in after us during the next 10-15 minutes. We could have had our meals in front of us by then. \n\nAn older couple comes in, and the woman seems to be an acquaintance or relative of one of the waitresses there. They chat for a bit in the kitchen and hallway, and the couple is then asked if they would like to take those bar seats that have been empty for the past 15-20 minutes. We left immediately. \n\nThanks, Korean Kitchen. I'll stick with Manna. At least they treat their customers with respect.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "Great food you think right? All the 4* reviews right? So we decided to give it a try!! We ordered japchae and kalby and were given only had small dessert plates and chopsticks to use. Then we realized we wanted a knife and fork to cut the kalby into bite sized pieces on our little dessert plate - well the waitress was not as friendly when we asked for it.  So we're totally enjoying the meal when I saw a hair (yes black strand) stuck to my meat!! Well I called the waitress yet again and then she examined it. Took the plate and the food away without saying so much as an apology! She snuck to the back room and didn't even come out!! Finally another server gave us our bill for the full price. Can you believe it!! Anyway - try the food if you must but beware of anything extra on your food. Happy Eating!!", "author": "holly z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "One star for the very plain ramen. It tasted like chicken broth and onions with pepper. The boiled egg was super hard and over cooked. I've come here before for their bibimbap and fries (both really great) - and I'd come back again for that!", "author": "Sheela L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "Waited ten minutes to be seated and then ten more minutes to have someone not grab my drink order. Customer service is horrible here", "author": "Vince D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Best Korean Restaurant in City!!!\nWaiting is long got be patience but it's worthy waiting cuz it tastes soooo good.\nI had kalbi, seafood pancake and tonkatsu for dinner.\nI will definitely recommend and go back there again.", "author": "Chong Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "only tried their jap chae. it was pretty pricey considering the portion and other places. there were a lot of ingredients and the bulgogi was delicious, marinated well and sweet. but a lil too oily. their side dishes were bean sprouts, kimchi, and fish cake. kimchi was a lil soggy tho. service was great, they were very nice about banchan refills and checking up on us", "author": "Amy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-16", "description": "Ordered a beef soft tofu soup for takeout. It tasted funny and it turns out they gave me seafood, which I hate. Told my friend about this and she said the same thing happened to her! Shame.", "author": "Dawnkee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-22", "description": "Terrible service. We waited about 10 mins to be seated, and ultimately opted for two bar seats so that we wouldn't have to wait longer. Note: these seats were open the whole time, and we still had to ask to sit there. No one came to take our order for another 15 mins. We left without so much as a sip of water.", "author": "Rebecca E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "I do like Korean BBQ and this is solid standard Korean. All the usuals and some dishes I haven't seen before. So why 3 stars? This place seats 45 and the turnover is slow. Not set up well for more than two tops. You wait in a narrow entrance where the backs of the chairs are tucked behind a black box mounted on the walk. Yes, I bashed my head on this. I thought I was a yutz until the next 2 people who came in did the same. So you start your meal with a headache, then you have to listen to loud Korean pop and rap. More headache. I could handle the pop at a lower volume, but please. I would say this would be a good place for a young Korean couple with hard heads. I mentioned the chair issue to the host/waiter, but she looked at me like I had Kim chi on my face. The Kim chi was good.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "Went there on 3/28, ordered a stone pot as she recommended, it's good no complaints. Service was fast and quick, no line at 5pm yet. Overall will come back and recommend to my friends", "author": "Jasper K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "Ordered Tofu Soup delivery. Cheap delivery via DoorDash ($1.99). Soup was good and tofu chunks were huge. I wish I made it a little spicier, but the flavor was still good for being mild. Was surprised they wrapped some banchan up in foil and included multigrain rice. The kimchee was a little too salty, but the fishcake and pickled cucumber hit the spot! Will order again.", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "This new Korean joint by the 9th and Irving area opened up not long ago. The restaurant is on the smallish side, not a whole lot of tables. No cooking at your table like some other Korean restaurants. It is a bit more on the pricey side compared to Manna down the street. There is a lunch and dinner menu. The food here is quite good and authentic. I had the beef bulgogi in stone bowl. I liked the mixture and crispiness of the rice.", "author": "Ali F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "The food is excellent highly recommended the only drawback is the place is small and tables are very close to each other you can hear other people's conversation.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "We usually go to Manna on 10th and Irving to be able to get a variety of Korean dishes without it being super expensive. This place is comparable with less of a wait. Came Friday night at 630 and was seated immediately. Ordered kimchi fried rice with egg on top, 1/2 soy garlic chicken that came with some fries and cole slaw, seafood pancake, and bulgogi. Next time will go with the mild spicy chicken for more of a kick. Overall good food, really good portions, friendly attentive staff and decent prices!", "author": "Katy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Food was delicious, service was good and accommodating. They took my reservation when I called ahead to tell them we're on our way, they seemed hesitant on taking reservations. So glad we chose to eat there. Seafood pancake was light and just crisp on the edges, with Bonita flakes still fluttering when served on our table. The rest of the food was very good too. Would eat here again even though parking can be tough to find.", "author": "Annie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Really liked their food - I believe that location eventually got occupied by a restaurant who will lasts, there was such high turnover in the recent years...many restaurants in the neighborhood and thus competition...\nShared the sea food pancake, Japchae, fishcake soup and bibimbap - everyhing tasted fresh and good...the starters side dishes were very tasty as well. Better than Manna in my opinion - a bit more expensive that your average Korean in the neighborhood but portions are big and food is interesting. Will go back to explore the menu further...", "author": "VIORICA C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "This place newly opened up, and it is already the best Korean restaurant on Irving. It's clean, service is very friendly, and the food is good/solid. The soups/tangs are a bit on the salty side, but it's still overall a pretty clean flavor. You're not getting the best Korean food in the bay area, but it reigns as the king of Irving - much better than Hahn's Hibachi or Manna. It's also relatively affordable, although I wish it was cheaper. I recommend it", "author": "Jin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-15", "description": "Ordered food via grub hub. Arrived about 15 Min late. The galbi was burnt and tough. Some pieces were completely black. The soybean soup was watery and the vegetables were undercooked. The only thing that was good was the kimchi pancake. Very disappointed.", "author": "H O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "Happy tummies! We love the food especially the kimchi fried rice. So yummy! The portion size was great definitely shareable. The bibimbap was all yummy good flavors! Grilled mackerel was flavorful and grilled well. We will definitely be adding this to our faves! Parties 6 or more 18% gratuity automatic", "author": "Mel N Viv G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Really good! I only came here for lunch so I've only had the dol-sot (stone pot) bibimbap, but it tasted exactly like it should... super hot stone pot got that nice layer of crunchy rice, the veggies were marinated nicely and weren't cold (meaning they didn't come straight from the fridge), the bulgogi was well-cooked, and the fried egg had a perfectly runny yolk! Also, the banchan (side dishes), the quality of which I consider a very good measure of a Korean restaurant, were excellent!\n\nLooking at the rest of the menu, they offer most of the basic traditional Korean dishes, as well as some more new school items, all of which I can't wait to try.\n\nIf you're thinking of going to Manna, do yourself a favor and go here instead... it's just a couple blocks away, and it's definitely in the argument for Best Korean in SF (which Manna, unfortunately, is not).\n\nOh, and the prices are reasonable, the service is good, and the restaurant itself is very clean and comfortable.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "Not bad.  Had the kim chee bulgàgigi fries which were very good, soy garlic  chicken that also came with French fries (?!?) And was mostly white meat, combination tofu spicy stew that was supposed served with purple rice with they almost forgot to give us, and the hot stone bibimbap.  Why does Korean food have to be so pricy?  $50 bill for appetizer and three entries.", "author": "Kid N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Ordered take out from here twice. The first time they didn't give me side dishes...I was a little disappointed but my entree was soooo good. My second time they gave me 4 different side dishes...perfection!!!!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "Food was ok but the wait staff was not much help.  Here's what happened.  Went on Friday for dinner w/o reservations.  We were among several groups waiting to be seated.  After 15 minute wait, without anyone leaving, they call in a party of 4.  Another 15 minutes goes by, again without anyone exiting, they offered to seat us at the counter which we accepted.  Note, these seats were available the entire time that we were there.  Also the kitchen is the other side of the counter so we all ended up smelling like food afterwards.  Couldn't wait to get home and wash the smell off.", "author": "R K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-15", "description": "The fried chicken is not crispy enough. \nThe stone for the bibimbap is not hot enough, therefore did not create that rice crust. The sauce is not as good as other Korean places. Otherwise the bibimbap is not bad. \nTofu soup is good but we ask for medium spicy and it was barely mild. \nPrices are pretty decent.", "author": "Gir G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Great food. Presentation and service is superb. Hope they keep it up. Ambient music was also a nice touch. Prices are good specially for the San Francisco Bay Area.", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-02", "description": "My friends and I were visiting the city and decided to come here. Took the food awhile to come out. While i drank my water while I was waiting, the waitress refilled everyone's water except my table where my friends and I were thirsty. Then when we went up to pay, they had charged my friend $25 more than what she was supposed to pay for. The only thing that was good here was the food.", "author": "Lyn V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "Had lunch there with my wife yesterday. We got the seafood pancake ($10 @ lunch), which was quite a nice sized pancake with quite a bit of seafood in it. The pancake was very crispy, bonito flakes on top, a wee bit greasy, but super yummy.\n\nWe also got the galbi bibimbap in stone pot ($13 or so @ lunch). It had a nice assortment of vegetables (bean sprouts, mushrooms, spinach) along with 3 good sized, well marinated and cooked pieces of beef with a fried egg on top. Overall another good dish.\n\nWe liked this place slightly better than Manna, the prices are a but more ($2 / dish or so), but the portions also seem a bit bigger.\n\nWe took the fried chicken to go for dinner last nite. It came with cole slaw, fries and daikon. Cant really review / rate it very well, since we had it much later. The saucing was plentiful. the mild spice chicken was quite hot (i think they might have made a mistake and given us a hotter version)\n\nOverall a great addition to the neighbourhood. Was reasonably busy at lunch yesterday.", "author": "Donald L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "I liked this place a lot. Not only the food was great, the employees were also very friendly, smiling to us the whole time while serving us.", "author": "Jackson C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Everything was pretty tasty! Solid drunk food when you're not in the mood for burritos. Apparently \"corn cheese\" is a thing, and, I don't know what we expected, but it is literally a can of corn with melted cheddar cheese on a plate. And for some reason it was like, $8. That kind of confused us, but oh my god the veggie soup is so good. Most flavorful vegetarian soup in the area. Thanks for not just serving me water with a stalk of celery in it!", "author": "Stefanie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "we found this small little resturant on a fun little exploring trip in san francisco and fell in love with it! We came about 10 minutes before they opened for their dinner time and they allowed us to come in early and look at the menu to hide from the cold. super tiny but also well kept, we were expecting the food to be either not good or only average but after a bite of our dishes we were amazed! We got the bulgagi meat and kim chi fried rice with an egg on top, which was life changing honestly! The servers were extremely nice and it was plenty of food for an average bill, which was also a huge plus! We will be back again!!!!", "author": "Alice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Flavorful & tasty dishes. The seafood pancake was thin & crispy; probably the best Korean pancake I've had. Other standouts include the Fried Chicken & the Galbi.\n\nServers were friendly and helpful.\n\nThe staff refused taking reservations by phone because they expected it to be a busy night. But the restaurant was half occupied when we arrived.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Lived in Korea. Blown away by this place. Delicious authentic Korean fried chicken, excellent other dishes. Staff goes above and beyond in service. Great ambience. Definitely the best Korean food in the city.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Absolutely amazing ..must try ..service was friendly also food is best in Sf. I recommend galbi and spicy ck.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "i came this place twice. compare to any korean restaurant around this area, its interior and foods are fancier and better. i ordered fried chicken with spicy sauce and i think, for korean chicken wing style, this place is the best. i love it!!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "Had a strange meal here tonight with man friend. We arrived at an early hour for dinner, and despite two two-tops being open we were eventually offered a seat at the sushi bar. We said we'd rather wait for a table, which we eventually got (there were still open tables near us and nobody waiting). After ordering (3 dishes) we were again asked if maybe we'd be more comfortable at a different, larger table in the back (because somehow there was no way 3 plates would fit on the table?) We again declined to be hidden away in the back room (and there was more than enough room on the table).", "author": "Elise R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "4 stars for staff. The service here is good but I dislike how small and cramp it is. The food is good but the portion sizes could be a bit bigger. The bibimbap in dolsot needs to be hotter with more rice so you can get the crispy rice at the bottom. I think this restaurant has potential because they can take advantage of later hours like places in Southern california.", "author": "Joshua Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "The food was pretty good and were nice portion sizes. I wish there were more variations of the ban chan as there were only 4 dishes (but you can refill them!). The chicken looks pretty good but is a bit pricey, might have to give it a try next time!", "author": "C. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Here is the best Korean restaurant in SF. If you are unfamiliar with Korean food, here is the best place to start with. On top of that, the service and food quality is awesome. Surprisingly, the price is really reasonable. Especially, I love Galbi, which is beef short rib. I also recommend getting the bibimbap because the ingredients are so fresh and really tasty. Overall, I think this restaurant is 10/10 for service, atmosphere, taste and quality.", "author": "Roy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "This place is perfect, just what my hubby and I were looking for. Korean fried chickens over soju!", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "We loved everything we had at Korean Kitchen! The pancake was crispy and the spicy pork bulgogi was tender and the flavor amazing. And fantastic service.", "author": "A. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Bibimbap is a must have. The spicy fried chicken is a close second. The place that was here before used to be my spot before they shut down, but it's been replaced by something just as good. I will mos def be coming back", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "Ordered bulgogi bibimbap to-go. It was quite good, but they didn't put any red chili paste with it!! So I had to use Trader Joe's red hot chili sauce, which definitely wasn't the same... big bummer.", "author": "Tony G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "The food is okay. Its more of a drinking place i think. Fried chicken was not that good. I was visiting from Oregon and we wanted eat some Korean food. Bibimbap was decent. Its a cute area there are some shops and near by a ice cream shop.", "author": "Pooh O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "to all my kbbq lovers this is the spot!!!! don't live in sf so was curious on what places were good to eat at over here & i came across this restaurant. it's near ocean beach & sutro baths so that's definitely a plus you can come here after ur done going to the beach & finished sight seeing. parking here is DIFFICULT to find went around a couple of times and still couldn't find any parking. but what caught my eye the most was the kimchi fried rice!!! i love kimchi and the fried rice comes with a poached egg on top it was freaking heaven. definitely recommend the galbi, soy garlic chicken, beef bulgogi, & the hot and spicy chicken. the pricing is reasonable! service was great! they gave me & my gf a bigger table bcus we ordered too much food even tho there was a bigger party that had been waiting there longer than us so i really appreciated that.", "author": "Jocelyn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Had dinner at the Korean Kitchen.  Ordered the soy garlic chicken, beef tofu soup and bulgogi bibimbop.  Best beef tofu soup I've had in a long time.  Broth is delicious.  You won't go wrong.  Bibimbop was also very good.  Soy garlic chicken was good.  Order the Beef Tofu soup.", "author": "Carlo W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "The fried chicken wasnt as good as i expected. But the fries were really good. The seafood pancake was soso. Price wise is average not expensive. Might give it another try if im craving for korean food.", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "It was my second time coming to the Korean Kitchen and I will definitely keep coming back! This was some of the freshest Korean food that I have ever tasted in my life. The first time I visited, I ordered half/half fried chicken. The flavor of the chicken was so delicious that I also ordered it the second time (which was also so delicious and fresh). If you are visiting, I would definitely recommend it! I also tasted the Kimchi Fried Rice, this is my favorite Kimchi Fried Rice. It is deliciously seasoned and chewy and delicious! It comes with a fried egg on top. This Kimchi Fried Rice is the best I have ever tasted in my life, really. Lastly, I tried the Hot Stone Tofu Bibimbap! I usually order Bibimbap because I love the variety of ingredients. I'm sure the ingredients in this restaurant are some of the freshest in the whole area. If you are touring to San Francisco or you are from the area, like me, come and try the food! Both times I have visited the restaurant, the environment was amazing, my server (Roy) was so kind, helpful and sweet. Visiting this restaurant was one of the best korean restaurant experiences of my life and this restaurant will always be a life-long favorite of mine. The entire experience really amazed me. Thank you so much Korean Kitchen!! And I will see you next time :-)", "author": "Jasmine J."}
