{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "YELP 100 CHALLENGE 2017 - PART 3: 38/100 \n\nOkay. I'll admit - I just stumbled onto this. My initial reaction was, \"Whaaa!? The Bush Man has his own Yelp review page!?! YEAH!!!\" \n\nAnd then immediate sadness when I learned he's passed. \n\nNo wonder he wasn't around the last time I took a day trip to the Wharf last year. \n\nI could care less about the negative reviews on him. He was an absolute staple to the Wharf. I remember getting startled by him my very first time in SF - I was in my pre-teens then - and I found it absolutely hilarious. He got me again a few more times on many other visits as I got older. (Why I kept forgetting he was there is beyond me!) I made it a point to bring out-of-town guests/family around his area so they can get victimized by... I mean, EXPERIENCE his performance. We all enjoyed it even with that initial \"scare.\" \n\nHe will be missed, for sure. \n\nI have hopes someone continues his legacy...", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "The average visit to Fisherman's wharf won't be the same without Bushman. This guy became a legend who entertained tourists for more than 30 years. Gregory Jacobs became famous around the world and became a true asset to this city. His antics were simple but effective; \"Bushman\" would scare the hell out of people out of a bush, with just two skinny leafy branches. Jacobs died last year and since that someone else took his place. The new person is funny but he has not been able to cover the whole left by the original Bushman's departure.", "author": "Melody C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "My first experience with the Bushman was around 2003.  Fortunately I saw him from afar and wasn't one of his startled victims.  While I'd laugh it off, I think, the words that come out of my mouth when startled are vibrantly colorful, so it was for the better for all humanity.\n\nApparently there were 2 bushmen, but one passed away a few years ago.  He sits on the sidewalk along Jefferson Street, pier-side, just west of Tarantino's restaurant.  He hides behind gathered tree branches usually next to a garbage can or light post, then shakes the branches while letting out a low bellow when unsuspecting pedestrians walk by.  It's hilarious!  I've never seen anyone get upset or violent but I'm sure it has happened.\n\nOn our most recent visit in November 2016, I was bummed that he wasn't out when we first got to Fisherman's Wharf in the morning, but by the early afternoon he was in full swing.\n\nOVERALL:\nThe charm of Fisherman's Wharf wouldn't be the same without him.", "author": "Vince N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "How did I just find out that the legendary Bush Man in SF passed now?!\n\nAfter Robo-Mike in Denver, I would have to say that The World Famous Bush Man was my favorite busker worldwide. His schtick was basic but a lot of fun: he would roam the western area of Fisherman's Wharf (usually at Jefferson and Hyde Street) and sit motionless behind some eucalyptus branches and wait for tourists to wander by. As they got close he would jump out and scare the hell out of them. Afterwards the tourists would then invariably watch The Bush Man do his thing to the next unsuspecting passer by. \n\n...and yes, he got me once in 2008. \n\nI was just made aware of his passing two years ago due to heart failure at the age of 60 although I was also told there is already a new Bush Man in his stead. \n\nRest in peace Bush Man.", "author": "Aaron E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "Whenever I'm visiting the city I always try to see the Bushman.  It's ultimate silliness and the same thing over and over again but for some reason I find it to be the most hilarious thing.\n\n\nHaving lived right off of Hollywood Boulevard I'm used to creepy costumed characters taking pictures with tourists for tips but the bushman at least gives you some sort of entertainment and makes you laugh out loud.  I always tip him a few bucks because essentially he's providing a service and I usually stand close by for a few minutes watching him scare tourists.  \n\n\nThe Bushman brings a little funky SF flare to an otherwise tourist trap that has the same crap as the tourist traps in every other city.", "author": "Joan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "Good riddance. His success is a clear sign of just how terrible people are.\nWhere ever he is at i hope he has to live with getting the crap scared out of him all day while others look om laughing. \nLike Prometheus minus the whole liver thing...", "author": "Spanky M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Have you heard of The Bush Man? We had heard about this man (or people like him) and went to Fisherman's Wharf to find him.\n\nLooking around, there were no bushes. Not really. We didn't know where to find this guy but we asked people that worked in the area and it was weird like asking Do you know the Muffin Man? But we found him with the help of the employees of the area!\n\nThis guy has a genuine happiness in scaring passerby-ers. You really have to be not paying attention to be scared because we saw him from across the street and thought REALLY?? \n\nWe saw people come behind him and scare him and him scare others.. It's not a myth. He does exist. Tip him.", "author": "O M G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Maybe five years ago my family and I had just got done eating some delicious seafood at Cioppino's and were walking along the street towards the beach and Ghirardelli square. I was in front of our little group, and I guess I walked right by Bush man with no clue, but immediately after I passed, I hear a sharp and quick, \"Ahh!\" From my mom. \n\nNow my mom sneezes so loud and abruptly, I'm not surprised to hear loud utterances from her every now and again, but this time she repeated the \"Ahh\" a few times out of fear. I quickly spun around and there was Bushman, readjusting and getting back into position after having successfully scared my mom. After figuring out just why a bush had come lunging at her, she was able to laugh it off while playfully trying to figure out why anyone would sit and wait to do that. Hehe. \n\nGood times and good laughs. Bushman, you will always be remembered in a positive light.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Dear Bush Man,\n\nYou have always been one of my favorite parts of the wharf and an iconic aspect of the San Francisco experience. Thanks for making me your victim when I was six years old, frightening me with a snarly growl. Over the years your routine has made me cackle with delight as I've watched you frighten tourists from behind your trash can.\n\nIt breaks my heart to hear that yours has failed you. You will be greatly missed, but I'm sure another copycat will be more than happy to extend your legacy.\n\nRIP", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "So sad to hear of Bush Man's passing - I'm not 100%, but I thought there were more than one. That said, any Bush Man is an incredible man - I've been freaked out by the Bush Man dozens of times in my life and he gets me every. single. time. \n\nHappy that I never leveraged my knee-jerk reaction into his face. \n\nA Wharf legacy that I hope continues. R.I.P. and condolences to his family and friends.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "R.I.P. original Bush Man.  :(\n\nhttp://www.ktvu.com/news/news/local/fishermans-wharf-tourist-icon-dies-heart-ailment/ndmWy/\n\n5 stars all the way, even in passing", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Oh Bush Man, how I miss you.\n\nI actually took the time to briefly speak with him a few years back.  The conversation went as follows:\n\nMe: Hey can you scream \"hot pockets\" at the next person that comes by\nHim: [Silence]\n-unsuspecting French Tourists walk by-\nHim: [Reveals himself] HOT POCKETS!!!!\n\n5 stars baby.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Bush Man has been doing his thing in pretty much the same spot for years.\nIt's random and not necessarily well done, but he gets people all the time.  \nA little scare followed by a little laugh.  Stand to the side and watch people get seriously freaked out.  It's good people watching and provides at least 5 minutes of entertainment.  \n\nHe's a bit of a San Francisco institution, Upper Playground even has a shirt commemorating the Bush Man. Bush Man is to San Francisco what The Naked Cowboy is to New York.", "author": "Kristi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "To those rating Bush Man down - jeez get a fucking sense of humor. It's actually pretty obvious that he's there, so why kick up a fuss about it? THERE'S A FUCKING BUSH IN THE MIDDLE OF THE SIDEWALK.\n\nThe Bush Man is a symbol of just how crazy San Francisco is and I love it. Everyone is mental and good-humoured. If you talk to him as well, he's such as nice guy and willing to take a few pictures too. He doesn't beg for money, he just does things for a laugh - he seems homeless so maintaining a good sense of humour and having a laugh once in a while is important.\n\nSo why does he scare people?\n\nBecause he's the hero San Francisco deserves, but not the one it needs right now. So we'll give him low reviews on Yelp. Because he can take it. Because he's not our hero. He's a silent guardian, a watchful protector. The Bush Man.", "author": "Clarissa Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-29", "description": "Most locals and many visitors from around the world have experienced or heard/ read about the famous SF Bushman at Fisherman's Wharf. http://media1.px.yelpcdn.com/bphoto/THUdzW4q55Ijjv-qvCqk7w/l So for this review I won't repeat the obvious. Since some of the other reviews read like a blatant copy from a Wiki or SF travel review website.\n\nA few yelpers asked: Does he really make 60K per year like Stanley Roberts from KRON 4 reported a long time ago? Here's the video in case u missed it. http://www.youtube.com/watch?v=O5mCURLIWug\nNo, he doesn't. On a good day perhaps a couple of hundreds. Not a lot left after food and boozing. He rides a bike to save on transportation.\nSo why did he say that? it's his way of revolting against \"the man\" trying to put him down, to show he's better off than what others would expect.\n\nBUT the biggest twist to this story is: Surprise! there's more than one Bushman. All those know-it-all yelpers and SF travel guides, the joke is on you!\n\nI know for sure that there were at least 3 different \"bush artists\" (see photo evidence). Could there be 4 or 5? maybe. Who knows, perhaps there's a time share or franchise system in place - taking turns while a person goes on vacation, selling time slots, etc.\n\nHere's a pic of the current performer (taken 2 weekends ago). http://media1.px.yelpcdn.com/bphoto/Kw7ETfERLLiRESuFmoCxaw/l He's much younger than both David J. (the original) and Gregory (the understudy). http://media1.px.yelpcdn.com/bphoto/5wBSeznmkYh4PY6P_ncDAA/l He (the bearded one) asked for $2 to allow me to take his pic and talk to him a couple of years ago. I lost many of my pre-2008 pics in a hard drive crash, so that's all I have for now.\n\nRejoice! The legend of the SF Bushman will live on (forever?), scaring the bejesus of unsuspecting visitors for many generations to come.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "I used to get together with two of my friends, smoke weed and stand up a few feet away from this guy and watch him. He deserved some credit for making us laugh, and although he wasn't too creative I would still crack up for hours. It makes me sad to hear that he is gone because after all his scary character did not hurt anyone. He will be missed by all of us who enjoyed his artistic performances.\n\nThe Bush Man R.I.P", "author": "Rosemarie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "One of the best lines I have ever heard came from the original Bush Man... he scared the crap out of an Asian lady who then started taking pictures of him while he was doing his thing. After about a minute he stood up and said ma'am, now that I've let you take a picture of my bush, how about I take a picture of yours?  About fell over with laughter...miss ya big guy.", "author": "Frankie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "I'm sorry to deliver the sad news, but bushman died from heart problems this week, so sad. His friend Johnson will continue to act as the bush man. Him and Jacobs would often compete for the good spot to scare people, but they became friends in the end. \nBush man was a great touristy scare!", "author": "Poppy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-14", "description": "Really? The Bush Man is on Yelp?? Was just browsing through Yelp and this popped up and had to write a review. My first visit to San Francisco, The Bush Man got me...he got me good and I vividly remember him scaring the crap out of me. \n\nI was a straight up tourist visiting my friend  who just recently moved in the area. Just walking along the waterfront and this damn bush makes a loud noise at me and I literally screamed at the top of my lungs. Everyone looked at me like I was crazy and my friend was surprised how bad I screamed. She obviously knew it was coming. \n\nEven though I was mentally cussing this man out, it was worth the scream and the memories I have of the time I had there.", "author": "Janice S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "Both of the Bush Men have scared me on at least one occasion each. \n\nGrowing up in the area, I knew of Bush Man before our first encounter. But like most who visit SF, I was too busy chatting with friends to notice a bush on the sidewalk ahead. Before I knew it I was within his range and suddenly he was popping out of the bush with the loud \"HAAAAH!\" that startled me and so many for years and years. \n\nAfter he got me a couple times, I was able to start spotting him from a distance. It still gets a good laugh whenever I walk by a Bush Man. Recently, I was saddened to hear of the passing of one of the Bush Men who made the city of San Francisco all the more exciting and interesting. \n\nHere's to a local legend who scared the bejesus out of so many tourists and locals alike. He will be missed!", "author": "Kayta N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "Bush Man, \n\nI give you four stars for your dedication alone, assuming that you're the same guy that scared me back in 2004. If you are, I commend you greatly. You've probably scared over one hundred thousand people and still going strong. What motivates you? I assume tips, but you must also love the terror in the faces of your prey.\n\nYou've developed a solid business plan that has held strong for years and maybe even decades. Spooking tourists never gets old and you know this. If it ain't broke, don't fix it, right? You work hard and run a tight ship, sir.\n\nIf you ever retire, I sincerely hope that the city puts a bronze statue of you in the same location. I will personally support that cause.\n\nThank you,\nNick", "author": "Nick K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "Bushmannnn da na na na na na BUSHMAN!!! \n\nBeing born and raised in the city I have been a victim and a witness. EVERY SINGLE time its just awesome fun. People like this is why this city is great. \n\nThis guy(s) should definitely get some sort plaque, honored with a key, or at least some free camouflage gear. \n\nFisherman's wharf and SF would not be the same without the yelps (ha!!) and screams of tourists walking along the way.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-21", "description": "Dear Mr. Bushman aka David Johnson,\n\nScrew you for scaring me as I was walking with single minded determination towards the fresh oysters. I was envisioning the taste of the juicy slippery treats which I would drizzle the juice of a lemon wedge over, when you suddenly lunged at me with your pathetic tree branches. \n\nTo my utter dismay, I shrieked loudly and jumped into the air, with all thoughts of these wonderful oysters to come had flown out of my mind. Not only did the friends that were with me laugh at my expense, but also a huge mob that had gathered across the street laughed similarly to the canned laughter that one would find in a recording studio in hollywood. \n\nTo complete my humiliation, everyone standing around forced me to add a precious dollar to your dirty cup, because apparently you \"got me good.\"\n\nTo top it all off, I saw you as I was walking, and then my thoughts wandered for a moment before I was victimized. I am not amused.\n\n-Disgruntled Grace.", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Yay!\nSo happy to see this is still going on. Such a great opportunity to laugh at yourself. I was a victim over 10 years ago and fun to see it all again on a recent trip back to the city. That crowd of folks is still waiting across the street taking pictures eagerly waiting for the next scream. This soo shouldn't work as well as it does, random guy siting with some branches...simple & brilliant. \nWasn't having an easy day so the extra smile was much appreciated Bush Man.", "author": "Sue W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "How is Bush Man getting anything but 5 stars?\n\nHe pretends to be a bush with two poorly foliated (this is now a word, deal with it) branches and scares people who don't have the good sense to pay attention while walking through Fisherman's Wharf.  I say, that's what you get for even going to Fisherman's Wharf, but what do I know.\n\nHe's San Francisco royalty and should be treated as such.", "author": "Sar A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-28", "description": "Finding terror in others entertaining is disgusting. There were three now two. They sit under a sign  imprinted with the law that makes it illegal. The SFPD used to chase them away but 5 or 6 years ago, a jury of  \"peers\" set one free after putting a woman visitor in the hospital. S.F.D.A. Harris instructed the SFPD to ignore these \"entertainers\". When  another victim gets taken away in an ambulance who will speak for them?", "author": "Maury P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "A HAIKU REVIEW\n\nBush Man lies in wait.\nHere they come - victims. BOO!\n(Tourist peeing pants)", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "When I worked at Disneyland I would be playing in the park after work and I would go over to Splash Mountain and stand by the other side of the big drop where it comes out and watch people get wet.  They would scream and shout when they got soaked.\n\nIt was awesome.\n\nThis is the same way for me.\n\nWith all the somewhat mediocre acts on Fisherman's Wharf its nice to see something different.\n\nI could stand here allll day and watch him scare people walking by.  If you are paying attention you can totally see a guy behind a bunch of branches but all those tourists are totally off in some other world dreaming of oysters.  (love you Grace!)\n\nYeah MAYBE the Bushman scared the oysters right out of me the first time and MAYBE my dad thought it was the funniest thing he had ever seen.\n\nPicture or it didnt happen.\n\n:0)", "author": "Eric N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "Love this guy!!! Read any if the one star reviews, they must be people who were scared and mad about it. I love the guy Matt who says he's going to sue him for everything he's got!? The guy is homeless, sue away!\n\nLong live bush man", "author": "Emilio G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-25", "description": "I think the Bush Man is much like the Dread Pirate Roberts \n\nThe Bush Man's reputation is legendary \nEveryone knows of the Bush Man \nEveryone has been scared by the Bush Man at 1 point in their lives \nEveryone lives in fear that the Bush Man will catch them unawares *again* \n\nBut in order to make this all work, it has to *be* the Bush Man - cause just like no one would be scared of the Dread Pirate Wesley, no one would be scared of, say, the Shrub Man \n\nAnd like the Dread Pirate Roberts, I suspect the Bush Man hasn't been the *same* man this whole time ..... I mean, he was scaring folks 15 yrs ago when I made my first visit to SF ( I was a victim ) & he's still there today......or *is* he?! \n\nJust like when the Dread Pirate Roberts is ready to retire, he trains his replacement, it takes a lot to be a proper Bush Man & the gauntlet isn't handed down to just anyone \n\nI think the Bush Man finds an apprentice who can be trained in the art of Bushery & Shenanigans - teaches him holding the branches at the right angle, foraging for the appropriate foliage & timing the scream just so \n\nYes, yes, yes - just look for the masses of people, smiling, with their cameras out, all pointing in the same direction & there's likely the Bush Man nearby \n\nI can't think of any other city on Earth that can claim to have its own Bush Man.....a true only-in SF-experience & a definite SF tradition", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "He got me and he got me good. So good, in fact that I jumped up in the air and screamed, \"GOLLL-LY!\" Who says that? Certainly not me, but I did on this particular day.\n\nI heard a rumor that the Bush Man is now retired so the bush man you see today isn't the \"original\".  I also heard that said Bush Man retired after he put his kids through college...on the money he received from being the Bush Man. Wow!", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "The Bush Man camouflages himself with a palm frawn on the boardwalk where he makes a living surprising unsuspecting tourists and accepting donations.\n\nThere's something meditative about watching him and I stayed for at least a half hour trying to snap the perfect picture of some unsuspecting dolt jumping out of his skin in response the Bush Man's big reveal. \n\nThe Bush Man gets them every time -- it's a shocker too -- considering there was a crowd of 20 people, iPhones in hand all pointed at the 'target' as they approached the well-camouflaged busker", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "Say what you will, the man is a method actor. He becomes the bush. He IS the bush. And rather than simply pan-handling, the guy got a gimmick. \n\nI've gone by on rainy days and he's there, willing to scare the crap out of whatever rube is out for a drizzly walk along the Wharf, despite other homeless people yelling at him to give it up. \n\nA day well spent is getting a bread bowl of clam chowder and watching this artist at work, etching sheer terror on the faces of teenage girls and frightened 30-something-year-old guys who throw their girlfriends in his path for their own protection.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-14", "description": "How does this man even get his own review page on yelp? haha\n\nI'm reviewing because Bush Man is an iconic figures, I suppose, known in Fisherman's Wharf. I have lived in The City most my life, and going down to the Pier is a rare occasion for me. I remember my first time walking nonchalantly with my parents when I was about 6 years old, he scared me. Ever since, I think I have avoided the pier. But now that I have grown up a bit, and able to spot him from far away, I just walk on the other side of the street from him.\n\nHe's cool, he picks his victims. And usually they just laughed because they were just embarrassed. I think it's a good memory to take with them.\nHe's usually by the iron bar fences, across from McDonald's (I want to say). Just look for branches with leaves that appears out of nowhere, or near a trash can.\n\nAlso, he tells the audience to donate if you want a picture of him scaring people.", "author": "Winnie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-26", "description": "I guess I am one of those people that don't \"get it.\"\n\nThis bush dude needs a good kick to the beanbag when he scares the wrong person. I suspect that the small crowd that gathers is hoping that the next person that comes up will give it to him.\n\nHe has a wikipedia page. So, he has that going for him.", "author": "eric w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "David Johnson, also known as the world famous Bushman, is a busker (someone who performs in public places for gratuities) who has been entertaining passers-by along Fisherman's Wharf in San Francisco since 1980. His current act began after he tried dressing as a robot but found there were too many others doing the same thing. \n\nJohnson hides motionless behind some eucalyptus branches & waits for unsuspecting people to walk by. When they approach, he jumps out & startles them. Crowds gather to watch him work, often including those he has previously scared.\n\nCrowds usually watch Johnson in front of Joe's Crab Shack, located across the street from where he usually sits, to see him entertain/scare people.\n\nIn a \"good year\", Johnson claims to earn $60,000. He sometimes employs a bodyguard to protect him against attacks by the unamused, to distract his targets, & to alert him to the approach of elderly people so he can avoid scaring them.\n\nThe police have received a number of complaints about the Bushman, & Fisherman's Wharf merchants have tried to stop his busking. In 2004, he was charged w/ four misdemeanors, but a jury cleared him. The District Attorney's office subsequently dropped several remaining public nuisance complaints.\n\nI think that those who complain need to get a life & let the Bushman ply his trade & entertain those of us w/ a sense of humour.\n\nSanta's Yelper sez: \"Bushman rocks! BOO!!!\" :::Waving imaginary bush:::", "author": "Tadashi Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "Ok, you've seen this for years on tv and to see it in person is hillarious- especially when my nephew got set up for the big scare. My husband asked him (nephew) about something (because we were up front, we'd seen him already), which was perfect. So my husband fell back to speak with our nephew, so he asked him to look up at a tree. And it was so funny to see that genuine scared reaction. Strangers who saw it were laughing! Ha-ha-ha-ha. Then, the bush man asked for a tip. \n\nIn the heart of Fisherman's Wharf, so set someone up the next time you're around. Don't forget to give him a tip. I've also seen him near Pier 39.", "author": "Margret C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "I love the Bushman since he got me some 20 years ago. What he does is pure fun. Always on Jefferson St somewhere, so when I am there, I specificly look for him so I don't \"GET GOT!\" :)\n\nDoesn't smell and never observed him aggressively solicting money which is nice too.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-30", "description": "As we were walking along the marina, my husband was trying to figure out how folks got down into the charter fishing boats (scary ladders hanging off the side of the marina wall).  We were clearly not paying attention to our surroundings because The Bush Man got us good.  I've never seen my husband jump like that, and I'm still laughing as I think about it.  Apparently, my reflexes aren't as sharp because I just stood there and cursed.\n\nTwo stars because he's \"entertaining\" at the expense of those he startles.", "author": "Olivia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "Never have I met such a consummate actor until I accosted The Bush Man.  \n\nSo much joy is to be had by watching this man dedicate his days to honing his craft without much compensation and to the dismay of shocked tourists who cannot comprehend this avant-garde artform. A homeless whack-job, you say? I say that he is an oft-misunderstood one who is married to the divine spirit of nature!\n\nThe Bush Man: A True Artiste, A Lover of the Arbor, A Beloved Comedian.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-03", "description": "December 27 2007 an overcast, cold day.\nHubby and I were walking The Wharf area after we stopped at Starbucks. \nI was walking in a slower pace than hubby enjoying my Venti White Mocha with Soy no whip and looking at the boats in the water. \nI looked ahead and saw a crowd of people and started to wonder why they were all grouped together.  Just chalked up to a tourists group.  Then I looked over at Joe's Crab Shack thinking of were to eat\n\nROOOOOOOOOOOOAAAAAAAAAAARRRRRRRR!\n\nWTF!? Holy Sheep Shit! I screamed like freddy Kruger just jumped out in front of me! Oh,no, wait its That Flocking BUSH MAN!  \n\nJust then I turned into \"One of Those People\" who had no clue, \"One of Those People\" who I use to make fun because how could they not notice him, \"One of Those People\" who became instant SF memories to that crowd of people who were just waiting there for a victim to take pictures of!  Ya, me born & raised in SF who mocked tourists.\n\nHubby all along said he saw him and thought I saw him too. But hwo could I?  Hubby was walking in front of me!  I think Hubby was in on it too.\n\nBut thanks for the Birthday Scare and a Great Birthday Memory! \nI made hubby take me to Alioto's that day!", "author": "Erika G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "Not sure how. this started but I love it this is one of the best characteristics that the Wharf has he sits still and quiet and BAM! suddenly a bush jumps out at u as u walk by. Your startled and instantly start to laugh when u realize u was a victim of this wickedly clever dude if your smart you stop a sec and watch this artist work cause that's when u really enjoy the trick. If u don't take it personal and realize its harmless there is no way u don't enjoy the moment with a laugh", "author": "El H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "OK. How can you not love Bush Man? Well I guess if he scared you so bad that you became Shat Man that would be a problem. This guy has gotten me a couple of times in the past 2 decades.  I just love the surprise and love his contribution to the quirky spirit that is San Francisco.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-07", "description": "Just like many of the entertainers in Fisherman Wharf, they are a bunch of ex-cons or felons trying to rip off tourists for loose change. All of them are a bunch of bums and the very least entertaining. \n\nThis Bush-Man conceals and hunker down curbside near a mailbox, garbage can or newspaper stand with a bunch of leaves and as soon as people pass by, he come out of the blue and scare the living daylights of the people. \n\nOther spectators find the random act funny and entertaining, and they reward him with the amusing show. And he makes a good-living out of what he does.\n\nIf he even makes an attempt to do the same act on Matt, Matt will guarantee that the Bush-man's days as the entertaining figure of Fisherman Wharf will be his last. Because Matt will file a lawsuit and sue him for every penny he's got.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-13", "description": "Watched bushman get a swift kick to the balls when he scared someone last weekend.  He complained to the person who kicked him while startled!\n\nHe is assaulting tourists, the SFPD needs to inflict the SIT/LIE law on his bush ass.  \nGet out of Fishermans Wharf Bushman.", "author": "Pug P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-12", "description": "I worked off and on in S.F. and would see the bushman all the time .. I  totally love him !!! its hysterical if you know hes there to watch people get surprised !!", "author": "Ginnie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "He's never tried to scare me, but I've witnessed other victims and it was great!", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Don't take life so seriously and learn to laugh at yourself... Not sure if it's the same guy everyone is seeing, but I saw him twice. He doesn't scream or harass anyone and saw him leave people alone who had kids.", "author": "Winston R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "Props for being named the \"Bush Man\" for foliage and not for being a disease laden wannabe porn star.  \n\nProps for being around forever, like when my friend Joey took me to see you a billion years ago, when we were actually getting along and he wasn't yelling at me to be his personal wannabe porn star.\n\nI don't know if you're like the postal service and do it rain or shine, but dealing with tourists is a bitch no matter how you look at it.\n\nI'd be irate if some preppy family all wearing their \"SF\" fleece sweatshirts stiffed me too.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "5 stars for successfully irritating uptight people, though it seems an easy challenge.", "author": "Mike A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "The pic posted aren't of Bush Man that passed away. There where two that worked the Wharf, one was David Johnson and the other was the late Gregory Jacobs my father. His services are being held Tuesday at Duggan's Funeral 3434 17th St and if anyone wants to send condolences to the family you can send them there. The services will be for family and friends only but he had a lot of friends. :)", "author": "Tyrone M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "LOL! got to see this infamous man in action one night down near pier 39 as i was strolling around with my bf at the time. we stood across the street and watched him do what he does best... scaring people! it was hilarious... we decided to cross over down the road and record the group of girls in front of us as we started walking towards him. documented and saved in case i want a good laugh filled with memories. hahaha!!!!!", "author": "Abby Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "BUSH MAN IS AWESOME!!\n\nEvery time I come into the city, he is always there!\n\nHe is an awesome man that sits on the side with a bunch of bushes. When he spots a \"victim\" he jumps and scares them!  It is extremely hilarious to see the reaction of individuals that have no clue..\n\nI saw this girl scream so loud, she punched her bf so hard and ran..\n\nOur group couldn't help it but sit on the curbside across the street just to see this guy do his job :)\n\nWe all put our cash together and tipped him $50.. \n\nTHIS GUY ROCKS!", "author": "Jay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-24", "description": "This guy is so cool. We saw him freaking out a group on the other side and my friend had to run over, get pics of him, then asked if we could get pics WITH him! My friend's friend told us about him and how some homeless people in SF are iconic.. well this guy is no exception. And he's so friendly too. \n\nBefore we came by to take pictures, one of the guys that he spooked came around to sit with him and spook another group. It was hilarious and it's so cool how he has such a positive energy about him.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "This guy got me this afternoon and each time I think about it I actually start laughing again, out loud. It made me feel like a little kid again to laugh at being scared and it was great fun standing nearby and watching the constant stream of new victims. I gave him two bucks, by far the best money/fun ratio of the whole trip. HILARIOUS!!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "absolutely hilarious. I could watch him for hours", "author": "Connie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-27", "description": "I have lived in the Bay Area for many years now, and the Bush Man is one of my favorite parts of the Fisherman's Wharf Area!!\n\nI can honestly say I've been gotten twice, my out of town guests have been gotten, and it's a pleasure to just watch the guy!!\n\nHe's an SF classic - he and the twins. Either sighting will make you smile and think \"I love my city\" :-)", "author": "Maureen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-26", "description": "The Bush Man ROCKS!!!!!!\n\nActually, I don't know if its true, but I've heard that there has been more than one Bush Man over the years.  Multiples, in fact.  If this is true, would that be Bush Men?...LOL.  There have even been stories of an out-of-towner who flipped out so bad that he threw him over the side into the water, trees and all.\n\nRegardless, how could I not give five stars to something that has brought me so much happiness over the years?  Just stand across the street or just down the street from him and watch the fun.\n\nAnother true \"Only in San Francisco\"...he is world famous...ya gotta love it!", "author": "Roy N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-30", "description": "Boo!!! This guy is a rotten; talentless hack. I think you would have to be kinda simple to seriously consider the bushman a street artist on any real level. Even dumber; if you gave him money to, scare tourists? Not cool.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "He's not startled me because well, I grew up playing barefoot on construction sites and swimming where half the sea life wants to kill you. I've got pretty good situational awareness. \n\nThat being said, the Bushman is funny as hell! I've *always* given him a couple of bucks, in good times and in bad, he *always* gets a laugh out of me and whoever else is around! \n\nYeah, I've heard there are at least two Bushmen, something like normal Bushman and crackhead Bushman. \n\nAlso, I've not seen him use eucalyptus leaves, it's just some sort of generic leafy branches. I'm surprised he can find them in the City, there's not a lot of foliage there. \n\nI can't wait to get to to Pier 39 and see him again! Maybe I'll flip him a $5!", "author": "alex c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "A San Francisco classic.   So silly and childish but who can help but laugh when unsuspecting pedestrians are confronted!", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-25", "description": "I was visiting The Wharf for Thanksgiving as a treat with my family. Bushman assaults my wife with a branch and yells \"Made you holler, give me a dollar\" then as we're walking away being thoroughly humiliated by all your 'fine' citizens laughing at me, he yells \"I made her holler last night too.\" This is how we're to remember The Wharf? Apparently this how SF wants it remembered because almost all of you are saying it's good clean fun. Yah RIGHT!\n\nTo all of the business owners on The Wharf, we will not be visiting again. You can thank the Bushman. Maybe he can pay for our lost revenue out of his \"tips.\"", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "The Bush Man scared the freaking piss out of me near Ghirardelli square. He was hiding along a fence among trees, next to other bushes. It was a far more discreet spot than out in the main area of the Wharf and damn it worked.", "author": "Justin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-02", "description": "Entertainment for days.  \n\nMy boyfriend and I sat atop Lou's, listening to jazz while observing the Bush Man startle passers by.  It's amazing how oblivious people are.  He got someone every four groups.  It was pretty funny and it never got old.  What a great gimmick!", "author": "Elise G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "Bush man = San Francisco.  A little crazy and a lot of character.  After being a way for two years I forgot about him.  Was walking by fisherman's wharf and saw something that looked like a bush but didn't really give it a second thought.  He got me GOOD!", "author": "Robert P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "rumors i heard not long ago were true.. :/  R.I.P.  bush man.  tooo sad.  glad my daughters were able to witness your simple yet cleverly creative genius!  there's another one trying, but not the same! no other act could capture people on both sides of the street. no other act had us grab our cameras or hearts. :)", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-29", "description": "I think it's sad that a guy who sits on a bucket, hiding behind a clump of bushes scaring tourists not only has his own Yelp rating but makes $60k/year doing it. What the f^(k ???!!! Why go to college? Why have a job? I might as well do the same thing a couple of blocks down and keep all of that money as undeclared income! There is something definitely wrong with a society where this type of behavior is actually applauded.\n\nPlus, he's hella irritating.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-01", "description": "Some of my oldest and best memories of when I was younger involve the Bush Man. I don't know how long he's been around, but I can recall being 6 years old and seeing him jump out at unsuspecting tourists.\n\nThe best one? When I was 20 and was showing friends around the Embarcadero. I told them about the Bush Man and what to expect from him. Later in the day, we were walking down to Ghiardelli Square, completely oblivious to anything around us, when the Bush Man jumped out and scared ME! Now that was one for the books.\n\nWhether you love him or you hate him, this guy embodies the San Francisco Experience.", "author": "Natalye R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "Everyone must love The Bush Man. He is a unique part of San Francisco and if you go to Fisherman's Wharf and weren't scared by him or didn't get to see him in action then you missed out. \n\nAs far as people ranting that he is \"assaulting\" pedestrians - you seem like you need a beer dude.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "This is such fun free entertainment ! A homeless looking guy sits behind a fake bush he brings then jumps out t tourists! I mean how can you go wrong watching that! \n\nSurprisingly it is a great trick and people will line up and down the streets to watch. He works off tips and is very funny!", "author": "Allen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-03", "description": "First of all, does anybody know if Mr. Bush Man lives on Bush Street? As long as that street is, it's certainly a possibility. Corny? I kid, I kid.\n\nThe Bush Man is a funny man. I've ruminated on his career choice. A person has to wonder, however, where does he get his \"bush\"? I empathize with the poor branches that were broken off from some unsuspecting tree. And then, when his leaves turn brown and start to break off, he has to go on a hunt for fresher branches. Plants and trees are inequitably defenseless and are no match for Mr. Bush Man. I feel sorry for them! I really do. I've gotta say, this is not a good representation of fundamentally San Franciscan, environmentally-conscious values. I mean, what would the Europeans or Canadians think? Haven't we, Americans, already given them enough to scoff about? I seriously hope that they are the premium BPA-free plastic kind that you can get at some craft store that just look real. I would definitely be more open toward supporting a \"green\" \"street performer\".\n\nTragically, I cannot admit to him succeeding in scaring the bahjeezus out of me. I was walking along the pier with my best friend when he viciously popped out from behind a garbage can. I was so enraptured by my conversation with the BFF that I hadn't noticed. It was then when I came to notice the small crowd of people who had previously gathered there, hoping to luxuriate in the imminent extreme trauma inflicted upon a mindlessly wandering tourist by the Bush Man. This time, they were laughing AT him for his very fervent, but epically-failed, attempt at startling me. Thanks, Karma. :]\n\nI smiled warmly at him as he scowled at me while retiring grudgingly back to his post. You can't win them all, buddy. What can I say? It was a life lesson.", "author": "Phoebe J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "If you asked me my top 5 things I love about San Francisco, The Bushman would be on that list. He's been scaring people in San Francisco since 1980 and evading criminal charges for almost as long. Apparently some people don't have a sense of humor, he scares them, and then they complain to the cops. Luckily, The Bushman (aka David Johnson) has been able to fight every misdemeanor in court. The people have spoken- and we love The Bushman!\n\nIf you're visiting the city or had a bad day and need a pick-me-up, head down to Fisherman's Wharf and keep an eye out for The Bushman. He's utterly entertaining to watch -you will laugh- and it's terrific, innocent, fun. Don't forget to tip him... apparently in a good year he makes up to $60,000, but with the failing economy and less frequent tourism, I'm sure he's not making as much. It would be a sad sad day if The Bushman packed it up and got a normal 9-5 job.\n\nBy the way, I've read some articles that say a copycat is around the Pier, so ask his name before you tip him. No supporting the idea-stealing phony! \n\nHere's some classic Bushman footage to brighten your day. Enjoy:\nhttp://www.youtube.com/watch?v=DN-Sieh3rko&feature=related", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "This guy has been doing this for years scaring people on the wharf. He does, his gotten me a couple of times. It's really funny act & the wharf just wouldnt be the same without him.", "author": "Alexandra A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "Who wouldn't like the Bush Man.  It's different if he tries to attack you then use your self defense training or yell like a little girl!  He can be found anywhere along the Fisherman's Wharf strip where all the tourist congregate and follow each other along the kitchy stores, museums and restaurants.  \n\nHe is considered camouflaged, camouflaged rather well  if he lived in a forest of shrubbery, however, among the urban flow of lemming like tourists,  he blends in pretty well when most people don't look beyond their 5 foot radius.\n\nEntertaining to watch from a nice chow hall, with a nice bread bowl clam chowder, hot cup of something and view of the bush man.", "author": "Adrian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-08", "description": "Ahhh, a staple in San Francisco. Take all your unsuspecting out-of-town friends here for a great laugh! When I was a newbie, he made me cry once...", "author": "Lucky N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "Cool! I didn't know I could write reviews on street characters. (picture on my profile)\n\nI first discovered him during the Human idideron (spelling? you know, the annual race where teams of people dress up in different costumed themes with the only rule to running the race is: the shopping carts move along with you and you stayed in character. Kinda like the Alaskan idideron except no dogs, snow, or sleds). \n\nAt pier 39, a guy in camouflage laid down on the ground in bush shape and there was a guy behind a bush on the sidewalk! He wasn't part of the race! I almost lost my rod stewart wig laughing.  I have pictures!\n\nKudos to the bush man.", "author": "lily l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-13", "description": "Gotcha! Yup the bush man made me yelp and holler as i walked in a tourist like daze  along fishermans wharf! Got my friend L to jump high! Ay nako!", "author": "Jabo E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-18", "description": "I remember the first time me & my girlfriend was walking down there..\ni stood like right next to the bush and i was leaning against the rail looking at the boats & the water then i was thinking to my self. if there is water under us how come there is a bush right next to me?? hmm?? next thing i notice was like everyone behind the bush was staring at us.. i was like hmm...then a face popped out of the bush.\nMy girlfriend screamed haha everyone was laughing..i was screaming on the inside. like OMG!\n\n\n\nTHE BEST THING ON Fisherman's wharf pier 39!!", "author": "TeaBoy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-11", "description": "Why people enjoy this while someone else gets scared? Can't he find something better to do? I was not thrilled when I was scared by him. Luckily he scared me not my five year old son. Otherwise I would be mad at him.", "author": "renee b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "Fun way to introduce the tourists to the SF Bay Area. But he should look into expanding, maybe get an intern.", "author": "Randy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "Ok I just have to say how awesome this is! There are other street performers who do the typical fare. Living statue, acrobatics, singers, etc. this guy is completely out of the box! I love that! Stay strong bush man!", "author": "Anne I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "Hilarious.  Who cares if he doesn't pay taxes on his income, maybe we should have all been smart enough to hide behind bushes and scare people. Our fault.  Oh well, this guy is the best.  A must see of SF", "author": "Juliana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "Funny and creepy at the same time. Amusing to see him scare tourist's with his unique form of entertainment. I was shocked to find him on Yelp when I was checking in at another Fisherman's Wharf business. Definitely more unique then many of the other Robot Men and spinning paint artists.", "author": "Drew N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "The Bush Man got me good. Probs the best Bush Man I've come across in all of my years. #1 Bush Man.", "author": "Clarissa O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-12", "description": "Straight up one of the funniest things I've seen down there. \n\nThe other time was a clown making fun of my lil cousin....\nbut this was by far some of the funniest shit. \n\nIt's also one of the reasons why I'm on the lookout. It's not that hard to spot.....if you know what to look for. Just look for a large group of people staring at something....seeming to wait in anticipation of something to happen. Generally I see them a mile away and I also join the waiting game....\n\nfor that all so tempting moment when an unsuspecting tourist comes walking by....\n\ninto the eyes...those dark scary eyes....of....of the...\n\nBUSHMAN!!!\n\n*swear to gawd I'd want to F that guy up if he did it to me tho\n;D", "author": "John-Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "It is so stupid it is funny. Bush Man barely hides, in plain sight, where a tree branch has no business being. Nothing funnier than rubes being startled.", "author": "Paul I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-07", "description": "I don't find this guy entertaining. I didn't find him funny the first time I saw him out here while on vacation, and I don't find him funny now, after walking past him probably 500 times.  I don't hate the guy, I don't wish him ill. I just don't find him funny.  And I find the tourists, standing around laughing uproariously over this guy, a baffling and sad commentary on the devolution of our society.\n\nBut I'll give him this much: he's smart enough to recognize my dog after one ill-advised encounter.\n\nNote to public: Jack Russells are small in stature. But their teeth are big and their tempers short.  Suddenly jumping out from behind some leaves and sticks, startling them and yelling \"AAARGH!!!\"? Never, EVER smart.\n\nLuckily, I knew what was coming and had my dog on a very, very short leash, because when this guy jumped out, my dog went seriously bat-shit crazy with fear/anger.  He never got close enough to hurt the guy, but let's just say my dog told him, quite forcefully, that he was unamused and not to be trifled with.  (Now this WAS entertaining)This guy has never, ever forgotten, apparently, because he never makes even so much as a peep when we pass by.\n\nZero stars for this man's \"entertainment\" abilities.  Zero stars for the mouth breathing yokels laughing themselves silly.  \n\nFour stars for my dog going bat-shit crazy and giving this dude a taste of his own medicine.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-02", "description": "Fisherman's Wharf is useless without the Bush Man. In fact, I think he may be the only entertaining part about the whole place.\n\nI once sat at Joe's Crab Shack with the sole purpose of watching the Bush Man scare the living daylight out of numerous unassuming tourists.\n\nI just wonder if this guy pays taxes... I mean, he must make a KILLING. I once saw a woman tip him with a $100 bill (no joke).\n\nSometimes I wonder if taking out all of those student loans was even worth it... Apparently scaring tourists is a very lucrative college alternative.", "author": "Felicity M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-29", "description": "I saw him  scare a young Japanese couple once and they were not happy.  I was new to San Francisco and did not know who he is, I just thought he was a jerk scaring them.  Many years pass and...\n\nNews flash:  The Bush Man is Gay!\n\nHe scared me and my date last Xmas.  I was generous and gave him $20.00 because it was cold and dark and he was out by himself during the holidays.  And I tried to take an iphone picture.  First she took a picture of me and him together and then I was to take her picture with him and he kept sticking out his tongue at her in a mean way.  I ask, why  you doing that, just smile but he just kept on doing it and saying over and over again \"No, I don't like her, I like you!\"\n\nNeedless to say, we didn't really enjoy our run in with the Bush Man.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-01", "description": "I encountered you once in my life when I was 18 and going to Hooters across the street from where you and your bush were.\n\nYou should be a roll model for all the SF Crackheads and Homeless Folks.  They should at least entertain us, vs. just begging for money to spend on crack or 40s.\n\nI had a dream about this concept to and it went like this...\n\nBum - \"Hey!  You got $5 you can spare?\"\nMe - \"Would you spare $5 for me if you had $5 and I asked you for it?\"\nBum - \"Awww I see how it is.\"  Shakes his head and walks away.\n\nFor reals though...A lot of bums and crackheads are hella disrespectful and ungrateful.  Sure you may have all had it tougher than all of us growing up in shitty conditions, but we didn't make you homeless or a beggar.  You all grew up with the same opportunities of a public education through high school and have the same opportunities to apply for jobs and do something you can make money at, all you had to do was try.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "I didn't realize this guy had such a following!  I watched him scare my hubby and son (who were about 10 paces ahead of me).  I have never seen them jump so high and I don't remember laughing that hard in a long while!  Good Show!", "author": "Bari S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "Ok so technically the Bush Man may not be a business, but he is exclusively located across from Joe's Crab Shack and is without a doubt an S.F. staple that deserves 5 stars.\n\nIf you have not seen the Bush Man, you're missin out. Let me break it down... This is a man who sits down on a milk carton in the middle of a busy, tourist filled Fishermans Wharf sidewalk, covers himself up with tree branches, and then scares the bejesus out of unsuspecting passersby. It is HILARIOUS! \n\nThe Bush Man has been doing this for years now, and you can always catch crowds of people on the opposite side of the street watching in anticipation for the next victim he frightens. From pretty girls to big macho men, anyone can fall victim to the Bush Mans game. \n\nSo if you are a tourist visiting SF, or a native who already knows the Bush Mans trickery, you'll agree that there is never a time this guy is not funny. He is located at about 242 Jefferson St... so when you see a random bush on the sidewalk, look out!\n\nHere is a video of him doing his thing! http://www.youtube.com/watch?v=9cbBdydQlrk", "author": "Greg G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-23", "description": "Evil and entertaining.  I despise the Bushman.  He brings out the worst in everyone.  Laughing at others, causing fear on several levels, being an asshole.\n\nBut I laugh.  I hate that.  Damn you bushman.  You suck and I hate that I find it funny.", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-13", "description": "A long time ago I witnessed Bush Man scare a tourist's hot dog out of its bun.  The poor tourist looked down at the hot dog on the ground for the longest time.  All he had left was a bun in one hand and a plate in the other.\n\nAnother time long ago my friends and I got smash shit-faced drunk.  We see Bush Man and walk behind him.  I leap in the air behind him and scream the twigs out of his hands. \n\nSome day I would like to get drunk (not ideal but necessary) and wear a bear costume, creep up behind him and roar!  \n\nDid you know Bush Man averages $60k annually?", "author": "Yasmin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-27", "description": "One of the great staples of crazy hobos in S.F. The guys hides behind a branch then pops out and goes, \"WHHAAAAAA!\" when people walk by. It's fricking awesome. Nothing like having lunch somewhere around there and hearing \"WHAAAAA\" \"eeeek!!\" every 3 minutes. \n\nI don't know where this ingenious entrepreneur came up with this idea. Perhaps he was watching a lot of Japanese TV. I any case, I think his comedy stylings are worth a dollar. \n\nI can't help but wonder how his day starts, does he have to go and gather his branches? Does he have his own plant that he trims them from? Are there certain types of leaves that work better for urban camouflage than others? \n\nThis guy needs one of those Budweiser \"Real Men of Genius\" ads. Seriously. \n\n\"Here's to you Crazy Bush Guy.\" \n\n\"Mr. Crazy Buuuuusshh Guuyyyyyy!\"", "author": "Andy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-05", "description": "Awww, come on fellow Yelpers.  Why the Bush Man hate?  While I respect and even appreciate where you're coming from, at least he's not just sittin on the sidewalk with a sign begging for money like all of the other beggers scattered along our city blocks.  He makes people laugh!  He makes ME laugh!  People actually come here from far and wide to see him!  And while it may get old for some, it never gets old for me.  He's a San Francisco legend!  And he's harmless.  I purposefully perch myself in a place on a sunny day when the tourists are out and ready for the scare, and laugh everytime they jump.  Call me easily amused. Call me silly, but I love him!  You hear that Bush Man?  I LOVE YOU!", "author": "Whitney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-10", "description": "I've known about this guy since my brother moved here more than ten years ago, yet he still managed to surprise me every once in a while when I would take people down to Fisherman's Wharf.\n\nIt's the cheapest kind of humor, but it's really funny.  I've actually spent almost an hour watching this for purely social reasons.  Once people have been scared by him, they walk to the crowd of people watching him and delight in other people getting scared.  Besides the cable cars, this guy's the only reason to go down to Fisherman's Wharf.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-12", "description": "I LOVE this guy! Every time he cracks me up! I even stand there just to watch people get the crap scared out of them! SO SO SO funny!\n\nBeware of the bush man! LOL", "author": "Samantha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-08", "description": "4/17/2009   \n\nHhhharaaggrrgrgagaggagahhhh!! (as I'm shaking my lil bonzai tree on my desk)\n\nA dark homeless man who chills all day long shaking leaves and branches at people..... makes more crispy & dirty dollar bills than me, and that's all he does.....", "author": "Hungry Dan o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "Holy moly this guy is awesome. Through my pre-vacation research prior to our San Francisco trip I had briefly come across this folklore phenomenon. Well little did we know, during our visit to the Wharf to try the traditional sourdough bread bowls we just so happened to take a seat in prime view of this legend. All of a sudden a bush nearby began to shake, a figure popped out, and children shrilled. What a neat experience!", "author": "Beki S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "The Bush Man will back away quickly if you walk by him with a dog. Apparently he's been peed on one too many times...", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "Holy Frock. He gets me every time. \"Hey, Why are those branches moving??\" Usually, its when we decide to play tourist down by the wharf, BAM!!  Merry Xmas crazy lady with a 3 year old and unsuspecting husband. We just keep walking on, all cool like, clucking about \"What the hell?\" But..seriously, folks...who's giving David a ONE STAR? Sore souls.. Rock on and live well, Bush Man.", "author": "Rosemary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "He is a great sorta of entertainer and you can laugh at the expense of others. He has gotten a good whack with an umbrella from an ex-colleague when he scared the daylights out of her! \n\nA lil birdie mentioned that he has been making some good amt of $$$!", "author": "Yan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-24", "description": "Saw someone yelped him..so i had to.\n\nNearly had a heart attack late last year.  I'm only 29.  Too young to die.  But when walking up towards In-n-out, and a man comes from nowhere, (and by nowhere I mean behind a random pot with a random bush on the sidewalk) and jumps right in front of me, it nearly killed me!\nNote to self:  When walking the wharf, if you see a large group of tourists standing around looking like they are waiting for something, look for the bushman.  They have usually just got gotten, and are waiting for someone else to die.   Get him before he gets you.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "Another San Francisco legend...\n\nThe Bush Man is always pure entertainment, especially for the tourists. Find him at Fisherman's wharf scaring people walking by. I won't give away where to find him, or what he does. I'm sure you'll eventually discover him walking down the street. When I used to be a kid, I fell for it once...everyone falls for it! It's great. \n\nHey, it's funny and harmless. He's homeless, but you've gotta give it to him. He's clever, and isn't the average \"can I have some spare change\" man. Just don't crowd and oogle at him, it gives him away! :) \n\nAfter all these years, I still enjoy stopping by watching him scare tourists.", "author": "Catherine O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "I love this guy! I was trying to describe him to my friend in NY and thought \"Hey, he's gotta be on Yelp pr something\". When I looked only one guy has reviewed him. Aw. Well, I guess she'll have to come from NY to experience him herself. \n\nIn any case this guy is awsome and so much fun to watch. I love seeing the tourist in their shorts anticipating SF's blairing hot summer to cut through the fog anytime now jump and squeal at the bush man. \n\nI heart SF fleece sweatshirt : $18\nBoudin Clam Chowder in a breadbowl : $9\nWatching tourist get the \nscrap scared out of them : Priceless", "author": "Alia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-02", "description": "This man is the reason why San Francisco is so awesome. Where else can a guy, just some guy, sit at a tourist destination with a bush and scare the shit out of them AND not get hassled by it? \n\nThe Bush Man is one of two reasons to come down to Fisherman's Wharf (the other, clearly, is In N Out). The best part of him scaring tourists is the roar of laughter that comes with it. It's the best free show in town.", "author": "Jackie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-18", "description": "The truly awesome thing about The Bush Guy is that he will scare people walking by when there are dozens upon dozens of people across the street or way up or down the sidewalk who see the victim about to get had.\n\nThe man is a genius and one of the few undeniably cool fixtures at Fisherman's Wharf.  I hope he's making a killing.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-07", "description": "Look, you're not supposed to make it obvious when you watch the Bush Man scare people otherwise it defeats the purpose because they'll know what's coming. \n\nI'm all for giving people money who need it, especially if they're making an effort to earn it in an original, interesting, fun way. The Bush Man does just that. More power to him for giving SF even more character.", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-20", "description": "HOLY CRAP Bush Man has his own Yelp rating?!\n\nI can't believe Bush Man makes $60,000+ year doing what he does!", "author": "Mari K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-17", "description": "Haha! The bush man is on Yelp! Wow. \n\nI'm not actually a big fan, but I give 5 stars, because I agree: he's a Wharf mainstay that deserves to be recognized.\n\nDoes he really make 60K a year?? How was this researched?", "author": "Ramon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-26", "description": "This guy better be in the SF Lonely Planet.\n\nCrack is whack, unless its this entertaining.", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "Oh bushman if all homeless people had your sense of humor, and a funny gimmick they would all have money to buy food/booze/drugs whatever it is they spend there money on. I can sit and watch this guy for hours. \nI watched him for a good 20-30 min and he raked in some serious loot. I am thinking he is not homeless but an entrepreneur in the street performance arts in the fisherman's wharf area.", "author": "james p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-02", "description": "Classic.  I know he's gotten me in years past, when I was young and still a tourist to this city.  Now it's pure comic entertainment to see him sit there... so innocently with his silly bush-tree branch-thing... and scare the bejesus out of unsuspecting tourists!\n\nHe gets 5 stars for novelty.\n\nP.S.  Jackie I. is right, In N Out Burger is the ONLY other reason to go to the wharf!", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-10", "description": "There's just something very entertaining about seeing big hunky men screaming like little girls when the Bushman pops out of his branches. Then its not so funny when the big hunky men want to beat him up for destroying their delicate bubble of masculinity.", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-01", "description": "I never thought I would be scared by The Bush Man, since I so rarely venture to Fisherman's Warf. But I had a friend from out of town who wanted to head over for some clam chowder. After the chowder on our walk towards Ghirardelli Square she sneezed, I said 'bless you' and next thing we know a bush jumps out at us yelling in a deep voice... 'BLESS YOU!' The Bush Man was closer to her so she screamed, pushed against me, I yelled and we both flew against the window display of a nearby shop. Of course, there were tourists with their cameras taking pictures and video taping our moment of glory. HA! Should have known we had it coming. The best part was, The Bush Man then asked US for money because he scared us. I THINK NOT! Leave that to the tourists waiting for people to walk by. If I go near the area, I will be sure to steer clear.", "author": "Misty G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-28", "description": "How much money does Mr. Bushman make??? That's what I think about when I pass by...\n\nI remember Mr. Bushman since my middle school days when I would come to frisco for field trips. I like to watch from across the street and laugh at all the tourists get scared. lmao. My husband can stand there for days laughing.\n\nAnd no, I never have been frightened by Mr. Bushman!", "author": "Holly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-01", "description": "5 stars for making my \n\nVAGINA CLENCH after some major\nSHARDAGE in my knickers  \nfrom your frightful scare x2\n\nAll I wanted to do was go to Hooters and\nto my dismay, I was the focal point of \ntourist amusement. \n\nKudos for reminding me that I am a complete failure for\nmy inability to avoid your scare the second time around. \n\nFortunately, for a split second, you made me forget that I have \na never ending, dark cloud of rain continously following\nme overhead mid-chuckle.\n\nBLESS U, BUSH MAN!", "author": "Eddi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-22", "description": "Everyone talks about Frank Chu, the local San Francisco character... but have you ever encountered Bush-Man? He hides behind a bush near the Wharf and covers himself with some leafy branches, then when a family walks by, WOOOO!!!, he jumps out and scares everyone. I saw him back in 95 on my first outting out here, and I've met people who have seen him as well over the past ten years. Rumor has it, that he was asked to stop his performance when he scared an elderly man into a near heart attack. It's ok Bush-Man, wherever you are in SF, we believe in you!", "author": ".V X V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-15", "description": "I LOVE this guy! Every time he cracks me up! I even stand there just to watch people get the crap scared out of them! SO SO SO funny! \n\nBeware of the bush man! LOL", "author": "Samantha R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-23", "description": "Bushman vs. Silver and Gold guy\n\nWho would win in a street side battle for the title of \"local flavor\"?", "author": "Xian Pao T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "I actually got scared by The Bush Man a few years ago . I thought he retired because the last time I brought my cousin that was visiting from China to Fisherman's Wharf , he wasn't there . But then a couple weeks later , my aunt told me that she saw him . I'm glad that he's still around . I like him ... it's funny watching people get scared by him .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-16", "description": "Totally agree with Mona.  It just made me mad when he scared my 3 year old daughter.  Its not funny.", "author": "Meghan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "bush man got me good when i visited fisherman's wharf 2 yrs ago.\ni should have known something was up when a crowd of ppl surrounding him and across the street were staring in the direction i was walking.  definitely a good laugh!", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "I can't believe that I'm the first guy to write a review of San Francisco's very own, very famous, The Bush Guy.  I'm all tingly!  Deep breath, and here we go.\n\nI hate going to Fisherman's Wharf as much as the next guy (as long as the next guy is a guy who really really really really really really really hates going to Fisherman's Whart).  If I wanted to hang out with people from Oklahoma Falls, I'd just move there and get it over with.  The food at the Wharf is horrible, the crowds are insane, and the people make a convincing case for genetic cleansing.\n\nBUT, there is one Syren song strong enough to make me jump into the (figurative) waters of the Wharf, though my body may (figuratively) break on the rocky shores: The Bush Guy.  For those who haven't seen him, here's the deal.  He's a guy holding 8 or 9 branches in front of him, sitting on a plaster bucket on the sidewalk (sea-side, not inland side, of Embarcadero).  He \"hides\" behind the branches (which collectively form a \"bush,\" if you will), and waits for a tourist who is not paying attention to his or her surroundings.  And when said tourist draws nigh (and they do about once a minute during busy days), he shakes the bush and loudly growls at them, commonly eliciting jumps and grunts, not infrequently eliciting screams.  This is more entertaining than watching a monkey hump a football.  I have often stood on the other side of the street and watched for almost an hour at an endless parade of rubes being scared witless (not a long trip for most).\n\nWhen you go (and you know you will), watch carefully to keep from being part of the show.  Once you've spotted The Bush Guy, cross the street and watch from there.  Gawkers who stand too close just alert potential marks and make it less fun for everyone.  As you watch, try to identify the people who are going to get scared.  Wholesome family fun for everyone!  When you're done, give The Bush Guy a dollar and walk off, realizing that you have just defined the term schadenfreude.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-10", "description": "while i appreciate the fact that he makes a living scaring tourists in fishermans wharf, this guy is a complete asshole.\n\ni once saw him chase down a family of three after the little girl took his picture and at six years old didn't realize she needed to leave him a tip.  he literally took off running after them bush suit and all screaming \"if i took a picture of your fucking bush and didn't pay for it, you'd be pissed too!!\"\n\n*truthfully i would go with creepy silver painted robot man, he is at least pleasant and gives out lollipops.", "author": "Jessie J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-10", "description": "I'm glad someone put up this \"entertainer\" for review.  I was amazed to find out he's a local institution!  \n\nYes, it's a poor commentary on our society when some wino gets paid to scare tourists by a crowd of other idiots.  However, it would be acceptable if he used some discretion and only scared healthy adults.\n\nUnfortunately, he doesn't have any discretion.  How come I'm not surprised?\n\nThis guy definitely needs a bodyguard, because he's reckless and stupid.  He scares little children, who often are eating food from the nearby crab shacks on the pier.  If some kid chokes some day because of this bum, he'll be lucky to escape without getting pepper-sprayed or tazered by some angry mother.\n\nIt sure would be funny if he scared someone's dog and received a good bite on the leg.  I'd get a good laugh out of that!\n\nBetter yet, maybe those \"Improv Anywhere\" folks could stage an elaborate comeuppance for this guy and give him a taste of his own medicine.  Get creative!  There's a ready-made mob of spectators available.\n\nA long time ago I heard about a bunch of teenagers who beat a homeless guy to death for apparently no reason.  I always wondered how someone could be so cruel.  Now maybe I have my answer--perhaps they were once scared at a formative age by the \"Bush Man\".\n\nDon't molest the little ones, Mr. Bush Man.  Stick to healthy adults and leave the old ladies and kids alone!", "author": "LA S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-17", "description": "If you visit Fisherman's Wharf you need to track down this guy.  Could keep me entertained for days.  I read that he has been doing his thing for almost 30 years.  Make sure you give him a few bucks for making you laugh.", "author": "Ken M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-08", "description": "Ok so I stepped outside my lawn and saw a big piece of my bush missing (that hella didn't sound right)..  I'm hoping the Bush Man took it.  At least it would have been for a good cause.  Otherwise, there's a weirdo lurking in my neighborhood stealing a chunk of bushes in the neighborhood.. Unless it's the same asian people going through my recyclables trying to get money for wood too. =T go fig..", "author": "Jen A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-18", "description": "Having lived in San Francisco's North Beach for some years and having encountered this possibly dangerous degenerate (bushman) and then reading all the favourable reviews about this 'passive/aggressive' lay-a-bout ; I can only refer you to the very prophetic movie comedy 'Idiocracy' for my response as to the inexplicable  popularity (reviews) of this 'non-asset' to the tourist trade in S.F..", "author": "Randy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-15", "description": "i got slapped pretty hard for laughing, and not warning the woman as we approached.\n\nthanks bush man.  it was worth it.  8D", "author": "Ethan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-22", "description": "What the hell is wrong with you people.  This man is a legend.  You all are just sour because you were just strolling the wharf, having a good time, enjoying the weather and the smell of sea lion poop when BAM!!! the Bush Man strikes again.  Then you get all butt hurt cuz the crowd gathered across the street laugh and point.  Get over yourself, it's funny.", "author": "Emily X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-02", "description": "This guy is pure entertainment.  Street performers, some of them star-quality, abound on the sidewalks near Fisherman's Wharf, but this guy's act is truly simple and unique.  I won't spoil it for you, but we watched him for over an hour from Joe's Crab Shack one afternoon.  If you're in the Fisherman's Wharf area you will be sure to see him.  He has write-ups on SF Gate and in the Wikipedia.  I recommend you don't read the articles until you've seen him yourself.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-16", "description": "When we have out of town guests and are making the obligatory trip to the wharf (does anyone head down here without guests??) I always get wrapped up watching my favorite street performer in the city. It is amazing people do not notice the random branches of leaves sticking out of the concrete. It is like watching an episode of America's Funniest Videos with out the mind numbing commentary (wow, this joke about AFV is both originally witty and topical). I've read that the local merchants are constantly trying to get rid of him, but I hope he is there bringing local flavor to an area overrun with homogenized chain stores and tourist traps for a long time to come.", "author": "Bucky K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-01", "description": "I came across \"the bush man\" once.  He scared the hell out of me and I screamed my head off. ( I got scared at the Universal Studio by a guy in a scary mask once and my screams caused several others to start off a screaming match lol...)  My friends were glad I were walking in front of them.  That's what happened being a PIONEER.  :p", "author": "Bella A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-25", "description": "I love a good laugh.  Whenever I need one in a jiffy, I cruise by the BushMan and watch him scare the bejeezus out of distracted tourists for a while.  It reminds me how the best things in life are simple and free....but don't let that deter you from offering the BushMan a tip. BushMan gotta eat, too!", "author": "Sheila G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "I guess he's good, he sure got me and my friends a couple years ago lol", "author": "Crysthel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "There are several people that play the role of \"Bush Man\" near Fisherman's Wharf. They can be found along the sidewalk between the famous Fisherman's Wharf sign headed toward Ghiradelli Square. The gig: A man sits low to the ground hidden behind a hand-held bramble of bushes. When an unsuspecting person passes by (amazingly, they do all the time!), he moves the branch and sometimes makes noise to frighten the living daylights out of the person. Cruel? Maybe a little. Funny? Most certainly. Especially when he gets two or three people at once. Be sure to tip him a little something - whether you are the unlucky passerby (c'mon - be a good sport!) or if you are part of the roaring, laughing audience.", "author": "S. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-27", "description": "You actually scared me a few years ago, I took off on foot like a mob was chasing after me with torches.. and for that you get 5 stars.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-18", "description": "When I worked on Jefferson street, the Bush Man would operate outside my store.  All morning I'd hear him do his work... and screams of profanity spoken in languages from around the world.  5 stars for a local icon and the good sports who support him.", "author": "Clay K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-18", "description": "I love the Bush Man! I'm laughing right now just thinking about him. Great free entertainment. I'm from Orange County and I hate all the touristy stuff by the pier, but the Bush Man is a must do when I visit.", "author": "Stephanie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-02", "description": "I work down at the Wharf, and sometimes I just meet some really stupid tourists who are just plain asses.  This awesome man helps me get oh so sweet revenge.  \n\nBush Man is a hero.", "author": "Yelsel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-30", "description": "Fantastic entertainment. Love to see him spook tourists. He needs more leaves on his bush. Sometimes I cannot believe that people fall for it - a guy behind a bunch of sticks! It's great.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "scared my mom. she thought it was funny & she's 70 with a two bad knees.\n\nget  over yourselves - you live in a city w/bushman.", "author": "Lawrence K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-15", "description": "I thought the bush man should be here.  He's a cheap form of entertainment if you happen to have to host someone at the wharf. (by the way, eat at In-n-Out while you are down there!)", "author": "Gene X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-16", "description": "i will have to disagree.  after he scared a friend of mine, he said, where's the cash??   I said I wouldn't give him money for that!!  Absolutely ridiculous...", "author": "Mona D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-06", "description": "Scared the shizzy out of me. Then we stood and watched him scare the shizzy out of passing tourists. What a laugh we had. He's awesome.", "author": "Valerie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-09", "description": "this guy is a legend.... i mean anyone who gives him less than a 4 star rating has no humor what so ever... those who are bitter were probably scared shietless and now have to talk about it on here... the bush man is there for one reason... that is to entertain... the reason why he has been there for so many years is because of his success... hell its his living... for those who say its obvious bla blah blah... then why does he always still get someone... Anyone who lives in SF already knows who he is and where is it when you go to fishermans wharf... i get disappointed on a day or time that i go and i dont see him. So lighten up people and enjoy watching a legend at work", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-22", "description": "I don't see how assault is funny.  Assaulting other people is a crime.  It is especially sad that adults are teaching kids that frightening other people is funny.    I can't believe the San Francisco Police Department allows this.  I am disappointed in the Pollice Department.  It is especially sad that so many people stand by and laugh.  The victim has no choice in the matter here.  He also picks on women.  He seems to enjoy making them scream.  What a sicko!   He also says he pays taxes but that can't be true, at least not the appropriate business taxes, because his \"business\" is not registered with the Ciry of San Francisco.  No surprise there.  Please don't pay this man a dime!", "author": "Barbara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-13", "description": "Well, ya gotta love this guy's business model; I'd kill for his client list.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-20", "description": "My friend says: \"I could watch him for hours.  He should franchise  He's good, clean fun.\"...But upon googling:  he was both \"complained about\" and \"entertaining\"....and that's what I agree with.", "author": "Rebecca M."}
