{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "From a Golden State Warriors fan's perspective, I like the name of the taqueria, \"The City\". \n\nThe configuration of this taqueria is very unique. It is not big from the outside and very narrow inside, but it is long with surprisingly a good amount of seating and dining area.\n\nFrom the newly-installed digital menu, the prices are just as competitive as anywhere else. I ordered the Grilled steak super burrito for $10.00, which is the average price. You place your order through the chefs in the very back, who cooks and grill your meat and tortillas right in front of you. Basically, you know and visualize your meat are cooked fresh.  All the other condiments are colorful and separated in another part of the kitchen. You have to like that for freshness.\n\nThe chef knows how to grilled the meat to perfection. The steak was very flavorful without being overly-burnt. The super burrito has a perfect amount of the condiments. The melted cheese was very sharp. Sour cream was not excessive. The guacamole was green. And the hot salsa was a nasal-opener. \n\nI don't go to that part of Divisadero Street often. But the burrito is just as good as any. And yes, I also liked the name. I am a big fan.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-04", "description": "The food was okay the service was awful. The guy was rude with me because I was taking to long to order. He even told me that if I did not like what I was seeing I should go to the taqueria next door. \n\nIn terms of the food everything was just okay. The pico the gallo was missing some flavor.", "author": "Margarita T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Had a great experience here!\nWhile I'm typically inclined to go to another nearby Mexican joint, I wanted to try something different.\n\nI got a taco salad and enjoyed it. I loved how they fried the shell right in front of me. It's all very fresh and made to order. My friend really liked his burrito.\n\nI would definitely come here again. Staff was nice and food was reasonably priced.", "author": "Emma B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "Only recommendation is need better vegetarian options but that's the same things for most places. This hot spot need to be talked about more in the Bay Area! Fresh Fresh to death! They cook meats to order!", "author": "Tippy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "I just arrived to SF from SD and this place is by far the closest to real Mexican food. I had the carne asada and al pastor torta and it was a perfect combo.", "author": "Dante D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-08", "description": "The chef takes your order and you can watch him prepare your dish.\n\nI ordered carnitas super burrito, no beans. The lettuce and tomatoes were surprisingly super fresh. That was nice. However, the carnitas were soggy, and had no crispiness. I was able to finish my entire burrito and usually I have trouble everywhere else to do that because their burritos are too big. This was a first.\n\nI'm not sure if I would come back. There wasn't anything that stood out to me.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Good veggie burrito! The peppers and onions were a nice touch and the spicy burrito is really quite spicy!", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "This afternoon, when I found myself with a rumbling stomach - in Lower Pacific Heights/Upper Fillmore - far, far away from my usual stomping grounds, where great taquerias abound, I had no idea who to turn to. And, honestly, I walked into The City Taqueria with pretty low expectations. \n\nWhile it's not the best taqueria fare you'll find in SF, and the prices are more than I normally pay in the Mission, if you're in the area looking for a cheap bite to eat ... I highly recommend The City Taqueria. At least half of the ingredients on my veggie taco were made to order. That's to say, the veggies were thrown on the 'parilla' and grilled while I waited. Mmmm, tasty!\n\nDon't let the bizarre layout or south-of-the-frontera vibe turn you off. Check it out for yourself!", "author": "Beau W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "How this place has less than four stars is a travesty. It's the big three of good, fast, and cheap. And truly goes for the grand slam when you add in how big the portions are.\n\nI have never been disappointed here and neither has my wife. She had the fish taco bowl which was amazing and massive. I had a regular beef burrito which is large.\n\nFor the super hungry, if you get the super size it is two burritos connected to one another. I almost finished one once but the grease was too much when I got to the bottom. If I were to attempt it again, I'd probably cut the thing in half or let grease and other liquids drain out.\n\nWow it's good though, totally recommend this place. They talk to my Spanish speaking white wife \"en espanol\" and don't make fun of me for being a \"gringo\" or my poor Spanish accent. \n\nIf you are looking for a douchey SF decor place, don't come here.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Needed a quick burrito fix, my usual spot wasn't open so came over here. Food had the right amount of grease, staff was super friendly and helpful, vibe of the place was super low key. Really enjoyed it. Wish the meat had more flavor. Overall good place to get burrito craving fix.", "author": "Kafilat Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "WTF what's the point of ordering by phone if when you get there the idiot cashier doesn't charge you until is your turn on the busy line  , I got soooo mad that didn't even get my food and took off thanks for that guy no lunch for me,", "author": "Luis O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "There is no taqueria better! The food is fantastic! I live off of this food. The grilled chicken is bomb,\nSo flavorful. I literally eat here very week. I used to live close but now I don't but I still travel 45 minutes and cross a bridge just to get it! There is no taqueria better. Ingredients are fresh and flavorful.\nEduardito is the weekday chef, hes knows exactly what I like!! Love you guys!!!", "author": "Nakia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Absolutely love this place. Fresh ingredients, meat is grilled right in front of you after you order and the  result is just so delicious. Portions are big and prices are pretty good for the quality. Personal favorite is the shrimp taco salad. Shrimp cooked just right with onions and bell peppers before they carefully assemble you salad in a tortilla bowl that just came out of the fryer. Definitely best Mexican food place in the area. They do take a while preparing your food, but at least you're not getting stale meat that has been sitting there for hours.\n\nLast but not least the personnel is really nice and carefully craft your meal with a smile.", "author": "Monica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Oh Ocean Taqueria... (this place has gone through a few names, but it's the same OG dudes running the grill)\n\nI am an avid burrito eater, have lived in SF for 10 years, and i put this as one of the top burritos (ON MOST Days).\nWhy? they make your burrito meat [carne asada or pollo asada] fresh on the grill everytime \nThey have tasty refried beans and spanish rice. \n\n...\nThat aside, some pro tips from someone who has probably gotten 500+ burritos over the last 10 years across this location and the Ocean St one over in Ingleside (same set-up, order at the grill then build your burrito BUT IT IS NOW CLOSED):\n\nTips:\n*Add onions and/or peppers before they throw it on the grill\n*Add fresh avocado vs their guac (guac is tasty but it's \"watered down\" w sour cream), it is an option.\n\n*Ask for the \"Lady Gaga\" Salsa.. it's the red one that isn't used in the burrito, really garlic-y", "author": "Naveed B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "This place is a little hidden gem. The hallway is long and narrow and there is not many tables but don't let that stop you! The chef was preparing the food right in front of us and the flavors were amazing. I got the spicy shrimp and for the price it was a huge portion. Spicy means spicy though- sometime that's not the case, but they really delivered on the spiciness. They have frozen Mexican ice cream which the kids loved after dinner.", "author": "Francine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Bomb AF \n\nDon't know how long my review needs to be so that Yelp doesn't flag it as a tip but the above is all that you need to know.", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Best Mexican spot around. Tastes greaaaaat and the portions are very generous. I always come here for lunch. Make sure to get there around 11am before the crowd arrives or else you'll be waiting forever!", "author": "wendy h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "Food was tasty and I love that they cook the asada to order.  The negatives are they charge for chips and salsa and they're really not that cheap.  I'll go back for a change of pace on occasion.", "author": "Bryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I love this place. I started going to its original location ocean taq in crab ave as a teenager and its been my go to burrito . I love the freshness of the meat and the vegetables. I know the guys in the shop and they always know my order. Love this place", "author": "Aisling O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-15", "description": "We came here for brunch/lunch last Sunday after a big night out in SF since the \"better spot\" (according to my friend we stayed with) is unfortunately closed on Sundays. The burritos were alright but nothing amazing. I had a veggie burrito and wish that...\n\n- They'd asked me what type of tortilla I wanted. I saw others with whole wheat tortillas, etc. but they automatically put mine in flour.\n- They had a salsa bar. I love salsa bars at Mexican restaurants and was surprised they didn't have one!\n- Had tables for 4 people. All but one table seemed to be just for 2 people (we still pulled up a third chair to one but it wasn't ideal).\n- They had better avocado and/or guacamole!\n\nThat said, the burrito was big and the staff were nice. Also, they are conveniently close to the Fishbowl!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "I gave them a two star because my order was ready when I got there 5 mins after calling in. Every one was nice. I ordered a supper burrito with carnitas. There was no flavor at all. I received two types of sauce. Red and green. The red had a kick after the first try. After that it tasted like it was watered down. I wouldn't go back or recommend it to anyone. I love Mexican food however I was a bit disappointed. No taste in the meat and watered down hot sauce. Also it did not come with any chips or salsa.", "author": "Nino A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Long before it was The City Taqueria, I was dining at Ocean Taqueria on a weekly basis and it was my favorite burrito north of market street. It had been a while since I had been inside so I figured I'd see what this name change was all about. Let's put it this way, nothing has changed. Thank the heavens above. \n\nIt's still the same fresh burrito I remember from days past and glad to see they haven't compromised any quality. Btw, I always opt for the pollo verde super burrito, but the grilled chicken & carne asada are legit too. There is something about chicken that has been chilling in a warm salsa verde all day that makes it extremely juicy and awesome and there's nothing else like it. They warm your tortilla right in front of you, so always opt for melting the cheese. \n\nIf you're feeling ballsy you can get the jumbo burrito (which is the size of a small child). I've attempted to eat this monster twice in my life and failed both times. Arg. Anyway, if you're looking for something quick, delicious and affordable, this is your jam. \n\nGracias Amigos.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Super fresh, meat cooked to order.  They keep asking if you want stuff in your burrito, to make sure you get it just the way you want it.  My most favorite burrito in the City!", "author": "Pul F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "The burrito was soooooooooo bomb. I got the pollo and my boyfriend got the carnitas. The carnitas is super crispy which is the way we like it and the pollo was super bomb too. They even cook the meat first then put it on the burrito so it's freshly cooked. The cool and employees are very friendly. Definitely will be coming back!", "author": "Brianna G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-06", "description": "This place is passable when El Burrito Express down the street is closed. Based on Yelp recommendations, I got the carne asada burrito, which was pretty good. I like that they grill the tortillas a little before making the burritos, and the fillings and prices are right, but things just feel a little rushed and not necessarily put together with a lot of care.\n\nAll-in-all, it's fine, but not awesome. Definitely recommend EBX as a better alternative. I snapped some photos of the menus since they're unavailable otherwise online. Hope that helps someone out.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "5 stars for the super veggie burrito with extra cilantro, refried beans and salsa picante.\n\nI had a hard time finding the listing on yelp as I was looking it up under the name \"City Taqueria,\" which is the name displayed on their sign. \n\nThis place is a hole in the wall - you could stretch out your arms and nearly reach wall to wall. It is quite long though - so it really feels like the place is just one long hallway.\n\nI was a little trepidatious, the hand written sign and humble decor didn't inspire confidence, then again, some of the best food is found in the most meager surroundings. And yippee that turned out to be the case. \n\nThe tortilla was grilled to toasty perfection, the beans were creamy and savory, the toppings were fresh and delicious. This has got to be one of the best super veggie burritos in town.", "author": "Carole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "I've given City Taqueria a 3 previously for their quesadilla (my usual at a Mexican restaurant because even when I try to get something different, the cheesy meaty vortex of a good quesadilla always drags me back in). I definitely like nearby Burrito Express' quesadilla much more. But today on a whim I tried the combination plate (choice of meat; I got shrimp and fish) and it was fantastic. For $12.99 they load your plate up with hearty servings of rice, choice of beans, lettuce, pico, guacamole, salsa, sour cream, cilantro, peppers, and 4 corn or flour tortillas. The meat/fish had a great grill going for it. I definitely recommend the plates here which was really hit the spot for me today. The staff is great as well. Then afterwards, grab a drink at one of the nearby bars on Divisadero.", "author": "Will H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Really good carne asada and carnitas. Burrito is made rightnin front of you, and you have the option to get sautéed onions and peppers with your burrito. \n\nOutside of the mission spots, this is one of the best burritos around.", "author": "Jon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "This is a great hole in the wall authentic burrito spot in San Francisco. The guys here are awesome and the food is always incredible!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "I stumbled upon this place when I moved in to the neighborhood. Since then, I have gone there countless time. There fresh and high quality food keeps me coming back. Their fish is delicious and so is the chicken burrito. You can't go wrong. If you like spicy, be sure to ask for sliced jalapeños and their habanero salsa!", "author": "Hannah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-21", "description": "July 20, 2016: another price increase, a big one, not such a great value anymore.", "author": "John N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-01", "description": "This used to be Ocean Taqueria! I used to come here a few times a month before moving to a different part of the city. This place is the reason I still visit lower pac heights from time to time. \n\nTheir super burrito is tasty. My personal favorite is their carnitas. Asked them to put in on the grill for a few minutes. I guarantee you'll like it!", "author": "See Yew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "A bit of a wait but well worth it.  The super shrimp burrito - YUMMY!  Our work group typically goes to El Burrito Express a few stores down but it is closed for renovation.  I think we have a new to-go for our monthly burrito cravings.", "author": "Frances H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "Enjoyed this place.  Portions were large and very tasty.  I had a shrimp and chicken tacos.  Super friendly service is a plus.", "author": "Shawn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "This is my go-to burrito spot. I grew up in San Francisco, and otherwise need to drive to the Mission to get my perfect burrito. \n\nYes, this place is a hole-in-the-wall. It doesn't offer trendy industrial or rustically chic decor, but the food is great and that's all I'm looking for. \n\nOne of my favorite thing's about City is that they offer 'baby' sized burritos that they treat like regular sized burritos. This means I can get all of my favorite toppings in proportion, without pretending I'm ordering for my 11 year old cousin, or wasting a drop of the delicious green salsa. I also love the grilled onions/peppers you can get in the steak burrito - yum!\n\nOn top of the great food, the guys that run this place are awesome. They're super nice and friendly, and they really care about putting out good food.", "author": "Natalie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Came home to visit my mother and wanted a good burrito. Found this location on Yelp and decided to give it a try. You can almost miss this place because it's tucked a small spot. The employees were nice and helpful in figuring out what I wanted. The burrito was a nice size and the food was fresh. Liked that the carne asada was cooked to order. It was a very good burrito and will definitely go back when I return during the holidays.", "author": "Monica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "I was in the area and stopped at this location for a regular chicken burrito. The guy overcharged me $2 and when questioned he said the extra $2 was for sour cream and guacamole. The menu on the wall says $8.95 with everything on it. \n2 more customers complained the about same thing. Food quality was average and doesn't come with chips and salsa. This place is a ripoff , stay from here and be careful about what you pay!", "author": "Axl r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Meat was fresh to order. Salsa is not overly salty. Solid burritos. Going to be coming here more often.", "author": "Edward K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "\"LEGIT\"\n\nDelicious and filling. One should never eat food made by an angry person, and the cooks here always seem so mellow and happy!\n\nEnjoy the sports games blaring from the t.v. while you wait for your carryout order or sit at a quiet table near the cheery front window. No one will bother you.", "author": "Evangeline W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-11", "description": "If you're okay with mild food poisoning, this is the place for you! I only have gone here when El Burrito is closed and I'm desperate. I have sadly regretted it every time. I've brought guests here and it made them physically sick. The interior is claustrophobic. I wouldn't recommend it.", "author": "Katelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Easily one of the best taquerias around- same as the old ocean taqueria just under new ownership. Carne Asada tacos and ask for habenero salsa and sliced avacodos", "author": "William J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "This is THE spot for veggie burritos. The dudes make it exactly how you want it, and listen to everything you say. You can ask for extra or light of anything and they will gladly do it without charging. Looks like a janky place but it's too good to pass up!", "author": "Pallavi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "Good food and nice folks and affordable pricing. If you're going during the lunch hour, go early.", "author": "jason k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "One of the closest burrito joints to my place around here, and a little pricer than El Burrito and a bit smaller in size. Opened late, but decent burritos. Usually order the carne asada super burrito since their regular ones are too small and it doesn't come with complimentary chips like El Burrito.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Great spot. Very authentic. I SAW they had whole tortillas SO I ASKED for one. THEY DO offer SALSA TO TRY, but no need for a bar. Place is small but FINE. I came with 3 other people and OH NO we had to sit at separate tables that were 5 FEET from each other. Since I'm an ADULT I was able to cope with the fact that the other ppl in my party were not sitting in my lap. If I were this place I'd prevent the SNOBS that give them less than 5 stars from eating there. Get over it, you pretentious morons! \n\nKeep on keeping on city taqueria!! Best burritos in SF!!", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Who doesn't LOVE BURRITOS! ?!?!?\n\nIf you don't, then you are truly not a San Franciscan!!! San Francisco is known for our burritos. The are second to best to real Mexican AUTHENTIC food. Now there are many different types of burritos from; tradition Mexican, sushi burritos, candy burritos, ramen burritos, nann burritos, and the list goes on. \n\nHowever there is one place in particular that has the best burritos ever! Hands down, there are no comparison. Ocean Taqueria, which changed their name most recently to The City Taqueria. Is located on Divisadero. I had very easy access to this dive, because I went to school about 4 blocks away!\n\nWhen you first walk in, you kind of have a sketchy feeling, because you have to walk all the way in the back of the restaurant to order. You can get burritos, tacos, enchiladas, nachos, tostada, quesadillas, or their plates. You get to choose what meat you want, what kind of tortilla, and whatever else you want in it. The staff their are VERY FRIENDLY. I really like going there because they do make you feel welcomed. \n\nEvery time I go to The City Taqueria, I always order a Carne Chile Verde burrito. I ask for a spinach tortilla (because I always think it's somewhat healthier in my mind, when probably there isn't a huge difference) and add lettuce, Chile Verde, sour cream, cheese, and rice. I would have asked for guacamole but, I'm allergic to avocados (what a stupid allergy). Their carne is so well cooked that the meat is so flaky and its the kind where you don't need a knife to pull it apart. It just kind of crumbles on its one. \n\nPart of why I like The City Taqueria so much, is that it holds memories for me, being able to go after school or during lunch with my friends, and then sitting down eating our burritos and talking, was something I cherish doing with my friends. Note: When I usually go I also tip them because this is actually the second one, but the first one closed down, and I don't want this one to go either!\n\nCheck out my profile to find my official blogs as well as more food reviews", "author": "Food G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "one of best taqueria, outside of the mission district. enjoy their taco salad and burritos; you can choose from five to six hot sauces. service is courteous and friendly.", "author": "Albert E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "You know that feeling of having eaten something so satisfying that you can't stop thinking about it, imagining how soon it will be until you can eat it again?  Today, hiking in the hills a bridge away from the City, I began fantasizing about City tasks that must be done soon simply to bring me back in range of this carne asada:  Puppy and kitten viewing in Macy's window, ice skating at the Embarcadero, martini at the Fairmont.  Did you see Christmas shopping on that list?  Yeah, me neither.  \n\nAnyhow, last week somebody brought me a regular carne asada burrito from Ocean.  I'd read that the carne asada here is cooked to order and I'm here to report that they have hit upon something magical.  The carne asada in my regular burrito was a splendid thing.  Individual crunchy pieces, not a speck of gristle, then the happy ending:  Soup-like meat juices settle into the burrito base, drip down your hand as you try to eat, plop on your paper plate and are there to be blotted up with remaining tortilla bits.  Not all carne asada burritos end this way but the best of them do.  \n\nMy burrito included pinto beans, fajita veggies, pico de gallo, hot salsa, and rice.  Not coincidentally, the exact same burrito I'll be getting on my next visit, when I come in to see the puppies.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "My boyfriend is a taco freak and he loves trying out great tacos.  The City Taqueria is right around the corner from where I live and it's one of his favorite places to go that's convenient when he doesn't feel like driving to the Mission.  Staff is always always friendly and happy and eager to make their customers happy and the price is definitely right for an easy quick dinner without a lot of fuss.  Terrific job!", "author": "Lynn A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "I just paid under $13 for a mediocre veggie burrito from this place. So it had (a splash of) guac and sour cream, is that why it costed me so much? Or was it the bland chips that tasted like they were made the day before and the tiny taste of salsa verde that accompanied them? I don't know. I just don't think the burrito I just ate was worth what I paid. El Burrito express 4life yo. Next time I want a burrito on a Sunday (when el burrito is closed) I will just go to Panchos on Geary.", "author": "Winni D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-18", "description": "Normally I like this place, and order from them regularly.  Well, not after tonight!  \n\nI called around 6:15 to place an order of 2 burritos and some enchiladas.  The guy on the phone took my order, but mentioned they were busy tonight.  No worries, I asked how much longer it would be then.  It's normally only 10-15 min.  I said, \"20 min\"  he said, probably not.  I said\" 30 min\", he said \"that better, yes, see you then.\"  I showed up about 45 min later and gave my name, but it turns out they hadn't even started my order!  When I showed surprise, he pointed to the line and said, they were \"very busy\" and that I could \"get in line.\"\n\nWHOA.  First of all, there were 5 people in line, I was #6.  There were 2 tables of 2 eating in the otherwise empty restaurant.  So, we're talking 4 people sitting down and eating, and 5 people ordering.  If that is \"too busy\" and you can't handle serving that \"many\" people, what are you doing in the restaurant business?  And he wasn't even nice or apologetic about not putting in my order, he just waived me away and told me to wait in line.\n\nSorry Ocean, you may only be 2 blocks from me, but I'll be driving to El Tonayense from now on.  Their food is better anyway, but the convenience made up for it.  Not anymore.  Crappy service is the worst offense for me, personally.  Bye bye.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-28", "description": "I've given this place a few tries and it always comes up lacking. The meaty quesadilla seemed to always turn into a watery mess. I'm all for a wet burrito or sauce quesadilla but this was a mess. I wanted to like this place but probably won't go back.", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "This is definitely my favorite to-go restaurant in Lower Pacific Heights. It has amazing food for fairly low prices (and many great options for vegetarians!). I love the nice community feel of the place, and the service is absolutely wonderful. I go to school a few blocks away from this place, and I end up eating lunch here several times a week. I certainly recommend!", "author": "Stewart J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-16", "description": "We got takeout from here tonight and this was the worst burrito I have ever had. The burrito was limp and loosely packed with flavorless ingredients. It had wilted lettuce and took me 4 or 5 bites to get to the chewy awful meat.\n\nThe burritos here used to be delicious! They must of changed owners. I miss the old ocean taqueria", "author": "Emily N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "I absolutely love City Taq. The two guys who work here could not be nicer. The burrito is made to order in front of you and is incredible every time. I prefer the burritos here to EBX.", "author": "Caroline R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "OK.. so i actually ave been here a long time ago but came out after 15 min because i didnt know where those lines were and didnt know how to order.\n\nafter i asked my coworkers, i finally had the courage to go back and this will be my 3rd time to order from here:\n\nREALLY good mexican food!! BURRITOS YESSS... mission district style... They make your food as you order customer by customer and they comply with your little simple requests.. The staff is also nice!\n\ncarna asada regular burrito is yummy...\ncarnitas regular burrito is delicous... \nchicken tacos are heaven...\n\nthey make your food accordingly, and you dont end up with a BLOB of MESS like you do sometimes at other places.. \n\ndid i mention, YUMMY?", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "I've been coming to City Taqueria for over 10 years (my friends and I still refer to it as Ocean Taq), and this is my favorite taqueria in the city. The atmosphere is not fancy or hip, but they make amazing food. Unlike most other taquerias in the city that pre-cook meat before you order, the guys at City Taqueria cook the meat right in front of you after you order it. They do the same with peppers/onions which I highly recommend putting on your burrito. The Carne Asade is tremendous.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "After bouncing back and forth between El Burrito Xpress three doors down and this place, I finally decided that this was my go-to spot. And after seeing that people trash this place over on EBX's page, I felt like I had to come to Ocean Taq's defense.\n\nFor one, Ocean Taq is open on Sundays (EBX is not). That's huge after a big Saturday night.\n\nMore importantly, I love how this place is endearingly divey. It is laid out totally wrong, but that just shows you that the owners may not know restaurant pyschology - but they know burritos. You order all the way in the back, past the whole seating area, where you can no longer even see the menu; but you know exactly what you are getting because it's made like two feet in front of you.\n\nThey grill or fry up everything fresh, even their own chips. I've had the carnitas and pollo asado and both were tasty. The meat is done on a flat top grill and they throw in onions and peppers if you like. One time I was craving a breakfast burrito so I asked if they had eggs. Sure they did! They whipped em up right there and threw it on the flat top. The staff are super nice and I feel like half the time they just throw in chips for free.", "author": "Cody R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-02", "description": "Look, I'm all about grody taquerias in Pac Heights, even ones with misfitting names (why \"Ocean Taqueria,\" exactly?).  If it offends the nouveau riche, I'm all for it.  In plenty of shapes and sizes, and especially colors.  Yes, my friends, if the rich white people prancing around are even the slightest bit annoyed by something because of its lack of class or the non-rich-white people it attracts to the rich white people's neighborhood, count me as a fan.  Except Ocean Taqueria does it all wrong.\n\nLocated not too far from Ocean Taqueria, my friends at El Burrito Express 2 serve up some of the best burritos this side of the Mission District, and they do it in a dank, dark, humid taqueria that's singularly unpleasant to visit but for all the right reasons.\n\nOcean Taqueria isn't quite dark, not really, and its dining area is actually pretty impressive; but the food's bad.  It's not disgusting, but it's not good either, and I paid way too much for a super veggie burrito even though I got to choose exactly what I wanted.  See, if I can choose all my ingredients and the burrito's still bad, then the ingredients are bad, and if the ingredients are bad, well, we've got a problem.\n\nSo that additional star is for annoying the rich white people.  Keep doing your thing, Ocean Taqueria, but don't expect me to visit you anymore.  El Burrito Express calls, ridiculous lack of lighting and ventilation and all.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "What's the quickest way to a food coma, hangover cure, and my heart, all at the same time?\n\nA grilled chicken super burrito from Ocean Taqueria.\n\nI'm not a fan of burritos because I don't like hand-held foods (no, I do not like ice cream in a cone, I'll take it in a cup please).  I also have yet to find a burrito that truly meets my southern California standards for Mexican food, and several jaunts into the Mission have left me feeling disgruntled.\n\nWhen my coworker Caleb and I decided to go have lunch, he nixed my idea of going to the neighborhood Korean place so we could check out the waitress that our supervisor's been crushing on, although not for that reason - he just didn't want Korean food.  He then brought up the idea of burritos, so off we went, and we found parking pretty easily.\n\nWe both got a grilled chicken super burrito, which basically had a whole mess of things: freshly-grilled-on-the-spot chicken, onions, and peppers, rice, your chocie of beans (black or refried), pico de gallo, sour cream, mild, medium or hot sauce, guacamole, more types of salsa, and lettuce.  Wrap this all in a huge flour tortilla and you get an instantly happy stomach.\n\nI think the freshly-grilled chicken and peppers made the difference here - it added so much flavor, and it wasn't overwhelmed by the sauces or sour cream.  Perrrrfect balance of all the flavors without tasting too greasy and fatty.\n\nOh, and THEY TAKE CREDIT CARDS!!!  TAKE THAT, Mission trolls!\n\nFood coma: check\nHangover cured: check\nLove: check", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "I've been here twice - once for lunch and the other for dinner and I must say that Ocean Taqueria has turned me into a fan.  First of all, the staff are very nice, friendly and accommodating.  I asked them for flour tortillas instead of the corn tortillas that came with my shrimp plates and they were like, \"Sure, no problem.\"  Also, when they pack your order to go, the food is not just slopped inside the box.  They actually take some pride in the presentation and you can tell that they put their heart in the cooking.  Both times, I went there, I was drawn by the wonderful aromatic smells coming from the kitchen, as soon as I was in front of their door.  I always thought it was strange how you can go in some restaurants and not smell their food cooking?\n\nI tried their Shrimp a la Diabla (very spicy shrimp, though you can adjust the heat level to your preference) and their Shrimp al mojo de ajo (garlic shrimp).  Both the dishes were super tasty and flavorful, with bright and fresh ingredients (guacamole, pico de gallo, sour cream, rice and your choice of beans).", "author": "Danielle O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-27", "description": "I wanted to like this place, but the burritos just have no flavor. My burrito was mostly filled with the rice, no balance on chicken, beans or other ingredients. \n\nTwo stars because everyone was nice, and I Iike the garlic in their salsa.", "author": "Nic W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-27", "description": "Came with my friend cause we were starving. We got the Carne Asada Jumbo Burrito. He kept saying how huge and satisfying it is. They grill everything to order to thats pretty good. As they were assembling the Jumbo Burrito, I didn't think it was that big and my friend thought the same. He said last time he ordered it they stuffed it with more goodies so I was kinda disappointed. They should be more consisted on what they serve. However, the food was really good, the meat was flavorful and not dry, veggies and beans complimented the burrito. I didn't get full, but it was very good.", "author": "Juan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "I have eaten at this place several times.\n\nI recommend trying tacos. Skip the beans, guacamole, sour cream, so that you get more flavor from the meat and other ingredients in every bite. The tacos are huge.\n\nPluses:\n* The staff is friendly and casual\n* You can interact with the cook across the counter. Last time I went, the cook asked if I wanted 'grilled green onions' (cebollitas) on the side. It's nice to see them go the extra mile for a customer, right in front of you.\n\nMinuses:\n* They charge for chips, but the bags they sell have too many. I wish they would just throw some in for free on the side\n* atmosphere is so-so", "author": "Xavier A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Amazing burrito. Carne Asada Super with Tomato Tortilla on point. Hole in the wall feel just the way it should be. Great food! Gets crowded at lunch", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "I have NO idea why El Burrito Express down the street has better reviews and I've been going there instead of Ocean Taqueria for the past 2 years. Seriously???\n\nOk, so Ocean Taqueria seems a bit sketch when you walk in. I was so confused, couldn't find the menu (which is high along the wall before the cashier), didn't know where to order (directly to the cook in the back) or where to pay. Good thing I was the only one there that Saturday afternoon, so the guy manning the grill was super patient. He asked me what I wanted and since I didn't know, I just said everything in my super burrito. He grilled the carne asada, onions and green peppers on the spot, so you know it's fresh. Everything including shredded lettuce, sour cream, guacamole and all of the salsas. You can tell him if you don't want spicy, but everyone who knows me, knows I love my spicy food and spicy salsa is no exception.\n\nI walked home with the burrito. Usually when I walk home with an El Burrito Express burrito, it's cold. No, not this burrito from Ocean Taqueria. It was hot, the veggies were still a bit crunchy and the juice from the carne asada is running down the burrito and onto the plastic bag. So satisfying, considering this isn't the mission or SD. Sad to say but I won't be visiting El Burrito Express anymore when Ocean Taqueria is just a few doors down.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Best burrito in Pac Heights. Fresh tortillas, salsas, guacomole, and pretty much all their sides. The chips are fresh (surprisingly, many taquerias, like the \"famous\" Cancun Taqueria buy their chips from a store)! But not these guys! And as for the burrito size, are extra huge here, so be warned!\n\nThe only reason this place doesn't get 5 stars is because the atmosphere is a bit drab. The space is long and extra narrow (even by SF standards!). Also, the prices are a little higher than your average taqueria.\n\nRecommends: try the super shrimp burrito & their fresh pineapple juice.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-30", "description": "I've been here twice. The first time was better than the second. I ordered a baby burrito with carnitas. After reading the reviews, maybe I should've ordered the carne asada since it's cooked fresh. The carnitas did not taste fresh. They were dry. \n\nAlso, I was bummed that chips weren't included. \n\nDecor was dingy, which usually isn't a problem with me. But the tables were so sticky that I didn't want to touch anything. Not even my burrito.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "Best burrito I've had in a while.  All the meat for the burrito (and for any other order I'm sure) is cooked fresh to order.  The cook puts a special sauce on the meat while he cooks it; he wouldn't tell me what was in it but it gives the meat unbelievable flavor!!!  Definitely give this place a try.  Ocean Taqueria has my vote for best burrito in the city.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Best place to get a Mexican burrito in PAC hits.   Simple fare, much like you would find in the Mission. Call in advance and they will have your order waiting for you. They offer all the different wraps you want... plain, whole wheat, spinach.  A great place for a meal on the run.  We order and pick up, but you can eat on the premises if you like, but there's not much atmosphere.", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "I absolutely love this place. My boyfriend and I stumbled upon it a few months ago and now I can't stop going. \n\nIt's so close to where I live, cheap and so delicious. Everyone in there is super nice and friendly. I get the baby chicken burrito and they are the perfect size and everything is made right in front of you. So delicious!", "author": "Coco K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-01", "description": "Pretty terrible - the place itself is very dirty. And the guy making your burrito will be handling people's money, and then using his bare hands to grab lettuce, tomatoes, cilantro, etc for your burrito. Gross. \n\nThe chips are incredibly stale and off-tasting, and after eating two bites of the wet, sloppy, and stomach-turning burrito, I couldn't eat it anymore....and I never throw away food. yikes. Move-on.", "author": "Arjun B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "A lot of my judgment in a restaurant is based on how receptive the staff/management is to my light-hearted banter. At Ocean Taqueria, I know I'm always in for a good chuckle or two. It helps to speak Spanish, but I've witnessed a few initially awkward language misunderstandings turn into echoing laughter. \n\nMy favorite thing about OT is their utilization of the grill. While most burrito venues readily slap on day-old ingredients that have been sitting in a murky pool of questionable liquid all day, these gentlemen will sizzle your onions, bell peppers, and seasoned meat right in front of your very eyes.  The only issue is that this place can be hit or miss- I've had burritos that range from incredible to decent, never bad.\n\nThe other day, aforementioned light-hearted banter turned into a full blown conversation about Mexico, drug lords, cerveza, and hot sauce (including samples). These guys will treat you like a true friend, if you let them. I left with more hot sauce than I know what to do with, and a free Corona to top it all off.", "author": "William H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "I come here a few times a month for their fajita burrito. They cook the chicken and steak to order which I really like and I have never tried their other meats. They make them right in front of you so you can tell them exactly what you want in it, plus their salsa are bomb.\n\nIf you're not in the mood for a burrito their tacos are also excellent and large portions.", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "I love this little gem! So sad I moved away from this neighborhood. Pro tip: Their mild/medium salsa (it's the best one there) is casually called the \"Lady Gaga.\" Ask for it with your chips - it's amaze! :)", "author": "Allison D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "My boyfriend was raving about this place for a long time, and I had already tried El Burrito Express (which I love by the way), so I decided to skip over EBX for one day and give Ocean Taqueria a shot.\n\nI was not disappointed!  We stepped in line and ordered a Jumbo Burrito for the two of us (it's basically two burritos tied up into one).  They cook the meat to order and everything tastes so fresh!  You have the ability to choose whatever goes into your burrito.  The staff is very friendly, and we made some chit chat while our order was being made and rung up.  \n\nGreat place to stop by for a delicious burrito!", "author": "Can C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "I love the steak burritos from this place! It looks like a hole in the wall and does not feel like the most inviting looking place, but the food is delicious and it's not very expensive. I recommend you get your food to go, it's most enjoyable at home.", "author": "Samantha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Love this spot. Just a solid burrito made by a great group of people. Friendly service... my favorite local taco spot. Love the carne asada and the pork.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Got a carnitas taco fully loaded and it was great. Very reasonably priced for its size! Nice staff and quick service", "author": "Jason L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "LOVE this neighborhood spot! The veggie quesadilla is always perfection. And they'll give you extra guacamole if you're nice.", "author": "Lindsay U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Absolutely delicious. Their tacos were huge, fresh and filled with flavor. Loved this place and will definitely be back", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-23", "description": "Best burrito in San Francisco. They grill the chicken/steak for each meal while you are in line - if that doesn't mean anything to you, try it, you'll never be the same.\n\nThe main chef is really friendly/funny too - talk to him!", "author": "Matthew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-09", "description": "get the corn quesadilla with carnitas and all the fixins!  it is like a taco sandwich.  Great alternative if you are not up for the 2lb burrito or flour quesadilla.  oooohhhh so yummy!  They also have agua frescas.  The people that work there are super friendly.  the guy at the register made me a \"special treat\"... 1/2 horchata and 1/2 strawberry.  OH YEAH!  my new favorite  ;)\n\nThis place is a little spendy but the food is so so good.  I love that eveything is cooked to order and not sitting around in bins all day.  So allow cooking time when getting food from here.  Not the taqueria to go to if you want to run in \"really quick\" to get a burrito to-go.", "author": "Monette P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-20", "description": "Yesterday was \"pay my bet debt day\" and met up with two ex coworkers/bosses in the City for lunch. Every single year I end up losing our annual NCAA tournament pool and it's me who gets stuck with the lunch tab. Lucky for me they are both men of simple tastes and usually a simple Taqueria will do.\n\nUpon arriving on Divisidero we attempted to lunch at Burrito Express, but the line was a mile long and were three hungry soles who needed a fast remedy and take care of our low blood sugar issue. Just a few short steps away is Ocean Taqueria. We walked in and found plenty of open seats and a much shorter line. \n\nIf you go, make sure to follow the rules and get in the right line. As you walk towards the cash register there are two lines, one to pay and one to order. The confusing part is you encounter the pay line first, but you quickly learn that you must proceed to the back to order.\n\nThe menu is exactly what you would expect from a casual Taqueria. Burritos, quesadillas and nachos everywhere. All you really need to decide on is if you want the \"Super\" size or the \"Regular\". Both of my ex coworkers went with the \"Super carne asada burrito\" with everything and I went with the \"Regular carne asada quesadilla\". The assembly line for your order is right in front of you and the burrito/quesadilla guy lays your tortilla out in front and asks which fillings you would like. There are plenty to choose from, rice, different kinds of salsas, guacamole and three kinds of beans (whole, re fried and black). Both of my friends went with the works.\n\nWhen it came time for my quesadilla to be assembled, the counter guy asked what I would like. I was little confused in that usually a quesadilla is just cheese (and the carne asada as I had requested). I responded with just the cheese please. He then rolled it up rather than laying it flat and it just looked a cheese burrito. I don't know about you, but I prefer my quesadillas flat.\n\nMy quesadilla wasn't bad, but it was little soggy and did not like eating wrapped up in foil. It wasn't very \"cheesy\" nor did the tortilla sing to me with flavor. I ate half as I lost interest fairly quickly and figured I would save my caloric intake for dinner. \n\nOverall I came away unimpressed and probably would go elsewhere. It did do the trick for what we needed which was just to catch up and share stores about what troubles we have gotten into over the past year.", "author": "Rene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "Aka now El City Taqueria.  The carnitas anything is bomb.com sautéed with spices and a ton of other goodness.  Enjoy!", "author": "Matt B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-07", "description": "By no means will the food at Ocean Taqueria knock your socks off, but if you're hankering for some quick Mexican comfort food while hob-nobbing around Lower Pac Heights, it'll do the trick.\n\nOn Cinco de Mayo, they were handing out free shots of tequila with every burrito purchased, which allllllllllllmost compels me to kick down another star, but I gots to keep it real. It's A-OK all the way around.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "The burritos are like 7 or 8 bucks. They make everything in front of you. When you ask for extra guacamole, they give you extra guacamole. You know it's authentic because they speak Spanish in front of you while they make your burrito. We get the chicken and steak burrito. The best burritos are always in places like this.", "author": "Nathan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-07", "description": "Ordered the enchilada , it was pretty good and the portion was large. One very important note is that the food has a lot of salt and msg that will leave you thirsty for the rest of the day !!!! I had Ocean Taqueria for lunch and didn't even finish the whole meal and I was constantly drinking water for the rest of the day. Maybe that's why it tastes good ...cause of the MSG...", "author": "Lucy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-04", "description": "Certainly not the best burritos in town but for the neighborhood they are pretty good. More flavor and authentic than other places. Other places often tone down the flavor for non latins, I find this place tastier than burrito express. It is a bit of a dump, but burrito express is as well.   I saw him wash his hands twice before preparing my food and another guy handled the money.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-13", "description": "Very average tacqueria, prices were reasonable and the food was just ok.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "I was thoroughly impressed with this taqueria when I revisited it last week. I had come a few times before but always random (and usually drunken) occasions like after B2B. So after being out of the country for 3 months I was definitely in search of an excellent burrito. I was hesitant to come here, but they pulled through.\n\nThe staff were very friendly and funny, especially if you speak Spanish with them. We had fun making my burrito, mixing the two types of green and red chicken meat and adding spicy salsa and anything else we could think of.  2 burritos, chips, salsa, and horchata came out to $20. \n\nThe burrito was large and awesome. I could only eat half - which is very shocking and definitely a disappointment to myself. The meat was tender and flavourful and the burrito contained the right amount of components. The Horchata was a little chalky but it is hard to find some that isn't.\n\nSo to my surprise, I will defintitely be returning to this place. Especially since my friend lives right down the street now!", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-02", "description": "When El Burrito was closed I decided to try out Ocean Taqueria.  I vaguely remembered having a not amazing burrito there years ago, but I figured I was just getting a veggie burrito (literally rice, cheese, beans and avocado), so how could that go wrong?  Well....first, the taste of my burrito was just off.  Seriously - four ingredients but they tasted strange.  If I had to guess I'd say they add sugar to the beans, but I can't be sure.  Further, i was the ONLY person in there.  I'm pretty outgoing and friendly, but I could NOT get these guys to crack a smile.  I felt I was putting them out by ordering a burrito. It was just strange.", "author": "Cori D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Two words: Habanero salsa.  I love heat and I still haven't found another burrito place in SF that delivers it with such flavor and intensity as Ocean does.  Watch out.  It's hot.", "author": "Alan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "This time, the staff were extra friendly and recommended that I try the Pollo Rojo Super Burrito. Twas awesome!\n\nGreat flavor and very moist fillings make this one of the better burritos I've had in the city.(I prefer places in Oakland)\n\nYeah, the set-up is funky; but it won't stop me from returning. this is my new lunchtime spot.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "I love that they have a fruit plate with toothpicks for customers to nibble on as we await our beautiful, delicious and generously served food. The place is close to home and I hope it stays that way.", "author": "Valorie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-30", "description": "Ocean, I would say that the food is not so great for the price especially there nachos. I would not recommend. I want to add that as I was ordering a steak burrito that the person who was rolling my burrito had a band aid on and fingers were not as clean and then he rung me up with no gloves. I question there cleanliness?", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "A Mission-like taqueria in Pac Heights, thank god. Helps me avoid the Mission. Cheap and delicious Mexican food. Solid sized portions, especially for the price. Pork Verde, do it.", "author": "Anthony T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-28", "description": "This review is solely based upon a business angle, as the food is actually very good. That being said, I will not be going back to this establishment, and here's why. Tonight was my third visit, and all three times the staff has tried to rip me off when I arrive at the register, and this time, I was not going to back down. I ordered a quesadilla with only beans, cheese, rice, and salsa, advertised at $5.50, and when I get to the register, the guy tries to charge me $8.21 (???). I walked him over to the posted-on-the-wall menu, and pointed out to him that my order did not include any meat, guacamole, or sour cream, and that I was not going to be just another perceived \"sucker\" from the lower pacific heights neighborhood they might be used to dealing with. On my previous visit, I ordered a regular vegetarian burrito, with no extras, advertised at $5.50, and I was ordered to pay $7.00, just because of the addition of cheese. I work as a retail/food service supervisor, and such an addition does not warrant an extra charge of $1.50, considering that the cheese comes in a 3LB bag, and is a very cheap, processed item, not high quality in the least bit (I would know, I order the stuff for my company). \nSo after all that, the cashier tries to make me agree to a $7.21 sale, I still won't back down, he talks to his co-worker in Spanish, assuming he is berating me in a tongue I do not understand, we settle on an even $6.50 and I leave. The conduct of the staff here is just plain and simply bad and dishonest business, and I will never come back. I advise anyone who plans on going here to be very specific with what they order. Do not let them tack on extra costs, thinking that you are another yuppie from the neighborhood who makes \"so much\" that another few dollars and cents doesn't faze you.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-07", "description": "I've probably had food from this place 4 or 5 times since moving to SF, and if this were any other type of food I might be able to give it three stars, but it seems like for the past year I've eaten Mexican food like it's my job, and I have to say \"I've experienced better.\" \n\nThe past two times I ate here I was basically forced to since the far superior El Burrito Express two doors down was closed (bastards). \n\nThe service is pretty bad (although I will say the last time I was here the two guys behind the counter were the nicest people I've dealt with yet). It's a very \"Soup-nazi\" like atmosphere they have going on. You quickly give the guy behind the counter your order and when they ask you what kind of meat, veggies, etc, you want on your burrito, quesadilla, taco, etc. you better answer quickly (like 1 or 2 nanoseconds) and don't ask any questions or you'll get a surly stare. \n\nThere isn't anything from here that stands out. I take that back actually...they do have good guac. It's not the real thick Chevy's-style table-side kind, it's a little bit runnier, but I wouldn't call it runny (make sense?). I've had burritos with grilled chicken and carne, as well as quesadilla's with the same meats and everything has been pretty bland (this goes for the beans and rice as well). \n\nThe food here is a little cheaper than The Little Chihuahua or The Green Chile Kitchen (and it should be), but more expensive than El Burrito Express (and it shouldn't be). They never give you chips, with your food and I didn't realize until seeing another review here it's because they charge two bucks for them. What a joke! \n\nLike others have mentioned the place isn't that clean or really that nice looking, but that I don't mind. In fact, places like this usually have really good food, which makes the fact the Ocean Taqueria doesn't that much more disappointing...", "author": "George A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-18", "description": "Overpriced, not authentic, but the cook is friendly and it's good for a quick fix.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-08", "description": "I am extremely lucky to live two blocks away from this place.  I have tried many Taquerias in the city but in my opinion, Ocean has the best Carne Asada burrito.\n\nThe line starts from the back of the restaurant.  I usually order the \"baby\" Carne Asada with onions and bell peppers.  It is made fresh to order as the steak with the onions and bell peppers are grilled on the spot right in front of you, and not pre-cooked like many other Taquerias.  I'll then select black beans, pico, guacamole and one scoop of habanero sauce.  I'll also get tortilla chips (which they make themselves and fry) to go with two containers of hot salsa.  The burrito is not a dry burrito and is extremely flavor full.  If you are ever in the neighborhood, this is a must eat location.", "author": "Shad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "Reviewing a taqueria in SF is kind of like when people clap upon landing when you fly somewhere. Why are you clapping? The landing part is included in the trip, in fact its essential and nothing to get excited about. Clap at takeoff, that's at least a miracle. WIth that said, unless something is glaringly wrong Taqueria's are all pretty good. This one though I am reviewing for the simple fact that it doesn't look appealing from the outside and happens to be next door to another taqueria. The food is consistent, the guys are friendly, and despite its odd layout and decor, has some flavorful dishes to satisfy that taqueria craving. But, like an uneventful landing, nothing to clap about.", "author": "Z P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "Great food. Everything grilled on the spot", "author": "Ron H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-16", "description": "My favorite taqueria in San Francisco. I'd recommend either the grilled chicken or carne asada. They grill both to-order using fresh, quality meat. The red sauce is the perfect combination of heat and flavor. All of the employees are very friendly and nice. They always have some food to nibble on for people waiting in line and will very often invite you to have a shot of tequila with them. \n\nI went in just the other day and they told me that the Ocean avenue location will be reopening soon, hopefully within the month. I heard 2 explanations, that there is a landlord dispute and that they are redoing the interior.", "author": "Sivan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "It's the simple things in life, like a  fine burrito. The layout of this place is a little strange, having you walk to the end of the restaurant to order, however you soon realize it's because you're standing next to the cook you does it all right in front of you. \nCarne Asada done right and great, and my friend enjoyed her veggie burrito.", "author": "dave m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-15", "description": "My favourite Burrito joint in town.\nDon't be put off by the shabby decor, this place does all the important things right in making top quality mexican food.\nMeat is cooked to order in front of you, the grilled chicken burrito's are great, chorizo and egg breakfast burrito's are the best hangover cure! Everything is fresh and tasty.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "DO NOT EAT HERE! This is the worst Mexican food I have ever had. \n\nI ordered a steak burrito with black beans. Everything was edible, but very very bland. I asked for some hot sauce, and it was also very bland. \n\nAlso had guacamole for the chips, which was very very watered down with almost no flavoring. I don't even know if they used avocados. \n\nThe only reason I even ate the food was because I was starving after hiking all day.", "author": "Joy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "It's called \"Ocean Taqueria\" because they originated as a shop on Ocean Avenue. Unfortunately, that shop closed down a year or so ago. Now, whenever I'm in the city I'll drive all the way to Divisadero to have more of this good stuff. Their carne asada nachos are the best I've had.", "author": "Barish O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "Came in with a few of my co-workers for lunch, ordered the super Burrito which was very good, the Best thing that they cooked the meat as you ordered, so the burrito has great flavor, love the music they play, make you feel like you're Mexican liked, will be back again, great job guys.", "author": "Terry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-27", "description": "Two Words: Yes Please \n\nThese guys have got it right. You want a real burrito, look no further. They grill the onions and peppers with the meat right in front of you - they even melt the cheese like a quesadilla before putting all the good into the burrito. Beast Mode. \n\nYou like nachos? No problem - they give you enough nachos to feed the family. \n\nSolid Mexican food.", "author": "Kendra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "I liked this Ocean Taqueria better than the one on Ocean.  The staff was friendlier and my quesadilla seemed extra delicious.\n\nIt's weird ordering though.  First time there I wasn't sure where to stand.\n\nGood food, good salsa.  My dad loved his fish taco.  Wish it was in a more accessible place though.\n\n3.5!", "author": "Kimiko Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-10", "description": "Run-of-the-mill taqueria that is one of the few options in the Pac Heights/Western Addition neighborhood. Decent assortment of meats and options but not necessarily the freshest or most flavorful. If you got a burrito fix, this should get it done but the quality is not even close to what you can experience in the Mission. Ocean should be only for emergency Mexican food cravings only.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "This little hole-in-the-wall can be a little hard to find, maybe that's why there never seems to be a line here. But it's tasty food and relatively cheap for the neighborhood. This is my kind of place and will keep coming back!", "author": "Katie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "Decent and somewhat authenticate Mexican food that's not in The Mission. The chef really knows what he's doing, and their food is always delicious. I like it too because it's not usually too busy, and the staff is really friendly. I usually order the nachos and they heap on the toppings. If you don't want to wait at Burrito Express next door (they suck anyways) come here.", "author": "Beth H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-18", "description": "Great place to pick up a big, fat, juicy, dirty burrito.  \n\nExpect to get a hefty scoop of rice, massive amounts of meat, and enough of the other crap (beans, peppers, onions, guac, salsa) that the tortilla just barely wraps. But don't expect the folks behind to counter who handle money to wash their hands before they wrap your burrito. The dirtiness is probably what makes the burrito taste good.", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "From the sea to your tortilla.\n\nTilapia was the fish of the day. Despite ordering a baby burrito pretty sure I got the whole thing and maybe his sibling. It was a massive serving.\n\nSwam exceptionally well with black beans, mild salsa and lettuce (no charge) in a tomato tortilla (changing it up for the day).\n\nGood value for $7. Can't imagine eating anything larger.\n\n(yes I could)", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-10", "description": "By San Francisco standards, this is very weak Mexican food. Will definitely not return here for another meal. el burrito express 2 is significantly better with similar prices.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "I've been going to this bastion of awesometown ever since it was at ocean and a block away from my house. Now I travel across town 15 minutes for this glorious and most delicious mexican cuisine. The jumbo burrito is the length of my arm. THE LENGTH OF MY ARM. It's two supers put together for about 14 bucks, if memory serves correctly. Add to it that they grill the chicken and/or steak in front of you rather than that pre grilling and keeping it warm with water and you got my support. It's delicious. Out of the hundreds of times I have gone to this establishment only ever had one bad burrito.\n\nI tried the nachos with steak and they PILE IT ON. They give you hella healthy portions. Extra points there. Furthermore, the staff is always friendly, and for what ya get the prices ain't too bad.  \n\nI'll back it up 110 percent! \n\n(boyfriend writing this.)", "author": "Emilie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-06", "description": "A proper no-frills joint. Order en espagnol (or just greet with \"Hola Amiiiiiigo\"), take it to go, get extra guacamole  ... Extra points for their spanish rice being cooked in a home-made broth, that really melds together all the essential burrito-o-logical elements.  4 Stars! (5 Stars for the neighbourhood)", "author": "I. O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-25", "description": "I have eaten here a few times. Sub par menu for sub par mexican food. The last time me and the man where there, we waited our turn in line by leaning against a wall. \nSuddenly, I noticed the wall was wet. The fuckers had just painted and didn't put a sign or anything. And, the guy behind the counter totally saw us and didn't warn us. So, after I realized my dress, bag and sweater had just been ruined, I told them about it. They didn't even apologize!!! \nMy bf wanted to eat, but I was over it. I stood there angrily while they made our food and the chef tried to joke with us by tossing the burrito up in the air as though he were a pizza chef. Please. We're not 12.\n\nWe got our food and the bastards actually charged us. Oh wait, they gave us a $2 discount and told us the paint was primer and would wash out. Well, two washes later, and my stuff is still ruined. So is his sweatshirt. We went back. They still refused to even apologize. I demanded that he give us at least our money back. \nI refuse to ever go here again.", "author": "joanna r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-07", "description": "Stopped in on Sunday November 6th, 2011 - around 7 PM. After entering - the place was empty I proceeded all the way to the back where I ordered a chicken burrito to go after looking around for a few minute trying to figure out how to order.\n\nThe burrito was put together in about a minute or so - rice, pinto beans, chicken or a tortilla which did not hold very well compared to other SF places. Overall burrito was about $7.25 or so with tax.\n\nI would recommend other mexican places in the area over this one.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "During the school year, this is a must when I go off campus for lunch. I always get a grilled chicken quesadilla, which is filled with rice, cheese, and copious amounts of diced chicken. Whether I eat it there or get it to go, it's always delicious and warm, and the portion is huge. They give me incredulous looks when I tell them to put nothing on it (no salsa, guac, etc.) but they end up joking about it anyways. The guys working there are good natured and always have a smile on their face. The line gets long around lunch time because students come here, but service is relatively fast and the food is pretty cheap, considering its location.", "author": "KC W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "Best Burrito in SF hands down. They don't do anything fancy and this isn't your California \"lets add healthy crap to your food\" type of place. If you want amazing food at a cheap price this is the place. They make all their food fresh and it is very authentic but don't go in thinking its a healthy place cause this is gut busting, over sized, in your face mexican food that will leave you begging for more.", "author": "Adam V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "I just finished a delicious regular carne asada burrito from Ocean Taqueria. The burrito was so good I might brave the BARTless (yet another lame strike) public transportation to go enjoy another one! I enjoyed spicy salsa and refried beans on my delightful burrito.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-09", "description": "I didn't think the carnitas was that good. Maybe I should be getting some seafood there based on the name but while the portion was generous the Carnitas just didn't really bring anything special flavor or texture wise.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "I loved the plywood menu written in sharpie. It totally made my day. The guy who works here is super nice and while your order may get messed up a bit, it is all worth it in the end because you leave with a solid burrito that you will be proud to put in your belly. The vegetarian burrito can be vegan and it is quite good. \n\nYour first instinct to run from the hand written menu is wrong, dont trust it. Go with the magic.", "author": "Peter V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "5 stars for the food, 4 overall as it is a as a small local taqueria that could use a little refresh.  That said, I have eaten here a lot and the food has always been fantastic.  No experience with their take-out, but every main item  I have had at the taqueria itself has been my favorite of its type. \nSo, I've had a bunch of their burritos and their quesadilla.  Delicious, well prepared and huge!   Their \"Baby Burrito\" is a meal in itself   Their Super Burrito could cover two meals.   The 12-inch could feed a small family.  \nMeats are alway tasty and well-cooked.  (Never had the weird piece of gristle that pops up in most other places from time to time.). Fillings are fresh and generous.  \nOnly issue is sometimes the chips are a little stale.  Oh well.\nDecor is a little funky and a bit on the grungy side, but never had an issue from it.  (Bathroom is always clean, though...)\nService is always easy and friendly. \nI've eaten at El Burrito Express, Super Burrito, Pancho Villa's, etc.  They are all very good, but I have yet to have a Carne Asada or Pollo Asado burrito better than Ocean/City Taqueria.", "author": "Marco I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-20", "description": "Good burrito fix, nachos are allright, hot sauce is pretty hot. Pretty satisfied with this place, Ocean Taqueria is a quick stop burrito joint. It always does the fix for me, pretty consistent. They give you pretty good portions too, actually just right for the hungry man!\n\nThey can improve on better tasting beef and fresher lettuce, but other than that, they are pretty tasty.", "author": "Howard J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-18", "description": "My sis picked me up a chicken burrito from this place. It's decent, but I've definitely had better. The flavour is just right though and there's no bad aftertaste that some burritos leave in your mouth so those are definitely pluses. The size is just enough...not overwhelming but enough to keep you full. The only complaint I would have is that it has a lot of beans in it. There were too many beans and not enough of the other stuff. Otherwise, it's a decent burrito.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-23", "description": "Absolutely awful. Went in with one of my friends and we ordered a cheese quesadilla. When the food got to us, the cheese was completely uncooked and immediately gave us stomach aches after eating it. After about ten minutes of stomach pain, my friend needed to pull over to the side of the road to vomit. Later that night, I also vomited. I will never come back, the food was absolutely terrible.", "author": "Stacie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "I like this taqueria, a solid neighborhood staple.\n\nService- pretty good in English, better in Spanish.\nAmbience- multitude of flyers on wall are fun, but apart from that it's pretty cold.\nFood- no complaints, except that you're at risk of getting messy. They'll make it however you want.\n\nPrice is right, place is welcoming, and the best part is I can go in whatever I'm wearing/whatever state I'm in, and they'll never make me feel weird :).", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "I have been a loyal customer of El Burrito Express for years now.  Sometimes it makes me a little sick, sometimes I rush in right at close and they tell me I'm too late......it's never an overly friendly experience but when that Super Bronco burrito comes together it is something special.\n\nLast night I walked in at 9:00 and they were closed.  Finally time to give Ocean a try, and it was pretty damn good.  The staff was super friendly, the tortilla was really well grilled, I asked if they had avocado instead of gauc and he gave me a whole avocado for no extra charge.  I'll def be back.", "author": "Eamonn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "This place has the authentic look which would make you think the food will be good, but something about it is just off the mark. I only come here if im dying for some local Mexican food (as its really close to my house) and its Sunday, because El Buritto Express isn't open on Sundays. That place is the truth, Oceans Taqueria is decent.", "author": "Nikko J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "I've been going here for a couple of years now. Good prices for the amount of food. I usually get a steak burrito, and the burritos here are the juiciest in the city. The tacos and nachos are just as good (fully packed too). The staff is friendly, and the looks of this place might be deceiving, but don't be discouraged.", "author": "John A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "Good eats and don't let the hospital like interior (being generous) scare you away as the product is fresh and tasty, and made to order.  I have only tried their chicken burritos but stop here often and it's a big hit in our family.  The owners seem nice and never have the nerve to tell them if they painted and freshened up the place, they could charge more and do more business.  The quality is there and recommend eating elsewhere unless institutional color scheme and lighting is your thing.", "author": "mike s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-22", "description": "It was eh...\n\nI ordered 2 tacos Pollo.  Guy asked me if I wanted everything on those, I answered yes because I did want everything that the menu listed as being on tacos on them.  Unfortunately the guy meant \"everything\" as in did I want the super tacos.  I didn't find out what he meant until it got time to pay.  It was a little annoying because 1) the menu tells you what is on a taco, super taco, burrito etc...  if I order a taco and don't say \"hold the beans\" and beans are on the menu as an ingredient well that means yes i want the beans, no need to ask about each individual ingredient.  2) I ordered tacos not super tacos, it seems like a sneaky way to up sell.\n\nAnyway I was in a hurry and didn't want to wait for dude to make new tacos, and I had debated trying the super tacos anyway, so I just took those and went.  Not sure if it was a factor of getting them to go, I didn't travel very far.  But when I got home the tortillas were soggy to being in-edible.  Might be that they were loaded up with all the extra \"super taco\" shit or the whole togo thing or both.   Just something to keep in mind.\n\nThe \"super tacos\" were tasty, and very filling.   The first was sloppy but I could eat it by hand.  The second I needed a fork and could only finish half of it.\n\nIf it was across the street and I had a hunger for a taco, probably avoid the super tacos in the future, I'd stop in and eat them there.  But not worth going out of your way for.", "author": "Max Jonathan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "It looks shady but taste good!!! Its strange cuz you have to order your food way in the back. Good mexican food and cheap!", "author": "Jess O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "The best burrito ever!  I'm new to burritos, but my burrito connoisseur man friend says these are the best in town.\n\nThey have these potatoes you can add to your dish that are soaking in this wonderful, spicy, flavorful sauce...I always add them to my baby sized burrito and it really takes the burrito from \"good\", to HOLY F'BALLS THIS IS AWESOME!!!!!!\n\nGet the potatoes.", "author": "Genevieve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "To be honest, El Burrito Express, just down the street is 10x better and granted I would eat there over Ocean Taqueria any day of the week; Ocean Taqueria is a fine substitute when EBE isn't open, like on Sundays for instance.\n\nI ordered the Jumbo burrito and it was mightily Jumbo. Its basically two burritos long and was almost as long as my arm. Needless to say the burrito was too powerful for me and I was soundly defeated with about 4-5 inches left to go. However, size aside it was very tasty. The rice could have used a bit more punch, but it was not bad at all. \n\nIn a nut shell: eat at EBE if its open, or if you eat there frequently give this place a go at least once. Don't order the Jumbo Burrito unless you mean business.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "I'm a big fan of Ocean Taqueria. They make excellent burritos. I've been here a few times and had both the carne asada and veggie super burritos. Both were excellent. The burritos are made-to-order, they warm the tortillas on the flat grill, and then methodically construct and perfectly fold them and wrap in foil paper so you can eat them in your hands. The chips are good, the only thing holding this spot back is better salsa. If you want a flavorful burrito with all the toppings, this is the spot in pac heights.", "author": "J H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "I love this place. Great burritos. At lunch time they put our trays of fruit for you to eat while waiting for your food. The people working are always super nice and chatty. Also, the walls are decorated with ads, the best one was for a pug dog walker. \n\nMy only complaint about the place is their mild salsa, it's pretty bland.", "author": "Kami R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-16", "description": "Not too happy with this taqueria, & the way the customer service was, i had been waiting for 10minutes to order and then a person that spoke spanish cut in front of me and gave her order (in spanish) to the man on the grill. The man on the grill started on her order, in which i thought that wasn't fair at all since i had been waiting in line for so long. The prices are super high for being next to another taqueria that has more room, is courtious, and has a bigger menu! they need it get it together if they don't want to loose more business! For me that was it, I'm not going to give my hard  working money to a place where they don't aknowlege you if you don't speak their language! I simply walked out.. Boo..", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-25", "description": "Great bang for your buck.  Little hole in the wall Mexican joint that gives you great portions and if you love cilantro, jalapeños, and avocado than go here! Not flashy just quick and easy.", "author": "Zachery N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-27", "description": "Surprised to find an authentic taqueria in this part of town, we hopped into the first one we saw - Ocean Taqueria. You walk down this super long hallway to the kitchen area to place your order. There were 2 guys ahead of us, ordering massive burritos. I probably should have gotten that too but I had my heart set on a Super Quesadilla ($6.50). \n\nHe starts with a huge tortilla, adds cheese and throws it on the grill. I asked for carne asada, so he throws that on too, and then adds onions and green peppers. That was a nice touch.\n\nOnce hot and melty, rice, beans, guac sauce, salsa, sour cream and hot sauce (if you so choose), and lettuce, gets thrown on. He tried to roll it but it wouldn't close. So he folded it in half and called it a day.\n\nChips and salsa are extra, and sodas are self serve. This is a no frills kind of place but frequented by authentic patrons. \n\nOverall I still think the places in the Mission are better. Maybe cuz I go when it's late in the night and the meats are more flavorful and juicy. But good to know there are some Mexican food options in the area.\n\nViva la Taqueria!", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-04", "description": "I give them 3.5 stars for the food and extra 1/2 for awesome service. The guys who work here are super cool, but my friend was also hard core flirting with them! ha. I ordered the Super Burrito and couldn't decide if I wanted verde chicken or the red sauce chicken, so the guy said do you want both? I said hell yeah! it was yummy and moist, after standing in the Giants parade for hours anything was good. Oh, I've seen this before but not a fan, lettuce in the burrito, uh I don't like. I also got the watermelon fresca, not too sweet, on the money! The guy said sip some and I'll give you more, Hell yeah! Only one downfall, uhh I want free chips! No bueno.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "I think this is the best taqueria outside of The Mission. A little hole in the wall place that looks slightly intimidating but instead is very inviting and friendly. They grill the tortilla, which I prefer, and they grill the meat on order. They ask you if you want onions and peppers (say YES!). Now my review is for a Super Baby Steak burrito but I imagine everything else is just as good. And yes, you want everything on it. Now I am not a fan of goopy burritos but I make an exception here because it is so flavorable and I love slurping up the juices. The burritos still manages to be tightly rolled and you get a bag of tri-colored chips. I love my Mission taquerias but this place is a front runner for Best in the City.", "author": "Marguerite E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-15", "description": "I was surprised to see the rating on this place being anything more than 3 stars, but to each his own.\n\nI went here yesterday because I was craving a burrito and I love El Burrito Express which is just a few doors down, but after I drove around and finally found parking, they were closed on Sunday.  So, on my way back to my car, I saw this place was open and decided a burrito can't be that bad.\n\nI walked in and the guys were very nice and it was kind of awkward because they kept speaking to me in Spanish even though I kept answering in English!  I don't know much Spanish at all so was surprised that I even knew enough to get by yesterday.  They were asking me more than just whether or not I wanted cheese or not, but whether I was eating at home and all kinds of stuff.  Either way, I got by!\n\nAs I was watching them make my burrito, everything was runny.  It looked like everything had water added to it.  The guac, the beans, the sour cream - all  very runny.  They put very little rice on, very little beans, very little sour cream and a bunch of pork which I was semi afraid of eating because it looked more like pork flavored product than actual pork.  So I get a very empty burrito for 8 bucks.\n\nThis is the only time that I have been here, but I don't think I will waste money trying it again.  Yes, my place is closed on Sundays so if I am really craving a burrito on a Sunday, I will just head to one of the other hundreds of Taquerias in this city.  This place is sooo not worth it and completely didn't satiate my craving.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "This is my favorite place to get a veggie burrito in SF. It's open late, very friendly people, it's usually empty, so you don't have to wait, but most importantly - they make absolutely great burritos.", "author": "Lukáš L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Everything tastes fresh and the employees are super friendly. One of the best burritos in the city.", "author": "Harrison G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "The Best Taqueria in the city. We were eating in their Ocean location ever since 2003 and were very sad to see them leave the neighborhood. We drive to Divisadero every few weeks when we want burritos. The Grilled chicken and Crane Asada are made to order unlike other places that it is already grilled when you walk in. You need to know what you want but they will do whatever you ask. They have peppers and onions  that they will grill for you to add to your order (it is not mentioned in the menu). sometimes they have problem understanding English since I do not speak Spanish but they got a lot better with the language in the last year. very nice employees, good service. not a great place to a sit down meal, just not a vivid restaurant, but the best burritos.", "author": "Edith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-29", "description": "After a long run\nI'm not hungry anymore\nJumbo Burrito\n-----\n\nI'd like to start this review by saying that I always find it amusing (and kind of stupid) when an establishment named after a street (normally a tell-tale sign of a less than creative force behind the venture) goes beyond its namesake street and opens a new location on a different street (Irving Pizza on Geary Blvd being another example).  Congratulations on expanding your turf--too bad you couldn't come up with a better name this time, either.\n\nI mean, c'mon, it's not like restaurants named after streets have the type of brand recognition and reputation that would be worth leveraging.\n\nThat aside, I really thought I would never go to this Ocean Taqueria.  El Burrito Express on Divisadero is just so good that I couldn't see myself going anywhere else.  And the one time I went to Ocean Taqueria on Ocean, I wasn't impressed, though I don't remember it being bad either.\n\nThen today I ran 15 miles and I was craving a burrito, but El Burrito Express failed me: they are closed on Sunday.  I was disappointed, but I figured Ocean Taqueria would seize this opportunity to gain some business on their competitor's off-day, and I was right.  As it turns out, they offer a Jumbo Burrito for $9.50.  I had to have it.\n\nThe Jumbo Burrito is delicious and the main reason you need to go to Ocean Taqueria the next time you are starving.  Try it.", "author": "Jin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-10", "description": "Baby burrito = perfect size. Just good, divey Mexican food. I'm not even sure what was in my veggie burrito, they just sort of slopped a bunch of stuff into a tortilla (I said no to the potatoes they offered me, though) and wrapped it up to go for me.\n\nDespite this, I don't think I'd ever come back here. I was a first-timer with no idea how to order, and don't think I'll get over how awkwardly excruciating the exchange was in trying to get that damn burrito from the kitchen to my mouth.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "So we all know a burrito is pretty predictable and basic. You can make it super, of course, but still...when you think of burritos it almost kinda doesn't matter where you go, you know what you'll be getting. Well, I don't know how to explain why Ocean Taq's burritos are better and different BUT they just are! The meat is fresh, the lettuce and pico de gallo is fresh, the whole thing just tastes FRESH. The only reason why I'm not giving it 5 stars is because they don't have wet burritos!", "author": "Francesca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "Good burritos with some tasty sauces. \n\nThe giant ones are too giant for me but you will do well for a quick bite here.\n\nThe interior could use some love.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-18", "description": "I've tried both the express and ocean now. I must say, Ocean wins.\n\nI do need to give Express another try, but nothing was poor about Ocean except for the lack of free chips. \n\nI had the super burrito with spicy pork (I don't think it was on the menu and was a special that day). but it was sweet, perfect spice and delicious. filling. \n\nthe guys there were friendly and fun. i'm comin back and you beat xpress mondo mumbo jumbo in my eyes.", "author": "Victor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-25", "description": "Three words: Chicken Fajita Quesadilla. \n\nIts one of the best things you can get for $7.05 in the city. I have never had a stomach ache after eating at this establishment. The Chicken Fajita Quesadilla is ridiculously good. Can't go wrong with steak fajita. The key is fajita, if you don't want your meat made to order with peppers your crazy. The burritos are cool too, but quesadillia is where its at, keyword fajita.\n\nI read reviews on Yelp, and its not necessary to state the obvious. You walk in Ocean Taq, and you're like \"Whoa, Funky...\" but you're wrong, its so good. Maybe you should take yourself out of there and go to Tortilla Heights, get sexually harassed, and a bad meal. \nThe guys that work there are as cool as guys that work in taquerias get, yeah they get funny sometimes, but shit your at ocean taq people, its not exactly the ritz. Stop it, give the killer queso's the props it deserves and zip it with the ego's. Learn how to adapt, your not in Kansas anymore this is the CITY! \n\nHere's a script for you when at ocean taq:\nEnter the establishment, walk down to the grill, look a the grillmaster and say,\n\"Chicken Fajita Quesadilla por favor\"\nGet it with everything you like, I like it with black beans, rice, and everything no sour cream, the spicy ain't that spicy if your scared, and the not spicy is good too. \nBehave yourself.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "I had a good burrito here. It was fast, cheap, homey... A good experience.", "author": "Clayton S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "i'm not sure how this review can be less than 5 star! I get my meat freshly grilled to order with minimal (if-ever) any fat! now that's what i like... do i have to wait? most likely... and i might even have to speak up! i can handle that", "author": "Eva R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "I can eat their carne asada super burrito for breakfast, lunch, or dinner.  They cook the meet right in front of you and everything tastes fresh and healthy. The steak is not dry. It is juicy and the natural au jus is so tasty!  THe super burrito is about $8 and my fiance and I cut it in half and have a great meal because its pretty big. Don't forget to get both the green and red sauce on the side for your burrito to add more kick.", "author": "Shayenne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-20", "description": "Who knew a sequel could be so good???\n\nI was skeptical due to the fact that I've never \"loved\" the place on Ocean, but stepping into the one on Divis is a completely different story. Even when busy, the guys are always friendly and joking, make food as fast as they can, give salsa samples while you wait and...wait for it... ARE OPEN ON SUNDAYS!!! (most of Divisadero should learn this too...). \n\nThe enchiladas are amazing and more than plentiful, and the you can never go wrong with a carne asada burrito with all the fixins'. Also, they have a JUMBO burrito, which is something like an absurd 14 inches of burrito-y goodness. Nom nom nom...", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "Tasty, fresh, and friendly, but pricey.  I like getting the combination rice plate with fish(tilapia), chicken, and steak with a cantaloupe juice.  This is a really pricey mexican joint though, expect to pay about $15.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-13", "description": "Good = 1.  Open on sundays, when you forget burrito express isn' t open  and you reallllly want a burrito.\n            2.  Custom orders are A- OK (make your burritos wet if you want to!)\n            3. Workers called me \"amigo\"\nBad = 1. Had to walk through a super narrow restaurant to get to the ordering stall \n          2. Not really a place to enjoy a view (unless you bring someone pretty with you)\n\nHad to admit though, there burritos are good, but burrito express just two doors down is better.", "author": "Chirag V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-23", "description": "I just ate there an hour ago and ended up puking on the side of the road on the way home. I got a simple cheese quesadilla and it wasn't fully cooked (cheese was barely melted). My friend got sick from eating part of my quesadilla too. I had to pull over on the fucking side of the road and sit on the curb....I hate this food and will never be back. Orchata was warm. Not recommend, should have gone to Burrito Express", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-06", "description": "Points for freshness. I ordered a fajita chicken burrito and they grilled up my meat and veg to order. Portion was good, I couldn't finish but it just didn't pop. Tasty but not great. For the price it's a keeper and I'll be back but I think there's better out there.", "author": "Marcus D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-17", "description": "As far as taquerias go, I think this is the best one on this part of divis. The guy who runs it is always friendly. They will let you taste salsas if you aren't sure what you want.\nThe best thing to ask for is the habanero salsa. It's not ridiculously hot but it will get you sweating.\nI don't order pick ups so I can't speak to their ability to correctly fill orders. But, there usually isn't too much of a line and you can always get in and out in 5 minutes with a super tasty burrito to fill yourself up with. Open till 10pm too which is a plus for us late night burrito fiends.", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "This place is very good.  The ambiance leaves a bit odd, but if you showed up for the ambiance and not the food, you're in the wrong place anyway.  \n\nDon't even both with the menu hanging on the wall, just go to the back of the place and tell them what you want.  The good folks back there quite literally load you up (your burrito, taco, quesadilla, etc) with whatever you want - and it's all really good. \n\nMade the mistake of getting a quesadilla, and it fell to pieces with all the stuff packed in there.  Still, it was delicious.  Next time I'll order one of the burritos, so it doesn't fall apart on me.  \n\nAlso can see it as good place to go pick up a burrito to-go.\n\nTwo thumbs up.", "author": "Stuart V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "Who knew there could be such a find north of the Mission?\n\nI started eating here about a month ago after a great tip from a cabbie. When he told me they grill each customer's meat to order, I vowed to make the two-storefront trek past my usual spot.\n\nI ordered two super steak tacos (thank you again, Mr. Cab Driver) and was blown away. They were loaded with succulent, piping hot meat, melting cheese between two slightly crisp mini-tortillas, and lots of veges and herbs. I'm drooling just thinking about them...\n\nI've been back almost every weekend since then (after, and even sometimes during, my aerial dance classes at Dance Ground Keriac across the street). I love that the cooks flirt with me in Spanish.", "author": "Ali W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "Great tasting burrito. Order carne asada or pollo asada so they cook it fresh. I believe it was under $8. I will come here again. It's also open late, until like 10pm on some nights.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-10", "description": "Ocean Taqueria defies the idea that competition builds better products. Compared to the taqueria two stores down (El Burrito Express), there is NO reason to come here. None! If you are sitting down wondering what burrito place to go to in the neighborhood, GO TO EL BURRITO EXPRESS! Why is that? Well what makes a great burrito?\n\nFirst of all, all great burritos have their tortillas GRILLED, preferably on both sides. Burrito Express does this, Ocean doesn't. They steam theirs and the tortilla is soggy and sticks to your teeth. Blah.\n\nTwo, meats. Though you might be fooled by the fact that Ocean throws their meat on the grill when you order it, don't be! It's bland and tough.\n\nEven spread and heat. Your burrito should have its contents evenly spread throughout the burrito and both Express and Ocean do this. But the big difference is heat. Express's burritos are always warm and retain their heat through out the meal. Ocean's burritos are lukewarm at best and by the time your done, cold.\n\nNext, size. For slightly more (as in about 50 cents more) you can get a burrito at Express much much larger than the puny, tasteless burritos at Ocean.\n\nService can be sketchy at ocean. Sometimes they're really nice with no problems, at other times they're rude, condescending, and misogynistic. I NEVER get that at El Burrito Express.\n\nOk ok, there is ONE reason to come to Ocean. That would be Sunday's. Express ISN'T OPEN ON SUNDAYS! What the hell!? The BEST day for a burrito, after a night of Saturday drinking, I crave, I starve for a good burrito the next day and I'm stuck with crappy Ocean. \n\nSomeone should tell Catholics (I'm a former member) that on the Sabbath, God didn't just rest, he ate a burrito and how would he feel if his favorite neighborhood burrito place was closed? HUH!? What would he say? HUH!? How damned would you be if God had to go to HELL and get an Ocean burrito?\n\nI wonder what Church they go to...", "author": "Robert P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-19", "description": "This place is my favorite burrito in SF. The place is authentic, clean, and delicious. I would go here on a regular basis when living in SF 1-2x a week. The burritos are affordable and the soooo good. \n\nTry the Grilled Carne Asada Burrito with Onions and Peppers and all the works. \n\nOnly negatives are:\n-Be careful when calling in for pick up, they have a tendency to mess those up as no one really is fluent in English. You don't even really need to call it in, I have never been there where it has taken more than 5 minutes to get a burrito.\n-The space is laid out really awkwardly, not really important but I wish they would redesign their layout.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "I'm very surprised that this place only has an average review of 3 stars...\n\nI ordered a standard super burrito w/ carne asada and was blown away by the combination of all the flavors of the rice, beans, meat, veges and sauces that were in this heavy duty burrito.  I had a nice, cold refreshing horchata to compliment my meal and overall I was more than satisfied.\n\nI hear this place gets packed but I went 3pm on a sunny sunday afternoon and the service was speedy and more than adequate.\n\nI highly recommend ordering at Ocean Taqueria whenever in lowe pac heights or anywhere in the city!", "author": "Natan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "Absolutely amazing. Get the grilled chicken burrito with everything. Habenero sauce on top. If this place closes, i will never be able to find another perfect burrito. Tip them please, they need to stay open until I die!", "author": "Mel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "Huge fan! Excellent burritos, great refried beans, nice and spicy. good times.", "author": "Rohan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-18", "description": "The grilled chicken burrito is to die for but watch out, a small one will do you.  I love the enchiladas as well and the tacos are worth the money, they're huge.  The best thing about this place is the staff is really friendly and aim to please.  They also have a sampling plate near the kitchen that is cool.", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-22", "description": "After our plans for Thanksgiving went bust, we went to this place, which was open (much to my surprise) and I got a great veggie burrito for a good price. :)", "author": "Dani S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-14", "description": "I went here last night with my boyfriend since he says it's really good. So I get the super steak burrito and he gets the jumbo steak burrito. OMG the jumbo burrito is SO BIG! Of course he didn't finish it... $10 for a jumbo burrito and I think $7 or $8 for a super burrito. I thought the burrito was okay. Definitely tried better ones.\n\nThe decor was kind of ghetto. You can't really read the menu since it looks like chicken scratch...\n\nWhat's kind of funny is when my boyfriend called to ask when they close, right about when he was hanging up, the worker said MEOW and hung up. Hilarious!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "My expectations for divey taquerias are simple: quick friendly service, good food, free chips and salsa (excuuuuuse me Nick's Crispy Tacos).  Ate at Ocean Taqueria this evening and my expectations were met.  I ordered a spicy chicken quesadilla with everything, my bf got an al pastor burrito (perk alert:  They don't have al pastor but they will make you a batch if you want some).  Both dishes were muy rico, especially with the habanero salsa they make in house on the side!  The guys cooking were friendly so we bought them beers.  Today was one of the 5 days a year that SF is hot and they were busy; if I was cooking in a teeny taqueria in the heat, I would appreciate a beer too.", "author": "Dakota L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "Delicious and cheap. They know what they're doing with a burrito and taco. I recommend it for a quick lunch or late night snack.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-13", "description": "I'd like to know what they do with their meat, and I'd like every other taqueria to do that.  Let's call it what it is--this is a taqueria.  No ambiance, no service with a smile (friendly though, just not effusive) just good ass tacos and burritos and such.  Great, signature hot sauce.  It was no this good when I lived in this neighborhood years ago.", "author": "Ian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "I got the pastor which was good but it wasn't amazing. I have found there to be much better mexican cooking in the city. The habanero salsa is definitely recommended if you do in fact find yourself there.", "author": "Drew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-29", "description": "This place is awesome, what I've noticed is that most people who arrive here for the first time don't know how to order. Let me break it down to help facilitate a positive eating experience at the OT.\r\n\r\nA) Go all the way to the back to order, do not stand in front of the cash register (that comes later)\r\nB) Break down your order in simple terms, like this... \r\n    1. Ola! Can I get 2 super burritos.... (Wait for acknowledgment) \r\n    2. I need 1 chicken & 1 steak.... (Wait for acknowledgment)\r\nC) Now you must refrain from over doing your order with toppings and just wait for the meat to sizzle on the grill. \r\nD) Select the topping for each burrito separately\r\nE) Proceed to the cash register and pay.\r\n\r\nMy personal favorite is the carne asada super burrito with salsa, guacamole, pinto beans & hot sauce. \r\n \r\nPS I have never seen them with their shirts off and I hope I never do.", "author": "matt l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "A truly great burrito. In the last two weeks, three truly great burritos. Ran into this place with my mom the other week and have gone back several times with friends since. I would recommend the grilled chicken with veggies or the fish burrito.  A friend loved the spicy, marinated chicken one as well.  Super friendly cooks, awesome meat options, and two amazing salsas. A pretty awkward walkway/entrance to the back where you order and an overall freezing temperature, but cool wall decor and of course food. Ask for the hot salsa and you won't even notice how cold you are.", "author": "Zoey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-10", "description": "Do your self a favor, never ever ever ever ever ever ever ever ever go here.\n\nLet me start by saying, I've been going to the original location since it opened, about 5 years ago. I know the owner, and pretty much the whole staff at the other place. I lived near by and went to SFSU which is down the street.\n\nAnyways, I went to the Divisadero location and I ordered a regular burrito, and he asked again if i wanted cheese, I said no. The guy who filled the condiments and ran the register was taking his sweet time filling our order.\n\nI get to the register and was paying for both my friend and my burrito. The rings mine up as a super burrito. I mention to him I ordered a regular and didn't ask for cheese, guacamole, or sour cream. \n\nHe gave me a smug look, put the burrito behind him on the counter, and then went to fill other people's order.\n\nAt this point I was confused, the guy never said anything to me, or tried to talk to me. He mentioned something to the cook and then ignored me. I couldn't believe it, eventually I sat down with my friend as he ate his burrito. I think/hope they will remake it because I paid for both at that point, but didn't have my food.\n\nFinally after taking 4 people's order, waiting about another 10 minutes, I am extremely starving at this point. They remake the burrito and call me over to get it, but never asked me exactly what I wanted. \n\nObviously at this point, I'm pretty irritated, so I quickly rip the burrito in half to check what they put in it. They forgot onions and peppers, spicy sauce, and habanero. I go over and ask the cook and try to talk to him, he shrugs and doesn't say much, but the guy who ran the register/condiments, calls me a \"Puta\", grabs my plate and pushes the burrito off into the trash. Then walks over to the register and starts pulling money out and puts it out on the counter. \n\nOnce I got the money back, before I did anything I'd regret, I told my friend lets go, and got a burrito next door. \n\nI'm always one to give a place a second or third chance, but the previous times I've gone, they don't make the burritos correctly as the original location does. This was the last straw, I'm never going here ever again, and when I make it down to the original place, I'm going to let them know what happened.", "author": "Deepak J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-11", "description": "Ghetto - Check.\nDive - Check.\nA little scary - Check.\n\nHey, I'm not saying I wasn't warned about this place as we were walking in but nothing was really going to prepare me for the ghetto-fabulous-ness of this place.\n\nI had a chicken super burrito with no beans which was super cheesy and delicious.  From what I hear, you gotta make it a super burrito.\n\nEasy to order, basic menu, customize as you please.  Me likey!", "author": "Derek B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-14", "description": "My 5-star rating is based on the assumption that Taqueria's should be rated on their product (they're not suppose to be rated like other restaurants).  Taqueria = Burrito/Taco factory   \n\nI see most of these reviews are either coming from veterans or new-comers, which explains why the reviews are so extreme.  Let me go over some fun OT facts:\n\nThis is Ocean Taqueria #2 (OT #1 is on Ocean ave - hence, \"Ocean\" Taqueria)  The third taqueria owned by Chino is called \"Chinos Taqueria\" on Balboa.  All three taquerias make fresh guacamole, pico de gallo, and sauces on the spot.  Chino buys fresh meat several times a week, and proudly displays the meat & produce invoices at the cash register of OT #1 (on Ocean, remember!?)\n\nI love this place!  OT serves the best burritos in San Francisco!  If your looking for a nice, common-sense, professionally run business - this is not the place.  If your looking for the best burrito $6 bucks can buy - the search is over!", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "Came to this joint because my favorite taqueria next door, Burrito Express, was closed (booooooooo).  Why are so many places closed on Sundays? I just don't get that.\n\nAnywho, it turned out okay because Ocean Taq was awesome! I had the Super Burrito with carnitas. It came stuffed to the brim with: rice, refried beans, cheese, guacamole, salsa and sour cream (which I opted out of). It was finger lickin' goodness. Also noteworthy were the chips and salsa which were fab.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-09", "description": "They definitely don't have the Feng Shui going here.  \n\nWeird setup, friendly folks, but the carne asada was kind of odd.  I don't know - when I crave a burrito, I go to Gordo or Pancho Villa.  If someone held a gun to my head and said \"eat an Ocean burrito or die\", I wouldn't hesitate to eat a burrito.  But as a free man in a plentiful city, it's not my first choice.", "author": "Louis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "This place is great. Just be careful with the orange hot sauce! It could kill ya!", "author": "M R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-04", "description": "Can I help you, amigo?  That's usually the greeting you get when you go into this place.  It feels like one of those hidden mission burrito joints that makes awesome 3 AM burritos... except you're in the lower pac heights and it's noon.\n\nMan, it's nice to know I love the taste of burritos when I'm sober too.\n\nNice portions, and the choice of getting a 'baby' burrito (a little smaller/cheaper) has probably saved me a few miles on the treadmill.  The lunch plates are popular too... you can get your favorite meat in your favorite sauce with all the fixins.  Price is decent too and the guys here are really friendly.", "author": "Neej M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-07", "description": "It is fast, it is dirty, it is good.\n\nNot the best burrito I have had, but definitely not the worst either.   They pump out carne asada burritos in a flash and it is close to home.  The only drawback is the lack of parking, but then again, we live in San Francisco.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-21", "description": "Best Burritos. I used to love Cancun out near 30th street-- but after getting knuckles and gristle in my burrito one night... I looked closer to home for my fix.\n\nThey grill the meat fresh and they'll make your selection any way your wish. The staff is nice, and they always remember my husband and I when we come in.  I really like that they have an area to dine in at, so you can sit and chat a while.\n\nI've taken most of my friends that are visiting to this place-- and they  LOVED it. Even some with the most sophisticated palettes enjoyed the burritos. \n\nMinus one star, because they're not open later :[\n\nThanks to  Matt L. for laying out the ordering process in your yelp review-- it helped the newbies keep the place efficient.", "author": "maranda w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "Almost Mayberry friendly and with the best horchata in the city. A bit cramped and somewhat chaotic, but these are the places with true character. It is why we avoid Applebee's and such.", "author": "George S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-10", "description": "I live a couple of blocks away and eat here often, and there is nothing really to complain about.  Are there better taqueria's in San Francisco?  Sure, but they aren't two blocks from my house.\n\nI enjoy the made to order approach (as in, \"I'll have carne asada.\"  and then they pull out some raw beef and throw it on the grill) and the Jumbo is unreal (a burrito that is made with two tortillas, yeah).\n\nI could do without the soggy lettuce.", "author": "Vince T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-27", "description": "Some major burrito faux pas here:\n\n- Too expensive. 7$ for a big burrito.\n- No flour tortillas for the big burritos. I had to get a spinach tortilla. Um... this is San Francisco! I thought tortillas fell from the sky here!\n- Chicken grilled to order. Never seen that one before. Should be in a big container, stewing in some tasty juices. Makes me think the turnover isn't high enough. \n- SLLOOOWWWW.... good lord, I have never waited that long for a burrito in my entire life. Even the long lines at Anna's Taqueria in Boston move faster than that. \n\nThe actual taste of the burrito wasn't half bad but I was really thrown by the spinach tortilla.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-27", "description": "I do not understand why anyone would ever go here when El Burrito is on the same block.  Granted Ocean Taqueria is open later, the food sucks.  Seriously beware of what you order, and try not to think of how long that chicken or beef has been sitting in that pot.  My brave roommate actually got sick from the food here.  And if you bother to check their health inspection ratings, you will find that they scored a whopping 55 out of a possible 100 points.\n\nAnd to top it all off, they are sure to serve up a nice helping of attitude with every taco.", "author": "Dubs W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-28", "description": "Admitting, I only walked in this place because... \n\n1. The Cheese-steak shop down the street was packed\n2. I wanted something fast without waiting too long\n3. Most important, my phone was dying, and they had free outlets, so I could charge it while enjoying some eats!\n\nJust before 9:00pm on a Friday night, I'm in this long ass walk-in closet/hallway of a restaurant 5 mins before figuring out you have to order from the back, then work your way to the front. There's only ONE guy ahead of me!!! Yet it takes 8 mins before getting around to my order. I guess the other guy was on break or some shit because he's just chillin' by the register watching WWE wrestling with his 11yr. old.  The whole time, there's kids screaming and running throughout the place, and a woman (I guess one of the employees) keeps walking in/out every other minute like she's waiting for a ride, and leaving her kids behind...wtf??! \n\nOnce my Quesadilla gets around to being made, the muthafucker isn't even cut! Just one HUGE soft taco or something. So I give this guy the \"Problem Eyes,\" like, \"Amigo, is this a self-serve restaurant? what's up with this, it doesn't come sliced?\" Then he gives me this bullshit reaction like \"Oh, I didn't know you wanted it cut\"\n\n*SLAP right across his face in his grill, oh I wish haha\n\nSo he gives me back this sloppy ass quesadilla with shit spewing out the sides of it...ugh!\n\nI warned you", "author": "Tekk A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-31", "description": "I've had Mexican food probably ever week since I was born. \n\nOcean Taqueria is amazing. \n\nThe proportions are huge and the food is very fresh. I don't understand what all you haters are talking about because this Taqueria is really fresh and affordable. The guys making the food do a great job and you won't leave without a Spanish lesson. \n\nThis is authentic Mexican food so if you don't like real Mexican food you should go to tortilla heights down the street and have Americans cook your tacos. \n\ntry the chicken fajita burrito.\n\nps. the last time I was hear they asked if I wanted a side of tequila.", "author": "Shel Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "Do you want a 14-inch long burrito? You came to the right place. \n\nThe first time I came here, I wanted to turn around and walk back out. It seems shady with the ordering station ALL the way in the back and the handwritten (Sharpie on cardboard) menu on the wall. But my friends assured me it was legit. The food was AMAZING, the enchiladas were super and the burritos were fantastic. The fresh ingredients and meats are prepared right in front of you. They don't take credit card though, CASH ONLY. The next time I'm in the area, I'll definitely go again.", "author": "Rachele S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-19", "description": "Its good for what it is....Meats at least cooked in front of you with the tortilla sitting on the grill letting the cheese melt.  Then said ingredients come together with the requisite rice and beans (which were the low points), sour cream, guac, lettuce, and the salsa fresca and super spicy red sauce.  \nIf I was drunk the stars would have gone up to four, but for sober snacking it was middle of the road.  I feel like I should go to the original to really give this place a fair review, but that will have to wait for my next trip.\nAnd for all those calling this ghetto, you must really not have been to many ghettos; I found it quite alright.", "author": "Sheila Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "For some reason that I can't quite articulate, this is the best burrito in San Francisco! Very unique flavor.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-30", "description": "Ocean  was one of the few places to get a decent burrito on this side of town. \n\nThat is until they raised their prices about 35% per item in one fell swoop a couple of weeks back. \n\nCall me cheap, but I just can't rationalize paying 7 bucks for a mediocre burrito.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "Great little hole in the wall burrito place (esp in Pac Heights) \nI had the fajita burrito and everything was grilled right there in front of me- so you know its fresh! \nI would totally go back-just dont be scared by appearances.", "author": "Janae L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-27", "description": "I'm very disappointed in this place.  I used to eat at the Ocean Taqueria on Ocean Ave back in college all of the time.  I was delighted to find a new location by my new apartment in the West Add.. However, it seems this location has a major problem with cleanliness.  The SF Dept. of Health gave this place a 55/100 in their last inspection.  Needless to say, the third time I hit this new location, I became painfully ill just minutes after finishing.  The ill feeling stuck around for a couple of days.  :(  \n\nI haven't returned, and sadly, probably never will.  I'd still recommend their other location, but this one needs to clean up it's act.\n\nBTW here's the link for the dept. of health:\n\nhttp://www.dph.sf.ca.us/eh/Violations/Loc_CurrentViol.asp?LocationID=629", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "One of my favorite Taquerias in San Francisco. Luckily I have gotten to grow up in SF and experience a lot of different taquerias and mexican food restaurants. Ocean Taqueria is easily in my top 3 and I make it a point to always take my out of town friends here to experience a real burrito. I went to High School 3 blocks from here and it was a weekly routine to make the journey to Ocean for lunch. Whether it was the tacos or the burritos, I always left satisfied. My favorite thing on the menu is the Grilled Chicken super burrito. They grill the chicken right in front of you, guaranteeing its freshness. Their guacamole is incredible as well and if you dare, try a spicy pepper or two, they are well worth the pain!\nThe Staff is incredibly nice and while they almost only speak spanish, if you can speak some of the language they will love you for trying. They have given myself and my friends great deals over the years due to being such great customers and you can tell they really appreciate their customers. After leaving San Francisco for college and coming back 2 years later, the staff immediately remembered me and gave me a warm welcoming, chatting me up about live at school. \nOver all I love this place and while it looks like a bit of a hole in the wall, its food more than speaks for itself and my friends and I always come hungry, and leave in pure bliss.", "author": "Colin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "A nice shop to visit close by UCSF Mt Zion. Portion sizes are big. I didn't appreciate the microwaved nacho cheese (throw cheese on chips, then stuff in microwave). Otherwise, the food was good, including the fish plate that we ordered. I'd come back, though not for the nachos!", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "Outstanding fish tacos.  There are many little taquerias in this part of SF, so I can't compare one against another.  However, one of my son's college friends gave this one an endorsement, and I must echo the advice:  if you're near the park and museums and looking for a quality meal, this is your place!", "author": "Matt C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-05", "description": "Weird set up at this place. It's a long narrow restaurant where you have to walk all the way to the back to order your food. On the way, there's a few tables and shabby interior design. When you get to the ordering station, the dim lights overhead help to disguise the meager offerings of your standard Mexican fare. When I went in at lunch hour, the beans and other condiments in the steam table were down to half and judging by the crusty line of dried goop on the sides of the containers, I assumed the food had just been put away the night before and pulled out for service that day, without refilling.\n\nI continued to order a beef burrito. When the cook rolled it up, it was small. The smallest burrito I have ever had in San Francisco. I think I even had a bigger burrito at Taco Bell! When I asked for chips, the cashier said it was extra. Well fine, I'll pay 50 cents for chips. Then I asked for some hot sauce or salsa for the chips. He gave me an embarrassed look as if to say the salsa was going to cost me more too. Luckily, he caught the hint and threw in the salsa for free. \n\nThe burrito lacked flavor. Plus, I was paranoid that I'd catch something or get sick from the unappetizing ingredients. \n\nIn this town, to compete with the dozens of other taquerias you'd better cook up a nice fat burrito that's fresh and satisfies a lunch craving, not just a kid's sized burrito for a snack. And that interior is SCARY, needs some changes for sure.", "author": "Foodie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "I can not say enough good things about Ocean Taqueria!  I work close-by and it's the perfect place to go to have a relaxing lunch.  The food is always fresh and delicious and the portions are huge.  No matter what I get I always end up needing a to-go box. \n\nI usually get either a super burrito or super tacos with carnitas.  Again, always delicious!  The guys who work there are also WONDERFUL!  They are super nice and I don't even go in there all that often but they always remember me and hook me up with free extras.  The prices are very reasonable too and it's so convenient that they accept credit cards.  Yesterday I had two super tacos and a beer and it was ten bucks.  \n\nTry eating AND drinking for ten bucks anywhere else in this neighborhood...except maybe the cheese steak place....\n\nI agree that it's sort of awkward to know where the line ends the first time you go there, but it's a taqueria, look for the tortillas, walk towards them, stand behind the last person.  Ask someone if you have to, they won't bite!  It's not that hard...", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-02-07", "description": "I wasn't too impressed with this restaurant.  While it's nice that they cook your food when you order and you get to choose what you want in it, they overcooked the chicken in my chicken burrito to a point that it was crispy black going into my tortilla.  Boy was I in for a surprise when I took my first bite!  I should have ordered my cancer burrito to go, because we were never served the water that we had asked for.  Unless you like bad service and overcooked food, I'd go to El Burrito Express instead.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "Best place in the city I take a hour bus ride just to go whenever I want a burrito", "author": "Greg L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-17", "description": "Fantastic! Wish I loved closer so that I could eat here every day. Veggie friendly, good prices.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "We were walking towards my boyfriend's apartment on a Tuesday night hoping to make it to El Burrito Express before they closed but as we stepped in front of the door, they closed up the shop for the night.  Noooooooooooo!  Okay, regroup...what are we going to get now?\n\nThere's Godzilla sushi or the other burrito place that we rarely go to.  \n\nWell, the last 3 times we've gone to Godzilla for take-out they told us our 4 teka & cali rolls would take 45 mins so that's a no go (what takes them so long anyways, the restaurant wasn't even full).  Fine, we'll give that other burrito place a shot.\n\nWell let me tell you, the nachos with chili verde (hold the sour cream, please) did not disappoint.  There were plenty of goodies atop the chips and it was a pretty decent meal for the two of us.  I highly recommend them!", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "This is the burrito spot of Pacific heights..el burrito next door is good but this is the spot...definitely an authentic taqueria. Insane shrimp burrito. Trust me this is your place for a burrito fix", "author": "Christian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-22", "description": "While not as mind blowing as (what I assume is the) original Ocean Taqueria (on Ocean).  This place is still leaps and bounds above the quality of most taquerias. What I really appreciated is that they cook the meat for you fresh, with the addition of onions and peppers if you want them.  The burritos are made to order in front of you (think subway sandwich) and prepared relatively fast.\n\nThe ambiance isn't much but this area is in a void of great food so if you are here often and want some great food, check it out.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-16", "description": "Bomb-ass mexican food in lower pac hts.  I've been on a quest to find a great mexican place near my house (inner rich) since I moved.  so far this is the closest one that reaches my high mexican food standard.", "author": "Sage S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-07", "description": "Ocean Taqueria #2 you say? Well it is certainly nothing like #1. \n\nI live a couple blocks away from Ocean Ave so I eat at Ocean Taq all the time. It's pretty darn good, the carne asada is just bomb. Everything is good. And then my friend lives near Ocean Taq #2. So we ate there once. Nasty. The beans were soggy and tasted like they came from a can at Safeway. The carne asada looked old and certainly did not taste any newer than it looked. The whole burrito was just kinda sloppy and bland. If I'm in that neighborhood, I'll stick to El Burrito if I'm close by again. And if I'm not, I'll stick to my #1 burrito place, Ocean Taq #1.", "author": "Samuel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-25", "description": "I regret to say that i joined Yelp just to give this place a review.  I ate here today since El Burrito Express 2 is closed on Sundays. Ocean Taqueria is always open and no one is ever there. I should have known better.\n\nMy boyfriend and I ordered 3 tacos, which seemed to be a bother for the two employees behind the counter. As one employee handled the tacos, we watched the cashier chop shrimp, take our money, give us our change and return to the shrimp. He didn't wash his hands or remove his gloves between any of that. As he rang us up, he asked why my boyfriend didn't speak any Spanish.  Direct translation: \"Why don't you speak Spanish, boy?\".  I repeat. We were the only customers there. Poor retention tactic.\n\nI ate the sub par taco and a few stale chips out of desperation and against my better judgment.  Eight hours later, both of us feel sick. I don't know if Ocean Taqueria has anything to do with it; but I will be sure to just go home when El Burrito Express 2 isn't open.", "author": "Kira F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-02", "description": "Fast, cheap, good and down the block from my beloved Fishbowl, I can't go wrong with Ocean Taqueria. The baby burrito is the perfect amount of food for someone my size, as I can never ever finish a whole regular sized burrito. \n\nThe dining area is pretty dingy. I'd take it to go, either to the Fishbowl or just a walk around the block", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-10", "description": "Although the menu scribbled on the wall several times down the long hallway was confusing (I kept thinking there must be something different on many versions--there isn't), the super chicken taco I ended up ordering was very good.\n\nFor $3.50, a giant plate of super taco gets three stars.  It's not my favorite taqueria, but I'd happily go back.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-30", "description": "I love Ocean Tac. They're food can be delicious. The habanero hot sauce ... incredible. They cook the meats in front of you (in some cases). All good stuff really.\n\nTheir problem: Bad beans, and inconsistent.\n\nSome days, my burrito comes out HUGE (which is good news). Other days, it's a skimpy little baby burrito (despite ordering a super). The beans.. I won't even get into the beans.", "author": "Zed C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-02", "description": "When I first moved to SF, I didn't have a job and spent my days putting together Ikea furniture and searching CL for new job postings.\nDuring my carpentry breaks, I'd explore my neighborhood.  My first or second day, I came across Ocean.  \n\nGood burritos and nice staff. The baby burritos are pretty cheap, imo  I haven't been back in a while, since I actually have a life now, but I'd say it's a decent burrito for the 'hood... better than Tortilla Heights", "author": "Hannah F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-04", "description": "At my age, I really appreciated how the dudes in there were calling me \"Chica\" when it is obvious that I am a \"Senora\"\n\nAnyway, this place has pretty good burritos.  I don't care what other people say, I can deal with the set-up.  Not every burrito place has perfect Feng Shui. \n\nFour stars because you do have to wait a little longer than normal because they grill orders individually.", "author": "Sue U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-14", "description": "not impressed with my tacos in any way though my companions loved their fish burritos.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "One of my favorite Mexican places to eat. I usually get the super burrito, quesadilla, or tacos with carne asada. I like how you can see them make your order right there although it is a tight space in the back of the restaurant. You can pretty much customize your order any way you like it. I really enjoy their carne asada. Nice sear on the outside and tasty all over. It's a shame I don't live in SF anymore but when I do go to SF and have a craving for a burrito, I definitely stop by here.", "author": "Randy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-01", "description": "Good, cheap mexican food.  Had the super burrito, fully loaded, with chile verde, pretty damn good for 6 bucks.  Not dirty or grimey, just cheap and decent.  I'll go back when I'm starving and don't wanna spend a buncha coin.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "When I lived in the Presidio, this was my spot for burritos (Los Ermanos on Chestnut is just so bland...). \n\nCarne Asada is the best. They cook the meat when you order, so t's not sitting there all day drying out. \n\nI love when you're eating it and you get towards the bottom where all of the hot liquid and grease has collected from the meat, salsa and beans!! Those last 4-5 bites are the best!!!!", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-29", "description": "I've walked by this place a few times and decided to try it out.  It's hard because there are 2 other Mexican restaurants nearby so I imagine having killer fare is what keeps people coming.  I liked the layout of the restaurant when I walked in.  You have to walk all the way to the back of the restaurant and it's very narrow.  The menu is written (poorly, albeit) on a huge piece of cardboard that is taped to the wall.  The 2 men behind the counter were very nice and chatted with me while they cooked my food.  I ordered the Chile Verde burrito and was pleased with it.  Not the best burrito in SF but it's cheap, huge and quick.  I'd come back again to try their seafood and hang out with their friendly crew.", "author": "Carmel U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-27", "description": "Surprisingly good.  Went down here after El Burrito Express was so sadly closed at 10:30AM when I had burrito cravings.  \n\nI liked the fresh cooked meats in front of me - not sure why these other reviewers don't like such a thing.  I'd prefer fresh cooked chicken to chicken from a vat any day.  The carnitas were good too - they were careful to pick the chunks of fat out before shredding the meat.\n\nOverall good burritos close to home.", "author": "Rob K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-09", "description": "Pretty decent burrito if you care about your arteries and stomach and are therefore avoiding the grease party next door at el burrito express. They make it in front of you like good taqueristas should, and will try to speak Spanish to you no matter who you are. \n\nI just made up 'taqueristas'. I hope you like it. I hope you use it later, and attribute it to me.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "This place has the best vegetarian burritos within walking distance from my apartment.\n\nThey put lots of fresh vegetables on their burrito, and use an almost perfect ratio of beans, rice, lettuce, tomato, salsa, guacamole.\n\ni also love the decor - fast, clean, simple.  their ventilation system works too, so i don't leave smelling like al pastor.\n\nThe bad: portions are a bit stingy, and i wish it stayed open later.  regardless, it gets 5 stars.", "author": "Dustin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "Best burrito I've had in this part of town.  The special habanero salsa gives this place the kick that puts it over the top.  With a strip of other burrito/taco options within two blocks, this hole in the wall is a must-try.  The place is run down and easy to miss, but the food makes it worth the stop.  \n\nEverything I've had here is great, the only reason it lost a star is that the day cook has a bad attitude.  I won't eat here during the day because this guy won't listen to you and gets upset when you want your food as you ordered it.  The night cook is much better and he makes the burritos with a generous helping of meat and guac (who doesn't want that).  Don't order the habanero sauce unless you really can handle spicy, ask for a taste if you're unsure.\n\nOverall, a great place to get a burrito and beer to go.  You can eat in, but don't be surprised that the interior quality is far from that of the food.", "author": "Thomas J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-20", "description": "This review should be for the Taqueria on Ocean Ave...but since i can't find that one, i'll write it here.  There's burritos are tasty, juicy and really one of the best.  Prices are good, they have risen but not too bad.  You can get a Jumbo burrito for like 7.50 and this includes overlapping two big flour tortillas to make a GIGANTIC burrito.  The people are usually nice.  \nHere's one thing I noticed, when the owners there making your burrito, it's not as big =(.  \nI like to get the grilled items.  Like carne asada or chicken.  Ask for onions and bell peppers and they'll grill it too.  \n\nTry their strawberry fresca.", "author": "Leena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "This place has fantastic enchiladas!  There are times when I'm just craving good, quick Mexican food, and THIS, my friends, is the spot.  I was born in Mexico, studied abroad there for 2+ years, so I know good Mexican food.  This place comes really close to the real deal down yonder.\n\nIs it a hole in the wall?-- yes.  Is the menu written with marker on cardboard?-- YUP!.  This is not the place to bring a date or to even sit down to eat (though there's room for it and I've certainly done it) but the food rocks.", "author": "Sara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Subway's foot long ain't got ish on this! Ocean Taqueria is the home of the infamous 14 inch burrito! The best part of this is that you can get the 14 in half and half, so you're really getting more for your money, which is BI-WINNING! And if you're lucky enough to get it here during Cinco De Mayo, they will give you shots on top of your order which is HUGE for me! Is this the best burrito in SF? no. But is it for the people? I say HELL YES!", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-03", "description": "Tasty!!!\nI suggest getting the grilled chicked with bell peppers and onions. They grill the meat in front of you and then add the peppers and onions and something that looked like butter garlic. My burrito came out perfectly garlicky and even tastier with every bite.", "author": "stash e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-21", "description": "Wow, for being a taqueria, you should be able to make a grubbin' taco.  Not the case here.  I just had the most bland, dry, tasteless \"spicy\" taco.  It was barely edible. I would avoid.", "author": "D B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-23", "description": "Chill little place nearby Fish Bowl and other bars on Divis. The burritos and quesadillas were super good. I'd definitely check it out again next time I'm in the area.", "author": "Lou T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-29", "description": "Somebody actually said they had the best burrito in San Francisco here??? Wow, that person must be running a high fever or maybe is on some seriously heavy drugs!! There is no way this place has the best burrito in SF!! Save your money and walk down the street to El Burrito Express. This place has way better food. Sometimes all restaurants have a bad day, but in this case I don't think this taqueria has great days. I had a carne asada burrito with everything on it. It was o.k., definitely edible , but definitely not tasty or even great. The burrito was just \"eh\" and so so. The interior is shabby and beat up, so beware. It looks like it is in decline. I can't see the person who wrote that this place had the best burrito in San Francisco as any person that has their taste buds working properly. No offense Ocean Taqueria, but I am never going back here.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-09", "description": "If you know what you like this place is amazing. To be honest, I don't really remember if anything was different about the place when i first started going there but I've been going to this Ocean Taq for years and the guys there know me and hand me an incredible burrito every time. Another thing I really appreciate is how efficient they are. At lunch time they may have 20 people in line and you can get up there ordering in no time! But as always, you can call in your order for a really quick pickup.\n\nIf you're up for fun, speak Spanish to the guys there (specifically the guy working the register) and you'll be sure to have an awesome time. They crack jokes like none other!", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "Originally was an EBX devotee but they're closed on Sundays and the staff has never been super friendly to me after my efforts of trying to become a regular.  \n\nWent to Ocean Taqueria and was very impressed.  It's cool enough getting to watch them mass cook and take orders while making it look too easy.  The food is cheap and I haven't had a bad experience (or a messed up order) yet.  Only bummer is the chips and salsa aren't free but I highly doubt there expensive.  They do serve alcohol and accept credit cards which is always an unknown if you haven't yelped or anything else.  \n\nWhat's better, their Giants fans and they remember you-- or sure make it feel like they do, either of which I'll take.\n\nDefinitely worth a try if you're looking a cheap, quick bite.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-27", "description": "This place is great.  quality meats well cooked, good veggies tehy grill with it, soft torillas.  It is old school hole in the wall where you stand in line with tables to sit but the cooks are firendly and customize the orders and are quick.  Freshly grilled meat is key.", "author": "Lane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "I like this place. The food is legit. .....They make some awesome nachos and burritos. Decent beer selection and it is fairly inexpensive. You get options here at Ocean, and you can decide on the spot what you want.....So you can look at everything and just pick what looks good to you.....Service here does there job and the food comes out the way you ask for it and warm.", "author": "joe c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-19", "description": "I ordered the pollo rojo buritto, side of rice, chips and salsa.\n\nThe pollo rojo was unseasoned, the salsa watery & pretty much void of any taste.\n\nThe rice was great.\n\nI will go back when intoxicated.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-24", "description": "Oh please, this place isn't ghetto.  It's sandwiched between Godzila sushi and the Fishbowl.  People who think this shop is ghetto really need to try eating burritos in the Mission.\nIt's a bit tricky to order when it's crowded though as the layout is bizarre.  You have to walk through the dining area, way back down a narrow hallway toward the bathrooms to get in line.  But the hallway is where you scoot along, directing the guy who is loading up your burrito with the fillings of your choice.  So you have to squeeze past all these hungry burrito eaters to wait your turn to block the hallway while you shout out one second too late, \"NO RICE!  Aw, that's okay.  Sorry for yelling.\"\nThe staff is always very nice to me, and they tolerate me when I speak Spanish and then look at them blankly when they respond to me in kind.  \nHowever, they're my second choice for burritos on Divis, even if they are nicer.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-11", "description": "\"Ten thirty one, por favor.\"\n\"Huh? Oh, no - I just ordered a burrito.\"\n \"Si, ten thirty one.\"\n \"The burrito is $10.31?\"\n \"Si.\"\nI'm sorry but what????? Since when did a taqueria burrito cost $10.31? I could have gone to Whole Foods and gotten a gourmet burrito for less than that. These Ocean Taqueria Burritos must be good if they are charging that much for them. Oh, but to my surprise - the burrito was simply eh. They grilled it fresh. Nice. They gave me the wrong tortilla. Not nice. The guy making my burrito obliged me when I said I only wanted a little rice. Nice. He seemed to think I wanted only a little of everything else also because the burrito was SMALL! Not nice. The guy behind the register wasn't cooking anything but was wearing a chef's hat that had pickles wearing santa hats on it. Nice. He did not offer me complimentary chips but instead shoved a handful of peppermints in my bag. Not nice. I am polite and wish the staff a good day and walk back to work to enjoy my lunch. Good thing I wasn't very hungry because I finished the whole thing in about five bites. The burrito was seriously lacking flavor. I wanted to put salt on it but I thought that would just be so wrong. Again the grilled shrimp with peppers and onions were a nice fresh touch but they needed to have been seasoned. \n I doubt that I will be visiting Ocean Taqueria anytime soon. I'll give them two stars because I hated it less than I hated getting stung by a bee and the pickles wearing santa hats hat made me laugh. \n\nOh, and p.s. - with all the money they are charging for food, they should be able to afford a real menu board as opposed to the big piece of plywood nailed to the wall with the menu options written on it in Sharpie.", "author": "Nuvia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-07", "description": "i agree with what deepak said.\nthe guys who work here are absolute jerks.\ni was very surprised at the amount of attitude i got, considering no one else was in the joint.\n\nwent in asking if they were closed; they said no...\nordered a burrito and i asked for some salsa on the side- groaning ensued.\n\nas i was waiting i asked \"when do you close\"?\nthey were like \"every night, amigo... every night\".\n?\n\nand i said \"what time\"?\nthey say \"oh!  you want to know what TIME, do you\"?\n\ni didn't have cash, but they had a card machine- instead of ringing it up with a receipt (their printer was out of ink), they wrote one out and sarcastically told me \"thank you soooo much for your business... we'll see you tomorrow\".  \n\ni mean, wtf!?  how hard is it to either tell someone that you're closed or not give them a bunch of bulls**t?\n\ncome on people; get it together.\nif you knew how to make good food, you wouldn't make assumptions about people's character and have such a sorry attitude about life.", "author": "linden d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-02", "description": "I used to love this place until last week when I got food poisoning from their veggie nachos. It was either the cheese or the guacamole, something wasn't right. It was always a ginormous amount of food for a decent price but I won't be going back.", "author": "kristin v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-04", "description": "When you live in the area of Pacific Heighs that I do, your two closest choices for burritos are Nick's Crispy Taco's to the east or La Salsa to the west... one is garbage the other is the Carl's Jr. of Mexican food (and is owned by the same company).  I could head north and grab some \"Mexican\" food at Left at Albuquerque's but today I was craving an authentic burrito at a place without pictures adorning a shiny plastic menu.\n\nThe closest places I could find were Ocean Taqueria and El Burrito Express, not 3 doors away from each other on the same block of Divisadero.  On a side note, apparently there's an unspoken ban on authentic Mexican food between (but not including) Divisadero and Polk St.... much to my dismay.  \n\nAfter eyeballing El Burrito and Ocean, I figured Ocean was more authentic and headed in.  Hearing far more Spanish being spoken than English, I was already satisfied with its authenticity.  The menu was written with black magic marker on a plain white wall... perfect!  I ordered my burrito and was able to select my ingredients while the chef was making it (a la Freebirds).  I love places like this for two reasons:\n\n1) You make sure you get what you want\n2) As soon as you're done ordering, the burrito is ready\n\nI quickly paid for my burrito (not super cheap, but very moderately priced) and sat down to enjoy.  Here's where I'll stop blowing sunshine up the ass of this Taqueria.  The burrito was good, and I'll definitely come back for another, but not the best I've ever had.  I like a fairly healthy burrito (no sour cream, cheese, guac, etc), but I also like a lot of flavor; again, it was good, but not great.\n\nAnyway, I gave this place 4 stars, partly due to my craving of the day, partly due to the authenticity and partly due to the scarcity of such a burrito place near my house.  If there were a dozen burrito joints near my place and this was just one of them, this would get 3 stars.\n\nBottom line - I was glad I made the trip and will definitely come back.", "author": "Pete S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-17", "description": "Not digging it.  This place is so flippin' mediocre.  Never been to the location on Ocean, so maybe that one's better.  Not much else to say.  Maybe that I could get a better burrito in Wyoming, not that I've ever had a burrito in Wyoming.", "author": "Leon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-02", "description": "so I've only lived in the city about six months and I'm trying to get to as many new places to eat as I can. I was brought to the ocean taq on ocean street in my first month and had well basically the best asada burrito I've ever eaten. Fast forward another month and I found this ocean on Divis. The burrito here tasted exactly the same! \n\nThe 5 star rating here is definitely  for the food, All taquerias are crap holes on the inside and if its not then its really just a chain business owned place attempting to capture that \"south of the border charm.\" I almost never eat in them anyway. So lets get to the food. How it works has been described pretty well here.  I love that they grill the meat right in front of you. You know it hasn't been pre-cooked, boiled in a bag and shoved under a heat lamp all day. They have a huge selection of tortillas and the way you get to pick everything you want in the burrito as its being constructed is genius.  One word of caution if you get everything including the hot sauce the burrito will be very liquidy and run down your arm. I usually skip the hot sauce or have them put very little on.  The super is the burrito to get, if you get a baby and start adding items that it doesn't come with, your charged for them and might as well have gotten the super anyway. The nachos are also the best I've had, everything that goes in the burrito goes on top of the chips after the cheese gets melted on. The prices are a little spendy (for a taqueria) but I think its worth it. I shouldn't be eating burritos all the time anyway. The staff are always very friendly however if you try to go there in the hour before closing you might get greeted with a locked door or them telling you they are already closed so don't always count on a quick late night run there.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-17", "description": "i just got home from a cross country road trip over the last two weeks. In the spirit of Cinco De Mayo i thought I'd hit up some Mexican food. I've learned that in the south...the Mexican food sucks! SO, right when i got home i was on the quest for some delicious Mexican food...i found it at Ocean Taqueria!! it was the authentic, yummy goodness that i was looking for. Since it's right down the street from my house i have been there twice since i discovered it last week. It may not look too inviting from the outside (or the inside really) which is why I've probably passed it by before, but if it's good food your looking for and you don't feel like making the trek to the mission...this is the best!", "author": "Jayla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "My go to Mexican place.  The staff is friendly, always calling me \"Amigo\"  The quesadillas are the best I have ever had.  The decor is mas or minus, but who cares when you are picking up a burrito or a quesadilla.  They also have dinner plates that are good as well.  If you you are looking for a quick bite to eat in lower pacific heights, this is where you should go.  It is also very cheap.  I highly recommend it.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-27", "description": "Meh.  It's aight I guess.  If you like burritos, go next door to burrito express.  If you like tacos, go to LA. (Haha, it's just sort of a burito town, with the exception of going to the Mission.  There are a lot of great options in the Mission.)", "author": "Raman R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-04", "description": "I've been craving burritos lately for a post-workout meal, so I made my way into El Burrito Express a few doors down where I had stumbled into a lil kids birthday party.  After staring at the menu for a good minute, I was informed that they were closed.  I embarrassingly walked out, still in search of a burrito, when I came upon Ocean Taqueria (Numero Dos).  The food is prepared in front of you, towards the rear of the restaurant, with the dining area by the door.  The burrito itself was mediocre.  Prices are spot on.  I'll have to see how nearby El Burrito compares.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-18", "description": "I really wasn't feeling this taqueria. My carnitas burrito was just ok. You have to pay $2 for chips. Besides the chips it's fairly cheap and beers are only $3 but I still think there are a million better burrito joints.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-09", "description": "Apparently rich people hate burritos, because the choices in Pacific Heights are pretty damn slim (anyone for La Salsa?). When I don't feel like trekking halfway across town, I'll stick my head into Ocean Taqueria, which in my opinion is a step above El Burrito Express next door. They'll grill your meat while you wait, and the end result is a burrito that ain't half bad.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-10", "description": "The ideal taqueria: divey and inexpensive with tasty burritos. The chips are only so-so but the burritos are delish.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-17", "description": "It is what it is.  It's fast, relatively cheap, and no frills Mexican fare.  Take a walk down the long, narrow hallway and observe the cafeteria-like display of ingredients.  Open until 10 on weeknights.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-19", "description": "The Ocean is pretty good.  Not great, but definitely good, and far above average.  They grill the meat when you order, so that makes me happy.  All the ingredients did look much fresher than most of the burrito joints in this city of burrito joints.  The ambiance of the place is a little sketchy (e.g. the sharpie/particle board menu), but then again, show me a non-sketchy cheap burrito place.  I'll definitely continue to swim in the ocean.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "This is a great neighborhood place.  Yes, free chips would be nice. The tacos are really good.  Love this place.", "author": "Zaula D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-07", "description": "oh hell yes.\n\nburritos of all sizes and fillings, made with fresh ingredients. the only thing I'd change would be the consistency of the guacamole and sour cream. everything else is perfect. \n\nservice is friendly. the taqueristas (thanks shannon!) are primarily spanish-speaking, so speak clearly and point if you're not fluent. Your experience will also be more pleasant if you like reggaeton, I guess.\n\nlet me make it easy for you: super burrito, grilled chicken, refried beans, spicy (rojo) sauce", "author": "matthew r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-01", "description": "Cheap and skanky. Then again, sometimes I'm in a hurry and I'm in the mood for something like that. The burritos are filling and they are pretty tasty, although I agree with the concerns about the service and the sanitation.", "author": "p v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-14", "description": "I will start by saying that I really wanted to like this place. A friend recommended it so I thought for sure it would be good. I was wrong, very very wrong... \n\nThe service was HORRIBLE. The guys were super rude. \n\nSo you order at one end and then tell them what you want as you go down the line. They were so skimpy with everything. There was nothing \"super\" about our burritos. At the end I asked for a little more salsa on each of the 3 burritos because they hadn't put barely any on any of the burritos. The guy added the smallest amount, maybe a tablespoon to each. \n\nWhen I went to pay I noticed there was an extra $2.55 in charges and when I asked what it was for he said it was for the extra salsa on the burritos. 85 cents each! I told him the was crazy and that he didn't mention the charge when I asked for a little more salsa. He just stared at me and said \"oh well\" \n\nHow did the burritos taste? The consensus of our three burritos.... blah! Not worth your money!", "author": "Yelper S F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-27", "description": "So basically myself and six friends walked in and thought \"normal burrito joint, hopefully they're good\".  The one patron ordered and as his was being prepared by burrito kings every other one of us asked for the same. Ordering in spanish helps, though if they can understand, burrito with everything (with black beans, and I had chicken) is what you should ask for.  I'm salivating.", "author": "Walter B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-27", "description": "If you want a soggy burrito loaded with salty guacamole and other random juices in your burrito then this is your stop.  I always get a stomach ache when I eat here.  I should have a stomach of steel after eating all the dirty chinese places around here.  But for reason the cat meat and other meats rip my flab up.  They have the worst nachos.  They are worse than La Salsa if you can believe it.  Walk two doors down to Burrito Express 2.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "My burrito was a little bit bland, but they make everything fresh on-site & it's close to my house. It'd be unfair of me to hold it to the same standard I do taquerias in the Mission, & it gets props for being convenient & affordable.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-28", "description": "Way overrated.  I went here to eat after my mock endo board and this place just made my bad day worse.  The burritos here are way overrated.    If you want to go to a dirty place with sub par burritos, this is your place.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-01", "description": "The burrito is good every time. I always get the pollo asado and the chicken is always cooked to perfection. Its open later than other walk-in places in the area and its definitely better than burrito express (next door).", "author": "Jenica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-23", "description": "Fairly large selection, nachos, tostadas, and usually one or two \"traditional\" meats lengua not found in gringo hoods.  The guys who work behind the counter are friendly and patient, and I've gone out of my way to eat here lately.  Not fancy, but they've done a little work on the dining area.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "From what I remember, this was last night and a few sodas were involved, the food was good. I split a carne asada burrito. I remember the establishment being really long a skinny. They serve Budweiser and that was good also.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-06", "description": "Horrible.  The fact that this has a rating even comparable to Ricos in North Beach is a shame.  My friend took me here, said it was good, I could hardly finish my food.  We went the next day to Ricos and he agreed it was hands down a better meal.  Not even close.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-20", "description": "Hmmm, well I think they have great burritos, it's near my place, and it's cheap.  I've probably been about 10 times.  I love that the chicken is grilled right there, rather than just sittin' around in some sauce in a metal container all day.  Really, that's the \"asada\" part?  If you want the other, they have that, too.  Great hot sauces.  May be mostly the freshly grilled chicken, possibly also the fresh cilantro, but I think they make a yummy and fairly unique-tasting (difficult thing with a burrito) burrito.  The atmosphere is such that you'd best be gettin' take-out, though.", "author": "Jes H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-19", "description": "I had a dentist appointment this afternoon and my stomach was growling the entire time.  While my dentist cleaned my teeth, I deliberated whether it would be appropriate to ask him to borrow his cell phone to order a pizza.  I figured it probably would be difficult for him to scrape around my teeth as I ate a peperoni pizza so I held back and decided to wait.  After leaving the dentist with a #1 patient sticker and no cavities, I decided it was time to have a good meal to celebrate.  Remembering that Ocean Taqueria was the home of the 14 inch burrito, the choice was easy.  I ordered the spicy chicken burrito. My burrito was good.  The beans and rice were tasty and I would give Ocean Taqueria's burrito closer to a four star if the chicken was just a little spicier and tastier.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-12", "description": "Came here with my boss yesterday and was very pleased to have been introduced to a great little taqueria.  I had the baby veggie burrito and couldn't finish the whole thing so it wasn't very baby by any means.  The staff was very friendly and the food was good.  Oh, and it was cheap.  I will definitely be back.", "author": "Stella C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-03", "description": "I absolutely love this place!!  The food is great and you definitely get your moneys worth!  The guys are really friendly and always help me practice my Spanish while waiting for my food.... I talk and they correct me  =)", "author": "Kapiolani M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-31", "description": "I ate here last night, and go a few times a month. Not the best burrito spot in town, but I think this is the best one on my block. I like how they grill your chicken right there so it's nice and fresh. The dude that works there is hot too, I saw him with his shirt off once and it was nice :)", "author": "meagan m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "Great salsa selection, the 'Lada Gaga' (as in GaGaGarlic) will literally melt your face. Their burritos are large, cheap and made with quality ingredients. They also have great agua frescas.", "author": "Dre D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-20", "description": "Best taqueria in town! And the best bang for your buck!!! If they cleaned it up a bit it would be a 5 for sure!", "author": "JA R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-12", "description": "This place blows! Okay, I know that serving vegetarians is not a taqueria owner's wet dream, but the guy making our food seemed so insulted by my boyfriend and I ordering veggie burritos that he practically spit in the food.  I wanted a baby burrito and my man ordered a giant burrito but they were the same size.  Beyond the service, these were the worst burritos I have ever had, including week old guacamole.  They were little sloppy packets of sadness.", "author": "Tonya W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-01", "description": "The only reason there is a star is because or the way they cook their meat on the grill. It's pretty good. Not spectacular. The service here is the WORST. Very rude. Almost as if they don't want anyone to come in?? Kind of weird. It was next to Burrito Express and unfortunately they are not open as late.", "author": "CITY M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-13", "description": "These guys have the best burritios in the city.  That's not the reason I'm writing this.  I was in there Tues. Mar. 13 and saw this smokin' hot girl.  I didn't get her name, but we had a little conversation.  If you decided to look me up, baby, here I am!  I don't try this type of stuff very often.", "author": "peter k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-06", "description": "I absolutely love this place. It's run down in terms of the eating area. It is not a good place to go for a date or anything, and get your food to go.... but the food is amazing. They do not skimp out on the food. They pile the tacos and burritos up with tons of food and it's all for a GREAT price. I would definitely recommend this place.", "author": "nina a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-14", "description": "This place is the super fire.  Great carnitas that they put on the grill so its nice and hot which alot of places dont do.  Decent salsa not the best which is why its  four star.  Great workers they are hilarious and offer tequilla to you.  Atmosphere is like straight out of TJ except I think they are from Guatemala or somewhere not Mexico.  Overall good solid Mexican fare.", "author": "christian l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "i enjoy the burritos and the staff here. i always go for the baby burrito because it's the perfect \"snack\" size before i head to work. i like the options of getting green, red or regular chicken. i haven't tried their other meats, but i enjoy their boiled chicken in green sauce. the staff always talks to me in spanish which constantly reminds me that i should brush up on the language. anyway, the burrito is solid. i'm not looking for anything extraordinary or gourmet when i'm chowing down on a little donkey. prices are reasonable and i always come back. i still favor gordo's over this place... but when in pac heights, this is the stand by.", "author": "Erin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-11", "description": "are people really ragging on the interior of this place? it's a freaking taqueria!!! if you want a colorful ambiance and more tables to dine at go to taco bell down the street. i've only been here once and they have the best veggie nachos i have ever had! minus two stars for it being so damn expensive.", "author": "Lizzy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-21", "description": "i hate to write bad reviews but i really wasn't diggin this spot. its no suprise that its usually empty. just go down the block to burrito express.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-29", "description": "This place has the best super burritos! (Everything else looks great too, but I've never been able to not order a super burrito.) I love that they grill the chicken right in front of you when you order and throw bell peppers and onions onto the grill too if you'd like. I'll give it that the decor is not the best, but for a $7 super burrito, what do you expect?", "author": "KK R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-16", "description": "Good quesadillas but the service is terrible. If they mess up your order dont expect them to correct it. Though the food is ok the experience isnt recommended. I would say avoid the place and head to Tortilla Heights.", "author": "Morgan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-16", "description": "i like ocean if i'm in the mood for a semi-grungy burrito. it's all about the super, veggie or not. i do love creamy burritos, especially when the guacamole and the cream are evenly distributed right alongside those refried monsters. so that's why i enjoy this little dive.", "author": "Faye P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-26", "description": "Man this place is not put together well, but the burritos are the best in the city! Don't let the long wait, usually 10 plus minutes, disscourage you cause it is usually worth it!", "author": "QuestionmarkFace S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-06", "description": "i stumbled upon this place a number of years ago after walking around my new neighborhood and still today, 6 years later is still my favorite place in SF for a burrito.", "author": "james b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-23", "description": "love it! been going here for years.  For the area it has the best baby burrittos at the right price.  Its not fancy, heck the menu is on a plywood, but I go in there thinking 'i just need a good burritto' and i've never been disappointed.", "author": "S B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "I've always had very good burritos here. They grill your meat when you order...and they throw the tortilla on so that it gets nice and crispy. Salsa is tasty. The chips and guac are okay...nothing special. As other reviewers mentioned...the place doesn't have the greatest ambiance but I think its worth it for the fresh burritos.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-15", "description": "The food here is soooo good! I have never had better mexican food! The people are very friendly. and very big portions for the price you pay.", "author": "Max H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-15", "description": "this place is good. i've never had a burrito here just some of the plates. they were very good. i was skeptical because of the decor and the hand written menu on the wall but i was happy with my food. plus considering the other mexican place on the block is so incredibly bland, you really dont have too many other options in the neighborhood.", "author": "A G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "i've spent a long time, years probably, pondering what/where the best burrito is.  hands down, the best is at ocean.  i can honestly say that this is the yummiest burrito i've ever tasted.  i crave it like candy.  it's made to order, fresh, delicious, and huge.  the marinade they put on their grilled chicken is amazing.  the staff is awesome too, they always say \"see you manana?\" and they usually will.", "author": "alexis w."}
