{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Great little bar! Really good atmosphere and super laid back. They have old movies playing that were filmed in San Francisco, which was interesting. \n\nI'm really only writing this review to tell you I met the best bartender I've ever seen, and I've been around. It was just fun watching her work and engage with the customers. Go see Darian (Dee), and you will never want to leave.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-11", "description": "My boyfriend and I found this place while we were on vacation in San Francisco. We found the place on Yelp, and saw some good reviews it had so we decided to check it out, hoping they were playing the basketball game. They were playing it, so we found some seats at the bar to order our drinks. The first red flag we experienced here was the bartender. I went to the bathroom while my boyfriend ordered drinks. Immediately she told him \"Just make sure you close out by 9, because that's when my shift is over. I'm heading to a new job after this and I'm gonna make bank, but want to make sure I get my tips you know?\" Mind you, it was like, barely 8:15 at this time, and as customers, we didn't feel like that was an appropriate thing for her to be saying to us. We decided then that we would only order 1 drink from her.\n\nThere was a decent amount of people there, for the small space that the bar offers, and of the group of people, there was a 7-8 person group of guys that were very clearly Golden State fans, and had obviously spent a solid amount of time, and money, at this place. When the game was over, and the Warriors won, the particular group was ready to close out their tabs and move on to other places to celebrate. One guy in particular approached the bar to close out, and the bartender made a comment like, \"Oh how'd you get to have only a $20 tab, you made all your friends pay for everything?\" You could tell the guy was irritated by that. Fast forward about 10 minutes and he returned to the bar stating that she gave him the wrong debit card, to which the bartender then discovered that she had given his card to someone else, that had already left long before the game was over, and vis versa. The guy was pretty calm about it, considering a stranger now had his debit card, but definitely wanted an explanation and a solution. The bartender had ZERO customer service skills as she tried to tell him that \"It happens all the time\", \"You can cancel your card and get a new one for free\" and \"there's no need to get mad about it.\" He continued to explain that he just wanted to celebrate with friends, but now his only means of money was gone. She offered him a free shot, of which he did not get to choose, another guy came out to back up the bartender. They bartenders/employees basically told the guy to the \"get the F*** over it\" and by the end of it, the guy left not receiving any apology or real severance for the bar LOSING his debit card.\n\nWhen the group left, the male worker that jumped into the situation towards the end, was speaking with another male customer he must have already known, saying things about being ready to \"throw down\" with the guy and \"fight him if I need to.\" All around just very unprofessional people at this place.\n\nI'm not from the area, so I won't be returning here regardless, but if I was I would absolutely not go here again due to the customer service alone. The way they handled this situation was so poor - especially for people that work off tips.\n\nProceed with caution.", "author": "Nichole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Nice little neighborhood bar. Never too crowded and they have really cool weird movies playing. The bartenders are attentive. \n\nUsed to live in the hood and this was one of my go-to places. A good mix of locals and tourists, but mostly locals.", "author": "Zita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Owl Tree is a cute little bar on the corner of Post and Taylor. They have a full bar, two TV screens, about a dozen bar stools around the bar, couple of booths, and a long couch seat in the corner. The bartender was super nice and friendly. Happy hour was very reasonable, $5 draft. Location was great, great selection of drinks, watch any sport you like, and the ambience was nice. If I'm ever in town, I would definitely go back!", "author": "Tinah Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "Came here on October 8th a little before midnight. Bartender was too busy texting on her phone to service the bar. Won't be back.", "author": "Macay K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Took the GF to Owl Tree last night.  Service was spot on. The bartender was Dariana. When I told Dariana that I used to work at Owl Tree in the 1990s  she flowed us the first drink.  Thanks a lot Dariana- we'll be back soon!! \n G-d I hope I'm spelling your name right :/", "author": "Adam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Awesome little spot! Very small, and definitely more lounge than dive. Staff is polite, the decor is spot on and they even decorated for the holidays. \n\nPrices are similar to those of bars it's style, but cheap, but not outrageously expensive. This bar will absolutely become a staple location in my SF adventures. I would absolutely recommend this quaint little spot for anyone in the area or passing through! \n\nTip- if you are one of those people who bring your own canteen for water around, this place WILL fill it up for you (as long as you're a customer). I noticed that in some places in sf, they refused to fill up my water bottle and I was even kicked out of one location--NOT owl tree. They are awesome.", "author": "Nina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Great hot spot and the fine ass security guy on Monday and Tuesday made our visit all the more better. Always nice to be greeted with a smile when entering a business.", "author": "Tracey T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "I've been a customer here for years but will not be spending another penny here as long as the ID checker at the door last night remains employed there. \n\nI can't remember the last time a bouncer was so rude to customers of a business. There's no excuse for this; I'll spend my money elsewhere.", "author": "Ted T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "On Thanksgiving 1982, I was broke & hungry with nowhere to go.  The owner, Bobby, was a friend of my pal David.  Nevertheless, Bobby welcomed me with open arms, and upstairs waiting for me was a huge, homecooked buffet spread of goodness that was fit for a King!  Plus, I was once offered $50 if I let some guy who was sitting next to me at the bar blow me, but that's another story ....", "author": "Cary G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "As soon as we got here the bouncer told us the place could be close early than usual and he was waiting for the Bartender call to close. We arrived at 11 place supposed to close at 2am. The Asian Lady Bartender I don't know her name never introduced herself, greeting us or nothing like service standards looks like, was on her phone 90% of the time. Like she doesn't know she was working in a bar with guests. \nHorrible customer service. Never back again to this place.", "author": "Sabrina W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "Stopped by for a drink or two and it was fairly empty which isn't a bad thing around 5pm. The bartender was friendly and I sat drinking scotch. This dive bar is pretty small but worth checking out.", "author": "Ezell W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "I love this bar. They play hip hop from the 90's and it a true bar. No reservations needed you just walk in, order a drink and sit down or hover around. \nI hate bars that are so fancy or kick you out unless you order another one of their fancy cocktails or limit your group size. I just want to grab a drink!! Is that so hard? \nThis place is first come first serve. No table service and strong big pours that are reasonably priced. What more could you want from a bar? No need to dress up but come here is you want a strong drink, great music, no bs, and great atmosphere. No cover but be nice to the security outside who checks your id. Also tip your bartenders here as places like these are slowly dying out. Please help keep places like the owl tree in business. This is a great place to have a drink or two or more with friends. We need more places like this in SF!", "author": "Jen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Owl Tree is a good neighborhood bar in the Tender-Nob of the city. Not to mention the bartender Zoey had girl scout cookies for her guests. Asked for a special drink and she was more than willing to try and make it. I have also been here when \"Sexy\" Liam and Shae are working and never had a bad time. I would recommend during HH or when the above mentioned are working.\n\nPrices have gone up and no more High Life and I think that has scared some of the locals away from what I have heard.\n\nWhen in SF, be sure to drop in for a Hoot!!", "author": "Joshua H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "I've come here for Ashley, Lacie, Haley, Zoe, Jonathon, Carlos, and Liam in the past. This is a bar that is awesome when the right people are in place. I remember listening to very well curated play lists filled with ridiculous song a long hits from the 80s, and having stupid fun with come really awesome people.\n\nThe number of bathrooms is awesome, and I usually go for the lesser used upstairs bathroom. They've got a pretty solid back bar, and some solid classics for cocktails.", "author": "Zachary T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Lovely neighborhood bar. Great cocktails, reasonable prices and free popcorn! Couldn't think of a better place to relax with friends in their comfortable booths and good vibes.", "author": "Erika H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "There is an age ole tale \nWhich is very hard to tell\nThe raves and the reviews of this place are endless\nThe people who work here are careless\nThe lady behind the counter, had no acknowledgement for guests. \nMade us wait and wait did we after reading the raves and reviews\nThe lady continued to serve others\nAnd wait did we for our fancy drinks \nThe lady looked at us, and excited were we get our drinks. \nInstead she waved and called us as we were some mongrel waiting for thy bone\nAnswered her call only to find out that she forgot what we ordered\nWalked away as we met her gaze and told her to treat her customers fair. \nWednesday was the cursed day, the lady doth not know what she is doing. \nI am off to another place, where I have more value for the drink. \n\nPeace!", "author": "Milana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "My sister and I stumbled in and out of bars all around for a couple hours until we landed on \"the one\". We had a blast sitting at the bar. It's an awesome location and great atmosphere. We landed us new friends from Belgium and Australia! The bartender was great. He was helpful and was friendly to put up with us cooks at the end of the bar. \n\nTheir specialty cocktails are cheap!! The quality was amazing with rich spices. I must've had at least 4 out of the 10 available. Still need to try the others!", "author": "Justin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "A favorite downtown-ish afterwork spot, mostly because of the location and the staff, especially Zoe.  A nice mix of people -- locals and visitors. It's very small and can get pretty crowded quickly -- but I'm usually out of there pretty early. \n\nTaking off a star for the recent price hike.  I get that drink prices are up all over town, but they're starting to push it a bit.", "author": "Tony V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Really friendly doorman and staff.  Drink menu is good. The interior has a weird feel , like a cruise ship. Dirty bathroom.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-30", "description": "Perplexed by the rave Mai Tai reviews, all mine tasted was of pineapple juice and some rum...\n\nSeating wise is tight and not best for large parties \n\nPrice points are fair which helps to manage expectations\n\nOverall Thoughts\n\nWould come back for beers but not sure about their cocktails", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-08", "description": "I would give them a negative star if I could and I am typically very generous. But what happened at this institution is abhorrent. One of my girl friends who has been a regular patron year was sexually assaulted by another patron right at the bar. When she cried out for help, the bartender looked away and pretended to not notice. While she called the cops, the bartender helped close the assailant's card and even fist bumped him! What kind of an establishment is this? I get that bars can't control the behaviour of scum bags that walk in, but looking away encourages that kind of attitude and attracts more low lives. Needless to say there was a camera that recorded this offence and justice will be served! \nLadies, avoid this establishment at all costs!", "author": "Trisha H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-21", "description": "I just visited this bar last night 4/20/17 for the first time. My experience was great inside. However the security for no reason at all was such a smart A**. Said rude comments that did not need to be said. He was an Asian security guard. I am my group of 7 people didn't want to stay because of that. But we thought of giving the bar a shot. We did and we liked the bar inside. However the security guard was out of line. I was the one who approached him and I did not come with any attitude or being negative. He was simply out of line. Won't go there again. Anyway owl tree I would take a look at that. \n\nCO", "author": "Cesar O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "Horrible service !!! Asian girl behind the counter just stared and refused to say hello or help us brown chick behind the bar also didn't acknowledge us. Every time we tried to go up to the bar and order they were \"out\" of 1-2 ingredients needed for our drinks , we then tried to order a cognac ... they were also \"out\" we finally concluded that these people don't want our business and they can care less if this establishment builds a horrible customer service rep. Well I'm letting all my southern calif. friends to AVOID THIS PLACE at all costs. Considering that the customer service industry is struggling and they're in a city with much competition they should take their business more seriously.  DONT waste your time or money here !!!", "author": "Isabel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Ever feel the need to burrow on in to a cozy, dark, intimate spot and knock back a few beverages? Owl Tree might be your spot. \n\nIt took me many visits over many years to figure out what exactly is going on here. You can tell this place used to be a dive bar simply by the setup. It's tiny inside, but has been gussied up with nice, dark wood, comfy-enough seats, a cool bar, and decent liquor selection. The cocktails on the menu don't reach up to craft-cocktail level, but they're adequately nicer than what you'd find in a dive. And the bartenders are friendly and familiar enough to give you that solid neighborhood bar feel. Which is a good thing. It's a lot more simple and straightforward than I gave it credit for. \n\nThe more I stop in, the more I enjoy this spot. No pretense, no bullshit, no fake-y hipster dive scene (which means less obnoxious people)... So there's an absence of things to dislike. And what's to like? My drinks taste good, the booze is relatively inexpensive for the quality and the locale. It's not cheap, strong well swill, but I prefer not to drink that shit anyway. I can get mid-shelf here and not pay exorbitant prices for it. I like. \n\nRecently met a friend here for a pre-dinner cocktail and it did not disappoint. Bartenders engaged in friendly banter. Felt like a version of Cheers where nobody really knows my name but it doesn't matter because people are cool. If only Woody Harrelson were there. \n\nI guess you can't have it all.", "author": "Don B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "I came here last night (Wednesday) with my cousins. And from the moment I walked in: I was in love. I wasn't quite sure how the drinks would rank in comparison to this stunning space. \n\nIt's very dim and dark, yet very cozy and has a classic feel, very timeless. The photos posted on YELP don't do any justice. Go see it in person: it's a stunner. The crowd was more of my preference: no loud obnoxious people, and no wannabe hipsters, and rowdy college kids. We were the youngest crowd there, but we didn't feel out of place. There was another younger crowd who were slightly obnoxious just a tad for a moment, but you don't even notice with the setup. It wasn't overwhelmingly crowded, it's a small space and the areas filled up, but nothing crowded.. super loungy: makes you want to be here for awhile. I could imagine writers and other creative folk from the past going to a place like this just to unwind. \n\nWe were confined in our own cozy nook at the end where we enjoyed the drinks we ordered with some perfectly complimentary popcorn (mix of mostly stale but some crunchy ones which paired well with the drinks, some of the popcorn had a spicy aftertaste that was a delightful surprise.)\n\nI had my first mule ever and it was great although it wasn't your typical moscow mule. I loved how the drink 'My Mule' was one where you could customize it, so I got it with whiskey. I asked my cousin on his opinion since he's had mules before and he said it was right on. And my pineapple mojitio was great as well. The Mai Tai here is pretty strong though: not my cup of tea. The shot of whiskey was lovely, but I learned I don't like plain whisky unless it's cinnamon whiskey. My cousins got drafts and shots (combo) as well and they seemed to enjoy it. All our drinks were made by this one bartender and she did a fantastic job.\n\nI felt like the drinks were reasonably priced. \n\nAnd the best part: they had 80s-90s music on and.. the playlist was just perfect.", "author": "Lilian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Small place, really cute. Drinks are stroooong! Had blood orange margarita and pineapple mojito, both really good. Then we tried Mai Tai's and they were so strong we had to ask the bartender to top it off with more juice. Can't complain about drinks being too strong though!", "author": "Shondra M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-20", "description": "TL;DR - Mayhaps better back in its hey-day, but Saturday night was a miss for me.\n\nCrowded and dark and dirty. Saturday night and there was only ONE bartender and one waitstaff. \n\nThere is such a weird mix of patrons here.... unfortunately, we were sitting next to a rowdy couple who ruined any ambience that Owl Tree had to offer. \n\nThe drinks could use some work and maybe a clearer... direction of the lounge? Weird old movie playing on the TV and the seats were sticky.... More of a pub feel than a lounge feel. Yeah.", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-28", "description": "This had been favorite for a long time. The bartenders were great, the regulars were fun, and then I took a break and dried up for a month. Now I'm back and... No Lacey, no DeeDee, no Amanda, no Liam, and none of the regulars. The bar backs are gone, drinks take longer and are, no reflection on the bartender since it's a time issue, less friendly. Gonna hafta relocate, I suppose.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Very fun easy bar! Loved the atmosphere and the drinks were great! We got there around 7-7:30 on a Saturday and it was very laid back and quickly found a place at that the bar! The bartender was very friendly and quick to assist us and answer questions. Around 8 it got very busy and crowded. Overall it was a great place to get a drink and hangout.", "author": "CarolAnn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "Drinks were good, but they were pretty weak. Bartender wasn't the friendliest person or really talkative at all. Cool atmosphere and vibe though.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Love the way it looks outside, definitely makes you want to take a peak inside. Music was great and vibe is very relaxed and welcoming.", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-21", "description": "Extremely Bad service!!!!! Douche bag bartender was very rude and yelled at me for not having cash. Credit card machine was down but didn't mention that till after the drinks were served. \n\nI come here several times a month with my company and always stay around the corner at the Clift. Never again am I coming here and telling all my coworkers and clients never to come here as well. \n\nLeft with 2 rounds of free drinks though. Thanks!!!", "author": "Everett M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "What a cool little bar in the TenderNob. Been meaning to hang out in this neighborhood more and stumbled upon this place with friends. I'd say this place is a mix of locals and out-of-towners, and as such a lot of the local attitude you'd find at places in the Mission or NoPA doesn't exist here. People want to have a good time and as a result it's a great place to meet people. The interior is a slight notch up from your usual dive bar and service is quick. Hipsters and the uber young may not be attracted to this place and that right there is reason to come hang out if you've outgrown that phase in your life, or just want a change for a night.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "Super cute place to grab a quick drink. It is a little smaller than expected and ideal for a group of 4 or less. The decor is a little old school but still quaint and charming! Great place to grab a drink while you wait for your table at Ryoko's.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "My family and I had a great night at Owl Tree while in San Fran for the night. We were able to get a table and ordered from the bar. We ordered a variety of beers and cocktails over the course of a few hours, and I really enjoyed all of my drinks (I had The Greyhound- which was very refreshing and not overly sweet).\n\nMy only complaint would be that the service was a bit slow for a weekend evening, as there was only one bartender for the entire bar. The bar back/bus boy also would make drinks for a handful of people, but not for others, which I found odd.\n\nThe Owl Tree is a bit of a dive and definitely not \"my scene\", but we stayed until last call and I really enjoyed my drinks.", "author": "Morgan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Went to Owl Tree recently, gotta say it was awesome for the location. Staff were welcoming and attentive when ordering drinks. Overall nice place to engage in conversations, while still having that lively environment!", "author": "Keith Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-01", "description": "Came here on Christmas day after meeting a couple at Lefty's....they tipped the bartender, Liam to make his day. We piled on top as well.\n\nLeft my jacket...called from the cab and they confirmed they had it. Called many times afterwards to get it and kept getting the run around....tried sending people to get it and they claimed the manager had it locked up.\n\nJust spoke to Lacy the manager who claims it is no longer there and gave me crap for waiting a month. I didn't wait a month, I could never get anyone to say they had it after Liam...\n\nSuper pissed, don't go to this place...", "author": "Mike R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "We are visiting from out of town , and found this gem... Liam is an awesome bartender and has an great personality. Will definitely stop by again next time we are in SF...", "author": "Sherry B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Great place.  A great \"craft drink dive bar\"... yes, I coined that phrase and Owl Street is the stand out.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-02", "description": "Horrendous female bartender, bad attitude with anyone under 45. Okay drinks, but don't make up for the atmosphere", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "Looking for a place to watch the game or waiting for a table at a nearby restaurant? Owl Tree is the place to go. From beer to cocktails, they've got it all and they do it well. We ordered the Moscow Mules when we stopped in and got to watch the Warriors game with the crowds. Service is quick, it's not overcrowded and they give you popcorn with your order (huge bonus cause I was starving).\n\nOverall, if you want to watch a sports game at a classic American Bar,  Owl Tree is it!", "author": "Aletta B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "Very cool and casual neighborhood bar with a lot of character and well crafted cocktails. If I lived in the area it would be a regular hangout spot.", "author": "Barry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "This is a cozy little bar with a dive bar feel. There are only a few little booths and high tops, or you can sit at the bar. The beer selection was pretty good and relatively cheap. During happy hour, in particular, prices are excellent for the location.\n\nI stopped by after work on a Tuesday with an old friend and had a great time! I was surprised to find a bar like this in the area but was very pleased. When I arrived around 6pm the bar seating was nearly full but there was an open booth just waiting for us. The bar started getting busier shortly afterward. \n\nPs. Fun fact, they don't sell food so allowed us to bring in a pizza.", "author": "Helen G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-10", "description": "This place is the best option for drinks in this area on a Monday our Tuesday night.\n\nBartender was cool and quick. Full bar and plenty of draft beer.", "author": "Brendon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "I love my friends when they show me cool places in the city. I love them more when they cool places have happy hour. (Yes, my love for my friends depend on happy hour deals...)\n\nOwl Tree is awesome in a couple of different ways:\n- Located close to Union Square aka it's not in a sketchy area\n- Happy hour from 4pm-6pm\n- Happy hour deals: $4 draft beers and $5 well drinks \n- $10 Jameson shot with a beer\n- Cheese, salami, and crackers... for free! \n- Has a TV if you want to watch games after work\n- Awesome (friendly, attentive, and fun to chat with) bartenders\n\nOwl be back!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "I have a friend that has lived in San Francisco for 14 years, and THIS is the first bar he ever visited here. This is a lowkey bar to share all your secrets with friends, bring a date, or just enjoy one of the many incredibly strong & delicious drinks on your own. \n\nThe first one I tried was the Blood Orange Margarita ($10) because how do you see that on a menu and NOT be curious to try such a tasty sounding beverage? And tasty it was. My other favorite is the Effen Vodka Cucumber Gimlet ($9) which is super simple but strong. The Fresh Tito's Greyhound ($10) and Mango Mojito ($9) weren't my favorite, but that's just because I like to taste the alcohol in my drinks. \n\nIt's almost amazing how many different types of seating they managed to cram into such a small bar, but it's cozy and I like it. Owl Tree, you have definitely made a regular out of me. I'll be back!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Two Words: Mai Tai's.\nThe Best! I literally sit at home thinking of how tasty this drink. No one has come close to making this wonderful concoction like Owl Tree does. Throw in an awesome bartender, Zoe, and you got yourself an amazingly chill night. \nSo what have we learned? Go see Zoe and request the all powerful Mai Tai!\nOh.... And their bathroom is super clean. Who doesn't love a clean bathroom?!", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "Lame. Ordered a drink at 140 am before last call and when the bar ostensibly closes at 2. The bouncer came in a minute after we ordered, told everyone they had 2 minutes to finish or he would take their drinks. He forced everyone out at 1:48, making us abandon the drinks we paid for. Reinforced the general atmosphere of scumminess I felt when I entered.", "author": "G C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "I love this place. It's dark and cozy, great cocktails, good vibe. I will definitely go back. \n\nI was with a group of 5 people and we had dinner at La Colonial and popped in here for after dinner drinks. We sat in the back booth, the staff was attentive, the bathroom was clean, good decor, good music, fun classy crowd. My only mini complaint is that it was hot and stuffy, the air flow was lacking, but it was a warm day and it's an old building. I will go back for sure!!!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Above-average find in the area between Union Square and Nob Hill. While it might look like a dive bar from the outside, the interior feels just classy enough to avoid the divey feeling, yet the prices are quite reasonable (particularly at happy hour) and the selection of drinks and cocktails quite decent. Depending on the time of day, the crowd here can vary widely, from people grabbing drinks after work to visitors staying at nearby hotels and a wide cross-section of locals. A nice atmosphere all around.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Very cool corner bar spot. We had one more round before hitting the theater. Popped in, very friendly bartender, made our drinks and had a great experience.\n\nSeemed very clean, not super loud, decent prices, and clean bathroom... Not much more to ask for.\n\nThere is a jukebox, atm, and tv's.", "author": "Drew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Cool place to hang.  Small but comfortable and dim but inviting. The interior and decor gives a very nice classy atmosphere for a night out with a few friends or on a date, and their drink/cocktail selection make things even better, not to mention friendly and professional staffs who are attentive. Well done. See you all next time!", "author": "HW Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "I have to start out with the fact that this place has a special place in my heart. I always come here and I always have a fantastic time. The drinks are average price, but they also have some drink specials. My favorite is the shot of Jameson and a beer combo. How can you say no to that?\n\nThe bartenders and customers are all really friendly, welcoming, and just plain awesome! The first time I came here this woman was having a Birthday (sash and all) and she bought a roll of shots for everyone around her. It was awesome! Those are the kind of people that come in here and thats what makes me keep coming back.\n\nIt is a great neighborhood bar that has great atmosphere and vibes. I love this place! And it doesn't hurt that they give out free cheese, salami, and crackers too!", "author": "Theo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "*swoon*\n\nThis is my go-to dive when in this part of town.  It is on the edge of Union Square and the \"Loin\", so you don't get a crowd from either region.  Rather it is very eclectic, maybe from the neighboring hotels, or service industry peeps.  But it seems everyone here knew of its confines.  Not many random hit-ups.\n\nI seem to have missed the original incarnation of owl memorabilia strewn about, but what we have now still revels in true dive form.  Dark, soft lighting.  Awesome music, mostly from the 80's.  When Prince's \"Controversy\" comes on, that is an open invitation to plop my rear in one their \"coffee table\" spots, and definitely have a few.  They have Four Roses Bourbon, son!\n\nAnd they had one of the \"Dirty Harry\" flicks on loop, so you can reminisce on what SF looked like back in the day...when China Basin didn't have the ball park, nor the high rise condos.  Pure dive bar entertainment.", "author": "D.wight L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-15", "description": "I do not recommend this bar!  I was in there with a group of friends and everything seemed great.  I went to the bar to get a drink and a man the age of at least 65 grabbed my butt.  I pushed him off of me and told him that was inappropriate. The bouncer clearly saw this occur bc he walked up and told the man \"you have to leave\".  I assumed this was under control. I then noticed that the man was allowed to stay in the bar.  I told the bouncer that he should have kicked that man out and his response was \"i know, but...\"\n\nMy friend and i saw the man was the. Outside and allowed to reenter the bar bc according to the bouncer \"he had to go to the bathroom\".\n\nIn my opinion this behavior is inappropriate and unacceptable.", "author": "Aly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-27", "description": "That place is very dark cozy and full of rambunctious intoxicated tourists and locals fresh from their cubicles it was noisy crowded and two yuppie couples got into a spat over a dog near the door so I slammed down my house wine and left I would go there again because it's down the street from the Commonwealth club which I am a member. I visited there a few months ago and just got around to remembering to review them today. \n\nConsidering what she had to work with the lady bartender was very pleasant.", "author": "SF T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Had a couple Jameson myles during happy hour on a Friday night. Bartender was on it while we were switching seats to make room for smaller parties. The space is adequate for the area and actually debated about coming back after we checked out but was a little late. Good selection on drinks and the atmosphere was perfect after a long week to whined down. Quick, easy and definitely stopping by next time I am in the area!", "author": "Alina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "The bouncer was the best! So friendly and the staff is super funny. \n\nThe music selection was (dare I say) LIT. 80's and RnB classics. AMAZING. \n\nDrinks are decently priced. And it's very clean and warm inside.", "author": "D T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "As far as dives are concerned, this one feels far less \"divey\" than most. When I'm in this area of San Francisco, I usually expect any bar slapped with the \"dive\" label to be some sort of dilapidated homage to a formerly great establishment, complete with a bar lined with characters you couldn't make up if you tried. \n\nNot that that's a bad thing. But Owl Tree surprised me - pleasantly - in a different way. The dark wood interior and comfortable booths were homey and a welcome escape from the cold night air. The bartender, while stone-faced and serious, was attentive and quick to offer a refill. And the patrons were mostly young folks like me who all seemed to be there just to try something new.  \n\nDon't get me wrong. This is still a dive. The low prices, relatively cheap drinks and scattered bowls of party mix say as much. But it's a dive with a special vibe, and for that reason I'll be returning on a future SF visit.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "First night is San Fran... must hit up this bar! The drinks were good, bartenders were fast & friendly! My drink wasn't \"weak\"... which was nice for once. Worth every penny. Nice place if you just wanna sit down and chill.", "author": "Jordyn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Super chill bar. Small but a good pit stop for a drink or two.", "author": "Diego C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "A great little dive bar to visit after shopping in Union Square. The drinks are inexpensive and strong. If you are drinking a Jameson's and Ginger you don't want them weak. On this Saturday Santa Con was occurring and there were quite a few Santa's getting there drink on. Who was the Santa Claus in the sequin hot pants?\n\nWe were also waiting for the 6:00 pm opening of Ryoko to eat some Sushi. Dark woods and mirrors, no juke box or pool tables, just a drinking establishment with special drinks...Greyhounds anyone. Forget it...go for the whiskey and bourbon drinks\nMy female friends were impressed by the bar tenders and bouncers. \n\nI'm glad we were able to grab a seat because it was crowded...", "author": "Jim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Amazing, kind of hole-in-the-wall bar. The bartenders were amazing, made conversation and made the drinks decently strong. Would honestly suggest to anyone looking for a \"quieter\" place to get a drink or 2.", "author": "Bree M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-20", "description": "Brought some friends here that were in town for a conference, and whose hotel was walking distance.\n\nIt was a Thursday night and we couldn't find much room to stand or a table for us to sit.  We tried to stand near the door area, but that was apparently a fire hazard according to the guy at the door, so we just awkwardly stood further in next to a table.\n\nAfter about 15-20mins a table became vacant, and we were able to sit comfortably and talk together.  About 30mins later we decided to leave as our group grew by about 3 more people and apparently we were causing a fire hazard by too many of us being right at the doorway again.\n\nI do not think the place is too great for larger groups, but smaller ones; i.e. 3-4, would work out fine.  If I go back, it'll definitely not be with so many people.  I'll probably have a better experience here that way.", "author": "Pia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "It was Sunday night and my buddy and I walked by Owl Tree and sneaked a peek. \"That's my kinda bar\" he says, and I reply \"me too!\". Apparently, dim bars with senior patrons are something I did not know we both have an affinity for. It's a good think we took a minute to drink. My friend recommended Four Roses whiskey and I think I might have found my new go-to. My previous go to is Powers (yeah, I'm classy) and I had that right after to do a sip and compare. So, I walked out of Owl Tree much more experienced and having gained a valuable life experience.", "author": "Nate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Came in for happy hour before I had to catch a flight. It's a bit off the beaten path, so if you don't necessarily know where you're going, you may end up lost (or in a less savory part of town). The interior is very chill -- the dim lighting invites you to relax. And with $3 beer on their happy hour menu, and a free cheese and salami plate with crackers, I wasn't going to complain.\n\nBoyfriend and I snagged a private little corner booth and sat back, sipping our beers and listening to the 50s music they were playing. I also got several little plates of the cheese, salami and crackers because I was hungry and no one stopped me.\n\nThe bartenders weren't pushy, didn't give off the feeling that we needed to buy more than our one beer apiece in order to feel welcome. Just let us enjoy ourselves and cleaned away our glasses unobtrusively when we were done. Very relaxed. I would come back with some more friends to hang out for a drink or two!", "author": "Anna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "I love dive bars.  Especially dive bars with happy hour, personable bartenders, sports on two flat screen TVs and delicious specialty cocktails to wet your whistle.  And I have to love a place with the word \"owl\" in the name of course.  Stopped by on a whim while waiting for some friends, had some of the \"pub mix\" (which I'm pretty sure is the Cheez It party mix with pretzels etc in it) but nonetheless free with our drinks.  Took advantage of the happy hour and also tried the blood orange margarita (yum!).  Worth stopping by and checking out!", "author": "Reena P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "Stop by for happy hour tuesdays with some chex mix and meats & cheese.  \n\n...I'm sure that's what most people need to know about this place. Otherwise, it's a cool little bar I tend to frequent when waiting for some sushi at Sakana next door. It's a mixed bag when it comes to bartenders. The guys are always nice - ok, yeah maybe it's because I am a girl, but the female bartender we see every once in a while doesn't give us the time of day, as though we won't tip just as good as the guys you need to chat up. Either way, it doesn't really matter to me. Make my drink and I'm all good.", "author": "Leina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "Fun bar with great music.  Drinks are fresh.  Good HH.  The bartenders are informative with local knowledge.  It's a good time.  Old school bar with little frills.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "Very cool.  Very mellow.  Very old school.  Suits and ties enjoying Happy Hour.  Exposed brick walls, cool lighting, good drinks.  It was a nice surprise for me.  SF is full of surprises!  Can't wait to check this place out again.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "Fun music, good wines and great drinks. Nice atmosphere and friendly bartenders. Definitely a place to stay all night and come back to again and again.", "author": "Paula R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "Great little bar with no stress or wannabe superstars and good mix of tunes!! Happy bar staff, cocktails at $11 , plays sport ...", "author": "Brett H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-27", "description": "Rip off joint. We will never go again. We go in sometimes before we head to A.C.T.( we have season tickets) but this evening was our final time. Sour faced Asian female came on & prices went up, plus she gave us the wrong drink. Don't worry, we will never be back, plenty of other places nearby.\nShe blamed the hike on not being happy hour anymore, however we were never charged that much on our previous visits. I think, once she heard an accent, ( I have one), she decided we were dumb tourists & wanted to rip us off. Travelers, beware. Unless you like being ripped off.", "author": "Margaret D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "\"Unexpected find\" is a great way to describe Owl Tree. What will likely happen is a friend will drag you here. Upon looking at it from the outside, you will say \"Not another Tenderloin dive bar.\" You will hope there is not sawdust on the floor, which was quirky the first time and gross upon further reflection. \n\nInstead you shall find a surprisingly classy interior with good seating, reasonable prices and sturdy drinks. A friend gave me her Manhattan, it was a Manhattan. How anyone can taste anything besides the whiskey is beyond me, but people \"in the know\" said it was a good one. I ordered a Moscow Mule (delicious) and a margarita. The margarita was, of course, for a less manly friend than me. But if I did drink that margarita, I would say it was fruity and boozy without being overwhelming in sweetness or alcohol. \n\nOverall, a good find and somewhere I would certainly take a date I don't want to spend too much money on.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "This is a nice, unexpected find, somewhat off the beaten path in the Union Square area. We came in on a Sunday evening, and found it to be not very crowded, and welcoming. Our bartender was friendly and made our drinks promptly.\n\nAs I get older, I find myself being more drawn to bars that are less noisy, more comfortable, and intimate. The Owl Tree offers just this atmosphere. I would come back.", "author": "Sonia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "I really like this place for its atmosphere. It's nice bit not too nice, the staff were great and it was just small enough to feel cozy without being cramped. I like this place on slow nights to have a relaxing drink or to take a casual date to.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "Great little bar to catch a drink and listen to some older hit songs. Try the pineapple mojito", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "We needed a place to kill some time on a Friday evening and decided to check this place out. What a find! Beautiful 'old-San Francisco' ambiance, clean, well stocked with premium liquors and very friendly bartenders. Zoe was so much fun and her counterpart (I didn't get his name) makes THE BEST Manhattan we have ever had. They even use the brandied cherries as opposed to those horrible marichinos. First class cocktail for a very reasonable price. The freshly popped pop corn bar snack was a great touch. I look forward to coming back soon!", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "My friend and I were visiting San Francisco and staying pretty close to this place. We decided to stop in one evening for some drinks after a long day of walking and sightseeing.\n\nMy first impression was that \"dive bar\" isn't really an accurate description. I kind of expected the place to be more run down, but it's actually pretty cool inside. I guess the classification comes from the cheap drinks offered.\n\nWe had a few different beers. The bartender was really friendly and talkative which is always a plus. They had a few TVs which were showing a movie (it was completely random in a bar) and the music was mostly 90s (not necessarily a bad thing).\n\nWhile it was pretty laid back when we were there, we did pass the bar a few nights later on a Friday and it looked packed. Definitely seems like a popular spot.", "author": "Brandon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Great service! The bartenders are very attentive and make great tasting drinks! They have all kinda of house drinks. This bar is very chill, great place to have a nice conversation. They play great music and the decoration is very nice! Owls everywhere! :p", "author": "Soraya F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-24", "description": "Went there late night after dinner, it wasn't crowded. \n\nThis place is like your small around the corner bar. The bar tender and the service is also good. If you happen to be in that area and need a late nite drink , visit them.", "author": "A. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "I liked this bar . It has a really nice feel to it. Moe is a nice bouncer and the bartender was really nice. She didn't ask me to tip her unlike a lot of other Bars, so she was given a tip. I'll come back again for sure since my favorite restaurant is right across the street.  It is a bar that isn't trying to be something that it isn't. A lot of bars try and put up a fake front but not Owl Tree I respected what they brought to the table a nice simple atmosphere.", "author": "Kyle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Nice bar! Small and cozy...drinks are not overpriced and the bartender is sweet.", "author": "Munazzar T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "A great spot to grab a drink before dinner. There's nothing really special about the drinks there but the crowd always seems friendly and not your typical Polk street or Marina kinda of crowd. Don't order mixed drinks here. Be safe and stick with the ordinary beer and wine if you don't want to pay 12 dollars for a surprised gin and tonic", "author": "Alui L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-12", "description": "After flirting with a guy through text for a while, he suggested we meet up. He gave me two choices, both of which I had never been to, so I told him to choose his favorite. He chose Owl Tree. \n\nLooking it up on Yelp, it seemed like a great place to grab a drink and it's a really decent neighborhood to be in. After showing up and noticing the great owl decor (which some of my friends would love), I enjoyed a great Blood Orange Margarita, possibly several of them. \n\nCute location and decor, great drinks.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "nice (dark) cozy little bar... 2 Jamison on tap, 1 patron silver, 1 blue moon - happy hour - oh i was happy! i was so happy that i forgot to try their complimentary cheese & salami & crackers! boooo\n\nI'd definitely go back again if i am in town and around the hood.", "author": "Bonnie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Stopped at the Owl Tree to meet some people for drinks. The place isn't big and was crowded, but still very customer friendly. I got ID'd going in which is great because I just turned 30. Bartender was really nice and met some interesting patrons while inside. Definitely a throwback place to the old days with a lounge type feel to it.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Why won't that owl stop looking at me. Seriously I pass this place nearly every day and its always there. Staring at me. Always. \n\nBesides the scary owl the Owl Tree is actually a great after work or industry night type place to check out. Be forewarned you should only go here if you are looking for an intimate time with friends or a stranger at the bar. This place is tiny! Seriously there might be living rooms out there that are bigger than this but sometimes that all you want when getting a drink. \n\nInside it actually really upscale and trendy. There is a bar immediately when you enter and to the left are tables and chairs and a vip type reservation area. We were able to get a party of 10 people at one of the tables but that takes some advanced scouting. \n\nThere is a reason most of the reviews for this place are so short and that's because there really isn't much to it. Decent drinks and cocktails, limited seating but its about the people you are here with not about the location and as a bar it does a great job of actually being a bar. Just watch out for that damn owl.\n\nPro Tip: There is another damn owl across the street from owl tree just look up when you exit. They are everywhere.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "Owl Tree is usually our second stop from Bourbon and Branch...\n\nwe love the decent prices.. we love the vibe..and it's just awesome!\n\nTheir security guy looks like a gorgeous version of Kanye West. no joke.\n\nThere are only so much seats at the tables...but you can always befriend the couple who seem to be on their very first date to scoot in a seat ---NO JOKE.. that's seriously what I did... And i was right! they were on their first date! amazeballs.\n\nGood vibe bar!!!! Keep those Fireballs coming...and Patron...", "author": "Monica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Excellent clean dive bar. Booth and stools, exposed brick, looks classic. The service and happy hour. Always great music playing, whether it's classic rock or rap. Also, get a bowl of their spicy popcorn.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "Cozy and nice seating but once it got busy it was very difficult to get a drink. We left and brought our money elsewhere.", "author": "Bethany B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "A quaint little bar off of Union Square with cozy little nooks for good conversation over happy hour. Yes that's Owl Tree. \n\nYou can't miss the owl mosaic out front as you walk up Taylor street. That should be a sign for you to hang a left and pay the friendly bartenders here a visit. Happy hours end at 7pm which feature $3 beers and $4 wells. They also have a spread of sliced meats, cheeses, and crackers during HH. How thoughtful and hospitable right? I'm always comfortable at the bar but my favorite spot is the corner nook where you can have your own intimate space with your friends. \n\nI like the Owl Tree for the laid back vibe that is perfect for happy hour. If you find yourself wondering off Union Square looking for a libation, feel free to stop in.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "Happened in here as it was one of the few bars open at 4pm. The bartender was friendly, and she made kick ass drinks. Was a well spent hour at the bar.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "The service at this place is great.  What an awesome little gem in the middle of San Francisco urban chaos.  There's nothing amazing about the selection, but it's cozy, the people are friendly, and it seems like a local hangout, which makes everything seem so much more legit.\n\nFull bar plus a few beers on tap.  The clincher is the pint plus shot special.   A beer with a shot of Jameson was basically keeping my co-worker alive during the last week we were working in SF, and at ten bucks, that's a steal you won't find anywhere else in the bay area.\n\nDefinitely will be back.", "author": "Benjamin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "Happy hour at owl tree 4-7pm.\n\nI came here cause I was looking for a happy hour place at 6:30. Lucky me! $3 drafts, $4 wells, and $1 off drinks. Alright, standard right? Not! Not only was I served right away by this beautiful friendly bartender who greeted me promptly with her happy hour specials even at 6:50pm, they upped the smile on my face with a bowl of party mix and had two trays of cheese, crackers, and sliced meats. Plus, the games are on :) NICE!\n\nIt's a great way to kick back and have some beers, listened to good old school jams and munch on snacks before dinner. Definitely coming back for happy hour again!", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "We stopped in for a drink here on a Sunday night before heading to dinner in Chinatown. It was a block from our hotel and I found it on Yelp. After my boyfriend read that they make blood orange margaritas he was fixated on making a pit stop here. So off to Owl Tree we went!\n\nThe blood orange margarita was everything we expected and more. Very delicious and not too sweet. I went for a standard gin and tonic and had no complaints.\n\nThis bar has a very intimate neighborhood feeling. I'd say partly because it is very small and partly due to the decor. This atmosphere was quickly shattered when we left the bar and remembered we weren't in the best of areas. But you can't exactly hold that against Owl Tree.", "author": "Audrey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "We stopped in here whilst waiting for our table at Ryoko because it's just up the road. \n\nWe managed to get a booth just on the inside of the door and ordered two Blue Moon's at the bar.\n\nThe bartender wasn't that friendly, but the service was efficient and the beer was cheap (compared to UK standards at least!)\n\nSeems quite chilled out in there (which is a pleasant change for 9pm on a Friday) and would probably go again - especially when waiting for a coveted table at Ryoko.", "author": "Hannah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "Well, I just spent a half an hour watching Youtube videos about all the different kinds of gimlets out there, and it was inspired by my trip to Owl Tree. Any place that sparks your imagination or curiosity like this just has to be worth a visit, right?\n\nWhat's to say? As a non-drinker I've got low demands of bars. Be comfy. Be kind. Be cool. And Owl Tree delivered on all of those fronts. We nabbed a corner and sat down all together in our group. Not a feat that would be so easy on a busy evening, but on this weeknight it was perfectly achievable and allowed us to enjoy our evening.\n\nThe gimlets. Well, they seem to be the drink of choice. Cucumber gimlet, to be precise. Baby kangaroos are called joeys, baby goats are called kids. Even though baby owls are called owlets, I'd like to submit that we all start calling them gimlets. It's just cuter. And more refreshing.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "All around pleaser. They use Bulleit for whiskey drinks and don't short customers. Fair among many SF bars. \n\nTry it out!", "author": "Braxton C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "Atmosphere is awesome. Drink was weak. Very weak. Jamison and ginger ale. Difficult time tasting the Jameson and most bars I have to request extra ginger ale. At 8 dollars a pop I expect better.", "author": "Laura O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-13", "description": "I used to love coming here with my bf. The cute little sassy girl who always recognized us and treated us like family isn't there anymore and has been replaced by a Russian guy. He's not as friendly and barely acts like we exist when we go there - so we have found another neighborhood stop off place. We walk by every night after work and now won't stop in unless someone else is bartending - which seems to be never. Sorry, but there are just too many bars around the area where we are treated like the bartender is happy to see us.\n\nI do miss your Chex Mix and salami platter :)", "author": "Noneya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "Been here about every time I've been in San Francisco and it always a great lively place for a late night drink.", "author": "Fritz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "I like this place.  Its a perfect spot to wait if you're in line at Ryokos.  The drinks are cheap, and there is a decent cocktail menu, even if they arent the best in town.\n\nClass interior and they always have some great 90s songs going whenever I'm there.  Oh and snacks, they also have great snacks.  \n\nIts a little gem in the rough in those parts, and I approve.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "Cool corner bar that was next to a good sushi restaurant Sakana.  Great vibe, feel good bar and nearby our hotel.   Drinks were mixed well and reasonably priced.  Bartender was friendly, courteous and attentive with our drinks.  I'm a fan and next time we're in town we'll be back.", "author": "Eddie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "Love that this place is so down to earth and chill. It's a perfect place to go to when you need a break from shopping. The free cheese, salami, and crackers doesn't hurt either!", "author": "Giao L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "nice spot! wandered in here while waiting for an appointed down at the apple store. Friendly service, not too crowded, not too loud, and they were playing a Cardinal's game which made this guy from St. Louis happy. would definitely pop back in if I'm ever in the area.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "Owls make good gimlets. \n\nSkip everything on the cocktail menu, but the gimlet. That's some good cucumbery shit, right there. Everything else is super sugary sweet. \n\nIt's dark and sexy and not too snobby. A plus. The upstairs room we had reserved (but lacked a bartender for the evening) would've been an additional star, I'm sure of it. Who picked up the trail of thirsty drunks? Noelle. \n\nNoelle is quite possibly the most enchanting, sweet and productive bartender I've seen in the country. Whoever hired her and keeps her happy as an Owl Tree employee should be rewarded. She's a gem. \n\nI got pretty drunk, ending in a gimlet that commanded attention. That's all.", "author": "Colleen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-09", "description": "For me, it was like meeting with a long lost friend and discoverying she's had a Heidi Montag-style makeover -- over the top and cheesy.  Just before we left San Francisco, we had tried to stop by one of our favorite dive bars in the city.  It was closed. Fast forward three years, and we learned that the owner had died, the owls donated to a library (??) and now it's all glammed up, pumping music and attracting a douche-y B&T crowd, courtesy of the son. Perhaps I'm being harsh and should accept change as it comes, but I remain nostalgic. \n\nAt least they've kept the snacks. Somewhere, the soul of the owl is hovering.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-11", "description": "I don't always pick the best thing off of the menu, but when I do, I'm going to broadcast it to the world via Yelp.\n\nTwo words: Mango Mojito. \n\nI'd definitely come back for Happy Hour and the complimentary endless cheese n' crackers and pastrami. Although it was loud in our particular corner, I'm going to attribute it to the fervor of a giants game happening a few miles away.\n\nAlso, I'm determined to find out where the back stairs lead. I got distracted by the platter of aforementioned cheese n' crackers and pastrami.", "author": "Furai X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "Casual corner bar with a fair draft beer selection and good cocktails. Kinda dark, not fancy or uppity but also definitely not a dive. Honestly, it's that simple- if you are just looking for a chill but not old or boring bar, this place hits the mark. Not too big but there are tables. Cocktails are strong- we had dark and stormy, lychee pineapple martini, mango mojito and blood orange margarita through course of evening. Mango mojito was the best.", "author": "Farheen Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-04", "description": "Grand reopening TODAY at 5pm!\n\nupdate\n\nI am so happy to see the Owl Tree reopened! finally  I watched the Owl Tree transform every day (I live down the street) .  First, they gutted the place then they did outside plumbing, then they put new walls, floor, sealing, light fixtures and tiles on the outside wall....  They kept their original bar counter.  I think they did really good job with the new decor.  I really like their wide dark wood panels on the wall, nice square sealing treatment with chandelierish lighting and outside owl tile work.  (I posted pictures)\n\nOnly thing is they lost their \"dive bar\" feel.  The price for the drinks went up (See the pictures of drink menu I posted).  They lost cozy dark owl's nest feel...They put all the owl collection in a glass case near the stairs... Good thing is they have better wine selections including my favorite J Pinot Noir.  They suppose to start to serve appetizer such as salamis and cold plates soon.\n\nThe new owner Rick Howard and George Karas who also own Harry's Bar and Bruno's dropped \"C Bobby's\" and now the bar is called \"Owl Tree\".   I really like the new owners.\n\nFYI They are opening up their upstairs very soon.", "author": "Chie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-05", "description": "Funky and very cool!  My new watering hole!\n\nI stopped here for a drink before having sushi next door at Sakana.  Owl Tree is a random bar without the random crowd.  I ordered the Ketel One Grayhound.  Dee-lish.  I'm definitely coming back for happy hour!", "author": "Eddie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-15", "description": "Awesome small bar in the city.  The bar has darker lightening and big leather booths that were really comfy.  We stopped in for happy hour and the drink prices were decent.  The bar was pretty busy for the NBA Finals game, but the service was attentive for our large group.  They offered free cheese and crackers during happy hour, which was a nice snack.  I will surely be back next time I am in town.", "author": "Katrina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-23", "description": "Small, dark, upscale dive bar. Cool enough environment. Giving it 3 stars because I absolutely HATE when you order a whiskey coke and the give you expensive whiskey instead of giving the cheap well stuff, or asking at the very least!", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "I live close to the Owl Tree so it's handy to go there for a drink. I generally get good drinks. A few times they have been terrible but I haven't seen those bar tenders since. I do have to give it full stars though for the awesome people who work there.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "Very cozy dive joint in the TL.  Drink prices are what you'd expect for SF, but they have a list of some pretty tasty tailored cocktails.  Full bar, and a few brews on tap.  I love the diversity here, and the bartenders were all pretty nice.  Definitely don't have to dress to impress, so come here if you are looking for more of a low key, laid back night.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "The wife and I had a drink here before our meal at Fleur de Lys.   They make a pretty solid Hendrick's Gin Martini.   My wife went with the Woodford Reserve Manhattan.    It's a smallish bar but it's got lots of character and the bartender was very good.   They had an assortment of cheeses and salami to munch on during Happy Hour.    All in all a nice place to get a drink.   As others have said, it's also nice that it's not packed.", "author": "David O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-05", "description": "5 August..... waiting outsid at 410 pm.....the bar was supposed to open at 4.00 pm........  the door was still  locked..... the barman was behind the bar.... looked at me then carried on doing what he was doing. Went down the road for a drink.", "author": "Marvin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "Every once in while during my travels I come across a place I love so much that I would want to pack it up and take it home with me so I can become a regular there. The Owl Tree joins that list for me. It's cozy with exposed brick walls and dim lighting and the bartenders are very nice eye-candy. So were some of the patrons the night I was there come to think of it. They have a great jukebox, just enough cocktails on their menu to keep it interesting, and a nice mixture of regulars and newcomers, high class and lowbrow people to make it fun.\n\nIt is a little pricy for me, but most things are when I'm visiting this city because of my comparison and they don't serve food. But, they do serve snack mix and have no qualms about you bringing food in if you're starving and waiting to meet up with your friends for dinner.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-16", "description": "Sexy bar, reasons cited below:\nBlood orange margaritas.\nPurse hooks (such a convenience).\nHot, hot jams.\nBartender with accent.\nComplimentary bowl of snacks.\n\nSee...sexy.", "author": "Katie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-24", "description": "Came upon this place by accident really. We were going to check out another bar around the corner, but they wouldn't let us in because my boyfriend wasn't \"up to dress code\" (which is BS, they let in another guy before us who was dressed in pretty much the same outfit...if you're going to have a dress code, you need to enforce it for everyone!).  We decided to try this bar since it was right there, and it was definitely a good choice!\n\nWe got there a little before 10 on a Friday night and it was already starting to get crowded.  We had to wait a bit for a place to sit and enjoy our drinks.  The downside to this bar is that it is pretty tiny (I think the capacity sign said like 70 people or something) so if you aren't sitting down, you definitely have people knocking into you trying to get from the entrance to the back of the bar, and it gets HOT if you aren't sitting near the door or a window.  This place has some nice \"mood lighting\" going on, and the music was audible but not too loud.  \n\nThe bartender is awesome!  My friend wasn't sure what she wanted, so she asked him to surprise her with a drink that had Baileys in it, lemme tell you she was NOT disappointed.  I ended up getting one for myself later!  I have to give him credit for being so quick as he is the only bartender it seems and still have the drinks turn out great, nice and strong and not watered down!  Fun place to grab a drink and start a night out in the city, will definitely be back at this place in the future!", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "I'm a firm believer that everything happens for a reason. And I truly believe that my colleagues and I were meant to find Owl Tree!\n\nRewind back to Monday night. Wandering the Mission, looking for a cool bar (but not too cool or pretentious) that might serve food. Our initial destination was closed for a private party (and I'm sort of glad about this, as we went there another night and it wasn't so great), so we were just taking stock of the joints in the neighborhood. \n\nAfter coming to the conclusion that most divey bars in this neck of the woods don't serve food, we settled on Owl Tree. The sign outside looked promising and I like owls. Almost got a owl tattoo on my bum around Halloween time. I took this as a sign.\n\nSo glad we stopped in! Fell in love with the cocktail menu right away. Who could resist a blood orange margarita? FYI- blood orange is the new bacon. They also serve bubbly by the glass as well as Blue Moon on tap. The bartender even allowed me to bring in a spider roll from next door! Now you're speaking my language...\n\nThe best part about Owl Tree was the jams! Amazing tunage for sure. We definitely heard \"Shots\", \"Meet Me at the Hotel\" and quite possibly some Rhianna. Having too much fun to Shazam every song that came on. I was a little sad to leave to grab dinner, but it was time to go. Let someone else discover this little gem! \n\nI heart you, Owl Tree! Hope that we stumble upon each other again soon. If it's meant to be, of course!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "I've stayed at the Hotel Monaco across the street so many times that they greet me by name in the elevator. I'm not sure why it took me so long to find the Owl Tree, but better late than never!\n\nA friendly bartender, impressive drink list (I can hear their blood orange margarita calling my name even in Chicago), and uhmazing music (thanks to the juke box).\n\nNow that I've discovered it I have a feeling the folks at Owl Tree may start greeting me by name too!", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-07", "description": "From the outside, you're not sure what you're gonna get.  Step inside and its a little posh & classy...not much, just enough.  Staff is super friendly...they even laughed when I apologized for my european friends who weren't tipping.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Cool atmosphere. Cold drinks, good pricing. It got a little douchy when a group of \"hot shot\" lawyer, wall street, type guys came in. But other than that, the crowd was pretty cool.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-12", "description": "They have Jameson on tap. \n\nWe went for exactly that reason- they have whiskey, on tap. How cool is that? It does taste a bit different too. It seemed a bit more up front than Jameson from a bottle, maybe a bit fresher and younger. \n\nAnd I can say that I did taste a difference because despite always asking for Jameson, neat, from the tap, we were always served with Jameson from the bottle. Finally, one time we called the bartender out on it, and said that we came for and ordered the Jameson on tap, could we have some of that please. It took all of a quarter of a second longer. \n\nIts a cool bar inside- lots of dark wood, comfortable seating. Plenty of people around, and an odd selection of music playing, but not loud or crowded to the point where you couldn't sit around a table and make easy conversation all night over round after round of Jameson. \n\nMy issue came when I went to close my tab. They way overcharged us. By about 40%. Of course, your chances of disputing a tab at a crowded bar at 1:30 on a Saturday night are nonexistant. So we just paid, and I won't be coming back again, despite the cool setting, and the awesome Jameson tap.", "author": "Preston P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "Feeling kinda lazy so here goes:\nDark, small, don't stand in between tables and bar area if there are no seats because it is awkward, cozy booths, good cocktails. Done.", "author": "Raul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-07", "description": "A friend of mine told me about this place and how great it was, he was not wrong.  The ambiance at the bar is pretty mellow, well for happy hour anyway.  It supposedly gets a little rowdy later in the night.\n\nThe service was fantastic and the bartender working there, when I went, was on top of everything.  She was able to get drink orders, make drinks, and get these drinks to everyone extremely quickly.  Also, they had free snacks for each table that they kept re-filling, which was really nice.  I can't remember what their happy hour prices were, but they were a good deal.  I would definitely go to this place if I was in the neighborhood.", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Loved this bar. Had some arvo beers after a day out. The bar staff were great and really friendly. We got some tips for other good bars and breakfast spots. Worth a visit.", "author": "Trevor A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "This is an interesting little bar; I was very surprised to see that they have Jameson on tap! I've never seen such a thing! \n\n The bartenders were all very friendly; the crowd varied a little from night to night but all-in-all it seemed like a pretty awesome \"regular\" bar to hang out at.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "*********************** 673 **************************\n\n          Happy Hour 4-7 PM, sweet! Came here before hitting my FAV spot Sons & Daughters again. Owl Tree is way off Union Square tourist trap, the place is simply cool! Decor in dark Mahogany wood, really red carpet, I feel like a celeb!!! Black leather booths offer a classy, yet hip with all the owls!! \n\n         Owl Tree bar is a a few rare bars in San Francisco offer 7 days a week HAPPY HOUR! $3 draft beers, $4 well cocktails and $1 off all beers, wines and cocktails. FREE cheese and crackers, also love their mixed snacks! \n\n          A perfect place to swing by for a cocktail or 2 or 3 after work, wait I don't have a job, OK so come by when they open! Manhattan martini, Dirty martini or Lychee martini will do me any time of day! They offer sparkling by the glass too, not bad!\n\n        Cool spot, unpretentious, and good cocktails!", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "Try margarita\nMade of orange vampire blood\nListen to the owl", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "For a week, I'd been walking past this place while staying at Hotel Monaco on Geary/Taylor, saying: \"That place looks like a dump. Who'd ever want to drink there?\" Well, I should know better than to judge a book by it's cover in San Francisco, as I couldn't have been more wrong about this place.\n\nOn the outside, there's this smarmy looking mosaic owl that greets you. Perhaps because I walked by in the morning hours and it was crawling with undesirables begging for change right outside the front door, I formed the opinion that it was a total poop hole. But upon scoping the TL for a place to cap off the night, a friend and I decided to head inside and give it a shot.\n\nIt reminds me of the awkward, semi-attractive girl from high school. You'd see her every day, think she was interesting... but because she wore bright, baggy clothes, you never thought twice about how she looked naked. Then somewhere down the line, you run into her at the local coffee shop wearing nothing but a pair of Reebok workout pants and a sports bra... and you realize that she's a total babe with delicious curves and an onion booty to match. That's Owl Tree. \n\nThe inside of the bar is totally chic. Dark colors, exposed bricks, fancy bar stools, an upscale crowd, and more! I'd have never guessed this was how the inside looked based on the exterior of the building.\n\nThe specialty drinks were a bit on the pricey side and they were slightly above-average for my tastes. After trying one gin gimlet, I stuck with beer, which was fine by me.\n\nIf you get a chance, check out the 2nd floor. It's private and it'd make for a GREAT birthday spot. Holds up to 50 and has it's own bar. w00t!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-14", "description": "I like the low key vibe of this place that's surprisingly nice for the TL (since it's been remodeled) and the novelty of having Jameson on tap. There's a good selection of beers and liquor, a very nice private room upstairs that opens at 9pm. There's no reservation fee for the whole upstairs room but $1000 bar minimum; just reserve some tables if you're starting after 9. You can also reserve tables downstairs if you call ahead - I prefer the booth in the back.\n\nHappy Hour 4-7pm features $1 off everything and snacks (cheese, crackers, dried meats)!", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Stopped in for a quick drink with friends at this tiny spot.  We sat at a tiny booth, enjoyed a delicious cocktail, and the atmosphere, then headed back to the hotel.  The bartender was quick, friendly, and the ambiance was very cool.  Great way to cap off the night.", "author": "Kris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Love the San Fran movies and the fun eclectic crowd. Only 2nd time at the Owl Tree and the bartender Ashley remembered me and said that she was happy to see me again....love the fun 'home town' feel!!!", "author": "Kimi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "Came on a Saturday night expecting a bustling crowd. Sad that was not the case.\n\nThis is a small two-story bar. The 2nd floor was nice with their big windows along the walls and lounge chairs across the floor. There are bars on both floors, which is convenient.\nThe cranberry vodkas and martinis were strong, but who's complaining? Could only handle 1 though. Total was ~$25. Blame it on the martini!", "author": "Candice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-03", "description": "I love this place! Its right down the street from my apartment and is becoming my new regular meetup w the girls. Plus they have Marc West Pinot which is pretty good :-) \n\nI love the little booths, and the corner couches, it's dark and the music is always good. Really fun bar, one of my favorite stops to get the night going or for cocktails after work.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-07", "description": "Where my hooters at?!\n\nIf I'm going to be rolling in a place called Owl Tree, I'd expect to be saturated in the most intense owl motif experience of my life. Besides the glass case tucked away by the back staircase and the glass booth partitions, there is no other bird presence in the bar. Why so shy? Show me hooting hooters!\n\nSome may consider the decor classy. I consider it false advertising.", "author": "Suany W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-04", "description": "DO NOT GO HERE! Especially if you don't have Cali ID. \n\nCame in this place to have a drink with a friend while visiting from NV, and I was DENIED because the very rude bartender said he couldn't tell if my ID was real!! SERIOUSLY! I've been drinking all over this city with my REAL ID that shows that I'm clearly over 21. He just bent it like it wasn't real and asked for another form of ID, and then just told me he can refuse service to anyone. This guy and one other man spent several minutes looking under a black light and doing who knows what trying to read my REAL ID. These guys clearly have no idea how to check IDs, and I wouldn't be surprised if this place was crawling with underage drinkers. My friends ID was from Washington state, still turned vertical, and was practically expired. I'm thinking the ID may not have been the only reason I was denied service... Oh well. The drinks were over priced anyways. It was dark, and not inviting. Just.. Don't even waste your time here.", "author": "Mariah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-07", "description": "Picturesque of a Gentleman's hideout.\n\nIt's small but comfortable for a night cap.  I say this because I went here with 3 guy friends and we squished in a booth around 12  midnight for exactly that. It was very calming.\n\nPersonally, I wouldn't  hang out here but If I was a man post break-up this would be far less pathetic then the actual \"NITECAP\" on O' Farrell. \n\n I'm not even sure  if that is a just comparison.", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Love, love, love. My friends love coming here, and now so do I! It's a small space, but it's got that classic 50's style sultry dark lounge look while staying modern and clean. No dirty floors or dirty old men. Happy hour is great- they serve salami, cheese, and crackers, and they've got a few big open booths/seating areas where a large group can get together. Prices are very fair for in the city :) It's a small space, so you'll get cozy at the busier hours and I've met lots of new friendly people. Not a dancing lounge, but a great get together and catch up lounge. A perfect place to meet after work or launch you evening out!", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "I went there on Thanksgiving evening and the place was full.  Anjela, the bartender, is cute, fun , and makes excellent drinks would definitely recommend this place for a drink after a long day.", "author": "George B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "This is a late post. I came here a few months ago. We wanted to go to a chill place to have a few drinks. We didn't want to hear fist pumping music. It's more like a dive bar. The drinks were on point. Price was just right. The reason why Im giving it 4 stars is because it only has one restroom. :( There was only one bartender but he managed to handle the crowd extremely well. I will be coming back. Oh.. and a must try the \"Blood Orange Margarita\" DELICIOUS!!", "author": "Marlene G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-19", "description": "Came last night and I dig the music and service. The only thing I don't like is the crowd. But the bartender and bar back was so nice and very attentive. I didn't drink but they were on top of my friends refills. I liked the overall experience of this place.", "author": "Abbie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "Nice cheap and strong drinks. Very good atmosphere, can be hard to get a place to sit, but later on during the evening its not that bad", "author": "Ida R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Happy hour with $3.00 drafts and 4$ wells! Good deal! \n\nA very casual and cozy setting- a great place to just sit and chit chat with friends. \nDefinitely up to come back here again for happy hour!", "author": "Eileen Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "This place was fun!  I visited San Fran for the weekend and went to dinner down the road.  I was actually drawn to this place because of the fun neon sign out front and I'm kinda digging owls these days. \n\nHad a few drinks ... the Blackberry Martini was awesome.  The bartender was great ... I would go there again in a heartbeat!", "author": "Stacy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "We stopped here after dinner because it looked fun. This place is so cute! The bartender was so incredibly friendly and sweet! The music was great and the ambience is fun! It seems like it would be a great place to grab drinks after work! If you are staying near Union Square or live in SF, check this fun bar out!", "author": "emily w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "I love this bar for after work. It always has free snacks and great service. No pretentiousness. And always a fair price for a great cocktail. I especially like Mondays for a fernet and a high life for $7 if your in the biz.", "author": "Jake E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-28", "description": "So I hear this place used to look like the love child of an owl enthusiast and a hoarder.\n\nToday - it's stayin' quite classy. Typical dimly lit, pleather, dark red velvet, mirrors and brass kinda joint.\n\nThe drinks are good. I dig that they have pub mix.\n\nSweet spot to lay low and grab a beer.\n\nOH and they ONLY play movies on the TVs that are based in SF. I thought that was all adorable. :)", "author": "Pamela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "This is one of my favorites in the new 'hood.\n\nI've heard it was much more divey before the remodel, but I never saw it then. Now, it's hip, but not too hip. Divey, but not too divey. It's also got friendly staff and free munchies. Can't complain about that. It is a bit on the pricey side ($18 for two glasses of very tasty red wine) but it's a really great place to hang out.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-06", "description": "I came here 2 nights in a row. The first night was a Thursday night and the second night, duh, a Friday night. I judged this place by the outside and had decided it was probably douchey. But I ended up really liking it! I'm not a fan of the collared shirt crowd, and yeah, about half the population had collars, but it wasn't annoying at all! The spikey haired men in the collared pin striped shirts maintained decorum. The drinks were a bit pricey but the classy environment and convenient location to my home made up for my pricey drinks. I had a few of their $10 Cazedores blood orange margaritas and plan on having more in the future. Quite tasty. \n\nBonus! I guess there is an upstairs room that you can reserve for private parties. If you sit facing the stair case you get to watch drunk girls fall down the stairs!!!! It's fantastic!! I watched a girl eat shit and it made my night. Not because she got hurt, which she didn't (or at least she pretended not to be in pain) but it's always funny to see a dressed up girl lack grace and get really embarrassed about it. Hypocrite? Yeah. I've totally been there. And I hope whoever witnessed it laughed! \nAnyways, if you are feeling pretty and don't wanna waste your perfect makeup artistry at Ha-Ra, then head over to Owl Tree. And if you just aren't feelin like drinking to Morrissey or The Ting Tings and want to indulge in some Top 40 from 1998-2009, then get your ass over to Owl tree and stop pretending to be such a hipster!", "author": "Liz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "We aren't from the area and stopped in for a drink, I had the cucumber gimlet and my boyfriend had a beer.  My drink was almost undrinkably strong, but worth $9.  Very cute ambiance, dim lighting, really comfortable feel.  I would give 5 stars, but the bartender was way too busy and it took a while to get drinks (and by busy I mean it was a playoff Giants game and he would get distracted by the game and ignore the fact he was serving a packed bar) and there isn't much seating.  Overall very comfortable place to go, will definitely come back if we're in the area again.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "Big fan.\nIt's close to school. Close to home. Super close to work. They take cards. They give me chex mix. What more can I ask for?", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-11", "description": "I love the Owl Tree. I do. I love their well made, classic and classy drinks. I love the feel of the place. I love their own cocktail menu. I love their bar stools. I love their sign. I love the homeless men standing to the side of the windows trying to catch glimpses of the pay-per-view boxing on the tiny HDTV before someone notices. I love the chex-mix (well, not the corn nuts pieces, I hate corn nuts).\n\nNormally such a place would earn 5 stars! But on our most recent visit the bartender was more interested in his iPhone than tending to the customers at the bar. The bar wasn't slammed that night, there were one or two empty stools, but it certainly wasn't slow. We'll be back, I'm sure, hopefully next time the service will be a little better.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "One of my favorite spots to visit yearly while staying in downtown. Friendly staff, good ambiance and generous drinks.", "author": "Paul R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-24", "description": "Realization is an odd thing. Seconds after sitting down on a couch in the corner, I remembered Owl Tree. Much like Mabel Choate recalling that Jerry Seinfeld stole her marble rye, I remembered. I remembered coming here over a year ago and not liking it. I remembered the way-too-old-for-that-kind-of-foolishness old men cat calling my female friends and stumbling over each other. I remembered the smell. I remembered the bar did me wrong -- and it was doing it again.\n\nMy group had reserved the upstairs for a private get together. We were planning on going into that piece 70+ deep. We needed room. I was amongst the first to arrive and inquired about the room. There was no room. Even though the room had been reserved for weeks, the person who put it together forgot to hire a bartender for the night and, yeah. No room. And then we started coming. As more and more of my group piled into the small bar, I began to get irritable. As other, random people piled in because the bar wasn't closed to outside traffic, I got heated. By the time I asked the doorman to help with the crowd and not let anymore folks in (the fire code was a thing of the past) and found out that despite the 'yes' and head nod he gave me, he was still packing the bar with more and more folks, I was nearly homicidal. Deplorable service. There's just no excuse for any of the snafus from the evening. This is what happens when I refuse to listen to my instincts.\n\nSo... three stars? Yep. The bartender was smoking hot (sorry; she was/is) and made some mean martinis. She did the best with the hand she was dealt and I need to give props where due. Despite the intolerable crowd, she didn't skimp on the booze and the first drink was as potent as the last. That's professionalism.", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "$3 beer and $4 wells for HH pluuuuus complimentary cheese, salami and crackers to snack on, YAY!!", "author": "Alexandra V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "Not to bad, the atmosphere brought from the bartender wasn't all that great. The people there made it all worthwhile!", "author": "Patricia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "Get the $10 special, which is a shot of Jameson and a beer.  You get good beer too, not crap bud light.  Very cool ambiance in this place.  The building decor is classy with an owl mosaic and neon sign on the outside.  There is a spot in the corner of the bar you should sit at with your friends.  It is a great place to socialize and have a good ol' time!", "author": "Devin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "All the haters are apparently flippin' the fuck out over the redecoration. I frequent the new Owl and not because it's the best bar in town, or because the chandeliers are shinier than the ones at Marina bars, or not because its the cheapest bar, but quite simply, it's directly on the street that is on my way home. It's convenient. I've also never seen placards and velvet ropes. I may drink too much here- but velvet ropes? WTF??\n\n1 star* The Jukebox. They do have one- must be a newer addition. Blues music, Springsteen, The Beach Boys, CCR, Jackson 5. Bring your parents. \n\n2 stars** Booth dancing and stealth hard wood all around you. \n\n3 stars*** 2 bathrooms for a small \"dive\" and snacks that are always proudly displayed: cheese cubes, lil' weiners, and pepperoni. Serve yourself up a heart attack. Bathrooms and food in the same sentence. That's convenient.- Again, Convenience.\n\n4 stars**** The most random \"dive\" bar crowd in SF. I never thought people in SF could be more random- but enter the new Owl Tree. The new crowd hasn't figured out if they want to stay, or go back to the Marina, or bridge and tunnel it, so I'll park my butt at my neighborhood bar and people watch until they do figure out where to go.", "author": "Braden B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "While a real owl tree is likely to house a parliament of solitary, nocturnal mouse eating hooters, this Owl Tree houses a grouping of loud, lascivious miscreants. \n\nOn a regular night at Owl Tree it's the ideal spot for a late night cocktail and if you're really desperate for some nibbles and street mice aren't appetizing to you owls, best peruse their cracker and chip table in the corner or ask for a bowl of nuts. I've never ordered any serious cocktails here but the simple concoctions are nice and strong. This once classic Tenderloin tavern was redone a few years ago -- transforming a kitschy, taxidermist booze barn into a classy-er, exposed brick, leather banqueted booze barn. Solid spot to satiate simple tastes, though we will all miss C. Bobby.\n\nHooty hoo.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-19", "description": "I really like this place, HOWEVER the bartender tonight is awfull where can I start, I've been at the bar for almost an hour finished my drink in 15 sat it out to make aware I need a refil, no response no attention. He was to busy talking to his buddies, oh and keep in mind I'm sitting at the bar with a visibly empty glass.  Why are you only helping your friends or bro's ???\nSooooo when I finally got the drink he spilled it ?!?! I wish I could get the service he gave other people but didn't. I felt ignored, and over looked.  However I hate playing that card.  The Asian girl, the really pretty Caucasian girl with brown hair that flairs bottles and the red head that speaks German are great!!!! I really like coming here when they are working, and I suggest you do the same. Moving forward ill make sure who's bartending before I come in...awww cute, he gave me pretzels, I guess cause he sees me yelping\nPOST!!", "author": "Narada J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "This place was amazing! I actually had never been before and planned a birthday party for my boyfriend here. I just took my chances based on reviews and his recommendation that it was a cool place. When we got there we mentioned we had reserved some tables upstairs and they let us right up. At first it was just our group and then some people from downstairs came up. It was awesome to have designated seats and the bartender upstairs was great. Overall I had a wonderful time, as did all the guests. \n\nTo be honest I was hesitant to even write a review to selfishly keep as many people in the dark about this place as possible :). I would DEFINITELY host another event there.", "author": "Shiva J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "This bar is a great little dive bar. The bartenders are amazing and the conversations with the local patrons are second to none. The first night we came the bartender said this is the place where small town connections happen. Considering we were from the Midwest we didn't expect to meet anyone from our region, we certainly did.  Atmosphere, drink selection and company are all pluses!! Go to this bar and find San Francisco and homegrown contact in the same place.", "author": "Jesse G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "I have three special little words for you, dear readers: blood orange margarita.\n\nOkay, they might be nice words but \"blood orange margarita\" does not a review make, no siree. Yet considering I'd already had a couple of deliciously tangy cocktails earlier in the evening at Thermidor, I was certainly in the mood for more. Not too many more, mind, I didn't want to be carried out of the place - thankfully Alex S and I left clear-headed enough to find our way back to the hotel on our own, and considering we had a self-confessed combined awful sense of direction, that was no mean feat. (Let's just have another virtual fist-pump for that moment, mister!)\n\nBack to the cocktail in all its sharp, acidic splendour. I'm always pleasantly surprised when a margarita comes in a tall glass as opposed to a martini one (I'm all kinds of clumsy with those bad boys, and it feels like you're getting better value for your buck anyway) and it was delicious. I'd highly recommend it to anyone like me who prefers a caipirinha to a cosmo and likes a bit of bite in their booze. A big hats off to Noelle who had us all completely enthralled with her cool as a cucumber, sweet as sugar demeanour - I'd be a dreadful bartender, I'd crumble under the pressure of one customer, let alone a floor that had been hired out to a substantial group. She was swift, deft and did not drop her smile once. \n\nMeanwhile the place is quirky, and you already know how much I dig quirky. Whether it's the retro 80s movies in the background (hello, my perfect bar!) or the jukebox switching from Metallica to Shakira in the blink of an eye, it's charming, it's unusual and it's a bar I'd happily return to in a flash, for the purposes of discussing British vs. American television or anything else. Owls might say whit-woo, but for this place I'd shout a giant woo-hoo!", "author": "Emma Louise M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-13", "description": "When we hit up the Owl Tree my first thought was.... \"ooh dark... I likey\", but then after having to shuffle around the bar stools to get situated at the bar I realized something. This place was hot and cramped. It was so hot I was getting claustrophobic. I couldn't even finish my drink and I asked my friend if we could leave.\n\nThey did have a lot of interesting looking alcohols that I wanted to inquire about but the female bartender working our side of the bar looked like she wanted to slap me each time I asked a question. I mean come on, you're a bartender isn't it part of your job to be friendly and make small talk? \n\nI was over this place pretty quick, but I guess it's worth mentioning that my friend really liked her cucumber gimlet.", "author": "Lori K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-02", "description": "I found myself mesmerized by the deft movements of the bartender. No motion unnecessary, no energy wasted. It was like poetry in motion -- with a delicious ending that leaves you feeling pleasantly buzzed.\n\nThe place is dark and relatively small but this lends itself well to cozy little conversations and bumping into folks you want to bump into. \n\nI only wish I'd seen some owls, as that would have completed the experience. I also want to know how three cocktails got me so hammered. Seriously, what are you putting in your drinks? Next time, I will know better and just get one. One!", "author": "Olivia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "Great place to go after work, especially if you are on a budget! Well the drinks are kind of spending, but it is surprising how one can fill up on the free cheese, meats, crackers, and chex mix they offer! \n\nI have a huge thing for seating (specifically booths) and this place had really comfortable seating! It very dark inside and cozy, but also loud at the same time.. loved the vibe! \n\nThe Blackberry Martini was my favorite, I tried the one with the cucumber as well, which was refreshing, but then switched back to the Blackberry drink for the rest of the night.", "author": "Rona Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "Very Mad Men. It's like the scene of some old Hollywood movie here -- all that's missing (thankfully) are the huge clouds of smoke. Everything about Owl Tree feels very dark and masculine, including the flocks of old white businessmen. Not bad for an intimate group of friends looking to escape the usual crowds in Marina/Mission, but don't expect a wild night out.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-12", "description": "I think this place used to be a cool dive, and now it is this somewhat schizophrenic place in an equally schizophrenic area of town. It has this sort of swanky interior to match how much they charge for mixed drinks, and they put out a cute spread of cheese and cold cuts for happy hour. It's small and cozy, and on the weekends they open an equally small second floor.\n\nThe thing that I can't get over here is the music. This listing says \"juke box\" but I haven't noticed it. And jukeboxes aren't a great idea if you end up listening to The Beastie Boys, Will Smith, The Bee-Gees, The Cure, Outkast, Frank Sinatra, and Def Leppard. In that order. \n\nI'm not kidding. I actually enjoyed most of the songs they played at one point in my life, but altogether it was so weird and distracting that it felt like I was being forced to sit  in the middle of a room while every man I'd ever been with paraded around in front of me in his underwear.", "author": "stephanie l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-18", "description": "When looking for a drink, a giant owl mosaic appeared in front of my eyes.. obviously hypnotized I was drawn inside where the object of my desire (pre-dinner alcoholic beverages) awaited. \nPeople were chill, drinks were fine and served as expected. Not divey, and prices reflected that. There were quite a few people in there either speaking a different language or with a euro accent, which was kind of interesting - I don't know if that's a regular thing or if it was just a party that night. I can't say this would be my usual spot but like yelp says, three stars = A-OK.", "author": "Jeanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Found this place by pure luck... While walking on Post st. Dark and Cozy... Lovely wooden old school bar.. Full bar... Downside for me being that I am a Beer fan is the limited beer selection. Nice little laid back place. Great place to catch a basketball game if you just want to have a drink and enjoy.", "author": "Diego V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "Fun place! Came here on a Saturday night with a friend and was pleased with the cocktails menu -- mango mojito? Two of my favorite things! Yum. Love that there is lounge-style seating even though it is a small bar. Was full without being crowded.\n\nI don't know if I'd recommend it for a large group, but definitely a fun place to grab a drink with a friend or perhaps for happy hour, which I'll have to try next.", "author": "Richa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "Does Owl Tree really deserve a classification as a dive bar?  I don't think so, but I guess there isn't a category for \"Hilariously confused bar.\"\n\nI walked in here with my partner while trying to kill an hour and a half before dinner up the street (we aren't very good at gauging how long it takes for us to walk places).\n\nAt first I was incredibly skeptical -- the place is small enough that you need a shoehorn to get into, a techno remix of Sinnerman was blasting,  and there was a hefty dash of drunk after-work types.\n\nAfter picking up the menu I was quite happily suprised $7-9 cocktails, including a $9 Hendrick's gimlet, a solid Manhattan, and four actual, real, beer drinker's beers on tap.  Yes, please!\n\nService was fantastic, too.  A very personable bartender that checked up with us every ten minutes despite the full bar, and a server that replaced our Chex mix bowl within a minute of us snatching the last cheese puff.\n\nIt's got a comfy interior that reminds me of a DC steakhouse.  The music and crowd signal something trendier, but the drinks and the bartenders tell me that I'm in a dive bar.  Stop playing with my mind, cruel owners!  This is a great regular after-work hangout, don't dress it up like it's a date bar!\n\nThe Owl Tree is like the first person you had a crush on.  You don't know what's really going on, you feel confused and a little bit nauseous, but you want more.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-23", "description": "Yawn....\n\nOwl Tree, you're nothing special.  Sure you may be super hot (literally) but I can't base a relationship on heat factor.  You're dark and mysterious (decor) but that's about it.  You took me upstairs but your place was a bit cramped and blah, I had to get out immediately.\n\nIt's just not going to work out Owl Tree!  \n\nPS. Rick and George please stop expanding and making over-priced lackluster bars in the city.  You're killing me!  Poor Brunos, an SF institution turned into some safe-marina bar in the mission.", "author": "Kristin Marie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "Cute, warm  little bar on a corner. Has a very traditional old fashioned feel.  Not a very good place for a great glass of wine. But if you are more like my husband who likes cocktails without any frills it's perfect, because this is not where you will find a talented mixologist. Cute, homey Christmas Decor (in Dec)", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Who thought the tenderloin was bad? This place is great! We came from out of town and wanted to watch the hockey game and they put it on right away.  We went to 4 other bars in the area to get a specific drink and no one could provide it for us...well....another story for another time.  If you go, pray Gabi is working because she's the best!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "Call first-Bobby seems to take a lot of time off!  \n\nZAZZ!  I love this place!  It is always a toss-up if Bobby is crabby or not each time one goes. :)    Bobby is pure class, though.  I love his freshly laundered white shirts and he knows how to make a drink.  Spy on your friends with his web cam-or have them spy on you! :)\n\nMakes me want to go tonight-darn he is only open Weds-Sat 5pm on--razz!   :(   I am thirsty!\nNote; Bobby passed away late in 2006.  I heard his son was going to reopen it, but I don't know if that happened! \n2008-i have heard it has reopened.", "author": "BRUCE S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "I've been here a few times now, and there seem to be some regular truisms at play when it comes to Owl Tree: they know their way around a cocktail, and if you drop in when they have one bartender working, chances are said barkeep will be conducting a veritable clinic on how to cut up a room...I'll say this: I've seen this place super packed on more than one occasion, and in a city that appreciates a well crafted cocktail, they still seem to turn out concoctions without a major wait. \n\nIf you haven't gathered by now, the Owl Tree is a rather diminutive space with some intentionally rough edges, but I think that it says something that a bar that can feel this small and crowded also feels somewhat group friendly. All I know is that it's probably not a terrible idea that you know your friends well or enjoy their company, as you'll likely find yourself in close quarters. I'm sure I'll find myself, brew in hand, in the neighborhood again one of these days, and that means one thing, really: good times ahead.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-01", "description": "Second trip to the Owl Tree, and I think it's just not my kind of place. The bar is deep and narrow -- and unless you grab some coveted bar stools at the bar or one of the little seating areas on the left, you're a bit out of luck because standing (or trying to navigate anywhere) in a narrow bar that's crowded is no fun.\n\nHad a vodka and soda that was decidedly weak. And two of the three bartenders just seemed pretty irritated that they were so slammed -- we were a giant group but in our defense, had called weeks ahead to let them know.\n\nThe music was super-eclectic (from No Doubt to Rump Shaker) and was one of my favorite things about the venue... certainly keeps you on your toes!", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-22", "description": "What a cool spot.\n\nDive downstairs and loungy upstairs.\n\nYou can reserve seating upstairs and the bartender up there makes the drinks STRONG! The beer selection is lacking but you should be getting Hard A here anyway.\n\nCheck it out!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "Walking down Powell and I'm stopped because the company knows the hot chic walking towards us.  Hello!  I'm introduced to Noelle...nice to meet you!  She tells us that she's heading to work at Owl Tree...hmmm...never heard of it.  Now I don't know why I automatically assumed it was a dive bar but I remember thinking it'd be cool if I walked in one day.\n\nCut about six months later and since a quick late dinner was being consumed nearby we might as well check it out...walked in and said hello to Nicole...???...um, no! my name is Noelle...CRAP!!! complete embarrassment...I'm sure she wasn't too pleased at being called by another name either...TOTAL FAILURE!!! =(\n\nBut I appreciate that she still put on a smile (slightly awkwardly, understandably) and didn't allow my moment of being a complete moron hinder her heavy hand.  Graciously my company picked up the rest of the drinks which was great for me more since it meant I didn't have to face the bartender again for the rest of the night.\n\nThe Owl Tree is a chic and mysterious type of lounge lit by soft lighting and candlelight.  The bartenders know what they're doing and (insert any compliment that could possibly not make me an idiot for my mishap).\n\nhahaha ok...enough.  Though seriously, I'm sort of wanting to throw a get-together in their upstairs lounge\n...where I will definitely remember NOELLE!!! =)\n...I apologize btw", "author": "Ninja H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "Hmm forgot to write a review of this place. My girlfriend and I actually visited this place a few months ago. We both had a recollection of this place being a dive but since our first bar was closed that night we decided to walk over and give this place a shot. \n\nSo I'm a sucker for that old school swingers loungy feel and the Owl Tree when I walked it had that a bit. bunch of couches and chairs along the wall and a long bar with people posted. We scored spots at the bar and my gf and were able to order drinks to our hearts content.\n\nWhat I really liked was it had a good energy. It was just us two but the place had a lively vibe to it and it just brought our mood up with it. Definitely will probably swing by here again on a random night like we did before.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "This place would be huge if it were in Sacramento. Since it's in the City it's just another decent dive bar. I'm from Sacramento and it was close to my hotel, so I dug it very much. We missed happy hour but drinks were reasonably priced and they have a passable selection of whiskey and a few good beers on tap. The mural and all the owl shwag inside play nicely with the modern decor and the low lights make everyone 28% cooler. Upstairs was closed, but I suspect it's even cooler up there: maybe some live owls or cheap massages. I'll go back to find out. When we were there they were playing Beverly Hills Cop on the TV which is awesome.", "author": "Logan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "The Owl Tree is the kind of place where you take a casual first date because you're pretty sure that other someone is pretty laid back and not the type of person who tries too hard. Yeah yeah yeah, I know that it's SF standard to throw down some metro peacocking and striped shirts on a first date....but if you met said person at say, a dive bar in The Tenderloin (truth), let's not fool anybody.\n\nBut seriously though, you can reveal a lot about a person's character when you bring them to a place like this. It's this casual zone between \"kinda divey\" and \"nice enough.\" The decor is an accessible level of eccentric. The draft selection, though small, is thoughtful. They have Bulleit. (Actually, I got in the habit of mentioning who has that because I just relocated from Boston and unicorns are more common than Bulleit...but, here, it seems to be everywhere). The prices are decent. The lighting (or lack thereof) is flattering. (I look my \"hottest\" in dive bars...the thirtysomething's best defense). The bathrooms are clean. (Did I ever tell you about how much I missed toilet seat covers when I was living on the East Coast? It's so nice to see those everywhere again.) And the playlist is awesomely terrible. If your possibly special someone finds no unironic humor or appreciation to Wang Chung's \"Everybody Have Fun Tonight, \" then send that asshole packing. Or, at least I would because I shamelessly and unironically (forgive me, I live amongst the hipsters in Temescal these days) love that song. \n\nFour solid stars.", "author": "Zulu Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "Nice cool bar, great bartender and the prices are reasonable. Good music, clean bathroom, friendly bartender is why this deserves a great rating. If you have a small group of 8 or less this is a cool place to hang out.", "author": "Krishna Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "This place has some sick drinks. They are unique but not fru-fru, and they are certainly strong!! I loved the super chill atmosphere and free  snacks. I came here for Yelp Drinks, but I will certainly be back for happy hour.  The spot is super cute with low tables for optimal chit chat and libation enjoyment.\n\nI recommend checking out this if you are down around TL or Union Square.", "author": "Caitlin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "I came here with 9 other people on a Friday night around 10pm and we just lounged around upstairs. I absolutely loved the decoration and atmosphere of the bar. Like other people said, it's like a dive bar. It has very nice furnishing and super comfy leather ottomans.\n\nThe upstairs bar sucks because it's tiny and does have a lot of alcohol. We should have gone downstairs for our drinks but we were too lazy. You can also rent out the upstairs for parties and events. Overall the drinks weren't that expensive. A shot of patron was only $8. Another note about the upstairs area, there really wasn't any service available. There was no menu as in some of the pictures and there was definitely no snacks or food. Also, they don't give you water, you have to buy their bottles of water. I think it's $3 for a bottle.\n\nThe people there were really nice and also very hip. I definitely want to go back again and try the downstairs area.", "author": "Lucy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "Great little bar int the union square, love the local scene here.  very friendly bartenders strong drinks and great door man.  if you want to get away from the union square club scene this is the place to go", "author": "Shirley W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-22", "description": "Owl Tree! What a cute name for a bar! \n\nMy roommate and I used to go here all the time when we live just down the block. There's always people chilling just outside of the bar, and they're usually really friendly. We've gotten stopped and offered drinks many times just by walking pass it (but only taken up offers a few times when they seem like really nice decent people, and they were). People who go here are really friendly, it's really easy to chat up anyone.\n\nThey got free otsumami, and if you run out, they'll just keep filling it up!\n\nReally good mojitos. The passion fruit mango mojito is so sweet and delicious!\n\nThere's an upstairs, but it's usually closed until it gets too crowded downstairs. It's a lounge atmosphere upstairs, good for groups, small bar, really easy to talk to everyone/people watch through those huge windows.\n\nI'll have to go early and check out their happy hour!", "author": "Erica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "AWESOME SPOT. very comfy and loungy. They don't have food, but the lay out cheese, crackers and salami for you on a side table, and offer pub mix (yum!)\n\nThe service is outstanding, the drinks pretty good. I had a pomegranate martini, and although I don't care for martinis, this one was damn good. Totally hit the spot.\n\nI'd definitely go back to this spot!", "author": "Chi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "Cute place -- casual and swank at the same time.  The ambiance is great too --- a step above a dive bar, and they have Blue Moon, always a plus.  A great place to grab happy hour with friends.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-11", "description": "Comfy little saloon type place with nice bartenders and decent cocktails. Nice snacks lying around -- of course they're there to get you thirsty and to drink more, but hey, they are damn tasty. Only complaint, and a big one at that, is that the price for cocktails is a bit high. At roughly $9, they are only a dollar or two away from Rye drinks, and you can't compare these drinks to what they have at Rye, especially considering it's not too far away. I'd come back here if I wanted to mix it up during a night out, but I'm not aching to return.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-03", "description": "How do I choose what my first review of 2010 should be? Easy, write about where I was when I brought in the New Year.\n\nIt was 30 minutes till midnight, and I alongside with my fellow orphans on a budget are wandering aimlessly through the Mission on a mission.  Must find a place for a drink...fast.  Everywhere we turned was either at capacity or $45 at the door.  Think fast...think fast...think fast.  Take a cab and head downtown.\n\nI recall in my memory of past drunken evenings of a fun dive bar situated on Post.  Music is ok, drinks are good, and bartenders are fast.  We escape our cab and run to the door (20 minutes till midnight), and $10 cover! Score! We gladly pay, proceed on through, squeeze our way upstairs with one thing on our minds...get to the bar...we are thirsty!  First cran/vodka of the night down my throat and warming up my tummy (10 minutes till midnight).  I look around, it's getting thick in here. I need another drink, but bartender has quite a few people ahead of me.  Where is our friend Matt? There's 5 minutes left till countdown? We succumb to our fate (champagne-less counting down from 20 now), and accept our next drink will come at the start of 2010.  \n\n\"Ten, nine, eight,...\"\n\nMatt appears...are those 6 champagne glasses in his hands?\n\n\"Seven, six,....\"\n\nGrab one, and pass one. Grab one, and pass one.\n\n\"Five, four, three, two, one\"!\n\nA toast in the air, I scream Happy New Year, I coat my throat with that sweet champagne, smiles on our faces. We find seats by the window, open up the curtains, and people watch as we celebrate the night away.  What a way to bring in 2010.\n\nThis is dedicated to Matt, who saved the day. 2010 will now be officially termed \"Year of The Matt\" amongst us.", "author": "Maybelline C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-23", "description": "Clean environment, ok drinks, and a quiet crowd. If the crowd was a little more extroverted, might be an ok place to hang out? About a 50 / 50 chance you will have a good time. Tempted to visit Owl Tree again, though this visit was somewhat disappointing. What often makes a good bar in SF, not the decor or location, it is the people.", "author": "Henry J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "We wanted to grab a quick beer near our hotel and was recommended The Owl Tree. Slipping into this bar, it feels very small at first and has a small door guarded by a large man. I was hesitant at first and even though I do not look underage, he carded me. He was polite about it, but it was briefly offputting. \n\nMy colleagues were already there and I slid in next to them. It felt a little dark and a little cramped. I had a New Belgium Fat Tire which is the same sort of beer I could've bought on the street, but this beer was served in a frozen glass. \n\nIt was small, dark and crowded but not too bad - if that's your thing.", "author": "Devon A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-18", "description": "Not good for big groups unless you book the upstairs room. We had a group of ~15 & had to wedge our way everywhere in this small bar. Thankfully the seats/couches are comfy. \n\nThere was only 1 bartender on a Sat night - WHAT?? so service was slower than I'd have liked & it was packed. The decor takes up much of the space - tables, couches, bar stools - so there's little room to mingle. \n\nGood thing they accept credit cards & not overly priced.", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-14", "description": "The Owl Tree is a classic SF dive bar.  Or should I say, \"was\" a classic dive bar. \n\nI came here saturday night for a few beers and was surprised when I entered. Someone has completely renovated this bar. It has a new dark wooden interior, a new bar, two leather booths, and a back lounge area. Plus a private room upstairs. This was once a San Francisco dive bar where we drank jack and cokes and smoked marlboro reds.  There were old business cards tacked up behind the bar, and people casually met here for cocktails, conversation, and to play around with the old jukebox. \n\nNow this place is like Fabio meets Casey Kasem. There were two pumped up italian dudes wearing black t-shirts two sizes too small behind the bar. This attracts some gushing women cliental. Overall it was nice to see that the bar was revamped. \n\nBut minus two stars for the worst bar mix I have ever heard. They mixed eighties hair metal with hip hop from the early nineties like Warren G's track \"Regulate, (not that bad), but inexplicitly went from playing this track, to Warrant's \"Cherry Pie,\" and then played \"Ice, Ice, Baby,\" by Vanilla Ice. Come on by to hear Owl Tree's Wack Mix Vol. 1.\n\nAlso, if you're a guy, make sure you've got that Marina collar, starched, popped, and in ready formation.", "author": "Georgio N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "A cool little place to chill and have a drink. Came here during Yelp Drinks! 2011 with my roommate. \n\nWe sipped on a couple of the Fresh Blackberry Martinis. And they were rather tasty. \n\nIt's somewhere nice to hang out if you just need to chill.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-19", "description": "Good corner bar. Much nicer on the inside than one would think from looking at the outside.  $4 drink happy hour 4 pm - 7 pm; some free cheese and crackers at the end of the bar.", "author": "Jefferson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "I love this place. The $3 happy hour drafts (good ones, too, not just Bud Lites) and free cheese and crackers mitigated some of the horror of a 4-week stay in the Tenderloin.", "author": "Tess H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "I love this place, totally my neighbor bar! The ambiance is really fun with SF based movies on the TV's only, great comfy chairs, and you can totally imagine someone in the 80's snorting coke off the tables!\n\nThey have a great drink collection, although some of the bartenders are better then others, I would definitely recommend the cucumber gin martini.", "author": "Megan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "**This review is for the Happy Hour only\n\nCheap and delicious. $3 drafts and $4 wells until 7p plus FREE cheese and salami. Yum. The cute blond bartender with the long hair is great. She has great bar backs backing her up too. I always have a great time here!", "author": "Alice J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-06", "description": "Met up with some friends here last night (Saturday) and I have to say whoever the bartender and bar back are - you're both amazing!  Best service I've had in a bar in a while.\nThe place is packed, people are throwing crazy orders at him, I returned three times with my card only to say, \"close it out\" each time (I really thought each round was the last) and these guys are knocking orders out, ringing people up, keeping the whole place clean, bringing water to our table.  I'm really impressed guys, good job!", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "This is my after work watering hole. It's right down the street from my office. The drinks are reasonable, free bar snacks and the bartenders are always nice. I love coming here.", "author": "Manny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "My favorite SF bar.  It's my go-to spot for happy hour because of the location, friendliness, atmosphere, and free food.  Yes, free food.  They have help-yourself salami, crackers, cheese, and Chex mix.  It does get crowded at times, but usually you can find a spot at the bar or in a booth.", "author": "Bud L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-20", "description": "Sleek, winsome owl decor wraps itself around the exterior of this particular bar. Inside, the theme winds down a little bit, as two televisions flicker with sports. The bartenders are pretty generically robotic, as they plunk away on their computerized cash registers, taking orders with little animation. \n\nWhat's on tap? Nothing special. The obligatory domestic beers pop up more than once. They have one or two craft beers in bottles, which should placate artisan beer snobs. \n\nBut the music is the real tragedy. I can only imagine that, with the bizarre transitions in tempo, someone brought their ipod shuffle into the bar, plugged in an audio cable to some speakers, then let the worst mix of songs bounce off the walls of the place. The party that I came with heard Rick Springfield's \"Jesse's Girl\" three times in an hour. There was also flamenco music wafting through the air before it gave way to \"Ooops, I Did it Again\" by Brittany Spears. The volume was bumped up much too loud for casual conversation, so patrons have to vehemently bark over one another like rabid canines. \n\nAnd why did they start playing Reese Witherspoon's \"Just Like Heaven\" on the two televisions after they had been showing UFC for an hour? The whole place had little to no consistency in its identity, temperament, clientele. \n\nBleh.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "Cool little spot. Got the greyhound, which was pulpy like I like. Tough to get a drink if there are more than a dozen people here.", "author": "Khalid N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-02", "description": "Cute little bar to grab a beer after dinner or a show, but stick to beer or wine, as the cocktails are not very good, yet still as pricey as anywhere else.", "author": "Brett B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Great little bar with good drinks, comfy atmosphere and just an all around cozy place to sip some cocktails. Nice place to grab a drink before dinner at Sakana (awesome sushi next door).", "author": "Ennis O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-29", "description": "Just a few blocks away from the craziness that is Union Square and you'll find the Owl Tree.  Not only Owl lovers adore the owl-focused decor- but everyone will love the classic decor in this great bar!  Once seated in one of the comfy booths downstairs or the cool lounges upstairs - you're served with mixed nuts to help soak up the delicious cocktail you're about to imbibe!\n\nMy favorite is the Hendrick's Cucumber Gimlet - carefully muddled and served up in a martini glass ready for my consumption!  Oh. The. Joy!\n\nThey have a nice little happy hour too - with a little spread of meats and cheeses to graze on.  \n\nOnly complaint (if you can call it that) is that their music selection is quite random - but that makes it even more endearing to me....They'll play anything from INXS to Guns N Roses to Britney Spears - all in that order too!  It's kinda weird but fun when you're really just there to chat with friends over a well crafted cocktail!", "author": "Heather L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "Very cute dive from the outside, nicely remodeled upstairs. Conveniently located, easy to find, not too overly crowded, but plenty of people. Love the mosaic of the owl on the front (makes it easy to recognize- and artistic at the same time!) Drinks were fine, bartender was cool, bouncer friendly. Well done.", "author": "Naomi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-02", "description": "A cool kinda dive bar near Union Square with good vibe albeit it is a small place.  I would return for happy hour or late night.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-23", "description": "Little dive bar downtown. Good place to grab a drink.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "One of many great bars in this area, the Owl Tree has a variety of drinks and music to please everyone", "author": "Mike P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-09", "description": "Hung out here on a Friday night.  We were with a pretty big group of out-of-towners who were in SF for a wedding.  First impression of the Owl Tree was that it's quite random.  The movie \"The Rock\" (with Sean Connery and Nicholas Cage) was playing on both flat screens above the bar, the music was an eclectic gamish of upbeat tunes from the 80s to the present (in no particular order), and its dark decor aptly camouflaged its dive-bar roots.  Crowd was laid back, which was good because it was really cramped.  Lord knows you want laid-back people around when you have to practically squeeze your naughty bits up against random strangers just to get to the bar.\n\nOverall, not bad, but I prefer places that aren't quite so claustrophobic.", "author": "Christine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "I miss your chex mix\nI miss your stiff drinks\nI miss your dark owls\nI miss your doggie\n\nHowever I know someday we will be reunited.", "author": "A. E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "I've been coming here since before the renovation.  They did a fantastic job of upgrading while paying homage to the old guy's owl collection.  Take a look at the case at the end of the bar, at the stairs.  Before the renovation, the whole place was full of all those owl knick-knacks.", "author": "Byron D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-06", "description": "Good crowd.  Nice bartenders who make great drinks.  \n\nMy only issue with the place is that I was there when someone stole someone's purse.  So becareful! Watch your purse!\n\nThat's the only reason I didn't give it a 4-star rating.", "author": "Stacy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "Great bar to hang out at!! Enjoy it each time I come!! Small, quaint, friendly!! Good place to start or end your night.", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-24", "description": "Passed through for a quick drink.  Cocktails feel on the pricey side since they were not very strong.  I'd pass this place and go to Olive if you're looking for drinks with a kick!", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "Nice place to go to grab a drink and still be able to chit chat. Looks ugly on the outside but real nice inside. Looks like some deer hunters's hidden den and i'm waiting for Mr. Hugh himself walk out with a cigar and his robe to welcome me. \n\nI like their Blood Orange Margarita! Yay tequila! Also has chex mix, which i like. The bartenders are pretty friendly, most of the time it's not jammed pack so I always get a seat. Last time I went, they served cheese & crackers. The music is real random, one minute it's 80's and next it's rhianna, maybe an ipod on shuffle.\n\nthis place is clean, nice, small, cozy and close by home.\n\nP.S. owl if your reading, i'd come here everyday, if you served food. LOL", "author": "Tam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "Awesome little spot, great drinks.  Another huge plus..they have free cheese and crackers! Only drawback is it's a little small", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-24", "description": "First time visiting San Fran. We were staying at the hotel down the street and stumbled into this watering hole. We loved it!! The decor was similar to that if a yacht and a lounge had a baby= Owl Tree. Prices were reasonable and the service was great. There is definitely a nice mix of locals and visitors from nearby hotels. Once we found this spot...we went back a few times before our trip was over. (Being from New Orleans...We like an eclectic feel) We are still talking about the owl tree!", "author": "Marcie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "I have a pretty random review to write...\n\nI was at the Owl Tree a week and a half ago for a private party. They have a great room upstairs and were very accommodating to my friend that had organized the whole party. Looonnnngggg story short, someone stole my purse. It was a private party so most likely it was someone I know. Needless to say, I was not in the best of moods. \n\nI borrowed a friend's phone and tried calling my bank and my phone. I was standing out front and visibly upset and Anthony, the bouncer/security gave me his stool to sit on and basically just had some nice comforting words. I stayed until the end of the night, just incase it had fallen somewhere and we could find it. Anthony came up and checked in to see if we'd found it and then told me he'd check out the security tapes. \n\nI followed up the next day and everyone I talked to at the bar was aware of the situation. When things like this have happened before, I feel like I've had to to explain my situation over and over, but everyone knew who I was. I went in to look at the tape and it turned out there it was no help, but while I was waiting to look, I talked to a lot of great people, enjoyed the snacks they had put out and decided that in spite of my purse being stolen there, I really liked this place. I'd definitely go back there. \n\nLike I said...random", "author": "Jaime S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-22", "description": "My cousin Megs & I met up with some friends we haven't seen in a long time here at The Owl Tree. It's your typical hole-in-the-wall dive bar, really chill & low key. We got there a little bit early on a Sunday, so there were a few people by the bar. The bartender was really nice and accommodating because my Iphone was about to die so he let me charge my phone with him. The crowd varied from tourists, hipsters & just-moved-in from out of town. My friends ordered some fruity martinis and I had a blood orange margarita which was really good. It's definitely a great place to go to if you want to just chill with your friends or just unwind after a day of strolling in the city.", "author": "Niki P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-03", "description": "Before C. Bobby died:\n\n[Setting: Saturday night downtown. A not-too-dimly lit bar with either shag carpeting or else an overall feel that makes the average observer think he's standing on shag carpeting; lots of low, wooden tables and chairs; about 17,000 representations of owls.] \n\nPatron: Hey, how you doin? \nBarkeep: What'll it be?\nPatron: My name's [redacted]. What's yours?\nBarkeep: C. Bobby.\nPatron: Great! What's the C. stand for? \nBarkeep: What do you think it stands for? C.! Now what the hell do you want? \n\nAfter C. Bobby died: \n\nYelp reviewer: \"Really good mojitos. The passion fruit mango mojito is so sweet and delicious!\" \n\n\nSigh. I had my arm suddenly around a random Irish woman's waist one winter night at the Owl Tree years and years ago. It was raining and glorious, and my friend had parallel-parked his car .4 blocks away, on a hill, in two turns and with no more than two (2) inches to spare on either end. We took pictures of the interstitial wonder and emailed them back and forth to each other. The Owl Tree, even at that late Saturday night hour, was well-lit because they had no secrets, and she had such red hair. We'd run into a guy we went to college with (college in MA, mind you), and then had more drinks with C. Bobby and that Irish girl. Oh strange lassie, I'd've  had no idea what to do with you that night, but I still wish I'd gone home with you.", "author": "T U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "Great chill place for drinks downtown.\n\nPros-\n- Chill Atmosphere\n- Seating\n- Great location\n\nCons-\nLimited draft selection\nExpensive\n\nReally enjoyed this place, I'll be back.", "author": "Brett M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-04", "description": "Somebody sucked the soul out of this place with a straw. Before the remodel it was a kitschy jewel. Now it's just another yup-hole. The only things that save it from 1-star oblivion are the free snacks and the $10 Jameson-and-a-beer special.", "author": "Stuart M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "I love this place. Great atmosphere. Chill but not chilled out. Upstairs is my fav spot in the city. \nBartenders are awesome and door guy is awesome !\nCan not recommend this place enough", "author": "Spanky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "I love this place! Although small, the ambiance is great, and drinks are moderately priced. It's got a great location, and is a very simple way to start or end your evening. I've spent anywhere from ten minutes to 3 hours in this bar, and always felt very at ease. \n\nIf you scan down the list of reviews, you will find Susan M. She reviewed this bar very negatively after her experience Saturday night. She claimed \"the bouncers suck\", that they \"called last call at 1:15am\", and they wouldn't let her \"finish her drink\". I had the opportunity to talk to the particular bouncer she spoke of last night, who in fact (after finding out about her ridiculous Yelp review) is pressing charges against SUSAN M. for PUNCHING HIM IN THE FACE after he told her the upstairs was closed and she could finish her drink downstairs in the remaining 20 minutes that the bar was open. She refused to go downstairs MULTIPLE times and only AFTER she punched him TWICE in the face did he grab her and call the police. Anyway, I found Susan M's perception of this incident WILDLY AMUSING and also completely MISCONCEIVED.\n\nThe bouncers do NOT suck, the bartenders are nice, and the place is always comfortable and relaxed. Watch out for totally insane women though, apparently they sit upstairs and have no concept of time while they are wildly punching strangers.", "author": "Margaret H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-10", "description": "I'm pretty sure I'm banned for life from the Owl Tree...or at least only allowed to order a diet soda.\n\nI used to frequent this little hole in the wall when I worked in Union Square. It's dark, on a random corner where you won't run into anyone you don't want to run into, the bartenders are chill and drinks are decently priced. I wouldn't recommend it for late night but right after work the crowd is happy and friendly. I'm a fan of the retro 70's touch and the small booths near the window. What can I say, I like to people watch.\n\nUnfortunately my girlfriends and I took happy hour way past the legal limit a few months ago and I haven't been back since. Not because I didn't have a blast, but because all three of us have no recollection of leaving the Tree...I left my ATM card there and woke up in the morning, topless, face down on my bed, all the lights on, my Brita water pitcher on my night stand and my stereo turned on full blast to a mariachi station. Guess that means I had a good time...party on Owl Tree!! Maybe I'll wear a disguise and sneak back one day.", "author": "Lynsey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-11", "description": "I'm moving out of the hood this weekend and I find this place!?  What a jip.  Great vibe, great drinks, free snacks!  What else could you want?", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-20", "description": "I once heard a swing tune emanating from Owl Tree, which led me to take a peek.  I love this place.  They play a good variety of music ranging from Pretty Woman to Fugees, etc.  Their flat screens show a variety of movies filmed in and around San Francisco.\n\nThis place is comfortably swanky.  Low, dark ceilings, a long bar, tables-chairs along the wall, a few dim chandeliers for a bit of class. \n\nThe people and staff are friendly.  Ask for the 'Wojtek' (pronounced Voy-Tek) cocktail it was created by a bartender of the same name.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "It's simple math:\n\n1 Star for being the only bar in a 5 block radius from our hotel that was playing the Kansas game (even though they lost...I won't hold that against them)\n\n+\n\n1 Star for a $1 off my beer during happy hour, and the bartender notifying me that there was 1 minute left to order another\n\n+ \n\n1 Star for free Cheez-it's party mix to satisfy my hunger pains before dinner\n\n+ \n\n1 Star for the sultry ambiance and cool atmosphere that made me want to hang out there all night\n\n=\n\n4 Stars", "author": "Lacey M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-03", "description": "This was one of our favorites 3-5 years back- I guess they had an ownership change because this was not at all the way I remembered when I returned on Friday night...\n\nDefinitely not the vibe of the old Owl Tree; but still offers up a relaxed atmosphere, comfy booths, and great drinks.  Fresh squeezed greyhound is worth the trip alone.", "author": "Gabrielle J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "Fun Environment. Blocks away from my work, so that's a plus especially for Happy Hour. I loved the little stash of cold cuts and cheeses in the back of the bar for happy hour, special treat. Upstairs is a nice little hideaway with it's own private bar and more seating area. But watch out, if it's crowded up there for an event, it gets hot. The bar as a whole is a limited seating and standing room but fun place to hang out after a busy day working in the Union.", "author": "Mariam Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-03", "description": "For my four-hundredth review, I thought I share a secret to you all,\n\nTila Tequila works here and she makes an incredible drink.\n\nSex in my pants!", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-29", "description": "I was just throwing down on a grillmin cheese and tomato soup when i was asked if i had gone downstairs to check the mail.\n\nI get this rush of tingly glee when i check the mail. Not because i cant wait to pay bills, or see if i got a free sample of Melon Mango Chocolate GAIN.....but for a reason all the better.\n\nI secretly wish for some underground evil organization to send me an invitation to join them.\n\nKinda like.....\n\n\"Dear Mr _________\n\nIt is at this time that Global Diabolical Shitstorm Inc, would like to offer you a mid level position in our family for a negotiable salary based on your experiences.\n\nWe feel your radioactive plate in your leg and your Beard of Loki have alot to offer our organization and believe that if you join our family, there is a very bleak and dark future for justice.\n\nIf you chose to accept, all accomodations, marketing (your persona logo and branding, as well as mysterious backstory) and evil training will be provided, after an in depth personality scan with our space age cerebral scanners. In addition to an additional undisclosed bonus power we will provide.\n\nWe have also included a CD-R of some possible theme music for you that will be played whenever you enter an esablishment. Feel free to supply your own if these arent fitting for you.\n\nYou will be expected to provide an apprentice (a ward, if you will) if you choose, and eventually earning your own nemesis.\n\nThere is alot of room to grow at GDS, and you wont have to worry about a glass ceiling. Because it isnt glass, its my mental forcefield, and youll never be strong enough to break it.\n\nWe look forward to hearing from you, and eventually working with you.\n\nSigned,\n\n_____________\n\nYes...thats what i wait for. \n\nAnd i also know this...The Owl Tree would be MY lair. Why? Aside from the sweet jukebox, the untouched 70's decor will be an amazing front for the massive panels of devices and blinking lights that beep and boop.\n\nAlso, my sidekick is going to be a black owl with red eyes named Professor Cheevers that has the ability to read minds and demolecularize people into Gardeto's Snack mix. \n\nNow if youll excuse me, i have some mail to check.", "author": "Mick F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-27", "description": "Unfortunately they don't have the owls decor anymore but the drinks are stiff.", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "I really wanted to hate the Owl Tree. I mean the original had so much character, and I kind of enjoyed being the poser hipster sort trying to be part of a really cool dive scene (calling it a scene just proves why I am a poser, at least in these circumstances).\n\nAnyway, the place closed after Bobby passed away, sometime went by and then a few months ago the guys who own Harry's (and now Bruno's) took over the joint. If you know how Bruno's used to be and have been there in the last year or so, you can see why I was ready to not like this place (in short, they sort of sucked the soul out Bruno's but it's more packed than ever, go figure).\n\nSo it was with some apprehension that I finally paid a visit to the reborn establishment. The interior has been cleaned up, but they have kept the general sensibility of the space intact, sadly minus all the great owl memorabilia that made The Owl Tree so legendary in the first place; there is a nice glass-encased memorial which does honor the history, so I'll give them some props.\n\nNo jukebox, a huge disappointment, and see my previous review for why that is so.\n\nThey are building out the upstairs, so that's intriguing, a plus for renovation without too much loss of integrity.\n\nFinally, the drinks. I suppose they are priced around what they should be for the neighborhood, cocktails ranging between $8-10. It's not for the old timers, that's for sure (maybe they could offer a local discount?). I went with their Gin & Tonic, served with Junipero and with an individual bottle of Fever Tree Tonic, so that you could mix to your own perfection. Yeah, I was kind of impressed.\n\nSo where does that leave us? Now that I've lived in SF for over 10 years, I guess I'm starting to develop a sense of time and character. Sure, it was sad to see the original bar close. But you know what, time goes on, and while this isn't a Phoenix rising, it still is an Owl.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-26", "description": "A moment of silence for the Owl Tree...\n\nIt limped along for about 6 months after Bartender/Owner Bobby's death but, it appears that it too has now died.\n\nI laughed here, I cried here, got my hair caught on fire here, and fended off many offers of cocaine here.\n\nCheers to what was!\n\n(I wonder what's gonna happen to all of that kooky owl paraphernalia?)", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-14", "description": "I have been here in a while but at some point it as my fav. place. Polish bartender is friendly or maybe that is only because I am Polish myself. Anyway, great snacks like cheese and mini hot dogs.", "author": "Magda G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-20", "description": "I haven't got much to say about this place.  It was pretty, and popular, but just kinda uninspiring.  \n\nI don't often find myself in the tendernob, but I'll be keeping this place in mind as a good place to stop in.  It's got that facade of class - I'm crazy about those ceilings and found the lounge seating appealing, but the mirrors with the white owl designed looked like they were poached from Old Navy display.  Reasonable drinks, youngish crowd.  Nothing too crazy going on in here.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-18", "description": "When I first started working for Yelp I came up to SF to spend the week and get some training. While gallivanting around town and trying to suck this fair city dry of its alcoholic contents, I passed this little dive bar and was mighty curious. But as luck would have it, Rye was call my name and we went there instead. The next time I returned to SF, I really wanted to try this corner little dive, but sadly, due to Bobby's passing it was no mas and I never got to try the little hoo hoo hoo house that peaked my fancy. Bummer.\n\nA couple years later and a few nights ago, I was out on the town showing a few new CMs the drinking ropes and a friend suggested the Owl Tree. I thought, \"Surely You Jest! Not Theeeee Owl Tree?!?! I Thought It was Closed!?!\" (Actually I don't think in Shakespeare, but blame my fingers, that's what came out) Sure enough, it was the same Owl Tree location, but sadly, nowhere near as cool or divey as the original.\n\nWith that said, however, the place is nice, but because I have an incredible sense of loyalty toward shit holes and dive bars with old men sipping bourbon, this place didn't really make me happy in the toes or the pants. Instead, it's just a nice, glam little bar in the middle of the Tenderloin and I think tourists would find it Neat-O and a welcome surprise in an otherwise sketch neighborhood. \n\nWill I be going back, sure, it's a bar, they serve alcohol so what's not to like. But as far as a top fave, nah, just kinda wanna remember the memory of the old place.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-26", "description": "Solid.\nBut I miss the old Owl Tree. Owls in every corner, old men, and chex mix. This newer version has no soul.The bartender expertly made our rounds, and the specialty cocktails include top shelf libations made with fresh fruit. But just, hmmmm. . . . phony, like that girl from high school who shows up at the reunion with a new face. When I want slick and pretty I'll stroll a few blocks over to Ambassador. . .", "author": "Kia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-05", "description": "From Eater SF:\n3) Things you would not have seen before (the C. Bobby constituent may want to shield their eyes): a bottle of St. Germaine next to a bottle of absinthe, \"Reserved\" placards on leather booths, lots of bartender cleavage, HD TV, a little velvet rope outside.\n\nVelvet Rope?!  Reserved placards!!\nTravesty.\n\n\n\nAnd yes, I'm totally going anyway.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "Great cozy bar/lounge in the heart of sf. Was with my cousin here few months ago.!", "author": "Vivek P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "A really old joint and when something is old and it's survived, it's cool.  Good drinks, good staff.  Stop in for a drink sometime before or after dinner.  It's cassic.", "author": "A.J. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-11", "description": "Jack and Ginger.  A basket of Owl Tree brand party mix and a wet-nap.  C Bobby and the tiny dog who serves as doorman.  Some things just go together.  \r\n\r\nIn-sti-f'ing-tution.", "author": "L W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-13", "description": "I like the Owl Tree. I like it a lot. We used to hit it often when my buddy lived on Pine (pun totally intended).\r\n\r\nThe sign itself is one of my favorite of all time, all places. To this day, I can't drive down Post St. without saying, \"Oh, look, the widdle owl can't stay up wiff da big owls. Him too widdle.\"\r\n\r\nActually, that was our usual slurring as we breezed this lovely respite at last call. Us too firsty.", "author": "Andy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-16", "description": "This is all you need to know about the \"new\" owl tree.\n\n1) Bring your gangsta cash roll and just give it to the bartender, cause if you want more than 5 drinks in a night for you and your company, you will be dropping either $100, or your ring finger in a napkin, your choice.   \n\n2) It is owned by the same architectural wizards that own Harry's on Fillmore, in which you need a hum-v and a light saber to move around in when crowded.\n\n3) Although the shoe box memorial to Bobby in the corner and bowl full of crunchy things is nice, it will never be the same. It looks and feels like an Ambassador light, both in clientle, decor, and price, and will probably become a meeting place for the Marina-nostra that are already heading to the neighborhood. \n\nWe're sorry Bobby. Thanks for the memories.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-08", "description": "Saturday night at 9:45pm. They keep it from getting packed. Mango mohito was delicious, an old fashion with Breaking and Entering was a lot of whiskey but drowned in normal ice so it got diluted really quickly. Very disappointing", "author": "Ojus P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-15", "description": "For anyone who fondly remembers the real Owl Tree--stay the hell away from this place. They really should have changed the name. It's nothing, absolutely nothing like the Owl Tree. I'd suggest naming it the \"Douche-Tree.\" Flat-screen T.V.s? Drinks with Blueberries in them? Surely C. Bobby's spinning in his grave. He wouldn't serve half the people I see hanging out front. I'll never set foot in this place. And it's probably good. I don't like you, you don't like me, let's leave it at that. Such a shame the old Owl Tree died with Bobby. It USED to be the greatest bar in SF.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "what an awesome bar - we wandered in here last friday night and had such a great time!\n\ni'll be back now that i know its such an awesome place. yummy drinks, swift service, awesome atmosphere.", "author": "laura f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-07", "description": "In college I used to roll with some trust fund kids, one of whom lived right in the NobLoinSquare area (because, whatever, her parents owned the building) and I always meant to move there. I adore the neighborhood. \r\n\r\nSo I've decided to move into the upstairs of the Owl Tree. I could not have picked more fantastic decor for my little apartment than burgundy shag carpets and roaring 20's dancing girls on the wallpaper. One of the many reasons why this bar is so fantastic is that boys have to use the bathroom downstairs, but girls get to ascend such a fabulous staircase to get to our special little upstairs powder room (you can tell Bobby keeps it clean and pretty because he's old school and we're ladies) that it could be an apartment all its own. My apartment. It makes you feel like a princess. It really does. \r\n\r\nAnother thing to note about the Owl Tree: if you're going to be throwing back Ketel One like it ain't no thang (because call drinks are very reasonably priced) make sure you eat some dinner before you get to the bar. Because they will bring a neverending supply of snack mix (Gardetto's, I think, which is not vegan in case you were wondering) right to your table (which is surrounded by some *fabulous* vinyl chairs that I'm sure they stole from my grandparents' den in the 70's) and you will not be able to stop with the snack mix. And I can think of a hundred places I'd rather be than a tummy full of Ketel One and snack mix.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-08", "description": "I LOVE the Owl Tree.\n\nNow, you Yelp Purists are saying the bar is starting to be overrun by \"Slummin'\" Marina Jocks who are Wannabe TenderNob Hipsters(SMJWTH).  I haven't been here in awhile, so while this may be true, I will NEVER take the owl tree off my list of favourite bars for three reasons.\n\n1. The gin Gimlet is sensational.  Very classic.\n\n2. Owls friggin rule.\n\n3. When handing us the bowl of snack mix, the bartender realized the proportion of good snackies (read: mini sourdough bread chips) to boring snackies (peanuts and pretzel sticks, I'm looking at you) was tilting towards the boring side, he (I KID YOU NOT) takes it back to pour in more of the good stuff.  He did this WITHOUT US SAYING ANYTHING AT ALL -- not that we would have, that is.  \n\nAnd THAT, kiddies, is called customer fucking service.\n\nThank you and good night!", "author": "Dianne d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "Don't usually find myself in this area but was out having sushi with colleagues on a Tuesday night nearby.  We were looking for another drink and my buddy basically spun in a circle and pointed to the Owl Tree on the corner... none of us had heard of it before.\n\nWhen you enter the ambiance is totally unexpected, it's much nicer than you would think, with comfortable leather sofas and dark wood paneling.  There are generous bowls of nicely salty party mix displayed around the bar and we even caught the very end of their cheese and cracker buffet.  \n\nThe bartender was very friendly and attentive and the music wasn't overpowering while being solidly eclectic... I think I remember hearing Gipsy Kings, Beach Boys, Def Leppard, and Prince all in a row.  Owl has a bit of the feel of a quiet marina lounge (is there such a thing?) displaced to become neighborhood bar in an area away from the popped-collar crowd.  \n\nIt seemed like a friendly crowd of people all blowing off a little steam.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-01", "description": "So Bobby is gone but the Owl Tree carries on. Here's the scorecard:\n\nThings that are the same:\nSalty Snacks\nWet Naps\nVegas-y furniture\nA shitload of owls\nCrotchety bartenders (although much younger)\nToo small martini glasses\nToo small bathrooms\nJukebox\nWeird S&M wallpaper on the stairs\nPeople bringing in food\nPeople leaving their trash\nRoller derby girls sneakily trying to smoke under the table\nUndisclosed/Unknown hours\nGroups standing on the corner totally pissed off that it's closed and now have to find another location for their birthday/happy hour/date. \nFirst-timers reactions\n\nThings that have changed:\nNo Bobby\nNo Chester\nNo live bar internet feed\n\nSame: 15        Changed: 3\nWith that score, it looks like we should still go to the Owl Tree!\n\n4/5/07 Update:  Walked by this morning and windows were covered up with a sign that now says \"Out of Busines\". Stay tuned.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Great little pub with happy hour on Tuesdays. Not sure if it is everyday or not, but worth the stop.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-03", "description": "Dammit.\r\n\r\n(stupid busy life.  *kick*) this has been one of my favorite bars on the planet but I've been out of rotation for months.\r\n\r\nThat's it.  Imma go out and buy a 40 and drive to CBsOT and tip one.  \r\n\r\nSad times.", "author": "ChubbyBunny I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-08", "description": "This is tragic.  Next month I'm heading to SF and was looking forward to a return trip C Bobby's.  My girlfriend used to live in San Francisco and this was the one place I knew about and she didn't.  I was really excited about taking her there.  I just read this morning that it's closed.\n\nIt's a great loss, both man and bar.  Here's to ya C Bobby!  Half way across the country we raise a Lone Star to you.", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "Update 3 (6/4/08): Oh, yeah. The Owl Tree is back. If it weren't for the chandeliers and the etching on the mirror, it would be a dive bar (sadly in need of more owls - I say we start donating them). The music is still great, the clientele all sang along (yay, I missed that), and the drinks are great (there's even one on the menu that's Bobby's Dry Martini). Awww\n\nI'm glad to have my neighborhood bar back!\n\nUpdate 2 (2/26/08): The sign is different! The old yellow one is pictured above, but the new one is red with black lettering and a black owl. Does this mean there's going to be a new Owl Tree bar?\n\nUpdate: There's a new liquor license in the window! We'll see what happens next - whether Owl Tree itself is reopening (however damaged) or if a new place is taking over the location. This is all I know officially - http://www.sfweekly.com/2007-05-30/news/empty-nest/\n\nMy review to make this appropriate: I love this place. It's everything a neighborhood bar should be. Great drinks, comfy seats, great people-watching and some hilarious interactions among patrons. Plus as many owls as you can shake several sticks at. It closed and I am sad.", "author": "Shawna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-02", "description": "I love the Owl Tree, and I always have.  When I used to live here and it was in its original incarnation, I adored the Owl Tree.  I appreciate the New Owner's homage, in decor and in the memorial in the back staircase,  to the dead past owner and even though it isn't the same, it is still fabulous.", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "Classy place with a great vibe.\n\nCome by after work or late night either way its a great place to lounge and drink", "author": "Ares I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-21", "description": "Who let these mother f***ing owls in this mother f***ing bar? Seriously though, this place rocks. \r\n\r\nBobby's Owl Tree oozes with character.  1000 (well maybe 200) owls of all sorts decorate this divey bar in the tendernob. Plastic Owls. Porcelain Owls. Glass Owls. Posters of Owls. Owl menus. I kid you not.\r\n\r\nService is top notch and old school. Where else do you get a basket of nuts/pretzels and a wet nap with your drink. A wet nap---now that's service. This is a must visit. Definitely one of the top 100 bizarre bars in America.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-08", "description": "I had been here before when it was the original owl tree..this version is strange--  honestly, I just don't get it. The cheesy/modern inside coupled with the old-school owl themed former self just doesn't work. The plasma screens with sports games showing are also out of place (this place does not seem like a place to watch a game...at all). They seem to be renovating a room upstairs- not sure what that will be. \n\nThe bar is way too small to come with a group of friends, so not sure why people choose this as their watering hole. Perhaps it's the memories of what it used to be that bring people back.  Not me.", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-23", "description": "Hm, there's nothing really wrong with the new Owl Tree, but with the passing of Bobby, there went the Owls.  So really it's more the \"Owl\" tree in spirit rather than in reality. \n\nThere is the funky tile mosaic owl which I do like on the exterior and the interior itself is quite nice and modern, but if you liked the old Owl Tree, it's quite the departure.\n\nThe service was good and they even had free appetizers so you can't complain about that, but this review is more in relation to the original spot.\n\nI'm sure most people who come here who hadn't been to the Original incantation of the space will appreciate it as a standard bar but for those of us who loved the C Bobby version, it's definitely not the same...", "author": "Gene X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-27", "description": "Unless you haven't realized it from reading the other reviews, this place is OWL THEMED.\n\nOne Owl, Two Owl,\nRed Owl, Blue Owl.\n\nI love bars with a little bit of weirdness! I also love that they serve cheap strong drinks here. The crowd is great. The bartenders are great. What's not to love? They even give you snack mix while you drink yourself into oblivian. It's close to downtown so you can go shopping and then stop by for a drink. Definitely a keeper.", "author": "Cindy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-28", "description": "I somehow missed the sfgate article from october about Bobbys passing. I guess i was out of town, but still. I cant believe i'll never get to go there again and watch him freak out on anyone. To be fair, sometimes he was super cordial to all who passed under the owled curtain. Luckily, Bobbys son is keeping the owl flag flying and the tree is open for biz. GO! The jukebox, ambiance, snacks and drinks are the best around.\n\nupdate: apparently the son of bobby couldnt keep the owl flag flying for long, booWHOOOOO...somebody please buy this treasure and open it back up!", "author": "rachael s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-20", "description": "Hi All, \nWell I have been out of town, on and off the last 2 years, with sick family in Miami! My name is Allyson (the blonde with the little boy Alex, now.... 23 - LOL) I was a  bartender there for Bobby (my Other Dad!!) and I think lasted the longest (for a woman LOL) I was there about 87 to early 90's anyway I have a lot of pic's not to many  of the later years!!! I am wanting to put together a slide show! I hope Chris & TJ didn't get rid of all the pictures as I know there was tons of them upstairs. Hoping Michael got a lot of those things. Nobody seems to know where TJ & Chris is (I have a good guess)!! So after all that, anyone have any pictures or know how to get a hold of Michael ..... Please let me know! I'll be checking this place from time to time!! My Heart Goes Out to Everyone! - Bobby was a very Good Man with a Big Heart (if you did your part!!) \nI'll Miss His Strength!\nAll My Love,\nAllyson", "author": "Allyson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-15", "description": "~NOEL~ the hottie behind the counter, certainly was the highlight of the night!\n\nThis place is truly incredible! has been transformed to a local hang out spot right at the street corner block! \n\nAbout a year ago, this place was nothing but then a trash hole! And at one point, was even shut down! \n\nBut, Since i was in town for business I decided to check out my old 'hood~ and fair enough~ i dropped by~\n\nAND~ I can't get myself out of it!\n\nFirst of all, the trouble wasn't my feet~\nwas m EYES! \n\nNOEL was breath-taking~ and it was the full compliment from both Gents and Babes in the bar that night~ \n\nanyways~ Its a great Bar~ great hemisphere~ electrifying !\n\nBeer, Full Bar, Wine List~  you really OUTTA come on DOWN!", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "Disclaimer: I would like to give this place 3.5 stars, but you know, Yelp.\n\nAnyway, I never got to go to the former incarnation of this place, despite always wanting to (I'm a bit of a Bohemian Club conspiracy nut).  I was happy to hear it had reopened but obviously it's been gentrified a bit in its second incarnation.  That's the bad.  The good is that even on a Saturday night, with the bar packed full of a fairly obnoxious touristy crowd, I was able to take my large group upstairs, which was virtually empty at 9pm, and remained so until nearly 11.  Feeling like you have your own VIP lounge is pretty rad!\n\nAlso, they had Hangar One vodkas, Hendricks' gin, and a bottle of the Mark West Pinot Noir open, all favorites of mine.  Yes, the drinks were pricey, but at least we were paying for good-quality liquor in them.  The cucumber gimlet was quite tasty and strong.\n\nOne major annoyance: an exasperated barback kept hassling us throughout the hour and a half we were there, chiding my friends for taking some of the cheese and salami that was downstairs up to our seats, and complaining that we had too many people (at the end we had 11 people).  I don't get it - we were being polite and tipping well, and it wasn't too crowded.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-09", "description": "This was a small casual bar good enough for a small group. I really enjoyed the ambiance. It's kind of dark but cozy.", "author": "Nhung T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "nice little bar that hovers between dive and lounge. the downstairs always seem a bit more busy than upstairs, but that's probably because people want to get to their libations faster and without having to climb those tight windy stairs. personally, i like the upstairs part much better. less crowded, large comfy couches/chairs, good music, and a good vibe. the bartender (hey shawne!) is awesome. she's always friendly and attentive. :) \n\nall in all, i like owl tree. it's nice to go to an unpretentious place without a bunch of douchebags. but that's a personal preference, of course. :)", "author": "Sally T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-24", "description": "2 star less for the full of attitude lady bartender with no personality and a bit of the divish vibe. I'm really not for the vibe. It's pretty nice actually, it's like between Irish pub and lounge. The selection of tequila and vodka was nice.\n\nThe decor looks like it's a bar for a old school steak house. It's cool though. Poleng crew took us here after Rye. I liked there alot better, and I don't think I will come back here.", "author": "Kokoro I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-21", "description": "If you sit in the front corner to the left of the door, you are in exact position to be stared down by the white stuffed owl that hangs directly above the bar. He has (had) blue eyes and a really creepy expression...for an owl.\nThings that make this place great (aside from all the owls)\n1. An excellent Gin & Tonic. And by excellent I mean stiff as hell.\n2. Chex Mix. Need I say more?\n3. The Wetnaps that come with the Chex Mix. AMAZING! I think wetnaps should come with everything. Especially in this dirty, dirty town. Why do they only come with Crustacean type food? There are dirtier things than Crustaceans, am I right?\n4. Chester the Dog. Cute dog. I like dogs in bars. There should be more of them.\n5. The Bartenders wear white shirts with bowties, and they look pretty no nonsense. That's as it should be in a bar covered in owls.", "author": "Elissa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "Dive bar meets 70s lounge... And I fall in love.\n\nAs other reviewers have pointed out, this place looks exceptionally dingy from the outside. But as the saying goes, never judge a bar by its sordid cover: \n\nFor a Thursday evening at 10pm-ish, it was surprisingly not overrun, though comfortably crowded, and we managed to snag a table. The two large televisions screening Dirty Harry were a treat (panoramic Clint Eastwood: YES!) and the Anchor Steam went down sweetly. Two restrooms -- one tucked next to the bar and the other upstairs (with cool light bulbs!). Dim lighting, comfortable and varied seating (old-school booths by the door), and intimate setting. \n\nDayum. So simple and yet so right. \n\nI'll be back.", "author": "G. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "This is a small lounge - just a handful of cozy, comfy booths in addition to bar seating and space upstairs for private parties.  I was here towards the end of the night during a bachelorette party but I clearly remember stiff drinks and a relaxed crowd that didn't seem to mind a group of screaming, laughing girls - some people even stopped by our booth to congratulate the bride-to-be and snap a photo with us.  Loved the vibe!", "author": "Evelyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-26", "description": "This place used to be a total Tenderloin style dump. Then they closed down for a long time, remodeled (probably needed) and is now kind of a lunge type place. They have jacked up the prices as well (10 bucks for a Manhattan, etc) But I usually get beer anyways.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "I'm a fan of the Owl Tree for two reasons - they  have good Happy Hour prices and  free snacks. The snack spread is probably the best that I've seen in any bar. I'm talking cheese, crackers, meat & chex mix. What more can you ask for?", "author": "Krystal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-10", "description": "Worst service at a bar by the male server, who sits down using an iPhone instead of assisting customers.  The female bartenders work hard, but unfortunately the one bartender who does not actually work causes an issue... The regulars are on the low side of the spectrum, but that isn't too unusual for this type of a bar. The one star goes to the bar backs and female bartenders that actually do work! Given the few nights a week one cannot receive decent service by someone in the service sector it is a no go.", "author": "Ginger M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "Fantastic bartender and comfortable atmosphere.  Drinks are super yummy at a totally reasonable price.  The door man is nice too!  My boyfriend really loves the mango mojito, but all the specialty drinks we tried were tasty.  If I lived in the area I am sure I'd be a regular.", "author": "Meg D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-11", "description": "I scoped this place out last night for the first time in about 3 years.  It hasn't changed much at all and that is a good thing.\n\nLet's see.....\n\nAside from the fact that I had to climb a fairly good size hill to get here I have to say that this place is all class.  Not in the way that the Ritz is class but more in a 'old school SF' kind of way.  They bartenders here (C. Bobby as well) are dressed to the T and are friendly and firm.  While the drinks are pretty spendy the service and the feeling you get being treated like a customer and not just another scum bag drunk (ever go to the hip mission bars?) is worth the extra dollar.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "Yay!  This place has finally opened!\n\nThe space is quite limited, but intimate (the owner whispered to me that the upstairs space will soon be available for dancing--- excellent news!)  The decor is too cute for Tendernob, which is actually a good thing, as anyone can love the dive price but not necessarily the dive interior.  In short, this place welcomes post fancy dinner/pre-club crowd in their shi shi attire, and us, a group of aimless Friday night rebels from the hood, in jeans and flip flops, looking to get drunk.", "author": "Jiajia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "A nice little bar to grab a few drinks after work (or after a long day of lazying around). The staff is friendly, the place is cozy, and the prices are decent. It can get crowded around happy hour and it's not the biggest place, so don't try rolling up with your 20 work buddies... but other than that, and considering other options in the Union Square area, I'll gladly pick Owl Tree over some tourist-infested pit.\n\nI never knew the old Owl Tree, but this \"new\" one is fine by me.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "Not the \"old\" Owl Tree, \nA pleasant bar just the same,\nHappy hour lunch meat.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "If I wanted to focus on the slightly pricey beers, I could do that.  The place is a little small and only one bartender can be tiresome if you aren't the person being talked to at the moment.  And yet, whether it was because I was on vacation or because they were playing the Kansas game when no one else was, I loved this little place.\n\nThe atmosphere is nice.  A little dark and classy.  Etched mirrors, nice LG HDTVs, comfortable seating.\n\nIt was a good mix of locals and tourists when we were there.  The drinks were properly strong, the music was good/eclectic when they switched it on... from Sinatra to 50 Cent to the Beatles.  \n\nHappy hour is a $1 off of anything you order which was a nice bonus.  I also liked the simple Cheez-it brand snack mix they gave out for free.  It was nice to know it was prepackaged and not mingled with random people's germs.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-23", "description": "Owl tree has been kind of chill lately. It's a good 'after work' bar that's not super duper crowded. The drinks are pretty cheap and it's central enough that you can make it a stop before going to other neighborhoods.", "author": "Klevin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "For an up and coming area this bar is making a big splash. Yes its basically the reopening of an old neighborhood staple, but its being reintroduced by the same guys who manage/own Harry's Bar off Fillmore St  and Bruno's over in the Mission. I plan on swinging by soon, but have been antcipating going there ever since they finished the owl mosaics along the walls outside the bar.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "Fun cosy place. Its a bit crowded downstairs, but they have some fun drinks on the menu. Not too many places with a dark and stormy. I saw it on the menu but were out of it when I got there... hmm. Had some dry cheese and some tasty meat slices. Cant beat free stuff. They could have used another bartender downstairs for a while. But its still a small place so usually 1 should be enough. \n\nI think this is a cool place to predrink with a date. Intimate, cosy, nice ambiance. Hey and its right down the street from the Cellar! Friday nights, best 80's night ever. \n\nIll be back with a date, but not with a group of friends.", "author": "Roy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-22", "description": "I've tried for years to be describe the charm of this place, to little or no avail. One long, narrow wooden bar, dimly lit, frank or johnny on the juke and the owls (yes, they exist and there is no way to short the preponderance of them) staring at you while you're sipping your cocktail. Which will, most likely, be fantastic, if Bobby has anything to say about it. \n\nThis place is decidedly old school -- the drinks are stiff, the scene intimate and laid back, the chex mix free and continuous. Coming here is a lesson in how people used to drink. \n\nOne piece of advice: know what you want before you talk to Bobby. If there's one thing he can't stand, it's people wasting his time. That's one of his charms.", "author": "Geof M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-07", "description": "While it's probably not fair to rate a place on opening night, I was fairly disappointed because I had such high hopes. \n\nTwo points are mainly for the decor and booths because the drinks were ridiculously hit and miss and the crowd was fairly annoying. When I looked at the menu I was pleased to discover they had Fever Tree products, I was not pleased when not one but two bartenders attempted to make my gin with Fever Tree bitter lemon not with Bitter Lemon but with Ginger Ale, at least I was more observant the second time and able to stop before they actually made the drink. \n\nAs for the opening night crowd, hopefully they won't be regulars because they were beyond annoying. A drunk girl and her much more sober partner literally danced into our table and spilled an entire beer on my boyfriend without so much as a sorry or an excuse me. \n\nOne point added because the bar gave my boyfriend a replacement beer to make up for the one that he ended up wearing. \n\nI will try it out again because it's close.", "author": "Tara A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-14", "description": "This is NOT a dive bar...and how dare it (or anybody) call it that, especially in a neighborhood filled with some of the best dives anywhere! It's way too fancy (updated/contemporary interior, lighting from fixtures that aren't Xmas lights, electronic music, etc.) and nobody in there is of the \"dive bar\" variety.\n\nIf you are into dives and live in the neighborhood, you don't need to be told where to go. But if you are visiting and want to hang at a real-deal SF dive with the local drunks, just march in any direction away from the Owl (or scan my reviews!).\n\nBut if you are looking for a place to drink in Lower Nob Hill that doesn't have a cover and is filled (literally; it's very small and fills up fast) with tourists that were sidetracked on their way to the Marina, then step right in to the O.T.", "author": "Derek R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "It's actually pretty classy here.  My friend had a birthday gathering in the upstairs lounge and if you get there early there will be no problems whatsoever with seating! It's a little small up there, though, so I could see it getting super packed on some nights and it will probably get hot fast... but crack a window and let the cool SF breeze come in and you'll be just fine.  Bartenders are real nice, their drinks are pretty good and didn't do too much damage to my bank account!", "author": "Mercy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-15", "description": "I don't know what I was expecting, but that wasn't exactly it.  The Top 40 came as sort of a surprise to me, and the volume was a tiny bit on the loud side for the size and decor of the place (at least on the ground floor...never quite found the other portion people talk so much about).  And for $9, the Hendricks cucumber gimlet wasn't quite worth the price.  It's an interesting concept to marry dive and lounge, but I think I'd take 5th Floor over Owl Tree for my pricy cocktails around Union Square.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-11", "description": "At least I made it to the old Owl Tree once or twice before it closed...\n\nSo we went in the other night in the spirit of the old joint, and hoping for a new bar even closer to our apartments. We are overeducated alcoholics that read books and hate you, so now you have some reference. First impressions - too much pleather, really bad music, and too many Union Square tourists speaking German. An their liquor bottles are set up with two top shelves - one vodka, one tequila. This was not looking good.\n\nWhatever. We sat at the bar, each of us ordered a Woodford Manhattan. The bartender grabbed Maker's...umm...and she poured them with about a 3-count of Vermouth. The barback guy brings them over and says...\"18.\" I asked him for clarification - these were $9 each. And they were the second-worst Manhattan I've ever had in SF (only the Asian girl at Hyde Out pours them worse). Painfully awful.\n\nNobody with soul walked through the door for the next half hour, they had a Blu-Ray dvd player running the original Ocean's 11 (because nothing shows off high-def like a film from 1960) and, except for \"When the Leveee Breaks,\" the music stayed atrocious. Also they have one toilet. So there will always be some uncomfortable Indian family in there helping each other poop, or whatever the hell all those Indians were doing in there for ten minutes.\n\nWe pounded our sticky-sweet Manhattans and went to Whiskeys, where you trade a bit of class, of which I have precious little as it is, for proper drinking.\n\nIt's a shame. My friend and I should have bought the damn Owl Tree and done it right.", "author": "That Was A Good Drum Break .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-22", "description": "What a great bar!\n\nHadn't been here since the remodel, but enjoyed drinks with friends in the upstairs lounge/bar area. Very nicely done, with little attitude, good drinks, and hip crowd.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-02", "description": "Beautiful Bar but nothing special. It was a week night tho that I went...so I expect to go back and try it out in a weekend to see what type of people really come out and play in this TL bar. \n\nI was glad to be with my friend Terika went I went, because it probably would have been a total snore fest without her...\nDid strike up a conversation with one girl which was nice - until she tried to pass her creepy friend's email address on me?! So I could add him to facebook? Weirdo. (but not a reflection on the bar)\n\nAnyway...over all...the bar was beautiful, my white wine was less than $8. I'll probably will go back to see the bar on a different night, but won't rush the visit since it was a so so visit.\n\nPs: my friend did say she thinks the bartender looks just like Antonio Sabato Junior. I kinda agree.\n\nPss: No jukebox - so minus one star for not being able to pick my own bar tunes.", "author": "Katy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-01", "description": "A happy hour favorite. This place is cozy, the drinks are tasty (blood orange margaritas - yum!) and the staff is pretty friendly.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-30", "description": "After hearing about this bar from my bf and his bar-loving friends, I finally got to check it out for myself! Before the renovation, the Owl Tree definitely had a higher weenie to ladies ratio- no longer! While the interior still has an old feel, the crowd's much more balanced now. Inside is very cozy and they even serve you snackies (which my empty stomach GREATLY appreciated!). You can help yourself to some salami, crackers and cheese and some nice bartender even came around to give each table a small bowl of Chex Mix! \nI'm a fruity disposition type of girl so I was drawn to their blackberry martini and pomegranate martini. I asked the bartender which one she recommended. She suggested the blackberry because it's made from fresh fruit- mMMmMMmmm she was right... it was gooood and I could barely taste the alcohol. \nI'm bound to return. It's in a great location, it's filled with a good crowd, the drinks are tasty and the customer service is great! Go Owl Tree!", "author": "Amanda W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-24", "description": "To be fair, the ambiance deserves four (and a half?) stars. \nMaybe I just haven't been around long enough to see one, but I've never heard of a vodka gimlet. Had to ask that it be made with gin. Not a huge deal really, but given that it is *that* part of town and even middle shelf drinks run upwards of 9-a-pop, I tend to expect a razor sharp bar tender.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "Just went there for happy hour and it was perfect. Was meeting up with a friend's parents visiting from Scotland. It's divey, classy, comfortable, laid back and elegant all at once. Comfortable seating area, friendly staff (even after our Scottish friend left a $1 tip on 4 drinks - it was almost like she looked at him and kindly silently said, It's okay, you're Scottish and we know your friends will come back). And we will definitely be going back for a drink after work.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-22", "description": "This is an SF institution and by that I mean you feel like you're the only one not swallowing the pills while everyone else is drinking the koolaid.  Bobby's a real hoot. Awww Johnny yer killin' yerself. \"I'm here 'till Tuesday.\" Okay, enough w/ the funny stuff. Bobby will serve you right. Jack and cokes or whatever your poison. He's been there forever...and so have many others. Good ol' school place to start the night out right. \r\n\r\n2 duckets for Bobby, 1 ducket for the drinks, 1 ducket for the owl.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "I've only been here a couple times early in the week and on a Sunday.  I unfortunately never made it to the original and my thoughts go out to Bobby.  \n\nThat said.  I like this spot.  It was low key, the decor is slick but relaxed.  The bartenders are pretty attentive.  Drinks were solid.  The one Tuesday I stopped by it was relatively quiet but by 11:30 it was jam packed.  Apparently many of service folks (e.g., bartenders, chefs, restaurant folks) pack the place early in the week nights.  I'd definitely keep going back.", "author": "Rafael s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-17", "description": "This is my first review for a hetero bar, (I'm sure there's terminology that's hipper, but it's the first word that came to mind), never fear, yours truly , still fearlessly walks the rainbow.  Seriously though, I've been here twice, both for get-togethers with fellow co-workers and I've really like the vibe here.  When there not playing some sports related program, they'll play a movie filmed here in San Francisco, always an interesting addition to the ambience of the bar.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "Had the feel of an olde-time \"supper club\" bar.  Dark.  Small.  Our group gathered after dinner in the back at a large booth.  Prices seemed fair.  I liked it!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "As most Yelpers noted, props to the Happy Hour with its fine spread of cheese, crackers and meat and, most importantly, serving utensils. Snacks are always welcome but these are Tier 2 munchies baby (Tier 1 is hors d'oeuvres like tuna tartare, mini empandas or pigs in blanket of course). Renovated fairly recently, the classic leather booths, mirrored walls and red carpeting do provide a pretty enticing place to meet up with friends. Angela the bartender was attentive and proper. This bar joins my short list of bars to hang at!", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "Fresh blackberry martini, \"the laughing policemen\" on tv, sat downstairs at the bar and had a lovely time.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "Yelp Drinks definitely pointed me and my friends in the right direction when we were looking for tasty, stiff ones (that's what she said) and a place where we could all meet. Owl Tree is mos def a spot the homies can relax and enjoy happy hour. It felt like I was riding in a fancy train car, with all the lovely mini chandelier sconces and wood paneling. Comfy lounge seating, complimentary cheese and crackers, and amiable service--enough to be a competitive establishment in a city of awesomeness. Might be a little on the cozy side if you have a bigger group, but rubbing elbows is all a part of the fun. Will be back the next time I visit the city.", "author": "Dee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-14", "description": "DO NOT PISS BOBBY OFF!  I got sloppy in this joint and forgot to always respect my elders, especially when they run the greatest dive bar in SF which coincidently is in the crap neighborhood of downtown, and got my drink tossed and my ass excommunicated from what I thought was safe territory.  This place is easily a 5, but I dont want to give it away to easy grazers.  This place is a world of its own and everything about it is just plain great: the guard dog, the mix, the drinks, the total slave bar keeps under B's ever watchful eyes.  If your kid is a trouble maker, forget boot camp.  Send him to be a bar back and server at The Owl Tree.  Its almost painful to watch when he is reallly pissed.  The hours are a pain in the ass too in the winter but keep trying, this place is a jem and I hope Bobby lives and works to 150.\n\nUPDATE: The world has lost another wonder.  RIP Bobby and The Owl Tree.", "author": "Porfirio R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-02", "description": "Not the greatest bar  so it doesn't get the vaunted fifth star but it was a nice little spot. Friendly staff, clean environment, decent drinks and decent prices.  Doesn't try to rip me off on beer.\n\nI actually prefer the dive bars to the fancy schmancy bars but this place is cool.  Relatively laid back.  You can go in with some friends, grab some drinks, chat.  Music isn't blasting so talking doesn't involve yelling at each other at the top of your lungs.  \n\nNice place.  Generally well recommended.  Go, drink and be merry...", "author": "Aron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "My favorite bar in the City. How can you not love a place that serves $3 Blue Moons everyday and offers a free plate of crackers, cheese and salami to boot? Dim lighting creates a cool vibe and the bartenders are some of the nicest folks in town. The music selection is the best and is all over the place in a good way; which is why this place rocks. We're talking Ice Cube to BeeGees;Stone Temple Pilots to Manilow. Voytec makes a great martini and remembers your name several months later. My kinda place.", "author": "Rick W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-20", "description": "Neighborhood pub meets ritzy touristy SF district.", "author": "Sushi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-21", "description": "Bobby serves up a stiff drink.  I'm not sure my gin & ginger had any ginger at all.\n\nLove the owls, love the comfy chairs (I think my grandma has something similar), and love the quirky cute bartenders.\n\nEDIT:  I was at Bobby's last night  and Bobby told me my drink (whiskey sour) sounded \"yummy\" and had the bartender make him one too.  ...Swoon...", "author": "Katie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-28", "description": "I walked up to the owl tree early on a fri night and the bouncer put his hand up in my face to tell me to hold on. Really?  All I did was peacefully walk up to the door. I'm not trying to run past you or anything. Tell me you're full at the moment or handle it any other way. Dont be a jerk. I will never ever go back to this bar!", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-09", "description": "I love this place, and I love living right by it. I think the bar is called the Owl Tree, because Bobby is a hoot! I have seen him take an order and refuse to make it because it he doesn't want to. He has insulted people, kicked people out and just plain ignored them. What's not to love. The Owl is back open on a regular schedule and I couldn't be happier.\n\nUPDATE: July 2008\n\nWell, a lot has changed now that Bobby has passed away and the drug addicted son moved into the bar. It's now been sold, and reopened. Thank goodness! It is a great neighborhood bar, much like our \"extended living room\" in the hood. There is a great crowd everynight of locales and tourists. Check it out, and I guarantee something crazy will end up happening to make your night just a little bit better :-)", "author": "Jason D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-14", "description": "The only word to describe my experience at the Owl Tree is...ODD.\n\nWalked in with my friend (we're both young asian women), as soon as we stepped foot into the door an old rich guy in the corner with a girl on his lap yelled to the bartender to make us his 'famous' shot.  Consisting of red bull and some tangerine thing.  I can't even remember.  It was good and all.  Then we walked over to the other end where there were ODDLY serving salami, cheese, and crackers.  Two more guys felt the need to approach us.  Of course it was one of their birthdays, OF COURSE, and we had to take birthday shots with them.  Didn't bother them at all that we were in our early twenties and they were hitting 50.  We proceeded to leave when one of them ran after us to hand us a bowl of mixed nuts.  Hmmmm...", "author": "Tammy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "It had a reasonable choice of drinks.\nIt was relatively quiet.\nIt was relatively dark.\nThe decor was not obnoxious.\nThe price of a shot of Oban was obnoxious.\nIt's got an odd, but amusing choice of theme.\n\nThey played \"Let's talk about Sex\", AND \"Baby Got Back\" within 1 hour\nof each other, which was an interesting choice of sound track to a \n1st date.", "author": "Max R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-17", "description": "Nice atmosphere: quiet, chill. Very limited seating.", "author": "Catherine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "This place is great!  Free Chex mix at the bar and I'm an instant fan, but I would avoid the meat and cheese plater, ya never know where all those hands have been!  Drinks are mixed well and priced just about right.\n\nI really like the cozy upstairs bar, cash only, so if you are paying by card make sure you get your drinks downstairs before.  Grab a seat and relax.  Fun times await.", "author": "Ethan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-12", "description": "Cool bar with cool owl style. Love all the owls on the mirrors, and the staff is super friendly. I wouldn't say this is the coolest bar I've been too, but I have enjoyed my time here! Not digging the ridiculously long lines for the bathroom- I think there was only one stall? But the upstairs area is cool-hot and sweaty- but cool for private parties.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-05", "description": "The owner just bought us drinks!  No idea why!  Yay!\n\nAlso, the bar back Lupe is amazing!\n\nThis is awesome!\n\nYay!", "author": "Dee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "Small, but cozy place to chill with close friends. Friendly mixed crowd and bartender makes good drinks. Try this place if you want to stop somewhere to grab a quick drink or two before your next sf destination.", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-22", "description": "I went here last night after a thwarted attempt to get into the Ambassador.  Being unwilling to wait in a huge line on a Tuesday night in the pouring rain, we wandered around until we came across the Owl Tree, and I'm glad we did!  It had a great feel to it-- comfortable seating, a good atmosphere, and reasonably priced drinks.  I'll definitely be back on a different night when the upstairs area is open!", "author": "Erin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-16", "description": "I was a huge fan of the old Owl Tree as I'm sure a lot of folks were and was curious how the new Owl Tree was.  I have to say that it looks pretty nice and the bartenders are friendly but it doesn't compare to the original.  It doesn't help that I was stuck next to a local who wouldn't stop chatting my ear off when I wanted to have a conversation with my girlfriend.  The drinks were rather expensive too.  The best part of the new Owl Tree was the memorial to Bobby which you'll see when you head to the bathroom.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-08", "description": "There were no seats at The Hidden Vine, so my friend and I decided to try this place across the street.  It was exactly what I was looking for on this particularly glum Thursday evening: a dark, quiet bar in which I could drown my sorrows in a tiny but potent whisky sour.  When I finally looked around and noticed the kooky owl theme, it cheered me up a bit.  Thank you, nice bartender, for bringing over the free round of drinks!\n\n5/07 - Huh, it's closed.  But what will become of the owls???", "author": "DD B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-16", "description": "Talk about a gem in the rough. Now granted my friends and I had just been irritated (ahem, rejected) by the bouncers at Slide, but I found Owl Tree to be a delightful surprise. My first impression was not good. Only one bartender (a hot woman with boobs that were too big for her body...not that I'm complaining) who seemed to be serving too many customers by herself. But within a couple minutes she came over to me and served me the best mojito I'd ever had - perfect muddle of mint, sugar and rum!\n\nI suppose the experience was made by my friends but the mood was chill, noise was fairly loud, and this place was comfortable. Drinks weren't too expensive either (not all that cheap - $17 for two mojitos). The bartender was even nice enough to serve me first for a second round.\n\nI'd come back again.", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-17", "description": "I am a huge fan of owls, beautiful creatures.  This bar has tiled walls outside of the bar designed in the shape of owls, etched glass owls inside, the remains of the original owl decorations encased in a glass box from original bar before the owner passed away and they redesigned the inside.  This bar is on the classier edge of the scope of bars, not a dive.  Therefore, a bit pricier fancy drinks.  I had the pomegranite martini which was delicious and the leche pineapple martini, delicious.  Great jukebox and the music that I can recall playing was Eminem & Michael Jackson.   They had a small screen television showing sports. The bartender and other employees were really nice. There is an upstairs bar but it was not open when we were there.", "author": "Dayna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-27", "description": "I wanted to like this newly renovated dive bar for my friend who was eager to take me there since she has fond memories of the old Owl Tree.  However, the whole place was way too Union Square meets Powell Street for me (too small, too expensive, and too close to all the crazy tourist activity).\nWe tried the pomegranate martini and the straight up martini- neither was very big for the price and  both were only \"eh\" for flavor- and how can you mess up a regular martini?", "author": "Holly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "great happy hour, free meat and cheese plates, free pretzels, affordable fresh-squeezed cocktails, nice bartenders, nice crowd, what more do you need?", "author": "Mark A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-31", "description": "I'm just sad that the current owners kept the name of the Owl Tree. It is a bastardization of C. Bobby's Owl Tree which was my favorite bar downtown for many years. From what I can tell, nothing survives from the old Owl Tree. The current owners vandalized the space by replacing the noir-y  1940 black vitrolite storefront with those cheap tiles and stripped the interior to make it appeal to pop collared, valet-parked, douchey/fratty Marina transplants, who appear to be the main clientele at the present. This bar was one of my only beach heads north of Market Street and now it's gone. I wish I had gone in with my friends to buy it when C. Bobby died a few years back. We didn't. We're lame.", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-02", "description": "SEE IMPORTANT UPDATE BELOW**\n\nC Bobby's - \nscene: \nc bobby face down on the bar. enter hipster girl with backless dress. \n\nCbobby: \"Put yer shirt on - this ain't no tittybar\"\nHipstergirl: \"Whatever\"\nCbobby to young buck bartender: \"Get her the f*&^$ outta here.\"\n\nEnd scene\n\nCbobby's: Naked lady wall paper, a pink ladies room, and owls.\n\nBY THE WAY\nI have a hypothesis about the Owl theme - I used to assist a Bohemian Club member.  You know: \"Weaving Spiders Come Not Here\", crazy powerful worldrunners, the annual July encampment  up in the Russian River, all the drunken pagan crap and no ladies allowed while they figure out who should go to war and who should buy what country but HERE's the relevance - \n\nTheir mascot is a GIANT OWL.  \n\nTheir building is the brick building located cattycorner from the Owl Tree.  If you walk up the Taylor side and peer inside the entrance on a night the Movers and Shakers are hanging out together, you will see the GIANT OWL that watches over all it's Bohemian Club children.  \n\nAnd my husband says there is no connection.\n\n***IMPORTANT UPDATE\nhttp://www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2006/10/12/BAG61LNO301.DTL\nC Bobby has passed away :(\nA funeral will be held today, October 12th, 2006, at 7:30 p.m. at Halsted N. Gray-Carew and English mortuary, 1123 Sutter St., San Francisco. \nGod Bless Bobby.", "author": "Robyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-14", "description": "If you are scared of owls or do not enjoy large beady eyes staring at you, I would not go to the Owl Tree Bar.  For the rest of you that don't mind Owls, this is a great old-school bar in the middle of many new modern bars.  It is a place you might find in Fargo or Kalispell.\n\nOOOO!  OOOO!", "author": "Lulu B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-11", "description": "I do love the Owl Tree.  The eclectic selection of music on the jukebox would be discordant anywhere but here.  The clientele seem always to be friendly, not in your face friendly, but laid back and easy, the whole scene - unpretentious.  \n\nI see reviews claiming it's now been \"discovered\" by the city and the subsequent prognostications of doom and degeneration at the hands and feet of the trendy masses.  It does not seem to have changed yet and I sincerely hope it will not.  I have a feeling that between Bobby's rumored ferocity and the decor somewhere between my Grandmother's curio cabinet and old gritty San Francisco swank that the trendy masses will be deterred at the door.", "author": "E R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-26", "description": "Owl, Owl, wherefore art thou owl?  The answer: On every single painting, etching, or photograph suspended on the walls.  Very cute bar  with a nice, rosy-hued 'n cozy ambiance.  On the evening my friends (and no, I didn't pay them to accompany me) and I set foot in the place and secured a corner table, the waiter approached us to take our order and returned with a delectable basket of Gardetto's snack mix.  We munched, sipped, and chatted over the blues music being played.  An hour later, we sauntered out, relaxed and content.\r\n\r\nAddendum:  If you are looking to \"scope out some hotties\", then this is definitely not the place for you.  Well, not unless the qualities which you seek  include acute noctural vision and head rotations of up to 270 degrees in either direction...", "author": "Momo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "Enjoyed happy hour here this past week after a long day of being funemployed..I appreciate places with $3 drafts, although I wish they had more choices. It's got a great vibe, and I hope to check it out more often.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-20", "description": "I really wanted to give this place a four-star rating. And I believe after I visit the Owl Tree again it will grow its fourth star accolade.\n\nAfter an evening full of wine and more wine, the Owl Tree was the perfect transition back to my typically beer-filled life. Service was quick and the bar wasn't too packed. And the people watching was exceptional.\n\nAlso exceptional was the jukebox. At one point Fiddler On the Roof started playing, in true tribute to the randomness of this little dive.\n\nI predict C Bobby's bar will become a regular on my beer circuit. And I hope to one day add an owl to the mix.", "author": "Josie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-18", "description": "WHAT HAPPENED?!\n\nMy friend showed me this place sometime in 2005.  It was a Thursday night.  The bar was full, a couple of the tables were taken, that was about it.  It was a calm but fun atmosphere (hard not to be fun when there's hundreds of owls scowling at you).  The bartenders were attentive, fun and mixed a good drink.  They gave you Chex Mix and little wet naps when you were about halfway through your first drink.  I went a few more times after that, and it was pretty much the same.  Once the owner was there with his crabby little dog.  He yelled at the bartenders and they were good-humored about it.  He thought I was sitting at a table with 3 women whose large boobies were hanging out all over the place and gave me the round I was buying free of charge.  He was annoyed when I went to sit down with my boyfriend and our male friend.  We still got great service, good drinks  and Chex Mix, though.\n\nAnd then I went a couple weeks ago.  The drinks had grown in price and shrunk in size by at least half.  The place had many more people in it, almost packed, and only ONE bartender.  The bartender didn't seem much interested in anyone who wasn't sitting at the bar (we weren't), but was somewhat friendly when he finally got around to us.  No Chex Mix, it didn't look like anyone got any, though I saw it sitting there.  The crowd was mostly middle-aged yuppies who looked annoyed.  I'm not the kind of person that really goes to bars/clubs that are filled with young and \"beautiful,\" so I don't mind the middle-aged yuppies, just the drink prices that tend to come with them.\n\nSo...I might try again on a weeknight, but I don't know.  I think people are more aware of its existence than they were when I first went and it's turning into a normal FiDi overpriced tourist trap with runoff from Ruby Skye (ew).  Too bad, the decor & the jukebox are fantastic.", "author": "Ljótur H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-24", "description": "I do miss the old Owl Tree Bar, but I'm glad that they've at least kept the name (even if there's nothing owl about it).  The renovation is good.  I like the mosaic outside and the interior is cozy enough.  I've only been once and early--my preferred time to imbibe.  \n\nI did have a chain-store sense and the bar-back confirmed it when she mentioned she was temping from another of the owner's establishments.  My drinks were fine.  Nothing to write home about, but not bad at all.  \n\nThe memorable exchange for me was watching a patron micromanage the creation of his drink.  \"No, more freshly squeezed lemon.\"  \"A bit more Cointreau.\"  The patron's face was familiar, but I couldn't place it for a time until he thanked the bartender for the drink.  It was a great bartender from Tosca's!  I wasn't sure what to be more embarrassed about--one bartender manhandling another or the willingness of the bartender to be so cowed.  \n\nAs (a few) other reviewers have noted, there's nothing really wrong with the new Owl bar, but it's terribly vanilla right now.  I hope with a bit of time it will build more character.", "author": "QuodE D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-15", "description": "Love this quirky dive.  Great for late night cocktails.   Great staff too.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-29", "description": "**FYI** there IS a minimum for the Swanky Upstairs Lounge and it's ONE THOUSAND DOLLARS. Apparently it's non-negotioable, it doesn't matter how long you are there and how many guests you have.", "author": "Eva T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-22", "description": "Well it is a scene now. They've done nice things with the place, but... not the place to duck in for an intimate nightcap.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-16", "description": "When I loudly announced how much I was in love with this place and how I was going to steal a menu as a souvenir, the bartender took that as an invitation to take away all the menus from ours and all surrounding tables.\n\nUnfortunately, this place was discovered and now it's overcrowded with the kind of people who would normally never set foot in the Tenderloin, except, of course, for the Hip Quirky New Bar.  Kinda sucks, you certainly can't get a table anymore.  Go back to the Mission and take your emo haircuts and white belts with you!", "author": "Frankie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-07", "description": "R.I.Temporaneous\n\nLiked the exterior lighted sign with the Owl.\n\nInterior totally creeped me out with all those nocternal eyes...tooo many voyeuristic feathered eyeballs..without a shred of intelligent conversation to keep it fascinating.\n\nmaybe go in with a bookworm to catch the attention of the wise h-owl.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-05", "description": "The new Owl Tree gets only one star for destroying the old cool alkie dive bar that I loved. \n\nOkay, okay, I'll give them a second star for using Fever Tree mixers and having high quality booze. I fully admit that if you didn't go to the original, you won't know what you're missing and will probably love the New Owl Tree.", "author": "Rochelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-19", "description": "This is a great spot to grab a drink upstairs. The couch was open - which is a huge plus for me!  I have to say in my older age...now that I've hit 30...I have come to treasure a bar with a place to sit.  Especially when I wear uncomfortable shoes! So being able to chill in the back on the couch upstairs, with a not-so-crowded bar close by...good stuff.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-08", "description": "\"The greatest bar in the universe.\"\n\nBobby & Chester - the coolest. \nI always think of owls on a Friday, just now in the wrong place. \n\nHappy Trails C. Bobby.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-01", "description": "You know when a certain bar is a personal bar when the bartender doesn't have to ask you what you want to drink...AND...the bouncer knows your name and greets you with a hug.  My drink is always just right and the bouncer is always looking out for me!!! The bar-back always refills my snack bowl...and I just feel like I am home.  This has become one of my favorite spots these days....and I highly recommend it.", "author": "N F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "I guess people really like the old style, but I can only tell you about the remodel.  It's has a very cozy feel with dark woods, nice bar, with booths along the edge.\n\nThere seems to be an upstairs, but never ventured up.  It looked scary.  There's only one bathroom that everyone has to share.  Friday happy hour included free crackers, cheese, and sliced cold cut meats.\n\nThe bartenders were friendly and the drinks were reasonably priced.  $4.50 for Blue Moon and 8 for mixed drinks.  Both were good.\n\nIt's a good place to hang with friends and catch up.  If you don't like em just watch the two flat panel televisions.", "author": "Po L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "Super cool, chill atmosphere. Great vibe, decent music playing with a nice mix for all. If you're looking for a gem of a \"dive bar\" this takes the cake. You won't regret going in. Four stars only b/c the female barkeep seemed annoyed when I ordered my drinks since I am not a local. Everyone else was cool.", "author": "Tyler A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "Great bar, awesome jukebox! Popped in around 10pm on a Friday night based on the proximity to my hotel and the Yelp reviews. As usual, Yelp never steers me wrong. It got a little loud toward the back of the bar, but since the music is so fun, it's hard to get annoyed. I could wax far more poetic about my evening at Owl Tree, but let's just say we stayed 'til just about last call, and I'm rarely in a bar for that long. Ah, yeah. Good times were had by all.", "author": "Avitania B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-09", "description": "It was a better idea for Hollywood to make \"The Dukes of Hazard\" into a feature film than to butcher the memory of this once great bar with its new incarnation.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-08", "description": "Hoot hoot don't pollute...my ears with your horrible music selection, whoever is in charge of music needs a new job! Drinks are ok, crowd on the weekend is so/so - douchey.", "author": "Rachael Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "I love this bar! It's definitely a new favorite in SF.  It's small and quaint and can be filled with tourists as it's on the corner of Post and either Mason or Taylor.  The atmosphere is dark and loungy, and they have the cutest little mini-chandeliers on the ceiling.  Apparently, it's called Owl Tree because they used to have a bunch of stuffed owls inside the bar.  The music is pretty quality too, as they play anything and everything from 80s to new indie rock.  Only issue is that it's a bit pricey.  $9 for a glass of semi-decent wine?", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-26", "description": "I almost got ripped off here, but twas ok. I called them on the bad math and they admitted fault right away, yay for good people. Boozes Flowed and I went home /w a special someone. Its a good drunk test methinks, if you forget math you've most likely had enough. Heavy handed drinks help happy too. mel brooks movies make any bar better, and this place was rocking them.", "author": "Jab U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-25", "description": "I am reviewing this bar out of spite. It sits at the end of the block I live on, a reincarnation of the former Owl Tree, though the two bars share nothing in common except location and an owl-centric decor. The New Owl Tree is a gentrified version of an actual bar, complete with extravagant fixtures, over-priced drinks and stripper-like bartenders with big fake tits. \n\nAs I was saying, spite, only because I walked by everyday salivating with anticipation for my new neighborhood bar to open up just 30 feet from my front door. Instead of a neighborhood bar I get a Union Square leech bar that easily prices itself out of my after-work happy-hour options. \n\nCongratulations, proprietors of the New Owl Tree, you've done your part to expedite my neighborhood's transformation into a shiny pile of unoriginal, uninspiring shit. Cheers.", "author": "Phil D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-05", "description": "C Bobby is unfortunately deceased as the original owner, his sons have picked up the torch at this superb little bar that makes you feel relaxed & at home. It has an East Coast feel with an excellent, old-school jukebox. Do not miss an opportunity to pass this ternder-nob gem up as it sometimes has odd hours of being open.\n\nI may get criticized as a Marina Type in the TL because I trend towards the preppy side however you should know if you want to be a snob:\n\n1) I live in SOMA\n2) I was born & raised in SF. Most of the 'hipsters' are transplants.\n\nAnyway Owl Tree is in my top 5 favorite bars up there with The Bucanneer and Tosca.", "author": "M P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-28", "description": "Amazing!  This place is my new favorite hang out.  It has two floors and is small, but very cozy and inviting.  I loved the decor, vibe and music...upbeat but not over the top or too loud.", "author": "Megan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "Loved this little bar, the decor is very subtle and dark which I love, and the bartenders are knowledgable and quick with the drinks...plus they have bar snacks (it's a good thing as martha stewart would say)", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-14", "description": "Since I've lived in the neighborhood for a while, I remember Bobby's Owl Tree. The reincarnation is very nice, very comfortable, etc. I honestly think if this glorified dive bar is going to stick around through the economic downturn, they need to start pouring heavier or reduce the prices since $9 for a mediocre cocktail is too much. My friend and I had only a slight buzz on, and that was after spending $60 on fruity cocktails. But you know, the tourists love it and they seem to think nothing at dropping too much doe on drinks.", "author": "L v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-05", "description": "I am sincerely torn about this, as part of me SO appreciates the obviously respectful nod to our (drunken) past. However ... given the former Owl Tree was an institution that simply cannot be replicated, perhaps a new name may have better served our collective closure. When Esquire singled out the old Owl as the 'Best Dive Bar in San Francisco' a couple of years ago, I remember how genuinely pissed-off Bobby (the owner) was over the attention, so in a way, this new incarnation would ironically be his worst nightmare come true. Regardless, it's here and quite snazzy now, and does make a great addition to the neighborhood. And for the record -- should I ever own my own home, I plan to chip away that awesome abstract-mosaic out front to use for a fabulous kitchen back-splash. Kudos.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-23", "description": "Screw the Owl Tree. The other day, Sunday, when it rained non-stop my boyfriend and I scurried over to the Owl Tree while waiting for Coco Bang, that Korean joint across the street, to open, and it was 4:30pm when Owl Tree's opening time is supposedly 4pm we huddled against the door with puppy dog eyes and pantomiming that we wanted to get in, and the bartender looked at us and mouthed \"five more minutes\" and held up five fingers. SCREW YOU. It's pouring rain outside and you can't let us in 5 minutes \"early\" (25 minutes late) to just take a seat while you finish setting up the bar to warm up and dry off???!!! Burn in hell dude!", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Nice classy decor, great ambiance, young crowd and great drinks.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-11", "description": "i love bobby, i love his owl obsession/collection, i love his little socially awkward dog, chester, and i fucking love this place.  you shall know me by the sound of hall and oates that dominates while i am there.  also, fantastic free crunchies/pretzels snack mix! \n\nUpdate: ATTENTION VEGANS: delicious snack mix is not vegan...dammit!  sucks because it is SO DELICIOUS!  Also, that shit ain't chex mix, it's gardettos.  bobby is all class, people.  ain't no chex mix up in this piece.  shit.\n\nactually, i take it all back.  don't come here.  go to swig on geary instead!  WAY more fun!\n\nANOTHER UPDATE: Bobby is so fucking grumpy...he kicked a woman out for not speaking good english the other night!  What an old codger!  ALWAYS go to the bar knowing what you want to order and speak clearly!  Also, know when Bobby puts on his scarf to go home that he is looking for love.  Are you?\n\nYET ANOTHER UPDATE:\n\nRIP Bobby.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "I went here on a Saturday during happy hour. It wasn't crowded so we easily got a table. The drinks were really good and cheap. I really liked the atmosphere of the place. The crowd was older but it may be different at night or during the week. However, I will definitely come back!", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "Nice small cozy bar. I expected it to be a dive bar (I think it used to be) but seating was ample and my friends and I were able to sit back and relax", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "woo-woo has a hoot of a happy hour?  why owl tree of course.  \n\nthey have non-chintzy free food (cheese, salami, stale crackers) and a swanky upstairs option for large parties in the evening, which i recommend for a birthday celebration.", "author": "jane d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-29", "description": "This is where I had my first taste of Anchor Steam!  This is a lounge type atmosphere--on the smaller side, and it's nice enough (if you can get a seat).  I managed to snag a booth with the two others I was with.  It was close to my hostel, so that's why we went here.  Probably wouldn't go here if I were a local.  Everything was A-OK because of the Anchor Steam though.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-26", "description": "It's like being in a movie - the sleaze & grittiness of the Nobby Loin (tm Ms. Lula Mae), the so kitchy it kind of makes you sick decor (owls, owls, and more owls) & an incredibly cranky old legendary bartender. And to top it off, the Chex mix just keeps on coming.  It almost hurts me to write this review. A mythical place.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "When I think of the bars in the Tenderknob, I usually picture a gritty dive bar with cheap prices, stiff drinks, and a rough crowd (both inside and outside of the bar). Yet, when I stepped into the newly remodeled Owl Tree, I had to take a second and check the sign. The plush decor, unique mirror designs, and free appetizers (I know, who does that anymore!) presented a welcoming atmosphere. The drink prices weren't inflated, there wasn't a cover, and instead of the having \"the house DJ that's trying to make it big\" in the corner, they had a good old fashioned juke box. Up until now, my favorite bar in the area was Royale, but I might have to rethink things...", "author": "Michael H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-30", "description": "all i had to do was peek in the door and realize that the wonderful old owl tree was completely gone.\n\nwhy'd they keep the name the same?  why didn't they just make it a new bar?  it's not the same at all.", "author": "Kate W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-01", "description": "So sad that Bobby passed and the Owl is closed.  So long old friend.  Please please please let someone open it back up with the same feel.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-04", "description": "Kattya hearts The Owl Tree!", "author": "Kattya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "Good drinks and free snack mix and cheese/cracker tray.\nI had the cucumber gimlet and it was pretty good and strong! My first gimlet EVER... I had to look up the word.\nIt was a cozy atmosphere with a really random assortment of music playing.", "author": "Corey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-27", "description": "Do you want stuffed owls and owl pictures on the walls, Gardetto's snack mix and wet naps served tableside? Go here.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-12-28", "description": "What was once a real bar with true character has been sold and rendered into another unremarkable human grease-trap.  It's a travesty that they still call it the Owl Tree.  I'd guess that if everyone who rated the bar before the previous owner Bobby died were to update their ratings, this place would be hovering around two stars.\n\n[EDIT:  :(   Rest in Peace, Bobby.  :(  ]\n\nI like this place.  Going there and ordering a drink from Bobby gives me a thrill that I imagine is not dissimilar from the thrill one gets from walking into a cage with a trained lion.  It is unlikely that the lion will rend your body the moment you turn your back, but it is a very real possibility.  Yes, the owl collection is dazzling, but see my review of the evil Bohemian Club across the street, note their insignia--the sinister Owl--and then go to Bobby's Owl Tree Bar and look just above and to the left of Bobby's cash register.  Do you see what I see?  Now I don't know if Bobby is a Bohemian Club member or even a sympathizer, or simply a small business owner trying to increase his revenue; I haven't had the nerve to ask.  All I know is, be careful what you order in Bobby's bar.  I've seen this lion snap at many an ignorant drinker for ordering something stupid like a \"Manhattan on the rocks,\" or Jagermeister.  As for myself, I never, ever go wrong with a super dry martini, and I always exit the Owl Tree the same way I enter it--facing the bar, with my wits about me.", "author": "Mynameisdavid M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-15", "description": "This place is sweeeeet. A coworker took me to this bar, and I was quite pleased. The drinks were good and at a reasonable cost. The atmosphere is perfect for gabbing with friends, or that significant other. And you have this retro feeling when you walk in. The owl decor might creep you out, but after awhile, you think it pretty awesome and wonder how they have this huge owl collection.", "author": "Beth W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-10", "description": "Overpriced drinks at a revamped dive bar...And the bartender was not very nice...He was to cool for skool for some odd reason?  Total turn off...But I did end up meeting some fab people their that whisked me away to the Mango Absolute party at The Clift in the Spanish Suite...so I am happy I went their since I met cool people...but I wont be running back anytime soon...", "author": "Michele K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "Walk by this place everyday on the way to work since moving to the city a few months ago and noticed last night that it was open for business! Called the peeps and sat in the back booth and reveled in the tacky-swank, kitschy decor and odd mix of music. Kind of reminds me of the Fireside Lounge at the Peppermill in Reno minus the fireside... Think I'll definitely be coming back for more!", "author": "Donna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-28", "description": "I think this place is beautiful. Really really pretty. It just screams regular spot for an upscale but down to earth neighbor. It seems to attract a mix of locals and business travelers, and it just feels classy, even though it's a bit of a dive.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "UPDATE - The Owl Tree is currently being refurbished & looks like it will reopen soon.  I'm afraid it won't be a dive bar anymore but we'll see.  I just hope they put all of the dusty owl chotchkes back.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-24", "description": "Came here for a late night drink, just as they were doing final call around 1:20 am on Friday night. The bartender made a nice amaretto sour with vodka in it. I would probably come here again after going to the Hidden Vine across the street.", "author": "Antara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-02", "description": "This place is quickly becoming my go-to bar!  Drinks are consistently great, nice (and quick!) service, and always some room to sit down and quiet enough to sit and chat.  We actually stopped in on New Year's Eve after dinner and a show and cover was only $10 which included the first drink!  What a deal!  Even on the biggest party night of the year we were able to get a seat, which was awesome.  Looking forward to seeing more of this place in the 2009!", "author": "Jaimie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-09", "description": "Blown away by the design detail from the outside to the inside. Very cool chill bar. Heard much about it and checked it out Sat night with friends.  Cool, friendly bartenders and great selection of booze. All of us loved it!  Knew Bobby (the man who owned the place before his death) and this is really a nice tribute to him. Very cool.  My friend made me cross the street to check out the outside walls. What a trip!!! Right on!", "author": "herb w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "It is dark and cozy inside. The bar seems to be lined with regulars. So I made a few new friends while saddling up to the bar. The drinks are yummy and happy hour special is always a PLUS as you get a discount. For happy hour, they offer a platter of crackers, cheese and salami. It is a nice touch, but I don't recommend eating it as it not very tasty. However, the pub mix they offer with your drink is very YUMMY.\n\nThere are sits away from the bar which is great for large groups. Music selection is awesome and at the right level so you can hold a conversation without having to shout or strain to hear each other.", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-05", "description": "My Mom is an owl freakazoid, so this place was immediately home to me.  Add to that, older men playing bar dice (the hint of Dad in the air) and I could sit here all day.  I swear I saw Beck in there one day!  I wish someone had played bar dice with me, but the owls kept me occupied for hours.", "author": "A W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-24", "description": "the charm of this odd place, and its gnarly and bitchy proprieter, is ruined by the abundance of pink collared shirts and chestnut st. refugees that now patronize it.\n\nto learn about the creepy, uberpowerful and all out scary as hell secret society \"the bohemian club\" that give the owl tree its name (the club's mascot is an owl), visit http://www.aidd.org/societies/bohclub.htm\n\n\neeeeekkkkk.", "author": "calamity d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-17", "description": "Another one star for having some dickhead verbally abuse me over my listing. And another thing -- the drinks are way overpriced now.", "author": "Darren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-08", "description": "It is with sadness to announce the passing of Mr. Robert \"C Bobby\" Cook.\nThere will be an obituary in the San Francisco Chronicle on Tuesday, October 10th and Funeral Services will be as follows:\nVISITATION:\nWednesday, October 11th  / 12 Noon - 8pm\nThursday, October 12th / after 9am - 7:30pm\nFUNERAL SERVICE\nThursday, October 12th / 7:30pm\n\nAll Services will be held at:\nHALSTED N. GRAY - CAREW & ENGLISH\n1123 Sutter Street (between Polk & Larkin)\n(415) 673 3000", "author": "graham R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-03", "description": "Went here last night for drinks after a wedding and it was great. Just what we were looking for - cool little spot, and they were really helpful with getting a table for all of us. I'd definitely go back and could see this being a regular spot if we lived in the neighborhood.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "To all those who patroned here: I feel slightly dishonest writing something other than a review (seeing that I only came by here a handful of times. I remember the kooky owl decor and not much else) but I want you to know someone may have given Bobby an unintentional (but still fitting) send off. YouTube \"I Left My Heart In San Francisco\". One of the montage videos has (among all sorts of baseball, touristy type and nature shots) a perfect still of The Owl Tree sign lit up, open for business. It's the only picture in the whole montage that didn't look like it came from a postcard. My heart goes out to you folks for losing such a treasured neighborhood spot.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "relatively close to work.\n\naverage prices.\n\ndecent bathroom.\n\nsmall and dark.\n\nLOVE.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-03", "description": "From the outside it looks like a dive bar, and that's the mood we were in to contrast a lovely dinner at le colonial.  But once we walked in, we immediately noticed there is nothing divey about the place.  But it wasn't disappointing, the place has a very intimate  feel to it anyway, still nice and dark, and the bartender was friendly, always a plus.  Not overly loud, so you can hear yourself think and talk, which is always welcome.", "author": "Marina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-29", "description": "Back in business and lookin GOOD. The remodel is respectful of the joint's history, plus the new mural (mosaic?) outside. Drinks went up some, but not obscenely. All the stuff i liked before (Gardetto's, dark wood, banquets) but in a sleek new package.", "author": "Todd B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-19", "description": "Great atmosphere for a weeknight (wednesday). The drinks weren't too pricey, the crowd was a-ok, and the staff was friendly. Good for just chillin with friends (nothing too crazy). The atmosphere upstairs vs. downstairs = two completely different worlds.", "author": "linda t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-01", "description": "like your crazy aunt's basement -- knotty pine walls, strong drinks, johnny cash, copious owls.  Owl Tree uber alles.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "I think it is kinda divey. It's quite small and the drinks are standard but cheap. Hooray for cheap booze. Although the part of the night spent here is a bit grey, I enjoyed the intimate atmosphere.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-17", "description": "I had some very good times here. First wandered in with my old friend Suzi about 3 years ago and have had a fondness for The Owl Tree ever since Bobby gave me a bowl full of pretzels and other assorted snacks. He was cool. That bar was really cool. I had an Owl Tree revival a few months ago when I started coming back more often after work. Took the great Jess(ica) here on the night she revealed she was leaving town for greener pastures up north. It was a fitting place to say goodbye and I'll always think fondly of the days and nights up in the tree. Stay classy, Owl Tree. I know you will...", "author": "Benji T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "Now, full disclosure, I was so drunk by the time I sloshed into this bar that I don't remember much of anything.  I do remember that the sign outside is really cute.  I am taking off one star because I think a creepy dude hit on me, yechh.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-06", "description": "Good place, drinks are cheap for downtown, crowd wasn't annoying which is difficult to find in a downtown City bar. Bartenders are attentive, ...and gorgeous, which doesn't hurt anything.  Minus one star for the complete and utter lack of ventilation which makes it 1000 degrees in the bar. Other than that was a nice night... drank 3 beers and felt like I'd had a ton more, which is good for those of us on a budget.", "author": "Mckay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-30", "description": "At one time in my life I spent 4 nights a week at the Owl Tree.  I was prepared not to like the place when I walked in. I was wrong, sure its not the old Owl Tree but Bobby is dead, it could never be the old Owl Tree without Bobby. \"Get the fuck out of my Bar!\" He was priceless.  The wet naps and bowls of mix are gone. The furniture is changed but it remarkably a similar feeling room.  There's a great shrine to Bobby on the stairs leading to Bobby's old office and the ladies room.  I was disappointed there was no urinal filled with ice and powdered hand soap.  I think Bobby would approve of the joint.", "author": "all seeing E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-08", "description": "You all forgot the best thing and I will cry if the Owl Tree re-opens and does away with the mack daddy Chex Mix.", "author": "patrick g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "I like this place.  The people seem different every time I've gone.  It can fill up fast and I like to sit when I go to a bar if I'm wearing heels.  It's dark, mellow, the music is fun and the drinks are good.  I like coming here after eating at Ryoko.", "author": "Carmen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-21", "description": "This place was supposed to be cool a long time ago, when Bobby was the owner and the bar was called \"Bobby's Owl Tree.\"  But I think T. Pain or someone took it over cuz now it's like \"I'm in da clurb\" at the Owl Tree.  The architecture is really beautiful inside, and the windows are great and blah blah but really it's the Marina that comes in here to shit in my drink and yell at the TV.  And the music is like autotune shit hop and music my mom would dance to to feel groovy (see light rock for less talk).  One star for pretty light fixtures and cool ceilings and one star for the upstairs sex lounge.  Ok, whatever, the little room upstairs with a bunch of cushion things to sit on and white curtains and little lights.", "author": "Liza W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "Put on your t-strap shoes, grease up your pompadour, grab your clutch before leaving the apartment, roll a pack of cigarettes in your white t-shirt and head on down to the Owl Tree. This bar has been around since before prohibition, and has been under its current name and motif for more than several decades. A real class act. The interior is packed with owl paraphrenalia under low lighting. Small intimate space, and friendly bartenders. All drinks include a wet-nap and bowl of chex mix.", "author": "Netty L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-21", "description": "One of my top favorites in the Tendernob--  it just OOZES tendernob. Swanky yet kinda sleazy. 1950s jukebox, overstuffed vinyl armchairs, chex mix, cigar in the dark den atmosphere. Oh yes, and stiff drinks from the bartender who can be friendly or grumpy, and his? little dog that wanders around. Poor dog and his delicate ears. They just started having a bouncer for some ridiculous reason. And the owls?  lots and lots of owls, if it weren't so great I'd assume someone went insane", "author": "Amy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-21", "description": "If you like dive bars and extensive collections of kitschy artifacts, you'll love the Owl Tree.  This place is sweet.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-22", "description": "Bobby is dead, no kidding, he died a few weeks ago. The world's best bar will never be the same. There will NEVER be another C. Bobby, nor another Owl Tree. Whatever vultures buy this joint will likely put in a large TV screen and add crap to the jukebox. I will never drink again.", "author": "Skinkton Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-13", "description": "came here for the USA vs ENG world cup match after the disaster that was the phoenix irish bar, 2 samsung HDTV's and much more relax atmosphere, and noelle slinging drinks.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-19", "description": "How have I never even heard of this bar before?  This is the quintissential great neighborhood bar.  Fun crowd, great vibe, and a bunch of freakin weird owls all over the place staring at you.  Owl clocks, velvety owls, oil painted owls, you name it.  More owls than you can count.  Yah, it's a little weird, but I like it.", "author": "Erica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-23", "description": "My new favorite spot. It's a little creepy with all of the owl eyes looking at you, but they have a pretty awesome jukebox. Paul Simon AND Whitney Houston?! It wasn't too crowded late on Thursday night, and the bartenders were pleasant to our large group. Glad to discover that it's right on my block. You probably shouldn't take the owl-shaped menus, but they do make cool little souvenirs.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-08", "description": "If this place ever finishes their remodling, do yourself a favor and stop in for a dink. Dont piss off Bobby cuz youll find yourself on the street with the rest of the riff-raff. Owls and a decent jukebox add to the flavor of a good martini.", "author": "Albert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-11", "description": "A very good straight up bar. Cool, clean, friendly. Have been here for sporting events, drinks before a movie, and entertaining family and friends and I am always pleased with my experience.", "author": "Gabriel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-27", "description": "Yet another classic San Francisco neighborhood bar scrubbed of character and history--save its stolen name and a glass-encased shrine in back. \n\nOverjoyed to hear it had reopened--a plunging heart once I entered to find the space sleekified and stocked end to end with yupsters swilling overpriced cocktails. Not the type of deja vu I was anticipating or wanting. But I guess another upscaled bar is just what this town needs. One star for at least evoking happier memories.\n\nBy the way, does anyone remember the old Blue Lamp on Geary? Cool bar which met a similar fate.", "author": "ron w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "We went in after my friends' A.C.T play. Had a good time, had somewhat of a Balboa Cafe feel to it, yet catered to a bit more mature audience perhaps...? I'm not sure, I'd have to go there again, but good first impression.", "author": "Baris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-26", "description": "More owl paraphernalia  than you can shake a stick at + snack mix + wet-naps + bartenders with ties = happiness", "author": "Brett L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-05", "description": "This is definitely one of the greatest spots in town.  If you are looking to kick your night off right or end it in proper fashion, this is the spot to do it.  From the dark decor to the well stocked jukebox, this place isn't missing a thing.  No need to slow pace the party mix, it keeps coming.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-07", "description": "the owl tree has no relation to hooters :(\n\nbut the jukebox has hall & oates and neil diamond \\:D/", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-06", "description": "The Owl Party Mix rules.  Having owls peering at you from every angle is actually quite comforting with a cold one in your hand.  This place is a hoot.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-09", "description": "Great bar.  The bartender annually contended for grouchiest in SF.  His dog would have biten you.  If it didn't, its fleas would have.  If they did not, you can be assured the drinks would, which were stiff and cheap, and if you are an attractive guy, could have been free if the bartender liked the look of you.  Sad to hear he's gone.  C Bobby's is still worth it nonetheless.", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-10", "description": "I really am sad about the news. What a special little place this is, the Owl Tree. Is it the snack mix? The lovingly created drink menus? The jukebox which housed the very fabulous \"Calypso Is LIke So\" featuring none other than Robert Mitchum? Or, the Owls in all of their glory? No, it was, shall forever be entangled with the memory of Dear C. Bobby. Was he in fact grumpy? Nope. He just wasn't all customer service fake hoochy-koo all over the place. He was a real person, and you had to show yourself as such. We'll miss you, C. Bobby.", "author": "Isabella R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-21", "description": "yay the owl tree is open. i didn't know that the roof dropped and just thought it had bizarre hours. it's fixed.\n\nit's not a dive, it's not snotty. the owner and bartenders are chatty. dark wood interior, orange candles, owl decorations everywhere. it's not too big so go early with a large group or grab the back table if on a date. just be careful of the chex-mix. it makes your breath stinky.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-30", "description": "Quite possibly the coolest dive I've ever seen. We'll miss you Bobby! I hope God can fix a decent drink.", "author": "Keith R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-10", "description": "To celebrate my 25th birthday my friends took me out for dinner and drinks after work last night. After dinner at Indonesia we walked over to Owl Tree. We had seen the bar on other trips to the city but had never gone in. I LOVE owls. If I see something with an owl on it, I want it. Going to Owl Tree on my birthday was a perfect way to make the night special. Owl Tree is on a corner and from the outside you can see a mosaic of an owl and another cute owl on the sign above the door. The bar was full but didn't feel crowded. There is seating all along the bar and also a little lounge area with short tables. There are TVs for watching games and an upstairs room for private parties. We sat at the lounge area and felt nice and cozy. It was a nice escape from the cold. I ordered the pomegranate martini. This drink is pretty and festive with a bright red color. It was chilled just right and went down smooth. I'm not sure about all of the ingredients but it was sweet (but not too sweet) and had a hint of lemon. I also tried the Irish Cider, which was delicious. This is such a cool hang out spot and the patrons all seemed nice as well as the bar staff. The prices for the drinks were average. They serve wine and beer as well.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "I like owls. I like owl tree on weeknights, but on weekends it's too crowded with men puffed-up on their own san francisco-ness. on wednesdays and thursdays, the clientele is good looking and mostly straight enough that i twice met nice men. Nice Men - an oxymoron for many a bar  - are available here, and they buy your drinks (which are surprisingly affordable anyway). Even Anthony the bouncer and the awesome bartenders are nice. Alert, alert. It's, like, pleasant.", "author": "Angela O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "I hate birds, but love owls, and I love the Owl Tree (which for some reason I always want to call Blue Owl, will someone explain why I do this?). My friend and I went on a short bar crawl through the Loin, which is quickly becoming one of my favorite hoods to hang in-hey there are some cool bars in the Loin. Our last stop was Blue Owl, I mean Owl Tree. We each had the Greyhound with fresh squeezed grapefruit juice, delish. My friend and I both agreed that they had the best music of the night playing on the juke box. The only bad thing was the annoying people filling the bar, obviously after their work Christmas party (lucky bastards still got one). Hopefully the clientele is not normally as douchey because I want to go back.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-07", "description": "I came here on a Thursday night with some co-workers, and to my surprise, I actually enjoyed the place alot!!  Its not too far from my work, so I saw what the old bar looked like, and THANK GOD,they re-did it.  The old bar looked like a hole in the wall (I apologize to those who loved it before, and not so much now).  Can't hate on the free cheese and salami; that helped keep my buzz down.  I liked how they only served Priv (yeah, get rid of the cheap sh*t!!), when I asked for Hennessy.  The lounge chairs don't look all that clean, but who cares when you're drunk and having good conversation.  I'm definitely looking forward to going again.", "author": "Gail L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-29", "description": "Judging by other reviews, we must have just been there on an off night.\n\nWe arrived just as the bar emptied out (theatre shows starting), and were able to get drinks really quickly. we decided to sit upstairs, and the angry waiter guy refused to let one of our crowd up because the drink (a beer) had been purchased downstairs. So, once the beer was imbibed, we headed upstairs, and lo and behold, they have te same beer at the same price upstairs!\n\nWe grabbed a free table, and started to relax, taking in a pretty friendly atmosphere. The music was so-so (Regulators? really?), but was low enough that we could continue giving each other shit without yelling.\n\nThen, out of nowhere, the same angry waiter dude slams down a reserved\" sign on our table. So I ask if we are being asked to leave, and his reply is: \"Not if you're ordering more drinks\" WTF???\n\nNeedless to say, we didn't order more drinks, and are unlikely to do so again.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-14", "description": "Very neat little place, the furnishings are well kept and comfortable, they have a good foreign beer selection, the barkeep is friendly and attentive.  It's a good place to bring a girl because it is pretty quiet and comfortable and very neat and interesting to look at.", "author": "Cassio P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-16", "description": "Once a dive bar gets discovered, the charm is lost. Still a favorite to visit when in the area. Seems brighter than before and the dark optical discoveries of owls were haunting instead of what is now a gimmick. No worries, still a good place to strike up a conversation and have a mini-martini. A bit pricey for the size of the cocktails, stick with shots, wine or beer.", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-14", "description": "Ungodly expensive, but, attitude-laden, crusty old bartender Bobby makes it worth it. Perhaps because I'm a masochist, I enjoy the Owl Tree. I like the website because it makes my brain hurt, so much going on to take in at once. They have a live webcam tho, which could be fun if you are a creep and like to watch from afar.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-04", "description": "I miss the way it used to be, when there would be empty seats at the bar on a Saturday night, Bobby yelling at people, the little dog tottering around, the webcam, the stale Gardetto's mix. Now it's full of cool people, the service has improved, the pretzels are crispy, and it just doesn't feel right. At least they haven't changed the cd's in the jukebox. My favorite owl is the big white one in the nook all the way in the back. Bobby, RIP.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-01", "description": "hmm, lots of owls, stiff drinks, good snacks and relaxed atmosphere. I wouldn't call this bar a place to pick up girls but they serve good drinks and have snacks. Nice if you are in the neighborhood, but I wouldn't go out of my way to go here.", "author": "Russ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-10", "description": "\"I love this place! I was supposed to be meeting friends at the Redwood Room, but I was not feeling the stuffy crowd in line. Walked up the street to find a gem! Stiff drinks, a fabulous jutebox and a cynical old bar tender, perfect combination! My friend and I have been searching for the perfect owl to add to his collection!", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-22", "description": "Wouldn't it be fun if all the owls in this bar came alive at 1AM when it closed, flew around, hooted and stared at themselves on the web cam pecking away at the Giardetto's Chex Mix?  Every owl in here (wooden, Tiffany, macrame, stuffed, metal, etc. etc.) has its own life story, at least in my head.  I love this cozy little place--a curmudgeonly bartender, delicious snackies, well-made drinks and Sinatra tunes on the jukebox.  What more could you ask for?", "author": "Vivien W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-12", "description": "Gotta love a place that has it's own obsession. I mean, macrame, painted, stuffed, drawn, weaved owls...everywhere. And you gotta love a place that's kind of low key, just hip enough, and still about a good stiff drink. A fave.", "author": "Pierre K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-27", "description": "Is a \"dive bar\" allowed to have a Web site?  Especially a site as snazzy as C Bobby's Owl Tree?  (And who the heck is this C Bobby character?  I fully get the owl part of the equation.)\n\nRegardless, I can't say I hate this dive, and I can't say I like it.  It's apathy inducing. I can say that the last time I was here, the service was shockingly slow (understaffing seemed to be the problem); fortunately, counting owl paraphernalia kept me occupied while I waited.", "author": "Hannah J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-23", "description": "Because this bar is really close to my home, I really, really want to like it more than I do.  There is just nothing special about it.  The tile outside is really cool.  The booths inside are comfy.  Its not that its a bad place...its just it doesn't offer anything better than the next place.  The old movies being played on big screen TVs is kind of weird given the place appears to be going for a more classy look (decor).  The music is also confusing; its all over the place.  I do like the bar snacks.  The bathroom is very clean and nicely decorated.  The actual bar is very small and can get crowded and seatless very fast/easily.", "author": "Rise G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "u like ur bar dark? u like ur fellow drunks sassy? and um, u like owls? this is where u need to perch. i advise getting up on the bar stool mid-day with the regulars and hoot like an owl. by nightfall, the trendy crowd comes in and u'll be juiced up to flirt. whatever u do, if u enter in the day, don't leave til' nightfall. u'll feel like a vampire. it truly is as dark as a coffin in there.", "author": "S. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-14", "description": "nothing compares to the old owl tree, but the new one isn't too shabby.  the new face is a bit swankier, and drinks are on the steeper price -- albeit poured with a heavy hand -- but the bar is cozy and is a great place to tuck into on those cold san francisco nights.  free bar snacks to munch on.  and i have to agree with some of the other reviews, one of the bartenders does resemble anthony sabato jr.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-30", "description": "love the look of this place, but the drink menu is fairly small and I was with a large group and not everyone was happy with that mainly the beer selection is weak.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-15", "description": "One of a kind. Always guaranteed entertainment, whether it's from the half-in-the-bag bartender or the crocked up clientele. Plus, you gotta love any place that's got tons of Hall and Oates and Tom Jones on the jukebox.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-16", "description": "RIP Bobby. You gave me some special memories.", "author": "derek b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-18", "description": "C. Bobby would spin in his pine hollow if he knew what had been done to his corner bar.  This space is just reactionary - it lacks any kind of soul.  The mosaic was the first tip-off while construction was finishing, but after stepping inside for a few moments tonight I know what a field mouse might sense, swallowed, inside the belly of an owl: darkness and despair.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-25", "description": "My favorite bar for reasons incomprehensible to most people I take here.  If you've ever spent as many drunken nights at Le Tigre in Madison as I have, you'd understand my deep affinity for the Owl Tree.  The owls, the dog, C. Bobby's crabbiness, the jukebox, the dark old broke-ass furniture.  The whole bit.", "author": "sunny d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "So sad to see this place go, was in my top three favorite bars in the city.  RIP Owl Tree.", "author": "Excitable R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-26", "description": "If you have a phobia of owls, I wouldn't recommend going here, but otherwise go for the decent drinks, divey atmosphere, and nutty characters.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-01", "description": "One of the many hidden jewels in San Francisco, I really enjoyed my night at the Owl Tree. This is a cool two-story lounge with bars and seating both upstairs and downstairs. Unlike some bars, which try to minimize seating and pack the patrons in like sardines, the Owl Tree strikes that nice balance of being a trendy lounge, where you are actually encourage to kick back, sit down and have a nice conversation with your friends. Big Thumbs up.", "author": "Colin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-04", "description": "When I first moved to SF in early 1980's, I stayed at the Will Rodgers Residence Hotel, just across the street from the Owl Tree. It was my favourite bar in SF. Moved away 20 years ago and just came back to SF for a few days. Last night  I walked down to the Owl Tree and saw it closed with interior being gutted.  I feel DEVASTATED- I spent many an evening at the Owl Tree- I especially loved the way Bobby would answer the phone- \"Bobby's Owl Tree, Bobby speaking\"!\n\nRIP Bobby, and thanks for the memories!!\n\nLily", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "i really liked this place! i found it randomly when wandering from the 2 bus stop to the 38. kind of pricey, certainly not going to become an every day place, but the drinks are of high quality and the ambiance is nice without being too stuffy. the bartenders and bouncer were all very nice and they entertained me and my drunk friend. delicious dirty martinis! i would definitely come here for a special occasion drink or to show visiting friends a classy san francisco bar.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-29", "description": "Average spot. Nice atmosphere. Pretty slow night though. Drinks werent as stiff but same price. Might check it out again to see if its any better.", "author": "Jameson B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-11", "description": "u like ur bar dark? u like ur fellow drunks sassy? and um, u like owls? this is where u need to perch. i advise getting up on the bar stool mid-day with the regulars and hoot like an owl. by nightfall, the trendy crowd comes in and u'll be juiced up to flirt. whatever u do, if u enter in the day, don't leave til' nightfall. u'll feel like a vampire. it truly is as dark as a coffin in there.", "author": "ray c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-19", "description": "loooove places like this~add this to your stop overs in snob hill....good crowd with various tunes playin on the ipod....if u cant find a seat on the 1st floor~take the upstairs route/more loungy with couches wit another bar..the drawing of the owl in front is a trip after a couple of gin/tonics", "author": "elmer d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-06", "description": "what a great place.  my new favorite at the moment.  the place is dark and mellow.  you can hold a conversation without shouting and the accommodations are cozy.  we spent most of the night upstairs and it has a very intimate feeling.  there are windows bordering the room but they are curtained so light is let in but privacy remains.  the bar tender shawne was an absolute sweetheart too.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-08", "description": "I stopped by with a friend who was visiting because I hadn't been to the Owl Tree since the new ownership and all of the changes.  Although I miss the old Owl Tree, the current one looks great/chic and the staff is super friendly.  From the bouncer to the waitstaff to the bartender, all were very cool and pleasant.  I hate going to bars where everyone's a downer that works there and this was the opposite.  It was upbeat and lot's of young professional men there ladies!", "author": "K V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-26", "description": "it's just my personal taste of course, but i love bars like this so much more than places like swig or rye. it has a warm personality and typically the people inside are there to relax, have a good time with their friends, and look at the owls. there are snack mix baskets that magically refill themselves before you even notice that they are empty and very comfortable chairs. did i mention the owls? in addition, the drinks are absolutely solid. the owl tree is just a real place with real people and every kind of fake owl you can imagine.", "author": "eric g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "Had drinks with my coworkers this weekend and I had a blast. It looks small outside but its a nice place to kick it friends. The drinks were good too. Even though they had my favorite beer the Blue Moon, I tried their Mango Mohito and it was great. The bartenders are really friendly especially their bouncer at the door. I would like to go back their and bring more of my friends to check it out.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-18", "description": "so sad this place is closed!! the owl tree was a little gem. very swanky.  plus the bartender gave you your own individual basket of pretzels and wet naps. c'mon now. who could refuse that?", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-14", "description": "This was my favorite bar ever.  I weep now that it has passed along with Bobby.  Those free snacky things were the greatest.  They had Johnny Cash and Waylon Jennings in the jukebox waaaaaaay before it became hip to dig them.  They were country when country wasn't cool.", "author": "gretchen d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "Yay! I'm a fan... it's a great location for us! It's casual and has that great lounge feeling. BUT!!!!! The pours are terrible! Go ahead and charge the big $$$ for your city cocktails but at least be a little more generous especially on a simple scotch rocks! We are locals... come on!", "author": "Bren E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-05", "description": "You called it Chrissie b. They've ruined it. It's enough to make him roll over in his grave. Rest in Peace Bobby!", "author": "chris g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "this place is cute. the decor is super classy, my shit doesn't stink when i drink in this bar. i like it when they open up the upstairs which is usually never... they should start doing that more often. the drinks are pretty expensive [at least the ones on the menu] but the bartender with the russian accent and huge muscles makes them strong so it balances out pretty good. overall i like this place, it's intimate and cute.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-18", "description": "the owl tree is good times. you gotta love the owls in all their glory. and the snack mix is a nice little treat. i would watching out for the bloody mary though unless you like drinking a-1 steak sauce. and i think this place has a lot of class. i sort of resent that it's called a dive bar. it's quirky fun with a dependable bartender serving up liquid magic.", "author": "joseph j."}
