{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Cute bar! It's not too loud, nor is it full of annoying hipsters. Bartender was very nice. Great small place to go to for drinks!!!", "author": "Shiny P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "This place cheats its patrons! Go here if you want to try to by a nice drink e.g. Gin and Tonic with Tanqueray and then only taste tonic water. When I raised this issue to the owner, she offered to make a new one, which was nice. However, the new one was basically the same. Total rip off!\n\nAlso, the bar is sticky and dingy. The staff are rude. The prices aren't great for the area.\n\nBasic point - If you want a pub in this area, go to the Blarney Stone across the street.", "author": "Alexei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Great dive bar to hang out drink wacky drinks and chill play darts. Bartenders are super friendly and attentive so come on by the nags head and enjoy a drink from the lovely bartenders and owner.", "author": "Timothy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "This review is solely for the rude bartender named Cat and the owner who didn't do anything about her. To start off, there's nothing special about this bar. Bf used to come here often for about 2 years because few of his friends used to work here, but ever since they quit, there was no reason to.\n\nHowever, we stopped by on St. Patty's with some friends to grab few drinks since we were on the block, and there were 2 bartenders working. One of them was a girl named Cat and the other one was a dude. My friends and I stood there in front of the bar top for about good 20 mins, but none of the bartenders noticed because they were both super drunk. The girl bartender was doing nothing but just scrambling some random papers, and walking back and forth. The guy was too busy taking shots with few girls, that he didn't bother to acknowledge other customers. Mind you, I don't care that they drink, or that they're drunk as long as they acknowledge customers presence, and provide good customer service.\n\nAfter 20 mins, we were finally able to flag the girl down and order. She took our drinks order and instead of making the drinks right away...she turned around and started scrambling MORE papers, and walking back and forth from one end to the other with an empty cup in her hand, doing nothing. So I nicely said, \"hey girl, I know you're drunk, but we've been waiting for a while\" and  she rudely looked at all of us, and said \"WHAT. YOU WANTED JAMESON RIGHT? SORRY FOR YOUR INCONVENIENCE LET ME POUR IT ALL THE WAY TO THE TOP\". \n\nAt that point, we were so dumbfounded, even the customers around us were shocked. What shocked us more was that when we tried to talk to the owner Michelle about it, she didn't bother to care and said \"oh so she felt sorry! She gave you guys double shots!\" We were so speechless... No wonder the bartender is so rude to customers. My guess is that the owner feels that she can't lose any bartenders.\n\nOne last thing that pissed me off was... before we were about to leave, I was waiting in line for the bathroom. I was next in line, and when the guy came out of the bathroom, the rude bartender Cat pushed me and yelled \"wait wait wait!\" and walked into the bathroom.....\n\nOh man, my blood is boiling thinking about what happened. We will never come back here again.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Came here for a friend's birthday on St. Patrick's day. They had amazing deals on car bombs, a free corned beef hash spread, and were just genuinely into turning it up. Best spot I've been in the Richmond.", "author": "Sam G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Love this bar! My go to day in day out. My favorite bartender is Elaine (mostly works Thursday's). Such a sweet heart and very friendly. Drinks are great (the wiki is great by Elaine). Fat shots and cheap bills. No complaints here. Michelle(the owner) is very friendly too. Can definitely hold a great conversation and is very fun to drink with.", "author": "Ada H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "The bartender was too lazy to find my brand of whiskey, and she served it to me straight when I asked for rocks.  I mentioned she got it wrong and she asked if she could put the ice in the shot glass.  Then she forgot to bring me ice. \n\nThe place is dumpy already and the lousy atmosphere was worsen by playing a FM station (btw this was a Friday night).  Radio commercials is shitty mood music. \n\nThe worst part was another patron used the N-word loudly.  Not that I want to hear that shit ever, but I was with a black friend.  That patron should have been 86'ed for being a racist POS, but he kept drinking and being a dbag for the time it took me to finish my drink and get out of there.", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Good people. Good drinks. Right on Geary in the Richmond so close to whatever you need. Just got served free peaches without even asking as I write this.", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-08", "description": "Don't bother. There isn't enough charm in this dive bar to warrant you spending your money here. The bartender was pretty clueless - cute and nice but hopeless when it came to actually tending bar. Don't order anything more complicated than an [fave alcohol] & coke. Or a beer. We ordered a whiskey sour and a bourbon on the rocks. I ultimately had to settle for a bourbon on the rocks, too, cuz the sour was a curve ball. The music was also surprisingly limited - the playlist (jukebox?) looped back to the song we walked in to before we were there for even 20 minutes. Sorry Nags Head - you sounded like a hidden dive gem but you ended up being a royal bust.", "author": "Vanessa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "Disappointment! Dive bar trying to pass off as a pub. Nothing veritably British about this establishment. My boyfriend wanted to buy me a nice Tanqueray G&T which only tasted like tonic water--even after raising the matter to the owner who made us a second drink which tasted basically the same--like flat tonic water.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "This is hands down my favorite bar ever! It may be small inside, but it creates a more intimate setting. The drinks are also cheaper than most bars. \n\nWhat makes this bar better than any other place is the owner Michelle who is always super friendly and even offers us free snacks. The bartender girls are also really fun and always has a great attitude, especially Kat.", "author": "Andy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "We brought our puppy in today and naturally asked the bartender if this was okay. The bartender said of course and was very welcoming. Being a puppy our dog does bark when strangers come too close. We had treats on the ready and let people give our pup some to help him stay calm. This always works, but he does bark a few times until he's comfortable. \n\nUnfortunately there was a shift change and the new bartender immediately told us we needed to leave as there are other customers. No complaints from anyone, the only times our dog barked was when others approached and stayed near him to pet. Everyone liked the dog and was understanding, except for this bartender. We asked if we could at least finish our drinks, but a minute later asked us to leave again. We quickly finished up and left as we felt very uncomfortable. \n\nI understand bars not allowing dogs, but there should be consistency. This has the potential to be a good dive bar, and no reason to not allow dogs as there is no food served. Unfortunately there are some rude staff which ruin the atmosphere.", "author": "Ryan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "Every visit ends in a bad experience. I live in the neighborhood and come once in a blue moon and only when I am dragged here. I love the dive atmosphere and other patrons, but I will not be going back because of some of the bartenders. The male bartender is great, but the younger bartenders need to go to John Taffer's bar science finishing school. \n\nWalked in this evening to meet up with my bf and friends and was greeted with a sour look from the lady bartender who just started her shift. Okay, no worries as I'm catching up with my friends. She comes up to me and ask what I wanted to drink. I tell her please can you give me a minute I have no idea what I want. She glares and hovers and I start to get uncomfortable so I order a vodka soda. She tells me the price and  I ask to put it on my bf's tab. Tells me he doesn't have a tab. I say alright give us a sec. Stands in front of me as if I'm going to run out of the bar with a well vodka soda. I say to my friend dang can she give me space to breath? Sorry, I'm going to give you attitude if you're rude to me. This chick was hovered like this for my entire visit. She then asked us to leave because my pup was barking all in good fun with the other patrons who had no issues with him. I asked her can we finish our second round that you just poured for us before you kick us out. Mind you my dog was there hanging out for an hour with the other bartender who had no issues with him.\n\nI'd rather go to other dog friendly bars in the neighborhood sans creepy bartender e.g. Blarney Stone, Chomp n' Swig, the Hearth and MacKensie's (Once they reopen). When you see Nags head just walk on by", "author": "Kat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "I love me a good dive bar! Especially if it's in my neighborhood!\n\nI've been going to Nags Head on and off for years! This last time, we were down the street having dinner for a friend's birthday. Decided to continue the celebration with shots of Jameson. Nags was the perfect spot for that! Everyone's here just to have a good time.\n\nI've actually never been here during the day, so I can't comment on the vibe then. But at night it's mostly an Asian crowd. In fact, I bump into people I know all the time here. It's fun and allows for catching up when I haven't seen some people in a while.\n\nThank you Nags Head for being close to home so I can easily swing by any time I want!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "A dove of a dive in the Inner Richmond. \n\nI don't often tread upon these forsaken grounds, so if I'm this close to the ocean I'm going to need a drink. At the Nag's Head the name of the game is shots. Don't believe me? Consult the neon colored signs plastering the mirror behind the bar. It's almost looks like a proud parent's fridge (if their seven-year-old was an alcoholic). \n\nNow, it's worth noting that the shots have names like \"Bubble Gum\" and \"Pinky\" so I had a bourbon and soda instead. The lady had Ciroc because she's baller. Drinks are cheap, the vibe is chill.  \n\nObligatory Title Pun: No HORSING around.\n\nMenu Readability: Those drink names are hella readable. Not that I'm enamored with neon pink. \n\nNeed to mention: Shots! Shots! Shots!\n\nWhat this place teaches me about myself: I don't really do shots.", "author": "Vivek S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-25", "description": "Friday night, 8-9ish. \nMy friend and I walk into Nag's head and I head to the bar for a drink.The lady bartender comes up and looks at me, not saying anything. I start asking if I can get a drink and she interrupts me to ask for ID. I show it to her.\n\nme: Can I get a dirty gin martini?\nher: Oh, I don't know how to make that. What's in that?\nme: Gin, vermouth, olive brine and olives. Well, what can you make? What's your specialty?\nher: I don't.. really.. make drinks.\nme: *dumbfounded*\nher: I can pour you a shot! *turns to some guy at the bar* What's in that? I can make it if you tell me how.\nhim: She's the one drinking it *points to me*\nme: *still really fucking dumbfounded*\n\nFirst of all, I get that I'm also a woman, so you don't have to be polite as you might be to the male customers who presumably are the only reason you're still employed, but some manners won't hurt.\n\nSecond, Nag's head-- what the hell? Really. What the hell? You have a bartender on a Friday night who can POUR SHOTS?! Like, she can read the bottle and pour me a single spirit into a shot glass? Did she have to go to college to learn that?!\n\nLastly, bartender--honestly, you are an embarrassment to women and bartenders and liquor and pretty much everything else in this world. \n\nI'm going to Tee Off next time, where the hot lady bartenders are not an embarassment to our gender and can make pretty much any drink.", "author": "Tatiana T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "\"You will never find a more wretched hive of scum and villainy. We must be cautious.\"\n\nThis line pretty much sums up Nag's. If you're a cheese-eating surrender monkey, this is definitely not the place for you.\n\nFor the adventurous willing to brave this warning, realize that first and foremost, Nag's is best defined as a divey shot bar. This means \"I'll have a Bud Light and a Jameson, please,\" and not, \"I'd like a bespoken craft cocktail.\"\n\nYou've been warned.  :)", "author": "Sam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "My mom &  I had a really great time tonight! Great little bar, recommend it to anyone! The bartender Elaine was so great! Thanks", "author": "Kelsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "Divey Asian hole in the wall bar, cheap drinks.\n\nGin + tonic and a Jameson Coke = $12\n\nCHEAP!\n\np.s. What's up with all the books? Nobody reads at a bar... Wait. i've done that before. Nevermind hahhaa", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "This place is a cool little dive bar with an awesome (and drunk) bar keep! He will make you whatever you want, and if he doesn't know how to make it..will try anyways..lol. Weve been back twice=)", "author": "Prescila B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "I like this bar! I came when it was kind of dead but the owner was there and shes SUPER nice! She let me and my friend watch whatever we wanted on the television and drinks come with almonds which is kinda cool. \n\nA beer is about 5.25 which isn't too bad for normal price. The place is kind of small but there are a few tables if you want to sit with friends. Also I like that they have a list of drink names on their wall. I like bars that actually advertise drinks because sometimes I get bored of the same old thing. \n\nOverall, nice bar and great service. I'll definitely be back!", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Been one of my fave go to places.  The owner and bartenders make me feel comfortable and knows how to have fun.  Come see what a NAGS shot is all about!", "author": "Jen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "A favorite hangout!  Elaine and Julie are great.  Momma cracks me up.  A fun little place!", "author": "Loren H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-20", "description": "First time in my drinking life have I ever had a bartender ask me \"what is a white russian?\" The whole night was filled with wrong drinks because the bartender was so drunk that she couldn't grab the correct bottles to make the drinks. We overheard her tell her friends that she's been drunk the whole day. My friend's liquid cocaine smelled like toothpaste and tasted like Listerine. \n\nThis was on St. Patty's Day and this \"irish pub\" was dead. A couple of old veterans and us.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-19", "description": "The only thing this place has going for it is a wide assortment of mixed drinks they do here. Otherwise, it's a complete sausage fest that's dead on the outside and inside. I'd much rather migrate to Tradr Sam's or Pig and Whistle for a drink with some friends. Drinks are cheap, and pours are more than generous, but this place just gets no business. I believe it's a $15 minimum for a credit card, so if you're planning on staying for some pre-gaming with some friends, make sure you get enough at one time to hit the minimum if you have no cash. The usual clientele also are extremely rude and foul-mouthed.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "They have Hoegaarden on draft, enough said. Friendly bartender, nice dive bar atmosphere. Good place to stop in for a beer while you are doing other things in the neighborhood.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Big shots, bartender is attentive during the late afternoon, and good selection of beers on tap. Would 5 star for happy hour specials, but other than that I'm a big fan!", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "One day I was with a good friend of mine and we were waiting for Tia Margarita to open. Not knowing what to do to kill time, we found our way in here. It was your typical 4pm crowd, if that makes any sense. This fact made the strikingly handsome bartender really stand out. Here you have a bar full of older gentleman playing dice and out of nowhere comes this hottie. I mean, hot enough to where my friend who was with me (and also married) do a double-take. Talk about an incredible surprise! A diamond in the rough in the land of the dives.\n\nNot to mention, he was smart and friendly. Who the hell was this guy? Was I seeing things? Seriously! He must have been helping out the owner or a family member because I honestly had no idea what he was doing here in the middle of the afternoon. But what I can tell you is this fact alone makes me have a new found appreciation for this hole in the wall. You really never know what you're going to get...", "author": "Gina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-03", "description": "Dive bar amongst a sea of dive bars. Old man bar at it's best. Playing Robin Hood (Russell Crowe version) on the tv??? Beer tasted a little funny, either from the taps or possibly the glass but whatever the reason it was not the most pleasant. Dark and grimy and full of people scattered around the place. Regulars are drinking and conversing. Some guy is losing his money or winning a fortune at the video poker machine. I suggest this place for a quick drink but take my advice and order beer in a bottle.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-03", "description": "Creative drinks and nice bartenders.\n\nI came here for a friend's birthday and it was just basically our party plus a few other people (Tuesday night, go figure lol). \n\nI heard their prices are pretty cheap so that's alllllllways nice. ^_^ \n\nThis place has a really.. comfy, cozy neighborhood bar feel to it. And it isn't poorly lit like other bars, so it's pretty cool.", "author": "Susan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "Came here on a whim over the weekend. Had gone to Blarney Stone nearby and was bored with the atmosphere and wanted to explore. Yelped bars nearby and this was the closest. When we walked up we almost turned around b/c there didn't seem to be many people inside and it was pretty quiet. There was also a strange smell at first that kind of turned me off. \n\n10 minutes later I had completely changed my mind. Had our first drink and when I checked in realized they were known for their shots (I say \"shot\" but its really a full glass without ice). We ordered a few and they were FANTASTIC. We each had about three shots and a drink each and our totals were around $18 which is cheap considering how much alcohol we were consuming. The bartenders are SO nice. They even let us play songs from our ipods behind the bar. \n\nOnce we were about to head out, the bartender convinced us to try another shot for free, and we ended up staying another hour after that. Very personable. I highly recommend the Nerds shot - tastes EXACTLY like the candy. The Kimchee Juice is really good too if you can handle spicy :)", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "The first time I went in it was with a coworker that swore they had amazing shots. I was already two sheets to the wind, so I was down for more. They were wonderful as he said. I decided to go in next time sober, thinking they could not have been as good as I remembered; drunk me can be quite generous. I took my shot like a champ (Cranium meltdown sounds rather ominous I think, but then I rather like my drinks to be dramatic). It was bliss. Many times later and the drinks have never been bad.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-09", "description": "The Nags Head is a great dive bar in the Outer Richmond District. \n\nA friend wanted to catch up with a few brews and recommended The Nags Head and being close-by and full, we decided to walk to burn off some calories. On a Friday night, the place was packed and I noticed a higher number of Asians in the bar then normal bars. They are a typical bar, no need for frills and thrills as they serve typical good beer and mix drinks and pour shots.\n\nThey have cups/dice, which I guess I associate with Asian or Taiwanese bars (no racial) and had explained some games for my friend to get some drinking games going on. \n\nI heard the bartender and owner are awesome people, but I will definitely be back on a calmer day to get the full experience.", "author": "Casey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "This is a great hole in the wall bar with extremely cheap drinks! Unlike most bars, the bartenders here NEVER pester you to buy drinks to fulfill their quotas. In addition to that, the owner is extremely nice and sweet and always does her best to make sure her patrons are having a great time. \n\nIf you want a chill place to hang out with your friends at your own pace, this is the place to be!", "author": "Dave T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-13", "description": "Dive bars are calculated trade-offs: \"yes, it's a dive but it's got great ... \" music, or drink selection, or atmosphere, or prices, or clientele, etc, etc. Tradeoffs that make you like the place, regardless. \n\nI've been here at least three times and I have yet to figure out the redeeming quality that makes it worth a fourth visit. Service: adequate but generally disinterested; Clientele: typical mix of quiet drinkers, chatty drinkers, and loud/obnoxious old-fool drinkers; Drinks: WAY overpriced and/or under-poured for what you get.", "author": "Dave E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "Nags Head! This place is like the asian version of Cheers. \"Everybody knows your name and everyone is glad you came.\" Lol...well maybe not exactly but by ironic twist of fate I have stumbled into people I know from different circles by being a frequent patron of this bar. This place would definitely qualify as a \"dive\", but that's what I like about the most about this place...its charm. I love how they have all their specialty drinks plastered all over the back of the bar wall. \n\nBartenders are great and the owner is super awesome! Sometimes she whips up some of her awesome porridge and patrons can feel free to help themselves to some great grub. If not, feel free to bring in your own food and eat it here. My only hangup is I wish they had more offerings on tap. But the pros far outweigh the cons here.", "author": "Derrek O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "More recently been here again and had a fabulous time. Friendly place, nice bartender. \nAn easy place to grab a drink, really. Oh, then there was the swingers couple who was all she wants me and he wants him. Umm, no, we're good. But, thanks. For the story. Now stop following me into the bathroom and speaking German.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "The Nags Head is a real bar.  Not a fern bar, not a gastropub, not a restobar, not a place for bespoke cocktails made by bar chefs, not even really an Irish bar.\n\nIt has a floor, ceiling, two walls and in its one fancy flourish, one of those doors that is split in half horizontally.  When you enter narrow room, you'll stand on some old carpet while your eyes adjust to the darkness.  a few tables with stools in front of you and an old wooden bar, polyurethane rubbed away by years of elbows and forearms, on your right which runs the length of the room.  In back, there's a place where you can relieve yourself.\n\nThey have a usual selection of beer on tap and in bottles, as well as a Jäger-chiller machine but last time I was in most people were drinking flavored vodka neat with a side of soda and playing dominos.  It didn't look like the first time they've done that.\n\nYeah, I guess it's just a normal old bar, but the bartenders are cheerful and friendly and so are regulars.", "author": "Suo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "I feel bad writing a review because honestly I can't say I was in the right state of mind to know what was going on.  \n\nWhat I do know though is that I had a flaming Lamborghini, a ghost rider, and a few shots of some other stuff and I was having good time.  The rest of it is all kind of fuzzy...   \n\nThe flaming drinks were special but I recall the alcohol getting disgustingly warm because of the fire.  If you decide to drink a flaming drink I'm telling you now, drink it fast or it'll REALLY suck.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-03", "description": "While waiting for the rest of the party to join us for dinner next door, we stumbled into an empty Nag's head on a Saturday evening at around 6:30 ... it was entirely empty and a great place to chat candidly with a friend ... but no doubt, the conversations will start to engage the bartender as you question the ingredients on the bevy of different drink names stuck on the mirror. \n\nA pretty awesome bar that doesn't take itself too seriously.", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "Low-key, sweet bartenders, drinks are really cheap and Michelle, the owner, is lots of fun. Local dive bar-- walking distance from my gf's house, where I was staying. \n\nThe funniest part of the night though, was when the bartender was giving us ideas for places to visit while I was in town, and she asked me if we had clam chowder in NY. \n\nThe best part of the night was when they let me take their old National Geographic magazines. They weren't using them, you know?", "author": "Angelina K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-16", "description": "$9 for a Bulleit rocks? Even Blarney doesn't charge that much...but Blarney could get away with it because its cleaner, bigger, and is overall a way better bar. Two stars because they have a wide array of mixed drinks to choose from (if that's your thing) and the bartender was cool. Otherwise, spend your money at one of the other local dives.", "author": "Yelper F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "A fantastic bar! I love how they list all the shooters they have up against the mirror - it makes picking a fun girly drink a lot easier! So often I want to try something new, but can't come up with something fast enough and end up just going with a standby G&T or Sex on the Beach. Here though, I got the Flaming Dr. Pepper, which ACTUALLY CAME ON FIRE, and the Nerds shooter. Great fun, and really cheap. Each shooter was less than $8. Someday I want to try the Stop Light...1 cranberry vodka, 1 screwdriver, and 1 vodka midori in a row!", "author": "Melody L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "Bar crawling down Geary...*THUMBS UP* \n\nOur mission: Go to every bar between 5th Ave. and Purple cow (38th Ave)\nMission status: made it to 33rd then buddy puked haha\n\nThis was one of the more memorable bars cause the bartenders here were quick and friendly. It was one of the bartenders birthday so we tried to buy her a shot, but she was pretty responsible and said that she didn't want to end up on the floor when her boss got there. So I settled for buying her a shot of coke lol And got me a whiskey and my friend a vodka. After our shots she invited us to have some food to celebrate her b-day with her.\n\nI remember having some skittle and some girl walking up to me and saying NOOO!!!  DON'T EAT THE SKITTLES!!! I asked, \"Why not?\" She told me they were old lol I was like oh.... She suggested I have a shot to kill any germs on them. Haha I ate them anyways =)\n\nI hope to come back soon!", "author": "Albert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "Absolutely love this place.  I used to go a lot when I was working full time, but a college kid can't go to these places often!  I seriously love this place.  The owner was so nice and made my friends (visiting from London) feel so welcome.  We ordered quite a bit of drinks and let's just say that I was unbelievably pleased with our tab.  The bartenders here were so friendly and the drinks were strong and tasty.  I remember how much I love this place.  Best choice to go here instead of back to Blarney Stone LOL... Plus Naya dessert place is next door if you're hungry.  I am writing this review from last night... I seriously love this place and will recommend this bar to anyone.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "A-OK asian hole-in-the-wall bar in the Richmond...can definitely be a so-called \"dive\" bar.  Huge shots at reasonable prices.\n\nThe crowd here is always pleasant and so are the bartenders.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "When I first heard of Nag's Head, I envisioned a dark joint that drew questionable characters and hopefully a giant, messed up mannequin head that served as the origin of the name. My kind of place.\n\nSo I went and while the bar did not live up to my absurd vision, good times were had. Came with fairly sized party which I woudln't suggest for this particular hot spot. Nag's isn't a large, in fact it is tiny. When there were 30-40 people inside I felt like I was in a mosh pit. They have a bunch of stools and 3-4 mini tables but chances are you'll be standing around. Doesn't take away from the merriness though.\n\nDrinks are dirt cheap and without any dirt. Think 3-4 dollar beers, 6-7 dollar shots? They do have a funky list of house drinks they make. I wouldn't be surprised if they just took old recipes and made new names but hey more power to creativity. Plenty of bartenders so ordering and getting drinks is so easy a caveman could do it.\n\nThey also got a magnetic dart board and some red mugs with 5 dice each. Very handy to start up your own drinking games or an excuse to just yell at something.\n\nThere is also a squirrely bartender named Elaine aka. Lil Cheezy, not to be confused with Elaine Benes. You should say, as my good broheim says to her, \"WaDDDuuP,\" and enjoy her timeless reaction. The real star of this place is the owner. Very warm, motherly and for reasons, on one faithful night, not to be discussed a true life saver. Fruit punch flavored.\n\nSo, just like in Rounders, \"For that I owe.\"\n\n\nGo to Nags, with your zipper zipped.", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Full bar, love that they have poster signs taped to a mirrored wall with special and old timer's favorite cocktails.  It's a unique way to put up a drink menu. Loved it.\n\nPrices were decent per drink. \n\nCrowd - Must have been an asian nite when I went.  Pretty disappointing.", "author": "Hanna Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-07", "description": "small, quaint geary based bar.. nothing extreme and special about nags. Came here spontaneously after drinking at tradr sams. My friend and I had a Tokyo tea which was super strong (thanks to whoever bartended that night) it was pretty awesome for the most part.. it was quiet that night so me and my friend were able to have good conversation over a strong cocktail.. perfect!", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-26", "description": "This is one of those places that gets three solid stars. I can't give it more since this place is literally about as wide as the bar itself and like many of the bars in the area doesn't need a reason to stand out. The prices are average (5 dollars for draft beer, 3.75 for well mix drinks) and there is always some random movie playing on the television and music provided by the bartenders I-pod. This can be a good or a bad thing depending on whose music is playing. (Last night was great with a bunch of mid-90's rap making me nostalgic for my junior high days.) \n\nThe bartenders here are all really friendly and must pour stiff drinks because I always seem to stagger out of the place asking myself how the hell I got that drunk. \n\nEvery time I come here something crazy seems to go on. A man tackled by the cops and arrested out front, a fist fight that broke out between two \"best friends\" on the sidewalk, a crazy lady with no teeth telling me that she has the power to talk to horses, and a random man passed out at the bar. \n\nThese are the reasons I keep coming back. I never know what new story I am going to walk out with!", "author": "T.C. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-04", "description": "Normal priced bar, dead on the weeknights and packed on Fridays. If you're looking for an Asian bar, this is it. Bartenders are attractive. Tables don't really get cleaned, had a beer sitting on our table for a good 20 minutes that was from the party before us. Get a flaming lamborghini if you're feeling adventurous (and you're able to hold in your alcohol), it doesn't sit too well but the taste isn't bad; hey, I didn't say it was easy and it's a good way to get that nice buzz for $12. Their drinks come out pretty well. If you like your drinks spicy and extra minty, get the mint chocolate chip.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-18", "description": "many memories come to mind when I come to good old nag's... well the ones I can remember anyways.. the owner Michelle is always very pleasant.. nice little place for a small group of friends to get together to drink the night away ! once in a blue moon there would be complimentary popcorn or some kind of party tray that would brought over to your table by michelle, which i thought was a very nice gesture and a very strategic way to have your customers return. The men's bathroom does not have locks, but other than that.. the place is awesome !", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-14", "description": "I like it when I walk into a bar and my drink options are posted on the bar wall in what looks like sticky notes on brightly color papers in bold print so that I can read it.  And I like it even more when the drinks names are intriguing and I don't know them and there is no freakin' way I'm going to get through them all in one night without a trip to the ER.  And that is in a summary what this place is, in a bar. \n\nSmall place, not too crowded, and it appeared in my brief experience there, like a good percentage of the people there were regulars.  \n\nHey anyplace where I can wear jeans and a cute hoodie, and not pay a cover or wait in line, wins in my books already.  Top it off with intriguing drink names taped to the bar wall, and you've got me.\n\nI'm already making a list of drinks I wanna try next time.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "One of my favorite dive bars, crazy decorations. Classic drinks", "author": "Seaera T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-21", "description": "Okay, so it's not anything fancy... but I've always had fun here! There's an Asian crowd for the most part. You can borrow dice (they have lots) to play drinking games with. All their drinks are listed on the wall behind the bartender. It's a chill place but it was pretty packed when I went there on a Friday night last time.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-04", "description": "Relaxed place with the nicest bartenders. I like that they put out snacks and talk to the people waiting around.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-20", "description": "I *really* don't get the great reviews for this place.  It's a neighborhood bar for me, so I've stopped in quite a bit over the years when meeting or waiting for friends.  The bartenders are always friendly and sweet, but the pours are awful.  All of you talking about strong drinks, great pours? Seriously, you don't know how to drink.   I feel like this is one of those places (sadly there are several in this 'hood) that guys overhype due to having cute Asian chicks for bartenders.", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-18", "description": "Favorite neighborhood bar!\nWith a great friendly crowd, good music, extremely cheap but strong drinks (5 bucks for a jack and coke), and free darks/cards/books/dominoes/dice, how could you possibly go wrong?\nI highly suggest that everyone get a shot called \"death wish\"!\nThe owner Michelle is super fun and friendly!", "author": "Red R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-18", "description": "This is my group's regular bar, so I must give the obligatory, but deserving, 5 star rating.\n\nFREE:\nMicrowave popcorn.\nCup Noodles.\n\nStay away from the Death Wish. EUGHK. Jager, you disgust me.\nThe Stop Light will mess you up since it's 3 shots of bottom shelf vodka for $6.\n\nThe owner Michelle is the sweetest little thing EVER lol.\nThe bartenders (especially Sophia and Julie!) are all nice and pour generously.\nThe bouncers are very friendly and had no problem with us even after we got into a little scuffle with the cast of The Debut on the sidewalk one night.\n\nThis place is Asian Invasion, but not Club Asian Invasion - thank God.", "author": "Len L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-16", "description": "I'm broke but I love to drink.\nI'm classy but I love a good dive bar.\nI'm a nobody but like to think I am somebody.\n\nThus I walk two blocks to Nags, where my measly $20 can get mee drunk!  (And trust me, I'm not a lightweight, nor a cheap drunk..i love my henn)\n\nIt can get packed on a rowdy weekend, but other then that is pretty empty.  \n\nAnd on any given day, I'm sure to find a welcoming friendly face behind the bar =) \n\nwhat more does a drunk need?!", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "I like it... Jessica the waitress is cute:) Def an Asian hang out.. I was there for a few hours, got no crap from no one.. Pretty friendly place.  Need to go back..", "author": "Demanding T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "Damn the Olympics.\n\nI blame them for this latest hangover.\n\nWhy?\n\nWe played the \"Olympic Opening Ceremonies, Guess How Many Athletes That Country Has\" game.\n\nClosest to the actual number is safe from drinking.  \n\nPlayer who nails it directs shots for the other player (thank you Nauru).\n\nI technically won but in reality we both lost a little.  \n\nSpecial thanks to Sierra Leone, France, and Ghana.\n\nGotta say though, India, you jammed me up.  56 athletes???  For 1.1 billion people???  You're better than that.\n\nThis is my second time to this place and it's starting to grow on me.  \n\nBartenders are quite cool and they ended up joining us in our game towards the end.  \n\nGreat place to go before or after a visit to Shabu House.\n\nI advise against playing this game with Irish Car Bombs.  \n\nThank God the next opening ceremonies are 4 years away.\n\nWhat?\n\nOh crap, that's right, winter Olympics.  \n\nCompetition.", "author": "Archie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "If you are ever confused on what to order in this bar, just look behind the bartender.  This place is a great 1 2 punch...........McKenzie's being the 1 or 2 depending on which bar you go to first.  It's great to see the owners go back and forth to each others establishment.  There really isn't a rivalry between these two bars.  \n\nIt is a typical Asian dive bar in the Richmond District.  Crowd is generally younger. Shots are cheap and strong. The don't allow smoking in this bar....................A definite plus!!!!!", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-12", "description": "One of the best hole in the wall bars ever! Forget my last review... This place is awesome. They have unlimited amounts of Cup of noodles you can eat and they have super duper cheap drinks. As time goes by, inflation increases... that means everything in price goes up! EXCEPT AT NAGS! Where will you find a shot of grey goose for $7 dollars...? no where! The owner michelle is such a character. She knows how to talk the talk, and walk the walk... treats customers with respect, and knows how to humor them. \n\nMake sure you tip the awesome bartenders too (kaori and lisa)!", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "Small place, but BIG shots! Its like family there. I always have a fun-tastic time! The owner, Michelle is awesome and is always full of smiles! Bartenders are nice and you never wait long for a drink.", "author": "TifFancy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-07", "description": "So I just celebrated my birthday here and I have to admit that I am a new fan of the place.  1 stoplight (those three shots were lethal btw), 2 scooby snacks (because I liked the name), 1 chocolate cake (for my birthday), 1 mangoco, and 1 red headed slut later...I finally understood why this place is so wonderful.  Fortunately, I did not drunkenly throw up outside like most people who celebrate their birthday at Nags Head.  However, I did manage to drunk call the guy I was dating and say things that I shouldn't, drunk cry a storm, embarrassed myself in front of my friends by sharing several TMI stories, and had a drunken \"deep\" conversation with a complete stranger who, for a split second, I thought was my soul mate as we smoked our cigarettes outside.\n\nYes, I kept it classy that night.   hmm...\n\n+4.5 because I love the owner, she gave me free drinks since it was my birthday and consoled me when I drunk cried.  Oh yea and for the hot bartender that offered me a threesome that night.", "author": "Jacquelynne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-12", "description": "Nice little bar, I dont come here during the day time but more during night. Can get pretty crowded on certain nights and somtimes it will be extremely tough to find a seat. Bartenders are all female and to me thats a pretty smart move...\n\nThey have a big list of different mix drinks on the big mirror and a good selection of hard stuff if your into that. Also got a decent selection on tap. If its a crowded night, dont expect the boys bathroom to be in the best state, but then again.....most guys dont have the best aim and I doubt its much better when they are drunk. \n\nThe crowd during the nights is mainly a younger group, mainly asian I have to say with a few dabs of caucasion. Everyone is pretty nice but tend to keep to their own groups. So dont expect any use of those cheesy pick up lines you have hidden up your sleeve. \n\nUsed to be easy for underage kiddies to get in but now Mama-san is making sure they dont...heh heh", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "Small bar. Friendly bartenders who can make a hell of a drink. Reasonably priced drinks. Interesting drinks I'd say. I'm confused with why they have books in the bar.....drunk reading perhaps?!?\n\nDeath Wish & Lamborghini are deadly!", "author": "Serena W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-02", "description": "Confused. \n\nWalking in impression: \n\nMe: \"wait i thought this was a irish pub (pointing to the sign, NAGS HEAD)\nFriend: UMMMM\nMe: \"this is a pseudo irish pub! (points to the room full of asians playing cards....Playing cards!!!!!)\nFriend: UMMMMMMMMMM\n\nYes. This place confused me but it was kinda cool, the drinks were STRONG and cheap, got 6 drinks for 28 dollars!? WOW.  Small but cozy and there were a lot of people in there, this would be four stars, minus one for all the foo's that lit up in there...if you can't stand smokers....don't come here.....had a nice time with my fobby friends so, I give it a 3 stars...\n\nwanna be inebriated and play poker? here ya go! \n\ni'd come back but only if i wanted to hang out and chat with my friends...the smoke gets to me, but i probably wont be hanging out here EVERY night :)", "author": "Linda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-13", "description": "An establishment diminutive in size but big in heart, The Nag's Head has the smallest square-footage any of bar on the Geary street corridor.  Rectangular in shape, and much longer than wide, it makes due with a well thought out and space-efficient design, starting with a bar that runs the entire length of the room.  A dart area doubles as table seating, with tables folding down on hinges to make room if a game starts up.  A mirror in back of the bar is plastered with drink specials, and a 365-day-per-year Christmas garland full of lights graces the top of the bar. \r\n\r\nThe crowd here is an older one, but the amongst the friendliest and most talkative I've seen in the city.  The bartenders name was Miles, a genuinely polite old-guard barkeep that could keep up with his pouring while exchanging idle banter with his clients, occasionally swapping jokes and joining them in a booming chorus laughter at the conclusion of each one.  Despite his humble appearance, Miles is a rare breed....he's an individual that seems content with his lot, and truly *likes* what he does for a living.  Unlike a lot of neighborhood pubs, the social scene here has a very interesting dynamic about it....particularly  how easy it is to enter and exit conversations on a moments notice.  There's no listen, plan, wait for an opportunity to jump in.  Just say something that pertains to the conversation, and people treat you like you've been a contributor for the last several hours.  Back off, and and people tune you out after a  mental egg-timer in their head runs out.  There were no sorrowful faces gazing catatonically into space while plying their sorrows with liquor.  To the contrary, topics of conversation seemed to spring from a bottomless well, with every person in the place  engaged in mile-a-minute chitchat.\r\n\r\nAn odd shaped window that looks out on Geary street lets in a small amount of natural light during the daytime....well placed incandescent lighting takes up the slack towards the rear.  The sight of a crock pot with plates on a small table near the jukebox suggested complimentary grub might be on hand....but a peeking inside of it revealed naught but a few bits of dried out potatoes, a scant remainder of some kind of stew that had long since been devoured by early-bird patrons.\r\n\r\nThough you won't find the young and the beautiful atop the barstools at the Nag's Head, you will find the rich of soul and the kind of heart.  The music is old school and not too loud, and the pick-up scene is all but non-existent.  But the Nag's Head is rich in soul.... a rare thing in this city, where the four horsemen of the economic apocalypse have a tendency to run roughshod over the traditions of the old guard. In a fast changing world, the Nag's Head is a pleasant reassurance that indeed.....some things never change.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-26", "description": "If u want to relax and have a good time on a tuesday night, try nags! Michelle, the owner of the bar is the best ever! Very friendly, the sounds is ok, drinks is not that expensive at all!", "author": "Gee f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-29", "description": "I guess you could say this place lives up to its charming name. It was cold inside, and they only had Woodbridge chardonnay (though I realize you order wine at your own risk at a dive bar) and the place reeked, and I mean reeked, of Chinese food. \n\nThe bartender was sweet, ergo the two stars.", "author": "Angie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-30", "description": "This bar is the place to be at if you're trying to grab a drink n chill.  This bar is a little small, but it's hardly ever crowded.  I like coming to this bar because the drinks are cheap, shots are fat, and i just get a kick out of the owner.\nIf you really want to get sh*t faced order a ghost rider.", "author": "Cedric F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "Awesome neighborhood bar where the owner, Michelle, drinks with you if you're a regular. She is awesome! Each shot is almost the size of a double shot. Cheap drunk? This is the spot. They also have 2 TV's and a game machine. I love playing that find the difference nude females game while tipsy! hahah Bartenders are great. It naturally awesome when you're your friends. :)", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-11", "description": "It's a dive. Not that there's anything wrong with it being a dive, in fact, I'm sure I'll be back for more drinks. But The Nag's Head is just alright when you want a casual drink and a decent conversation. Interior's a bit smallish. And most of the times I've been here it's been pretty empty. But I'm thankful it's within walking distance.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "\"Grab a drink and chill\"\n\n-Service-\nIt's a bar, the person working behind the counter better not be emo and mix horribly tasting drinks. Luckily, Nags isn't one of those place. The faces behind the bar are friend and will not hesitate to pour you a shot, mix you a drink or hand you a beer when you order up.\n\n-Drinks-\nI got an AMF, and it tasted good, wait.. wait... what do i remember about a good tasting AMF after 4 Nags shots. What i mean by Nags shots is that when I ordered up a shot, they pour it in to a what to me is like a glass cup. It was not the cup though that made the shot, it was more of how much of the cup was filled. I really felt like every shot i took was like a double shot if not less. Yes, and knowing your limit to be 4 shots and it turn out to be more like will keep your pockets happy and give you a night you won't remember.\n\nI give it 4 stars because I kinda wanted to be fair, I didn't remember half my night, but all I knew was that I had a good time, the atmosphere was great.", "author": "JASON P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-13", "description": "The Nags Head was good when Judy owned it. Ever since this Korean woman bought it,it's been downhill. The woman is all about money and her clientele is extremely sketchy. Typical bar politics with this one. The more money you spend,the more valued you are. You could totally be a drunk ass at this bar but as long as you spend money here, you're welcome here. This place blows and so does its new owner. Sorry.....", "author": "Kolohe C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-28", "description": "After a slow night of doing the \"what will I do tonight dance\" I finally decided to catch a ride with my friend out to the Nags head.  While I am not really into getting that far out of the mission but some friends were in for the holiday week and I had a ride out there.\n\nI was really excited when I walked up to the place and I saw a yelp review taped to the window written by Mike W. (one of my favorite yelpers) singing the praises of the place. See Mike W. is also from Stockton and I think that we can both appreciate a little dirt on a bar stool and a bartender with some stories about the surrounding areas.\n\nANYWAY.\n\nSorry to say that I must have come on the wrong night.  This place wasn't packed but it was a bit crowded do to the super small footprint. I expect bars in the Richmond to be full of old drunks and shady types, I actually like this about these places, makes for a good hiding place.  Nags Head was just the opposite, everyone that I wasn't there will was younger than I was... including the bartender.  In fact, I should have carded that chick, she was YOUNG. The crowd wasn't offensive or rude but they kept to themselves like young kids do but I guess I didn't care because I had all the entertainment I needed...\n\nMy friends are idiots.  When confronted with a huge list of specialty shots located behind the bar we decided that we should play a game we deemed \"pick the weirdest shot for your friend\".  I hadn't heard of most of these shots, I mean, does anyone really want to drink something called a 'slippery booger'?  REALLY?  If you are into obscure shots and want to get drunk (or date raped) you should get a 'stop light'.  See, the 'stop light' is listed as one drink but in reality it is 3 huge shots that are all vodka and some mixer.  Green. Yellow. Red.  I can't imagine how my buddy Pete felt after downing them in succession but it was amazing to watch.\n\nI'd like to see this place in the day time as I think that I would prefer the version that Mike W. saw as opposed to the 'slippery booger' crowd.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-24", "description": "A smaller version of Fizzies. Same market, Cute little Asian bar tenders, clientele are mostly Asian males, even the owners name is Miss Young just like Fizzies. They play mostly hip-hop and they hook people up with Huge shots... A double in a normal bar is the single in NAGS. My co-workers like going here after a longs days of work to get screwed up. \n\nI'm not really a fan of this place but since I'm with good people that like to come here then i have to give it 3 stars other wise this place is a 2 star.", "author": "Jose S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-19", "description": "As an Asian myself, I've never seen so many Asians in a dive bar.  A friend and I came here on a Tuesday night--and it was fairly packed.  I finally get to say that he was the token whitey.  :P\n\n\nAtmosphere\nLike most bars, the atmosphere is usually dependent on the people drinking in the establishment.  Most of the people are chill and relax but doesn't seem to branch out of their own small set of friends/regulars--quite a few regulars come in apparently.  The bar is small but the layout of tables to the left and the bar to the right makes for an inviting walkway into the place.\n\n\nDrinks/prices\nShort and simple--they're cheap and great.\n\nStaff\nThe owner is awesome, although some other people have mentioned it again and again--it can't be included enough--Michelle is a great owner.  Bartenders are fun, albeit slow (which the owner rectified fairly quickly).", "author": "Billy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-05", "description": "A total shit show. Good times. A must do on the depressing Richmond dive bar crawl.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "Cheap drinks, friendly bartenders, huge drink variety, and a lively atmosphere sums up my experience at the Nag's Head. Great place to go with friends on a Saturday night, especially if you're not down to pay a ridiculous cover price to get into a club. Parking around the area is plentiful if you come at night, and after 2am, you can always head to Video Cafe just a few blocks down the street to sober up. :) My only complaint is that the bar itself is kinda small, but you can't really blame 'em for that.", "author": "William C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-23", "description": "It was great on a Tuesday and lame on a Saturday. What gives?\n\nEither way, I like this place. The bartenders are nice, and so is the owner. We were ignored when we first came in on Tuesday, and when they noticed what happened, we got our first round for free.\n\nI am the token whitey at this bar, but I don't mind at all. It's a nice neighborhood bar - the kind of place where you don't feel like you have to impress anyone and you can just relax.", "author": "Stu M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "would've been 5 stars, but they pour way too much alcohol in one shot for me. I'm scared......", "author": "alison d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "The chillest, most comfortable bar I ever been to.  The speciality drinks are amazing, Monday night specials are half off Grey Goose and Hennesey.  The CUTEST bartenders (shout out to Kaori, Chiyaki, Sophia, and others) and the most entertaining owner, Michelle, will keep your glasses full and good times rolling all night!!!  So on any night of the week, and if the lines are too long and you dont feel like paying cover at the regular clubs, stop by at the Nags and you will not be disappointed.  Much love...479 boys!!!!", "author": "Pomaikai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-11", "description": "i spy...\nall the holidays hiding on the wall... no really- its a fun game if you're sitting around hypnotized by all the sparkly lights. this is a great charming neighborhood dive bar where like cheers, everyone knows your name and your favorite drink. \n\nthe key word is DIVE BAR- so be prepared to be put into a relaxing mood where you can shoot the shit with the person sitting next to you, or perhaps- catch up on some reading against the wall and contemplate on your next trip to get away from the daily grind. the game- now THAT in itself is an attraction that beckons you to come in and park your butt right by the door as you loose yourself in a plethora of arcade games- some innocent, some not so innocent (find 5 things wrong with this nude pinup! for example).   \n\nsmall and cozy in size but huge in costumer service provided by a energetic owner with a laugh you will never forget. michelle welcomes all of her customers, new and old with open arms and hot food.  the crowd changes from day to night as do the the bartenders.  everyone who works there is fun and open to play games (cards,machine,darts) with you, listen to you vent about your day and even soothe your broken spirit. whatever it is, be prepared to be entertained as you toss one back.\n\nwith a classic \"nag's shot\" how else can you go wrong?", "author": "Annie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "i only came here once and that was when my friend annie who worked here had her last night bartending here. the signs behind the bar letting you know what kind of drinks you can get here are extremely helpful, especially for someone as drink retarded as i am!\n\nsorry annie, i guess we should have visited you more at work when you were actually still working here!", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-14", "description": "This bar is the asian version of Cheers. You always see someone u know there. The bartenders are fun and it's amusing watching them \"work\".  Michele the owner comes by on certain days and bring food to feed everyone!", "author": "Dao C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-31", "description": "After pummeling ourselves on gigantic plastic bottle \"pitchers\" of HIte and Sansachun shots along with dinner at Toyose, ended up here.\nHad a great time shootin the shit, finishing a bottle of Fernet, doing shots of Jamesons... Thank you Chiaki!  (I think that's your name).\nBoy, you sure were red by the end of the night!\nThere were only asians in here.  Well, except for our group which consisted of a crazy Irishman, crazy Salvadorean, crazy Japanese, Chinese, Korean, Filipino, Spanish, Portugese guy, and his crazy Chinese wife.  \nHighlights of the night....\nHelping Chiaki put on her Fernet blush.\nHaving the crazy Salvadorean spit ice cubes from his Jamesons and Seven into my shot of Jamesons.... so I could have it \"over\".\nHaving a good enough time as it is in this dive...only to have a toothpick-impaled meatball emerge from behind me over my left shoulder.  \nIt was a beautiful way to meet Michelle for the first time.  Its one thing\nto have a bowl of stale popcorn or pretzels on a bar.  \nIt's an entirely different thing to have a laughing, warm, bar owner welcoming you to her place for the first time by feeding you hand to mouth!\nMade me feel like I was back home.\nThey pour a strong drink, but they pour the aloha stronger!\nWe'll be back!", "author": "Barry A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-17", "description": "Michelle the owner is a gracious host. The gals behind the bar Mary and Keori are very hospitable as well. I'm not a Chauvinist but i think a male bouncer may suffice better than the petite owner. I do love the random shot and drink menu behind the bar. the crowd is usually animated and i recommend coming here for a few coctails and move on.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-30", "description": "this place is small but the bartenders are super nice and the owner michelle is awesome!! she remembered my name after my first visit i felt so loved... or perhaps made quite a scene the first time?? (no, no i'm pretty sure it was the former - the love).  either way the variety of drinks, the free snacks, and the awesome staff makes this place a great place to pre-party or party period.  \n\nand the best part?  if u grew up in the city, no doubt you'll run into someone you know and of course papa Patron all around for reunions!  oh! and towards the end of the night, the bartenders drink with u/ give u free drinks! awesome!!", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "I've came here many times because my friends like going here. Although it's quite small, it's not that bad here. The bartenders are really friendly, prices are fair, and parking is easy to find. The only thing that bothers me is sometimes people smoke right outside and I experience second hand smoke from inside the pub.", "author": "Pudgy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-17", "description": "We have been coming here for years since Michelle bought the place. Sweet bartenders, good pour. This is our first stop after shooting hoops.", "author": "Kev C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-10", "description": "The female bartenders there are unimpressive, unattentive and don't know how to add. The male bartender was great.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-09", "description": "It's the library bar!! Because they have books along the wall.  Another typical Asian bar except I had a good time going here.  Maybe because the bartender hooked us up with gigantic shots of chilled grey goose.  Good times!", "author": "Sam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "THe Nags Head is a tiny bar with a few tables on the side and seating along the bar itself..The bartenders here are awesome and i would highly recommend coming a bit early- this place gets packed pretty fast because of its size.", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "a big thank you to the nice ladies behind the bar for treating me to a stoplight on my birthday! sorry i ended up puking about 20 feet away on the curb on that fateful night though...\n\ni love how they list out all their specialty drinks behind the bar, with bright neon scribbles and all. the flaming dr. peppers were a sight to see, and though i had no clue how much the drinks actually cost, they were definitely not easy on the liquor. good times!!", "author": "Andrey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-16", "description": "Love the ladies here. Very friendly, chatty, attentive, and can serve up one strong drink! Atmosphere is very laid back and chill. After spending a couple minutes in here, I could tell who were the regulars vs. the random drunks, but the ladies still chatted with everyone and paid the same attention to everyone just the same.\n\nThis is the first time I've ever been to a bar with actual books along the wall. The bar itself is long and narrow with not much room to move around. I came here around 9 pm on a Saturday and it filled up by 12 am, when I went home. \n\nI plan on coming here again, as it is a very chill and comfortable place to knock back a couple drinks. The bartender usually is the one that makes or breaks a review for me, so I must say that the Nag's head hired great gals behind the bar.", "author": "Ro F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-16", "description": "So I went to for happy hour on a Friday to meet up with my retired ex coworker and another coworker.  This place is small and the older crowd holds court from about 3pm until at least 6 or 7.  What I did love is the generocity of the folks there, I think I only paid for one round and still enjoyed 6 or so drinks.  They have an interesting drink menu with things I've never heard of like a Red Headed Bitch.  I stuck to the basics of bacardi and coke.  When someone buys a round you are givin a token making me think I was at Chucky Cheese or something.  This is a place that's great as long as the company is great.  Muni makes it easy to get to from downtown.  Can't wait to go visit uncle Bob again.  Oh and the bartender was great, very attentive and chatty.", "author": "La C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-01", "description": "A great place to hang out to talk to with some friends. \n\nGulp down a few beers, talk to more friends, take down a few more beers. Start talking jibberish to friends, now with weird looks in their faces. Tell everyone that you love them and you would die for them, which of course you don't mean it. Start talking to random strangers, tell them you love them and will die for them. Take down a few more beers and now you're peeing in the bathroom while trying to keep your balance. Stumble out of the bathroom and gets yelled at by the owner because you just pissed in the kitchen, take down a few more shots, start making out with someone inside the bathroom/kitchen. Take a few more beers before you hit the road, drive trying not to hit anything and wondering why there are a pack of ninjas chasing after you.(i don't recommend anyone drive while intoxicated, or having illusions about ninja assassins) Get to the door, have trouble getting the key into the keyhole, stumble upstairs, sit in your chair and................it's 7am and it's time to fill our your report for your manager.\n\nThis place has all the hot ladies, well some hotter then others......damn that's just wrong. If you're planning just to get drunk, this place is for you. Cheap shots, i mean really cheap shots. Where else can you get a double shot of remy/henny/151/whateveryoudrink for $7? Regular places charge like $12 for that. O yeah did i mention all the hot bartenders. Only thing i don't like is all the smoke there, but everyone smokes there so if try to say something, i'm basically outnumbered.", "author": "Will C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-03", "description": "The boyfriend has taken me here to hang out with his old SF high school buddies a couple times.  It's the chillest place to hang out and get your drink on.  Really... everyone seems to know each other.  The place is tiny, but I'd rather use the word \"cozy\" because the limited space doesn't bother me at all.  They have a bunch of random drink titles written on bright post its on the wall and watching people look through the choices can be entertaining.  Everyone (staff and patrons alike) is super nice, there are snacks sometimes, and the shots are SHOTS.  Can't ask for more.  =)", "author": "Marilou A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-02", "description": "If you wanna get tipsy or wasted, this is the bar to go since their shots are fat! If it's your bday, the stop light is all yours! All three shots. From my experience, everyone who comes here for their bday never \"walk\" out. It is rather small but it is a very intimate and friendly environment. PLUS the bartenders are HOT and oh so SWEET!", "author": "Bevo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "Although this place is tiny, I always have a great time! Fat shots and great bartenders. The owner Michelle is so adorable. Thanks Tracy for always making your special drinks and letting me try them out.", "author": "Ada W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-18", "description": "Great local bar.  I've spent a New Year's Eve here and many other random nights catching up with old friends over beers.  They have a cool book collection lining the wall; take one or leave one.", "author": "Molly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-07", "description": "Oh...if only this bar was bigger.  When I'm not in the sunset and feel like a drink, I come here. The drinks are good and cheap, the bartenders are friendly, and the owner is really cool. Only problem is that this place is really tiny, so when people start coming, it gets crowded very quickly. Even on weeknights it can get fairly tight.", "author": "Tiff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "This dive is a fun place to go.  Friendly cute bartenders that fill the glasses generously.  Small area to hang but if you find a spot to sit, it is a good place to kill time.  Definitely a place to come back to.", "author": "james c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "If you want a detailed analysis, check out Mike W's review (either on Yelp or on the wall of the bar:).  As for me, I'll just say that Nag's Head is a superset of what you get next door at McKenzie's--twice the ambiance, and twice the number of eclectic/eccentric regulars who are twice as outgoing (Cassandra has earned a place on my list of saltiest and sassiest bar matrons, that's for sure--and she's not even the owner!). Oh yeah, and 2 cute Asian bartenders instead of just one.  Although, to be honest, I can't remember which place has more bizarre cocktail/shooter names taped to the bar mirror (Sweet Booger, anyone?).  Maybe I was just here on a more happening night, but hey, first impressions are what they are.  At any rate, as my 6th (and seemingly final) bar in the Outer Richmond, I have to say I'm envious of the overall neighborly vibes--it's what the WP bars ought to aspire to.  There's really only one problem, which is that their geographical spread is very inconvenient for a proper pub crawl.  I don't suppose there's any would-be pub chauffeurs out there?", "author": "Wes M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-01", "description": "ok, so... friday night, i need a mellow place to get my drink on and just kick back after work. head around the corner to the nag's head with my friends. it's half empty, but what the hell-- i can make a good time wherever i go.\n\nso we order some libations and take up residence at a table between a group of asian girls and a separate group of asian guys. we're talking and having a good time, and a few drinks in the guys all light up. \nindoors. \nin CALIFORNIA. \nbitches, don't you know that's illegal? i'm all for you getting a nicotine buzz and having a crotch-kickingly good time and whatnot, but i have asthma. take that shit outside.\n\nalready irked, i start to hear these (obviously drunk) asian guys make plans to attack the group of asian girls. \n\n\"dude, just go over there with me, man. i need some backup.\" \n\"naw, dude, i might get my ass kicked by that dude in green.\" (referring to a bigger girl in a green shirt)\nthey snicker and guffaw amongst themselves. i look over and note that they are all ass-ugly.\n\nhappy hunting, boys. go ahead and gimme a laugh when i see you get shot down faster than a duck on the first day of open season.\n\noh, and the bar's cash only.", "author": "Kerry N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "The regulars and bartenders at this bar are so nice! They are very open to new people and sometimes make food to share with anybody who is there! Great bar, pretty low key, and you can strike up some interesting conversation with some nice people that have been going there for years. (But don't start trouble, or you'll have to go down the way to gross Mckenzies, and nobody wants to do that!) Fast service, good prices, and a wide variety of strong mixed drinks. The style is eclectic, comfortable, and warm. Every time I've been there, they will have food shows on the tv at one end of the bar, and sports or news down at the other end, but they are willing to change the channel if requested. Make sure to bring some cash or swing by the Bank of America on the corner, because it is cash only. If you're ever in the area and want to whet your whistle, make sure to stop by the Nags. And if you live in the neighborhood, stop in after work and support this wonderful little bar. I LOVE the Nags Head!", "author": "Chelsea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-05", "description": "Went to the beach for the 4th and relaxed on the hot sand for about four hours.  Got on the 38 to go home and thought why not stop for a few drinks?  Saw The Nags Head and thought \"perfect.\"  There was a handful of middle age to older guys sitting at the bar getting their drink on.  There was a spread of food in the back on the table since it was the 4th.  Swedish meatballs, chicken wings, veggie platter, salami and crackers.  The bartender was great.  He chatted it up with everyone in the place and was very attentive.  The whole vibe of the place was perfect.  The owner came in told us to make sure we got some food.  I had died and gone to bar heaven.  This place is great.  We stayed for about three hours and then the night shift bartenders came in and the vibe was not nearly as good.  Two younger female bartenders who paid us no attention.  Time to leave.  I'll definitely be back, but not at night.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-07", "description": "The Nags head is on Geary also in the Richmond as well, this place is tiny, in fact I think its the smallest bar on Geary.  Its very narrow and kinda long. The bar runs the length as you enter.  I tried this place during the day and well its defiantly a dive bar. The Décor is what you would expect year round Christmas decorations, the plethora of bar mirrors to make it look bigger and on the counter opposite the bar, rows of paperback books. Interesting.  The bar back mirrors are covered with a mélange of brightly colored pieces of paper all with different popular cocktails and the price.  I saw the standard Irish Car bombs to Flaming Dr Peppers and other strange concoctions with red bull and Jaeger it gives me the heeby jeebies thinking about it. Our bartender was a small Asian lady who was hysterical attempting to fix whatever was broken behind the bar while darting outside to smoke and argue with the regulars.  The day regulars are all older, very friendly and will buy you a drink if you listen to their story, although I think they only bought the drinks because a pretty lady accompanied yours truly. Haha. The prices are cheap and the pours are strong, if you have the time and youre in the neighborhood stop by and have a taste.", "author": "Cooper M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-26", "description": "this is an ok place...its more of a 3.5 star place. i would rather go to other bars but since alot of my friends go here and some works here i cant hate. michelle who is the owner is a sweetheart and drinks are huge. the only thing i really dont like about this place is that its pretty tight on a busy night. not big at all.  other then that its pretty chill.", "author": "Tuan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-11", "description": "i used to come here almost every saturday.  nice place to hang out with friends.  bartenders are cool to talk to too...well some of them.", "author": "A L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-15", "description": "we stopped in last night for a game of pool.  i am all for the charm of a dive bar but this place gave me the heebie jeebies.  as a 29 year old who looks 12, i am accustomed to being ID-ed.  i am not accustomed to the entire clientelle of the bar telling the bartender to ID me.  luckily, he was cool enough to not ask, especially since i wasn't drinking.  the clientelle was rather depressing--it was obvious they've been patrons forever.  and, as i said they were not shy about making your business theirs.  okay, i can get over it.  we played our game of pool, which happened to be terrible and again, one of the patrons decided to start critiquing my shots.  i am terrible to begin with, i don't need attention drawn to that fact.  i was done after that.  i found it a humiliating experience and took things a bit too personally.  my boyfriend claims we made memories.  it's all in how you look at it, i guess.  still won't be going back.", "author": "Marisa S."}
