{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Pretty sure I cheated on my vegan diet for an apple fritter.  Back when I lived in the Bay, I'd go all the way to SF for a donut! It's the same donut and store front I remember and Love. The interior is no frills. Just a little hole in the wall spot on the corner of S Van Ness and 24th.\n\nThe service was awesome! Not only did I get an apple fritter, they threw in some complimentary donut holes!!!\n\nThis place may look no frills, but the donuts are quite contrary. My fritter was a big portion for only $2.00. It was perfectly crunchy on the outside, and gooey yum yum on the inside with the perfect amount of apple and sweetness. I would cheat on plants again for the incredible guilty pleasure!", "author": "Eli'jah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "I've come here twice so far on my way to work via Bart on 24th and the walk here is around the corner. Twice the lady in the front, Konika (sp?) aka Panda has given me freebies alongside my general order.  First time I ordered a few donuts and she added a few donut holes that I discovered only when I got into work. The second time she added an extra swirl pastry with my half dozen order. Just shows her good vibe and friendly personality which is great to see in any morning mood :)\n\nI'll be sure to come here again from time to time on my way to work.", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "This is a hole in the wall donut spot on 24th street.\n\nIt is old school 24th, not a hipster spot.  \nNo cronuts, sorry hipsters\n\nThe service is friendly\nDonuts were fresh and traditional", "author": "Phil N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "CASH ONLY! Don't forget to bring those dollar bills, otherwise you'll be missing out on some really great donuts.\n\nI always see a ton of people here in the mornings, and it's no wonder. A variety of donut types, and all the ones I've tried so far (glazed, maple glazed, chocolate... raised, French cruller, old fashioned...) have been amazing. My favorite donut place ever is Vasy's in Fremont, and this place holds its own in terms of quality and price.\n\nAlso, the people who work here are extremely friendly and it makes me happy to buy donuts from them. The first time I came here, I opened my paper bag after getting to work and realized that the lady (who very enthusiastically called me \"sweetie\" several times) had popped in an extra old fashioned donut. The next time, I got another extra donut! Not a bad strategy to make customers extra happy.", "author": "Ivonnie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "The customer service was amazing the lil lady working the counter makes you feel very welcomed and like family. She is very attentive even though there is a slight language barrier she still attempts to keep you engaged. I only ordered a few donuts and she said \"I have good day, you have good day too\" and gave me basically a dozen for the price of what I ordered!!! . I came for the name, and let me tell you it did not disappoint. The donut was perfect!!! The glaze was not dry and flaky and the donut itself was not hard or stale, perfectly fluffy and soft. I gave her an extra $5 tip and she was extremely grateful. Always remember to take care of those giving great customer service. Anyone in the city or near by craving something sweet definitely recommend you to stop by.", "author": "Jazmin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "TL;DR: Only takes cash! Though, this is worth it. DONUTS!\n\nWent there wanting to get some good donuts for breakfast, came out having donuts for 3 breakfasts. Ordered a dozen donuts, basically all different kinds, ended up getting more than a dozen, as they just kept giving us more. I think we came home with around 15 donuts. Maybe more. Plus, ordered a dozen donut holes, ended up getting 20 of these or more. With the grand total of all of these donut delights being only $16.50.\n\nThe only down side is that they only accept cash, unfortunately.\n\nWill definitely be going back, though! The donuts were great!", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I needed to pick up some donuts for my team since I got caught at work with my screen unlocked, and instead of going to our regular spot right across the street from our office, I wanted to try out a new place.\n\nYelp came to the rescue as I was searching for something near BART station where I could easily get off on my morning commute, grab something quickly, and head to the office. The Jelly Donut was exactly what I was looking for. It's about two blocks away from the 24th Street Mission BART station, so I was able to make a quick pit stop in a matter of minutes.\n\nWhen I went around 8:30 am on a weekday, there was no line and I walked right up to the counter. The lady working the counter was very friendly and greeted me with a smile. I ordered a selection of six donuts and paid only a little over 6 bucks, which is great value. Plus she threw in a maple old fashioned for free. I love that service!\n\nMy whole team enjoyed the donuts. I went with with a classic, a glazed old-fashioned, and really enjoyed it. It had just the right amount of crunch on the outside while the inside remained soft and doughy.\n\nI would highly recommend this donut spot to anyone looking for donuts in the mission or near a Bart station. For the price, you can't beat the quality, quantity, and service!\n\nThere are a couple of small tables inside if you want to quickly sit down, eat your donut and drink your coffee before heading out.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "Super well made donut! No bells or whistles just good donuts. Got a chocolate frosted cake donut. I like that it wasn't oily or overly sweet. I wish I bought another one. \n\nI'm not a fan of buttermilk bars but I tried a bite of the unglazed one and it wasn't sweet enough for my sweet tooth. Just seemed like fried bread. I will be swinging by when I feel like spoiling the coworkers.", "author": "Lindsay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Oooh girl, this is the type of place that brings you back, old fashion simplicity tastes way better than boojifacaton in this town.", "author": "B H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "We need more ppl like the folks at Jelly Donut in this world . They literally will brighten up any ones day, promise! Literally the sweetest ever. It's a mission gem. Cash only. All the goodness donuts no frills, if you want that and want to pay $4 for fancy donut go to Dynamo. I love how they treat ppl here so I would come any day.", "author": "Hetal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "The people here really are amazing with their customers! They always hook it up with super cheap prices and sometimes they add in an extra donut because they are incredibly generous. Their selection of baked goods is pretty standard, but they keep me satisfied!", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "A good hole in the wall place for donuts. All the donuts I got are flaky good flavor and not dry at all. Apple fritter is the size of my palm and is so yummy, worth every single bite! Would definitely recommend going there if you are in the area.", "author": "Leighton F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "Okay, when I want donuts, I just want some nice good ole traditional donuts, nothing fancy. And this place has it nailed down!!! \n\nPersonally, I'm not that big of a fan of Krispy Kreme because I find that it has a weird after taste. However, this place's donut is so perfect - the donut itself is very fluffy and soft (not stale!) and the chocolate topping I got on top was as any normal chocolate glaze donut shops provide. I decided to be a little extra and get the custard filling - could've been a little sweeter and was a bit too thick/creamy as a custard for me. However the donut itself is A+!! And for the price, it cannot be beat!\n\nAlso, bonus, my friend and I went there a little later in the nght, and the lady was so nice! She popped an extra donut into our baggy without us even noticing.", "author": "Jacqueline T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "My go to spot for a quick breakfast on the way to the bart. (Skip the ratchet BK and mcdonalds nearby they charge 4 times the usual prices and are packed with deranged hobos) Open early next to the 24th bart and tons of delicious fresh doughnuts for 1-2 dollars. Like most places in the area they only take cash but they have super friendly family service and always slip me a surprise extra order of doughnut holes with my purchase.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Such cheap and yummy donuts!! We got the chocolate and chocolate custard. They threw in a maple old fashioned donut for free as well, which was nice. Total was only $2.75!!\n\nThe donuts themselves are fluffy and not to sweet. I definitely didn't feel heavy after we devoured them. \n\nCash only. I would definitely come back!", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Love The Jelly Donut. It's become a weekend morning tradition! I made the cutest baby shower pineapple donuts from here by adding a paper pineapple tops to their glazed and sugar donuts. My favorite donut is their glazed twist and my husband loves the cake donuts with sprinkles.", "author": "Kristen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "This place is awesome. Donuts are tasty and filling. I've been here three times so far (have not been in the are too long) and each time they've given me extra donuts even though I only buy one each time. They are super friendly and care about all the customer's. The Jelly Donut, I hope you guys do awesome! Thanks for the delicious donuts! Cheap and they hit the spot!", "author": "Joon Kee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "The chocolate donuts ever! And the staff is super friendly will always come by when I'm in the neighborhood.", "author": "Nicole J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Literally I've lived kitty corner from this place for 17 years. Do I like its doughy product? It's okay. Why? Because its selection can be hit or miss and not fresh later in the day. All doughnuts are baked during the night, so their freshness wanes during the day. Its apple fritters aren't ready til after 10 am for some peculiar reason. Its coffee is horrible and tastes like dirty water.\n\nI suggest getting there early before 7 am for truly fresh doughnuts. The counter intelligence is a bit gratuitously and ingratiatingly friendly, calling you sweetie. The little old woman during the day is abrupt and seems rude,  but to be fair she suffered a stroke and has issues. The woman at night is so wonderful and generous, she makes up for the lack of the freshness of doughnuts or lack of selection. If you tip her a dollar for all the free doughnuts she loads you up with, you'll have a friend for life. I didnt realize that the Cambodians took doughnuts to the next level in this country. This Cambodian related family opetates this place.", "author": "Gemma S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "If you want a classic donut the way they ought to be made then run don't walk to The Jelly Donut! The lady at the counter is super nice and she threw in an extra donut in the box of half a dozen I recently purchased. The glazed donuts were soft and sweet just the right amount of glaze.The chocolate raised ones had just the right amount of chocolate. The glazed old fashioned was delish as the chocolate angel food with multi-colored sprinkles. The donuts were not greasy and they did not have a weird oil after taste which is HUGE in my book! The prices are reasonable too! I finally found a great donut place in the City. Thank you Jelly Donut and the nice lady at the counter! I will certainly will be back for more!", "author": "Review L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Donuts and BBQ are my two biggest food weaknesses. This creates a love/hate relationship between me and The Jelly Donut, largely in that I hate how much I love this place.\n\nAs others have said, it looks unassuming on the outside. Within, however, this is a no-frills donut place that consistently produces quality, cheap donuts. They don't have anything fancy or hipster like Dynamo down the street, but they do the classics really well. The regular selection includes glazed raised, maple bars, apple fritters, turnovers, apple sticks, muffins, crullers, cake donuts, and donut holes. Do yourself a favor, if you get a fritter, split it with someone--otherwise you'll end up hating yourself by the time you finish.\n\nDepending on the time of day and who is working the store, they'll sometimes throw in a few donut holes or an extra donut in for free along with your order. This is quite generous and shows they care about returning customers! Cash only.", "author": "Tim X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "These donuts were fire. Crunchy and fresh and the chocolate was sweet but not overbearing. The lady working the counter gave us an extra one too", "author": "George N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "This is an amazing casual donut place. It looks like nothing special from the outside, but the donuts are great and you can't beat the price!\n\nWe went on the later side on a weekday night, so there was no one else there but us. The server was nice -- and gave us 3 (!) free donuts on top of the 2 we ordered! All this for under $6!\n\nThe standout for me was the chocolate frosted cake donut, which was huge, dense and flavorful. If I could eat one of those every day without gaining a million pounds... Life would be complete. \n\nI will definitely go back the next time I need a donut fix!", "author": "Christine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "Absolutely my favorite causal donut store on the strip! I come here for my donut holes and cinnamon rolls ( which are as big as my head)! Not only that, they always put a few extra donut holes in my bag ( bonus!) It's so soft and fluffy! \n\nBest of all, it's super cheap!\n\nUnfortunately, there's always a long line in the morning and i'm usually rushing to work to wait:(", "author": "Josie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Everything here was good. No complaints on any donuts. Quick off the Bart (less than 2 blocks) this place was very good just didn't have a great selection it didn't seem.", "author": "Chad E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "Went buy the other day got a old mapple too much sugar coffee was bland seems like they just make a new pot and don't add new coffee grinds", "author": "Iz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Neighborhood donut shop is best donut shop.\n\nThink Dunkin, but two steps above. Sometimes simple is best.\n\nMy favorites are probably their French cruller - so fluffy! - and their custard.\n\nPerhaps most importantly, the kind folks who run the place have a well-documented habit of throwing in an extra donut to a dozen, or a bunch of donut holes to a half dozen, or whatever strikes their fancy. Definitely a family owned affair, and that makes all the difference.", "author": "Zach M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "Delicious standard style donuts. The owner is so nice as well! No frills - just fresh, delicious, and amazing. Think similar to Bob's donuts vs. hipster Dynamo.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "I had a great doughnut here yesterday thier getting better the issue with the coffee is buying hazelnut it taste like hot water so I went for their moms and pops pot they could do better with a coffee bar but it's thier business so what ever cheers", "author": "Sir J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Glazed donuts are the benchmark for any decent shop, so go ahead and confirm that the ones here are perfectly fluffy and sweet, and then treat yourself to a plain cake/old fashioned donut, because those are the real hidden gems at this spot. Their donuts are exactly what I want a donut to be: fresh, soft, and free of that funky old oil taste that some spots suffer from. \n\nOther things I love: \n-a donut is $1 flat (cash only), no annoying .09 cents tax shenanigans here\n-sometimes the sweet ladies will throw in an extra\n-good variety of donuts", "author": "Angela N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "This was my second time buying donuts from here. I love this place. I bought a dozen donuts today and the lovely woman who helped me threw in an extra donut for me. We chatted a bit and I found out she was the daughter of the owners. She was so nice and had such great customer service. The donuts tasted delicious, the texture moist and tender. My favorite is the glazed raised and cake donut. My new favorite is their glazed culler donut. So light and tasty!! This is my go to place when I'm in the neighborhood. Highly recommend this donut shop.", "author": "Robbie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Perfectly fried, delicious old-fashioned donuts that will make your morning--guaranteed. \n\nFor less than $4, my friend and I shared the apple fritter and the glazed old-fashioned and crumb cake donuts, and the sweet lady at the counter even threw in 6 donut holes. Seriously amazing. My favorite was the apple fritter, but I loved them all! My friend's favorite was the crumb cake donut, which reminded me of the cider donuts I used to eat each fall back in New England.\n\nWe then took our donuts elsewhere to find a treat for our vegan friend.\n\nI'll definitely be back!", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-06", "description": "Located close to the 24th St. BART station, Jelly Donut is a place to visit if you are looking for old-fashioned donuts in a no-fills setting.  I have tried several varieties including their old-fashioned versions and found them good if not overwhelmingly memorable.  \n\nWhat really steps this place up from any usual donut place is the friendly service.  Anytime I've gone there I usually have gotten at least a free donut or several donut holes on the house.  Along with the cheap prices, you should definitely visit this place if you are looking for a cheap snack with a smile!", "author": "Keith H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "The donuts are awesome, I got one fresh and it was perfect. Their coffee is also really good, they make the good coffee that you know you need to wake up, and they have a good variety. The staff was also really nice and friendly", "author": "Mina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "I've been craving donuts for weeks so decided to swing by here on the way to happy hour (Donuts and beer, it's the American dream). \n\nRating Breakdown:\n 1.5/2 Stars for Taste -- \nI got a chocolate glazed buttermilk donut and a custard-filled maple donut. The custard donut was nothing to write home about, but that buttermilk donut! So dense but not too sweet. All I needed was a cup of black coffee to wash it down. YUM. \n\n1/1 Stars for Value --\nIt's a little less than $1 for a normal donut and the most expensive pastry is around $1.75. Cookies are $.75. I paid $3.50 for my two special donuts, plus the lady threw in an extra maple donut for free. Money well spent, in my book.\n\n1/1 Stars for Customer Service --\nAt first, I was a little annoyed because the lady at the counter was watching TV on the phone. Timid ol' me stood in front of the counter politely for a good 2 minutes before the customer behind me was like \"EXCUSE ME.\" But, the lady threw in a free donut, so it's all good in the hood.\n\nNo bonus star because even though their buttermilk donut is bomb, I probably wouldn't make a trip here just for them. Rounding up to 4 stars!\n\nTL;DR: Solid cheap donut shop, but nothing special. Lady throws in free donuts. Cash only.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Really quick, people are super nice - the person behind the counter threw in an extra donut because they ran out of the specific donut I wanted. Amazingly kind people and really great service, for an amazing price!", "author": "Tejas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "In a world of gourmet this and artisanal that, it's nice to go to just a regular old school donut shop.  no frills here. no insane crazy flavors... just delicious donuts and all for a cheap price.  on top of that, we were given several freebees too!  our kid loved the donuts.  we loved the donuts.  the apple fritter was so damn good!  the only negative thing, i guess, is that my kid was hoping for a donut w/ sprinkles and they don't have those.", "author": "vlad k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "We came and left with more than we had asked for.\n\nTo keep this short and simple, I only wanted one donut and we left with 9. We had French glaze, chocolate glaze French, old fashion maple, old fashion chocolate, old fashion glaze, regular glazed donut, and a raspberry jelly all in one bag. It was a dream come true, I couldn't have been happier. The donuts were all very soft and delicious! I like the old fashion glazed donut the most! It is soft, chewy and jam packed with childhood memories.", "author": "Linda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Crumb donut, sugar donut, glazed donut, and chocolate custard donut. They're fresh, perfect, soft and we've got so many!  (She threw in 3 free donuts!!) $4.75. \n\nService = friendly!\n\nPrices = reasonable. Bring cash! (They've got an ATM inside, too.)", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "I was born and raised in The Mission up until I was almost nine, attend Hawthorn elementary, the works. I lived in the apartment right above the shop back then, where my God-sister lives now. Every time I take a trip to the old neighborhood, I have to stop by this place. The best jelly doughnuts ever. \n\nI am constantly reminded by my family that when I was still in diapers, I came down from the apartment with a fist full of pennies, just to buy a doughnut, I was still given one. This place is home for me and I will keep the tradition by bringing my kid up there to have the best doughnuts. Keep up the good work and see you soon.", "author": "Vicente C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Until my last day, donut shops like this will be one of my favorite things on Earth. You know the type of shops I'm talking about - inviting, straight-forward, classic donuts & service. The gentlemen working the counter is incredibly friendly and has a great attitude. 5 stars - no exaggeration.\n\nNo wi-fi though, so not the best place to work on laptops etc.", "author": "Joel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-31", "description": "Sunday mornin' comin' down . . . in this case, comin' down to the Bayview to hang out with several house churches from SF and Daly City, coordinated by famous speaker and author (and local) Francis Chan.  And hey, it's been a while since I've had a good apple fritter, why not stop somewhere and pick one up.\n\nI love the apple fritters at Happy Donuts at Pac Bell Park.  But they're not open until 10:30.  The Jelly Donut is open at 7:00, so there we go.  Besides, it gives me a chance to write another Yelp review, heh heh . . .\n\nThe Jelly Donut is located in the Mission District, the land of no parking.  I parked at 25th & South Van Ness, only one block away, which is pretty good.  A flat brisk walk took me to a tiny storefront with a few small tables and lots of donuts staring at me.  It's not the clean, white, too-sanitized look of Krispy Kreme;  just the neighborhood donut shop that looks like it's been here since Art Agnos was mayor.  $1.75 later, back to the car I went.\n\nThe fritter is big.  It filled the small white bag I took with me.  It was room temperature when I got it, not that that bothered me, I don't need it hot.  Slightly crunchy, quite tasty, took a long time to eat it all.  Happy Donuts is still better, though, because they have apple slices cooked inside and Jelly Donuts' apple is cooked in the dough.  Oh well . . .\n\nI should also mention that my bag also came with four donut holes.  So I can review the donuts, too.  Good ol' fashioned donuts, not the mushy stuff you get at Krispy Kreme.  I could probably eat my normal 8 donuts from Jelly Donut, whereas I find it hard to finish 4 from Krispy Kreme.\n\nA good place for breakfast, on your power walk through the Mission, a short snack.  Or if you're taking care of your friend's kids, and you want to get revenge on something your friend did, you can take the kids to the Jelly Donut a half hour before you take them home, feed them lots of donuts, and get them all sugared up before they go back to mom & dad.  They might blame karma for the hyper kids, but you decided to be mean, it can be our secret ;-)", "author": "Ron L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "I have been passing by this donut place several times and today I had time to come in, thinking about getting some donuts. There was one customer in front of me and when it was my turn the Vietnamese lady was very rude and impatient with me. She didn't even want attend to me and helped another customer because I had some questions about the donuts. Don't know how they do business.....very unprofessional. Basically drove me away and no I did not get to try their donuts. This review is for the unfriendly service I got. Too bad, so sad.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "These are good donuts for a good price. The guy working there gave us a 7th donut for free with our purchase of 6. \n\nThey have a pretty normal selection of donuts - things you'd find at most donut shops, but some have a twist (like the Boston creme-like donut with maple frosting instead of chocolate).\n\nAll-in-all, a good experience and I recommend it. \n\n(Also, I wish people would stop comparing this and Dynamo, which is down the street - they are completely different things and both are good.)", "author": "Jude T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "These are some perfectly fine donuts.  There isn't much else to say.  They're really cheap - all less than a dollar.  They're sugary.  They're made fresh daily and thus hold up fairly well through the afternoon.  And they pack them in the cute, trademark pink boxes of all donut shops around the city.\n\nThe maple donut is really solidly maple-y and I appreciated the use of a somewhat alternative jelly (i.e. raspberry) in the jelly donuts.\n\nThe cake donuts are a little drier than I'd like, but such is life.\n\nCash only is a big boo, but at least they are super close to BART!  I'd go back, although I'd much prefer Krispy Kreme...", "author": "Tay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "The best doughnut shop in San Francisco! Luckily it's right around the corner from me", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Best donut place I've ever been to. Everything is super tasty and you get a lot of stuff for free from the nicest staff in the world. I'm not kidding. Unbelievable.", "author": "Avah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "They may not be your \"what would you like today, how was your day\" smile type of staff all of the time...okay most of the time they aren't. But the donuts are fresh, on the way home, and hit the sweet carby spot every time!\n\nAlso, don't be alarmed that the donuts are a $1 or more here...they always throw in an extra donut, a handfull of donut balls, or more! And I'm always shocked when I walk out with a bag of more than just that one donut I asked for because the employees don't smile and they secretly add in the donuts for you! Lol, I guess the extra donuts really do prove their love for customers. \n\nFree donuts show that actions speak louder than words!", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Stopped in here at 9am on Memorial Day to pick up a few donuts and a cup of coffee. The coffee, I think it was the Hawaiian flavor, was one of the best cups of coffee I had in San Francisco. The buttermilk donut with chocolate is possibly the best donut I've ever had. The woman working the counter could not have been nicer. The customer who was in line ahead of me was clearly a regular at The Jelly Donut. I look forward to coming back on my next visit to San Francisco.", "author": "Lindsay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Three stars for the donuts, which even early in the morning are good but not incredible; but, a big star for the fast, friendly service, which even added a couple of donut holes for my 19-month-old for free (free extras seem to be a thing here).  Also came by two nights ago and had a couple of donuts right before they closed on Wednesday night; they don't do a second run of new donuts midday, so if you are coming by here late, expect relatively stale raised donuts (but I'm sure the cake/old-fashioneds are just fine).\n\nBut again, on both visits, the service was super friendly, chatty and cool.  Lots of attention paid to my daughter and you could tell these guys have a relationship with a lot of the locals.  And the prices here are very fair; 85 cents for a glazed ring.  Would come back if I lived here!", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Great place I came here with my husband for dessert! I grew up on these donuts and it's been a long time since I been there ! Love the apple fritters , I was going for a jelly one tho , but still happy!", "author": "Pooh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "This place is great! Really cheap, CASH ONLY, and delicious fresh donuts. A big assortment of coffee too. For sure make a stop here.", "author": "Aliya J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Donuts here will make your morning perfect and special. They are well fried and  made with touch of heart.\n I am in love with Jelly Donuts", "author": "Paige C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Super nice folks, no line, fresh donuts.", "author": "Geoff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Some of the best donuts I've ever had in my life. If you want donuts and are near Mission, give this place a chance.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "This is perhaps the strangest donut shop I have encountered. For some reason, you order one donut and they always give you two. Some times they give you even more than two. Once evening, for the price of one chocolate glazed donut we received a chocolate glazed donut and six donut holes. It's something to show your friends when they are visiting the neighborhood, like a magic trick. No one believes you when you tell them, and then it happens!\n\nThe donuts are average coffee shop donuts, no artisanal craft cronuts for the hipster consumer. But if you are craving a donut, have a friend, and don't have much cash, this is your go to place.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "This place is such a gem. The service is fast and friendly, there's never a line, everything is super fresh and prices are dirt cheap.\n\nDonut holes are $1.5 for a dozen. Most donut things are between $1-2.\n\nAlso, as others have said, they always throw in some extra for you. I've only tried their donut holes and glazed donuts so far and they've been great paired with some Philz coffee from next door.", "author": "Yan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "It was my first time and the guy is just SO friendly! I just wanted a custard filled donut and he threw in some donut holes to fill the bag (quite generously).", "author": "Raakin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "CURRY MAPLE DONUT WITH TOPPING PLEASE. Posted an extended review with photos on linkedIn.(com/in/uzsmalls) \nhttps://www.linkedin.com/pulse/jelly-donut-1-coffee-outside-fast-food-beltway-u-s-alberto-rivera", "author": "Alberto R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "3.5 stars because of the amazing service. I didn't eat the donut the day off, so the taste of the donut could have definitely been skewed. However, I still had really good day old donuts in the past, so am not sure what to really think in this case. My friend and I stopped by to pick up some donuts after lunch around the corner at Wise Sons Delicatessen (delicious). The Jelly Donut was rated one of the top Glazed Donuts in SF by 7x7, so I've been wanting to compare their glazed donut to Stan's Donuts from Santa Clara (one of my personal favorites). I purchased half a dozen glazed to split with friends, and the girl behind the counter was super nice and threw in some free donut holes and a chocolate glazed donut for free. She also didn't charge me for the plastic bag. \n\nThe bf and I heated up the Original Glazed Donut (http://www.yelp.com/biz_photos/the-jelly-donut-san-francisco?select=8xfsY3sBhNS87oPXsLsJ0A#8xfsY3sBhNS87oPXsLsJ0A) in the microwave the next day (like we normally do), but it still had a stale-ish taste. The donut was also dry and not very fluffy, so we definitely felt let down after the high expectations from 7x7. In any case, I'm giving them the benefit of doubt in this case, and will have to come back and try a fresh donut next time. However, this is one of the friendliest donut shops I've ever been to, and they definitely have a great customer service! Parking around this area of the Mission usually isn't too bad, and there should be a good amount of metered spots available.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "This place is great. It doesn't look like anything special from the outside but the employees are very friendly, the donuts are fresh, and the prices are cheap. Most of the donuts cost $1 and the employees will often throw in extra donut holes or broken donuts for free. I have had a chocolate coconut, old fashioned glazed, and an apple fritter. The chocolate coconut was my favorite, I like that their donuts are denser and cakier (I'm not a big fan of the airy Krispy Kreme style donuts). \n\nI would give it 5 stars, except the coffee is just ok (but only $1, so can't complain much) and I've only seen powder creamer instead of cold regular milk and cream.\n\nIf you're near the 24th mission BART station, walk by and grab a donut here!", "author": "Christine B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-26", "description": "Okay, you come to a place called \"The Jelly Donut\" and this is not the conversation you'd be expected to find:\n\nCustomer: What kinds of jelly donuts do you have?\nWorker: We only have one kind, raspberry.\n\nOkay, maybe THE jelly donut, is the raspberry donut. It should be frikkin amazing yeah? It was okay. Glazed on the outside, with a good amount of jelly on the inside. Comes with a few donut holes, and only $1.75!\n\nAt this price, I'm willing to give this place another shot. Everybody raved about the staff being super friendly. We were served by a big/tall guy who didn't really smile nor make small talk. He wasn't mean, but he also wasn't friendly. Just very to himself. \n\nPretty cheap donuts so yeah, I'll come back to try the other ones.... 1 dozen donut holes! $1.50\n\nTook a picture of the menu so you guys can see pricing. Hope it helps.", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "My new ritual donut place on the weekends. So soft and fluffy- and the business owners and employees are so kind!\n\nThey'll even throw in some extras :)", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Excellent Donut establishment. I come here for donuts for my job and they always greet me by name and show great customer service.", "author": "Vonny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "One word: AWESOME. \nA charming, quaint shop located on the corner with only the words THE JELLY DONUT luring you in. We must stop.\n My partner in crime is one of the most passionate jelly donut lovers I know. Sometimes double fisting with coffee. And now I myself am on a personal quest to find the perfect donut. I've had donuts that are: \n- too artisanal (Dynamo donuts in SF... Review to come)\n- too mainstream (dunkin donuts- locations everywhere) \n- too sweet (Dough in BK) \nOr just too damn plain (Krispy Kreme) \nBut THE Jelly Donut has gotten it just right. Now this by no means signifies the end of my search. Absolutely not. BUT this donut is damn good & perfectly old fashioned. Not the \"old fashion\" donut but the feeling of reminiscing you get when you walk into this place is priceless & I don't think it matters where you're from. Coast to coast. \nThe people are super friendly (friendliest in SF that I encountered because people are effing rude here... Surprise, surprise) and engaged us in interesting small talk about topics such as donuts, odd weather, and traveling to the East coast. \nSuper cool and kudos for the extra donut and donut holes. \n\nDope donut spot.", "author": "Sasha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "This is your old-fashioned, neighborhood, mom-and-pop doughnut place. And I really did love the vibe and the prices. I was hoping to be wowed more by the doughnuts themselves, but I wasn't. None of them were bad...and I'd love to give them 3.5 stars but that's not an option and they aren't worthy of a four. Perhaps based on service and the extra doughnut holes they throw in!\n\nMaple old-fashioned: my favorite of the bunch. A little too dry inside and crunchy, and not as flavorful as excellent old-fashioneds (my favorite) should be. But still decent.\n\nCrumb cake - was hoping for so much more, but just not feeling it. One of the people I was with did love it and got another one to go! (with more free doughnut holes)\n\nGlazed holes - a favorite amongst two of the four of us. I thought they were fine, but maybe a little overfried.\n\nRegular glazed - I actually liked the regular glazed doughnut more than the holes. Maybe it was from a different batch or fried less, but this was pretty good.\n\nAll in all, decent doughnuts and due to the price, it's an easy go-to if you want a quick fix!", "author": "David B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-21", "description": "Go to buy Dunkin' Donuts if you decide to come here. The donuts here are nothing special.  They were very oily and not tasting good at all.", "author": "April P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Loved this place.  This is absolutely no frills very small neighborhood donuts shop which was founded in the 80's and run by the same family ever since.  If you are looking for trendy ambience and a stylish place to go, this is so not your place.  But if you appreciate genuine friendliness of the owners and very affordable selection of doughnuts and house coffee, then this place is for you.  I'm not into doughnuts, but ended up going to this place while waiting for my car breaks to be worked on in a break shop across the street.  There are literally only four small crowded together tables.  When I asked the owner named Panda if it would be OK for me to stay there for a few hours, she was very open and welcoming.  So I bought a coffee and a doughnut and settled down at one of the tables.  When I opened the bag it tuned out that in addition to the doughnut, the owner sneaked in a bunch of tender melt in your mouth doughnut holes.  What a nice surprise, I loved the doughnut holes. The regulars were filing in one after another; the owner knew all of them and had a kind word for for everyone, asking about their work and families.  You don't get to see places like this anymore.  I would definitely recommend this place to meet anyone's doughnut needs.  It is close to the 24th Street BART station.  If you need a box of doughnuts for the office or for any other reason, please give this place a shot and support locally owned family business with in-house freshly baked doughnuts and delicious doughnut holes.  Cash only, please!", "author": "Brandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Great selection and super friendly owner gives free donuts with your order! *cash only", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "Im a big fan of small businesses little donut shops like this are heart warming easy on the pockets and great fresh pastries daily nice and warm the coffee flavors could be bigger but other than that good place tongrab a quick donut and coffee for the road", "author": "Johnny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "You'll get an honest to goodness, thick, unpretentiously named doughnut like the ones they serve at diners and coffee shops for $1 each, and then some.  By \"then some,\" I mean that the nice lady (you have to be nice to her) had thrown in some doughnut holes and an extra doughnut in my bag!  This kind of thing doesn't happen to me very often - actually, at all.", "author": "Yoshi O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "I have strong feelings for The Jelly Donut. More than love, I lerve the Jelly Donut, I luff the Jelly Donut. I also enjoy good / great customer service and family owned and run coffee shops. It's $1.50 for a medium coffee which is fine by me, and they have the best Hawaiian Hazelnut coffee I've had, which is saying something. \n\nAll doughnuts are made in-house so very fresh. My personal favorites are chocolate or maple custard filled eclaires or anything jelly-filled, or an old fashioned, or a plain glazed, or honestly I don't care what I get, I'm an equal opportunist when it comes to doughnuts.\n\nI actually have to walk on the other side of the street to avoid stopping in when the crosswalk light is red in the morning on the way to Bart. Also, those drunken nights are dangerous, not only because it's the Mission, but because of the entrancing effects of this hole-in-the-wall donutery. Very cheap and you can pretty much count on a few fee donut holes and sometimes a full regular sized donut, too.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "The classic. The taste of their donuts is so nostalgic but never gets old. I'm not too big in donuts, but I crave their donuts every time I walked by.  I also have to mention how cheap they are!!!  Please try their old fashion.", "author": "Kaya O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "-As everyone has mentioned- they throw in a free something-or-another almost every time. \n-Customer service is great at 530am. \n-The donuts are no frills, fantastic. \n\nI love this place because it is the mission's version of a donut shop. Good quality. No pretentiousness. Great prices.", "author": "Sydney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "This place is awesome! Great service and great donuts at a great price. A couple times each week I'll stop in to grab a donut on my daily walk. I don't think I've ever gone into this place and not seen the employees smiling and offering conversation. Oh ya, don't be surprised if you get one too many donuts in your bag this place really hooks you up.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-27", "description": "Man I definitely ordered the wrong donut. I had a huge craving for a donut the night before and made an effort to wake up early, grab a donut and arrive to work on time. I'm just now realizing how much of a Fattie I am! Anyway, came here super excited and ordered a sugar donut and the maple donut with nuts on top. The sugar donut was pretty standard , nothing too special. But the maple donut) oh man I was so not ready for the curry flavor. It totally killed my palette! Don't get me wrong, I love love Indian food but curry in my donut? No thank you!! I wish I would have known ahead of time before ordering that. The service was great and it was sweet that they added donut holes to my order but ugh, curry maple donuts were terrible!", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Donuts are ok. Nice lady to she gave us hella free donuts lol so my bf decided to gave a tip we dont usually give tips lol ..", "author": "Lara J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Little local donut shop, tasty donuts. I wouldn't say they're the best donuts I've ever had in my life but they hit the spot when you have a craving. And they always give you extra! Winner!", "author": "Allie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "This place is exactly what you'd expect from a small neighborhood corner donut store. The donuts are excellent & a good selection. I can't speak to the coffee, but they have chocolate milk, so I'm happy.  \n\nThe night staff is awesome. I always stop by late to get a few donuts for the morning and magically end up with double the amount in my bag!\n\nI tip generously and stop in here often. I hope this place never goes away and turned into another Starbucks. We need local places like this one. \n\nIf you want to pay 5x for a fancy lingonberry & vanilla bean espresso crunch topped donut, keep walking to Dynamo, hipster. This place is for real, solid, regular ol' donuts.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "Oooh, review number #1111! There was a time when I lived in this neighborhood and would stop by every week to pick up a box of doughnut holes and bring them into work with me. I love being the bearer of sweets. \n\nThere is something about the little doughnut hole that is irristable. Maybe because they are the petite version of a glazed doughnut. Smaller means less calories, right? \n\nThe Jelly Doughnut is cheap, has fresh doughnuts and fast service. Plus you can be the thoughtful coworker who brought the sweets in, which is priceless.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Look, I'm not going to sit here and rave about the quality of the donuts here. The donuts are average.\n\nWhat I will do is offer a warning to anyone attempting to exercise self restraint. Every single order I get over twice the food I asked for. This wouldn't be a problem if I was one of those people that can just have a bite of a donut and forget about it. I'm not one of those people. I consistently eat entire the contents of my bag o' donuts. If you're like me, order conservatively. \n\nDid you get that? Let me put it this way:\n\nYou know those donuts you're about to order?\nCut that in half.\n\n\"but Jarvis, I've got such a big appetite. I need me those sweet sweet doughy doe-does\"\n\nAre you mad? Cut your order in half. Also, \"doughy doe-does\"?\n\nAnyway, this is the kind of place that sells you a half-dozen donut holes for $0.75 and throws another half-dozen in your bag because they feel like it.\n\nI don't know how they stay in business, but while they're still slinging them sweet sweet doughy doe-does, exercise extreme caution.", "author": "Jarvis J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Jelly Donut.\nNice dude at the counter\nCost effective. small coffee and two donuts for under $3!!! Hell yeah!\nTell you what else, this is a legit place, no hipster vibe, no snooty vibe, no out of touch vibe, just a coffee shop vibe. I've had better donuts and I've been in nicer cafe's but this one is so perfect being exactly what it should be that you must accept it.", "author": "Tommy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Ahh you had me at Jelly'....\n\nThis had to be the most scrumptious donuts I have had in a long time. Top it off  with a great conversation with the Staff. Made my stay in San Francisco even better.\n\nFirst time in there i was greeted by the staff. I explained I had  just come from Dynamo Donuts around the corner. Dynamo charged my girlfriend a hundred bucks for two donuts with maple bacon on it.  Basically they played this Jerzee native. The women in the back said \n\nStaff: Everyone comes there after  bacon donut\n\nMe: Yea I like a classic Jelly donut \n\nStaff I always wanted to try those \"gourmet donuts\" from Dynamo\n\nMe: Why not \n\nStaff: I think i have enough Donuts in my life\n\n\nGood thing this place has its own Hero. And its is not only the exquisite employees. It is the extra donut holes thrown in your bag. Then I found out on down low.  Really simple. Everyone will get a free donut. I really thought i was special and it was just me. \n\nHeartbroken.\n\nI feel like  a d()---nut. hole\n\nI didnt spend that much here. It is  dirt cheap.", "author": "Andre N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-17", "description": "Good donuts for a decent price!\nI got a dozen and it costed $13. \n\nI love the chocolate french crullers (they cost more for a reason)! Sweet, fluffy, and filling. Perfect to satisfy your donut cravings!", "author": "Hye-Min O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-03", "description": "Great donut place. Traditional style.. Which you could find in other great places. Best thing going for them is they are down the block from Philz!", "author": "Diane V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "This place is great. Old fashioned donuts with great service, free donuts from a smiling staff and, in general, a fun and friendly place. \n\nI used to go to dynamo for a 3 dollar donut. I got three donuts for less than three dollars here. And they taste better. No brainier.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Totally worth the trek. Went ham and bought 20 donuts.", "author": "Shawn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Ive been going there since i was about 5 years old. Started off with the doughnut holes and now i take my daughter here every sunday for coffee and doughnuts. Best doughnuts in the mission and good selection of coffee. Family owned and excellent friendly customer service.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Now this is a donut shop! After a horrible experience at Dynamo a few\nblocks earlier...which my friends refuse to acknowledge really happened, \nsaying it was a shared nightmare, we walked further up the street and \ncame upon this wonderful mom and pop donut shop. The husband and\nwife were very nice. On top of the fact that the donuts were absolutely\ndelicious and oh so fresh,  the woman gave us extra donut holes in each\nof our bags. The husband was bringing a fresh batch out as we stood there\ndrooling at the counter.\n\nThe donuts are a third of the price of the froo froo donut spots but 100%\ntastier. Save your money, time and appetite and head over to Jelly Donut for a truly\nawesome old fashioned donut experience.  I'm sitting here now wishing I had one\nof their glazed donuts to accompany my morning coffee.", "author": "Neen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "I've never been a fan of donuts, but I've been eating these like I drink water - so tasty! Every morning before I head to work, I get one donut and a cup of coffee (affordable breakfast fix!), my favorite is the cake donuts and love the donut holes. This is a small joint and the staff is very friendly, and they always give me extra donut holes (which makes my morning every time). I love that the donuts are not super sweet, they are cooked to perfection and taste delicious. The Hawaiian coffee served here is also pretty good. If you are ever in the Mission and crave donuts, I'd totally recommend visiting Jelly Donut!", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Holy crap, this place is awesome!\n\nI always biked by it on my way to work and never had time to stop. Today, I did, and boy, did I regret every single time I didn't stop in the past. Just your good old-fashioned fluffy and deep fried donuts. If you're looking for good donuts, skip Dynamo and just come here instead. It's the classics done cheap and well... you can't argue with that.\n\nI ordered a crueller and was surprised to find four extra donut holes that I did not order in my bag. Free stuff? In San Francisco? A-M-A-Z-I-N-G. The crueller was one of the best cruellers in my life -- perfectly textured with the right amount of crunch and fluff. The donut holes were a little underwhelming... but hey, they were free! Not gonna fault them for that.\n\nSeriously. I hesitated writing a review for this place because I wanted it to be mine, all mine... but that's just selfish. So go forth and eat your donuts. From here.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "A must stop if you're in the area on a weekday morning. Super friendly staff and a flurry of locals coming in for their morning donut. \n\nIt's traditional donuts done fresh and better than most. Every donut comes with a few bonus donut holes (yes!), and most donuts are under $1. \n\nA no frills donut shop that will leave enough money in your pocket for happy hour.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "AMAZING donuts! I arrived at 7:45 on a Thursday morning and the donuts were fresh out. I ordered the french glaze and the chocolate donut filled with creamy goodness. The latter is probably the best donut I've ever eaten. Not only were the donuts mouth watering, the service was impeccable. The lady helping us was extremely friendly and she threw in 8 extra donut holes... just because! I will be returning until I have tried every variety, and then I'll start a second round of tastings just to make sure I didn't miss anything!", "author": "Emmy Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "If I'm anywhere near the Jelly Donut, I always stop by.  It's a simple donut shop with a great variety of pastries, an out-of-San-Francisco price, and extra donuts with every purchase!\n\nFeeling hungry?  Grab a donut!  Not feeling that hungry? Get a donut anyway! it's only 85 cents! The donuts are made fresh every day, and generally run out later in the night.\n\nThey also have coffee and various drinks, for those so inclined.", "author": "Chen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "The perfect classic glazed! (It was even delicous and moist the following afternoon.) The crumb cake donut was also amazingly delicious, I've actually never tasted anything like it! Love supporting these mom and pop establishments, too!", "author": "Elicia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "The best thing in San Francisco. Perfect. The only way to describe it. I happened to walk in the first day of my vacation in SF and I was instantly hooked. I went every day. There are many great things to see and do in San Francisco but, silly as it sounds, nothing else has the same simple perfection of The Jelly Donut. Every time I walk in I get  a warm \"Hellooooo!\". I order my donut, jelly of course, and they always throw something extra in for me to try. I've never had a better donut. Jelly donuts aren't even my favorite, but their jelly donuts are beyond all else.\n\nThanks to all the great folks who make the place so wonderful", "author": "Jean-Claude T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "Donut holes! I am never going to loose weight with these delicious donut holes near my work. People here are very friendly and will get you in and out right away if you are in a rush. I'm an old fashion kind of girl and their chocolate old fashions are really good.  4 stars because sometimes they run out of donut holes. :(", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "My favourite donut in SF. They always give free donut holes with the donuts and the owner is always smiling and laughing. Three thumbs up.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Perfect for a good ol' classic donut! I'm a fan of \"normal\" donuts like chocolate old fashioned, and this place does them perfectly. They also give you free donut holes with your purchase, nice tasty bonus. If you prefer your donuts without bacon and fruit loops, try it here!", "author": "Brigette A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Best donut shop in s.f hands down! Fresh, delicious, old school donuts. Friendly staff/owners. Love the freebie!", "author": "IP B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "If you are teeter-tottered in the mid-20s Mish around (but not a minute after) midnight, then it behooves you to totter that teeter to a modest spot kitty corner from a shop selling luchador masks, and sop up the error(s) of your ways with a donut or two and likely more than that.\n\nIn spite of their name, they don't know the meaning of the word \"donut\" at this store, because the plural form reigns supreme. Order a pair and you will be rewarded with a bounty of extra donut holes. I tried ordering a single once and the order was magically tripled. When I stood there agape at the goings on, Ms Donut offered: \"do you want more?\" (I ordered a dozen and got much, much more.)\n\nJust as the Platonic form of Quantity stalks their sweet-smelling premises, so too does Quality lurk eagerly behind their brightly lit display. These tantalizing toruses are fresh, cakey, and light. I find their frosted features a bit on the sugary side but that's hardly an error. Their plain cake donut is my fave but even the smallest morsel of their fresh glazed donut holes will make you lightheaded. \n\nWhat I'm trying to say is: I like this place and I like their donuts, and you should eat there because it's tasty and has good value.\n\nObligatory Title Pun: I don't think you're ready for this JELLY.\n\nMenu Readability: Just look at the donuts, fool.\n\nNeed to mention: Prices are so low as to be laughable. You will fork over a generous tip because you're not a jerk.\n\nWhat this place teaches me about myself: Keep your burritos. Donuts are the true drunk food.", "author": "Vivek S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "No bacon or potpourri on my donut, please. A glazed old fashion and the only addition I would like is a tall glass of milk on the rocks....mmmm.\n\n*you might find a couple o' freebie donuts in your bag.", "author": "Darth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "I was across the street having work done on my car at 8 30 when I saw a sign for doughnuts. I like doughnuts but rarely am I up early enough to enjoy them .   This is clearly a place for cheap coffee. I got 2 twists with chocolate icing and the guy through in an iced cake for free. The doughnuts were good but not amazing. Typical SF. They were fresh though. I probably wouldn't go out of my way to get here but if I lived here I'd be fat!", "author": "Corey Jace W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "Such nice people work here. I get old fashioned, AFFORDABLE coffee here almost every morning. I also like their ATM.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Always hooks it up! Amazing!\n\nThe lady at the cashier has the sweetest heart in the world! She always gives one or two extra donuts in everyone's bag!", "author": "Edgar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Typical donut joint on the corner of Van Ness and 24th.\n\nYou won't find any maple-bacon-strudels in here; just the good, old-fashioned kind. The kind you would get with your dad on a random Sunday morning. The kind your mum would buy a dozen of for your school's bake sale (even though her apple pie was a gazillion times better): you know, glazed, chocolate-covered, sugar and powdered donuts. Some cake donuts. Some custard-filled, some jelly-filled. Some maple-glazed, some chocolate-glazed, ALL of them delicious.\n\nMy favorite part: the guy working the counter who apparently makes the donut holes when (and because) he's bored. ...or so he says. He's very sweet and even throws in a few donut holes with your order; a small gesture but greatly appreciated.\n\n+Cash only\n+Yes, they serve coffee\n+Yes, they have milk (regular and 2%)\n+Yes, there's plenty of seating", "author": "Adena B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "I'm really happy to call The Jelly Donut one of my regular donut shops. The staff are super friendly, and the donuts are amazing. They do cake donuts right, and their raised donut holes aren't too bad either (actually, they are some of my favorites!).\n\nIf the donuts weren't good value already, they usually throw in a donut or two on top. You will never see me turn down a good, free donut.\n\nStop at The Jelly Donut when you want a good, traditional donut in the Mission.", "author": "Carrie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Best doughnuts shop I've even been to! It's my favorite! Can't say more than there doughnuts taste great! It's near the 24th Bart station, it's better taking Bart to here than driving as I always get a ticket in this neighborhood. Cops are insane! And the system sucks. But the doughnuts are awesome!", "author": "Mahmoud A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "As other reviewers have stated one of the main draws here is getting bonus donuts in your bag.  I stopped by one morning and purchased one crumb cake donut and one chocolate covered custard round.  When I returned to work with my morning snack I found an extra crumb donut inside the bag.\n\nThe crumb cake donuts (http://www.yelp.com/biz_photos/np1YpFt9GfX-umR1ZKx_uA?select=xlDGpQjRzb1hdpkJnRV_ZA) were soft and fresh with moist cake and crumbs falling everywhere.  The sugar overload definitely helped to hype up my morning.  The chocolate covered custard donut (http://www.yelp.com/biz_photos/np1YpFt9GfX-umR1ZKx_uA?select=RNoD2CLUKnpunN7MyYVfcg) was good, but I was a bit disappointed with the small pocket of custard inside.  I like custard donuts loaded with custard.  I'll return one day to see if their jelly donut is special enough to name a shop after.\n\nIt's a small shop on the corner of South Van Ness and 24th Street.  The staff is friendly and they have a very good donut selection available.  Since I've only been there once I can't say whether they always do the bonus donut thing, but that will definitely bring me back to the store.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "\"And that's Mr. Jelly, or Ms. Jelly, to you!\" That's what my heart told me after sacking the bag full of donuts on Saturday night at 11pm. Sober, I am ravenous for a donut. Drunk, I am a wobbly, top-heavy, donut raven for donuts. Around 11pm, this place was open. \n\nThe order was one plain old-fashioned, and one maple-glazed nut old-fashioned. \nThe price: $1.70 \nWhat was in the bag: the two said donuts -- alooooong with two glazed donut holes and a sugar covered jelly donut. \n\nWolfgang puck has mid-coursed me. Cocktail bars have handed me complimentary Fernet. Free beer from brewers have happened. But really, maybe it's my post-burger, post-martini glazed over eyes, but being mid-coursed with a jelly donut by Ms. Jelly Donut takes the cake.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "Crumb cake, cinnamon, glazed, custard-maple......they all exist here in donut form. Delicious, fresh and cheap - that's one dangerous combination!\n\nSaw this place on the SF 7x7 list and decided to check it out. It was just after 9pm and I knew finding fresh donuts at this hour would be a gamble, but this place did not disappoint. \n\nTheir selection is somewhat small, but they had all my favorites - cruellers, old fashioned, regular glazed, cinnamon, maple, and even a few custard filled. My hubby and I opted for a dozen, and the lady behind the counter was nice enough to throw in FIVE extra donuts. Yes, five. I ended up having to give donuts away to my family because we had so many! \n\nShe also didn't charge the extra 50 cents for all the specialty donuts we chose. Crullers and donuts with fillings run an extra 50 cents, but she only added the upcharge for about half of them. We ended up paying $9 for 17 donuts, if you count the freebies. And I didn't think there could be such a thing as good service at a donut place, but the Jelly Donut proved otherwise.\n\nI wish I didn't like them so much. The last thing I need is an excuse to eat more donuts. Sigh...", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "When I worked in the Mission, I used to walk by this shop all the time on the way to Philz. I could always smell the alluring smell of freshly baked donuts. I finally stopped by on my last morning working in the area (about 2 yrs ago - yes, I know, late but I'm trying!!) to bring some treats to my co-workers. It's a tiny shop but super friendly owners. They gave me suggestions on the popular flavors since I wanted a variety for everyone to have their choice. They were a major hit with everyone when I brought them back. Soft and fluffy. Sugary goodness.\n\nCash only.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Classic doughnuts. They do not disappoint. They usually throw in free doughnut holes....YOU ACTUALLY GET THE WHOLE DOUGHNUT. They are priced well and I am always satisfied when I leave this place.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-20", "description": "nice southeastern lady services with a smile and positive demeanor. jelly donut is just a corner location. just a few tables for sitdown.\n\ncoffee: farmers, passed\neats: french cruellar(1)\n-nice texture ala cream puff, on the sweet side\ncake crumb donut(.85)\n-soft and cake like\nfree do-ho's \n-a bit oily but it's free,  i dig it!\n3.5 stars\n\ncrumbs:\n-parking not good around here\n-cheap donuts, friendly service.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "It's not the best donut I've ever had but I went there today as I waited for my car to be ready across the street and the guy was really nice. I bought two donuts and he threw in some donut holes. \n\nThere aren't too many places where you can get two donuts and some donut holes for $2. \n\nA regular guy came in after that and forgot his wallet and the guy told him he could pay the $3 tomorrow. \n\nThat's the kind of customer service you just don't see anymore. \n\nFor that alone, I'm going to go back when I'm in the neighborhood. T\n\nThe donuts were decent and it was a quiet place to sit and do some work for a couple of minutes. \n\nCASH ONLY!!!", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Best original old school donuts in SF. The Jelly Donut has been open since the 80's. Perfect fresh fluffy hot donuts of all types. Donut holes are a hit! The glazed donuts are perfect and always fresh! The French Donuts delicious! The apple fritters are huge! Don't forget their fresh croissants! The best!!!", "author": "Vibol P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "One of the best donuts spots in SF. I've been coming here since I was kid. Great glaze donuts. They also hook me up with some extra donut holes. And awesome service.", "author": "Selvin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Delicious and inexpensive. Friendly employee. What more could you ask for?! I love this place!", "author": "Kara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Excellent, classic donut shop.  Great place, if you're just looking for an OG donut without all the frills and fancy toppings, or bacon!  Owners are super friendly and cute!", "author": "L. Boogie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-31", "description": "This is the anti-Dynamo Donuts.  No hype, no pretension, no fancy yuppy bacon flavors, just a local family-run business with tasty donuts, made fresh.\n\nI tend to stop here every other week en-route to work and buy four dozen donut holes and an apple fritter, and they throw in a fifth dozen holes free, for a total of $7 or so.  \n\nAll my co-workers think I'm amazing when I do it, because I'm bringing in a massive quality of donuts, but it's like the cost of two lattes near my office!\n\nThey don't get a forth or fifth star because they're not that differentiated from any other donut shop with low rent and high quality, and I doubt I could blind-taste-test tell their donuts apart from a number of other shops I've been to that are in a less convenient location for me.  \n\nBut the staff is quite friendly.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "This place was good not amazing, but it did the deed. The selection was limited. Their maple donut with custard was good. The jelly donut was average. It was affordable for sure. My future mother in law was impressed. And we were all fans of the customer service - including the extra donut holes. This is the highlight of this place, otherwise you get what you paid for.", "author": "Mario G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "As far as donut places go this one is perfect. Ok, there are a few details that should be overlooked. Like the old dude that sits here every morning and drinks his watery coffee and eats a donut or the old decor from 1988 or the florescent lighting that makes everyone look sickly. All that aside the people that work here are great, friendly, helpful and always willing to throw in an extra donut if you buy one or a box. \n\nThe donuts are all good and fresh. There are no old pastries sitting on racks in the window display for weeks on end.(You know what Im talking about, those strange panaderias nearby). I have had them all from Jelly donut to donut hole and they are all good and at a great price.  \n\nIts a place for the non-health savy or concerned by thats fine by me. Eat a donut and be happy.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-13", "description": "I don't always eat donuts. But when I do, I get them from here.\n\nWho am I kidding. I always eat donuts.\n\nBut for reals, the family that works this shop is the best.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "Great place, may this mom and pop run shop last forever! Very nice people who give away free donut holes.  No screen-glared laptop zombies to be seen, come down and step into what feels like another country (and time) when shop owners were  members of their community.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "Glazed doughnuts are fluffy and moist. Like eating sweet pillows!", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Cute donut shop with a sweet little lady behind the counter. Very cheap prices and she even threw in a free donut and cleaned our table. Leaving a small tip seemed to brighten her day :)", "author": "PJ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "Donuts served by a sweet elderly lady.\n\nI walk in. I ask for what flavor jelly donuts they have. The lady conveys there are no flavors, just jelly. I order one. She throws in a few donut holes.\n\nI normally don't like jelly in my donut but it was in the name of the store so I had to order one. It wasn't anything special. Red Robotussin flavor. The donut surrounding it however was fine.\n\nThere aren't any special or unique flavored or prepared donuts. It's just a tiny donut shop among a dozen of donut shops in the Mission. The only difference is the lady behind the counter.", "author": "Rahil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "This place is wonderful good customer service and they always give good donuts this is by far the best donut shop in the Bay Area", "author": "Eduardo P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "I recently came back home - and by home I mean The Jelly Donut.  I felt like a kid nearing the entrance to Disneyland as I approached the corner of 24th and South Van Ness.  And as usual I couldn't decide what to buy or how many to buy so I went with a dozen...but I still couldn't decide as everything looked so appetizing.   I took a couple old fashioned, glazed and crumb topped donuts.   And just like everyone has mentioned, I walked away with a couple surprises!  I only wish I made it in time to buy some donut holes (dozen for $1) but I'm not surprised that these treats go fast.  I shared the donuts with a few others and everyone loved them.  \n\nI can't say enough about these donuts; they're not greasy, not too sweet, never stale, always fresh and always delicious.  The staff is always friendly, patient and well deserving of a tip even from an absolute cheapskate like me.   If you like donuts you will LOVE this place and even if you're not a fan of donuts this place will convert you.  I'm already thinking of my next visit!", "author": "Bánh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "This place is friggin amazing! Awesome family fun spot with great donuts and they're super generous. I just wish they were open later! If you in the mission and need donut - look no further!", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Ever go to San Francisco? Go to the Jelly Donut. They not only have fantastic jelly donuts, but the man behind the counter gave me extra donuts with my order for free just because he could. It's good customer service that tends to go unnoticed. (:", "author": "Dan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "One of my favorite places in the Mission. The doughnuts are delicious and the service is amazing. It's a great bang for your buck. When I bought doughnut holes they even threw in a few extra. As a visitor from the DC area I would recommend going here!", "author": "Daphne E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-28", "description": "A good old fashioned donut shop.  Good prices and excellent customer service!!!", "author": "Funk G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-26", "description": "So this place is probably my favorite donut place in the entire city, which is why I couldn't bear to give it one star and decided to give it the two stars.  The last three times I've been there, they've had huge flies in their glass donut shelves.  Each time, I've mentioned it to them, they apologize, but clearly don't really care enough to try to do something about the problem.\n\nFlies in the donut area are gross.  I've seen the flies actually landing on a donut, i mentioned it to them, and they didn't even throw the donut away.  So, despite this being my favorite donut place (especially when the donuts are fresh in the morning), they are a little nasty and need to invest in glass doors to prevent flies from coming inside.", "author": "Banana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "The lady always gives us free donuts when we order. Thanks.", "author": "Michael V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "The adorable little lady who's always at the counter on Sunday mornings is as sweet as the maple frosting she puts on her delicious balls of fried dough. I ordered 4 donuts and a coffee to go for me and the bf, order came to $5.80. She always throws in an extra donut or some holes, so I tipped her a couple bucks because she's been so kind in the past. Walked out and discovered she snuck TWO extras in the bag this time. So that's a half dozen donuts and a cup of coffee for $8. Tight.", "author": "Lindsey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-22", "description": "Donuts are awesome! Free donut holes in the bag every now and then.\n\nThis is a great family owned and operated business.", "author": "Sara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-08", "description": "Delicious, cheap, fresh, and no frills. Everything I could want in a corner donut store. The cashier gave me a free glazed donut with my order. Don't know why, but I'm not complaining.", "author": "Heather B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "Technically I've never set foot in this place; and have no clue what type of ambiance is offered up. BUT being the donut aficionado I am I feel it's necessary to review every donut I consume. :)\n\nI was surprised w a late night treat from this place the other night-  \n\nCrumble Cake Donut: I basked in the smell but saved it for my morning coffee. A few hours later the donut was still soft and fluffy on the inside; crumbly and messy on the outside. Pretty dense; as a cake donut should be. 4*\n\nThe glazed donuts aren't too oily. Actually the bag WAS clear after the journey home; so maybe the oil transfer helped.\n\nGlazed Donut Holes: Sorta small but its okay I suppose that's a good thing.\n\nMaple and Chocolate Glazed: Normally I am not a fan of maple but this one was pretty yum. \n\nOverall: good!", "author": "Tina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "Chocolate dipped with peanut sprinkles were a big hit. Stopped by here late one evening and they were super nice and generous throwing in extra donuts. Most donuts were good but I wouldn't say exceptional.", "author": "Cindy I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "Late night striking it, headed home to the Bart station on 24th from my boys house on Shotwell.  I almost passed by this donut shop without entering, but I made a double take when I was reminded how much someone special I know likes donuts. Instead of crossing the street, I made the 180 for The Jelly Donut, there I purchased two donuts and was given four; plus some holes, all for a dollar fifty!!!  Lady Behind the counter was sweet too!  \nI'm glad I don't live close to this place, cause me in The Jelly Donut might have close relationship and I would grow rather large.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "I wish this place was not so good, but my gym is certainly pleased I love going here! The donuts are perfect, not stale, not pretentiously weird (no bacon jalapeno donuts here), just classic donuts like when I was a kid.\n\nEvery time I go, my bag always is two or three donuts heavier than my order becasue they ALWAYS give you a little something extra. The staff is very sweet and they're open late - at least until 10, and I've been there as late as 10:45 before!\n\nVisit the Jelly Donut -you won't be disappointed.", "author": "Road H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "I didn't have time for breakfast today, so I decided to try this place before work. \n\nThere was a long line out the door and a lot of diners inside, so I thought that was a good sign. \n\nI ordered regular chocolate donuts and old fashioned chocolate donut ( a bit too sweet), I ended up getting some free donut holes, that was nice. What was really great was the friendly store owner, it was a great change from all of the miserable faces I pass by on my way to work. \n\nIf I ever forget my breakfast again, I will come back for a quick bite.", "author": "Rose H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "I am a connoisseur of the old-fashion glazed. Imagine my surprise when I found a few bonus donut holes in with my order. I was in deep fried-dough heaven!\nThis place is awesome! Plus the sweetest little old lady ran the joint on the day I visited.", "author": "Hilda Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "The donuts are always fresh and delicious and I got 2 free with my order! Friendly staff and great location.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Been going here for over 18 years.  Great people, great donuts, hot coffee and service  with a  smile.  I like the crumb, old fashion anything and strudel and fritters  are good plus buttermilk  bar and and custard  filled donuts are good to go.  They also have Red Bulls, OJ  and sodas.", "author": "Rey D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-29", "description": "Based on the reviews here, I was expecting smiles, pleasantries, freebies, and, well, maybe even rainbows from The Jelly Donut, especially because I trekked down here only because of a Scoutmob 50% off discount and these reviews.  Instead, I got:\n\n- a woman who DIDN'T smile and whose English I couldn't understand\n- a big DENY when attempting to use my Scoutmob 50% off code\n- a charge of $1.75, even though, based on the posted menu, my total for two donuts should have been $1.50 (I wasn't about to get in an argument with someone I couldn't understand over a quarter)\n- one extra donut; the woman's feeble attempt (I think) at redemption for not allowing me a discount (she mumbled something about not letting me use my discount and said she'd give me another donut instead).  But aren't freebies here a given anyhow?\n\nThe donuts themselves were slightly better than the ordinary, but nothing spectacular.  Because I don't live nearby, the corner coffee shop or even Safeway would suffice against The Jelly Dont's..errrrr.....Donut's donuts.  Add the shoddy service, and, Yelp, yep, you guessed it - I won't be back.", "author": "Mel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Ummm... this place is ridiculous.  Not only do the donuts taste ridiculously good but they give you free donut holes.  They have all of the best flavors including an amazing jelly-filled donut.   Most ridiculous of all is that the donuts are super cheap.  FYI: cash only but you really only need $1 and you'll leave satisfied.  If you really want to treat yourself get a cup of joe at Philz and meander to The Jelly Donut for the best breakfast of your life.  You definitely can't go wrong here.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "The donuts here are ridiculously big and tasty! The glazed rings are pillowy soft on the inside.  They always give you free donut holes to top off your order. Best donuts in the city!", "author": "Mike F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "This place is great. We ordered the biggest apple fritter I've ever seen in my life, one crumb donut, one chocolate frosted raised donut, and I also asked for 1 donut hole. The total came to $3, which I thought was a pretty good price.* The bag seemed surprisingly heavy when it was handed over (part of this was due to the fact that I did not yet fully appreciate just how big that apple fritter was). Imagine my delight at opening it up to find an extra crumb donut and a billion donut holes!\n\nThe donuts are really nice. The apple fritter was just slightly too dense for my taste but had a delightful crusty edge to it. Also, I'm not kidding about the size. 6 people ate some of it -and there were still leftovers-. I haven't really had a crumb donut before (so I'm not totally sure that's what you would call this, either - but it seems appropriate) but I really liked it. On the other hand, sometimes I think a simple glaze frosting is all that's needed for a donut, which the chocolate glazed certainly demonstrated. The donut holes were huge (clearly a theme for this place) - I imagine they could only be holes of a donut with an 8 inch diameter or so. I think I still like the cake donuts better at Bob's Donuts, but this place is a champ and I'll be back.\n\n* It was kind of nice to go here the same day as Dynamo, because I think factoring both the quality of donuts (far superior here) and the price, Jelly Donuts is maybe 50 times better. Yeah, I know they're different experiences and everything, but when I actually want a good donut, I'll come here.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-28", "description": "Daaaaaaaaaaaaaammmmmmmmnnnnnnnnnnnn!!!!!...paired with girly hip swivel for full effect.\n\nSugary, soft, sugary goodness. Yeah I said sugary twice. But they are. \n\n(insert crazy wild donut dream right here) \n\n(I know you all have them)\n\nI stopped in here once. Just once. Even though I pass by here regularly.  I will only allow myself to taste the forbidden starch, but once.\n\nI have a VERY addictive personality.\n\nBut that one sugar donut was UNBELIEVABLE. It was cheap, fresh, and a dangerous sugar kickstart to my workday. The staff were also very friendly, and you could tell by their casual conversation with those in line with me, that they have some loyal regulars.\n\nI recommend Jelly Donut for your stomach...but for your health.. \n\neh...not so much.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "The lady that works here is awesome, I ordered two big twists, one chocolate and one glazed, and she gave me an extra chocolate and glazed circular donuts for free. This is definitely a good place to get your sweet cravings met.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "My mom takes my sister and I there in the morning before school. I even get extras . Best place ever", "author": "Aracely S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "These are the best donuts I've ever had in my 22 years on this earth. The people who work there are super sweet as well. Usually they'll even sneak in an extra free donut or 2 with your order. Highly recommend the chocolate French crawler (the one that looks like it has ridges) but you really can't go wrong with what you order.", "author": "G F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "Maybe I was won over with the free donut hole surprise in my bag but the price was great and the donuts were even better. I am guaranteed to come back any time I'm on 24th or in the mission in general!\n\nGood place for sure.", "author": "Randy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "Was visiting San Francisco and craved some donuts. Not only were they really good, but the lady hooked it up with some free donuts and donut holes! If you want a donut, go here!", "author": "Kurt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-25", "description": "This place is the bombbbb. I live close to here and I always passed it, but it looks like such a dump from the outside (and donuts aren't really the healthiest thing for you, ya know), so I never stopped by. \n\nHowever, after seeing a coupon for this place on Scoutmob, I decided to give it a try. After walking in, I was greeted by a sweet old lady who, like other people say, had a hard time with English, but communication wasn't a problem. Just point to the donut you want and it's done!\n\nEven though I had the Scoutmob coupon, I couldn't bring myself to be douchey enough to pull it out and try to get a 50% discount on $1.75 worth of donuts. Come on, people! The most expensive donut is like $1.. everyone in there is so nice and the donuts are so freaking delicious that I WANT to pay full price. PLUS, they always give you an extra donut or a couple donut holes for free! I feel like giving this place 1-2 stars based on not being able to save 37.5 cents is a bit stingy and unfounded, but that's just me.\n\nDonuts are baked fresh everyday.. my personal faves are the cake crumb donuts and the French twist (I think that's what they're called) donuts. So light and fluffy and delicious. Jelly donuts are a little heavy, but delicious nonetheless. I highly recommend this place!", "author": "Rhea K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Great customer service!! Awesome donuts and spent less than $4.", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-12", "description": "A coworker brought in donuts from here this morning and I went to town on those donut holes like Tony Montana on a pile of cocaine.  Crazy delicious!", "author": "Monica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "Swung by on National Donut Day and they were almost sold out! Still had a pile of fresh plain glazed donut holes though. These are my favorite anyway -- fluffy, perfectly browned, not over glazed. I left happy with extras for my coworkers. You're not going to find nicer folks to get your sugar fix from. Stop in!", "author": "Kiely H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Great old-fashioned donuts and a generous staff! Walked in late in the afternoon and got more free donuts than I even ordered, all of which were fresh and delicious.", "author": "Drew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "Love that place! Not only are the donuts great, but they also have amazing Muffins. Service is awesome. No matter how much you buy, they'll also give you a couple of donut holes for free!", "author": "Moritz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "I was just stumbled home after a concert and walked into The Jelly Donut at midnight with, no joke, two dollars in my pocket. I picked out two cheap items and was given a jelly and a cinnamon roll for free. Amazing service and the donut were great.", "author": "Nick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "Great donuts, friendly service, fast line and did I say great donuts?", "author": "Jm C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "Good apple fritter but the glaze and maple bars were inedible.  The lady serving the donuts was nice.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-29", "description": "Yeah, I'm from Canada. Donuts are part of my culture.\n\nAvoid this one. Walk over to Philz or Dynamo to get your donut.\n\nIt's not that far. Really.", "author": "Ima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "The donuts are very good. I only order jelly donuts but the reason I can evaluate the other types is that THEY ALWAYS GIVE ME FREE DONUTS OR DONUT HOLES. The owners are very low key but very nice.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "The Healthy Yelper is far from a donut connoisseur, but when he's been out dancing the night before and wants a little side with his breakfast, he sometimes indulges. At least a bite or two.\n\nThis morning those (two) bites were of a very good cinnamon crusted concoction from this Mission purveyor of all things donut. Less than a buck and I had my fix, and the friendly guy tossed in an extra at no charge. Having had my two bite limit, someone in need benefited from their generosity. Jelly Donut goodness all around.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "The Jelly Donut holds a very dear place in my heart. I am pretty sure that, for the price, they are the best donuts in the City. I'm not 100% sure that they're the best donuts EVER, but I do think they have possibly the best SERVICE for a donut shop ever. I am so happy to have them near my house!\n\nThey always give you a free donut. Even if you only buy one donut. And they really seem to care about their customers and making people happy. One time my partner and I were walking by there at like 1am, and they were in there baking the next morning's donuts, and it smelled SO GOOD that we just stood at the window and watched for a while. One of them saw us out there and let us in to buy some fresh donuts!\n\nThe thing these folks are really, really strong on are the cake donuts (the kind that come with sprinkles, coconut, etc. on them). I don't normally even like cake-style donuts but theirs are AMAZING. Normally, I'm a big fan of cruellers, but theirs aren't so great. Average. Same with the twists and bars. Good, but not great. The other thing I can really highly recommend are the apple fritters. Really awesome.", "author": "Lynae Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "Thanks to the Jelly Donut, I'm going to have to start walking on 23rd St. to get from my new home to BART in the morning.\n\nBecause that smell of donuts - that thick, fresh, incredibly sweet, absolutely irresistible aroma - wafts down 24th St. and infiltrates my nostrils a full block before I even see the store sign, right as I'm headed to catch my daily train. \n\nI can't help it; I immediately start thinking, \"Gee, this coffee I'm carrying in my travel mug will taste EVEN BETTER if I pair it with a delicious, fresh donut. And it will be a CHEAP breakfast, because the Jelly Donut charges 75 cents for a donut and then throws in, like, six donut holes - FOR FREE - and I just took a pay cut because the company I work for is facing a $145 million budget gap. Wow, this is an idea that is both practical AND delicious! One donut with sprinkles, please, super friendly man behind the counter at this beloved Jelly Donut! Have a great day!\"\n\nI can predict it: within a week, I won't be able to fit into any of my clothes. Tomorrow, the route changes. You heard it here first.", "author": "Anna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-26", "description": "Everything you heard is true..and then some.\nI walked in here after reading the reviews on here. \nI had my eye on a glazed and an old fashioned.\nI left with not only those, but three extra and a small milk.\nAll of this donuty goodness was 3.25. \nI didn't even realize I had two extra until I ate one, looked into my bag to see the rest of the damage I was going to cause to my waistline, and saw the 4 I had left waiting for me. \nAMAZING. \nI think I've found donut heaven. \nMinus one star for being cash only.", "author": "Cecilia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "Jelly Donut is a special place.  The donuts aren't really anything special.  They're more Crispy Creme than Dynamo.  However, they are cheap, served by friendly ladies, and it seems that for every 1 you buy you get 2 free.", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-01", "description": "Popeye + spinach, me + apple fritter.  This is a place for a proper double-fister, candy coated, crackly-skin, chewy-dense, all-day fritter.  Eat one and forget the other meals of the day.  \n\nNot just cheapcheapcheap but they will throw a free bonus surprise donut in your bag too.\n\nSometimes I bike past their little corner storefront at night, without a wish for donuts, until I see rows of tempting coffee pots wafting steam that beckons me in.  Just a couple of seats and nobody around.  It's an Ed Hopper painting.  \n\nNeighborhoody.  Recommended.", "author": "Pat L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-04", "description": "JELLY DONUT IS NOW UNDER NEW MANAGEMENT... Super disappointed, but I decided to stop in anyway. I got my usual; an old fashioned maple and a chocolate donut. Also had my mom tagged along with me and she got a regular sugar donut. The new management totally switched up how the donuts tasted. Maple didn't even taste like the slightest bit if maple was in it, the coating looked like an eggshells color but slightly more khaki. As for the sugar donut it was mediocre. The lady also over charged. Handed over a 10 and she have back 2$ and some change and said she only received a 5$ bill from us. TOTAL RIP OFF. Who in their right mind would willingly pay 7$ something for 3 average plane-jane donuts. Definitely will not be back. I miss the old management. They were way more friendly and actually gave the correct change :(\nBottom line, no wouldn't recommend it to a friend, make sure you have proper change. I'd probably skip this place and head to another donut shop a couple blocks away if I have to.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-18", "description": "This business is featured on Scoutmob for 50% purchases up to 7.00 off but guess what... They don't honor it. Just for that and the horrible communication with the lady that works there this place gets 1 star. It's best to avoid this sh*thole of a donut shop. I'm going to contact Scoutmob and make them aware of this BS. Hopefully they take their featured info off Scoutmob so they don't get anymore free publicity.", "author": "Nathaniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Incredible! Friendly staff, delicious doughnuts & coffee and for such amazing prices. Love this adorable spot & wish I lived closer.", "author": "Rachel O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "I literally go all the way to the Mission just to buy donuts from here! Donuts are donuts, and the quality of them is definitely up to par, but it's not even about that. The family that runs it are so nice, and giving! I once only had 4 dollars which was enough to buy a half dozen, so I did. I turned around for a second and when I went back, the lady had put like 15 donuts in the bag! They're awesome. One of the best donut stops in the city.", "author": "Eve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Love getting my morning coffee and donuts here on my way from Bart to work!!! Staff are super sweet, warm, and surprises you with donutholes!! Yay for mom-and-pop-shops! Keep up the great work!", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "fresh donuts even at 830PM!!! she gave me free ones. i'll be back!!", "author": "Siva M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "The donuts are fine, but nothing standout.  The coffee is not that great.  However the prices are reasonable, the service is friendly, and they often throw lots of stuff on top of your order for free -- donut holes, extra donuts if you order a few of them, etc.  Seems like a smart business practice -- people love this!  Although I think I'd trade the free stuff for a bit more deliciousness.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "I love it here.  The staffs are so nice!  The donuts are superb and the prices great too.  Every single visit had been great (not one are bad), and  I am going to continue to go back.  I have to say it again; the staffs are awesome!", "author": "Mei L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-06", "description": "NO NO NO! I will not get a donut today.  That's what I used to have to say every day I used to pass this glorious place on my way to the bart station.  They have some real good donuts.  And it's way better than all the panaderia's in the hood.\nPlus they always fill your bag to the brim with donut holes, like I need more sugar and lard added to my ass.  Anyway they are lovely and once I was coughing and they gave a me a free drink.  I love them so.  \nIt's also a great place to go late at night to get something free soft/ and sweet to though at your enemy on bikes.  Long story.", "author": "amanda v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "It's the Jelly Donut! \n\nEvery time I walk past here on my way to or from BART, I think of the rapper Jelly Donut. (http://illbilly.com/Videos/Jelly_D/Jelly_D.mov.) He should be their mascot. Not like they need any more business, though. There are like 40 people crammed in here most mornings. Total scene. I prefer to go during off-peak hours, after 6pm, when the Asian lady slips an extra donut into the white paper bag, and we both act like it was an accident. It's pretty sweet. I'm trying to work it so I can start requesting what my free donut's gonna be. I always get a little crestfallen when she drops in a glazed donut. I hate glazed.\n\nThe crispy old-fashioned ones are tops. I can't think of a better way to spend sixty cents. I almost took off a star for the slight heaviness in my stomach after I eat here, but then it wouldn't be a donut without some grease would it now?", "author": "Katrina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-01", "description": "As if there weren't enough panaderias around to tempt me, I can also add Jelly Donuts to the list of places that contribute to my artery's well-being. \r\nI have sampled nearly most of the donuts, the selection is basic, original glaze, apple fritters the size of frisbees, chocolate glazed, of course jelly donuts. But my favorite is the maple glazed coconut donut. Only complaint is that by 9pm the donuts are limited to whatever is left over from the day. So if you want chocolate and they are out, then you are out of luck.\r\n\r\nMy favorite thing about this donut shop is the $1 I pay for a medium macadamia nut roasted coffee. I know, it's probably not the best coffee in the world, but sometimes I just want caffeine regardless of taste, or quality. Sometimes I just want to desecrate on the whole ritual of drinking coffee by sweetening that sucker up with cream and sugar. I'm weird like that. For $1, the coffee is a lot better than I expected, and even when I just order  a donut I always find 3-4 free donut holes (or is it circles?) in my bag. It's like finding little gifts, I love that.", "author": "X marks the spot .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "If you're in the mood and looking for a solid place, this is a good spot. We ordered a chocolate glazed cake and old-fashioned. Both were fresh tasting and really good. Extra point for adding a cruller in the bag for free. I'm not judging that one because I'm generally not a fan. Yes, the only donut that I don't care for...", "author": "Eme L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-24", "description": "You often wonder if they charge higher prices so that the free donut seems like a good deal.\n\nBut I don't care. Delicious donuts, yay for free ones, and yay for affordability.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-21", "description": "What is better than FREE FOOD?!  \nThe answer is: nothing.\n\nI orderd one regular and one old fashioned donut, which came to a total of $1.20.  Then she's like I'll give you another one of these for free, and threw in another of the regular donuts.  \n\nHell yes I'll eat more free donut!", "author": "Levi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-22", "description": "The donuts are average.  Similar to other places in the area.\n\nBut the staff are super nice and give you free donuts!!!", "author": "BeeryMcGymrat X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-17", "description": "So this is gonna be harsher than most peeps reviews I am sure. I know my donuts, I mean REALLY REALLY know my donuts. I've been study this dying cuisine for many years now being a pre-diabetic and all (it makes sense to me).\n\nAnyhoo I am sadly giving them 3 stars. I hate doing this, because small donut shops are also dying and I want to support them. I really do. Also remember my little yelpers, Krispy Kreme sucks butt (it's the fast food version of a donut).\n\nSo this is all I am going to post. I don't want to hurt their business anymore than I have. You probably will like their donuts, they are better than Krispy Kreme. Only donut snobs should stay clear. Please stop by, give them your business, and eat donuts. Support your local San Francisco donut shops. They need it. \n\nViva la donut!", "author": "Ali K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-18", "description": "I guess I can call off that whole \"Is it just me that gets the free donuts? Or maybe you, too, since you're always in there with me?\"\n\nThe only thing that makes me sad about The Donut Place (like I ever have called it anything else) is that it always seems like one of the regulars is leaving her two little dogs tied to the meter out front. At least they wear sweaters.", "author": "Melissa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "Have stopped by this place a few times and always experience the following:\n\n1) (Vietnamese?) lady behind the counter always smiling, even if distracted with a telephone call or other customers,\n2) Donuts that are definitely above par (standard types of donuts, but always taste fresh), and\n3) She always hooks it up with a couple extra donuts!  How can you not dig that?", "author": "Dareyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-16", "description": "Love this joint--reminds me of little donut shacks in Southern California or maybe Dunkin Donuts in Boston, though I'll take this place's donuts and coffee (though DD coffee has sentimental value).\n\nTheir donuts are the real deal, though I don't eat a lot of donuts--just fresh, sugary, caloric.\n\nCoffee's good too.", "author": "Luke J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "DUNKIN' DONUTS! DUNKIN' DONUTS! DUNKIN' DONUTS!\n\nOK, I just said that to get your attention. I'm from Boston--and if you are too, then you know what I'm talkin' about. Good coffee and well--doughnuts. Starbucks? Fahgettaboutit.\n\nI am declaring \"The Jelly Donut\" the best coffeshop in San Francisco. Not cafe. Coffeeshop. In that old timey way--where you kick it with all the other old folks.\n\nAND...\n\nAs mentioned in other reviews, when you buy a doughnut/doughnuts, they hook you up with either extra doughnut holes and/or doughnuts.\n\nToday I went there and got 2 doughnuts, a medium coffee (visitors please note: med = sm in SF), and a Schnapple for $4.\n\nTHAT IS A DEAL!\n\nThe Jelly Donut = Best Coffee/Donut Shop in SF.", "author": "Gabriel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "A donut lovers dream! Not the creative stuff you'd get at Dynamo (for $3 a piece) just your good old fashioned fluffy donuts. It's amazing! I get half a dozen donut holes for $0.50! As if that wasn't already a great deal, the employees are kind enough to add another 3 or so for free, that's 9 donuts holes for $0.50! Sometimes I'll even grab a cup of joe, and some regular sized donuts for less than 5 bucks, and I always walk out with an extra (complimentary) bag donuts to take home for later......broke and have a sweet tooth? THIS IS YOUR SPOT! = )", "author": "Irene N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-04", "description": "Donuts high quality.  I think I may prefer these to Bob's.\n\nThey also gave me a free donut (sugar).  I paid for a glazed and a chocolate.  Both were tasty.  Fresh.\n\nI love the surprise of the free donut.  I feel like I won a prize.  If you play your cards right, you too may find a bonus in your bag.  It's like looking for the prize in the box of crackerjacks.", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-05", "description": "FREE STUFF!!! \n\nIts so nice. I usually buy 2 doughnuts and theres usually a free doughnut or doughnut holes in the bag. Its really a gesture that has me coming back all the time. My doughnuts always taste good but the free ones taste better because they are free! \n\nIts also nice to go here because its a little local place. Go and buy some doughnuts and see what ya get!", "author": "Audra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-17", "description": "You buy one finger-licking donut pay 75cents take your bag look inside and see 3-7 donuts ... How can you not love it ... :)", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "Glazed buttermilk bar temptress!  Whore of the donut world.  You temp me with free donut holes and your kind Thai dealers.  \n\nBetter than the San Francisco chain donut stores, the jelly donut is what a donut shop should be.  Open too late for the good of society,  you should try the Jelly Donut.  Get a glazed buttermilk bar and join the day laborers drinking big Styrofoam cups of coffee with too much sugar.  \n\nWith this much sugar you'll be ready for your breakdown.", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-24", "description": "Great inexpensive donuts, really friendly staff, seemingly always open.  Fantastic apple fritters.  Also, free extra donuts seem to be the norm.  Once you're over the novelty of having bacon on your donut, stop by Jelly.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-28", "description": "6am, on my way to work.\n\nUsed Scout mob coupon and was overcharged.  When I questioned the man, he brought down the price by $1.00 but no reciept and he mumbled something about taxes. Still overcharged by a couple of $\n\nDonuts not spectacular.\n\nSorry grumpy jelly donut man, I'm not going back.\n\n***If you have a car, there is a delicious donut shop on the corner of 24th and Noe- its where the police hang out and the donuts are better and cheaper.", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-05", "description": "Cheap, delcious... and they give you free donuts with your donuts! Also not far off the beaten path. Not fancy gourmet or anything, just delicious.", "author": "Leah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-13", "description": "Ok, so I'm a pretty healthy dude...i ride my bike a lot, I watch what I eat, but I do have weakness: primarly booze, sweets and cheese.\n\nOn this particular day I was pretty hungover and headed over to Philz Coffee. As I passed by the Jelly Donut I thought to myself, \"oh what the hell!\" So I popped in and got a glazed twist. The guy was cool and threw in a glazed donut as well. \n\nI anxiously pulled out the twist and bit into it...ehhh. Not too impressed. It was not super fluffy, it was a bit more dense than I prefer. Same goes for the glazed donut. \n\nHowever, I'm a sucker for warm donuts, so I will be back to find out when I can get a warm one.", "author": "isaias J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-27", "description": "The other day I tried an old donut shop in my former hood and boy has that place gone downhill :(  Fortunately, I found a great place in my current hood thanks to yelp.  What everyone said was true, its small, the donuts are great and they will toss in an extra donut or donut hole for ya!  But what some fail to mention is the size of their donuts compared to other places, not only are they great but they are big.  We all know that size doesn't matter but when it comes to donuts I beg to differ.  So to summarize: next time you feel like a good old fashioned donut give Jelly Donut a try and I promise you wont be sad.", "author": "Mick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "These guys are the greatest.  When I was working downtown at some slave architecture internship I was broke as a joke and often couldn't afford breakfast until I found these guys. I would buy a donut in the morning just to get the calories to make it through the day and the guy behind the counter would always say hello, smile and slip in at least another donut.  Working 60 hours a week to pay your rent and student loans makes you appreciate a great deal and service.", "author": "Atom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-08", "description": "I got two cake donuts, a long chocolate twist and a handful of free donut holes for about $2.30. \n\nThe cake donuts are quite different from the cake donuts I know and love, but they were good in their own way...VERY sugary on the outside and VERY doughy on the inside. \n\nThe donut holes were...decent. Tasted kinda bland....but, heck, a donut is a donut, right? That's what I wanted....and that's what I got!", "author": "Danyell K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Great donuts, the selection is simple yet wide, and they stay fresh and tasty for hours after you bought them. The cashiers are always nice, and the 4 times I went there, they gave me free donuts.", "author": "R B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "This place may not look it's best but they are really cheap and taste really good. Good deals to get donuts and worth going to if craving for donuts!!!", "author": "C G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "Pretty good donut place. Nice variety and good prices. Good location near BART.  Recommended.", "author": "Chad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-08", "description": "best donuts in the city.  only thing they don't they don't have are my beloved Blueberry donuts that i can only find at ferrell's in santa cruz.  super nice people.", "author": "eric i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-18", "description": "Finding this place was terrible for me. The donuts are delicious and the service is amazing, silly as it sounds to say that about a place you go to and get donuts... but it's true. The smiling catches and I always leave with a grin and too many delicious donuts.", "author": "Ricky B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-20", "description": "Extra star for the bonus donut -- I guess it's a regular thing here!  I think the crumbcakes I had here were a bit underdone, though (maybe they churn out more than they keep under quality control -- must have to make a lot to give so many away!).  Still have to stick with Donut World on 9th Ave.", "author": "Ari M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Found some extra donut balls with my purchase of 1 $1 Jelly Donut. Thanks donut lady!", "author": "Jack K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-19", "description": "The other donuts are good, but don't get the donut holes.  They were not good..  They were very doughy and tasted they were not completely cooked.  They are smaller so they should cook quicker.  I will stick to the glazed / chocolate covered old fashions.", "author": "Po L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "That was a totally respectable couple of donuts I just had from here.  Freshly made and solidly tasty.  Nom nom nom.", "author": "Jess L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "Mmmmm....donuts... (in Homer Simpson fashion)  The fact that this place is around the corner from my house makes me love it, but after having their donuts on two separate occasions and being floored at their tastiness, I now can say that I love The Jelly Donut unconditionally.  Both times, the person working has given us a special little treat in our bag to find when we get home (read - getting HOOKED UP).  So far I've tried - old fashioned chocolate, chocolate covered custard-filled, cinnamon crumble, glazed buttermilk bar, apple fritter, glazed donut holes, and of course, the obligatory glazed jelly donut.  Looking back at this list, you might be judging me right now - but don't.  Give this place a try and you'll see just how wonderful it is, and you won't blame me for my lengthy list of favorites.  I've never been disappointed with anything I've tried.  One tip - it's cash only, but there is an ATM onsite.  Jelly Donut, you have earned a loyal customer in me!", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-04", "description": "After leaving the disappointing Dynamo Donuts which had no donuts, we continued our donut tour by stopping in at Jelly Donuts. We had read the Yelp reviews, and very quickly we understood the flavor from the bad reviews. There were 3 people behind the counter, 2 of them smiling at us. The smiling ones were just there for companionship of the grumpy one, that was in charge of getting us our donuts. I asked for the maple/cream filled. It took 3 tries even with me pointing to receive the kind I wanted, then she gave me a random free donut. The place was run down and grimy. After Starman got his donut (the smiling ones cajoled grimly into giving him a free donut), we got out of there quickly, and ate our trial donuts on the street. They weren't very good or special. I tucked my free one away in my coat pocket. We felt tired and greased out on just one, and so didn't visit any other donut shops. National Donut day was over early. Later that night, when I was very hungry after aikido practice and waiting for the bus, I found my free donut and ate it. At that moment, it was delicious. But I won't ever go back for more at the Jelly Donut.", "author": "Herschell L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-20", "description": "This place is as sweet as it gets.\nI have been coming here as far back as I can remember. The doughnuts are top notch-no artificial aftertaste, fresh and just sugary enough to get those taste buds watering.\nThe best part is the woman working the register always slips me an extra one! I have gotten at least $20 in free doughnuts by now.", "author": "Hayley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-27", "description": "I love donuts.  I also love Cambodian pop music. The Jelly Donut has both.  :)", "author": "Bigfrog W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-03", "description": "So, the donuts are good and you even get a free surprise.  But  what puts the place off the charts are the people who own and operate Jelly donut.  Wonderful, cheerful, welcoming and always there what an experience", "author": "George L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-06", "description": "I love the jelly doughnut.  True the coffee sucks and the doughnuts honestly are just so-so but it has that neighborhood vibe and the couple behind the counter just couldn't be nicer.  Lovely, lovely people.  I really enjoy going there.  Also: cheap, and you always find a freebie in your bag when you leave.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-27", "description": "Chocolate croissant, apple fritter, hazelnut coffee and a ton of free donut holes make my morning, almost every morning. I love you, Jelly Donut.", "author": "Britney K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-01", "description": "Are you guys kidding me? I was craving donuts soo bad at work and I looked this place up. Right when I got there I was put off by the straggly looking customers and the over all cleanliness of the place, but I was already there so whatever, I ordered some donuts. 1 glazed, one chocolate and an apple fritter thing.  Like everyone else said I got some freebies. \n\nGet in my car, and start eating...\"Uhgggg.\" Something not so soft and chewy. NEVER GOING BACK. \n\nIm starting to give up on yelp. There are better places in the east bay. Like World's Fair Donuts. \n\nIm done with donuts for a while. Horrified. Should have trust my better judgement.", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-11", "description": "Best donuts around, plus they'll give you free donuts every time you stop by.  Try to beat that.  My friend (50-Tooth Slim) has a theory that the donut lady carefully measures her customers and tries to match the free donuts to each personality.  So check out those free donuts: what do they say about you?", "author": "Aram D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "donuts are perfectly fine, but bonus points for the super-friendly staff and free donut holes!", "author": "Mike E."}
