{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "No frills bar, just how I like it. Dark inside with plenty of seating. Delicious martinis and friendly bartenders. Also, amazing playlist of music the night I was there.", "author": "Manda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "I usually go to the Dubliner my Tuesday day off.\nAsian beautiful bartender is always so kind.\nShe can do professional service as well. \nI really like play darts. \nIf this bar is there nearest my house or work place maybe I'll go there almost everyday.", "author": "Nishigami T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "I love Carlee! She's the best!! She's my absolute favorite! She's the only reason why I come here! She's here on Thursdays and Sunday afternoons, so stop by for drinks! Carlee has the best stories and we talk about anything!\n\nSide note: She has the cutest Morkie named Chewy, whom she adores so much.", "author": "Amanda Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Ah Dubliner. It's one of those local Noe Valley bars where everyone knows your name. My friend lives nearby, so I happen to go here quite often for trivia and sports. It's always a good time here, and their happy hour prices actually surprise me quite a bit. Last weekend I got a White Russian for $6.50. Not bad at all considering that's typically a $10 drink. I also like the general vibe here, though the crowd is usually older folks. I guess that's why my group got some looks when we ordered those White Russians back to back. Eh, not a big deal. \n\nIf you're a younger dude or gal, just head on over to The Tavern which is only a few blocks away. It's definitely a more \"hip\" crowd. \n\nBack to Dubliner. It's clean, doesn't smell bad, no obnoxious people and it almost doesn't feel like a typical dive bar. If you're looking for that kind of atmosphere, this is the spot for you in Noe Valley!", "author": "Alex B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-04", "description": "The open windows definitely invite you in. Beer selection is large, but I often find myself struggling to figure out what I want to drink. \n\nThat said, for some reason tourists don't get trapped here (a plus), but on the other hand I have multiple times had to interrupt slightly too forward locals talking to my wife. At least once, a local acted a little too protective of my wife even after i showed him how our rings matched. very odd to say the least. \n\nSpending election night here by accident was enlightening as the crowd of Hillary supporters was completely in disbelief as if there is absolutely no other way of looking at things than the well off \"liberal\" San Francisco way. This was a very good summation of what I had experienced at this bar over the last 6 years. \n\nMuch like the valley tavern, sometimes you go in and every TV is turned to the same game. I understand if its the NBA finals, or World Series, but sometimes it's a random game of two non local teams in a regular season matchup.", "author": "David A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Neighborhood bar that offers a lot! Been to their Trivia night and it's always a great time. Great crowd as well. My favorite part of this bar is the electronic dart board that's super fun and addicting!", "author": "Eva C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Mellow early but great draft beer. Mary is a true tough Irish bartender. Plenty of sass and confidence. Enjoyed my beer and the people there", "author": "Will W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Another Noe valley stalwart and it gets a good after work crowd, the Guinness is flowing and a good atmos in here with locals every night... good prices, good staff... decent bar!", "author": "Reg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Wandered in while looking for dinner. No food, but the bartender and a local were awesome! They helped point us to a few places to eat. Cozy, friendly and chill vibe. Flawlessly poured Guinness.", "author": "Cat B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "This is a proper old school Irish Pub. I went to watch Game 3 of Warriors vs Cavs and it was amazing to say the least. Despite the overwhelming crowd, the servers were very attentive to us. Looks like this place is really popular among the Noe Valley residents since the bartender knew most people by their first names. We had a couple of Guinesses and the Magnum Red Cider. Prices were pretty reasonable at $6.50 a pint.\n\nNot sure if they had any food but they were super chill about getting pizza from nearby Patxi`s, which was awesome. \n\nWould definitely come here again to grab a quick drink next time in the Noe Valley neighborhood.", "author": "Pranav B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "Tasty Bloody Mary, nice bartender, plenty of seating and TVs -- need I say more? The Dubliner is a good old fashioned pub.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Easy bar. Clean and excellent service from Mary the bartender. \n\nThey offer snacks but no bar food.", "author": "Kim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "It's one of the better and cleaner bars in SF and my friends and I go here for Brainstormer Trivia.  Bartenders are cool and they'll get to you when they can.  Prices are reasonable too.  When it comes to crowds, it's hit or miss.  I've seen it when it's packed during football season or when there's a trivia tournament taking place, so seats and tables can be limited.  I've also seen it at times where there's a good crowd, but you can still find a good table to sit and kick back with a beer.  Another plus is this bar is fair to all sports fans where they'll show sports including baseball, basketball, football and hockey.  Also, parking after 8 in the neighborhood is easy to find as there are a lot of restaurants, and people are leaving by that time.", "author": "Chan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "On a hot day bar crawling, stopped by The Dubliner. They have a number of TVs, soccer fans at any time, and drink specials. The beer selection was ok - this isn't a craft beer bar - but with $4 and $5 drink specials, hard to pass that up. The bartender had a great relationship with regulars, who came in just to see her and get a quick drink.\n\nNow for the real highlight - the men's room. Air conditioned, clean, and the two stalls have real doors. Walking out and hitting the hot air inside the bar, my friend and I commented on how nice it was in the men's room.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Carlee is the only reason why I continue to go to this bar. She is outstanding, fun, friendly, and always entertaining. Her giant boobs hold a variety of surprises from phones to nickels. We love her!", "author": "Bethanie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-15", "description": "I stopped by here to a quick drink while waiting for Saru Sushi to open up. It's a nice locals bar where you can get a chilled beer on tap for your enjoyment. I asked the bartender if they had Kilkenny and she said some rude comment then some old fat guy next to me made some other stupid comment--the type that awkward dudes usually make. So, because of the snarky comment that rude bartender made when asking a simple question about an Irish beer in an Irish bar, this place can't get more than 2-stars and I recommend spending your money elsewhere.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "Great bar to hang out at. They really do give you chips with your drink order! They have sun chips, popcorn, and other chips too. I was a little disappointed that they didn't have mint leaves though, was really craving a mojito. But their Moscow mule was really delicious and it also came in a tin cup!", "author": "Yining D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "A fun neighborhood pub that feels like a second home. \n\nOverview: The bar itself has a long history. If you show up from 3 to 6pm, you'll notice that the bar is full of the old-timers. The true people of this neighborhood who have lived in Noe Valley all, or most, of their lives. There is definitely a hierarchy here during those 3 hours. Those regulars, they get the bar. You; you sit at the tables not attached to the bar. And whatever you do, they get the jukebox and the song choices. Don't go up and start playing \"Barbie Girl\", you will be asked to leave :) This is the way it is, and the way it should be. We'll all get our chances to sit at the bar, but we first have to earn it. \n\nPros - \n\n+ Great beer choices. Lots on tap and plenty in bottles.\n+ Staff. Incredibly prompt and friendly. Even when the place is packed, you're usually taken care of in a matter of minutes. \n+ TVs. Lots of them and they do have the MLB and NBA packages.\n+ Dart board. \n+ Indiana Jones Pinball machine.\n\n\nCons - \n\n- Too many stools in my opinion. It would be awesome if they only brought out the extra stools when needed. \n\n- Pub trivia. It's fun, but it brings out lots of people who don't normally come to the bar. (this is where the 1000's of stools come in) Lots of them only drink water/soda and it can get obnoxiously crowded in there. If you're not a fan of crowds, avoid Dubliner on Thursday's at 8pm.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Super casual bar, good for hanging out with some friends. They don't have food but with a yelp check in I got some free chips!", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "The drinks here are a little pricey for the divey feel but I guess it is Noe so maybe they assume everyone can pay a little extra...? ;) They have a great trivia night on Thursday nights though - the questions are not too impossible, the scoring books are fancy, the accompanying music is good, and the scoring is fast. \n\nThe bathrooms are a little dirty too but at least there are 4 of them so it's usually not a wait.", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "A good place to chill n have a drink or two.\nYou can never go wrong with drinks at this place they serve well and top shelves kinds of alcohol for a very reasonable price. Bartenders are pretty friendly and very helpful at all times:) Its a cool place to watch a baseball/football since they have a wide range of flat screen tvs around the bar and lounge mostly with cool crowd of people.Surrounding is clean & tidy. I love goin back to this place just to have a good buzz and awesome time.", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "This is a great spot if you are looking for a super casual neighborhood bar. They always have great beers on tap and, if you are into dark beers, I definitely recommend the breakfast stout! Otherwise, there are plenty of hop loaded IPAs and, of course, local brews.\n\nSome might classify The Dubliner as a \"dive\" bar but I wouldn't put it in that category. For one, it's Noe Valley :), it is clean, doesn't smell, and has a 30+ customer base. It can be rowdy/loud at times so keep that in mind. There 's also a dart board and TVs to catch the game.", "author": "Antoinette O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "Very nice bar! They have Boddingtons and Guinness! Those are my favorite beers!\nThe bartenders are awesome, especially the Irish one.  This place also has special drinks before 7 pm.  What I like the most is that even when the Giants play there is still plenty of room for everyone, it's not like those bars that when the Giants or 49rs play it is impossible to get a table.", "author": "Rocio T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Male bartender with slight accent is a cool dude.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Love this place. It's pretty cheap for drinks and never too crowded. Great neighborhood bar, and the staff are always nice.", "author": "Joey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-14", "description": "This place is pretty cool with a lot of character. Reminds me of the pubs I went to quite a bit when I was younger. Not updated and with bartenders you want to talk to, tvs on. \nWe stopped in on our way to dinner. and grabbed a drink. I appreciated that my drink was strong. But even though this place wasn't hipster or wasn't modern, they still charged SF prices for the drinks.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "I love Irish Bars. I love Guinness, Whiskey and Bailey's in the form of Irish Car Bombs too. Although I am not Irish, most Irish Bars are cozy and have a good selection of beers and pub fare.\n\nThe staff is friendly and they have an indoor smoking patio that is open to the street, if that's your thing. They also have flat screen TV's playing different sport games, you know...if that's your thing. I've been in when they had Irish Singers come in, all dressed and singing tunes - which is fun to watch, well - if that's your thing.\n\nAnd my thing? Irish Car Bombs with Guinness beers on back up, good conversation in a friendly and not too noisy bar, little appetizers and friendly service. \n\nThe Dubliner does not have a pub kitchen, but they do bring in pizzas and appetizers from Bassos which is located a half a block away. I have had the jalapeno poppers and the fried calamari, it's been just okay - but that's Basso's not the Dubliner. I'm just glad they offer food, sometimes you need a little something with your Irish Car Bombs.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-03", "description": "Lightweight unprofessional staff -- at least on this Saturday night. Three young ladies behind the bar plus one counting money when I walked in. Most of the bar was open yet it took 5 min. plus for me to be recognized.\nI was there to watch the game, had a beer and an Irish Coffee. Mid-way through the latter I hit the restroom quickly and returned to find my stool gone and one of the bar maids scooping up the $8 I had left next to my glass. I guess that was my clue to take my business elsewhere. Indeed, Horner's Corner and Valley Tavern have much better service.", "author": "Jack T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "This place is awesome.  Open early for World Cup games with friendly bartenders.  Great drink prices and fun atmosphere.  Meghan is a great bartender, she will go the extra mile.   She keeps the bar very clean.  I will be returning on a regular basis.", "author": "Patrick Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "Great place to grab a beer and watch the game. Lots of beer on tap and the wall of liquor bottles speaks to a full cocktail bar as well although didn't order one. Tons of TVs and trivia on Thursday nights.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "Great bar! Came here for St. Patricks day with my friends and the staff (and fellow alcoholics) were extremely friendly. Most of the time when I go drinking, I just talk to my friends and ignore everyone else but surprisingly, fellow patrons were really friendly and cracked jokes with us. \n\nThe bar overall is pretty big but very narrow. There are plenty of TV screens on the wall (at least 5 or 6) and there are two large booths in the back. They serve a variety of beers and other drinks. The bar also had mashed potatoes, bread and corned beef for free in the back. \n\nOverall, great bar with great people. The beer was a little on the pricey side (6.50) and it is served in a plastic cup. Maybe i'm used to cheap happy hour prices but for 6.50 is close to ballpark prices. However, the people and service makes up for it.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "So this review is based largely on Mary the bartender who works the day shift. We love Mary. The Dubliner is my good friend's go to neighborhood bar and after spending some time there I see why. Cozy atmosphere, nice people decent bar. Plus Mary takes care of you. \n\nIf the window seats are open, take advantage and people watch in Noe. Great way to spend an afternoon.", "author": "Harper Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "Good neighborhood bar. Always nice good people in there. Gotta have an Irish carbon when your here. They taste great. When your good and drunk the donut shop across the street is open 24/7 and they also make sandwiches. \nLove this sweet lil neighborhood and it's funny lil bars. This is a good one.", "author": "First P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "Kettle one\n$7\nWeak\nTV's but front area avoids them & there's a cool window if it's warm", "author": "Dustin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Megan served my wife and I two of the best cocktails we've ever had. Unbeknownst to her, it was our 18th year anniversary and was the perfect capper for the night. Very cool, neighborhood bar vibe. Will definitely be back.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-03", "description": "Real Irish bartenders. Guinness and Boddingtons on tap (plus several others). TVs with whatever game you're looking for (of course you can watch the Giants). Plenty of seating including bar stools, small tables, and booths. A chill pub in a chill neighborhood, good place to meet a friend for an after dinner drink or three!", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "We were out exploring the Noe Valley and decided to stop by and try out the Dubliner. Fun place, nice bar tender and they did a great half and half.  I would go back..", "author": "Drew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "I really didn't wanted to go there, due to the looks of sports bar. I wanted a nice long drinking session with my friends. However, one of my pals can survive without oxyzen, but not tv. So, we went there. Good thing, we did. This place turned out to be a really nice surprise and we sat there for 3 hours and enjoyed drinking. Service started as good, but became better with time. Either we were getting buzzed, or our server realized we will be racking up some nice tab. \n\nHowever, food does take longer than it should and there is nothing special about it, but service and good drinks makes up for that.", "author": "Nocturnal K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Awesome neighborhood bar.  Quiet, drama free atmosphere.  Not rowdy like some other bars around the city.  Friendly bartenders. Never have a problem with parking in the evenings. Perfect place to hang out, watch games, and mingle.", "author": "Portia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Trivia night Thursday here was awesome! They don't serve food, but they let you bring in food from other places and eat it in here. The trivia crowd was great, and I'll definitely be back! The Sunset in Dublin cocktail they have is sooooo good!", "author": "Tina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-27", "description": "OK, so I used to come here a lot. A LOT. I don't consider myself a modern drunkard, but I used to frequent this place almost every day. There have been a lot of changes over the two years I've lived here, but it still remains a nostalgic little spot I can go and greet some friendly faces. That's one of the key pieces to this place: The people. The bartenders and regulars alike are just welcoming folk. \n\nYes, this is a sports bar so expect a 8 or so TVs on and sports fans huddled around the bar. If you like to zone out to a game and have a colloquial chat about carnivorous mountain goats or physics, this is the place. Sometimes you'll run into the annoying drunk, so be prepared to make some stupid excuse, hit up the jukebox for some Ice Cube and chat up a conversation elsewhere (it's happened to me quite a few times)\n\nThere is no longer a smoking room (victory for you snooty non-smokers, I guess) and the bar now extends all the way around much like Valley Tavern. This was a little disappointing, since the smoking room was great and sometimes nothing beat a quiet seat looking outside with a Guinness and whatever lame ass music might've been playing inside. \n\nNow the Guinness, which probably runs as one of the most expensive drinks I've seen anywhere in the city, is something that hurts this place. Last I checked it was $6.50. This might have gone down (not sure!), since I know the bar is under new management as of a couple months ago. I hear there are more specials here, so it might be worth checking out. Cheers, Dubliner!", "author": "Jesse Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "Since it's a Irish bar, we decided to go here on St. Patrick's Day. It was packed but it wasn't to the point where we couldn't move. They had some specials on the Guiness beer and Irish Car Bombs. The place is pretty cool. It's a little dark but the atmosphere is fun. \n\nThe bartenders are friendly and they make sure you don't have to wait long when you order your drinks. I wish the place just had a little more space to move around. I get a  little claustrophobic at times. Good drinks, good food, and friendly staff.\n\nDefinitely worth coming again.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-07", "description": "I've tried a couple of times, but this place just isn't for me.\n\n  During the day, I guess it is fine for a bloody mary or something.  The beer selection is not as good as the Tavern.   The crowd on weekend nights is usually kind of douche-y/marina-y, even more so then the rest of the Noe bars.  The wait staff is OK, but it still bugs me that you get a reciept with every order...  very corporate, not what I look for in a bar, unless I am at the airport on business.  And as Ravena notes in her review, the place has absolutely ZERO atmosphere for a supposd Irish pub.  Meh.  I've experienced much better.", "author": "Bad Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-21", "description": "Good scene, fills up but not crowded.  Beers aren't too pricey.  Pretty much what you'd expect from a favorable Irish bar.\n\nFunny thing, waitress comes by to take our drink order.  I ask what the drink/beer specials are and she lists a couple of beers and says \"yeah, it's only 50 cents off.  Not really a special.\"  Given that the beer is already relatively cheap, it didn't make too much of a difference on my order.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Great place for a townie bar feel. I went here back when I was trying to move to the city and had a great", "author": "Mitch A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-02", "description": "I asked for Margarita!..Pretty simple drink right?...So you'd think! Mine was alllllllll tequila, barely any lime juice, and no salt! The bartender said she was new. Ok Margarita is one of the easiest drinks! She needs to go back to bartender school. smh! Dumbass.", "author": "Coraline J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "Good neighborhood bar with really fun and charming bar tenders.  Great pub quiz.  Lots of fun.", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "Decent location, decent beer selection. Last time I was there though the only other clientele were these old men watching weird--all female--workout videos. Just a little strange for a bar.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-01", "description": "Megan is the best bartender and I wish I won that damn Yahtzee lotto pool", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "One of my fav bars. But why? Idk it's our hang out spot. Lol plus they got sports. Erry day!!", "author": "Matt O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "This place is great to relax, have a drink and enjoy the people.  The service was fantastic and the drinks are awesome.. not watered down!  We will be back at this establishment.", "author": "Rizzy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-07", "description": "I dunno.  I guess I like my Irish bars to be more gritty, less glossy.\nmore pub-food, less nothing-to-eat-but potato chips.\nmore drunks having \"conversations,\" less staring at sports from just about any angle in the joint.\nmore cheap, less Noe Valley.\nmore pub, less average sports bar.\n\nI do however, appreciate the clean bathroom and decent bar-tenders.\nNow bring on the Irish!", "author": "Ravena F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "This friendly sister of the Tavern up the street recently renovated away the 'pseudo-outside smokers den'.  So no more second hand smoke coming from the hotbox in the corner by the bar.  For what it's worth, it made the place much bigger and nicer.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "Such a fun trivia night spot. You can usually get a good spot and they even have specials on their drinks if you pay with cash. I was a bit peeved that their website says 2-for-1 drinks from 5-10pm on Thursday but when we showed up at 7 they said it ended at 7. I understand that til 10 is crazy, but take it off the website! Other than that, it was a fun place to meet friends.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "Everyone in the bar started to clap for my boyfriend and I when we walked in.  Initially I thought there was someone behind us... turns out that they were playing a game of clapping for anyone that walked through the door.  This is definitely a juju place!", "author": "Lea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "cool local hangout to grab a beer or a drink. Great vibe, good service, everything was clean - would def come back!", "author": "Tammy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-30", "description": "This place isn't bad for after work local watching. From the sidewalk it looks like any other pub in the city, but the inside shares a different story. \n\nHappening upon this bar one evening after work I was quickly noticed, asked for my order, and served a drink (2 actually). After a few minutes I went to visit the boy's room and to my surprise, no graffiti anywhere. I was blown away. The only bar in the entire city with no bathroom wall art. Amazing. This fact has led me to one conclusion...no actual fun happens here.", "author": "Art W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "Again always a solid 4 stars.\n\nThe people here are so awesome. I love meeting new people at neighborhood bars. You talk to the, you befriend them, then you have a nice local place to get together, simply awesome.\n\nps on special events they have free food, I came here for St. Patrick's day", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "Typical little Irish bar.  The patrons are a little more professional than the average sports bar patron I would say.  Pear cider on tap!  Small small ladies room (if you're too fat you might not fit, in all seriousness!).  :)", "author": "Kari S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "A few times I was in SF apartment hunting in the late afternoon and I would go this bar and have a beer.  \n\nIt didn't feel like I fit in perfectly, I felt like a lot of people were much older than me.  I like the decor, It's different.  It's nice to have this type of bar on 24th St. right in the heart of Noe Valley.  \n\nGood beers, friendly folks.  A place for people without tattoos and people from all over the place who don't fit in anywhere else.  Kind of mainstream people I guess. \n\nNot my favorite bar by a long shot, but I would go back for sure.  It's a handsome bar.  Try it out.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-08", "description": "Every now and then you have an experience that makes you wish there was a way to give a place zero stars. I recently stopped by to have a drink while waiting for a table at katsuu next door. The waitress asked for my id. My license was expired so I showed her my permanent resident card (aka green card) I was informed that they can only accept passports or dls. I told the bartender that this was official u.s government id and the reason I didn't have my passport was because I has applied fr a visa and had to submit my passport. The bartender was extremely rude and said that's is the policy of this bar. We left and went next door to the tavern which had better music, ambience and better drinks. Never go here again. Don't understand how they can have their own rules.", "author": "Vishal k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "I went with a group of friends and we were the only people there so it was nice and quiet. The bartender was amazing, very sweet and helpful. I would definitely recommend the pear cider, it was amazing!!", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-15", "description": "Just made my first (but not last) visit to The Dubliner.  It's my new favorite bar in the Noe.\n\nAfter visiting the Valley Tavern, I popped into this bar for another adult bevy, and was pleasantly surprised.   Micro and Miller on tap -- something to please any thirsty palate.  Large bar slab is sprinkled with locals from stool to stool, there's groups huddled around tall bar tables, and couples hanging out in the back bench tables.  \n\nSurprisingly clean bathrooms.  A clean bathroom in a bar is always note worthy.  It's like finding a priest at a Velvet Revolver concert -- An oddity that's got to be worth something.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "Good neighborhood bar. Good vibe, great dark wood. I probably need to spend some more time here to evaluate the crowd better.  I've heard they put out a spread of food during games, so that's a potential plus (although I haven't seen it myself.)", "author": "Todd S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-14", "description": "Great neighborhood bar.  \n\nGreat Irish bartenders, and hot cocktail waitresses.  \n\nAlmost never so crowded you can't order or walk around.\n\nGood place to watch sports in HD.\n\nWhat more can you ask for of a great pub-y dive-y bar?", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-14", "description": "I'm sorry, but with a name like The Dubliner, I'm expecting a pub.  This place is basically a sports bar with vaguely pub-esque overtones.  For Noe Valley drinking, I'd recommend the Valley Tavern or Bliss Bar.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-06", "description": "Last night was the first night I have ever been here. What an extraordinarily well-lit bar. Seriously, you can see every single pore on every single face, which, in terms of probability and attractiveness, might not be the best thing. It is refreshing to once again know what people look like, however, if you're saddled with something called \"standards.\" If you're curious, most of the people here were dudes on the wrong side of portly.\n\nAnother compounding factor that added to the sense of clarity last night: I did not drink. I ain't drinking for January, see? So I ordered a coffee, and it was FREE. Is this normal? Because it's awesome. From now on, I'm drinking all of my coffee in bars, and once February rolls around, I'm drinking all of my liquor in bed.\n\nNear the front of the bar, there was an obnoxious mid-90s microphone-less karaoke crowd yelling along to dumb songs. That popular song by Live came on (the only one, I think) - \"Lightning crashes, an old baby dies...\" or something like that, and I wondered, \"Who the fuckity foo picked that damn song to play right damn now?\" Is that song just about abortions? I don't know why I think that's what it's about, still. Anyway, a choice track by Bush (?) followed it on the jukebox and I was reminded of the bittersweet mid-90s, when I reigned as an insecure high school lord, suckling at the sweaty teat of MTV for cultural sustenance.\n\nThere's also a smoking patio out front, which always happily toasts my nipples.\n\nNipples and teats! Nipples and teats! I don't even know how to review a bar if I didn't drink there. It's like I don't even know how to be anymore. I was smiling and laughing most of the night, though, so I'll give it 3.75 stars, to be rounded up to 4 by the cruel math gods behind this website.", "author": "Max H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-28", "description": "Not the worst place to go for a drink, but near the end of my list of the 24th Street bars...  It's, I dunno, OK, I guess.... \n\nLots of beers on tap and every game you can think of from futbol to cricket, and a good amount of (kinda creepy) barflies...\n\nI have tried this bar a few times and have never been really impressed, but I like booze, so I will probably be back.\n\nMove on up a couple of blocks to the Valley Tavern.  Same owners, better bar.", "author": "Tony A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-24", "description": "Willing to play music when Tom Brady and Peyton Manning are facing each other in primetime? Its a nice enough place to have a drink but has zero credibility as a sports bar for me. Combine with a ten minute wait for a drink and I'm closing out and headed somewhere else.", "author": "Jeremy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "I've recently moved to Noe Valley after a overdrawn stint in the Marina (is there any other kind?). The Dubliner, being so attractively close, offered a quick haven from the dog strollers and baby leashes. My friends and I were immediately welcomed by the friendly staff and found our nest in one of the back booths. Not only are their TVs plastering the west wall for the fans of the bar stools, but the two booths in the back pretty much have their own screen for the games. We didn't have to wait more than a minute for our beers, and that's really all it took for me to start my love affair with The Dubliner (see current crush in my profile). As much as I want to explore the scenery at the Valley Tavern or Noe's Bar I can't help but feel like Hugh Grant leaving Elizabeth Hurley for that [less-appealing prostitute]. I do love the nearby alternatives, and it's unfair to equate them to desperate hookers, but at the end of the day The Dub is all I want.\n\nAnd although she was sexier with a cigarette between her lips, I'm sort of glad she quit smoking.", "author": "Max S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-15", "description": "The three stars is for the crowd and the ambiance, not the bartenders.  I was also there on St. Patrick's day and agree with Carla D's review.  The young drunk americans decked out in their finest green made me feel like I was at a frat house.  There was lots of screaming and every surface was sticky.\n\nOn the other hand, the bartenders were great.  We walked in pretty close to last call and got served immediately.  The bartenders came up to us right at last call to see if we wanted another since we had come in so late.  I'd like to come back on a weekday where it won't be so holiday cliche and possibly bump up my rating.", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-12", "description": "The food was mediocre. Drinks were ok too. Took forever to get the bartenders attention who was busy chatting up some friends. \n\nI think it's a place for guys to hang out. It is definitely not a place where bunch of girlfriends can meet for dinner and drinks. You can hang out there if you are wearing sweats and flip flops...  wanting to hang out with with a beer in hand.", "author": "Soham K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-06", "description": "I'm the girlfriend of a beer perfectionist.  It's harder than it sounds, trust me.  I like a good beer- don't get me wrong- but after so many, well... a beer is a beer is a beer is a beer....\nMy saving grace from wringing my hands and biting my lip in anticipation of boyfriend's reaction to seeing the typical beer list?  The Dubliner.\nThis bar has some of the best beers on tap that I (and Mr. Picky) have seen.  As if that isn't enough of a relief for me and my blood pressure, the bartenders are unbelievably friendly and fast. \nThe only reason I'm not giving five stars is because of the slurring, stumbling, middle-aged drunks that sometimes make the Dubliner their drinkery of choice.  Not always, but enough to note.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-25", "description": "A solid neighborhood pub, as blue collar as Noe Valley is capable of.  More like powder-blue collar.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-07", "description": "Many a happy night my friend.\n\nDrinks, average priced.  Selection, GREAT!!  Clean, mellow, tvs for sports and a killer cd jukebox.  \n\nThat's all you needed to say to get me there.\n\nOh.....well....cool mellow neighborhood boys too that play for my team.  That was the clincher.\n\nSeriously though.  A lot of locals during the week and everybody is mellow.   One of my favorite bars in SF.  How I miss thee!!", "author": "Joan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-09", "description": "Irish sports pub?\nWho KNEW!!!!\n\nBeer tastes mostly the same in most bars, but the people that spend time at the Dubliner in combination with the TV's (great for sports) and the bartenders are always great. They have a separate smoking area for you cancer lovers which is great because you have your own area away from people like me!", "author": "JR H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-11", "description": "Second favorite bar in the city (see Valley Tavern) due to its laid back nature and great bartenders.\n\nIt does get crowded during the weekends and during sporting events, but it's still manageable and everyone is usually pretty nice.\n\nI do miss Peggy the Bartender though.  She introduced me to the Flaming Lamborghini and let me hang out at the bar after hours.  Cheers Peggy!  Where ever you are!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "I'd have to say this is my go-to bar in Noe Valley. Comfortable, lots of seating and an excellent jukebox. It's one of those damned Internet ones, but regardless, the patrons usually put on quality stuff. Also a good place to catch a sporting event with lots of conveniently placed TVs (even a big flat-screen outside on the smokers' patio for those of you that got 'em).\n\nTons of beers on tap and pretty good house wine. Can't say anything about the liquor as I don't drink the stuff. The bartenders are super friendly and will even stop to chat if it's not too busy.\n\nThey order the food from across the street at Joe's. It's pretty good pub fare, nothing special, but not bad. The fries are delicious.\n\nAnd not that this matters, (really? we need to vote on coat checks? isn't there a more worthwhile category like \"stench\" or \"bathrooms\" for cryin' out loud?) but they do have cool little hooks under the bar for those coats and purses that are burdening you so much.\n\nSpeaking of bathrooms, they have pretty good ones (usually clean, multiple stalls, etc), but the men's urinal sitch is somewhat awkward. Go pee and you'll see what I mean.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-19", "description": "Avoid using the ATM there. It can debit your account but not give you the cash. I had this happen to me and I heard from others that it has happened before. Use the one down the road. Ed pours a perfect pint, though.", "author": "Gary G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-11", "description": "$6.00 for a Guinness?\n\nYou MUST be joking.\n\nGoodbye, Dubliner - the bar I frequented for so many years.", "author": "D B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-20", "description": "This review is probably not the most fair because I was here Friday night on St. Patrick's day.  The place was packed, they even had the street outside blocked off.  The crowd inside wasn't really Irish, more Americans wearing big stupid green hats and green beads with plastic clovers hanging off them.\nI bet its a way better vibe on a Wed or Thurs night, probably a good bar for the locals.", "author": "Starla D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-26", "description": "This place is awesome and worth checking out if you haven't already. I was there for the first time last night and I had a great time. There are so many TVs that you can see one from anywhere in the bar but you wouldn't need them cause the people there are so fun to talk to and chat with. I been to a lot of sports bars but this one takes the cake go check it out!!!!", "author": "Cesar L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-02", "description": "You know, last week I stopped in every bar from the 3300 Club down Mission St., over to Valencia to hit up the Dovre Club and Clooney's, and then hiked my ass up to the Dubliner, by myself! Yeah, I should have been sauced after that, but NO, I was not. Instead I merely stopped in every bar I could find trying to find the Kings play-off game. Watching the game shouldn't be that hard. I'm not even going to go into the fact that Comcast screws me on a regular basis with their snubbing of Sacto games. Why don't you sue me for having an allegiance to Sactown's team? Yes I grew up in Sac and had the sense to move away but I still want to watch the damn game.\r\n\r\nAnyway, to keep this somewhat brief, the Dubliner is the only place that I've found in the Mission/Bernal/Noe area with satellite coverage or league pass. If someone else knows of another place, do tell. \r\n\r\nThe staff at the bar are always quite pleasant and turn on the game for me, plus they have table service which is a plus when you're into the game and don't feel like making chit chat with some dude who thinks you're hitting on him b/c you (a solo female) sat next to him. Feel the wrath yet?\r\n\r\nIt should be made clear that the bar gets 4 stars based on 3 simple facts. 1, they have satellite, 2, they take cards, and 3, full bar so I can enjoy my Stoli and soda instead of downing Coronas. I'm not going to talk about the music that I've heard there, except to say that I'm not a fan of the back to back Ashlee Simpson/Kelly Clarkson/Cher triple threat. Sigh, what a girl has to endure to watch the game. I'm especially bitter b/c I know I'll end up there again tonight, for the game. End rant.", "author": "Candice L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-26", "description": "Despite the complaints listed by other reviewers, I really like this bar for a pint on a slow weekend night or a night when I actually have to get out of be the next morning.\n\nYes, the drinks are a little overpriced and there are too many TVs.  But the waitstaff (several of whom actually are Irish in my experience) are friendly and the patrons seem to be, too.  It's usually not hard to find a seat at a table, or up at the bar, and the music is never so loud that I can't easily have a conversation with whoever I'm with.\n\nI've never tried ordering food here and don't imagine I will anytime soon.  They have some deal with the restaurant across the street that seems a little dicey to me.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-04", "description": "Chill ass sports bar. Great get together spot with friends. Good place to wind down a long day or a crazy night. Definitely a good place to be a regular. The bar staff ridiculously  nice and down to earth. \n\nThe whole feel to this bar is homely. There's a front smoking room where once can smoke and feel semi-ly inside. It's a smallish area which gets nicely packed, not sardine packed but more like crayon box packed, so there's enough room for personal space but not too much so you gotta mingle. In the back area there's booths so one can chill with buddies and sip on some good hearty beer. Not too rowdy so good conversation can be initiated. \n\nGot spot to kick back and enjoy a beer, but hey its a sport bar so big game nights. It's gonna be full of rowdy men...and boys. Go and enjoy this charming Dubliner.", "author": "MJ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "The staff members are frigging friendly!!!!! Do we air Rugby World Cup Final this weekend?", "author": "Sostrong B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-18", "description": "I like this bar.  It's a clean, warm friendly and reassuring place to get drunk.  Drawback is the open-windowed smoker's lounge in the front (but a plus for smokers, I'm sure).  Even though it's completely separated from the rest of the bar, every time someone opens the door, well, you know that lovely backdraft effect that sucks the smoke right into the place you're trying to keep it out of? Yeah, that kinda sucks, but then again, I'm one of those ragingly super-sensitive-to-cigarette-smoke people, so it may not be such a big deal to everyone else.\r\n\r\nAnd, yeah, beer runs you the same old $4-$4.50 as any other place in this city that just routinely rapes you for your beer habit.  Plenty of TV's everywhere for games and general boob-tube watching.  Sorry to hear that the owner is a \"colossal dick,\" at least that was good for a laugh.  Do wish they had a kitchen so I wouldn't have to wander away from my comfy bar seat...Meh, I love it anyway and I'll keep taking the short ride on the J to keep coming back.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-31", "description": "This bar has been sucking my friends in one by one for a while now.  It's nowhere near my own neighborhood, yet I keep finding myself there.\n\nI don't smoke, but one of the main features of The Dubliner is the smoking room; it's isolated from the rest of the bar, and has a wide open window onto the sidewalk and a little sliding service window to the bar.  Since all my friends were gathered there I braved the cancer vapors for about 7 hours one recent Sunday afternoon/evening chasing away a particularly vicious hangoever (and yes, giving myself an even worse one the next day -- so surely my judgment is suspect and you may want to take this review with a grain of salt).\n\nI was drinking beer, but my cohorts seemed quite fond of the bloody marys. \n\nHere's a Tip:  If you're hanging out in the smoking room for an extended period of time, you might want to hang your jacket in the entryway outside, away from the smoke.", "author": "Doublejack X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-24", "description": "I can't say I will never go back, but have been actively avoiding the place recently even though it is my \"local\", and there is not much else in Noe Valley.  Why?\n\nI have been going there pretty regularly for three years, and as such I have watched the cycle of employees rotate at a phenomenal rate.  This means even though its my \"local\" I know practically nobody who is working after 5pm.  The biggest issue (other than being treated like a stranger in a place I used to go every week) is that these new gals (and they are almost always gals) have little or no bar tending experience at the start, so no chance of getting a decent cocktail until they get some experience.  Once they have that they either run away from the terrible working conditions or get fired by the owner.  Its happened to at least 20 gals there in the last 3 years.  I have never seen anything like it before.  Its all I can do to keep from shouting \"run away\" at the new faces that appear there like clockwork every couple of months.\nThis would be bad enough on its own but we have just accepted this for the last three years as the way the place runs.  What is the final kicker is that the owner's solution to a troubled economy has been three price hikes in the last 6 months, specifically on what were once the cheapest drinks in the place (and on all the biggest sellers).  This means $4.50 for PBR on draft, $5 for Corona in a bottle, $4.50 for Miller Lite, etc.  So one can either pay $5 or $6 for a draft beer , $7 for a glass of lousy wine, or  $6 or more for a shot of liquor.   \n\nWhy on earth would someone who owns a bar *punish* the regular customer by singling out their regular drinks?  It makes no sense to me at all.\n\nSo at the end of it, I find I can't in good conscience spend my money there anymore.  if I want to drink PBR on draft, I can walk to Doc's Clock and get it for $2.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-28", "description": "A real chill bar....you can come here and enjoy a pint and some shots with friends. \n\nJust another alternative to some of the other bars I go too. The bartender is a cutie too!!:D", "author": "Dustin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "Cool bar, fills up but doesnt get too crowded and there's plenty of seating. Not the biggest beer menu but still I think it does the job if you just want to have a happy hour. Unpretentious without being divey/hole-in-the-wall.", "author": "Ash S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "We decided to go here on a whim -- very glad we did! \n\nFriendly staff, great music, and 10 screens ( I counted) to watch the game! They had a New Zealand beer, Steinlager Pure, which made my boyfriend very happy. At about $20 for 4 beers, the prices aren't bad either! We'll be back!", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "Great local pub. We definitely felt like we walked into a bar of regulars but it didn't feel exclusive or that we were intrusive. Good comfortable place for a beer. The bartender was fun and friendly.", "author": "Eliz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-20", "description": "I go here often. It's definitely a pub. I don't know why people on here say it isn't. I don't know what else you're looking for, bub.\n\nEveryone's friendly. I always end up talking to someone new. It's the BEST for daydrinking.\n\nAnddd...nightdrinking.\n\nI enjoy the people that work there. No one mentioned Liz. Liz is the best! Jenn's good too.", "author": "Valencia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-16", "description": "Best bar in the Noe Valley to watch the Giants.  Free food on Sundays (nothing fancy, but it's free).  Low-key, locals.  You can order food in from Basso's, which is very yummy.", "author": "Kacie O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-15", "description": "An attractive traditional pub front, a nicely maintained and comfortable interior, a number of flat screens for BBC programming and sports channels, a friendly British bartender who knows her mix of regulars well, interesting and humorous conversations, competently made drinks with beautifully fresh fruit garnish, but--wait for it--no food (though it can be brought or ordered in). (poet sighs, shrugs, smiles.) Otherwise, a great Noe Valley place to play hooky.", "author": "Poet D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-12", "description": "Yikes! $6 for a glass of Magners! And I wasn't offered ice (not that I would've accepted). And very a loud jukebox.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-02", "description": "After an awesome dinner at Eric's Chinese my boyfriend took me here for some drinks. He was the DD. He ordered a soda water. When the tab came we noticed it was a bit high. To our horror the soda water was $3.50 a glass!!!! No warning from the bartender. Never have we encountered this at any bar in SF and we will never return.", "author": "Joanna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "No frills local bar. Good place for a low-key drink or to watch some sports. Bartenders are usually friendly and attentive.", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-06", "description": "I have been coming to this bar for almost 4 years now as my 'local,' and despite the problems others may have with the pub, you can still find me there more often than not.\n\nThis place has become my real-life Cheers. I know I can stop-by anytime and see someone I know behind the bar or in front if it. The crowd covers the gambit of ages and professions. \n\nWhen one of the regulars died unexpectedly last month the bar not only became a meeting place for us to gather and grieve, but they also provided food after the memorial service.\n\nThis bar helps define the term \"Urban Tribe.\"", "author": "Kemp M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-25", "description": "For a local pub, this has always been my favorite.  I lived in Noe Valley for years and some weeks we hit the Dubliner five of seven nights.  Great staff and yummy Guinness - what else could you want?", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-22", "description": "I award The Dubliner 5 stars because it has everything I appreciate in a pub.  Great selection of beers on tap.  Anyplace that has Blue Moon on tap is golden in my book.  It's never too crowded though it may be hard to get a table on a Saturday night.  It's dark enough to not feel like you're on display but bright enough to people watch and appreciate how clean they keep the place.  \n\nThe bartenders are always friendly, especially Ed!  *Bonus! they put out salt & vinegar chips during happy hour and last night the bartender made Panini's for everyone!  Talk about a nice touch!  \n\nAnyhow, this is a great low-key bar which I'm lucky to live stumbling distance away from!", "author": "Maura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-16", "description": "This is my home away from home, my \"Cheers\" if you will.\n\nI love it because even though I'm a regular and peeps know my name and preferred cocktail, everyone is treated the same - so if you're new, you're part of the family.\n\nGreat place to catch any sort of game, talk copious amounts of smack, smoke a ciggy or 50, and have a cold frosty one while you're at it.", "author": "Brandie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "Deprived of cable, I'm forced to venture out into the world whenever I want to watch a Warriors game.  \n\nI've yet to find a comfortable spot down in the Mission for this purpose so I had to venture out into another hood.   While the Mission is full of dive bars, it's decidedly lacking in Pubs.   I prefer dark woods and guinness on tap to dirty floors and PBR in the can.  I'm just not cool.\n\nWalking into the Dubliner, I knew it was going to become a somewhat regular destination...both for watching games and just for grabbing a nice guinness.   All the required Irish pub characteristics are here...the dark woods, a good beer selection, and even a couple legit Irish guys were sitting at the end of the bar.   Maybe they're just plants to improve the vibe...if so, their clever plan worked on me.    It's most certainly different on a weekend night, but it was mellow and they keep music down to a comfortable level where conversation can happen....something that is VERY difficult to find in the Mission.  $5.75 for a Guinness is expensive in my world, but my bank account is learning quickly that EVERYTHING is more expensive in the City.  \n\nA couple Guinness and a Warriors win later, I'm a happy man.   I have a feeling I'll be making pretty regular trips up 24th st. for this destination.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-30", "description": "I love this pub for a 'pint'  (of Guinness) after one of my exhausting Saturday afternoon shopping jaunts on 24th Street!\n\nI have enjoyed the Dubliner, and the bar staff!  (Brazilian daytime bartender) for years. I am comfortable either socializing there, or simply watching TV whilst sipping my pint!\n\nI also relish the great football (aka soccer) matches I've enjoyed there.  While not a glossy sports bar, it's definitely a comfortable neighborhood joint.", "author": "hugh c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "The only reason I go to this bar is to hang with my favorite bartender, Liz.  She is awesome to be around, funny,  and makes me a mean stiff drink every time I go in.  And, that's what I want in a bartender and a bar.", "author": "Luke L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-07", "description": "Where else can you get a beer tower (1 gallon!) of beer? Dubliner is one spot. A simple, neighborhood bar with a variety of beers on tap from PBR to Smitwick's to Blue Moon. The plus side is any of the beers can be served in a Beer Tower. What is that you might ask? Just a cylinder full of beer, a gallon's worth to be precise, with a small twist tap at the bottom. A beer tower is not cheap but when you are going to drink a gallon of beer with friends do it in style and class! Normal pints of beer are on the expensive side but the smiles and friendly nature of all the bar staff make up for it. And if your gallon of beer does not quench your appetite you can order in at Basso's rather late.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "Solid.  Not classy, but not a dive either.  Not a great beer selection, but not bad.  Good for games, and overall good atmosphere.  Busy just about every night, but rarely packed. Even a semi-outdoor smoking area for those in need. Overall a great spot to have within walking distance if you live in Noe.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-20", "description": "In all honesty the joint should get more stars because the regulars there are so swell, but that's personal bias and not a straight up review. \n\nIt's not my kind of bar, I like a joint with actual personality. There are too many televisions playing too much sports, and I don't care about that. Yes, they have one of them newfangled digital jukeboxes that can play pretty much anything you're into, but that does not spell personal style to me. Give me a machine where the staff and regulars stock their own discs, that'll give you a sense of flavor. \n\nYes, they have a windowed off smoking area, nice and open to the street, and that's a good thing. The bathrooms are impeccably clean, I'd be comfortable taking a #2 there. In fact... well, never mind. \n\nPer the bartenders, I found that coming in with a regular had me treated well enough at the bar. But other than that? It seems pretty cookie cutter neighborhood tap. \n\nIn all honesty, it's the regulars that make this joint, and boy, do they ever. They're there all the damned time. Too often, to tell you the truth. Bunch of worthless and wonderful drunks. When I first stepped in I asked myself, what the fuck is the hype about? What's the attraction?  It's a nothing bar, and it isn't like it's super cheap. It's just...close by to where these guys live. Hence they're there. Hence, I've always had a good time whenever I've been to visit (I'm from NYC). But if I was just wandering the area and knew nobody? I wouldn't even drop in, unless I needed to use the can, but at least then I'd be happy.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-19", "description": "a friend and i stopped in before going to a housewarming in noe valley.  if we'd gone straight, we would've been hungry people (first to arrive, last to leave) and that wasn't going to happen.\n\nthe dubliner was pretty mellow, definitely not a modern sports bar.  there were people but it wasn't too crowded, the bartenders were good and quick and i was able to have a conversation with a friend i don't get to see often, without screaming.  \n\ni appreciated the smoking section but it was very box-like and i don't enjoy being in boxes.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-20", "description": "I have only been here twice but it was great both times!  The service is great and the feeling in the bar is so positive.  It seems to be full of regulars but they don't seem to mind when a new comer pops in.  I will go to this bar again...maybe even become a local since it IS in my neighborhood!!", "author": "Chauntay J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "one of two choices for a pre-Firefly heat on, the other being Bliss. I secretly prefer this bar b/c the boys are more masculine than at the other place. guys here drink like guys should (pints and highballs, no cosmo boys here). I do not enjoy sitting amongst emo boys, they are so annoying. and I don't like watching boys suck on mojitos through a straw, it paints an ugly picture. the boyfriend thinks I like it here because of the sports they always have on the TVs. sure, honey, you go ahead and think whatever you want.", "author": "Prima D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-09", "description": "Great little pub in the 'stroller district'.  Nice place to start off the night with a pint and a few firends.  Not a bad place to catch the game either.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-12", "description": "This place is so eye catching and inviting from the outside.  It is hard to miss it when driving down 24th street and it is just so inviting.  It's clean and friendly, and filled with local Noe Valley people.  It didn't seem to be a very Irish bar when I have been in there though.", "author": "Pele N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-01", "description": "I've only been here a couple of times. The morning after the Dubliner, I tend to wake up a tad hung over & reeking of smoke. After searching my mind a bit, I always recall having a great time. The crowd here is typically a group of  like 30  regulars, but they are all welcoming. I always end up singing, dancing & ALWAYS meet someone new whose company I enjoy.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-27", "description": "I come here to get my naked photo hunt fix.  Yeah, I'm dirty like that.", "author": "Dawn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-16", "description": "The Dubliner is a great neighborhood bar, cold beer, great service, clean, safe, good jukebox, great meeting place, for good friends or first date I'm a Corona guy, and at $5 its reasonable for the neighborhood....Highly recommended", "author": "Victor T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-24", "description": "What can I say? What does one rate a bar on? This one caters to smokers, which is a big deal to some of my friends. Other than that, it's Noe Valley at heart: not exactly why you wanted to live in SF.", "author": "Michiel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-12", "description": "Great bar, with a smoking section!  No joke.  A patio on the street closed in behind a half wall, and insulated from the rest of the bar, complete with 2 televisions and lots of ashtrays - and waitress service!  Good selection of beers, and a well-poured Guiness.", "author": "writer e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-19", "description": "Four Monkeys!  Simians love the Dub!  The Dubliner is a fantastic neighborhood bar, where literally everyone there knows everyone's name.  At least, I do.  It's the only bar in Noe that shows sporting events that isn't a pisshole (for reference see: Noe's Bar & Grill), it has Golden tee, and a fantastic barstaff.  Also, the best jukebox technology can produce - besically iTunes.  The only drawback is that the owner is a colossal  dick, and a tightwad to boot(redundant), so drink prices are pretty high, and he cancelled MLB package.  He's never there though, so pretending is the norm.", "author": "Pete S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-24", "description": "My neighborhood bar.  Great place to grab a weeknight drink, watch a game, or nurse the weekend hangover (the Dubliner makes an excellent bloody mary, with a touch of Guinness -- trust me, it works).  Bartenders and regulars are all very friendly folks.  Plus you can order food from the 24th St Cafe and they'll bring it across the street to you.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-15", "description": "This place is a proper Irish bar, if there is such a thing. Excellent staff who get your pint promptly without you having to let off a rescue flare to get their attention, this is critical stuff. Good work people, keep it up.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-03", "description": "Four stars for a bar in Noe is pretty dang good. Perhaps it's the skewed expectation level. Hmmm...regardless, the Dubliner is my go-to bar for the first couple drinks before heading out or the last foggy shots before crashing. No other bar has ever made me feel like \"just a few shots of Jameson\" is the obvious choice.", "author": "Julia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-23", "description": "The last couple of weeks I have been looking for unexpected examples of kindness. I had this whole dramatic series of events related to the lost and found of my cell phone. As I do not have a working home phone it was harder to communicate to the person who had my phone. (this does relate to the dubliner). \nI had to go around to my neighbors to make a call to make arrangements to pick up the phone. My next door neighbor was very suspicious about my use of the cell phone. (he would get two stars as he is quiet but not friendly)\nAnyway this person (who would also get a five star review as she is quite cool) lived in Noe Valley. Now I still get Hayes, Cole and Noe Valley mixed up. I find a parking spot in front of the Dubliner and I ask the people seated in the smoking area, \"this is the stupidest question of the day but is this Noe Valley?\" They aggreed that it was a stupid question but informed me. I then said something about my situation and looking for a pay phone and one of the patrons offered me the use of his cell phone. When I got the address one of the other patrons made sure to tell me that it was well beyond walking distance and so I got into the Marcusmobile and drove up the hill to pick up my phone. These were good people at the Dubliner.", "author": "Marcus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-14", "description": "really quite good bloody mary's.\nfriendly staff.\na lovely smoking room overlooking the street. \nthe place is nice. \nit makes me feel grown-up.", "author": "Sole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-09", "description": "No place is better in Noe Valley to watch every football game at once.  Great Bloodies, and many beers on tap.  Go Jets!", "author": "Russell S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-19", "description": "Hands down my favorite bar in the city.  It is so laid back and friendly.  The bartenders are so nice and generous too ... one of them (of course I forgot her name) made me 3 free drinks on my bithday and one of them even had flames coming out of it.  The little smoking room in the front is so great if you're a smoker and don't want to freeze your ass off or leave your beer behind when you want a smoke.  Also they have menus (definitely for Haystack pizza and maybe other local restaurants but I'm not positive about that) and will order food for you and get it delivered so it doesn't matter that they don't have a kitchen.  If you like a friendly neighborhood bar where you will feel comfortable and welcomed while getting your drink (and smoke) on, this is the place for you.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-07", "description": "My favorite pub in the city.  I go there to see my \"family\", grab a pint and watch the game.  Enclosed smoking sections helps the addicts stay out of the Noe Valley wind and the bartenders are excellent.", "author": "Dean H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-21", "description": "Nice Irish Bar that could be deceiving from the outside. The inside is very nice and clean and they have plenty of tvs. The smoking area out front is a nice feature (though I do not smoke). The bartender and cocktailers are very friendly and efficient. The jukebox is also rockin (no pun intended) being able to look up songs on the internet. Great place to watch a rugby match or soccer game, or just catch a Warriors game.", "author": "D J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "Good spot to hang with friends and grab a drink while playing trivia", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-16", "description": "ok when i'm not working, dancing, or on the computer, you'll find me here musing over my problems with a stella(s).  the cast of characters and total control of the jukebox are just the therapy i need to get through another work week.\n\nif james joyce were alive he could write a vignette on all the illuminations i've made as a dubliner.", "author": "Lissa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "Even though their happy hour is weak, I still love this place.  Lots of TVs too.  If nothing American is on then they're usually showing Rugby, which is always nice.", "author": "Gary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-04", "description": "Love this bar!  LOVE the upstairs pool table that you can usually get to yourself if you go during the week.  Sweet!  All around great neighborhood bar!", "author": "Diana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-10", "description": "Despite the lack of food in the place, it was quite accomodating.  I'm new to the Bay area and was looking for a place to watch the W's game the other night and decided to get out of the Mission (where I'm yet to find anyplace to watch a game) and explore the land of baby strollers and soccer mom's.  I was pleasantly surprised by The Dubliner.  They had a couple of quality televisions in the place and were more than willing to change the channel when asked.  Also ran across some cool people in there that helped to pass the time.  Not a bad happy hour, as I was paying 4 bones for the duration of the W's game and they have a nice outdoor smoking are where there is a small tv.  One of the few places that doesn't make the smoker feel like an outcast.", "author": "doug s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-12", "description": "I enjoy this place. They do it right. Simple, friendly and old school. When you go to a pub, that's what you expect, and that's what you get here. I see more nights at the Dubliner in my future.", "author": "O'Nelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-12", "description": "went saturday ...night  .......irish ed the bartender ......got us really wasted it was awesome best time ive ever had in the dubliner...........irish ed rocks", "author": "tommy b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-03", "description": "As sportsbars go The Valley Tavern, and consequently The Dubliner (same owner, same block), try very hard but fail as places to go see the \"big game\". The televisions, while plentiful, have the distinction of being roughly ten feet directly above your head, making for a very sore neck after three hours of football. In addition, the view from the seating area another twenty feet away is no better, and from there you will also have to wait a century before the waitress will arrive to take your order. For that matter I found the bartenders to be completely obnoxious when I sat at the bar. When the waitress came to take my order (at 11 am) I let her know I would need some water to rehydrate first and would then have a beer. She brought me my water. Immediately following, the second waitress behind the bar also asked me what I would like to drink. I told her the same thing. Within fifteen seconds of that conversation the owner approached me from behind the bar as well. He informed me that there was a two drink minimum and that he was \"trying to run a business\". This all took place within three minutes of my arrival. Is this really the way to treat your customers? Suprisingly, the owner decided to utilize this same setup for both of his pubs.", "author": "Doug G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-20", "description": "i give it 5 stars for its allure and experiences during football season.  this place is packed with tvs, never too crowded, and always has a diverse range of fans. unlike the connecticut yankee (pats) and kezar pub (uber looser eagles fans) the dubliner is afc/nfc friendly.  they have recently started a free bbq, which is generous, and also allow you to order food from nearby restaurants.  finally, the owners and bartenders are very friendly, tolerant of drunk football fans, and always asking if you need anything.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "great (clean) place for friends to gather in a booth and laugh.  one of the best bloody mary's in the city.  good 'ol pub.", "author": "regina k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-17", "description": "I really liked this place.  I went for happy hour and left happy!  $4.25 blue moons is a little expensive for happy hour, but the vibe of the place was good.  Lots of tv for sports and plenty of bar space.  I'm sure I'll be back!", "author": "Jo M."}
