{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Pretty cool bar with an interesting history! Friendly clients and bartenders. Interesting cocktail mixes and knowledgeable staff. Nice place to kick back and chill.", "author": "Toshi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "This bar is amazing. They are unjudgemental, chill, knowledgable and amazing. I grew up here and have alot of issues with \"hipsters\" or whatever. I feel at home here. Super glad they are keeping our freak alive. Long live service industry workers!", "author": "Mercy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "Very cool bar located across the SF Armory.  They've got a great relaxed atmosphere.  I came when they had just opened on a Saturday so the place wasn't busy, but there were surprisingly some people there as well.  It was a nice, chill environment with a great bar and good cocktail menu.  Drink prices were pretty reasonable here with very friendly bartenders.  The place has quite a bit of space as well, it felt pretty open.  The decor was really nice, surprisingly not as provocative as I would have guessed, but still very cool.  Overall, great bar that I would definitely like to come back to.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-18", "description": "The Armory Club is inspired by the actual armory across the street, which is currently used to film X-rated flicks. But I didn't see any sign of it trying to be sexy by associating itself with the risqué activities across the street. It's simply a nicely decorated place with a decent menu of cocktails, beer, and wine. Service is friendly and decent. \n\nPerhaps if you were to rent a private room here and put on a kink-themed function, then things would be a bit spicier here. Otherwise, there's really nothing to differentiate this place from any other upscale-aspiring cocktail bar anywhere in the West Bay.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "Left a bad taste in my mouth with the bartender who asked for more money on the tip when it was  the wrong way to approach us when he didn't read the tip right and we are regular customers", "author": "Lydia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "TLDR: The Armory Club venue and staff are second to none for hosting an intimate or large celebration in a private venue for a great price.\n\n---\n\nAfter researching almost every venue rental in San Francisco, I rented The Armory Club basement for my boyfriend's surprise birthday party. The rental price was $300 from 9PM-2AM for the entire basement on a Saturday night, which included a private bar/bartender, 2 gender neutral private bathrooms, a dance floor, and DJ booth (DJ not provided, I booked separately). They did not require a beverage minimum (although I'm sure my friends would've more than hit it).\n\nThe staff went out of their way to accommodate early setup to ensure the surprise, created a specialty drink to keep with the party theme, provided a fast and phenomenal bartender (Jason, who is also the owner), and met with my DJ to see what equipment would be provided/needed before the big day.\n\nWe had ~65 guests, and the space was PERFECT. Most guests were on the dance floor/at the bar while some sat at the booth tables or took pictures at the photo booth I brought (area next to the bathrooms). It never felt overly crowded, and provided a great flow.\n\nSeveral guests commented on the affordability of the drinks and the phenomenal staff. It felt great to provide everyone a night that didn't break the bank and was fun for everyone.\n\nHighly, HIGHLY recommend Armory Club for private events of any size!", "author": "Sarah U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Classy yet edgy bar, with great drinks and great service. It doesn't serve food, but it's well worth a visit before or after dinner. And if you're not sure where to go to dinner, just ask the bar staff--they are happy to help. \n\nIt's a few yards from my office, so the first time my wife came to visit me at work, we popped in there--around 6 on a Thursday. The interior is spacious and elegant, like a London gentleman's club, with leather furnishings, brass fixtures, and a faux tin roof. I suppose the artwork, especially the bondage photos (Mapplethorpe?), may not be so typical, but it gives the place a local twist.\n\nIt has an enticingly exotic cocktail menu, a good wine list, and an eclectic selection of draft beers, including some from the neighboring Standard Deviant brewery. It also has a great happy hour. The creative and delicious cocktails are great value at $6 during happy hour, which appeared to still be going strong when we left well after 7. \n\nWhen we told the bartender, Sean, that we were new to the area, he gave us a list of other bars in the area to check out, and pointers on what to look for. I would hope for that from a really good hotel concierge but did not expect it from a bartender. It was good advice and we enjoyed a few of those other bars that very night. But with that kind of service, you can be sure we will be back to the Armory Club.", "author": "Matt A C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "Nice drinks, fun atmosphere, friendly and helpful bartenders. 21+ with a bouncer at the door, not for children or families with kids. Would recommend for young people in the local SF area.", "author": "Zoe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Classy bar in the Mission with unique (and reasonably priced) cocktails. The bartenders are all super nice, and are happy to customize a drink to your liking, too!\n\nThere's ample seating available (including the back bar area), so plan to come here and stay for a few drinks or two.", "author": "Sejal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "The music is pretty good! All the space was thought perfectly. The bar and the lights are in perfect sync. The drinks are awesome! And has a broad variety of drinks. From local craft beer to strong cocktails. If you are with someone you can easily get in the mood. \n\nNice place!", "author": "Karolina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Great watering hole...no food. Its a sexy, super-chill place with ample space and bar, table and couch seating options. \nThere's a back room with a small bar- I'm assuming for busy nights. I was there on a Wednesday- it wasn't empty but the back bar wasn't needed.\nI got a gin drink from the menu. It was good but apparently not good enough that I can remember it (it was the only drink of the night so drinks didn't impede my memory)\nThe staff was attentive but not overly friendly. \nI highly recommend this spot", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "Although the theme is kink (it's owned by Kink.com across the street), it is one of the classier (and pricier) bars I have been to in the Mission. The decor is absolutely superb here. Leather seats, damask wallpaper, and some beautifully done artwork depicting bondage.\n\nWe came here around 6pm on a Saturday and it was already kind of crowded. The only suggestion I can think of is they should print out more copies of their cocktail menu. We had to wait a minute or two to get one, and I decided to wait because I really wanted to try their house cocktails. I was really happy with the drinks! I was surprised to see that their egg white drink was around $14. I usually pay $12 at other bars, but I think the drinks here are worth the price. The bartenders are competent and the atmosphere of this bar is really rich. Even though the look of this bar is victorian and modern, it still has a laidback feel to it.\n\nThe crowd here isn't what I expected. It honestly looked like a bunch of normal people. The people here actually looked more normal here than they did at the other bars I went to later that night. I had a more interesting time people-watching at Four Barrel earlier that day than I did here. It's not a negative, but I thought it was funny. Regardless, I can't wait to come back again!", "author": "Karen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "The Armory Club is owned by Kink in case you didn't know. It is located across the street from the Armory and it's quite a popular place in the evening. There's tons of alternative portraits inside so the faint of heart should just keep moving along. Also anyone easily offended should also not go inside. It's a very cozy space and the main bar has plenty of seating. There is also a fireplace which would be great for the colder nights. There is also a second bar down the hallway. There were only a few people in there at the time.\n\nThe bartenders make great drinks. It's a work of art watching them artfully create your drink. I highly recommend the Peace Pipe as it contains a spicy concoction of Mezcal and jalapenos. Spicaaaaay. \n\nSomebody broke the lock for the unisex bathroom. Don't get any ideas...", "author": "Tim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-13", "description": "Affordable cocktails that's by a good dancing spot. I loved the amount of space, which makes it great for groups and to meet new people. They also have a space downstairs that you can rent for private parties. It does have an \"interesting\" back story, which is maybe why it's never crowded.", "author": "Laurisha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-19", "description": "Came here for a tech diversity and inclusion conference. the space is huge, well lit, and very clean!\n\nthe bathrooms are also well maintained, spacious, and accommodates many.\n\nit looks like a castle so that's a huge plus.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Love this place! The bar is a well done environment that lets you relax and enjoy your cocktails. The music was a little loud but manageable if your hanging out with friends for after work drinks. The bartenders are all great and can make a great manhattan. Will be back here for the drinks, atmosphere, and staff.", "author": "Kyle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Been here twice now and absolutely love this place! Drinks are strong, HH prices are great and it's never too crowded.", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "Decided to check this place out since we had a 75+ minute wait at Shizen. Just a 2 minute walk we thought this place would be great. It's a corner bar down mission so it's not hard to miss. As for most SF places though, parking is non-existent. \n\nWhen you walk up you can see a sign for their comedy club downstairs (not sure if it's worth checking out?).  We walked in around 7:30PM the place wasn't packed at all. We were lucky and nabbed a couch and a table. A little disappointed though that we were sitting down for around 15 minutes and nobody came to clean up the empty glasses from the previous party. \n\nI got a moscow mule and while the service at the bar was quick, my drink was darker than usual. Not sure why though. \n\nOverall: Cool place with interesting artwork on the walls and decent drinks. As other Yelpers have said, service could be better.", "author": "Keizzel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Beautiful decor and nice atmosphere to chill and enjoy your beverages. The drinks were good as well! Overall a good experience", "author": "Matthew A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Conveniently located across the street from the Armory, this is a must if you're in the area (particularly if you've just finished a tour). I've come here a couple of times while I've been in town for work and this latest time, I swung by on a Saturday night to drink with some friends after doing a workshop at the Armory. \n\nIt was crowded, but not so much that you couldn't snag a drink and find a place to stand and chat. Although we didn't have seats, we found a place near the restroom where we could set down our drinks. \n\nJust like everywhere in SF, there's no parking, but it's easy to find.", "author": "Kristel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Cool bar, spacious, and has tasty drinks. Came here before going to a show at the armory event center across the street. It was a great spot to grab a drink & hang out. Hopefully we can come back again!", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "Used to be a good cocktail bar with a cocktail menu consisting of pages and pages of fucking brilliant cocktail ideas: the kind and of place where, when I was going to head to SF for the weekend, going to the Armory Club and trying some new cocktails was one of the specific things I'd look forward to. \n\nNow their cocktail list has exactly eleven items on it, and none is particularly unusual, let alone actually original. It fits on two small pages (say, about 5\" x 7\" or so, with large type and wide kerning), with a big chunk of white space on the second. But there's maybe six dozen beers on the menu, none of which you can't get any number of other places. And the first two beers I tried to order they were out of, and the bartender tried to shove a fucking Karl Strauss at me. \n\nToo bad. They were really good at something, and they abandoned it because they're apparently on a ceaseless quest to be more middle-of-the toad and vanilla and standard. Super disappointing, especially for a kink-themed bar. \n\nI guess there's no law of physics saying kinksters can't also be profoundly boring people, but I wish a bar I used to fucking love had picked a hill to die on other than proving that particular point", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Great drinks good times \n\nCame in on a whim to kill some time and enjoyed our bar tender Tihani made it a great !", "author": "Azikiwee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-12", "description": "If you're from out of town, beware. My ID was called a fake and the staff disappeared with it for 7 minutes making snide comments instead of simply asking for another form of ID. Don't bother speaking with the manager about it either. His response was to call me entitled and that his staff was merely doing their job. However there is a fine line between distinguishing out of state IDs and being blatantly disrespectful and implying a customer is a liar. As a bartender I was pretty disappointed with the service. Save your money and go elsewhere.", "author": "Chelsea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "We had an amazing time at the Armory Club last night. Jason, the manager, helped us organize an intimate private event in the basement for our friends engagement party. The space was great, bartenders were the most friendly I've ever met in the city. They allowed us to play or own music, decorate the space, and name a few cocktails after the newly engaged couple. The drinks were fantastic and ambiance was perfect. Overall everyone at the party said they would definitely come back.", "author": "Akhila I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "This is one of my favorite bars in San Francisco it has great interior Decour and atmosphere. It has great drinks at reasonable prices for San Francisco. There are lots of unusual and interesting characters who hang out at the bar. If you're in the area I recommend stopping in.", "author": "Alexandra R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "Look, this is probably not the bar to visit with your parents or a first date. The decor and theming leave you a little exposed to the very real possibility of awkwardness. \n\nThat said - \n\n-proximity to public transit: very good. Two blocks from Bart and right outside a 14 bus stop. \n\n-happy hour is an amazing value and remarkably long in nature. 5-8pm weekdays, you can get craft cocktails for $7, wells for $4.50 and beer/wine for $3-4. That's nothing short of a steal. \n\n-have never seen them crowded on a weekday. Ample space, plenty of seating and also standing room. \n\n-high quality drinks. They use great ingredients and have great bartenders. \n\nSo you have to look at some LCDs occasionally semi-nude models doing weird stuff. It's worth it!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "I went here because our company had a party here for our app, Candid. We reserved the whole backroom and it was comfortable.\n\nIf you look around, there's some paintings of kinky sex. It wasn't NSFW, it was more softcore. I don't even know why I'm writing about this but this was what I saw lol. I think it was here because the Armory across is a allegedly a place where pornography is filmed and tours are given. I can confirm this since tickets are sold on Groupon.\n\nAnyway, our bartender was amazing! I got a couple Moscow Mules and other drinks that I don't remember, and he mixed it pretty well.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "When I came here I though Armory Club was associated with The Citadel but I was incorrect, it's actually owned by The SF Armory Club (aka BDSM Club).\n\nIf you couldn't tell, take a look at the portraits in the bar and you'll quickly realize what Armory is all about. BDSM aside, the ambiance is darkly lit and big enough for large groups. \n\nI really enjoyed my drink, 22nd Century, thought it lent more towards the sweeter side but overall good\n\nOverall Thoughts\n\nA bar that serves a glimpse into another world along with great drinks", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "We visited Thursday February 16th after a show at Public Works.\n\nThe service was terrible.\n\nWe arrive. \n\nMale bartender asks \"What do you want?\"\n\nI ask for a cocktail menu and a glass of water.\n\nHe scoffs at me as though I just asked him to turn his genitalia inside out while playing the trombone with his butt.\n\nHe gives me a menu and hands me my water with his hand over the top of the glass, touching the rim with his fingers.\n\nMy friend and I order a couple of drinks. I ask for a half pour for myself (health reasons).\n\nHe acknowledged the order.\n\nHe then ignores my request, gives me a full pour and charges me for the full amount.\n\nWe go sit by the window to enjoy our finger tainted water and the wrong order, figuring this jaded douche would throw a hissy fit if we said anything, like \"Hey, can we get actual decent service and respect here?\"\n\nI return some time later to ask for more water.\n\nAgain, he scoffs at me, acts offended, ignores me for a while, then hands me another glass, his hand completely over the rim of the glass, and says \"Here you go; extra large!\" with a nice \"f@ck you\" twist to it.\n\nI was a server for ten years. This guy is an embarrassment to the service industry.\n\nIf your idea of a good time is dealing with a man-child's passive aggressive bullsh!t and bad attitude while enjoying grimy finger water and the drink you didn't order, then this place is perfect for you!", "author": "Cyrus N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Great vibe here, love the lighting. Crowd seems a little more sophisticated than your average bar, but not uptight--good combo. Drink menu is really interesting, and the Winter Solstice is absolutely delicious! My favorite cocktail there for sure.", "author": "Lissette C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-28", "description": "They sold us pappys 15 yr for $30 (google it and notice its $50++) but it tasted like gasoline burning down your throat. Smells great but tastes rough. We suspect it's not the real deal. Confronted the bartenders about it and they gave a cutesy answer: \"it's paaaaaapular\". No. It's fake and it made me loose faith in kink.com. Fake tits should not equal fake drinks. \n\nBottom line, go elsewhere for the premium drinks, stay for the brand and cheaper pours!", "author": "Eddie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "Dropped by as part of a weekly happy hour I do with my classmates. Great place for classy drinks at a fair (if slightly high) price.\n\nHappy hour is from 5-8PM. House cocktails are $7.50, house wine is $4.50, and draft beers are $4.00.  The cocktails are deceptively strong.\n\nOutside of happy hour, house cocktails are ~$10, wine and beer are around $6. The featured cocktails looked really good, but they start around $13, which was a bit too steep for me. I mean, that's dinner! Dayum.\n\nAs for ambience, the place is classy as hell. The front room with the bar gets a bit more crowded and noisy, but my party of 4 was able to find a quiet niche in the back room. \n\nTL;DR: Good happy hour place for classy cocktails, not the cheapest, but you get good quality.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-28", "description": "I've had good times here in the past, but most recently I got screwed over buying a shot of what they called \"pappy\", but it was actually more or less Four Roses or Woodford that someone put into a pappy bottle. Repeat: literally someone filled the pappy bottle with lesser bourbon. I'm no expert, \nBut I know mid-shelf bourbon vs top shelf.\n\nBe wary of the $30 \"pappy 15\" -- In most places this would be upwards of $70 or more.", "author": "Will W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "This review is strictly for the comedy show. Came here last night and enjoyed a free night of comedy down in the dungeon of this bar. The dungeon was super cozy, filled with about 50 people ready for a night of good laughs. The stage was tiny and the comedians were standing about 3 feet away from the front row, so it's definitely an intimate experience. There's 3 rows of foldable chairs and then several booths with tables. Get there early to get the seat you want.", "author": "Lexi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Wednesday 6pm visit turned out really good. Not that many guests, attentive stuff. Nice location across the street from famous SF Armory .", "author": "Svetlana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Cocktails with a side of kink.  The bar is dark and cozy with great victorian-ish decor.  They have a great cocktail list that changes seasonally, along with an ample selection of beer and wine.  Prices are typical SF ($12/drink).  Make sure to appreciate the artwork.\n\nI rented the back room for an event and it was a very reasonable price - definitely a great option for a birthday.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "Officially overwhelmed with the fact that these days, I won't be able to recognize more than 50% of the ingredients in a signature cocktail and will just have to trust that if I like the main liquor, I should like the drink.\n\nI ordered the mezcal and jalapeno based drink here. It was perfectly spicy and smokey. \n\nI love the decor here, and the vibe, perfectly sexy. \n\nThey also have an amazing wall of whiskys... including a few Japanese ones. When I was there, they still had a bottle of Yamazaki 18 - and a very generous pour of it was only $25. I had the pleasure of having some. Well worth every penny!", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "The atmosphere is fantastic. If you did not know the backstory, you could end up thinking it was just a well staffed and popular bar. Then, you might take a closer look at the art ;). Patrons were attractive and interesting. Service was excellent", "author": "RahBurt B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "Never coming back. Dishonest staff.\n\nWe were enjoying our drinks and around 1am we wanted another round. We went to the counter and heard \"last call\", so we thought, ok, let's order the last one. The barman was more than happy to accept our $70 for 5 drinks. It took 15minutes to make those drinks and as soon as we got them and went back to our table, we're hearing \"it's closing\". Why do you accept our order if you know you're gonna close that soon? Just to take our money? Really? Never coming back again. I was a pretty regular customer but you just lost one (or should I say 5). Keep up the good attitude yeah.", "author": "Maxime V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "I recently hosted a surprise birthday party for my boyfriend in the downstairs bar at The Armory Club.  The staff was friendly and helpful, and Jason in particular helped us pull things off smoothly.  Great atmosphere!  This is a bar we've liked to visit anyway, but now has added bonus as a helpful event space.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "A bit of swank,\nA bit of kink.\n\nTalk about your juxtaposition.\n\nKink's office is on one corner.\nThe Armory on the other.\n\nThe former is, well...\nyou know.\nThe latter is...not like that.\n\nActually, the Armory is quite the refined space.  Save for certain wall art, it's way more sophisticated than you might think.  \n\nGentlemen, get out that Hugh Hefner smoking jacket you've had in your closet just waiting for the right occasion to wear it.\n\nThis is that place.\n\nGet yourself a stellar Armory Club cocktail, go to the back room, & let that smoking jacket shine.\n\nLike a peacock's plume.\n\nThe drinks are first rate.  I came in w a group of my coworkers, & we were all impressed by the level of knowledge & artistry that was behind the bar.  If you're looking for perhaps a perfect cocktail in the mission, this could be the best spot for it.  Beretta, Lolinda, or right here.\n\nI thought the staff & the crowd might be obnoxious.  Surprisingly, they weren't.  In fact, the bartender that took care of our party of 6 was downright nice.  Major props.  It was busy too.\n\nA perfect spot for drinks when you feel like walking on the more sophisticated side.\n\nOr wearing that smoking jacket & totally pulling it off.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "If this place - or staff want to enjoy themselves without customers, I think they're doing everything they can to make it possible.\nWorst bartender yelling at people on the bar, accepting late cocktails and then lying about the time he received and not letting customers enjoying them. \nI used to be a regular customer, will not come back and leave this bartender alone with his shaker.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Sexy ambiance, classic interior, and delicious gin cocktails made for a great pre-club stop.", "author": "Denise D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Sexy sexy sexy!\nAll the bar tenders are great, and the drinks are even better.\n\nAnything with the Grand Poppy Amaro is guaranteed to knock your socks off!\n\nI love the ambiance in combination with the tasty cocktails and speakeasy feel.", "author": "Hannah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "I rented out the downstairs for my birthday party, it was one of the best nights ever!! I was able to bring in my traktor DJ gear and hook in to the sound system. Jason was an excellent host and made sure everything sounded as it should. The bartender provided fast service and was very polite. The only miss was that they ran out of pilsner... but I'd say that's mostly because my friends consume an inordinate amount of beer ;)", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Came here for Halloween - how could you not be a fan of this bar?\n\nStiff and creative drinks, awesome bartenders, SF peeps being their true crazy selves, kinky decor. \n\nOnly thing that gets annoying towards the end of the night is waiting in a bathroom line running through the middle of the bar that has 20-25 people in it!!!", "author": "Yin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-09", "description": "Met N there. He was in a North Face jacket, pale skin, blue eyes under the dark rim glasses, a messenger bag across the shoulder, 6'2\", Clark Kentish, dark brown hair, like he had just finished his dissertation at some fancy pants Ivy League, and needed a drink, and perhaps an opportunity to speak to a member of the opposite sex.  I started to laugh, with my girlfriend, and said, \"Hey you want to talk to him? He beats that greasy guy by the window we had to dodge earlier.\" She sized him up and down and said, \"Maybe.\" So I smiled, did one of those finger gestured thing, he moved up, all nervous, and I said, \"This is my girlfriend.\" That was how we met. At a bar, of all places.\n\nTurned out he was from some fancy pants Ivy League school, and he was some sort of scientist, left wing, liberal, and atheist, which to me, all good qualities men should have, and  not too far out of his PhD program, in fact. A total nerd. We talked about Walking Dead that night. I liked my zombies and he liked my girlfriend. \n\nI liked this bar, it's actually my favorite bar in SF, because it's neat, classy, with the right decor, excellent wine selection (GOOD French wine), and understated but prompt service. Women here are pretty, sometimes; men, not good looking at all, mostly. It has the potential to be a great bar, something you'd see in New York City, but it lacked a certain charisma. Too many young tech crowd / artist type frequenting this place, it has a younger audience than what makes a bar great. The bar itself though, is way classier than most other popular non-hotel bars.\n\nShortly after the new year, we came here to commiserate our shared misfortune of no one to kiss on NYE. The clock strikes twelve and we are left hanging, alone, different places. Ask why two fairly accomplished individuals with every right to be kissed on NYE and not have such luck? I know why for me, and I got no answer for him. Of course at that precise discouraging moment, the bouncer, who spoke with an Irish accent, looked at us, and said, \"Happy New Year, did you guys have a good NYE?\" We bursted out laughing. \n\nOff we went inside, and promptly ordered drinks. Perhaps not everyone will find love  on NYE, or last year, or this year, but everyone should come here and get a drink. It's delicious. A year and half later since it opened, and since my last review, it's still a gem. So here is to another good year of good alcohol. May N find himself a girl, here, or elsewhere.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-14", "description": "Great drinks, great service... but who cares, we all know why we keep coming back. Sophisticated by risque, high energy but never the least bit rowdy, this is one of my favorite bars in San Francisco and a wonderful place to have your friends meet you before you head out to a party or PW or a larger event at the Armory. Pretty nice place to spend an hour or two of your night.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "I have to admit that this place is pretty damn dope!!! I came here for sake night and they had over 200 sakes to taste! After the sake tasting I got a personal tour from my sister and her co worker around the whole building and I love it!! A lot of great art work and a lot of DIFFERENT rooms! This place is so cool and it has that haunted feel to it (I'm sure it is haunted).  I for sure would come back for the haunted houses that they do here.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "BDSM themed bar. Interesting set of people, always a mix  of personalities. Everytime I've been here the bar is never really packed and it's easy to get a drink. Great open and comfy seating arrangement, it a nice classy bar with done great leather couches for making out. There are two bars- one at the entrance and one in the back in addition to a downtowns area. As for the drinks, I love that they'll use raw eggs in cocktails but otherwise the cocktails are average. The bartenders are super friendly though. The music can be hit or miss, some electronic and then sometimes pop. Prices are on the more expensive side.", "author": "Sabrina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "I had previously gone on a tour of the Armory, but this bar was just way too crowded at the time. Luckily at 8:30pm on a Friday evening, there is a good sized crowd for a relaxing time. Cocktails here are fairly strong (around $9 to $12 each) and they have many options to choose from! A+ for that. Their craft beer and wine selection is plentiful too.\n\nThere is a downstairs space (THE DUNGEON) for events. I came here to watch their FUNgeon Comedy Show, which happens one Friday per month at 9:00pm. It's free (woohoo!) but you have a chance to donate money towards the end of the show. It gets insanely crowded, so get here as close to 9:00pm as possible. The interior design of the Armory Club is nice too, even when you think about what goes on there... anyways would totally recommend this bar and come back!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "On a recent business trip to SF, we stopped in for some pre- and post- Armory Club cocktails and Loved. Every. Bit. of the AC Happy Hour!\n\nThe cocktails were hand crafted and delicious, the happy hour prices were FANTASTIC for the city, and though we didn't try it, I was totally eyeball flirting with my bar-neighbor's lovely fruit & cheese sampler. The beauty at the rear wine bar was creating those little dairy gems, and they looked amazing!\n\nThe service was what we expected at a busy city bar- a bit aloof and impatient - so give yourself time to settle in, appreciate the erotic art that adorns the walls and enjoy the craft cocktails. \n\nWe visited on a night where a singles mixer was being hosted, so this would be a great place to meet others too, and it's not for the shy or red-cheeked...so let the art be a spicy ice-breaker when chatting up a sexy bar patron! \n\nA creative menu, good people watching, tasty drinks and eye candy with a side of attitude is the perfect appetizer for the SF Armory tour. This is not your Aunt Edna's date night spot!", "author": "Kathe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "My friend had his birthday here and was able to rent a room for his party. He got the downstairs which was cool because it was separate from everyone else and had it's own bar and bartender. They also let you play whatever music you want and there is a bathroom you can use just for your group. There is also a decent amount of seating as well.\n\nThe bartender was really cool. She asked for what I wanted and I said something fruity, so she made me a grapefruit cocktail which was really good.\n\nOverall, it's a really chill bar. To have a private space was really cool too.", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-09", "description": "A bar owned by a porn company.\n\nImagine that.\n\nBetter yet, imagine a bar opened by a BDSM porn company.\n\nIf you're easily offended, you can stop reading now.\n\nI don't know about you but what came to mind was tight leather clad bartenders ready to whip if you don't tip, strappados hanging from the ceiling, spanking benches for your viewing and participation pleasure, and collar-wearing patrons on all fours.\n\nOkay, okay, so I thought Armory Club would be a Power Exchange-sque bar. Not that I've ever been to Power Exchange; for Christ sakes, I went to Catholic school.\n\nNeedless to say, Kink.com's bar, Armory Club had me intrigued. Before walking in, I said my \"Our Fathers\" and my \"Hail Marys\" and prepared myself to be ( X _ X ). To my surprise, Armory Club is unbelievably classy and sheek! The scarlet red textured walls were sensuous, the dim candle lighting was sexy, and the tasteful BDSM female bondage paintings (available for purchase) added a touch of playful naughtiness without being offensive. The spiffy dressed mixologists reminded me of a speakeasy but much swankier because of the illuminated bar area.\n\nLounge on one of their vintage sofas or chill in the back area (second bar) while sipping one of their strong artisanal cocktails...\n\nOne will make you warm and fuzzy. Two will make you giggly. Three will arouse you but please, NO hanky panky at this classy establishment.\n\nRemember what they say, guys want \"A lady in the streets but a freak in the sheets.\"\n\nHmm, I wonder if alleys count?\n\nOTHER NOTES:\n*Friendly and welcoming bartenders.\n*STRONG cocktails. Whoo hoo!\n*Cocktail Menu: http://bit.ly/Xkk79p\n*Happy Hour is 5 pm to 8 pm:\n--Draft beer: $4\n--Well cocktails: $4.50\n--House cocktails: $7 (Get the gin based \"Gently Bound\")\n*Bar snacks available. Don't get the kettlecorn. It comes in a small 8 oz. mason jar for $6!?!?\n*Back bar area is good for private parties.\n*Mixed crowd but it was a cockfest the Friday night we went.\n*One bathroom only. Boo! Very clean though.\n*Easy street parking (same block as Public Works).", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "I really shouldn't be giving the review since I don't drink.  I love this location and the atmosphere.  I will be using this place to take friends and out of town guests.  The place is great for conversation it is not creepy quiet or annoying loud which is perfect.   My friend had 2 cocktails and loved them both.  He described one as \"complex\" which I would take as a compliment", "author": "Sfclint O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "Nothing says classy quite like a tastefully painted rotund lady, seated and tied in a chair with a ball gag. Yet in the stylish and put-together Armory Club, this piece of art makes sense. And in fact I love it. \n\nIn fact there's a lot to love here, from the excellent service to the oh-so-yummy hand-crafted cocktails. I really enjoy the back bar area, seemingly out of sight from the main bar allowing for more intimate conversations or group get-togethers. There's a lot of breadth and room to the space as well, a welcome change from being crammed like a sardine in many other bars in SF.\n\nFrom all appearances you would not know of the connection to the kinky porn studio right across the street, other than the well disguised decorations here and there. And that's the fun of the Armory Club...elegance with a touch of naughty.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "Swanky, dark interior. Lush even, and a bit kinky due to the BDSM pics on the wall. All done tastefully of course.\n\nI never drink cocktails here although I've read that they're good. I usually just drink whiskey. Getting a drink, ordering one, waiting for one has never been an issue for me. Staff has always been super nice. Bathrooms are upstairs AND downstairs. The 2 upstairs are unisex and tend to have lines. Go downstairs! \n\nProps to the lesbian party last thursday in the downstairs. That 90's r&b hip hop was off the hook and had me dancing nonstop", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Trendy bar with some excellent choices for brews. Trannys are actually kind of strangely attractive to a straight male like me . I can see later in the night the crowd is diverse as can be and cool. If your a Trump lover then I would suggest you don't come in here if you wanna live.", "author": "Kim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Love the happy hour here. Came here before the tour at the armory and loved the drinks so much that came back the very next day. It has beautiful ambience and the bartenders are friendly. I'd take away one star because the menu stated kettle chips as a snack and the bartender gave us a bag of chips. Could've just given us a bowl to share!", "author": "Ashmita V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-31", "description": "Worst venue I've ever seen. When you walk away from a show thinking about how long you waited in line to piss, you know that's an awful venue.", "author": "Justan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "Man - Hi there, how are you doing?\nWoman- Hi, I'm good\n\nMan - What color are my eyes?\nWoman- Umm green...\n\nMan - It's okay, *holds her hand, shaking* I'll give you a minute to recover\nWoman- huh?\n\nMan - Now that you've already had your first orgasm, would you like me to give you another?\nWoman- *Smack* *throws drink in his face*\n\nOk, so it didn't quite go this way!! But this was the \"pick-up line\" that my honey gave me. I couldn't stop laughing, since he came up with it on a fly.\n\nI ask my honey every now and then, what \"pick-up line\" would you use for me. He teases me and comes up with the funniest lines. Then he tells me, he would never find me in a bar, since I don't drink. He has a good point. \n\nHis \"pick-up line\" would probably work in this place, since the paintings on the walls contain BDSM ladies. The décor is a modern feel with dark colors. They also have couches near the fireplace, but don't get any kinky ideas. Towards the back is the \"Red Room\", which I'm guessing is a private room only.\n\nThe bar area is well stocked and inviting. During happy hour the drinks are very reasonable. Definitely a place to check out before heading home for the night. \n\nYou never know you might get lucky and meet someone, in which you can use the \"pick-up line\", without getting a smack on the face. *wink wink*", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Stopped in while waiting for Burma Love reso. Drinks are reasonably priced and tasty. Decor is interesting.", "author": "B A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Probably one of our favorite places in SF. Great vibe and decor. The bartenders are some of the best - we were there as tourists for the weekend and they remembered our orders the second time in. Lots of fun and lots of good memories. \n\nI'd check out the backroom if you can. On a good night you'll have it to yourself.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "This....was an interesting choice. I get lazy sometimes and don't scan reviews as thoroughly as I should. I was looking for a chill bar somewhere on the border of the mission with a bit of a schmancy vibe because I am high maintenance. \n\nSo I came in expecting to have some well-crafted cocktails...which it did have. \nI expected a nicely lit, classy establishment with comfortable leather seating and a lot of mahogany...because mahogany is class, naturally. And the Armory Club flows with mahoganistic, leather-bound class. Walls with shades of gray and red envelop a great drinking environment.\n\nWhat I did not expect were the slightly ... risque drinks. \nThe subtle hints of well, kink. \nThe not-so subtle hints of kink. \n\nIt definitely made for some interesting conversation and I think if you come with the right people you'll be able to laugh at it and maybe if you come with the right-right people you can get a few shades of gray.", "author": "Jonathan Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-18", "description": "Me and my friends decided that after a night of dancing we wanted to hit a bar that's close. I had never been here before and was super interested because well its the armory. \n\nThe interior design is great, absolutely beautiful.\n This being said after you've had a thorough look and drank it all in (visually).... turn around and walk out. Then head to another bar. The customer service at the armory is very cold, inhospitable. To bolster my point there were four(4) people. Already served and not needing help. The bartender seem like they hate making money. And I feel I left to big a tip for the service provided or lack of. \nThe only reason they get stars is cause the decor.", "author": "Ari T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "This is a pretty cool bar across the street from the Kink factory. The cocktail I ordered (22nd century) was very reminiscent of a la Paloma. They have a few BDSM works on the walls and there's a red room in the back that I believe you can reserve for parties.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "A classy, sexy swingin place for kinks to congregate.  Great for ppl watching, meeting like minded folks, and having a sexy drink before or after visiting the armory.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "Situation\n- Friday night drinks with a couple of friends\n\nPros\n- The interior is very nicely done\n- The bartenders were attentive\n- The drinks are priced fairly\n\nCons\n- It would be nice if there were more places to set drinks", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-16", "description": "I've been here before and I came back a second time b/c the first was awesome...\n\nThe bartender wasn't attentive and the place was half full.  Next, my drink was diluted.  \n\nWill I come back, unlikely/", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-15", "description": "I loved \"the farmer's daughter\" cocktail! \n\nThe place looks pretty classy with warm interiors and lighting. The bar tenders seemed a little overwhelmed once the people started coming in and the place started buzzing with activity; it took me a good 10-15 minutes to get their attention. I asked for the cocktail menu, and yes, the \"farmer's daughter\" was a cocktail that was right up my alley. I thought it was awesome for this pink-cocktail drinking manly man!\n\nNext up, I didn't want to wait for the cocktail menu to reappear so I just asked for a \"fruity cocktail that was on the sweet side\". I don't know what it was but it was mighty fine! I remember \"apricot\" being mentioned, getting hit by the buzz halfway through the drink, and coming to the conclusion, yet again, that I am indeed a cheap drunk! Yay for the 401K!\n\nThe girl bartender knew how to pronounce my long ass full name and that made her super-awesome in my eyes! Not to mention that she was super-easy on the eyes too. Yay! \n*Hic*", "author": "Umesh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Well, tie me up and tie me down, folks.  I don't know what I had actually expected (perhaps something a little more risqué or shockingly BDSM-ish???), but what I found on a Saturday night with a friend was a very well-run and classy establishment.  The cocktails were inventive and tasty.  The crowd is actually attractive and well put together.  \n\nThe bartenders are ABSOLUTELY wonderful.  My friend and I really enjoyed the vibe and the drinks.\n\nOf course, there are portraits on the wall that are quite provocative...and you'll have to check them out, as I feel that's what lies underneath the quietly reserved exterior...\n\nI will definitely be back because I'm curious...", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-22", "description": "The Armory Club. It's pretty popular! I'd seen it whilst walking the mean streets of SF and had desired to infiltrate its bowels for several months. The other day, I finally had my chance.\n\nDespite being such a popular place, the noise level wasn't terrible, and it wasn't too hard to talk to the person standing next to me. The bartender was super chill too! As an apology for waiting a long time for drinks when we first walked in, we got a couple of free drinks later that night...!\n\nI know they're really popular for their cocktails (which everyone else in my party seemed to quite enjoy), but this message is for the beer drinkers: They have a great beer selection on tap (try the Armory XPA (Is this beer brewed for The Armory Club by Deschutes? Or does The Armory Club just choose to stock it 'cause of the name?)and the La Chouffe beer (a Belgian strong ale!), but even better is their menu! Check out what they have in bottles.\n\nI love the decor and ambiance. I stared at the wallpaper so much that I started seeing patterns and coming up with stories from my drunken hallucinations. There's a room in the back that's got pretty comfy seats.\n\nA warning for the weak of bladder, though! There is only one unisex restroom in the entire venue.\n\nAt any rate, The Armory Club is quite chill. Stop on by for a staple of San Francisco nightlife.", "author": "Jade V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "I like this bar place because of its history and uniqueness that comes with the ambiance as well as its well-being in the Mission.\n\nThis bar may be offensive for some and for others, it may be entertaining.  \n\nThe decor is pretty nice - like a speakeasy vibe to it.  Drinks are reasonably priced (10 bucks more or less) and the layout is small with a downstairs' lounge as well.\n\nDefinitely a place to check out, if you haven't been!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Super fun place to hang out with some great cocktails before the mad rush of 10pm+! A few girlfriends and I stopped by here after dinner this past weekend for a cocktail and enjoyed the atmosphere prior to the onslaught of people who were kicking their night off.  I had a delicious grapefruit cocktail that proved to be a bigger bad ass than myself.  Overall, this was a great place to hang out and definitely a place I'd love to come back to for a casual drink!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "You can have fun here if you are with the right people to lift the mood around. The big outdoor area is a plus. Bar and food is good, music also, but the tall sits are uncomfortable after a while. Good place to spend your evening if you are looking to put some spice to the sunday.", "author": "Alice R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Classy modern cocktail bar owned by Kink.com (located in the Armory building across the street), this place makes for a thematic stop-off following the 6pm tour of Kink.com. Check it out, either way!", "author": "Jake G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "I visited this place with my brother for some after dinner drinks.  Little did we know it was going to be so crowded at 7pm on a weeknight.  Of course, we were both oblivious to the fact that it was currently happy hour. After finding that out that we had 1 more \"happy\" hour left, that certainly made us quite.....um, happy!\n\nNOTE:  Please visit www.armoryclub.com for complete details regarding location, hours of operation, and upcoming events.  Happy Hour is Tuesday thru Friday, 5 to 8pm.\n\nInitially after receiving our drinks ($5 well drinks), we were resorted to standing since there wasn't an empty seat at the bar, at the bar stools near the window, or in the sitting areas either.  The rear area was closed off for a private function as well, which may have contributed to the large mass of folks congregating in our immediate area.\n\nThankfully, the crowd thinned out past 8pm and seats readily became available.  Afterwards, I took a better look (or tried to anyway) at my surroundings.  I found that I truly liked the atmosphere and the decor of the bar.  There's a sexiness (as others have mentioned) about it honestly.\n\nBottom Line:  Cool bar.  Decent happy hour.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Mezcal cocktails galore and I hand out 5-star reviews just like that.", "author": "Dejana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-28", "description": "It's ok. Not a great selection of beer. The décor is weird but the name of the place suggests that. I probably won't make a special trip just to go.", "author": "William H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "My first time giving a review.. And the armory club deserves it! Good music, nice cocktails and fantastic atmosphere!!! Also got amazed by the bdsm culture! Love sf!!!", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Booked a table here and had a blast with my friends. Very good service and alcohol. And the atmosphere is awesome! So is the music! Definitely gonna come back again!", "author": "Darren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "Where my debauchery night began! *happy birthday to me* A lot of fun in the Red Room and the cocktails were tasty!", "author": "Anne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "Even nicer.\n\nTwo years later the cocktails are still excellent, still less than $10 and the place is still run by exceptionally talented and friendly bartenders like Zachary.\n\nBased on our visit this week you can drop in for a weeknight drink and have almost the entire intimate and alluring place to yourself. That's nice too.\n\nWhat has changed is the rating. This is a five star bar.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "Great vibe here - dark and sexy. Sultry, even. I loved the wallpaper - an intricate repeating pattern of peacock feathers, and the ceiling - molded tin with a bronze hue. There are beautifully painted bondage scenes on the walls as well, all hung on ornate gilded frames. There's lots of seating between the leather topped barstools along the bar and windows and the lush leather armchairs and couches gathered around the fake fireplace. \n\nWe sat on those barstools by the windows and there was a bar top there where we could put down our drinks. I loved that the edges of the wood that made up this bar top wasn't cut at straight, ninety degree angles but kept the original curvature and breaks in the wood. It gave it a very natural yet classy vibe. \n\nI'm always intrigued by the framed flatscreen TVs that show a live feed of the production rooms in the kink.com Armory across the intersection - of course I'll always be there after work hours, so will i ever get to see them filming anything?\n\nThey have *three* full pages of signature cocktails. This allowed my friends and I to each get something completely different that's conducive to our tastes. When we got our round and all took a sip, every one of us immediately said, \"I love my drink.\" Of course, when we swapped and tried each other's it was a different story. But that's the beauty in the diversity of cocktail-making.\n\n* Black Beard Punch - 4 stars\n(Mount gay black marker, guava, passion, pineapple, Elizabeth all spice dram, kraken, rocks. $9)\nMy drink, and I love a good refreshingly sweet cocktail. It's like an amazing guava juice, and you can even taste the texture of the fruit in there - I love that part. As I progressed through the drink, I could taste the rum more and more - but it's good rum and blends smoothly into these fruit flavors. Of course, a friend who likes his strong Bourbons hated this but it was the perfect drink for me. \n\n* Gently Bound - 4 stars\n(City of london dry gin, creme yvette, rhubarb bitters, lemon, sparkling wine. $9)\nA carbonated drink that the rest of us really disliked - it tasted very strongly of maraschino cherry, almost like medicine. But hey, there's a reason we didn't order it, and our friend seemed to really like it. \n\n* Blushing Bee - 4 stars\n(Mt casa reposado tequila, maurin quina, velvet falernum, lime, orange citrate, lavendar bitters. $12)\nMy bf's drink - he describes this as having herbal flavors, boozy, kind of tangy, and refreshing. I found the tequila to be quite strong in this drink, but despite that the flavors surrounding it came together well. \n\nPersonal note: the other drink I was eyeing was the Henriette (with ginger beer and grapefruit bitters) - must try this next time!", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "Sexy, Dark, Mysterious and SO my style. \n\nLove the 5-8pm happy hour. \n\nDo some research and see who opened this bar. I'm sure you can see why it's drawing so many curious like minded people.\n\nI'm actually heading there now.", "author": "Lily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "Kink.com has a bar?!  ;-)\n\nDon't worry, the owner presents a more restrained, classy environment reminiscent of the Victorian era: tin ceilings, luxe leather couches and damask wall paper. The amber lit bar is the center of attention with the smartly dressed bartenders quickly moving to get your drinks made. \n\nI'm a novice to this bar, so I thought I'd start with the \"Gently bound\", a delicious mixture of gin, creme Yvette and lemon juice topped with champagne. I was slowly sipping this cocktail when I noticed the very erotic art displayed on the walls. (read:leather + chains)  A very naughty ambiance and I'm grateful that the night was hipster free! \n\nIf the mood feels more dark and scary, try the Zombie Princess with Appleton white rum, velvet falernum and pomegranate. The burgundy color is beautiful! \n\nThis part of the Mission was in desperate need of a sexy drinking den like this. Excuse me while I get my kink, I mean, drink on.\n\nLaters, baby.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "Came here on a rainy weekend, and liked it immediately because of the lack of line...with a decent interior and atmosphere. The bouncer was cool and chatted with us a bit before we went in, which I always like. =)\n\nInside...I was kinda told it would be a bit BDSM so I was prepared, but it's really not too bad. I swear, since the 50 shades crap, people have been (not so) secretly obsessed with that. Its a lifestyle people...deal with it. We're in San Francisco! I've seen worse on the bus at 7AM in the morning.\n\nThe drinks are a good price, and overall pretty good. I found nothing that I disliked. \n\nService...was ok. Initially, they took forever to notice us, but I guess we weren't standing in a noticeable corner? But I always think bartenders should man the entire bar, including the corner. Sad face. After we got our first drinks though, our bartender was great at acknowledging us. She's awesome.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "We stopped here after the tour of the armory. Might as well go full circle by getting a drink after the tour. If you bring over your comment card, you can get happy hour specials all night. Wait until you finish the tour to head over here.\n\nThe interior is dark and the drinks are super strong. I swear even for a happy hour well drink, the bartender must've poured at least half of the vodka into my glass. I had to wait until the ice melted before drinking my vodka cranberry. My friend had to wait as well since we're both lightweights. Drinks are a bit on the pricey side if you get a special cocktail but they do put a lot of alcohol in them so you'll get your money's worth.\n\nSince it was a Sunday night, it wasn't terribly busy. The music was good and the atmosphere seemed pretty mellow when we stopped here. It probably varies depending on the night, but I would definitely stop in here again. \n\nThe crowd seemed pretty friendly as well.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-12", "description": "The gf suggested we try this new place and I'm always up to try something different. Not on the main strip of mission, so it's a little quieter than normal. They have a main room and a smaller back room both with bars. The setup is dimly lit with comfy chairs and couches and the walls are decorated with some interesting artwork that includes LCD TV's that show the various rooms in the Armory Studio. They have a pretty good selection of drinks and several whiskey choices which is a plus in my book. They also offer 'signature' cocktails that seems to be the norm these days in bars. I don't care for it but the hipsters like it and if it makes them feel cool, then go for it. I'll stick with my whiskey....", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-30", "description": "I went into the Armory Bar after the Haunted House tour at the kink.com studio. The bar is gorgeous inside. I love the look of the decor and the selection of alcohol looked great. It's a nice space and a good crowd. \n     With that said, on the night that my friends and I went. Which was Oct. 27th after our tour, we stopped in for a drink with our drink tokens. The bar was not crazy busy but there were enough people there to have a line waiting. The issue was not waiting in the line, my issue was with the bartender. I never got her name but she was the blonde and that night had mouse ears on.  She was so rude to everyone in my party. She never smiled or said thank you. She was very short with us. When I went to let her know that we had drink tokens from the tour she sharply responded with \"I can see that.\"  My friend found a bug in his drink and when he brought it to her attention she didn't say anything. Just grabbed his drink threw it away and made another. Another friend went to the other side of the bar and waited in line rather than deal with this rude bartender. He never got served. While waiting in line. (1 person ahead of him) the person behind my friend pushed his way up to the bar and started talking to that bartender. They seemed very friendly and had a conversation. That guy got served before my friend and the guy in front of him. \n    I won't be going back there which is too bad. I really like the space but I hate horrible customer service.", "author": "Mr M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-23", "description": "I am giving this two stars. I feel bad because the place is cool and the bartenders are nice but the cocktails are not very good, and are the same price as any of the high end cocktail bars. If you're looking for a bar to get a good drink and aren't into the BDSM thing I don't really recommend it unless you just want to do something weird.", "author": "Geoff G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-06", "description": "I usually put more into my reviews but for now I'll just sum up my thoughts:\n\nPretentious, overpriced and in a way comical, if you have high expectations, you will be let down", "author": "Jonah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "A sophisticated and upscale bar that will let you unwind and enjoy a nice night with good friends.\n\nFantastic ambiance: hardwood flowers, copper tin tiles on the ceiling, beautiful dim lighting and a great crowd. It was pretty mellow around 9:30p on a Friday night, although by 11p the place was crowded and got a bit noisy. The place was still quite pleasant to be in and you still didn't really have to shout to have a conversation. The acoustics are somehow very fitting.\n\nThe staff is very professional and is able to serve you quickly, despite a possible large crowd.  There are also seating area's with, what looks to be incredible comfortable leather sofas. Those seats were taken for the while that I was there and I'm not too surprised: they looked incredibly comfortable.\n\nGood selection of cocktails and micro-brews with an intimate and seductive atmosphere. The drinks, although expensive are strong and well-crafted. Fantastic place.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Great cocktails and ambience. It was a great place start off the evening before heading to our dinner reservation at commonwealth", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "My wife has rented out the back room of this place for my birthday party two years in a row and it has been a blast. Great selection of liquor and beer, friendly staff, and classy and clean place. Jason the manager has been fantastic about making sure our group has fun and everything we need be it having the fireplace lit or specialty beers from the front bar. Highly recommend for parties or just to pop in for a drink.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Like everyone has mentioned, an intimate and sexy bar that was opened by a porn company across the street.\n\nThe owner likes to expand his horizons! What can he say?!?\n\nThis intimate space has great detailed decor from the embellished ceiling to the porn bondage influenced portraits hung around the bar.  There is a fireplace on the side with a few couches, which makes the atmosphere super relaxing and comfortable to chat with friends.  You also have your bar seating and high stools along the windows.  I enjoyed my Gaw-ski with coffee bitters and eventually my red sour ale beer.  \n\nI loved this place and better yet, it has ample of space to not feel suffocated in.  I wouldn't mind living by a bar like this to frequent!", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-16", "description": "BFF and I started our night here. Kinda wish we didn't. Plenty of parking and the location isn't that shady considering it's in the Mission.\n\nOrdered drinks from a brunette w/ short hair. She was a b*tch. Stood in her face and was waiting to order but she steadfastly refused eye contact although she was stretching and looking around. After I raised my hand, she was like, \"I saw you.\" Well shoot, then serve me! Not sure if this is intentional or not but she watered down our drinks. Not cool.\n\nTip - be sure to have a bathroom buddy guarding the door when you're using the bathroom cuz that thing will not lock even though you shove the push pin til it can't be shoved anymore.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "The most condescending bartender I've ever come across...the bottle blonde. Will not be coming back.", "author": "Tim O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-14", "description": "The bartender sucks at his job and acted stressed out about the 10 customers he had. No kalua and they were out of red bull. The bar back spend more time bending over than helping me", "author": "Colton L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "Went there for a friend's birthday so had a private bar downstairs. With that said, the place felt very clean, which is my biggest thing in mission, and it was perfect for whiskey cocktails :)", "author": "Suprita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Visited with hubs after the tour of the Armory itself. The bar was classy and decorated beautifully. The only giveaway that this bar is affiliated with kink (besides the name), is the tv screens that show images (no nudity that I saw) from the Armory and the kink.com sets. \nThe bartenders were very nice and made what my husband called a \"fantastic\" martini. This is high praise from my martini snob spouse. There appeared to be a back room, but I didn't venture into it.", "author": "Ashleigh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "Provocative loungey bar located across the SF Armory... looks exactly like you think it would inside. I know this isn't everyone's scene, but it's worth a look. Bondage-y art pieces and surveillance footage from inside the SF Armory is hung up on the walls. There are loungey couches in the main and back room, which is nice to cuddle on with your friends because you'll be waiting for your drink for quite a while! Service is slow, but it's because the bartenders are actually taking time to make good cocktails. Just be patient and soak up the scene.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "While waiting for the Armory in Hell tour - stopped by for drinks. Got lucky for my party of 5 and got the booth in the back corner. Had a vodka tonic that decently made. Can't complain. Service was actually able to attend to us a couple of times during our hour there. Great decor, nice ambiance. Only one unisex bathroom?", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "My friend and I were scrambling for a last minute venue for a joint birthday party. Being fantastic procrastinators and self-admitted poor planners, we didn't start to make any plans until the week of. And that, we thought, would make it impossible to find any place at all.\n\nWe called the Armory club because we had heard that there was a basement room that could be rented out, so, sight unseen, we rented the space, and I'm so glad we did.\n\nJason is responsible for making my birthday a few extra levels of awesome than it would have been, going way, way above and beyond the call of duty.\n\nOn short notice, we were also (inexplicably) able to get DJ Purple, the best karaoke DJ in the Bay Area, to play our event. He was discussing the setup options with Jason before the party, and Jason offhandedly mentioned that they had built a stage for some special Kink events they hold there, and Purple got super excited.\n\nLong story short - he rounded up help from the staff and we went across the street into the kinky castle, rolled the stage through porn sets, down the sidewalk, carried it down to the basement and set it up - without it, the room would have been WAY less amazing.\n\nJason also stayed as a bartender for us, as he couldn't find staff for the event. Super stand up move in a pinch that really made the night go off right.\n\nWe had 70+ folks in the room for karaoke, and it was hands down the best birthday party I've ever had thanks to Jason and DJ Purple :)", "author": "Matt H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-07", "description": "Reasonably well-decorated, dark interiors, paired with way too much hype. \n\nThis place is overrun with hipsters and \"Lookie Losers\" peeking into the world of kink, which I really shouldn't hold against it -- it's not a crime for a bar to be popular. But it does suck that, on weekends, it's a tough time finding a place to sit, let alone order a drink.\n\nThankfully, I met one of the managers on a gay hookup website and he provided free drinks during one of my rare visits. Having said that, this is not a place I hit up with any regularity.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-03", "description": "Ok. Granted I came here on a Saturday evening but still there were soooo many people that it was difficult to move in here without it feeling like a grown-up frat party. So of course when it was time to order a drink after waiting in line for like 45 minutes, I told the bartender that I wanted an AMF. He was sassy borderline rude when he snapped that they \"don't do 'frat boy' drinks\" and that they \"only serve artisanal drinks, please refer to our menu\" before taking the orders of 3 people next to me. \n\nThat was when I decided that I could do better at a less pretentious, less fratty joint with fratboy drinks.", "author": "Radhika P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "I love this place! There was a short line but not bad, maybe 10 mins. The bouncer was a dear, and now many bouncers can you say that about?\n\nThe cocktails are amazing! I got the Germain to Boot, which is like pink and girly but so good that all the guys got it too. Also tried something Bee, also yummy, and something with tequila that was like pure tequila wow. Think the bartender was trying to get me drunk, for my benefit or the guy buying me the drink, who knows.\n\nI was told it's the bar for the s&m studio across the street but I didn't get the vibe beside the photos on the wall.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-23", "description": "I have been here twice now and while I love the location and decor the bartenders are extremely slow. I came in on a Thursday night and the bar was busy but not to crazy and with three bartenders I after waiting 20 mins for a drink I left. Same thing happened last October as well. The cocktail look good wish I was able to get one. After two tries a year apart I give up", "author": "Jerry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "This place is famous for being attached to the Armory where they film porn for Kink.com, but they really know how to run a business by associating the two just enough to create intrigue without ever crossing the line in the bar itself that could drive away customers or make people feel awkward or uncomfortable. There is nothing pornographic in the Armory Club other than a few artistic nods to Kink, a couple paintings of women in bondage and a framed tv screen that shows always empty porn sets (but you wouldn't even know what they were if you just walked in completely ignorant of Kink).\n\nAll in all the Armory Club is, i think, exactly what it sets out to be: a classy (though a little gaudy), darkly and twistedly sexy with a hint of artsy. And the pricy drinks are completely worth it. The cocktails are some of the most creative and tasty I've ever had. \n\nThe Mission is mostly known for its dive bars, that are dingy, dirty, cramped and crowded. The Armory Club is fun, clean, fancy and spacious. The service is great, honestly they really take the time to listen to your order and get it right. I even had a guy walk me to an alternate bathroom that no one knew about and I never even asked, he just started telling people about it. No one will ever mention porn or anything like that, but you'll probably be talking about it which just ends up being a fun conversation starter.\n\nAlso check out the awesome back area if you ever get a chance, there's a smaller bar there, a couple couches and a table with a booth. Its often reserved for people, but sometimes its open to everyone. It would be cool to reserve a party back there sometime.", "author": "Dexter H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-15", "description": "Service is awful, there is only 1 bartender. And she was rude, people cut the line. AVOID THIS PLACE.", "author": "Bank S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "Decent... Bar tenders kind of ignored us.. Went to close out. All fine... Got to dinner , they failed to give me my card back. Not a huge issue, but can't understand how you close someone out yet keep their card.... I didn't feel hip enough. \n\nLet's rock this product", "author": "E L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "Second visit, second review, wowed for a second time. The first visit was very much of a surprise because I didnt know how much of a different type of bar this one was (speaking of the art hanging on the walls). This second time was equally amazing and again, loved the drinks.\n\nThis time we made it part of our super amazing experience of visiting the Armory and doing the night tour. Right after the tour and after being amazed by some of the art featured at the Armory studios we crossed the street and came for drinks and just hang out at the club (how convenient! you can do the tour and then just catch up with some drinks and recap your tour experience without going too far). \n\nAgain, we had some of the fancy cocktails (fancy in name and ingredients but very affordable). On a thursday, it was very chill and not as crowded and we were able to actually sit down and enjoy our tasty cocktails. This place is all about the group of people you come with, I dont expect everyone to appreciate the art or connection of this place to the Armory across the street, but if you go with people that are open minded and can appreciate it you would have a great time (for some people some of the images can be disturbing even though they are not that intense).\n\nThis bar reminds me to bars in NYC, very red, very sexy, very lounge feeling. Indeed, this is one of the bars with the best cocktails in the entire city.", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Opps as a kind reviewer pointed out to me, my review below is for SF ARMORY not the bar (which I've been before as well).  \n\nI love the bar it's got an erotic sultry atmosphere, and the walls are donned with seductive art. It can be a fun date spot.", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Finally dropped in, but was unhappy to not see better dressed patrons. Its sad that people do not dress for the occasion as this is a damn find cocktail lounge with top notch bartenders. \n\nBest: cocktails, location, bartenders, couch by the fireplace, window chairs and sultry ambiance\n\nNot so Beast: location, Friday & Saturday nights, loose dress code", "author": "Jai D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-07", "description": "Wow what an obnoxious place. If your into Flour and Water, Trick dog and the other new \"Marina in the Mission\" places, you may like this place. Unhelpful and uppity staff combined with a kitsch porn theme (yes I know kink.com) does not make this bar cool.\n\nNow for the story: We came into the bar basically at last call (11:30pm on a Sunday), which can be understandably overwhelming for the bar staff. But, instead of being professionals, the bar staff and bouncer where rude and prejudicial. We where profiled most likely because we weren't \"fancy\" enough. Two nights before, I came after my wedding rehearsal dinner and it was a completely different experience. So I came again with my out of town friends from the wedding, what a mistake. If the employees here knew how to do their jobs, they would not let us in for a last drink and then constantly harass us to leave. KEEP IT SIMPLE and say your bar is closed, don't begrudgingly take our money and then hound us to leave. \n\nSo I guess the lesson is to arrive at this spot well before closing hour in expensive clothes. By the way, you ruined your business for the only guy in the bar who lives and grew up in the neighborhood. THIS IS NOT A LOCALS SPOT!!", "author": "Zachary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "This has been one of my favorite bars since it opened, with it's fantastic cocktails, cool laid back vibe, and beautiful marble bar with great lighting.  Everyone looks good and feels cool in this bar, and it's in a great location to boot.  \n\nThat's why we decided to have our Halloween party here.  We rented the back room and basement for a private shindig and were impressed by the professionalism of the staff beforehand when planning our event, and the responsiveness during the event.  Jason and his team were extremely helpful and pushed me to create an even better party than I had planned.  We went over the cocktail menu beforehand so we could batch my selections for quick service, and renamed it to reflect the Halloween festivities.  He met us early the day of so we could decorate, and had all the equipment for any music set up, DJ included.  During the party, if anything could be tweaked (it's dancing time, can we hit the lights?) I just grabbed Jason who was working on-site and he immediately accommodated my neuroses.  ;)  \n\nCouldn't have asked for a better bar to throw my party.  This is a great addition to the neighborhood and I highly recommend for any occasion.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "great bar in the mission. good drinks, quick service, upscale.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "We stopped here before our tour of the armory. The place opens at 5, but door didn't open until at least 10 minutes after. The female bartender was very sweet and said it would be a few minutes while the drawers were prepared. She made sure everyone had fresh waters and in 5 minutes I had a fresh beer in my hand. \nThe place is beautiful and well thought out. It is quaint and you can actually hear the person next to you. The beer selection was wonderful and included a few dark options (my fav). The only downside to this place is that they dont have any food. It would be nice to have some tapas to share as all they have now are bagged chips and peanuts. None-the-less, I will definitely be back.", "author": "Graciela D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-21", "description": "I don't tend to party in the Mission anymore.  This was actually my first visit, the reviews looked good and the interior cute from the pictures posted here.  My friend and i arrived early for the get together. \nIt was crowded but not bad when we arrived a little after 8pm.  The bar looked really cool i liked the lit up bar, but don't try to impress me with this, show me your vodkas! No Stoli.  hmph.    The drink list looked impressive, the names were cutesy but nothing i havent seen at bars in the East Bay.  It took a good amount of time to get a drink from the bartenders. meh.  my pet peeve. No reflection of poor service, just so many damn people! \n\nThe crowd was eclectic, not your usual 'hipster' Mission crowd.  \n\nOver all, it was a nice venue and I'd come back with a small group again.", "author": ".Vanessa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "Can kinky be classy? \n\nYes, it can!\n\nLocated across the street from kink.com's fortress of porn, The Armory, the bar is classy smoking lounge meets modern cocktail bar. It is located in a part of the city where cocktail lounges are few and far between.  The space is divided between couches collected around a warm fire place to a full length bar with plenty of seats.  The kinkiest thing about this place is the art on the wall.  There are framed TV screens around the bar and the picture rotate between different sets from across the street.  I don't know if there is any live feed, but it may be a fun place to check out the next Ultimate Surrender Match Up.\n\nThe bar is clean well lit and  and a generally awesome place to hang out.  I look forward to coming back!", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Fun bar! I came here for a friend's surprise engagement party on a Friday, we technically weren't allowed to rent out the entire backroom but because our group was large no one else ventured to the back so we had our own space which was perfect! The vibe of the bar is fun and eclectic (think penis paintings on the wall, but classy, if that's possible haha). The drinks were all really good and the bartenders were SO friendly, it can be pretty hard to find nice, non-pretentious bartenders in the mission. I would definitely go back!", "author": "Lizzy U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "I recently planned a birthday party for my wife and about 20 friends at Armory Club. \n\nJason (manager) was professional throughout the planning process and created a great experience for our group. \n\nWe got 2 bottles of champagne and couches near the fireplace. The venue was edgy, cool, and busy without trying too hard or being too crowded.\n\nI'll definitely be back!", "author": "Eric W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "Had a few drinks after supporting a friend in a wresting event across the street.\n\nThe bartenders at Armory are friendly folks. They make good drinks. The prices are on par with what you'd expect in da city. I'd drink here anytime I'm in the area. A huge plus is it's right on the muni line. No excuse to not take public transpo if you've had a few too many. \n\nGood place, good times.", "author": "W.Lawrence D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Cozy sand classy. Good drinks. Only complaint is the patrons. Some major entitleness is seeping into the mission. My dear friend reserved the couches and the fireplace seats next to the main bar (which was indicated by a big enough sign). Normal people with manners would read a sign like that one and respect it. But not the idiots that we had next to our group. The blonde female scoffed the 3times I told her she had to move, her black friend told me not to worry about it, and the idiot white fella looking at his phone dissed our request for him to move. I don't understand how people can act that way. I can only imagine riffraff behaves that rude, and they all looked and acted the part.", "author": "Pony R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Swanky Kink with a side of vanilla. \n\nA lovely bar with a great back room for meetups", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-26", "description": "ZERO STAR...!\nI was IGNORED by the bar staff. I stand at the bar for good 20 minutes without any welcoming look or any coaster in front of me that shows I am in, of course I left the place without having any drinks after twenty minutes. VERY SNOBBY BAR STAFF... \nI am just asking, does it take 4 minutes  to make one drink for a bar tender in the bar like Armory?\nNEVER AGAIN...", "author": "Rahi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "I want to go back to San Francisco to spend a whole evening at The Armory Club. It's chock full of people watching gold, plus amazing cocktails and really cool decor, including artsy bondage photos. Also, awesome bathroom that could double as a ritzy Airbnb. \n\nWe spent 15 minutes here waiting to enter the Armory tour across the street. Great idea to have a bar across the street, since there is a lot of waiting to do for that tour if you ever go. \n\nIt's hipster-meets-Mumford-&-Sons-meets-steampunk and maybe that all means the same thing, I don't know. There's copper and cogs and tin ceiling tiles and gorgeous wallpaper: May I have another, sir?", "author": "Ana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "My first thought upon walking in was \"why haven't I been here before?\"  I went in for a quick pre-show drink and was impressed by the awesome cocktail list and sleek speakeasy-ish decor.  Seems like it would be a great date spot.\n\nI only had 20 minutes to spend here and can't speak to what the experience is like when the bar is packed, but I'll definitely come back to find out.\n\nBonus points for the guy walking around with 4505 meat samples.  Yum!", "author": "Sonia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "I just have to say...aside from the paintings of fleshy (or sometimes leather-clad) gagged & bound individuals, there is nothing particularly S&M about The Armory Club. Sure, it's the brainchild of Kink.Com, & I guess that fact alone make this bar intriguing & a bit taboo, but where are the bartenders in corsets? Where was the bouncer who paddles you as your \"entrance fee?\" Where were the sexy boys & girls with chains & whips, threatening to punish patrons mercilessly if they didn't drink fast enough? \n\nI wanted more kink. \n\nI wanted there to be more than one bathroom. (Ree-dick [note the spelling! That wasn't a typo!] in a place this size where people are imbibing to only have one bathroom.) \n\nAnd I wanted there to be more cushy, comfy couches or places to perch. \n\nThe upside: drinks were reasonably priced & pretty strong. $9 each, I tried: \n-- zombie princess: white rum, velvet falernum (an almondy syrup), creole bitters, pomegranate, lime. Super strong alcohol taste despite the pretty pink color! So deceptive! I had to keep licking the sugared rim to cut through the taste. \n-- wake up call: bourbon, spices chocolate bitters, lime, ginger beer. I liked very much! Had a nice bite from the ginger beer. Only complaint: became watered down fairly quickly. (Now I know why other bars use one gigantic ice cube rather than many small ones.)\n\nAnother plus: the oscillating ceiling fans. \n\nA beautiful space on 14th & Mission, but will not be my regular watering hole.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "The bar has been there over a year & I have passed the place many times but must have missed it. HH from 5-8, $4.50 well drinks that are quite stiff made by one bartender but I get you figure out which one.  :) the ambience is dark, sexy and just fits.", "author": "Magda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Don't come hear hoping to hook up with a porn star from Kink.com. There, I said it. \nDo come here if you want good drinks in a sexy space while being surrounded by a welcoming crowd of eclectic folk.\n\nPricing is a bit weird - one time I was charged $9 for a Templeton cocktail, the next visit it was $12. I tend to think I got a deal the first time so no big deal...with cocktail in hand while chilling in front of the fireplace there are much worse ways to spend a Friday evening.", "author": "phil h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "I hardly ever get out to the city. This year (caution: useless but helpful details enclosed) for my birthday I wanted to hit the city for a change of atmosphere. Had a plan mapped out that didn't include the Armory Club, but I'm so so so so soooooo glad it just happened. Stumbled upon this place walking to a different place. Absolutely loved it. Everything about it. The staff the drinks the music the vibe and decor. Stayed the night instead of the planned bar hopping. So happy we did.", "author": "Melli D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "Swanky decor just a bit off the beaten path with cheap drinks to boot. Even their well vodka and bourbon is Russian Standard and Four Roses.", "author": "Thömas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "This is a great new place in the neighborhood to grab a fancy cocktail.  If you can score some of the comfy leather seats, it's a good place to have a few drinks.\n\nExpect to find an expensive drink menu with creative and delicious concoctions, slightly surly (but knowledgeable) barstaff, and a respectable beer and liquor selection.  The artwork is kinky, but subtly and the overall decor is tasteful and dark.  \n\nPersonally, this is not the type of place I'd expect to go and meet anyone worth talking to, as there is a bit of an overdressed doucheyness to the place, especially on a Thursday-Saturday night, but it's a great place to go with people you know to enjoy a drink.", "author": "Meow S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-31", "description": "Sexy. Kinky. Classy.\n\nInternet pornography company Kink.com opened The Armory just weeks ago and managed to keep the \"dirty\" out and let the \"sophisticated naughty\" in. \n\nIt was the perfect venue to celebrate Miss Natasha R.'s birthday. We dressed the part (knee high dominatrix style leather boots; whips, corsets, choker necklaces, etc. etc.) and rolled up early enough to catch the later end of happy hour (read discounted specialty cocktails). The Armory has a large front room and a smaller, more private back room, which houses a small one-man bar, access to the single unisex bathroom, and a private VIP couch area complete with a fireplace, which was reserved for the birthday girl's shenanigans. And the shenanigans were plenty throughout the night. \n\nCocktails: I ordered the \"Gently Bound\" as my first drink of the evening. It was so amazing that I kept ordering them until I was too drunk to remember the name of the cocktail, so I switched to champagne. \n\nFriday evening here started off slow, but towards the end of the night the place was slammed and a long line formed at the entrance. The bouncers were great and easily let you back in if you wanted to get some fresh air or pump your lungs full of nicotine. \n\nCrowd at the beginning of the night was slightly creepy aka drunk guys in their forties that constantly walked into the back room to sneak glances at us dressed up girls, but later on in the night the vibe shifted towards a younger, hip scene.\n\nA very fun place to grab some drinks with friends while admiring the sensuous wall art and have your night get that desired little twist of kink.", "author": "Anna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-25", "description": "The best way to end your Armory tour...with a cocktail in hand from the Armory Club!\n\nI was supposed to go the night it pre-opened or opened its doors. Same day as Folsom Street Fair. I was appropriately dressed for the occasion and thrilled, that didn't happened due to the German beers I ended up having after Folsom Street Fair.\n\nSo, after taking the Armory tour, a few hours later, I stopped by!\n\nUm, It's really nice to have this spot, however; I think it will soon be taken over and known as a \"gay bar.\" No problem there, except when us, straight girls, walk into a gay bar, we often do not feel very welcome. Just a feeling I got from the crown that night. I would have for it to be a gay bar since gay, straight, and by, and trans can all enjoy this wonderful bar!\n\nThe drinks are stiff! OMG! Did you pour 80 proof into my glass?! I can't talk about the prices...as I was not paying for a single drink I was having, but I can tell you it tastes like \"be prepared to pay a bit more than you'd want.\"\n\nLove the spot, love the drinks, love the menu, love the crowd it attracts as well.\n\nTwo things:\n\n1. Did you know the props people at Kink created the decor, design, and furniture for this bar?\n2. Only one bathroom? The line is long, try to fix this? :(", "author": "Alexia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-15", "description": "Negative stars for the offensive price gouging ---  e.g., $17 for laphroaig 10 when the bottle is less than $40 and only pouring soda water from small bottles rather than from the bar soda gun.  The beer prices were \"ok\", so probably it's best to stick with that.\n\nThe interior is lovely and, if not crowded, the space/couches are great for sitting and talking.\n\nSo, after doing the math, 2 stars.", "author": "D E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "I like this place because there are usually good looking people here and the drinks are yummy, but it is often really hot inside and I kind of take issue with waiting in line for a bar that is on 14th and Mission... its usually just not worth it.\n\nIf you are going to go... try a Thursday for a more local crowd.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "Came here for a friend's birthday party, and gotta love Monday nights. If only every bar night was as chill as this one. Lots of space and comfy seats -- backroom for private parties, if need be, as well.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "Dark and a bit mysterious.   The S&M photographs add an interesting element, the place across the street notwithstanding.   Terrific drinks and a stellar whisky selection.   I was pleasantly surprised with this place...", "author": "Max K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "This is one bar I can honestly say doesn't need a room full of people to create that unique vibe that attracts people in. A quick glance around at the digital/hanging art, you're thrown into establishment filled with curiosity and excitement.  \n\nDrinks. Drinks are amazing at around $10 a bar themed cocktail. I think mines was something on the lines of hog tie. \n\nCheck this spot out as a prep for the tour just across the street.", "author": "Deon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "Highlights: \n- Chic, edgy, and swanky red decor. Reminds me ot something from 50 Shades of Gray, esp with their portraits on the walls. \n- Craft cocktails, beers on tap, wine, whiskey, you name it! \n- Unique cocktail names and really strong/crafted drinks. \n- I love the fact that there is actually seating and ample space to stand around\n- The bathroom is actually lit and I can see myself. Plus! \n\nImprovements: \n-  I can't think of any, just don't spread my secret spot so it won't get too crowded. ;)\n\nTips: Come early for the best spots. There is a back room!", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "So, when I heard Kink was opening up a bar, I groaned. \"Great,\" I said to myself. \"The Mission will have it's very own Coyote Ugly, but with rope bondage and latex. AWESOME.\" I wasn't going to set foot in there until I was presenting for an event and the opening ceremony was being held at the Armory Club so I reluctantly dragged myself over there.\n\nI have been pleasantly surprised at how fond I am of this place. It's got a really elegant feel inside that makes me feel comfortable suggesting it to a range of people, from jaded pervs like myself to bright eyed n00bs to my boss. And as a female Top type, the cute male bartenders really work for me, even if they do keep their shirts on and never dance on the bar counters. *coffhintcoff*  \n\nThere's some suggestive images on the walls, but nothing too alarming, just enough for a blush and a stammer. I appreciate that last time I was there I saw a painting of a BBW woman in bondage by one of the bars- something that really pleasantly surprised me, considering Kink doesn't work with plus sized models. Perhaps a hint of a brighter future? The drinks are also slightly risque- though I do sigh a bit at the Donkey Punch/Reverse Donkey Punch... rapey, violent drink names seem out of place in an otherwise sophisticated environment.\n\nI did come here for Halloween, and ended up leaving with my date because I felt there wasn't a lot going on, so I guess the only thing I'd point out is that, for good or ill, don't come here expecting kinky entertainment to be going on. You may need to secretly and discreetly make your own. ;)", "author": "Kitty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "Cool little place.\n\nMy friends and I got here early, so we had time to snag a bunch of seats together. Happy Hour starts at 5 and ends at 8.\n\nThe drink menu is extensive. I tried the Zombie Princess: \"appleton estate white rum, velvet falernum, creole bitters, pomegranate, lime\". It was lovely. Sweet, yet strong. I guzzled this one down, and felt a nice buzz immediately. \n\nThe second cocktail I tried was the Wake Up Call: \"four roses bourbon, spiced chocolate bitters, lime, ginger beer\". This one was tastier, but it seemed a bit on the weak side. \n\nI think this is one of the best looking bars I've been to. Aesthetically speaking, I love everything about it. One minor flaw: the bathroom door does not seem to lock. Having someone walk in on you while you're peeing is really creepy.\n\nOtherwise, I think this is a perfect hangout, whether you're into kink or great drink.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "I just threw a large party for my sweetheart's 50th birthday at the club last night; I was so taken with the care I received, I have to write a review while the love is still flowing. I booked the downstairs room, which has a speakeasy feel to it and a private bartender. During the planning phase, Jason seemed to take care of my every wish, ease my stress and answer all my questions, no matter how trivial. The party was seamless, thanks to the staff here. Brent was our bartender for the event and he seemed to anticipate what was needed before he was even asked. A class-act all around. I'm grateful to these guys for helping me host the exact party we were hoping for. Thank you!", "author": "Sandi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "How quintessentially SF.\n\nCraft cocktails, bar snacks in mason jars, and bondage-as-art.\n\nGently Bound. \nYou or the beverage you ordered. Champagne and then some, because in the same way we don't all wake up and decide we want to drink scotch before we've tasted alcohol, you (probably) don't dive into BDSM if you don't know what it stands for.\n\nFor the rest of us, the menu and decor border on edgy, but keep it classy.\nPossibly ironically, sipping a Wake-Up Call at last call, I encountered what has probably been the most polite \"last call / it's time to start moving towards the door\" nudging by the staff.\n\nI look forward to many more late nights together.", "author": "Alissa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Love the atmosphere and ambiance at The Armory Club.  Trendy, hip, and attentive bartenders.  Ordered a whiskey sour (not on their cocktail menu) and wasn't overwhelmed by it - however, tried my friend's drinks (ordered off the cocktail menu) and they were delicious.  So, I guess I should stick to The Armory Club's signature cocktails next time.  I will definitely be back and recommend to anyone exploring the area!", "author": "Angela R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-25", "description": "Went here to kill some time before heading to Nihon Whiskey Lounge.  The place was packed on a Friday night.  My friend and I waited for a bit till we got a bartender's attention.  I ordered a something \"bound\" (forgot the name) and my friend got a gimlet.  My friend's gimlet was pretty good while mine was just ok.  I should've gotten something else with whiskey but I was already awaiting to go to the whiskey lounge.  \n\nThe front area of this bar was waay crowded and too loud for my liking.  We walked toward the back where there was no wait at the bar and more mellow crowd...somewhere we should've been earlier.  Everything was ok..until a very drunk asian guy shouted, \"hey I'm no longer the lone asian\"....he then tried to continue to talk to me and my friend...at first his comment was funny and I cheers him for that but his drunkeness and slurring made my night there kinda bleh.  Overall this place is ok...it's a little too packed for my liking though.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "im a fan of this spot!  have been here quite a few times for halloween, private parties, a casual drink.  the cocktails are really delicious here, and the atmosphere is fun.  every one is casual and looking for a great time, without any of the Marina stuffiness or pretentiousness.  lots of space too, and great conversation-provoking art on the wall!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "Time:  Midnight-ish.\nDay:  Friday night.\nParty of:  Two.\nAttire (mine):  Kind of a fancy dress- I had previously attended a girl-night dinner.\nFirst thoughts:  Hey, wait, this isn't a typical bar in the Mish (at least not the ones I've been to)... not too many too-cool-for-school-hipster-types...\nDrink:  \"Farmer's Daughter\" which was delish.\nPluses:  Super nice door guy, very clean inside, good energy, good solid drinks.\nMinuses:  I guess the art can be offensive to some, but I barely noticed it, really.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "Surprised. Sexy, dark, GREAT cocktails.\n\nSuper friendly bartender in a city where sometimes bartenders aren't so friendly.  Loved the drinks. They were great spirit forward flavors. Had the traditional classics plus some fun new ones. I'd def go back. Was there on a weekday and it was quiet, not too full, but a great overall vibe for a classy drink.", "author": "Shanee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Fun and chic spot. Pictures on wall are very nice touch. Excellent cocktails. Bartenders friendly and professional.  Would definitely recommend!", "author": "Sunny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "This place is totally cool. I love the decor and the interesting paintings around  . The crowd is mixed and theres no cover charge which is always a plus. Even on a Friday night , there was no line but it was very busy inside. The bartenders are very attentive, especially Chez!! Thanks CHEZ.  See you again very soon!!!", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "I've only been once, but definitely want to come back to The Armory Club to try more of their cocktails. Super swanky atmosphere with a good drink menu. The bartenders were informative and made good suggestions to all of us. Great place to grab a drink before or after dinner!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "A great bar, great drinks, a great overall experience. Bartenders were friendly and the atmosphere was cool. It is located across the street from Kink, a fun good looking crowd. Would go back and suggest it to anyone who enjoys a fun laid back bar with an edge.", "author": "Henry J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-05", "description": "Started off fine, was kinda full but we went to order drinks. The bartender was nice. Then it all went downhill. Ended up being The shittiest service in the entire mission. Being called \"motherfucker\" by waitstaff was a great touch. Thanks, guys, really looking forward to coming again.", "author": "Daria L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-19", "description": "10 minute wait for a drink in a not so crowded bar. Folsom crowd not even there for a reserved happy hour event. Bar staff seemed disorganized and rarely looked at customers. Plenty of staff, just no one with the oversight on the current customers. They seemed more focused on a prep for the party than attentive to the customers at had. Poor, poor service. It's too bad. I left.", "author": "Shelby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Located across from the famous \"Sex Castle\" and owned by kink.com (I think), this bar is much more of a fancy speakeasy than an erotic prelude to tours about porn. Though a little pricey, the ambiance is great and so are the seasonal drinks on rotation made by the skilled mixologists at the bar.", "author": "Shaina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-15", "description": "I reserved a space here at Armory for my boyfriend's birthday and they were amazing.  \nThey set up our sofas and we weren't large enough to have our own room, but they took care of us.  It's a nice, classy place and it feels nice to be there drinking a cocktail  here on a rainy day. \n\nAfter shots and several scotches later, my bf said, \"Gosh, I loved that place. I would go back\" :)", "author": "Kris O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-02", "description": "This place is a pretty cool branch off of the Armory thematically.  However, the cocktails are fairly weak.  They need to learn how to go a bit more heavy handed on the good stuff.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "I've been to this bar a few times and am pleasantly surprised by the drinks each time. Great spot on the corner if you are heading into the Armory or to stop at before dinner. Never too crowded and they always have comfy seats. The bartenders are super helpful and friendly. The last time I went in, they were mixing new drinks and let us try one of them. They also are very knowledgeable on the rather large selection of spirits they have behind the bar and are excited to talk with you about them. Great/sexy atmosphere for a moderate price.", "author": "Wendy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-22", "description": "Beauty is in the eye of the beholder and all that is gold does not shine. Funny this is I work for Kink. Com and went over to have a night cap. It was a Sunday night with only a few people in the bar and two bartenders. \n Now mind you I was in my grubby work cloths and not looking that sexy but I got my first drink in good time. I finish that one and was ready for another but Noooo. The two bartenders did not even give me the time of day. So I called my friend who were comeing to meet me there and told them to meet me at zeitgeist bar instead where I now I will get the attention I deserve.", "author": "Rodney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "love this place! Great venue for a sexy casual night out", "author": "Patrisha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "My friend had his jacket stolen here. Otherwise, great spot. Nice engaging bouncer. Cool diverse crowd in every sense of the word. Nice music and space. Cool drink menu. This place oozes sex, but in a subtle way.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-27", "description": "What a beautiful bar!  This goes hand in hand with my old world old man's bar on the other side of the bay, the Night Light.  However, this bar is linked somehow with the Armory across the street. Dark wood everywhere, copper tin ceiling tiles; framed art that somehow screams black velvet, but are actually well crafted artistic and beautiful bdsm photos. The bar itself is a sturdy yellow toned light-box, so you don't have to worry about leaving your credit card on the bar and losing track of it.  There are several seating areas with deep leather armchair sofas.  Once you've sat yourself down with a drink, I don't think you'll want to leave.\n\nSteve was my bartender who easily assessed my drinking needs into one of the specialties, my request for a girly cocktail, brought me the Reverse Donkey Punch, a delightful vodka based cocktail.  Girly indeed!  My second was a bourbon cocktail, with bitters and lemon tonic etc with a thick orange twist.  Now, bourbon is not my thing at all, but I wanted to check out two of the3 specialties, and I must say, it was pretty tasty despite my dislike of bourbon.  If booze isn't your think, and you don't want any part of the numerous whiskey bottles displayed boldly across the back lit shelves of bottles, well, there's an easy half dozen microbrews on tap, as well as a good variety of bottles, including a standard Miller, if that's the way you swing. While I didn't partake, there are happy hour specials.  And it's only 2 blocks from BART.\n\nI only came by after work for a brief moment, but I will surely return soon!", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "This place is cool!  I like it.\n\nCame here on Friday around 9:30pm.  There was no line outside but inside was very busy.  \n\nThe crowd was on the mature side which was nice!  \n\nI forgot the name of my cocktail.  It was cucumber juice with gin.  Very refreshing and tasty.\n\nI would like to go back if I am in that neighborhood.", "author": "Liza T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-28", "description": "Not too shabby. Great chill spot to bring friends. DJ was not that bad either. Awkward parts...I got hit on by dudes but I suppose its because they've mistaken me for being on the team. Proud supporter but I digs the ladies buddy. I'll still go again.", "author": "Emmitt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "Nice bar, drinks aren't too bad. Pictures ok wall are different and done tastefully. Went out on a limb while we are vacationing here but were pleasantly surprised.", "author": "Josey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "Thank you for \n1. Executing a classy renovation\n2. Creating a welcoming and safe environment\n3. Recognizing that this is a ever changing neighborhood with the need for an upscale bar\n4. Employing professional and courteous people\n\nOutstanding job, great drinks and superior renovation!!!!!! I am proud to have them as neighbors.", "author": "C K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Classy. Warm and inviting decor. Subtle reminders of the new ownership adorn the walls. Good drinks.\n\n-1/2 star because it's a bit pricey\n-1/2 star because Ace bar had a great kitchen; if you get hungry at the Armory Club, you better make those expensive cocktail olives last awhile", "author": "Eric G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "Yelp has spoken. This is a sexy bar. \n\nWe had a big group and called ahead so they'd reserve us the fireplace area. It was great to have some space to ourselves in a crowded bar, but we did have to purchase bottle service to make it happen.\n\nThe cocktails are delicious, and expensive, and the bar is crowded. But this is a pretty good addition to the neighborhood - classy, excellent cocktails and plenty of conversation starters on the walls.", "author": "Gretchen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "My group heard about The Armory Club from a local at another watering hole on our visit to San Fran.  \n\nWe got to The Armory at around 7:00 pm on a Friday night, just in time for the last portion of happy hour.   The bar wasn't very busy.  The back room was being reserved for a party, so we ordered at the bar and sat along in the main room along a window.\n\nThe bar was well stocked with all types of liquor (although I just looked at the bourbons and ryes for the most part) and the cocktail menu had a great mix of house concoctions.\n\nOur party of four basically worked our way through the entire cocktail menu and all were fantastic.  I got stuck on the Smokescreen (rye, scotch, amaro, bitters) because it had the kick I like in a drink.  Sipped on the others and had no complaints.\n\nThe bartenders were awesome.  Remembering drinks, the tab, friendly, etc.\n\nWe left around 10:30 or 11 and it still wasn't jammed.\n\nDuring our visit we went to a lot of establishments in SF, and without a doubt The Armory Club won the gold medal.   Well worth a visit.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "Great bar. Ambiance was fantastic and our waitress was awesome. Drinks were good, above average, but not the best ever. Overall great experience.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "This place is pretty cool. I saw a review for it in I think GQ magazine? \n\nStopped by on a Wednesday evening, and the place wasn't packed at all. It was a nice chance to just walk around and chill with plenty of elbow room.\n\nThey have weird porn fetish photos and videos playing on the wall. Not as extreme as Kozy Kar, mind you, but the decor was odd enough to call attention. A semi-perfect mix of class and trash.\n\nAs for drinks, the prices were pretty fair for cocktails and from the gamut of your typical speakeasy fare. I'd likely come back if I were in the Mission.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "After much deliberation, I have concluded that this is maybe the most beautiful bar in SF. It wasn't \"founded\" in 1893 or whatever, but the amber lit bar, pressed tin ceiling and plush seating options are just......beyond timeless and gorgeous. Add in attentive, friendly service and delicious cocktails.......I'll just stop there.  I love love love it here.", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "Went here for my first time last night. I ordered two well drinks and the bartender charged me $9 a piece. I thought it was super expensive but figured that's just the kind of bar it is. I went back an hour later and ordered one more of the same well drink from a different bartender and it was $6. Overcharging a customer by $3 per drink is a pretty shitty move and I will not go back.", "author": "Karissa Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "stopped in before dinner at burma love during happy hour. Lots of options and great prices on belgium beer.  Cool bourbon selection and bar tender was nice enough to let us try a taste of a couple of new ones. Will return when in the area.", "author": "Han G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "Great bar, gray staff. Diamond in the....\nNo problem taking my mom either.", "author": "Marie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "After reading a description of this place and considering its location in the Mission, I expected it to be crawling with people. So imagine my surprise when I hit up this place on a Friday night for happy hour and it was a little empty. Most of the other patrons looked like they were 30- or 40-somethings just off work. We stayed til about 10 and it didn't get much busier.\n\nMy friend got there right after it opened at 5 and she was able to claim a couch for us. Happy hour drinks were $7 compared to the usual $9. Tried the Zombie Princess and later requested a sweetened version of the Gently Bound. Both were ok, but I think my favorite was my friend's fiancee's drink: the Germaine something or other. It tasted like lychees! \n\nAs for the decor, just imagine how a kinky Hugh Hefner would decorate a Prohibition-era speakeasy. The bartenders are cordial, but expect a wait. They take their cocktails seriously and it will take a while for them to make each drink. The bouncer was nice too. He hailed a cab for us and invited us to come back soon.\n\nVerdict: Go here for some classy drinks with friends and know that you won't feel like you're being rushed out.", "author": "Teresa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "This place is awesome. Bartenders are nice and informative and the prices are reasonable. Music is bumping and I wish I can hang out here all the time.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "Great atmosphere.  Loved the drinks though I found some a but strong for my personal taste, but I'm sure others prefer. Especially liked the layout and separation of rooms. Nice sophisticated atmosphere that you don't have to yell in, yet allows for fun time.", "author": "Jena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "I'm a sucker for themed/stylized bars and Armory Club has got it going on.  I visited for the first time on Saturday night and was blown away by how swanky the place looked.  The ceiling alone could be stared at for hours on end, and the comfy leather chairs make me feel like I should be wearing a satin smoking jacket and discussing fine whiskeys - that's if I drank whiskey.\n\nThe drinks were a little pricey but my \"dark and stormy\" was really delicious and was mixed swiftly.  I hate ordering a drink that takes 15 minutes to make, I don't care how good it is.  The place was pretty full, but didn't feel super crowded.  I was also excited to see that they rent out the place for special events and have a back room for smaller private parties.", "author": "Margaret I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Absolutely love coming here. Cocktails are always very well done and staff is great. Drink menu is very diverse.  Ambiance is awesome - just enough kink decor that you don't feel weird, just enough old school bar look that you feel like a classy classy lady.", "author": "Christine O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "Where else can you sip on cleverly-named and delicious drinks in a place with beautiful and classy decor while casually chatting with like 20 different porn stars?\n\n(.................................. OK, probably a bunch of places in LA, but this is about it for us up here.  And I'm happy.)", "author": "C W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Dangerous. The drinks are tasty and strong. They do a really great happy hour. One of my favorite's. They get pretty busy on the weekends but the weeknights are just right. The atmosphere is nice. Modern decor. They have great private party space in the back room and downstairs. Bartenders are friendly and experienced.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-13", "description": "This place stinks!! They were using bleach during business hours, and it made the bar reek, especially by the bar where you order drinks!! Location was not impressive & there are some weirdos here. As well, man at the door questioned my age & ID. I was surprised to get the look from him at my age. I'm pretty sure I was much older then him. This place has potential but it needs better management.", "author": "Azizi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "I like their cocktails which change regularly. Great happy hour 5pm-8pm, cocktails under $5. Nice people, bartenders can mix something to your taste, good selection of spirits. Gets really loud and crowded for happy hour. Sitting is awkward, good for a group not for a date.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "Liked the music, decor and drinks!  Relaxed atmosphere with variety of seating options, friendly bartenders and volume of music is just right.  Loud enough to hear, but low enough so that you could talk.", "author": "Gran A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-07", "description": "Worst drinks I've ever had from a nice place with high potential.  Terrible flavor combos and too much crappy ice. I went with 8 people and everyone hated their drinks. Sad, because the space is great.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "It was good. I saw a guy hiding under a table going down on a girl. Witnessing that pretty much changed my view on reality. But otherwise, fantastic drinks.", "author": "Asher H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-26", "description": "It's OK. Although connected with \"kink.com\", it's not very kinky. The decor is \"bastion of male privilege\". It was mostly empty in the early evening. \n\nNo food.", "author": "John N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-07", "description": "What is wrong with this place? Everything. Starting with the sketch neighborhood, S&M decor...and continuing on with rude service and lack of food options (there are 2 snacks - popcorn or almonds).  We ordered the popcorn and some waitress rudely smacked down a package of popcorn. seriously, like something you would buy from a corner store. not even in a bowl? WTH? super weird and lazy. How many of these speakeasy-wannabe places does SF really need? I'll be sticking to Beretta and Bourbon & Branch. will definitely not be going back to this hipster hellhole.", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Great experience here! They are back!!! Love the cocktails and the service. Thanks guys. Definitely should get more Petey scotches but you really can't top your cocktail menu. Jason and BARRETT are genius", "author": "Kris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "Great spot for a sexy happy hour. Keeping in line with the whole Armory/KINK ownership, the place has an industrial boudoir feel to it. Love the pressed tin ceiling, red velvet and peacock wallpaper. Erotic art adorns the walls and lots of luxurious-feeling leather furniture. It's a great spot for all of your boozing needs, or if you need liquid courage before a tour of the KINK facilities across the street.", "author": "Lee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "Funny place, Interior design is one of a kind. Prices are reasonable and staff is nice :D", "author": "Radoslaw D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-15", "description": "Meh. This place is okay. Decent selection of beers and cocktails, but it really doesn't have much else going on.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Amazing drinks and terrific staff await you at this gem in the Mission. Great place to start or end the night-whether you're feeling mellow or going all out. They also have a downstairs and back room that you can reserve for larger parties. I love the folks at The Armory Club.", "author": "Shalana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-22", "description": "This place is really fun for Saturday happy hour if you come with girls.   The first time I went, everyone in the bar was socializing and I had several rounds of drinks bought for my entire group, which probably isn't normal, but it definitely made me like the place more.  I would agree with other people that customers will come up to you and ask if you're a porn star -- my bf and I both got that -- but again, free drinks so we weren't mad!   The music was pretty good and the decor is sexy.  I went another night after happy hour and it was all dudes so that is why I say bring girls with you.  Also, the drink prices are a bit ridiculous once happy hour ends so I don't think I'd go back past 8pm.  I would assume this is the right place to go if you're trying to get weird with a freaky rich dude. ;)", "author": "Shala M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "Don't bother with happy hour here. They have a poor selection of drink deals. It's the evening when this place shines. Great cocktails. Beautiful bar. sparse wood aesthetic. Fun sexy bartenders and people. You can feel relaxed about your fetish outfit and lifestyle. You though show up nicely dressed.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "It has got to be the only place in SF that does not have any sports or television going. It did not click in that its across the street from the kink.com until I saw the art. For a Saturday night, the service was very quick. The vibe is some combination of hipster and BDSM. The drinks are quite good. The variety is impressive and savoury.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "Solid place, decent drinks, lovely decor, and great for happy hours! And note, it's happy HOURS (all the way til 8pm!)", "author": "Suz L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-29", "description": "I came to the Armory Club with my sister this summer before seeing King Tuff show associated with OutsideLands down the block at Brick & Mortar.  When we arrived at around 9:30 or 10pm the place wasn't too busy, but that didn't stop us from enjoying a well made, stiff drink at the bar and marveling at the interior of the place.  Dim, interestingly decorated and loud enough to be lively even without a bunch of people made for a good time.  Within the hour the place had picked up a bit; we chatted with several young, sweet, smart guys and also got along with the excellent bartender quite well.  The music was good, people were incredibly friendly and the drinks were great.  Great conversation, a couple of free whiskeys and a chill group of people with good, positive vibes throughout the place made for a great pre-concert find.", "author": "Chloe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-13", "description": "I think this is a cool place and the bartenders make excellent drinks, and they have La Chouffe on tap which is awesome in my book. I had a rum drink instead of beer, and it was delicious. The atmosphere is sleek and comfy with some tastefully kinky portraits on the wall which make good conversation starters. I shall return!", "author": "Sheila T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-15", "description": "Nice bar with stiff cocktails and an intelligent bar staff.  I had no idea it was owned by Kink.com which would explain the S&M artwork on the walls.  You would really like this place if you're into that kind of stuff.  However, if you are trying to bar hop in the mission, this place is kinda out there so it might not be ideal to make this one of your stops.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-31", "description": "Nice strong drinks but expensive. They have great specialty drinks with clever names. Good premium liquor selection too. Though they may not admit it to you, I think 60% of the people I saw there work at the Armory across the street. Actually the first time I went there was with my friend who is a cameraman. He introduced me to some of his co-workers who were at the bar too. Nice atmosphere and interesting clientele.", "author": "Sherman B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "five stars for the lovely wonderful sweet ladies who run this bar!!! I had the misfortune of enjoying the atmosphere so much, I left my wallet on the bar. when I came back to get it, the bartenders exclaimed they tried to even contact me via Facebook. thanks so much, so appreciated :)", "author": "Anna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "Great cocktails, and the best interior design in any bar in SF.  Love the back room with the flocked damask wallpaper.  Feels like home.", "author": "Allan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Really cool place, love the ambiance. Stopped here for pre-drinks before heading to Public Works to see QuestLove. Cocktails were yummy and it wasn't too crowded. I'd definitely come back if I'm in the area again.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-14", "description": "Had a GREAT time at my birthday party here. We rented the fireplace space, which easily accommodates 15 and at $180 including a bottle of hudson whiskey, mixers and gratuity is a pretty sweet deal. The bar manager, Kris, was especially great from start to finish  very responsive in booking and took care of us while we were there. we'll be back!", "author": "Erica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Can't believe it took me so long to check this place out. It exceeded my expectations. The vibe and crowd were definitely my speed. Upscale but unpretentious. Good looking crowd. Nightclub scene is not for me. This is a upscale bar great for catching up with friends or a date night.", "author": "L B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "S.Heart and I stumbled into this place on accident. Beautiful decor inside, various seating throughout, and an inviting ambiance. This is definitely a high-end bar. The staff is well-dressed well and the bouncer is friendly and not the douchey type that thinks he's the shiz. S.Heart asked our bartender, \"How long have you been open?\" He replied, \"about 44 minutes.\" Wow! We were one of the first patrons! \n\nI don't prefer bourbon by itself, but this particular cocktail called the Wake Up Call intrigued me - bourbon, ginger beer, chocolate bitters. It was fabulous! I love a creative, handcrafted cocktail. \n\nI'm excited to come back with friends. I have high hopes for the Armory Club to upkeep the fabulous feel.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "A sophisticated take on the alternative scene.  Very well done with mixologists on staff.  Try the cocktails and enjoy the art on the wall!", "author": "Daniel O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-07", "description": "Swank as fuck. This, IMO, is the best, sexiest bar in the Mission. The decore is fantastic and the bartenders are on point. Not only are they super friendly, they're not just bartenders, they're mixologists. I don';t order drinks off the menu, I simply say...\"I want something with a Hendrix and cucumber taste profile\" and 5 mins later, I have a unique, one of a kind drink that's to die for. Best of all, it won't break the bank. Drinks are about $9 on average and worth every penny.", "author": "Johnson M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "Wonderful turn of the century ambience.  Henriette is a wonderful drink (although expensive).  Wondering why I haven't been here before!", "author": "Angela R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "The place looks really nice, the bartenders are friendly but the security is not. Its seems very tightly watched and its definitely a crowd. The drinks are not cheap.", "author": "Bantu Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-25", "description": "Went early on Friday to grab a drink before the show. Pretty dead for 8PM but we gave it a chance. Wait staff looked bored and didn't make us feel at home at all. Ordered a classic Whiskey Sour for way more than I would usually pay but figured hey, handmade, small batch etc. My bf ordered a martini and it was also less than stellar. Well - wasn't worth the price. \n\nTalked to a couple of the other people at the bar and found out they work across the street at Kink- so that was pretty cool, but they became instantly cliquish when I asked about working there and said I should just take the tour. So - overpriced drinks, crappy service and a clique crowd - I'll take my business elsewhere.", "author": "Joey W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "Really great bar.  The staff was very nice and by the end of the night the bartender has learned all our names.  It got a little too crowded as the night wore on.  It's a small bar but we will definitely go back again soon.", "author": "Kennedy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "The Armory is a cool place to hang out and have a drink with friends. I always fing the most interesting characters when I go with friends.", "author": "Jessie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "While associated with the kink studio across the street, the less observant may never notice the elegant paintings from it on the walls. Feels like a foyer and day room for an elegant mansion, except well, the bar and patrons. Great cocktail list and delicious drinks. Starts to get crowded later in the evening, but wasn't horrible to get a drink", "author": "Aki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "Very well done bar with great design and an interesting crowd. The cocktails are solid and named after some of your favorite Sunday afternoon activities like \"Gently Bound\" and \"Donkey Punch\".  Coat check seemed to be a bit of a cluster you know what. They asked my friend for his ID to check a coat??  Anywho, I will return.", "author": "Ian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "Shock alert, it's not your G rated bar! Things I didn't know when I took my date to this \"cool trendy\" bar. However, I will say, this club does a terrific job of providing a sexy chic environment. The only remnants of its connection with the Armory (that I could find) were the pictures on the wall. They were black and white and in my opinion, well done. The drinks were terrific (albeit a bit pricey) but the ambiance is worth a visit. It's where my (now) boyfriend and I had our first date, so I'm partial. For you gals, it's a fun place to take guys and impress.", "author": "Megan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "Really great drinks. Great seating (grab the couch) and well-mixed crowd.", "author": "Sierra B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-22", "description": "I'm a fan. Great drinks and they take credit cards. Plus, it's a cool neighborhood with a nice view of the Armory.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-31", "description": "super cool place! a speak easy feel with the dark lights and cool drinks. notice the artwork on the wall though....", "author": "Megan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "Went here on a Thursday night around 8:30-9ish to a partially filled room with mostly business types looking to grab a drink after work. I didn't try one of the house cocktails, but their bottled beer selection was outstanding, at least to my taste. I was especially surprised at how reasonable the prices were for some of these harder to find beers--I probably couldn't buy them cheaper from a liquor store. I liked the ambience and the bartenders were very friendly and down to earth. I'll definately be coming back.", "author": "Matt R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-10", "description": "Ok, true blood and 50 shades of gray! Ill leave it at that ;)", "author": "Kajal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "First time here the other day and I was floored. Generous pours, lovely staff, good feel to the place. The back room was a little small for the event that it held, but that's hardly the venue's fault.", "author": "Dave W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "Nice-to-look-at bartenders - check. Great drinks - check. Sofa available before 10 - check. Fireplace - check. My new favorite to drink in the mission it is!", "author": "Fred F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-26", "description": "A bar built of dark wood and suitable for an Odder-Than-Thou crowd. Lots of space to stand and chat, and not too loud to do so. But, the wait time for drinks was very long.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "The girl that has short brown or black hair and that  looks middle eastern or white is a terrible terrible bartender. And she tries to serve while her ass is sticking out and in on her fucking tip toes. I came here last night for my friends birthday and I walked in and the it was nice inside. I got there about 1050 and I got to the bar about 11 to order my drink. I was trying to get the girls  attention for 45mins and every time she would help out other people who just got there and didn't bother making eye contact with me. I was beyond mad. No one should wait that long to just get helped or asked what I wanted. We finally order and she is asking more people for drinks. She comes back and says she forgot what we wanted and we have to tell her again. Rude! We waited 45mins to get your attention and then you forget our drink order. She gave me my drink without the cucumber and it's suppose to come with it. She seemed annoyed that I went out of my way and told her I wanted them in there. The girl next to my friend had also been waiting for her drinks and he told her \"hey she also wants drinks\" and she had the nerve to tell him \"I know how to do my job better than you do so don't worry about it\" I'd agree on this if the service was great. The fact that we had to wait that long to get her attention when she was helping people who just walked up and I was in the front of the bar is ridiculous. This place is only getting 1 star because I liked the morning delight drink. To the manager, please review your staff. No one should get terrible service. To top it off she was serving the guys and not the girls. Yes I went there. She wanted to service guys and wasn't paying attention to the girls. I won't ever be coming back there again, unless they change the staff. It had potential for me to come back. But, I didn't even want to go back up for another drink. That girl ruined my night.  Btw if you are reading this. Stop sticking your ass out and don't be a bitch to customers. Sorry I'm not a guy. But as a girl I should be treated the same. BYE FELICIA", "author": "Ana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-17", "description": "Super cute, classy at the same time. Great ambience;) There are two rooms and a room in the back has couch seating and a fire place! Good for dates and relaxing with friends :)", "author": "Hanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "A perfect stop after the Kink.com tour, or any night really.  It has a great atmosphere, and the bartenders know their stuff.  Try a not so standard Mai Tai, my friend loved hers!", "author": "Jay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-23", "description": "The location is in no man's land on 14th and mission.  Its like going to Nihon Whiskey lounge.  I knew this place was going to be good when you see a pool of barf in front the door.  Nom nom.  The drinks are pretty expensive with the old fashion pricing at $14!  These guys think they are located in Beverly Hillz or the piece of fatty shiet gansevoort in NYC.  Its funny cuz section 8 housing is 2 blocks away.  I hope vivid buys the armory so some porn stars will have a drink after work.  Hopefully they will take a shower before the sit at the bar.  I don't want to get herpes from the bar stools.  I already got the \"high five\".", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "A sophisticated, elegant and beautiful addition to the neighborhood. You must visit!", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Busy or light, noisy or casual, no matter what, I can enjoy good drinks from polite and dedicated staff anytime I stroll into this bar. Security at the door means I can drink and feel extra comfy. The chairs are a plus, but my preferred spot is at the window for fresh breezes and fun people watching.", "author": "Aida N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "I gotta say I've always been interested in checking out this bar since I moved to the city. I went with a friend and loved the variety of spirits and beers on tap. The ambiance is very nice, and a bit more tame than I thought it would be, given its owners across the street. I definitely recommend checking it out and will bring more friends along.", "author": "Seth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "We walked in just as they were opening the doors on a Saturday afternoon (5pm). The place is very chic inside, and has SMBD art nicely framed on the walls. The feng shui is off by the way in which the furniture is arranged. Too cramped and uncomfortable, it needs to be separated out more for a more inviting feel. The cocktails were unique and very tasty. We all enjoyed them. Service behind the bar was handsome, informative and helpful.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-15", "description": "This place was the awesomest!  I met up with friends on my visit to SF and it was a great experience.  The bartenders are on top of their game too!  The old-fashioneds were exquisite.  The music and the ambiance were also good.  For a guaranteed good time, I would definitely come back!", "author": "Roxana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-10", "description": "Losing its appeal after a few visits.  Drinks are relatively expensive compared to other spots in the neighborhood.  The beer list is not very interesting... has it changed? Or have I just become pickier?  The last few times I've come here, it's been so loud that it was impossible to have a conversation with friends -- even though the bar was not crowded at all.  Full of people with no self-awareness shouting at their friends.  Pass.", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "Finally checked out this spot after being very intrigued for some time. The decor is beautiful , swanky and porny at the same time if you can imagine . The main room is pretty well spread out , and there is a smaller back area with a bar as well. Went on a Friday night so despite the amount of space, there was not a lot of room to sit. My friend and I ended up sitting on the stone in front of the fireplace (no joke I think I burnt my ass!). Very nice bartenders. Mixed crowd, half yuppie half Missionite . Fairly quick service", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Spiffy bar, nice cocktails (Frankie Says Relax, Wake Up Call).", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "it was a bit scary to get too but once we walked in it was a blast I love the decor of this bar it's classy and sexy so are there cocktails it was worth the trek from east bay.", "author": "Velonda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "Boyfriend and I were taking a long walk back from dinner to our hotel, and wanted ot grab another drink in the area. We took a seat here, completely uncrowded on a Monday night around 7, first sitting by the windows but moving to a couch near the fire after another couple left.\n\nI can't vouch for the drink prices because I didn't pick up the check, but they had a local no-sugar-added cider, which was a huge plus for me since I can't have gluten and cider is my go to.\n\nThe interior is gorgeous, with the dark wall treatment, fireplace, gilded ceilings. We did notice the sexual (and for us, sometimes weird) art on the walls, and found out that the bar is affiliated with the porn studio across the street. We did talk to some folks from the studio, and I got the feeling that tourists didn't often come by, which is always good for feeling like you're having an authentic experience. Staff was very friendly to us though it closed about midnight since it was a Monday.\n\nWould definitely go there again if in town!", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "oh I love this bar, especially the one in the back.  great proximity to public works to go dance if the urge strikes. strikes often.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "The atmosphere, the location, the drinks and the whole package rocks! One of the best bars in the city!!", "author": "Paolo E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "I likey this spot...its like where Beretta meets the Nihon Whiskey bar. That said, dont rush out the door either for awesome thin crust pizza or the widest selection of whiskey. What The Armory Club does provide is a cozy, clean environment, and if I drink much I would have commented on that too...my friends did not seem too disappointed. I on the other hand, was able to appreciate all the fine little details that the owners were keen enough to tend to.", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-09", "description": "Awesome people and decor but horrible drinks.  Both of us took two sips and left the drinks.  They have pretty good alcohol but no fresh fruit.  Not sure why else the drinks were so bad.  I am comparing them to places like 15 Romolo, Maven and 83 Proof.", "author": "A J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "Enjoyable halloween night here after the Hell in the Armory tour. Bar was a little understaffed, but there was a private party downstairs and the place was packed. Drinks are nicely mixed, ambience is definitely cool, but yeah, the bathroom locks don't work too well.", "author": "P D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "A very unique little bar/lounge. The fetish themed pictures on the walls and the SF Armory across the street gives a little dark and mysterious appeal to it. The happy hour was nice and it wasn't as crowded as I imagined it would be at this time.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "Groovy drinks, good vibe, nice, busy, not too loud. Kinda exactly what you expect and hope for in the mish. Happy hour prices are +++. Dig it.", "author": "Krista I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "Pricey but great cocktails. They know how to make a good drink with care and precision. Go here for great cocktails and good service. Can dress down but don't go too casual, its pretty nice inside. i.e., no sweatpants, you might feel out of place if you care", "author": "Marc M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-31", "description": "Tried to go in when it said it opens at 5, they told us it opens at 6. We went back at 6, bartender said it opens at7. As we walk out a bouncer/ employee tells us that it opens in 10 mins.  Wtf??", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-10", "description": "Great new Bar on the tip of th eMission. The interior is Beuitful well built and great staff. We had a couple of drinks here waitting for traffic to die off. i will be back", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "Went here last night. I waited in line and when I got inside I was expecting to find some dark over, loud, crowded place. It was neither of those. The lighting ample enough so that I don't need my phone screen to see the menu(Rickhouse). The decor is simply awesome: classy, seductive, red, upscale and hardwood floors I think. The pictures are graphic but tasteful. The staff was cool and friendly.  Nice crowd. I had a beer so next time I'll be sure to try a mix drink or two. I'll bring my drinking partner here next time he comes down from Sac.", "author": "Marvin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "The decor is nice with a backlit marble bar and some European palace influences.   Drinks are decently priced and well prepared.  However I was expecting more than just another touristy bar so it's hard to not be disappointed.  Was not enthused with the music either but could not find the jukebox which would explain such selections.", "author": "Matteo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Very cool vibe and great cocktail menu. Will return again with friends...", "author": "Ray T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "Had a great time here as a Trolley stop for my friend's bachelorette party! The space is awesome - very sexy. The BDSM theme is tastefully done and the drinks were delicious, especially the Germain to Boot. Also, had the back room reserved, and everyone commented on how gorgeous it was. Thanks to Kris for squeezing us in!", "author": "Coco L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "Love this place.  Small enough to be intimate, classy enough to impress all your friends.  Hosted a small birthday party here and the planning couldn't have gone any smoother.  Servers were on it, clearing out drinks and keeping us happy.  They didn't even bat an eye when we made everyone wear cheesy party hats.  Like that the windows give the place an open feeling even though it's a small venue instead of dark and cramped like so many other bars.  Good mix of music too, nice enough to groove to.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "I booked the back room for a private party.  The price was reasonable, the room was just the right size for about 40 guests, and the ambiance is terrific.  Everyone who enters immediately looks at least 10% sexier.  Bar manager Kris Ramirez responded to my questions and made things go smoothly.  He permitted me to deliver some supplies (snacks and serving trays) prior to the party, and he permitted me to store stuff at the venue overnight so I didn't have to deal with it until the next day.  He arranged some hors d'oeuvres with his regular caterer, and he arranged someone to handle coat-check (she also monitored the entrance to the room to ensure that only my guests entered).  Our bartender, Mike, did a fine job.  Everyone had a great time.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-17", "description": "The bartenders are great, this is no indictment on the workers, but this place is too small to reserve so many areas.  I went tonight  and not only was the back room reserved, but so were all of the couch areas.  With the back room reserved, there is only one bathroom for an overcrowded bar.  It is getting so that you really have to want to be there to be there.  Unfortunately I'm loosing my affinity for the place.", "author": "toby g."}
