{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "A friend brought me here raving about this place and one can easily agree after the first time eating here. We arrived on a Thursday at 6pm before the rush, so was easily seated. The restaurant is nice and cozy, so you can expect a line at normal hours although they work efficiently to get everyone in and out.\n\nBetween the two of us, we shared the Garlic Edamame ($5), Roti Bread with Curry Dipping ($5), Zen Noodle Soup ($15), Laksa ($14), and Ginger Ice Cream ($4). I can't even decide what to talk about first because everything was delicious! The edamame are piping hot and drenched in a spicy garlic dressing --a must order! As for the roti, it was standard but loved the curry dipping sauce to go with it for a nice starter. Between the two main soups, they were special in their own ways with the zen noodle more of a lighter Tom Yum seafood flavor while the Laksa is similar to a thicker curry noodle soup. Even though we were stuffed, we decided to try the ginger ice cream which was amazing! I was so pleasantly surprised with the flavor, which was not too strong and mixed in with some candied ginger bites. It was the perfect ending to the meal.\n\nThis place has easily become a new favorite from their delicious food, great price point, and wonderful service. I can't wait to come back and try the rest of the menu!", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "It was a cold day in the Mission District and hot, flavorful soup sounded amazing, so I decided to try The Spice Jar.\nThe good:\nService was friendly and welcoming.  The atmosphere is relaxed and clean.  Prices were fair - especially for a \"trendy\" restaurant.  The food itself was generously portioned, clean-tasting, and of good quality, but...\nThe not-so good:\nIt was bland. :(  The dumplings were full to bursting with pork, but it tastes like salt was the only other thing in there.  Pho ga was good, once I added the basil, but the broth was indistinguishable from normal chicken broth.  Not what I was expecting from a place named \"The SPICE Jar\".\nNot a bad experience by a long shot, just a little boring.", "author": "Jeanne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "So delicious! I'm usually weary of any Asian Fusion places that serve pho AND ramen, but I was pleasantly surprised by this place. I liked their smattering of Asian dishes--probably because they actually tasted good!  So rare \n\n- Calamari Salad: The best item by far. It was large, had vegetables, and I loved the dressing. Large pieces of delicious calamari. Would definitely recommend\n- Green Curry: Solid curry. Perfect spicy level and comes with rice\n- Takoyaki: Excellent. Would get again \n- Laksa: Good, but you have to be in the right mood for the super thick curry soup. Would order again on a cold day \n\nCan't wait to go back! Be prepared to wait 45+ minutes if you on a Saturday at 6:30PM", "author": "Angela T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-22", "description": "Honestly not bad of a place--great vibe (casual but hipster with indoor/outdoor seating) and flavors but it's way too pricey (even for SF) for what it's worth. Come here if you don't want to deal with too many asian food options and want to just go with the classics (choices: 1pho, 2ramen, 1laksa, 1fried rice, and a few other appetizers and whatnot). Also a safe space for those who eat ramen with forks *giggle* The people here are nice and relatively attentive. \n\nWe arrived at 9pm on a Friday and waited ~20+minutes. A ton of tables cleared up but no one came to seat us as there seemed to be a hold up for take-out/delivery so a huge batch of people got seated all at once. \n\nAnyway.. if I'm paying $14 for curry and noodles with a few toppings, I expect the toppings to be somewhat fresh and bountiful. NOPE. Chicken's dryness could not be masked by the heavy curry and there was maybe less than half a palm-size of shredded chicken. Cilantro was not fresh either. Also not a lot of tofu or shrimp(though shrimp was cooked fine). Basically there were way too few toppings and a whole ton of curry (not spicy btw). Places like Marufuku in Japantown are able to deliver fresh and plentiful toppings for the same price. \n\nMongolian chicken dish was $15 for what I'd consider college-student level stir fry. Chicken was also dry. The \"sesame bread\" side was an average, bland, white-bread sprinkled with some sesame seeds. I was hoping for the classic sesame bread with scallions inside but nah. It was dense enough for soaking up the sauce from the dish so I'm not mad. The flavors were there but rip because I know I can get 4x this amount for 1/2 the price at a real mongolian bbq (and with maybe not so dry chicken) \n\nAnother thing to note is how every single food item came out way too hot to eat. I hadn't experienced that in a while. The takoyakis (bite-sized, smaller than average) shouldn't be that hot especially if I'll eat it in one go!! They were delicious though. \n\nAll in all, it is what it is. I didn't come here expecting legit asian food and I'm not deeply disappointed but there really was nothing extraordinary enough for me to be paying the price I paid. Probably won't be back anytime soon.", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "No wait on a Saturday around 1:40 pm :) My boyfriend got the laksa and I had the ramen. \n\nLaksa: Really nice curry flavor, perfect consistency for the soup! \nTonkotsu shoyu ramen: Big pieces of pork belly and rich soup, noodles were chewy, one whole marinated egg. The pork belly was a little too fatty and the broth didn't taste super authentic, but it was good overall. \n\nWould come back!", "author": "Katy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "Omg the servers here are soooo kind and gracious! It makes me just want to hug them. They were so apologetic even though my boyfriend and I only waited for a couple of minutes for a table. The establishment is TINY, so they really can't seat many people at once. They kept saying \"thank you for waiting\", even after we finished our meal. We really appreciated how much they care about the customers. \n\nAs for the food and drinks... get the jalepeno plum wine if you are keen with plum wine! The jalapeno makes it less sweet and it's actually not spicy at all. They even add in a plum in each glass. I got the chicken pho and it was so yummy, and my boyfriend was very pleased with his tonkatsu ramen. We had such a pleasing meal served by such kind servers on a Saturday night before we went out for drinks. \n\nI highly highly recommend this place. The menu is not extensive, but it hits each of the cuisines: Japanese, Vietnamese, Chinese, Thai... I think that's it. :)", "author": "Christina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Really cute, hip corner restaurant that has tasty asian food! They have super yummy noodle soups! \n\nWhy I was here // My friend and I wanted to try a new restaurant and I heard from a couple of friends good things about this place! \n\nVibe // hip, chill, intimate, cozy with wooden benches and tables. They have specials on the back wall accompanied by their dessert options. \n\nFood // delicious! The perfect winter dinner spot! \n-I got the laksa // 14.00 // really tasty and had an ice flavorful kick! The coconut curry broth was super comforting and the shrimp, tofu and rice noodles were both filling and perfectly cooked!\n-my friend got the tonkotsu ramen // 14.00 // and she said it was delish! She ate it up so fast! \n\nOverall // service was excellent! They waiters came by to check on us every now and then and they filled our waters for us! I really enjoyed this experience!", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Honestly my favourite place in San Francisco! The servers are so nice, plus the food is good. I've been craving for this place since the last time we came here so I promised myself that I'm going back here if my bf is at work LOL! I love this place especially it's near on my bf's house.. really convenient. Definitely coming back!", "author": "Jo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Another great meal delivered to home by the Spice Jar. Such a great variety of Asian dishes, and always of such high quality. The Spice Jar is becoming our family's go to restaurant for Asian cusuine.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-06", "description": "I would give this place 4 stars for the decor and vibe, but the food was too salty for my palate. Heard this place was the go-to asian fusion restaurants in the area, but was sad that the ramen was not satisfying. The broth was salty to the point that I could not finish it... I understand that Shoyu and Miso by default have a lot of salt in it, but the tonkatsu flavor did not balance the saltiness. Plus, there were not enough veggies in the bowl either. The ramen must appeal to many people since it tastes very similar to other places in the Mission - I prefer a more bland based broth honestly.\n\nGlad this restaurant had small bites though. The shu-mai were tasty - was happy to see the meat took up more than 1/2 of the shu-mai (i.e. pretty big pieces of meat). We should have ordered more appetizers, but settled on dessert. I would come here again to try the other dishes - looks like we should at least give the other entrees a chance.", "author": "Connie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "The Spice Jar *delivers* with unique Asian-fusion taste and provides large portions that try to mirror the hefty prices that they charge. However, the top-notch service makes up for the pricey menu and the ambiance is truly something special in this place!\n\nMy group ordered the following items:\n-Garlic Fries: Gilroy Garlic??? lolol\n-Mongolian Lamb with Sesame Bread: the lamb truly is as soft as they say\n-Green Curry & Rice: a bit of a surprising kick to this dish\n-HANGER STEAK BBQ MUSHU WRAPS (which was big enough for 2 to share)\n\nThe food was amazing!!! The only downside to Spice Jar is that the space is actually tiny and ain't no one got time for that. The trick here is to order takeaway ahead of time and pick up your food. Take notes, young ones....", "author": "Vasiliy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "I love this place.  I've enjoyed everything I have tried here (def get the mochi for dessert), the price point is reasonable, staff are very friendly and has a nice vibe.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Such a hidden gem.\n\nWe ordered the calamari salad, salmon, pork dumplings, baos, green curry and Mongolian beef for 3.5 people and were stuffed. (One had already ate, so he just nibbled next to us.)\n\nI think my favorite was the calamari salad, well-balanced and very crunchy without too much breading. The baos were pretty small and not worth it, imo. The Mongolian beef was extremely flavorful and impossible to eat without the rice. I thought it was slightly too salty. Green curry wasn't too sweet and super warm.\n\nNow that I think about it, I think the ambiance was a lot better than the food itself. It's communal table style but there's still enough leg room for each party. The waitress was super friendly and overall had a wonderful experience.\n\n\nThe space is pretty small so tried to come early!", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Cozy restaurant with ~15-20 seatings space. Lighting and decoration look nice and modern. Started with some beers, decent price was a plus!  They have a variety of Japanese imported beers if you want to try. Highly recommend Portobello mushroom tempura as a starter. It goes very well with the beers if just coming in for late night snacks along with drinks. Laksa was good but basic. Hanger steak bbq was very interesting- steak was medium-rare cooked and the SAUCE, I believe, is a cilantro based. Grab a piece of mushu wrap, put a piece of hanger steak, some grilled veggies, and the green sauce, it is damn good! I would like to try other dishes on the menu as well.  Overall, I loved the food, service, vibes- it's perfect for a date night or casual hangout with a friend. This restaurant has a big table in the middle to sit along with other customers and smaller table seatings around the space. Better for smaller group!", "author": "Adel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "We really enjoyed the Spice Jar each time we went!\n\nThe seaweed salad (massive!) and the laksa coconut curry soup stole my taste buds away. Things were well seasoned and spiced. That laksa soup was especially swoon-worthy... My vegan dining partner likes the tofu steak, though I'm always a bit sad that there isn't a broader range of substantive vegan options on the menu. (Most things can be made pescatarian but lots of the broths have fish or shrimp.) Small but nice range of drink options. Hitachino beers always hit the spot.\n\nCute decor and nice outdoor seating that doesn't feel too hustle and bustle like some spots' outdoor seating does.\n\nServers were friendly and even accommodated a massive party on short notice. \n\nA solid choice for flavorful food in an atmosphere that feels relaxed.", "author": "Anastasia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "Awesome spot for Asian comfort food of various cuisines paired with noticeably dedicated service. The Spice Jar appears like a hipster, almost more Westernized restaurant but don't let that fool you. I've passed by it all the time on my way back to work and after finally trying it, the flavor of the dishes definitely took me by surprise. \n\nThe menu has a section for small bites, salad, soup/noodles/rice, and \"hungry.\" Prices are pretty reasonable for the most part and entrees will run you about $11-14 except for some heavier protein outliers like the Mongolian Lamb ($19), Seven Spiced Salmon ($16), and Hangar Steak BBQ Mushu Wraps ($18). The choices vary by certain Asian cuisines, such as Thai or Vietnamese. Some also appear to be more Asian fusion as well.\n\nThe space is pretty limited and has a communal table. When I went it appeared like it was a good setup for dates. We sat at bar seating near the open kitchen area. \n\nThe staff is pretty nice and friendly. Even though the restaurant was quite busy, the waiter was really kind about coming to refill water and check up on us. The service definitely left a good impression on me.\n\nBased on the previous reviews, it seems like some of the dishes are a hit or miss, but luckily I had a pretty good experience.\n\nSeven Spiced Salmon - Portions were smaller than expected for the steep price of $17. I wish there was more to this dish, maybe more rice or a side of veggies. The fish did feel a bit overcooked, but it didn't bother me too much. With that said, I enjoyed the flavor and quality of the salmon.\n\nLaksa - Tried a bit of this and loved the flavor as well. The soup is veeeery heavy and hard to finish as it has more of a thick, curry consistency. It would have been better if the \"soup\" was watered down but this also wasn't a huge issue. We ended up not being able to finish and took it home to put on top of rice!  \n\nI'm curious to try other dishes, and given the the reasonable prices and proximity I will be back!", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Great Asian food with an equally great atmosphere!! I came here with my friend on a Wednesday at around 6pm and there was plenty of seating! The restaurant is a great place to catch up with friends, but the restaurant is a bit noisy. I got the tonkotsu-shoyu ramen and it was delicious! It really hit the spot on a cold SF night. The portion size is great, and the more I ate the ramen, the saltier it got, but nothing too concerning. The service was quick and efficient! I would definitely recommend this place, and next time when I'm in the area, I'll come back here!!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-06", "description": "I wish I liked this place more as I had such high hopes! The decor is great and the restaurant is cute, with marble table tops and great plate ware. \n\nThe main gripe I had was with how salty and overly flavored everything was. Here's what we had:\n\n1) Belly baos - kind of difficult to cut up the meat. Meat was good and tender but generally too sweet/saucy\n\n2) Garlic noodles - avoid, these were incredibly oily/salty and oddly randomly sweet \n\n3) Miso Ramen - I don't usually like ramen but this wasn't too bad and was probably the best dish \n\n4) Mushu Hanger Steak Wraps - again, way too salty. This dish was basically steak fajitas. The steak was a little tough/over done and tortillas were...well, tortillas, not mushu wraps\n\nOverall, meh. Maybe we got the wrong things, but a 1/4 is pretty bad. Not likely that I would come back.", "author": "Sally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "We have come here for a long time now. I'd say it's the best fusion Asia restaurant in San Francisco. Super friendly staff and great taste. \nOften you will expect a little wait to get your table, but it's absolutely worth it.", "author": "Philipp B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "This Asian Comfort Food spot recently opened up in my neighborhood in a victorian building with lots of built-in charm.\n\nThe first thing that caught my eye were the cans of Cafe Du Monde coffee holding napkins and silverware. This is what they use for their delicious Iced Vietnamese Coffee!!! \n\nI ordered the vegetarian gyoza appetizer. They were really tasty- crunchy edges, soft in the middle and tangy soy chili sauce on the side. \n\nI also ordered the spare ribs bao- braised for 6 hours, it comes with two steamed buns and pickled cucumber.\n\nI will definitely be coming back to try more items.", "author": "Mitzi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "We had: lettuce cups, homemade tofu, seaweed salad, octopus salad, fried rice, and green curry.  I liked the beer selection.\n\nEverything was good. The lettuce cups stand out.  Place is pretty crowded.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-12", "description": "The service and space are great but the food was sort of bland and portions are small. I was really looking forward to the fries and fried rice but they lacked seasoning. The Mongolian beef was awesome but since we did family style , I had two bites and the rest was gone. I'm glad I tried this place but I probably wouldnt go twice.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "One of the best Asian fusion I have had! We got the shumai, and it was moist and juicy! Very similar to other places but high quality and very filling. It comes with four for an order.\n\nThe calamari salad was the best thing I ever had there or anywhere else (I'm a sucker for fish sauce). There was a bunch of fried calamari on a bed of salad and silver noodles mixed with other herbs and a generous about of fish sauce. The calamari was still sizzling hot and perfectly fried. The portions are amazing for the price. \n\nThe Korean BBQ wraps were really good as well! I thought the wraps could have been better and not been cold tortillas. It was basically steak fajitas with Korean seasoning (lack of a better description). The cut of the meat was a little stringy but it was easy to get over the fact since it was really flavorful. \n\nI tried some of the Mongolian beef and that was really good! \n\nThe service was amazing. The servers were very attentive and took plates at the perfect time. It was a little loud but great for a date night. There was also outside sitting but not much. I will be coming back for the calamari salad!!", "author": "Brian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "My GO-TO in the neighborhood. Spice Jar is tucked away in a residential neighborhood b.w. the Mission & Potrero Hill but near the hustle and bustle of 24th Street. Making it a cute little destination to stop by while exploring the area or perhaps before grabbing ice cream at Humphry Slocombe or Dynamo Donuts.\n\nSpice Jar is quite the small restaurant with capacity for around 15-17 tables including indoor and outdoor seating. The indoors is quite lovely with interesting light arrangements above their wooden tree-emulating tables. The orangey yellow dim but not too dim lighting make it a romantic spot but also a nice place to come to with family or friends! I feel right at cozy home when I walk in. \n\nIt can get quite busy here even on a random weekday night so I would call ahead to see. The waiters and waitresses are super nice, just a little busy sometimes. They give a family like vibe *but I am unsure of their relations haha*\n\nAs for food, it is quite phenomenal here! I love love it. True to their name, Spice Jar dishes are packed with flavors and I lay there floored by their food . A few... maybe a lot... that I have tried are as follows:\n\nEdamame (~$6) - covered in garlic and spice, I'm IN LOVE. I would not skip out on this especially as the portion size is a bit ridiculously large. Our table of 3 had leftovers.. a rare occurrence with edamame haha.\n\nFries ($6) - delicious thin fries covered in herbs with a clean feeling. Def have had better but also these hit the spot and as a potato addict I wouldn't skip out on these either\n\nSpice Jar Fried Rice ($14) - so I for one never get fried rice at restaurants cus PFT I can make that at home. But honestly it is so good here! With shrimp and chicken woven throughout the veggie packed fried rice, the flavor can't be beat. And interestingly enough, it's not salty. I think it attests to how they create great dishes with their unique spices!\n\nLaksa ($14) - MMMMMMMM. Is all I can say. Haha I love their laksa here. Flavor punch throughout. Thinnish just right noodles. All with some delicious dry tofu and chicken. Which I'm a fan of. If you like meaty dishes tho, maybe get something else because I found myself digging for some chicken that was on the dryish side.\n\nTonkatsu Ramen ($14) - the most meh dish of them all. Packed with flavor but the noodles are just like my shin ramen noodles and they get very puffy pretty quickly. Comes with a good chunk of Pork Belly but the meat in this is pretty good not great! So if you're craving ramen like I was, maybe it's for you but it won't be amazing like some of their other dishes\n\nTL;DR @threelittlewhales (insta!)\nAmbiance 4/5\nService 4/5\nFood 5/5", "author": "Sara S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "Perhaps we just ordered the wrong things, but our experience ranged from mediocre to bad. The pork bun is served with the filling on the side, and strongly resembled the frozen bao from Costco. The filling itself is a single pork rib, which was dry and chewy and slathered in sauce to compensate. The ramen is honestly a travesty: the egg was so overcooked it had the green ring around the yolk, and instead of chashu there was the same dry pork rib. Their calamari salad could've been good if the calamari weren't so heavily breaded and greasy. Their garlic noodles are somewhat decent, but that's the most basic item on the menu.", "author": "Aritra B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Always nice to find another local spot in East Mission! \n\nTHE WAIT: 10 minutes for two on a Thursday at 1:15pm. \n\nCOST: $35.89 before tips for 1 starter and 2 lunch entrees. \n\nMUST-HAVES: The Garlic String Beans are great - strong flavor, with that perfect crisp. \n\nOur Ramen and Laksa definitely filled noodle craving - these dishes were stronger more for their broth and flavor, less so for the noodles' texture.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "Great find for truly delicious Asian Fusion lunch! \nBusy neighborhood restaurant in the heart of the Mission District in San Francisco. Seating is limited so arrive before noon for lunch or the locals will beat you to the punch! \n\nThe lunch menu is full of great options that will leave you satisfied and full and wanting to come back to try more of their great dishes. For our appetizer we chose the Shu-Mai steamed pork dumplings which were delicious and cooked perfectly. We then shared the Laksa which is Coconut Curry broth with shrimp, chicken, tofu, bean sprouts, cilantro and rice noodles. Delicious! Great flavors! We also had a bowl of the Green Curry Chicken with tomatoes, broccoli and basil with a bowl of Jasmine Rice. All very fresh ingredients and full of flavor. \n\nThis was our first experience at the Spice Jar and for sure not our last.", "author": "Barbara n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-21", "description": "Tried the ramen. Liked the texture of the noodle, but not a fan of their chashu (not sure what cut of meat they used...more like ribs?). The soup was on the salty side but that's how ramen usually is. \n\nI guess they could be a 4-star for many people. I'm rating them 3-star based on my personal taste, so please take it with a grain of salt. There are quite a few ramen shops in the area that I like more, so I gotta make sure the rating reflects that.\n\nThat said, the Spice Jar's got a great space and I can tell they care about every dish that comes out of the kitchen. So don't be deterred by my review. You should definitely give this place a try yourself!", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Disclaimer: Tourist review\n\nWOW! Spice Jar was delicious! While visiting San Francisco we searched on Yelp for \"Asian Fusion\" and the Spice Jar was the first restaurant that popped up. What a treat! \n\nThe restaurant is pretty tiny so we waited outside for about 25 minutes. The wait was 100% worth it! I loved the vibe and decor. It's a great place for a date night or dinner with close friends. \n\nWe had Laksa and the Tofu Portabello Steak. I would highly recommend both! They were both VERY flavorful and a decent portion. The only sad part about leaving the Spice Jar was that I feel like I only scratched the surface. So many yummy options to choose from! If I lived closer I would totally be back!", "author": "Kimberly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "This is my \"New\" favorite Asian restaurant in Noe / Mission area. Tonight we had the pork Bao, Mongolian beef and Green curry chicken. \nThe Bao was light, the pork filling tender and flavorful with a side of dry mustard, pickles and lettuce. There was too much meat for the 2 bao but that is a good thing! The Mongolian beef was HUGE serving of beef, mushrooms, onions, green onions, and bell peppers. Rich and meaty and went great with brown rice. The green curry chicken was nicely spice but just a tad on the sweet side.  The service was attentive, gracious but not cloying. I want to go back and try more of their menu.", "author": "Armando H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Solid neighborhood spot. It's not a place I would walk more than 5/10 minutes to or be super excited to bring my parents to but it is a good / dependable spot for casual dinner. It's not fancy and the food isn't mind blowing but it is tasty and prices are very reasonable. \n\nI liked the laksa- it's super hearty and yummy. The sesame miso ramen was a little more creamy than I expected but did enjoy during a cold night. I've also gotten the spiced chicken salad which was good for when I wanted to feel like I was eating something healthier :)", "author": "Hyan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-05", "description": "We came here upon recommendation of local friends. The food was supposed to be really good. It was a Sunday night and we had all the time to sit outside on their terrace and enjoy the day. Neighborhood is cute and lively. The waitstaff is friendly and attentive. We ordered a  bottle of white wine and the octopus balls. The wine was decent and the octopus balls were delicious. I then got the green curry which was also really good, spicy and creamy with delicious perfectly fried tofu. Although the food is really good, there was definitely a cockroach climbing up the window right next to the food packaged for delivery and pickup. It was pretty disturbing. We were done with our meal thankfully. We then got the bill and it was nearly 80 dollars for dinner for two people...in a place with cockroaches. The food is good it's true, and the staff is friendly, like three stars. Value for money and hygiene though is not great, like 1 star performance.", "author": "Anne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "First time here and didn't disappoint really great food friendly staff loved it outside seating very limited but great atmosphere", "author": "Ismael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Is hipster style ramen able to compete with the popular ramen houses? I think so!\n\nService: A Very friendly and welcoming. There wasn't a moment we waited for service or ordering. The food even came quickly. \n\nQuality: A+ I went with the curry ramen and was not disappointed - very hot and creamy flavor with just the right consistency. From the crisp cilantro to the freshly shredded chicken, the dish was tasty all the way to the end. \nThen, I  tried the Tonkatsu. Wow, this dish was complex! The broth had so many strong flavors and none of them overpowered each other. The meat melted right off the bone. Very impressive. \n\nValue: A The prices are typical but the portions are HUGE!  Every bowl is filled to the brim. I saw another customer order the house fried rice and it was enormous. \n\nIt's surprising to experience good portions with exceptional flavor in a clean restaurant (veteran yelpers know what I mean).  Not sure why so many complain about the Ramen because it's definitely THE highlight. I'm very much looking forward to coming back.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "The menu has it all. Great for groups or 2. Inside/outside seating on a quiet street corner. So lucky to have in our neighborhood but would come even if I lived elsewhere.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "I love their spicy chicken curry salad.   Good lingering spice.  Big bowl of everything.  Jicama, rice, hugh chunks of chicken, zucchini , cherry tomato, good kind spring lettuce.  So yummy.  It's like eating a summer bowl of goodness. Service is wonderful.  Got to try the sui mi next time.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Food, atmosphere and service are all excellent here and the price is always very affordable for the quantity of food. Can be busy during evenings so pays to be early or dressed enough to be seated outdoors! A must visit and somewhere we go back to time and time again.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Great food and service. They don't take reservations and it's such a tiny restaurant so you kinda have to be lucky to be seated... but it's worth the wait. If you like Japanese food, you will dig this place. I also liked that they didn't kick us out when it was already closing. So generous!", "author": "Richard P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "I'm always searching for new restaurants in the Mission, and the Spice Jar definitely seems like a popular place for lunch.  Now that I've tried it a few times, I think there are definitely pluses and minuses to the dining experience.  This restaurant offers a pan-Asian menu in a crisp and clean setting. \n\nDuring my first visit, I decided to sample their appetizers/sides.  While the shu-mai were overflowing with pork filling, the aonori garlic fries tasted under-seasoned and lacked a strong garlic flavor.  I decided to try a salad during a subsequent visit, and though the crispy calamari salad looked very appetizing, I felt underwhelmed by the mixture of flavors.  I thought the calamari was fried well but could have used some salt; the dressing gave it some kick, but given that one of the billed ingredients was red curry honey, I was expecting more spicy heat.  \n\nI thought the service was fine, though it took a while to get my waiter's attention due to the busy lunch crowd.  Given the variety of menu items, I'll probably give it another try to see if I find something truly spectacular.", "author": "Keith H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "The spice jar is so good. A neighborhood establishment with some of the best Japanese \"street food\" you'll find this side of Kyoto. I love the Shu Mai, probably the best in San Francisco, and the ramen is creamy smooth.\nIt's my Sunday night go-to.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Randomly stumbled upon this place because Google maps flagged it while I was walking. Ended up having a very nice evening. Nice ambiance and excellent service. \n\nThe albacore carpaccio is mindblowingly good. Everything else was tasty too, but you can get just as (if not MORE) yummy food at less gentrified establishments for a fraction of the price, and that is what prevents me giving a 5 star review.", "author": "Renee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "I love this place! As a frequent customer here, I've gotten to know and befriend the owners. They are such warming and friendly people! \n\nThe spice jar fried is to go for. It is a bit on the oily side, but not terrible. As an appetizer, the hamachi carpaccio is one of my favorites. It's good quality and has a jalapeño kick to it! \n\nThe iced matcha green tea is refillable and I just can't get enough of it! It's authentic Japanese matcha quality and I would highly recommend this refreshing drink.", "author": "Cheri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "I love this place. I can't help but over order when I eat here. The calamari salad is the bomb.com. The pork belly boa is one of my favorites and I'm also a huge fan of the mushu wraps. The service is always fast and friendly.", "author": "Meg O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "What a cute little place! Great find for Asian Fusion food. Loved the Laksa, Fried rice and the green curry. Very subtle flavors, that tasted delicious and comforting. The fried rice had a nice kick to it that enhanced the taste! The spring rolls and Lettuce wraps were pretty good too! \n\nSeating is quite limited, so I would try to get here early. We waited about 15 mins on a weeknight for a table for 4.", "author": "Shriya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "This place has excellent food. I loved their noodle and chicken dish. The portions are quite big as well. Wait times aren't short and the place is pretty small so you might have to eat in a corner.\nThe parking around this place was like impossible to find on a weekend.", "author": "Arjan N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-22", "description": "Hmmm I hate to be negative, but sometimes it feels like the food scene has been downgrading to mason jars and moderately photogenic but overpriced, mediocre food. I was quite excited to try the Spice Jar given the glowing reviews and proximity to SFGH. \n\nA lot of fusion nowadays seems to be very hit-or-miss: either they have found the perfect balance and creatively synergized diverse cuisines, or it dilutes the wholesomeness of the original dish in a lackluster (though usually good-looking) concoction. \n\nThe Spice Jar features a menu of selected classics from Asian cuisine. If you are indecisive and crave anything within the range of ramen, pho, laksa, Mongolian beef, dim sum, poke, and fries, Spice Jar has it all. \n\nI tried the TONKOTSU-SHOYU RAMEN with braised spare rib, spinach, bean sprouts, soft boiled egg, and green onion. It turned out quite underwhelming from both a hard-core ramen enthusiast and an open-minded fusion enthusiast perspective. The tonkotsu broth was quite salty and lacked pork flavor, and its combination with shoyu made it even more diluted and rendered an indecisive, halfway-there profile. The braised spare rib had a nice fall-off-the-bone texture but not quite enough flavor. Perhaps the most anti-climactic was the hard-boiled egg. I guess my favorite part was the ample spinach. \n\nAmbiance is cozy and hip, with nice wooden tables in a cheerful, sunlit space. Something about the acoustics is off though; I was sitting across the table from friends and it was so noisy, we could hardly have a conversation. \n\nSpice Jar has a good concept as a homey, modern restaurant serving pan-Asian and fusion specialties, but the food isn't really quite there in my opinion. It may cater to those with different tastes than myself, and service was quite friendly. Unfortunately this was a lunch from which I left mildly dissatisfied and with $14 less... but with a pretty picture of ramen.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Great food (for the most part), excellent service, and an elegant, cozy setting.\n\nMy husband and I shared the following (be warned, this was too much food for the two of us, and we packed leftovers):\n\n1) Spare rib bao - disappointing - unfortunately, the meat was overcooked and tough\n2) Shiumai - good, though a bit dry\n3) Spicy miso ramen - flavorful!\n4) Laksa - excellent!  Our favorite dish.\n5) Mongolian beef - packed with flavor - another highlight!\n\nWe came around 7:30pm on a Thursday night, and waited only 10 minutes for a table.\n\nThe service was excellent.  Our waiter (we thought he might be the owner, but never asked) was very friendly, knowledgable, and efficient.  We felt well taken care of and never rushed, even though there was a crowd outside waiting to get in.\n\nThe setting is warm, cozy, and inviting.  The light fixtures were unique and lovely.\n\nOverall, a very good spot.  We'll be back!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "My favorite restaurant in SF, it's my neighborhood go to. Excellent vibes, a great spot for date night or catching up with friends. The wait is never too long no matter how many people are waiting and the staff is always so great and friendly. My favorites are the karaage fried chicken, the pan fried garlic noodles and the laksa soup :)", "author": "Lindsey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "4.5 stars. \n\nFantastic place for lunch. This restaurant is tucked away in an area where tourists are rare and only local people frequent. \n\nThe space is open and sunny with a board with a quote by Julia child:\" the people who love food are the best people.\" That essence is carried all throughout the restaurant, from the details of the decor to the items to the menu. \n\nA sense of energy and buzz immediately hits you when you enter. (vs the overbearing noise associated with popular restaurants)\n\nThere is a definitive California flair to the Asian fusion interpretation here. Japanese, Chinese, and Thai influence set the foundation for the menu items. However, instead of the greasy spoon alternatives and bastardization that often make FOB Asians cringe,  the chef has combined different elements to reinterpret and make it downright comfort food for many. \n\nI would probably stick with the noodle dishes (tonkotsu and spicy miso pork ramen) and salad dishes. To make them Pho Ga (or other noodle dishes more healthy, ask for half portion noodle and add in spinach, +$2). Call them becca's pho ga, or becca's spicy miso pork ramen.  Given my Chinese background, I am probably harsher on the dishes like the Mongolian beef that has a bit too much sauce.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "It can get really crowded for dinner but it's a great neighborhood spot for Asian food. Be prepared for a small, cozy space where you can enjoy a comforting bowl of noodle soup on a cold SF evening. I've tried many things on the menu including the garlic edamame, poke bowl, ramen, roti bread, shu mai etc and they've all been good. The only dish that left me disappointed was the hanger steak mushu wrap because the meat was too chewy the one time I ordered it. \nThe portions for ramen, laksa etc are quite generous so you could share one if you want to order a bunch of other dishes.", "author": "Christina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "This place has quickly become one of my staples for take out in the area! It's pretty crowded and small (aka cozy), so I don't usually sit down to eat -- it doesn't hurt that I'm only a few blocks away and within easy walking distance. I've found that The Spice Jar is fairly hit or miss depending on what I order. That being said, the dishes that I DO like are absolute hits. Nothing hits the spot like Spice Jar's Pho Ga (chicken pho) on a rainy day! \n\nTip #1: I love the Pho Ga (chicken pho) and the chicken salad. The Pho Ga isn't your typical pho. It's not very greasy or salty, so it might not be the traditional hangover cure, but it's great for a refreshing, warm meal on a cold day. The chicken salad is huge -- it comes with a ton of chicken, lots of crunchy vegetables and toppings for texture, and a delicious miso sauce. \n\nTip #2: Small place. There's limited seating, and mostly 2 person tables. There's a large communal table in the middle so you might be elbow-to-elbow with a stranger. There's also usually a wait on peak hours. \n\nOverall: The takeout wait is short, even when they're busy. I've only waited about 15 minutes max.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "Extremely disappointed. Read rave reviews and found our way to this place right after getting off a long flight, got the pork dumplings and two of their phos. Everything we ordered was terribly mediocre. I've had some incredible pho in SF, and I'm not even trying to hold spice jar to those standards. But for the hype this place has created, the food is just about edible. I'd recommend staying away.", "author": "Trisharti G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "The food reminds me of upscale cafe food in Japan. A combo of Western dishes with some Japanese /Asian twist; fries with ao-nori flakes, deep fried chicken (karaage) with Japanese mayo on the side, etc., Good portions -not too much, nor too little- and tasty. \n\nMy one minor complaint? We're  party of four that ordered the mushu steak that arrived with three wraps (Chinese style tortillas). The guy asks if we want one more? Yes, we say. Later, we see that we were charged 75cents for the one wrap. Come.On. That main dish needs at least four or five wraps. Minor, just annoyed when restaurant do that without a heads up.", "author": "MaMa Spatula H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "Pretty good Thai place. Atmosphere is meh but only because we didn't know it was mostly communal seating.\n\nMongolian beef was great and prices were generally affordable", "author": "Russell Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Came back a few nights ago for the second time and wanted to share a quick update! Enjoyed the roti bread and albacore carpaccio again, but also tried the calamari salad and hangar steak bbq mushu wraps.\n\nThere are a ton of photos of the calamari salad, so expected good things. It came in a giant portion, and the crispy calamari was balanced well with a ponzu vinaigrette and greens. The hangar steak bbq, while tasty, was not cooked quite as evenly. It was a bit tough to chew, so I'd avoid it.", "author": "Tim X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "This place offers creave blend between South East Asian and East Asian cuisines! Food is pretty solid, though you might find some dishes a bit overpriced. We did a family style and ordered 2 appetizers and 4 main dishes to share and that was plenty.\n\nRecommend: short rib baos, shrimp fried rice, and Laksa noodle soup.", "author": "Ella K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-24", "description": "Meh...nothing exciting about the food here. Their vietnamese coffee was pretty good tho.", "author": "Khushboo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "I have been here 2 times now and it is amazing! The location is quite small and quaint, so great for a date or meeting a friend. They have amazing garlic green beans and my friend loves their tuna tartare. The service is great and it is reasonably priced for the quality of food. They do not take reservations, but you write your name down and wait since it is a small restaurant. I would highly recommend it to those who like asian fusion and want something off the beaten path of the Mission!", "author": "Paige L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "Came here for lunch with some friends. The lunch menu is a tad different than the dinner one. \n\nFood: I got the Mongolian Beef with bread. Very tasty and flavorful. Not as big as I thought (I'm a big eater) but it was filling enough. Wife got the Tonkasu Ramen. Freaking Bomb! Broth was perfect and the noodles were perfectly cooked. Also got the pork dumplings. These were so so. Garlic fries were also good. \n\nService: on point.  Small trendy little place in a neighborhood. Friendly staff. Will definitely come back to try the dinner menu. Prices are reasonable.", "author": "Thomas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "Really enjoyed eating at this place.  Went here with a friend who lives in the area, I was visiting from chicago.  We shared the green curry chicken dish and Mongolian beef dish.  Service was good, but the place is too tiny for as busy as it was!", "author": "Asif M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "My girlfriend and I had seen photos of this place in Instagram and were intrigued to try it out. With two kiddos in tow we hoped for a quick but delicious lunch.\n\nThey were extremely kid friendly. Although limited with space and rather packed for lunch, they accommodated us and allowed us space for a stroller. Service was very prompt.\n\nWe shared the nori French fries (3/5) and each got a noodle dish- the laksa (3/5) and tonkatsu Shoyu ramen (2/5)\n\nThe French fries were decent. Freshly fried but lacked garlic flavor.\n\nThe laksa was creamy and seafood portions were sufficient. \n\nThe tonkatsu ramen was flavorful and rich. The braised spare rib was a bit tough to eat and a bit chewy. The soft boiled egg was NOT a soft boiled egg. It was a boiled egg. \n\nDecent spot for a bite. Not sure if it was good enough for me to go back.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "YUM!\n\nWe came for lunch today (Saturday). We were there early, so we were the first customers when they opened. We were the only customers while we were there.\n\nThe woman who helped us was so very kind. \n\nWe started with plum wine and what?!?! Jalapeño Plum Wine? Yep! I didn't get it, but Mark did. I took a sip. It was good! Oh... my plum wine was SUPER sweet. Plum wine is supposed to be sweet, but this was almost shockingly sweet. I did enjoy it, but asked for a Chardonnay as a follow up.\n\nWe started with Albacore Carpaccio. What a stunning dish! The presentation was gorgeous and the taste was fantastic. The jalapeño was not too hot, the ponzu sauce complimented the fish so well. And I don't know what was served on top... something that looked fried... very small slivers of fried something? I should have asked; it didn't say on the menu. Anyway.. FANTASTIC. Get it!\n\nMark got the Spicy Sesame Miso Ramen. He really enjoyed it.\n\nI got the Tonkotsu-Shoyu Ramen with the braised spare rib. It was really quite good. People have commented on the egg and while I agree I'd expect the yellow to be runny, the description on the menu says boiled egg... and it is boiled. So that's the way they serve it. Works for me. I thought the noodles were delicious. The beef was tender. The broth had a wonderful, beef flavor. I thought it was very good.\n\nI'd like to try The Spice Jar for dinner because the dinner menu has more options. Plus it might be fun to check out the evening vibe. From the reviews it seems this place is hopping in the evening. For Saturday lunch... it was super slow. Go visit them... they deserve the business.", "author": "Scott N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "3.5 STARS for a cute and above average Asian Fusion (I think?) spot owned by super friendly Asian folks. I came for brunch, and they have several small shareable plates and entrees, and a very extensive drink list.\n\n* SHU MAI - 3.5 stars:\nHomemade and meaty, but the wrappers were soggy and oversteamed. I liked that they tasted healthy and was well seasoned, but I have to admit I prefer the type at dingy dim sum restaurants because they have more flavor (I know they are chock full of MSG and preservatives....)\n\n* TONKATSU RAMEN - 3.5 stars:\nDecent broth and noodles, AHH-mazingly tender pork rib. Not the best ramen but a really good option for SF standards! \n\n* SEAWEED SALAD - 3.5 stars:\nEnormous portion of spring greens topped with seaweed salad and a soy-apply dressing. A little salty for my liking - ask for dressing on the side.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "I enjoyed their curries, salads and customer service it's the best. Highly recommend it.", "author": "Leticia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Who knew a limited menu was enough for me to rate this place 5 STARS?!1... of course, I rated them for their amazing noodles.\nBeware, if you come here after 12:15pm, be prepared to wait. Luckily, I've always arrived before 12pm and was always seated immediately.\n\nI've tried their Laska and Tonkatsu Ramen. Both were incredibly good dishes. I am in love with the Laska! Though not as good as the ones in Singapore, but differently better than all the other ones I've had in the bay area.\n\nThe ramen was decent, the rib meat was so tender that it just falls off of the bone. \n\nThe lemonade and ginger ale were freshly made and delicious. However, that ginger ale is the SPICEST gingerale I've ever had in my life.\n\nAnother great thing about this place is the service is excellent. The waitress checked in with us every few minutes to make sure everything was good!\n\nDefinitely a must visit, and the fact I work five minutes walking distance from here will make me a frequent visitor!.", "author": "Josie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Great Asian fusion dishes and the owners are always so friendly. It's a cozy space inside but a great spot for a casual dinner or for takeout. My go to is their spiced chicken chopped salad.", "author": "Trevor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Some of the best ramen I've had in a long long time! We absolutely loved this place. Came here on a Saturday night at 6:45pm and only had to wait about 10 minutes. By the time we left there was quite a line. It's a small little place with excellent service and fanatic ramen. I ordered the mint tea which was light and refreshing. My husband ordered the spicy sesame miso ramen which was very simple - just broth and ramen noodles. The broth was great with the right amount of spiciness and the noodles were oh so good and extremely fresh. I had the tonkotsu-shoyu ramen. Again the broth was fantastic and I loved how it wasn't super oily like other places. \n\nThe service was great. They were very nice and quick with everything. The cost was great as well. Overall this place has everything - great food, great service all at a great cost.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "I couldn't decide between a 3 or 4. To me, it's 3.5. It's a cute place and the servers (owners maybe?) were very nice. Very busy, so you may have to wait. Got seated at the communal table, which was fun to meet a couple people while overhearing another couple on a terrible first (and likely last) date.\n\nThe Japanese styled fried chicken app was excellent. Nicely crispy and flavorful. What killed the entire meal for me was the less than stellar laksa dish. There were some overpowering flavors in there in addition to chicken that seemed to have been cooked separately then added. I really was far from impressed. Probably would give that alone a 2 star rating but the appetizer, ambiance (check out the cool branch light they made), and people made up for it.\n\nI would certainly give this place another shot. The tons of people lined up and stellar reviews can't all be wrong.", "author": "Devashis R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-08", "description": "More than excited to go to a very highly regarded dinner only to be left wanting more. \n\nFirst bobble, sitting at end of a communal table with limited room and even less privacy to hear the person sitting across from you. \n\nThe service was very friendly. Each dish we ordered seemed to miss one beat. The flavors, while fresh, were muddled leaving you hoping for a recovery on the next dish. May have been an off night, will try again. \n\nParking & space were a challenge.", "author": "Marisela E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Went here on a Wednesday night for some dinner with a friend. The place is small and there was a little bit of a line - waited for about 25 minutes. The place is nicely decorated, dimly lit, and can get pretty loud since it's so small.\n\nFor an appetizer, we had the chicken karaage. It was tasty and wasn't traditional Japanese style. It was more in the form of American fried chicken southern style with a thick batter. It came with a remoulade sauce and lime. TASTY.\n\nI got the tonkotsu ramen. It was a little thick and came with spinach and a pork rib. The broth was nice and smokey. Noodles were decently bouncey. And the pork rib was fall off the bone.\n\nMy friend got the wok noodles and added shrimp. The texture was great sort of like a traditional stir fried noodle dish. Too bad I can correctly assess the flavor because my mouth was already salt bombed from the ramen. But it seemed tasty. \n\nWill be coming back again for the other dishes!", "author": "Geronimo Carlo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "This restaurant is amazing. One of the best hidden gems in the city. Would highly recommend to everyone to go here", "author": "Rishi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "This place is cute and intimate. Located right at the corner of the block. Sometimes I am skeptical about places that have more than two different types of cuisines but this places proved me wrong. I ordered the spicy ramen which had a perfect kick and the perfect amount of noodles. The staff was attentive and helpful. This place is small but definitely busy during lunch. Would definitely come back again.", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "4.5 stars really.  Very good Asian restaurant.  We got Laksa and the calamari salad and both were delicious.  Excellent service.  We brought our stroller and they were very accommodating finding a space for us.  Would definitely come back.", "author": "Reggie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Loved this place! Great Asian fusion place. I can eat just keep eating their perfectly flavored edamames!", "author": "Hemant J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-28", "description": "It's a cute, hipster spot. Exactly the vibe you'd expect from a ramen place in the Mission. But I was expecting more from their ramen. I'm curious what their laksa or pho tastes like. It might hold true that the place is too diverse to specialize in one type of thing.", "author": "Yad L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "Some people say, \"variety is the spice of life\". To me, that just means quantity over quality--like buffets. They usually suck and give you bubble guts.\n\nThen, you have Pan Asian restaurants that serve popular dishes from various Asian countries. Usually, I'm not a fan of Pan Asian or Asian Fusion cuisine because they rarely come close to the dishes I had growing up, the flavors are watered down, and/or the fusion of flavor profiles are just a hot mess. \n\nAfter seeing some raving reviews for The Spice Jar and that they had outdoor seating so we can bring Tater Tot, we decided to give it a shot. The Spice Jar is a newish restaurant (opened in late June 2015) that took over Local's Corner which was ok but grossly overpriced. The Spice Jar's menu is Pan Asian with several Asian Fusion dishes. There's items ranging from Chinese Dim Sum items to Vietnamese Pho to Japanese Ramen to Malaysian Laksa. The prices were reasonable for the very generous portions: small bites ($5-$12), salads ($8-$12), soups, noodles & rice ($9-$14), and large plates ($11-$19). No desserts. No msg is used. Shochu, sake, wine, and beer only. \n\nWe ordered the following:\n*Braised Sparerib Bao w/ lettuce, pickled cucumber, hoisin sauce ($5): http://bit.ly/1NaltR6\n*Crispy Calamari Salad w/ mixed greens, vermicelli, red onion, cilantro, red curry honey ($12): http://bit.ly/1LUlGaS\n*Hanger Steak BBQ Mushu Wraps w/ Korean spices, sautéed veggies ($18): http://bit.ly/1NNmzCD\n*Mongolian Lamb w/ onions, scallions, sesame bread (not shown) ($19): http://bit.ly/1KI2tb0\n\nBased on the dishes we sampled, The Spice Jar is just not my cup of tea. Seems to be better suited for yipsters and techie transplants so they choose a great location. We were the only Asians there aside from the staff. \n\nThe Sparerib Bao had a huge hunk of meat but in order to eat it with the bao, you had to cut the meat off of the bone first so it became messy. The bao was light and fluffy but the meat was tepid and a bit tough. It tasted like a boiled rib from the am that was drizzled with hoisin sauce. \n\nThe Crispy Calamari Salad was gigantic and good enough for 4 people. The calamari was overfried so the batter was hard. The greens were overdressed with the pungent, sour dressing (pool of dressing at the bottom of the bowl). The dressing didn't taste like curry or honey but a lime-fish sauce dressing used in Cambodian and Laotian salads. \n\nThe Hanger Steak BBQ Mushu Wraps (Asian fajitas) looked delicious as they sizzled on the cast iron platter. The hanger steak was cooked medium rare as requested but it was very chewy. The marinade had a savory sweetness similar to hoisin sauce, not Korean spices. I liked the accompanying cilantro (?) aioli but not with the steak as the flavors didn't mesh well. This would have been better on the calamari salad. This was also another messy dish because you had to slice the steak into smaller pieces before placing them in the wrappers to eat. I recommend that they place the mushu wrappers in a tortilla warmer because they dried out quickly. \n\nThe Mongolian Lamb was the most traditional tasting of the dishes we tried but the only dish that I felt was overpriced by $2-$3. The lamb was super tender and flavorful. It's served with sesame bread to make a sammie but I recommend substituting with rice so it's easier to eat.\n\nService was very welcoming and gracious. There's no doubt the Japanese owners are super sweet so if I was rating service alone, it would be 5 stars. They were also very nice to Tater Tot who would wake up from his nap every time a dish arrived thinking it was for him. Poor guy. Food service is on the slower end so do come here when you're not in a rush. \n\nThe Spice Jar is a small restaurant best for parties 2-4 people. The homey, rustic space hasn't changed much from Local's Corner aside from the painted walls, and addition of spice jars lining the walls. \n\nParking in the area is much easier than the central mission area.\n\nThe Spice Jar may not be my cup of tea but I wish the owners well. I hope they don't suffer the same fate as Local's Corner.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "This is one of my (and my boyfriend's) favorite restaurants in SF.  \nMuch of the dishes served here are comfort pan-Asian delights.  The prices are reasonable for the most part.  Hamada the owner oversees the whole operation and he even remembers our order by heart!!  This place has a cozy neighborhood feel.\nThere are a handful of dishes you simply must try, because it's packed with amazing distinctive flavor and deliciousness!!  You won't quite find these dishes in any other restaurant, because they are one of a kind creation by the chef/owner Hamada.\n1. Albacore carpaccio - comes with special ponzu sauce and topped w Deep-fried and pickled jalapeños.\n2. Laksa noodle soup - savory and deeply comforting & satisfying on a cold evening, made w variety of malay spices and a small amount of Japanese curry\n3. Crispy calamari salad - comes with a generous portion of calamari; The dressing is packed with flavor and out of this world!\n4. Seafood cast-iron fondue - I can't even begin to describe to you the flavor of this dish, but it's soooo good; comes with bite-size square toast pieces that you can dip into the seafood fondue.\n****BF ALWAYS orders the green curry with chicken -  I don't get it but ok.", "author": "Priscilla P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "I am a spice jar aficionado! It's close to my work and the pho ga and laksa are AMAZING! Love the ambience and the staff are so nice :-) I'm here once a month for sure (usually more!)", "author": "Devika P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-01", "description": "Service was great. Like, really, really good. Michelin-star good. The waiter must have come by three or four times to top off my water. Plates and utensils were changed between meals, even though they were fairly clean. We were asked multiple times if everything was going well. Really, I haven't been to a restaurant with such great service in a long time.\n\nThat being said, the food was really, really mediocre, leaning on bad. The garlic noodles weren't chewy enough (maybe overcooked?), were too vinegary, and didn't really taste of much garlic. The Laksa was okay, but the noodles were slightly soggy. The mushroom tempura came out cold, so I know they don't fry it when you order it. Also, there was no hint of the promised truffle salt. The gyoza was deep-fried, like they do at milk tea shops. The salmon was overcooked (not medium-rare), but otherwise seared well. The green yogurt(?) sauce it came with was unsavory, but there was furikake somewhere in the dish that was a pleasant surprise. \n\nOverall, this is a restaurant I would actively avoid. I honestly feel terrible about giving them two stars because the restaurant is fairly new and service was so wonderful, but I honestly feel cheated at the price we paid for the food we received ($35/head). There wasn't a single dish I really loved, but many dishes I wish I hadn't ordered. At the end of dinner, neither of us wanted the leftovers.\n\nI was dining with a pescetarian friend of mine, so we weren't able to order any of the recommended dishes. That might have contributed to our poor experience, but I'm a firm believer that all food on a restaurant's menu should be delicious.", "author": "Jefferey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "Heard about it last week but said #effthat after glancing at the menu and the #newrestosyndrome slew of high reviews by people with not many reviews. #fastforward Today I awoke from a nap and randomly decided to go. I expected a forgettable meal but was pleasantly surprised.\n\n(^_^) Hanger Steak BBQ Mushu Wraps $18 (http://bit.ly/1EBSFZF)\nCooked outer, less cooked inner. #simbaitstodiefor\n\n(^_^) Braised Spare Ribs Bao $5 (http://bit.ly/1hLXJFL)\nOther reviewers had dry ones. #thatswhatshesaid\nNot mine. Wish BBQ places did rib texture like this.\n\n(^_^) Chicken Karaage Namban $7 (http://bit.ly/1JhcVRn)\nTender, moist. Sauce not spicy, idc.\n\n(-_^) Homemade Tofu $7 (http://bit.ly/1EBSJZe)\nSilky. Very hot at first bc of the bowl.\n\n(-_^) Edamame Hummus Jar $7 (http://bit.ly/1MxIUSz)\nHeld back by its cracker & crudité selection.\n\nThe food, the owner's friendliness, and the sheer comicality of filling up a makeshift shelf with dishes (http://bit.ly/1foB6Wi) made me feel better about seating snafus. Namely, how 1) there was an empty 2 top when I arrived and only larger parties ahead of me on the clipboard, 2) another 2 top became then stayed empty, 3) I got seated at not an actual table but a shelf that they cleared of supplies & plants, 3.5) which, if that was the plan all along, could've happened right when I walked up and not after a near half hour wait, and 4) I later realized the thing in the middle is a communal table, which also had empty spots the whole time. #thingsthatmakeyougohmmmm\n\nBut yeah, #nottrippin.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "This is a very unexpected amazing place for Asian fusion food! The food is very diversed: veggie, meat and seafood options. From egg noodle to (amazing) salmon. I went with a group of friends and we had the seafood fondue, veggie gioza, garlic edamame as appetizers, all were very tasty, the fondue lacked a little bit of spices but the olives inside were a great idea and brought some saltiness to the dish.\nHands down for the Mongolian dishes and the Laksa dish with coconut milk noodles with shrimps & tofu, they were simply delicious and very flavorful! \nThe roti bread with curry was a little bit too much on the oily side but the curry dip was very good.\nTo finish our dinner we all shared a small jar of their coconut rice pudding, I can just say that it wasn't my last time eating this, I'll so get it again next time I eat there! \nI'll be back! This place is heaven for foodies! So many flavors in 1 dish! Service is also very good, the lady took time to explain to us the different dishes and helped us chose our dish.\nPrice is the best!!! Very affordable!", "author": "Rachida I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Honest place with great food, friendly service and reasonable prices. A combination that is lately not so easy to find in SF.", "author": "Claudia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-14", "description": "Came here with a friend for quick meal of ramen and some Asian food. Wanted to know if this placed lived up to it's hype. \n\nSadly, for me, it did not. The Ramen I got was bland. You could tell the ramen noodles came from a package, as they were not fully boiled to separate. They also forgot to add the tofu (got the veggie ramen dish). Major fail. \n\nThe mushroom lettuce cups were okay, but not noteworthy.\n\nMy friend liked her Laska soup dish. I had a bite of it, but wasn't impressed. \n\nBottom line: it's a cute place, the service is meh (they don't speak much english) and the food is not anything to remember. \n\nTake your belly for Asian bites and ramen elsewhere. There are so many other better places in SF for that. You will thank me!", "author": "Sonia A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-08", "description": "The atmosphere is great. The area is great. Service was even great. However the food was not, and isn't that the whole point? \nFood was mediocre at best, which is disappointing for an asian fusion joint in San Francisco. \nThe homemade tofu, which we were very excited about came out very watery, and goo-like. Obviously not cooked enough, and when tried it was hard to swallow. \nI don't know if it's just me, but I like my tofu cooked. \nBut like I said, the service was amazing and that's why it gets 3-stars. They refilled our waters often and actually took the tofu back when we told them. Although when they brought it back it was still bad, at least they tried. \nIf you come to The Spice Jar, just order something other than the tofu.", "author": "Francis A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Such a great place! The decor and outside seating makes it a really charming spot for a date. The owners are friendly and the prices are reasonable. Get the laksa and the iced green tea!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "I usually stay away from Asian fusion places since they're just ok and nothing spectacular. Spice jar is small but nice and cozey. Has some outdoor seating as well. I got the salmon with brown rice and some baby tomatoes with a few edamame beans. It was what I expected and was smaller portioned at $17.00. \n\nThe food is about 3.5 stars but the service is what makes it a 4. Service was attentive and water was refilled on multiple occasions. The place is small so I would expect good service. The menu has something for everyone with ramen, small bites like karaage, har gow and bigger plates.\n\nI would return if I was in the area and was being indecisive about what to eat.", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "One of the best restaurants I have eaten at in the city. The food is phenomenal and at a great price. Portions are also big! Had the fried rice, the steak strips, and the calamari salad and I was floored. It was awesome! Would recommend to everyone and everyone. Great place for a date, or a dinner with friends.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-12", "description": "Another gem in SF....\n\nThree of us for dinner...so ample opportunity to do lots of share places and enjoy all the flavours that these dishes have.\n\nWe started with the calamari salad and it was excellent...this set a great benchmark. Next to come was the chicken karaage and it was super. Nice and crisp on the outside with all the succulent flavours trapped inside...yum.\n\nThen there was the Mongolian lamb which was good and the star of the night were the spare ribs on a bao with cucumber and a delicious sauce...hoisin I believe. Tasted so good we doubled on these. The spice fried brown rice was nailed.......\n\nGreat night with good service in a really comfortable environment. The whole place has a really appealing vibe.", "author": "Mick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "FOOD: The tagline \"Asian comfort food\" describes this perfectly. Nothing fancy, nothing mind-blowing, but all solid. I don't think I could order a single thing here and be disappointed--we are so lucky to have Spice Jar in the neighborhood. My favorite is the veg spicy miso ramen--perfect for a stuffy nose :). That said, I think the menu overpromises what arrives. \n\nSERVICE: SO friendly. You come back just for the people! \n\nAMBIANCE: Prime date spot. Cozy, adorable, and fun to people and art watch.", "author": "Helen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Cute little pan-Asian restaurant on the corner of 23rd and Bryant that is a perfect place for a reasonably priced lunch. The place is little that can get pretty packed. Seating may also be communal.\n\nThe Zen Noodle soup was delicious. It was a coconut/samal based broth with an assortment of seafood that was sweet and tangy. The tonkatsu ramen was also amazing with the meat falling right off the bone. Definitely a must try!", "author": "Swan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "I think the main draw of this place is the interior decoration. The restaurant interior is very cute with marble and wooden tables, exposed hanging bulbs, and tree branches! \n\nThe food is presented well and tastes good but is not great. I got the tonkotsu-shoyu ramen. It didn't leave an impression.", "author": "Rica Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "We LOVE this place. The food is wonderful and always fresh. It's Japanese comfort food. The staff is delightful too. We love the shu my , edemame and garlic wok noodles.  Solid sake selection as well. Solid, good, fresh and freindly is how we feel about this place", "author": "M. R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Shumai - 3/5\nHar gau - 4/5\nKaraage - 4/5\nPork bao - 3/5\nPortobello tempura - 4/5 - Unique. Truffle salt.\nFries - 2/5\nMongolian beef - 3/5\nTonkotsu ramen - 3/5\nSesame ramen - 4/5\n\nOverall, \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "Food was alright in my opinion. Maybe because I had high expectations from the past reviews. There were soo many flies inside the restaurant which wasn't nice either. Won't be coming back sadly!", "author": "Shanzay H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-25", "description": "After seeing great review on yelp, i placed my first order. I called ahead for my order, and got there 30 minutes later, just to find out they haven't even made the food! They hurried up made the noodle, and I left. Got back to my office opened up my Tonkotsu-Shoyu Ramen, the supposedly \"braised\" spare rib was so dried up, it's not even chewable. Very disappointing!", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "This is a gem a little out of the way of the core shenanigans in the Mission. \n\nThe restaurant is on the smaller side -- definitely recommend going towards the early end of dinner service to avoid the wait. Also dog friendly if outdoor seating is open!\n\nI tried the Kara Age, Seaweed Salad, Garlic aonori fries, and Laksa, all of which are fantastic. \n\nIt's like my life's purpose to identify chill, unpretentious places to eat where you can bring your friends, baes, whomever at any time and Spice Jar definitely fits the bill!!", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Yeah, these two (husband and wife?) are a welcome addition to the neighborhood.  I live around the corner from Spice Jar and eat here often. Great quality food, reasonable prices,  and the service is impeccable!\n\nI came here after a few weeks from visiting before with some friends and the waiter remembered the orders of all 3 people from the time before!  Wow.  \n\nThe food is amazing and I would eat here every day if I could.", "author": "Gabe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "I'm not one for Asian food in hipster areas but this place was surprisingly good!\nLocated in an up and coming area on the less busy Bryant Street in the Mission District is this cute and intimate spot. It's a bit cramped in here so not the best place for a big group. Can look like it's filling up quickly but the turnaround seems fast. Also a lot of take-out orders too so the kitchen is a bit slow.. a good 6 workers or so for this restaurant which can only fit probably like 25-30 people.... but the wait for your food will be worth it, I promise.\n\nThe workers are all extremely friendly but service may be a bit absent as they ARE busy - responsive when called though.\n\nMe and my friend tried quite a few items between the two of us and the only dish I would NOT recommend is the calamari salad.\n\nSpare rib bao - as many have stated, it comes as just one meaty rib still on the bone. I was scared it was going to be a bit messy but it was literally fall off the bone tender. Definitely one of the most tender ribs I've had. It was flavored thoroughly! The pickled cucumbers were thickly and roughly chopped, I wish it was cut more thinly, slightly more acidic, and less sweet. Still a very good appetizer - I just wish it came with 2 ribs :(\n\nChicken kara age (not on the online menu) - YASSSSSSS. Crispy (and stayed crispy) and perfectly seasoned. Lightly battered and came with 8-10 decent sized pieces. Would be perfect with beer.\n\nCrispy calamari salad - judging from how crispy and delicious the chicken was, I thought it would be the same for the calamari.. The calamari was soggy and didn't taste seasoned :/ The calamari ratio was about 3:1 with the greens, which would normally be a good thing, but it just wasn't GOOD. The red curry honey dressing was pretty nonexistent - kind of like a really watery honey with some spice - I don't think it complimented the salad.\n\nZen noodle soup - I don't usually like noodle soups with seafood because I don't like sea-foody tasting broths - but this was delicious! Very light tasting broth, delicate coconut flavor and just very, very slightly sour and hot. So good! I could eat a million bowls of these. Came with a good portion of shrimp, mussels and calamari. I wish it came with more noodles!\n\nOverall, very solid Asian fusion place. Would love to return to try their ramens and would DEFINITELY get the bao and kara age again :)", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "Small but great. The seven spiced salmon is very tasty and fresh.", "author": "Elmar P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "OMG SPICE JAR I LOVE YOU!!!\n\nJust kidding, this place is terrible and everything is covered in cockroaches, the food actually is cockroaches....just just don't come her, you'd hate it.", "author": "Shalaco W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-29", "description": "3.5\n\nVery cute asian restaurant at the corner of 23rd and Bryant. When we arrived for lunch on a Fri afternoon, the restaurant (albeit very limited seating and space) was completely packed. We opted to sit outside and brave the wind. Unfortunately, they do not serve hot sake but have plenty of cold sake to choose from. \n\nStarted with a mint tea, shumai and garlic green beans. Tea and green beans were delicious! Shumai was a bit flavorless and I had to drench mine in a bit of soy sauce.\n\nNext came the entree - TONKOTSU-SHOYU RAMEN!!\nRamen and broth were delicious!! The egg was average. The pork sparerib was a huge portion and very tender, but not too much flavor. \n\nService was very good and prompt (except for forgetting to bring us some chili paste for the ramen when we first asked). \n\nWould love to come back and try some other dishes. I was pretty thirsty after the meal which usually indicates a lot of sodium and/or MSG in the meal :(\n\nLove that they store utensils and napkins at the table in empty tins of Cafe Du Monde coffee!!", "author": "Yin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "The Spice Jar was an accidental discovery trying to find dinner in San Francisco, and accidents don't have to be a bad thing.\n\nTagged as \"Asian Comfort Food,\" you would ordinarily expect the most kitsch-y thing ever, something like a cross of P.F. Chang's and Roscoe's. The Spice Jar is not that at all. Rather, it's more of a nice family owned restaurant, and it has a really nice vibe. It's both trendy yet somehow rather comforting.\n\nMost of the items on the menu are pretty solid - I will note that beef anything is really good. I will note that with all trendy restaurants, portion sizes leave a bit to be desired. You won't be stuffed here, that's for sure, but you could be amply full if you choose the right items.\n\nProbably the most interesting thing here is the 1L Asahi (actually something like 0.946 liters). That thing is massive and is good to share or even have alone.\n\nWhat I found really nice about the restaurant is the size of the kitchen and the service. You see their vast menu, you see their tiny kitchen, you see the workers running around everywhere, and you really feel the effort and care in what they're doing. It's amazing what they can accomplish with a kitchen that small.\n\nI'd definitely come here again.\n\nTIP: Get the Asahi.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "This weekend, we ventured out to another unfamiliar neighborhood to try out some new food. Through yelp, we found \"The Spice Jar.\" Normally, I try to stay away from places that have too many cuisines going on at the same time. This restaurant serves Japanese, Vietnamese, Korean, Chinese and Italian(?). However, this place has raving reviews and yelpers suggested to try everything on the menu. Sure enough, this restaurant lives up to all the great reviews. The food didn't disappoint, especially the Albacore carpaccio and tonkatsu ramen. In fact, I think this is one of the best ramen I've had in the city. The chef came and asked us about the food. I later found out the chef is the owner of the restaurant. He traveled all over Asia and picked out the best represented dish from each country.  What amazing talent to replicate the different cuisines and make it his own.\n\nWe all had a great experience here. Great food, friendly service, and cozy atmosphere. We'd definitely come back to try out their other dishes.", "author": "Em T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-06", "description": "*** In Short ***\n\nOkay Asian food, seasoned and catered to an American (a.k.a. heavier) palate. \n\n*** In Depth ***\n\nWhat's a guy to do when he loves Asian food, has tried most of what Chinatown has to offer countless times, but is too lazy to trek out to Sunset or Richmond? Check out the Mission, of course! Coming with two other friends who weren't particularly hungry (and myself as a light eater), we only ordered a handful of dishes:\n\n* Shu Mai - Definitely not your traditional dim sum style shu mai. The ones at Spice Jar are much larger and sweeter, with wonton skin that was oddly papery/gritty in texture, none of which made for a super desirable dish.\n\n* Braised Short Rib Bao - If you're perplexed by why you only get one per order, it's because these are also likely to be larger than you expected. Super tender and flavorful short rib, but, be it the meat or the other sauces, the bao ended up also being too sweet. \n\n* Spicy Sesame Miso Ramen - Definitely the most solid and tasty dish of the three, with nice springy noodles, albeit a bit plain overall in terms of toppings and accoutrements. \n\nIf you're in the area and have a hankering for Asian, this certainly isn't terrible, but trekking a little into Chinatown goes a long way.\n\n***Accessibility Info***\n\nVenue - There's a large single step/platform to get into the restaurant, so we opted to sit outside instead, which was marginally more accessible, because the way the table legs were positioned made scooting under impossible. I didn't look closely enough at the accessibility of the inside, for those who feel like braving the step (it's really not that bad).\n\nBathroom - Didn't try.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Went 100% vegetarian this time around and I was pleasantly. Limited menu, but I'm not complaining. The Spinach & Roasted Garlic Fried Rice was extremely flavorful and so was the Spicy Sesame Miso Ramen, which we got the spicy version of. Overall, great experience and I'll be back to try some of the meat offerings!\n\nAmbience is nice and cosy...went here on a Friday night around 8 and had a 20min wait, which is great for SF. \n\nCan't wait to be back!", "author": "Jardin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "I generally love this place, but I got super annoyed after going there last night. It was my fourth time there and I ordered a soup with rice noodles (that I've had three times before). The noodles were super underdone and hard to the point that it really sort of ruined the soup. I told my waiter and asked him for some noodles cooked the right way (I didn't want to go through sending the entire dish back, because the rest of it was OK). \n\nI got annoyed when I saw our waiter going back to talk to the cook, them looking at me and the cook obviously saying that the noodles were cooked just fine. When the waiter came back, he told me, \"He said if he cooks the noodles any more they'll break.\" \n\nCome on, dude. Why treat me like an idiot? Why not just bring me new noodles and ask me \"Are these better?\" when I'm spending $100 on dinner with my family? \n\nI told the waiter that I'd had this dish three times in the last year (it's normally my favorite). I really didn't like his insinuation that I don't know how noodles should taste or that the cook couldn't have made an error. \n\nAlso, the one time we asked for a side of stir-fried vegetables here (because nothing else we ordered was green), there was really no effort put in. They seemed like broccoli and carrot leftover bits that were just steamed and thrown on to a plate. With slightly better training of cooks and staff, and a little more consideration, I would give this place 4-5 stars. Their food is generally delicious.", "author": "Breena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Sooo good 100% recommend. We had sea weed salad, portobello tempura, green curry tofu and Laska.", "author": "Nelly P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "Cute wittle restaurant in the middle of the Mission neighborhood. Indoor and outdoor seating. Adorable, nature-y decor.\n\nI think the best thing about this place is the service. Everyone is so happy and helpful! One time I called in a togo order and didn't know that the haw gaw (shrimp dumpling) was only for dinner but before I could even say that it's ok, the lady immediately told me to hold on for a sec to see if the chef could make it for me. And of course being so kind, the chef said sure. To go out of their way like that was so appreciated. All the other times I have gone into The Spice Jar, the service is amazing. \n\nFOOD:\n-Aonori garlic fries are the best! Packed with flavor but not overly salty. Perfection.\n-The haw gaw skin is overwhelmingly thick and not thin like dimsum places. Probably wouldn't get again.\n-The shu mai is pretty good for not being a dimsum spot. Big pieces!\n-The chicken pho tastes clean and the self-added ingredients are fresh.\n-The tonkatsu ramen has a delicious broth, but the egg is a fully cooked hard boiled egg. Wish it was soft boiled like the menu reads.\n-If you enjoy the taste of mint, the Spice Jar fried rice would be your thang. It tastes pretty heavy on the mint side. The portion is huge, and they don't skimp out on the shrimp and chicken. A good dish to share!\n-My friend's favorite is the laksa. Heard it is a popular item, but I have yet to personally try it.\n\nThis place has been my new favorite place to go for lunch. Must try!", "author": "Denise L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-19", "description": "The Mongolian Beef is what you'd expect and tasty, but I think overpriced compared to what you could get at other asian restaurants. The Spicy Sesame Ramen was decent. My favorite was the Crispy Calamari Salad, but I don't know if I loved it enough to go back just for that item. I'd maybe return when I have more money to spare! :P", "author": "Vicky P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "Super rich, super tasty East Asian comfort food.  Nothing healthy about this joint but ingredients are fresh and the flavor is on fleek.\n\nThe menu is fairly compact but in a very good way, a diversity of choices but no decision anxiety from a multi-page menu.  We started with the pork Shu-Mai which were solid, very well prepared but not epic.  Same for the crispy spring roll, they were a bit pedestrian.  The mains and sides were the 4-star caliber dishes: we went with the Spinach and Roasted Garlic Fried Rice (strong in flavor, only for garlic lovers), the Mongolian Chicken which was super savory and a tad too rich but overall pretty epic in flavor, and the garlic green beans which had the right balance of garlic and sweetness and salt were also the bom dot com.  \n\nService was friendly but the dishes were staggered in an non-ideal way, apps came out together but then there was about a 20 min wait after we finished those before our first entree came out (the fried rice), and then another 10 mins before the other two dishes (chicken and green beans) came out.", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "The Spice Jar is a relatively new Asian spot in the Mission, bringing homey comfort food from all different Asian cuisines. I wouldn't exactly call it fusion because they somehow bring in distinct flavors from each culture in an authentic way. My boyfriend and I came in on a Tuesday, and ended up waiting almost half an hour for a table, which goes to show just how popular it is. We started with the chicken lettuce wraps, a simple dish but full of flavor. I loved the addition of the mushroom with the minced chicken, helping to cut the natural saltiness of the dish. We also tried the har gao, which was definitely on the doughier side but great in terms of portion size. \n\nFor entrees, we had the tonkatsu ramen and the Spice Jar fried rice. The flavor of the ramen broth was amazing as it tasted like the pork had been stewing for hours. The fried rice was generous in shrimp and chicken portions, but definitely a little too salty for me. Overall, it tasted as close to home-cooked as you can get from a restaurant in the city!", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "I have been here twice. For dinner and lunch service. When I first stumbled upon this place about two months ago via Yelp I couldn't be more excited to check out an Asian cuisine in the Mission. \n\nFirst time I came for dinner. Ordered: \nshu Mai, spare rib bao and homemade tofu. Previous review I read saying the tofu was a must order. It was just okay to me. The wasabi salt was a nice touch though. Really enjoyed the \"fall of the bone\" spare rib bao and the shu Mai. Don't forget to try the Buddha beer! \n\nAnother visit for lunch ordered the Zen noodle soup (order was split with a friend) and the har gow. The spices in the soup were on point! The serving was just right for a lunch portion not leaving us overly stuffed. And don't pass up the ginger mint lemonade. Im weary about anything ginger. That too much gingery taste but it was the perfect blend. So good! \n\nDon't expect your authentic Asian cuisine here. It's Asian fusion and my kind of Asian Comfort food especially because of all the spices and flavors.  (I am Asian, well Filipino.  Authentic Chinese is my least craved food. I'd rather have Panda Express lol)   Look forward to returning and trying more dishes.", "author": "Erica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "I'm usually quite wary of Asian \"fusion\" restaurants, as it seems to cater towards a crowd unused to specific cuisines. The interior design is very cosy, country home; while adorable, it almost reinforced my expectation of an underwhelming experience, due to cognitive dissonance. That being said, The Spice Jar pleasantly surprised me. I sampled an assortment of dishes and enjoyed all of them.\n\nI started with the Crispy Calamari Salad--a generous portion of fresh greens, topped with delicious, lightly breaded calamari and red honey curry dressing. The little critters were crisped perfectly and didn't overpower or wilt the salad leaves.\n\nI ordered the Tonkotsu-Shoyu Ramen next, and also loved it. I'm used to eating delicious ramen at food trucks, but this was truly a treat. The rib was fall-off-the-bone tender, and the broth was flavorful and substantial without being too salty. The noodles were cooked just right, with a bit of bite to them. The hard boiled egg was done just right too. \n\nThe couple who owns the restaurant are truly charming and wonderful. I've eaten here a few different times, and in recognizing me, they brought some Aonori Garlic Fries on the house. Yum! I was happy to see, upon my more recent visit, that they'd hired some wait staff. I can't imagine how insane opening weeks must have been with just the two of them doing all of the work--from cooking, to waiting on tables, busing, etc. \n\nThe interior design is worth mentioning again, because it is so unexpectedly adorable. The bottom of tables are adorned with material that feels like mattress topper--it prevents you from bruising yourself while shifting your legs. I almost want all the restaurants I go to to adopt this methodology. I'm so clumsy, it definitely saved me on multiple occasions.\n\nDefinitely eat here.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "When I first drove by The Spice Jar, I really thought it was going to be a specialty spice shop! After a quick search on yelp, I was wrong! YAY! Nothing against spice shops, but I rather eat than cook! HA! We arrived a little before 5:30pm (on a Thursday), no wait & no need to write our name on the waiting list! It was even sweet how the owner took the time to talk to us before the place quickly filled up! :) \n\nOur Dinner:\n1.) Crispy Spring Roll Fair  \n2.) Edamame Hummus Tasty! \n3.) Har Gow (pork dumpling) Yum\n4.) Shu Mai (shrimp dumpling) Good!\n5.) Spare Ribs Bao Good! Should be called spare rib singular no \"s\") since you only get one.\n6.) Spinach & Garlic Rice Unique\n7.) Zen Noodle Soup (Coconut based sambal broth, calamari, shrimp & black mussel YUM\n\nOur complete meal for 2 people (before tax) was only $27 each! Not bad at all!! Staff was friendly, checked in on us & kept our waters full! Will return to try the tonkatsu ramen, portobello tempura with truffle salt & Mongolian beef! I hope to see more mission locals here because the owners is so nice!!", "author": "Geraldine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Family owned sweet lunch spot in the mission. Super fresh food and many options. It's definitely not classic assign food of any sorts but it's really delicious. Our favorites are their seaweed salad, spicy miss ramen, Mongolian beef and calamari salad.", "author": "Maya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Really enjoyed my meal here, versatile menu from Dumplings to ramen to delicious hanger steak. Good selection of Small plates for sharing, and main meals are definitely large enough to share. Everything I tried was very tasty, busy place but the service still remained attentive and friendly. I will be returning to try more.", "author": "Nadia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Really cute neighborhood restaurant with interesting menu.  The calamari salad is huge and the standout dish on the menu.  Other options are fine but not worth going out of your way for.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Yummy! Came here on a Sunday and the wait was not too bad. For our party of 4, we waited about 15 min. \n\nThe location is very tiny so think ahead if you are planning on coming with a big party. The decor was very nice and cute. The staff was great. They were very attentive and friendly.\n\nMy party and I ordered a bunch of small bites and couple main dishes and everything was tasty! I especially liked the garlic fried rice and Mongolian lamb. \n\nOverall I will definitely recommend!", "author": "Arda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "The place was super cute, the vibe is great. \n\nIt's starts out like this... a vegetarian, 2 vegans, and a normal guy enter a restaurant and order: \n\n- portobella mushroom tempura: one of my favorite dishes of the night, comes with a lime for a nice hit of acidity. well balanced, crispy and meaty. \n- vegetable gyoza: really good, but fried for those of you that care. They may have been the ones from Trader Joe's, but they're still good.\n- Homemade tofu: it's not for everyone, and not what most people expect. It's much silkier, and soft. The flavor's a bit deeper, almost like you might imagine plaster might taste (but in a good way?)\n\n- roti w/ curry (aka roti prata). delicious. I don't know anyone who's messed up this dish, given that it's flaky layers of butter + curry. \n\n- garlic noodles (I didn't try this)\n- veggie ramens. peanutty flavor and pretty good. the ramen itself is fresh and great, the broth is much better than most do with a veg broth. \n\nOverall, a good space, reasonably priced. I'd be open to going back, but I wouldn't initiate.", "author": "Dimple B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "I've been here 3 times now and some my favorites include the Laksa, miso ramen, and the seaweed salad (actually seaweed mixed with a giant bowl of greens). Nothing that I've had here is conventional-- the laksa is surprisingly thick, the calamari on the calamari salad is super thinly sliced/tough, and the shrimp dumplings (ha gow) have too much dough (which makes the dumplings bigger than usual and awkwardly sexual looking when you try to lift one up :). ) \n\nDespite my reservations, though, I'll be back because I cannot help liking the couple that owns this spot. I feel like I'm eating at my aunt's house.. sometimes the food lacks precision but whatever! Your aunt made it, and how dare we criticize her cooking! It's more than tasty enough for me to revisit since I live nearby. This spot merits the title Locals Corner (the name of Spice Jar's predecessor) way more than that place ever did!", "author": "Jean L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Some of the fastest service I've had in any asian style restaurant. Dishes were delicious, the portions were definitely trending on the larger style.", "author": "Lucy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "I love this place . its a ma and pa style restaurant where they cook everything in house . its a bit of asian fusion , but done very very well . a bit of dim sum , traditional Japanese and Chinese dishes .. and some great desserts and wine . Very friendly staff .. Must try is the Pho Ga chicken noodle soup and the Shu Mei with home made mustard sauce !!! only wish they made soup dumplings .. then it would be the perfect restaurant", "author": "Micah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-17", "description": "ahh! i've had this spot bookmarked for a while now, and am really glad to try it last night! came in with a friend for small quick bites before seeing a show down the street - the place was really popular for a wednesday night!  pretty good location too! \n\nrestaurant is pretty small with a long communal table and maybe 5-6 surrounding 2-4 tops. we were seated at the end of the communal space, which was perfect.  we shared: hummus, pork rib bao, laksa, and mushroom tempura. everything was pretty yum - my fave (as expected) was the pork rib bao!  really good flavor and super tender - i just wish that the bao wasnt as huge (i prefer a high meat to carb ratio...my pseudo low carb diet!). laksa was pretty nomsies - great flavor and good chewiness on the noodles.  the mushroom tempura i probably could have done without - lacking saltiness (my friend dipped them in laksa broth) and was a bit soggy.. and i didnt even get to try the hummus because my friend devoured the entire thing!\n\ni would totally come back for the other items on the menu - notably the karaage and ramen! the service was super fast and friendly - you can tell its a family business and theyre very very courteous!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "We love this place for lunch. The food we tried so far tastes great. We get the calamari salad, laksa and fries quite often and they never let us down. Service is very kids friendly.", "author": "Dr. Cordula K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "The Spice Jar offers favs from many asian countries. no banh mi, baos, nor sammies though..\nseating is a communal table, 6 tables seating 2, and a bench facing window seating 3.\n\neats: pho ga(9)\n-light herbal broth with faint chicken flavor, no msg tasted. \n-chicken schreds dry, tasteless\n-sure there was noodles, not enough to notice.\n\n-chicken kaarange Nanban(7)\n 8 pieces fried, dry, not juicy, fresh though\ncame with a dip that didn't improve the chicken, taste too subtle?\n\nfoodnotes:\n-food definitely made to order, 20 minutes before it arrived\n-never got water, never was asked. noticed all other tables got water\ndoing my part to deal with the drought, didn't ask for water, just drank the soup\n-smelled the curry on next table, very potent!\nmaybe the tonkotsu ramen would have been a better.choice.\n3.5 stars", "author": "Victor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "Definitely an interesting restaurant, first in an out of the way location, definitely an Uber ride if you are staying in downtown SF which I was.  The place is small and they have an open seating model meaning we were sat literally at a big table right next to others, always a strange dining experience.  We arrived at 7:30pm and the place was jammed! Had to wait about 15 for a table!  For an app we had the homemade Tofu and vegetable gyoza.  The Tofu was interesting almost comes out as a fondu, not what we were expecting but not bad, not great! The vegetable Gyoza was good! For my entree I had the Mongorian chicken.  It was good not great.  Overall a decent restaurant, cool atmosphere but tight and strange seating.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "I favourite place in all of mission. Lovely service by lovely people and he food is always to die for. Thank you for many great meals!", "author": "Rina J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "First official day of business for The Spice Jar yesterday...\n\nMr. J and I went to check them out last night.  We were lucky that our wait wasn't too long, 15-20 minutes top.  But, they were definitely busy for a first day.\n\nAfter some pick and choose, we got the followings:\n\nHar Gow - The skin texture was wrong.  It tasted like mochi or Korean rice cakes.\n\nBraised Spare Ribs Bao - The meat was a little dry and the bao itself was not great.\n\nHomemade Tofu - This was not the silky kind we thought it would be.  The texture was more dense and firm.  This could be more of a personal preference thing.  The wasabi salt that came with it was a good idea, but you can't really taste the wasabi part though.\n\nGarlic Green Beans - The beans were a little mushy.\n\nTonkotsu-Shoyu Ramen - Mr. J and I thought the ramen was not bad.  But, we both think a good ramen still need some good chashu to go with it.\n\nLaksa - I am always searching for a good laksa.  This is probably not your most authentic laksa, but it is so far my favorite in the Bay Area.  The soup was not as thick and heavy as most of them out there and it got a little kick to it.  I pretty much down the whole bowl.\n\nCoffee Panna Cotta/Jello - We were lucky to try this not on the menu yet dessert.  It was delicious!  A little less in portion size and add some fresh seasonal fruits on top would make it even better.\n\nI'd come back just for the Laksa!  And, maybe try some more items on the menu.  Will try to stay away from the more \"Chinese-ish\" dishes though.  We had better and probably have a higher standard since we are Chinese.", "author": "Kay Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Fucking amazing! Food is so good and fresh. Seaweed salad, beef mushu, drinks and more. Such a great place! Service was good and atmosphere is a bit loud but great.", "author": "Danny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "We stumbled into this gem one late night after watching a show from the Victoria Theatre 2 yrs ago. We've been hooked since then. We try to drop by whenever we're in San Francisco. Our favorite dishes are the Laksa and the Calamari salad. I highly recommend this place!", "author": "Evelyn J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "What can I say? This place is delicious and the people are super friendly. I had the Laksa (a Chinese & Malay combo; this is not trendy \"Asian fusion\" it's diaspora food, people!) and really enjoyed it. The space is small, but the decor is really nice and it fills a gap in the culinary offerings in this area. Also, it's a short walk from my cousin's place, a great addition to the neighborhood. I'm a fan.\n\nFyi, kitchen closes at 9:45pm", "author": "Cassidy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "This side of the mission has been Long overdue for a place like this. I'm really a sucker for Ramen so I ordered the Tonkatsu Ramen that immediately blew me away. I also had Beer on tap and they have really good wine list. Although I didn't have any wine. This spot is family and neighborhood friendly. I'm happy these guys are here. Lunch is noon-2:30 and then dinner is 5:30-?   \n\nNow I'm going to go take a nap.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "The Spice Jar is just the right establishment The Mission has been missing. When you think Asian food, you wouldn't normally hit up this area that's for sure.\n\nThis restaurant opened a little over month ago now (June 30th) and I can foresee it becoming much more popular in the future. We ordered a bunch of dishes to try and everything was solid.\n\nWe started out with the Albacore Carpaccio, definitely a MUST-TRY for raw fish lovers. The fish was fresh and lightly covered in a house-made sauce with fried onions and small jalapenos on top. Each bite was amazing. Then we moved onto the Calamari Salad which lacked dressing but fear not...just ask them for dressing on the side, they're quite accommodating! I thought the fried calamari was cooked well and added a great crunchy texture to the salad. \n\nWe also got their Braised Spare Ribs Bao which is not the best bao I've ever had but it was pretty good nonetheless. Note that you'll have to slide the meat off the bones yourself before eating it in the bao but it does come right off pretty easily. It's said that they slow cook it for 5 hours. Our last dish was the Chicken Green Curry and it was quite tasty with a spicy kick. The curry came with eggplants and small cherry tomatoes which I found a bit different from the usual recipe but I found it refreshing. For drinks we ordered their Mint Ginger Basil Lemonade and we both really liked it.\n\nMy goal is to come back and try everything else real soon.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Finally, a great and AFFORDABLE restaurant in my hood! The menu is a mix of cuisines from various Asian countries (Japanese, Chinese, Thai.. maybe even more), and each dish is done very well. We loved the fried calamari salad and the chicken nanban karaage. Even the Thai green curry was pretty delicious. The only minor issue we had was our tonkotsu ramen -- the broth was definitely milky and porky, but it needed just a little more salt. Still, though, think of it as a \"lighter\" broth and it was still good.\n\nI'll definitely be back, especially since it's so close to where I live!", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Pros:  great tasting food, bountiful servings and exceptional value for your money spent. I recommend the Mongolian Beef dish.  \n\nCons: limited seating, no reservations, extremely limited parking options nearby.  \n\nTake Uber or Lyft to this neighborhood gem and avoid the parking hassle. Enjoy a nice brew while you wait for a table.  Finally, enjoy one of SF's hidden gems.", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Adding another star because I come here quite often and have had way better experiences than my original. I still would not recommend the calamari salad, but would recommend the green curry or their poke bowl or the beef bowl. I think about their green curry sometimes. The food here is very fresh and made with care. The husband and wife ( I'm guessing ?) that run the Spice Jar are so sweet and will guarantee great service. Another thing about the Spice Jar that I love is that they offer brown rice and cook it perfectly. I have yet to come for dinner, but I think it is the perfect place for lunch with a friend.", "author": "Isabella G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-26", "description": "Not bad neighborhood eatery.\n\nFinding a spot +'s:\n+ Fried rice $9 with spinach/egg/garlic or the spicy version $9 work. We had the latter and I enjoyed it.\n+ Decor is basic and unfanciful.\n+ Service was super friendly and nice.\n\nFinding another spot -'s:\n- Tonkatsu ramen for $12 doesn't stack against Orenchi and Halu for nearly same price. The egg was not not seasoned or oozing with yolk. It was a hardboiled egg. Broth not flavorful but noodles were decent.\n- Har gow $5 is a hike in price because you're out here and there's no Chinese dim sum in sight. For that price and convenience I guess go for it if you must have it. Skin was thick.\n\nThink it's an A-OK spot if you live or visit the area. Just not worth a Lyft or Muni #27 ride.", "author": "Yiven C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Cute place. Definitely comfort food and nothing mind blowing. The spicy miso ramen was good. Ample meat in the lingo loan beef dish too.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "This is a fantastic place! The food is incredibly delicious and I say that as someone who has literally tried everything on the menu. The owners have brought an obvious passion for cooking and eating to their restaurant and are very friendly and humble about the wonderful food they create. The staff is attentive and welcoming. The price is quite reasonable and I have never once had a bad experience or left hungry. If I had to recommend a favorite I couldn't, just try it all. Spice Jar is easily one of my favorite restaurants. I drive up from redwood city once a week at least to eat here. Thanks for the wonderful experiences guys! Keep churning out the magic.\nFor those of you that don't like a wait time, eat the garbage you usually eat this is well worth the wait.", "author": "Void S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Spice jar is the most quaint restaurant in a really cute part of town. Serving the most delicious food. Everything on their menu is a must try from the rice to the laksa to the beef. You have to get their house made ginger lemonade, refreshing and delicious. Even though it's small and takes no reservation. The wait is never that long and the service is impeccable with a husband and wife running it together. Both very pleasant and kind. If you haven't been to this neighborhood gem , you have to go!", "author": "N J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-31", "description": "Wish I could give them more stars, but overall the food was tasty but nothing special. I do think the restaurant has a cute theme of popular comfort asian foods. \n\nFood: I got the Aonori French fries and tonkatsu ramen. Overall, the fries were pretty basic--couldn't really taste a big difference either Aonori (seaweed) on there. Think it could have been nice with a dash of salt sprinkled on top. The ramen was in all honestly pretty subpar if you are looking for an authentic bowl of ramen. However, it was still tasty and the rib meat was very tender. I would love to come back and try some of their other dishes and re-review this place \n\nService: For service alone, I would give this place 5 stars. They had one waitress who was serving everyone and she was very attentive and nice. Sometimes the cook in the kitchen would even come up front to help out, when things got busy. \n\nAtmosphere: super cute restaurant. Seating is a bit limited. It is a cute place to come with a friend or two for a relaxed meal or weekend brunch. They seem to have a pretty decent drink menu of options as well.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "Best ramen in SF, and the steak \"mushu\" is delicious.  They just added Vietnamese iced coffee to the menu and it's great, if a bit overpriced.  Mushroom lettuce wraps are also yummy.  I do wish they would add a few more items to their menu though! Efficient service and the food is always good!", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "Such wonderful service. Cute decor and the food is no frills and delicious. It is a small place so expect lines, but where in SF are there no lines?", "author": "Trisha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "The service here is super friendly.  The place is casual, clean, modern with an open kitchen.  Love their Fried Rice and also the Calamari Salad.  The calamari pieces are perfectly fried... one of the best Calamari dishes in the city.  So good!", "author": "Paul K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Came back recently again and got to try one of their specials, which was a poke bowl. The poke bowl included albacore, salmon, avocado, red onions, seaweed, their special sauces... and you can decide if you would like it with rice, salad, or 1/2 rice and 1/2 salad. I went the last option, so I can get some healthy greens and my carbs. \n\nBottomline: It's not as amazing as Southern CA poke bowls, but this was enough to satisfy my poke bowl cravings. I'd definitely order it again if it's on their specials!", "author": "Cassy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "It seems as though I can't get enough of this place. Everything about it is perfect. The atmosphere, location, the food and people are spot on. I absolutely love the calamari salad which I order every single time and the tonkotsu-shou ramen soup is heart warming. I've only tried the garlic edamame off the appetizer list and that truly is Asian comfort food. So good. Just go already :)", "author": "Victoria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "We went to this place because my cousin knew the owner when he was in LA.  Although off the beaten path, the restaurant is in a cute neighborhood. We were at the Timbuk2 warehouse and we walked over to the restaurant.  I had the miso ramen and nori fries.  They were great. The owner sent over the calarmi salad and fried rice.  Both were great and I don't think that I could have eaten another bite.  While I don't live in CA, if you are in the Bay Area, I would suggest that you make it a point to eat here.  You need to come right @ 11:30 when the open up to get a seat.", "author": "A.C. N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Yummy food, everything on the menu looks great. Would highly recommend the roti and curry appetizer", "author": "Emily A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "This palce is amazing. Expect a wait time of 20 min. I went with 5 of my friends and we ended up trying practically over 50% of the dinner menu. Every single thing that we ate was delicious. It's little oily but amazingly tasty. \nIt's difficult to find a table for 6 there as it's a very small place.\nA must try - the beans appetizer and Mongolian lamb", "author": "Akhil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-17", "description": "The service at The Spice Jar was absolutely incredible. Everyone is super friendly. I came here with a friend and we split the garlic fries and I ordered the vegetarian ramen and she ordered green curry. Their menu is quite diverse. \n\nGarlic Fries: 4/5 The garlic fries were amazing.\n\nVegetarian Ramen: 3/5 The ramen was not all that great (it was not traditional ramen). The consistency and taste of the noodles in the ramen was the one salvaging factor. Their tofu was very well cooked. \n\nAll of their entree sizes are huge. (2 people can definitely share an entree and it is served very hot)", "author": "Shilpa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-10", "description": "Being Asian, a foodie, and traveler to Asia, I know Asian food well. This place has a great vibe and excellent service. \n\nBut food needs a few key touch ups to meet essential Asian culinary standards.  \n\nWe had lettuce cups - flavor not bad but lacked the Fire of the Wok, the sizzle that comes from hot flames and wok tossing,\n\nHad their tonkatsu ramen, which was disappointing.  Soup was lukewarm and too salty. Noodles tasted like prepackaged ramen kits from a Japanese market. And the egg yolk was fully cooked - that's an abomination to the basic art of ramen. Yolks of the boiled egg should always be soft and gooey.\n\nWe also had their grilled skirt steak which came out on a sizzling platter. That was the best dish of the nite. Basically fajitas with an interesting creamy cilantro sauce.", "author": "J H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-14", "description": "My husband ate at this establishment on Saturday night with his buddy. The next morning he had food poisoning. Please stay away from their salmon dish.\n\nUsually I like to give new hip places a chance, but after seeing my husband suffering the last couple of days, no thank you.", "author": "Shelley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Found this spot by just walking around the neighborhood. The design/style caught my eye, especially the beautiful art/lighting piece in the center of the room. \n\nThe menu has so many things that all sounded appealing. We went for a few things and split them. Portions are BIG! \n\nThe Garlic Edamame was delicious but would only order if you want to share them between 3/4 people because it's a lot of edamame. \n\nThe Tonkatsu Ramen tasted really fresh. Love the rib that comes in it. The meat practically falls off the bone and adds to the broth.\n\nThe Mongolian Beef was tasty and nice to try it with bread - although I would have preferred it with rice. \n\nIt's a great find though. Go before a line of Mission Techies find it.", "author": "Stanley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "This is a great little restaurant serving up Asian curry's and other dishes. My fiance had the garlic noodles with chicken which was amazing. I had the green curry which was also really good (Spicy). It is always crowded and the food can take a while to come out, but if your not in a rush you won't be disappointed!", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-20", "description": "Although ambiance was original, the food was not as great as the pictures. Both entrees we ordered had barely any veggies. Think about this place as an upscale and over priced Chinese take out. I got to say, the plum wine was really good, as well as the braised short ribs. But the entree itself was not impressive at all.", "author": "Demi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Delicious, casual spot. I've enjoyed both their beef dishes and their soups. Also the wait isn't that long, especially when they allow you to order wine while you wait. One question though, is it just me or have the prices gone up a bit?", "author": "Erin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "By far, my favorite restaurant in San Francisco. Anytime I'm leaving the city for an extended period of time, I have to come here before I go. Everything is amazing, but we always have to get the Hangar Steak Wraps for sure.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "Average quality food, but efficient service.\nThe ramen was wasn't so flavorful and the tofu wasn't good either unfortunately.\nNice location and kind servers.\nThere is a big table to share with other customers. Too bad we ended up right next to a group of rude people, who wouldn't even slightly move to make room for us (they were occupying more than their designated area).", "author": "Barbara U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Good food but if you have the patience, wait for the table inside the restaurant. We ate outside and was approached by a homeless man begging for food. We fed him. Other than that, the food was really great. The Mongolian beef was deliciously tender, the Mushu Wrap was like a fajita and delicious. We also had the roti and curry appetizer, and also the Shrimp fried rice, also both delish!", "author": "P M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "A great neighborhood spot the only appreciable downside is its popularity- Expect to join those waiting on the corner for ten to twenty minutes. Everything I have had has been good with the with pork rib is awesome! The noodle dishes are The beer selection is more than adequate. The price point is very reasonable you and a date can enjoy a starter and mains with beers for around $50. Maybe there will even be leftovers!\n\nI look forward to returning!", "author": "Evin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "So glad a good restaurant moved into this spot! Had the shrimp dumplings (Shu Mai), tempora portabella mushrooms, and the tonkotsu ramen. \n\nService was a bit slow, and you could tell they had a very very new dude helping the floor, but the main waitress Naoko was friendly and helpful, and always had a smile on her face.  \n\nLOVED THE RAMEN, and the portabella tempora was delicious. Not a big fan of the shrimp dumplings myself, but my husband dug them, so two outta three ain't bad at all! Thank you spice jar for filling our bellies with delicious, perfectly spiced and seasoned food! Welcome to the neighborhood!", "author": "Cake S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-08", "description": "This, sir, is no laksa. It tastes like little more than curry powder and coconut milk, some overcooked noodles, sad tofu (not tofu puffs, mind you, just the same dried out fried tofu cubes that come in the green curry tofu), sadder beansprouts, cilantro, and shrimp. No sweetness, no sourness, no shrimp paste. Where where other laksa accessories, like lime wedges, hardboiled eggs, more herb variety, fried shallots, fish balls, chili paste, or long beans? Even one of those would have helped this beige bowl. If you only care about quantity, you'll be satisfied since it was a quart of it.\n\nThis was not the only disappointing dish we ordered, but it was the burden in my bowl.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Calamari salad, beer and spices chicken miso soup with an extra side of noodles. Can't go wrong with this new place. Owners are also super awesome from Pasadena.", "author": "Rob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "This place is so delicious! It's only been open for a few months and is located in the Mission just a few blocks from where I live. Soups, noodles, rice dishes and more-- this place is fantastic! The food is spiced perfectly, full of flavor and prepared made to order. I am a vegetarian and requested the Laksa coconut curry soup without the shrimp or chicken. I got to say, it's probably the tastiest Asian soup (ramen-esque) I've ever had the pleasure of eating.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "This place is the best! It's an adorable hidden gem in a quiet spot in the mission. Super friendly staff, great ambiance in the tiny space. Get there early to get a table since there aren't many. \n\nI would eat the crispy calamari salad every day if I could. It's huge and delicious. So so good. You won't regret it. The curry is also fantastic.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-06", "description": "They do many things,  and none of them well.   I love laksa.  If you've eaten here and thought this was laksa, please stop.   Please.   It tasted like curry powder in some store bought paste.  And the wrong noodle people.  Gah.  The green curry was average.  The dumplings non memorable.   Even if the wait wasn't 1 hour I wouldn't be back.   The staff was nice even though overwhelmed running their shop.  \n\nIf you want a green curry,  go to Basil Thai.  If you want a hybrid Asian place,  Noodle Theory is pretty much what this place is trying to mimic (and not doing it well).  You can probably make the food they're serving here at home with minimal effort.  Trust me.", "author": "A A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "It is awesome!  Please disregard all other reviews.  Since they have opened I have been 10+ times, some times they have an off night but over all it is amazing.  \n\nIt is our go to place to bring friends who are in town.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "While visiting from LA my wife and I try to seek out restaurants and new experiences while in the Bay area. The Spice Jar is definately worth a visit. It feels like a good date place. Not a date where you're trying to spend alot of money but one where it's two down to earth people wanting good food and conversation. Parking is sparse and the restaurant is small. In my opinion it being small gives it charm.  It's more down home then hipster with a diy light fixture giving off soft light to compliment the decor that's chill yet urban. \n\nThe food was delicious. My wife ordered ramen. She loved the flavor but questioned the texture. Not in a bad way, but just comparing it to other places. She ate it  all. I had mongolian beef. It comes with bread to make a little sandwich but I think I would have enjoyed it more with just the tradition white rice. My cousin ordered the Pho. We all cleaned our plates.\n\nThe service was great. They were nice and attentive. The food wasnt too expensive about $20 a person depending on the entree and drink obviously. All in all it was a good experience for Asian comfort food.", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "After seeing the menu I was very excited to try this place. Unfortunately the food largely lacked in flavor and nothing wow-ed us. The noodle dish was very greasy. \nI love this style of Asian food but frankly it fell flat.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-20", "description": "The food was great, and came in large portions with reasonable prices.  I would particularly recommend the laska, the roti, and the calamari salad.\n\nHowever, I don't think I'd go back as it was SO LOUD.  THE LOUDEST.  Being at the communal table in the seat closest to the kitchen surely didn't help, but it's a very small restaurant so it was probably almost as loud everywhere.  We actually pulled out a decibel meter app on the phone and found that the noise hovered between 75-80dB.  It was overwhelming and I wasn't able to hear the person sitting across from me.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "spice jar has become a go-to favorite at least once a week!! the food is off the hook! i'd say it's a mix of japanese and thai - staff/owners are more than friendly, attentive and kind.  if you're a vegetarian, there are TONS of options and all are delicious.  garlic edamame, veggie gyoza, tofu steak w veggies and the green curry w tofu is perfect and more than enough for two!! though you better get there early to put your name down on the list.  they do not take reservations and if you get there after 6:30 pm you'll be waiting at least 30-45 minutes for a table.  i'd eat at spice jar every night if i could!! thank you spice jar.  i am grateful you're in the neighborhood :)", "author": "Nicki B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "What a charming little place. The food and ambience is absolutely fantastic. I had the seafood fondue, and it was delicious. The jalepeno plum wine is so good too!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-12", "description": "Well,  my experience here was a little funny. Spice Jar is located in a space that is NOT plus size friendly. So if you are a curvy person wait for a table by the door and sit with your back to window. IJS. Some of he dishes are almost served like Tapas, especially the 6 hour braised short rib, very short. the fries are crunchy, Meh. My favorite things were the Shumai and The Ramen ( which I pilfered from my friend's bowl LOL).", "author": "Lydia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "Came in at 9:10pm on a Wednesday night and crowd was poppin! Your typical hipster crowd in the Mission at this Asian themed joint run by what appears to be a a lovely Japanese couple.\n\nI love the fact that this place is around the corner from me, and the flavors are tasty...but they aren't out of this world. I had the tonkatsu-shoyu ramen and he had the fried rice. Both were solid meals. However, as an Asian duo, we've both had better at several other places. \n\nThis is a good place to take someone who is a picky eater though and likes clean places, as the flavors cater to a palate that isn't too used to ethnic flavors and the restaurant is spotless.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "I have recently discovered my new local in SF. whenever I'm around the neighborhood i feel inclined to head over here. They don't have the largest menu around, but it is ample enough to feed 6 picky eaters including vegan, gluten free and carnivores. \n\nMy go to's are the garlic spinach fried rice and their garlic noodles that are perfect in every way.\n\nCheck it out but get there early or have a small wait. They have limited seating, but I haven't had to wait too long to get served and when it's nice outside, their outdoor seating is open.", "author": "Sally S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "I came here with a group of 4 on a Tuesday night. They do not take reservations, but we got there around 7:30pm and there weren't any names on the list yet (though the inside was already full). It was incredibly nice out so we asked to be sat outside. They have a few tables they placed on the sidewalk outside and it was perfect. They were able to sit all four of us immediately out there. \n\nThey only server wine, beer and sake here. They have a small selection but it's all decent. They were incredibly prompt and friendly with getting our drink and appetizer orders in.\n\nNone of us knew what to expect, but I can tell you the appetizers blew our socks off! We had the Albacore Carpaccio with Jalapeno sauce. That was so incredibly good- probably the best dish of the night. Highly recommend making a point to get that. We also got the Braised Spare Rib, which also was amazing. Lastly we had the garlic edamame. Not the best I've had, but still somewhat tasty. \n\nFor the main courses we had the Spicy Sesame Miso Ramen. It really wasn't that spicy even with spicy in the name. It was decent. You could probably afford to increase the spiciness across all dishes. We had the Spice Jar Fried rice. It was good, but again not that spicy at medium. \n\nOverall the experience was just lovely, the food was good and definitely a place I'd come back. They were all very nice!", "author": "Annette D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "By far my favorite restaurant in San Francisco. The owners are so incredibly amazing and talented and always welcoming. The food is fantastic and I always leave soooo happy! I love the lettuce cups, albacore carpaccio, the tofu, seafood curry, seaweed salad, and all of the beautiful sake's they have in individual painted cups! This place is a complete gem and I will wait in line however long to eat and support this wonderful local and independent business.\nYour the best spice jar!\nHad my birthday party there this here at the long communal table, they were so accomodating!", "author": "Paris I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Love the spice jar. It's a little pricey but I almost always take some home for lunch the next day because it's a lot of food so I can spread it out  over two meals. I got the Tonkotsu Shoyu ramen and the spring rolls and both were awesome.", "author": "Kathleen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Went by myself on a Fri. Definitely more of a date spot, as I came to realize. Very small and intimate setting.\n\nHad the vegetable rolls and laksa. Both tasted amazing and came out piping hot. They wider variety of beers then I expected, which is always a plus from me.\n\nThe waiters/waitresses were incredibly nice and constantly checked in on me.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "Ate here at night. The food was decent but not really good. I think if you want something simple this place is good but it's a bit on the pricy side for that. We got the bao, tonkatsu ramen, and the steak wrap. Don't get stake wrap, it's literally just a steak fajitas. The ramen was decent, pretty thick, but really nothing special. I tried the sesame ramen they offered and that was much more unique and tasty. The bao is basically a spare rib with hoisen sauce in a bun (includes bone). It was tasty, but nothing really unique. If you come here, get sesame ramen and other things.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "3.5 stars\n\nInteresting and cute Asian fusion cafe.  I think they are in their honeymoon phase right now and are overwhelmed with popularity.  So, be prepared to wait.  There were only two parties ahead of us late on a weeknight and it took us about an hour to finally get seated.  However, the owners were SUPER friendly and conscientious.  They noticed that we had been waiting quite a while for especially chatty SF elitists who had finished dinner, already paid, yet still would not relinquish their seats even though there was a line of people waiting to get seated!  So, the owners sat us outside for a bit, served us water, and complimentary garlic edamame.  Which was delicious, by the way.  They were really sweet...which is also why I hesitate to say that although some of the food was fantastic, some of it was not as impressive as I would have hoped.  Which hurts me to say because they seem like super nice people--serious dilemma, but I have to speak the truth!\n\nPork Bao - This was the bomb dot com.  HUUUUGE chunka pork that was doused in some delicious barbecue served on a steamed bun.  Very flavorful and super tender.  Slightly difficult to hold and eat though without making a mess.  But, they serve it with wet napkins to clean up before/after.  Thoughtful!  P.S. the pork is still attached to the bone, so before you chomp down, make sure that you take the bone out first!\n\nChicken Karaage - Nicely fried without being too greasy.  It was crispy and piping hot when it arrived.  Both of the guys I was dining with loved this dish but I wasn't as \"in love\" with it.  But maybe that's because fried food just isn't my thing.  It was good, don't get me wrong but I would take the steamed pork bao over it any day.\n\nHar Gaw - Wanted to love this...really wanted to.  I love those Cantonese shrimp steamed dumplings with the clear chewy skin but these were oversteamed.  The skin was a bit too thick and started breaking apart.  The shrimp pieces were generous but did not taste too fresh which left a strange aftertaste in my mouth.\n\nTonkatsu Ramen - Ramen broth was thick and delicious without being overpowering and the noodles were also spot on.  The meat was good too, very similar to the pork in the pork bao.  But, the egg was not hard-boiled and the saffron was just too overwhelming.  I know that they were trying to make it a more fusion dish but the saffron was too much.  It actually detracted from the rest of the dish--even if it did look more decorative.\n\nI think the food has potential and I'd like to try some of the other dishes but only 2 out of 5 really blew me away.  But, although the food was so-so, the service and atmosphere were fantastic.\n\nThe space itself is small but really cute.  I love the branch/lightbulb chandelier.  The lightbulbs are all unique and it's really cute.  I also love the quote on the wall: \"People who love to eat are always the best people\" because duh.", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Best pho ga in SF!! Such a cute little restaurant with awesome service! Love homey friendly places. Can't get better comfort food on a cold winter day!", "author": "Shanna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "I have now been to The Spice Jar 2 times and I am very impressed with the quaintness of this neighborhood joint and the excellent food.. The dishes are large and very filling. My favorite is the calamari salad which I split with my boyfriend and a bowl of their yummy soups always hit the spot..It's always crowded but well worth the wait.. Very reasonable for what you get..", "author": "Stacy I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "Showed up at 1130 for lunch w 2 friends from a local business... Not tech! \nA variety of patrons served with class by  very friendly server.\nI had the ramen ...and green tea ... tasty and filling.\nIf you're not some finicky foodie neurotic you might really like this place!", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Not something I realized from other reviews: a bit of a hole in the wall, separated from the buzz of Valencia street by a nice, leisurely walk. This place is adorable, and delicious. On a rainy San Francisco day, I recommend getting one of the soups -- the curry coconut broth was exceptional.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "I came here because of all the great reviews on Yelp and I wanted to give it s try. I saw they had Korean steak Bowl wanted to try it. The guy tells  me they only have it for lunch. (Okay then take it off the special sign, all you have to do is erase it.. Don't advertise that you have it.) fine I asked the server is the other beef dish fatty? I explained to him a lot of places I go to have fatty beef. He said so very good quality. So j order it and he explained the fish came with some rice. And I ordered the chicken miso ramen. Brought everything home. And I was so disappointed. The ramen was so fucking hot!! I totally scorched my tongue!  I'm talking THIRD DEGREE BURN people. Where my tongue started peeling!!! Like hello who the hell serves soup that hot!! No warning then can at least write caution hot or at least tell me!! And secondly that beef Dish was so fatty and chewy. I'm never coming here again. And this morning the day after I totally got the shits. I'm taking MASSIVE DIARRHEA!!  \n\nDon't come here. It's not all that. Everyone who is saying it's good has never tried good Chinese food. And  we live in San Francisco we are surround by better places that are a lot cheaper with rice that isn't all hard and crusty! \n\n\nNever again bull crap spice jar bill shit", "author": "Chenea P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "I really like this place. It's local for me and I just keep coming back. The people who operate this place are soooooooooo nice. Seriously. And it's just such a cute corner spot. I kinda don't want to write a good review for them because I want to keep this place accessible but at the same time I wish them all the success in the world :D\n\nOh yeah, food's great (especially the ramen). And the drinks are fantastic. \n\nLove the whole package", "author": "Russ L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "A super adorable and cozy spot with beautiful bright light. Delicious food and great service. The laksa is dense and flavorful. The meat on the pork rib in the tonkotsu ramen falls right off of the bone. So good! Keep in mind that this is Asian fusion. If you are looking for authentic laksa then it might throw you off. But if you are looking for tasty comforting Asian flavors... this is it! Side note - they serve the ginger beer with real ginger and it was real cool!", "author": "Nana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Cute little spot owned by a really sweet Japanese couple! \nFood was delicious - best chicken karage ever. The spare rib bao was spot on. The laksa was a bit of a miss - not authentic, more Japanese curry like but still delicious. \nOverall a great place for a casual dinner - will be back to try the rest of the menu....", "author": "Bhavnak K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Went to this spot the other night and loved it! It's not the most authentic Asian food, but it's delicious and it's definitely \"comfort food.\" It's easy, delicious food but definitely not the spot you want to go to if you're looking for super authentic Chinese dumplings or mushu wraps. We will be back for sure.", "author": "Erica V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Great place! Good choices--- we had the laksa which was very tasty and the spice jar fried rice.  Definitely recommend the laksa   The fried rice was good but not incredible.  Staff was really friendly and nice despite a busy evening    I really liked the reataurant ambience: Small and cute with an open kitchen.  We will definitely come back to try some other items on the menu!", "author": "N S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "The fish was good, but the garlic green beans are more filling. The rice is undercooked. Wasabi Ale tastes OK, but not worth chugging down, actually.", "author": "Kokoe J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "Came here on the the first day they opened and my friend and I were lucky enough to snag the last table before the rush came in. \n\nWe ordered:\n\nBraised Spare Ribs Bao -- The thing was HUGE! I was expecting a smaller bao, kind of like peiking duck style. But this thing was more like a cross between a bao and a taco if you will. The meat was really tender and came off the bone, just like the waitress said. Even though there was a bone in it, the amount of meat they gave us was still pretty generous. The bao was very thick and doughy. The combination of the two was a disaster in my mouth. Although the meat had a decent flavor to it, the bread completely overpowered the meat, and it was difficult to swallow because it was so dry. The pickled veggies helped, but not too much. After the first bite, I ended up eating the bao and the meat separately. Even though it wasn't intended to be served that way, it tasted much better in my opinion.\n\nHar Gow -- One order comes with four har gows, but they separate the har gows into two steamers so they don't stick together. There is also a piece of lettuce between the har gows and the steamer, maybe to keep it from sticking to the steamer or for sanitary reasons perhaps? I'm not quite sure. The skin of the har gow is really thick, unlike traditional har gows. It comes very close to tasting like bao to me. The skin is very sticky, so it sticks really well to the steamer and the lettuce, and I completely destroyed one of the har gows before I even got it onto my plate. :( The prawns were huge! But, the har gows soaked in the flavor of the lettuce in the steamer, which took away even more of the authenticity of the har gows. :(\n\nShu Mai -- The most authentic dish that we ordered, in my opinion.  They were slightly smaller than the har gows, but not by much. The texture of the skin was thin, and the filling had a good pork to mushroom ratio. The mushroom is subtly more noticeable than the pork, just how I like it.\n\nGarlic Aonori Fries -- They were surprisingly good! Most likely just frozen Sysco fries with garlic aonori powder. But I'm not complaining! I could sit in front of the TV and eat these all day!\n\nZen Noodle Soup -- The waitress said this dish is one of the few dishes that the owner bought over from the previous restaurant due to is popularity. She had a lot of good things to say about it, so it felt wrong not to order it. However, I am a wimp and cannot handle spicy foods, we asked them to tweak it a little bit and make it as mild as possible. This was also the last dish to come out, so we were already pretty full by the time it go to us. The soup had good flavor, but it was a little sour for my liking. They use rounded rice noodles for the dish. There was surprisingly a lot of seafood also. The were only a few pieces of calamari, which were slightly chewy, but still tender enough for me to swallow. The shrimp was a bit overcooked, but that's usually the case when you order shrimp with a soup. They were very generous with the mussels, and it was probably the best part of the dish. The mussels were on the smaller side, but I guess the amount they gave us made up for it.\n\nWasabi Ale -- Not my cup of ale. Very interesting taste. I thought the taste was similar to some sort of powder mix. I really wanted to like it because of how unique it was, but my taste buds said no. :( My friend enjoyed it, so I just let him drink all of it.\n\nThe place is pretty small. They could seat maybe 25-30 people or so. When we walked in, they were trying to fix the balance on one of the tables. The aisles were pretty narrow too, and it was difficult to not bump into other parties when we walked out. Decent food, but clearly, they have a few kinks to work out.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Oh my gosh. Please don't come here. (I mean, of course, you can.) But seriously, every single dish we tried was so good in this new find that for the first time in my life I'd rather hide it than share.\n\nHar gow = delicious, mochi-like dumpling wrappers and YUM on the inside\nPortabello tempura = savory mushroom slices flashed into fries. Ask for some of the mu shu steak sauce (the green one) to combine with the sambal for a tastebud-loving dip\nSesame Miso Ramen, vegetarian = Are you veg but sad that there are so many delicious meat and seafood dishes? They'll happily customize the Sesame Miso ramen. Gobs of fresh veggies and an out-of-this-world broth made this my favorite ramen in the city. Ramen Underground pork quality, local Mission location and veggie taste/bodyfeel. Impossible...\nMu Shu Hangar Steak = I tried a mushroom from this dish, dipped in sauce, and instantly teleported to heaven.\n\nJasmine tea was delicious, service was super humble and kind with great humor, location quiet and safe, and I will be back here as often as possible.\n\nPlease be kind while in the neighborhood and note, they're currently closed on Mondays... be gentle to avoid breaking your own heart.\n\nYay spice jar!!", "author": "Megan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "Place is good . Simple , small and cozy . Usually very busy . They have good beer selection. The one negative thing about my visit , was the eggs they use ... fried rice is a simple dish and boxed eggs just don't cut it . Otherwise good . I would go back there again .", "author": "Angelica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "I'm not an adventurous eater so I was a little worried when I saw the menu. Gotta say, I ate everything that came to the table and my favorite was the albacore carpaccio! Next favorite and it was a close tie, was the shrimp dumpling. So tasty! Also loved the Mongolian beef and the crispy calamari salad. The ramen could have used more flavor and the seafood fondue had a strange taste I couldn't quite place. Otherwise, all was really really good. Go and check them out!", "author": "Tera K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Amazing food and great service! Really loved all the options and had such a hard time deciding what to get. Also loved that they had unfiltered cold sake, our waitress even said it was made in her home town!", "author": "Annika L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "It is nice to have another Asian restaurant around SFGH/ Mission. It has a cool vibe inside and the staff is very friendly. I had the pork tonkotsu ramen and the broth was just right, and pork was very tender. It was not too crowded around lunch time when I went. There is also nice outdoor seating. Can't wait for my next meal here to try something else.", "author": "Jaime F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "The owners, chef, and waiter are all welcoming. The options offer a good range of pan Asian cuisine.  Each is well prepared, and served in a gracious and friendly environment.  The music is good and the decor is great. A good total experience.", "author": "Nathaniel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "I came here with a group of 6 around 6:15 and waited about 40 minutes- 1 hr. The place is smaller than I expected, but nice and cozy. The previous group was there for 2 hours and refused to leave.... which is why we had to wait so long but the owner was very kind to us and apologized.\n\nThings ordered:\naonori fries - yummy! good snack for drinking\nveggie spring rolls - kinda greasy but good portion, and they cut it in half \ngreen curry - surprisingly tasty for a fusion restaurant\ntofu steak - very flavorful and meaty!\njalapeno plum wine - refreshing but could use a few more slices of jalapeno\n\noverall good experience, and I like how there are so many veggie friendly options.", "author": "Tina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Done! tried this place last night and it was as good as it gets. Asian comfort food, the albacore carpaccio is a must! \n\nAnd, the flank steak was cooked perfectly, which comes with tortillas and a nice aji style sauce with a creamy hint. Divine. \n\nThe aged sake was super good - with nice stone fruit notes and a delicate butterscotch-ish finish. \n\nEnjoy it!", "author": "Gilmar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Love the Tonkutsu Ramen!  Must order!!!!\n\nThe owner was super nice. Table for 3, 2 adults and 1 kid under 2. The little one made a mess, splashed water all over the floor and dropped a quarter of her meal. The owner did not show a sight of unhappiness. God Bless her!  She deserved a good tip and 5 stars review.", "author": "anita s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "3.5 stars really, adding half start for the awesome service.\n\nThe asian fusion here is unique in a way that it brings cuisines from all parts of asia from japan to india and everything in between. There are definitely some unique items on the menu that would be hard to find elsewhere but somehow i left feeling slightly underwhelmed\n\nWe had the shrimp dumplings and cast iron seafood fondue which were probably the highlights. For mains, we had the laksa and the salmon both of which were above average but nothing spectacular. \n\nI'd definitely frequent this place if i lived in the area or happened to be in the neighborhood but I dont think i'll  make a plan to come back.\n\nThere is a LOT really good asian food in SF which makes competition really tough and while this place is a solid B+ it just falls short of an A for me", "author": "Aditya J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Let's get the not so amazing things out of the way:\n\n1) The rice was dry\n2) the wait for seating and for my order to arrive was long (a problem that faces many new restaurants )\n3) No knives available at the table to cut your food. \n4) Tasteless side salad (no dressing) left much to be desired. \n\nIn the end the menu felt a bit over-priced and I was tempted to give Spice Jar 3 stars...\n\nBut the service was great! The staff at Spice Jar really care about you and are trying very hard to give you a pleasant, delicious experience. They are friendly and cheerful and aware of the fact that many of their patrons are waiting in long lines to eat (a fact that is made evident by their generous offerings of free edamame)  pulling my rating into the 4-star region. \n\nSo, I do not recommend going any time in the next few weeks (there are still some logistic items for them to figure out) but I feel that in a month or two things will really have settled down and the menu and speed will have been adjusted enough to really be a gem of the Mission district. I am happy they are here and look forward to my visit again in a month.", "author": "Drago F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "Workers are friendly and they make sure water is always on your table. The food was okay. The shu mai comes in 4 and it is extremely hot so let it cool. I got the tonkatsu ramen and it was okay. I don't know if I was really full from the shu mai but I couldn't finish it. My boyfriend got the Laksa(?). It's a coconut based dish with your choice of ramen noodles or rice I believe. It's good but has a kick to it. It's like curry!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "The perfect blend of oil and water, \nmy lips are sticky with satisfaction,\ntemperature rising, impression guaranteed. \n\nStart here...\nSparerib Ramen \nAlbacore Carpaccio\nCast Iron Seafood Fondu", "author": "Jay Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "What an incredible meal! I've had this place bookmarked for some time now, and took my gf out on a night we were having a particularly hard time deciding what to eat. The wait was only about 10 minutes long on a Thursday night. The menu featured some interesting items both familiar and new, so we chose to go with the shu mai pork dumplings and short rib bao as appetizers, followed by the Mongolian beef and laksa soup. The shu mai were good but nothing too special. The short rib bao is something I would definitely come back for, though. The beef is so tender, and is perfect wrapped in the bun with all that sauce! The Mongolian beef had good flavors, and the portion is adequate but not worth $14. The Laksa soup was definitely worth every penny. Super delicious!", "author": "Gabriela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "I love discovering new little gems in San Fran. I want to keep this place a secret so it doesn't get over run by fellow San Franciscans, but I also want to spread the word so people can share in the delight.  Asian fusion restaurants are typically hard to pull off normally because chefs can throw a menu together that has breadth, but no depth.  Such was not the case with Spice Jar. The menu was thoughtfully curated and every morsel we ate was so tasty. \n\nWe ordered the calarmari salad, tonkatsu ramen and shu-mai - again, all delicately made and delish!  We kept praising the owner every time he walked by because we loved it so much.", "author": "S C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Zen noodle soup is very tasty, ordered a side of jasmine rice and I couldn't finish it... They put lots of mussels, shrimp, and oysters in it... But even on top of all that the coconut broth was mesmerizing ... Date night???  simple dish lots of flavor", "author": "Danny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "I love the vibes of this place. It feels really nice in there\nI tried the laksa $11 and it's just delicious. The staff are great too.\nThere's sometimes some queue, but it goes fast.\nTotally recommend it", "author": "Sophie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "New Asian Cuisine Restaurant. Many small bites and fancy foods. Also you can taste many kinds Sake and Shochu here! The are many parking spot around the restaurant.", "author": "Tetsuro M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Great service.  Good food.  Cute place! Totally satisfied! Must try their homemade tofu.  Homemade fresh mint ginger lemonade.  For sure to come back with friends!", "author": "Emiliy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "Vibrant, fresh and wonderful flavors is how I'd describe their food.  We had the poke bowl and bbq beef bowl and it was a huge hit!!  Ive been wondering what all those long lines meant and why there was always a wait--now I know.  A must-try if you are in the Mission.  One of the best asian restaurants in town!", "author": "Jez S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Asian fusion restaurant that is a great new addition to this end of the Mission.  I have now been here a couple times.  The food is very good and very fresh.  Recommendations.....get the Hanger Steak BBQ Mushu Wraps.  It is kind of like super tasty asian fajitas.  Also the Crispy Spring rolls which are nice and crunchy.  Also the Spice Jar Fried Rice,  which is a healthy portion to share amounts your table.\n\nSelection of beer and wine.  I like that they do their wine by different carafe sizes so you can have more than a glass without committing to a bottle. Only downside is the place is a bit small and can get crowded especially on a weekend night.", "author": "Jax B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "It makes my heart sad to write this review but I feel I must. This is such a quaint and perfect little corner spot. I feel as though they deserve all of the accolades but fear it will mean long lines for me and my rumbling stomach once the secret is out. The food is consistently prepared with meticulous attention to detail and always comes out hot. The aroma hits you as soon as you walk in and you know you are somewhere special. \nEverything on the menu is good. Everything. There I said it. Don't lose out by trying only one dish. Do yourself a favor a get a sampling of something new each time you go and you won't be disappointed. Their food is comforting, healthy and fresh and do not pass on the ginger lemonade. \nEvery time I leave this place with a full belly I feel as though mom and dad just took care of me and gave me a rare treat and a kiss on the forehead to go. Please just don't go bragging about this place to just anybody. Keep it special. Tell the ones who really get it. The rest can eat at some fancy uppity place downtown. This one is a total gem.", "author": "Ronald B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "It was pretty good. It's really tiny. GARLIC EDEMAME.", "author": "Areeb M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Recommend the veggie ramen and mushroom lettuce bowls. Also impressive sake list and enjoyable sake from a cute jar. Amazing service and atmosphere. Wait list was efficiently organized and well worth it.", "author": "Malia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Great addition to the Mission. If you're down with MCF and Yamo but want something with more ambiance, then this is the spot. Awesome food, prices and staff!", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Discovered this place on Yelp on a whim - my friend and I were spending the day in San Francisco and found ourselves in the Mission District around dinner time. It had good reviews so we decided to check it out.\n\nThese reviews are totally deserved! The food here is so flavorful and a mix of different Asian cuisines. I had garlic edamame and the spinach fried rice - both delicious and VERY rich in flavor. I also had the ginger ice cream for dessert which was definitely the highlight of the meal - tasted like fresh ginger with just the right amount of sweetness.\nThe customer service was also great. The staff was prompt and very helpful. Highly recommend this place if you're looking for a tasty and fairly affordable dinner!", "author": "Sanika B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Cute little place with friendly attentive service. I only tried the tonkatsu ramen which was good, not the best I've had. The spare rib in the soup was very good. Interested to try some of the other items.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "My favorite place to visit when I am in SF. I LOVE this place. Everything I've had there is flavorful, lots of impact, and I am craving the Laksa as I write this. Calamari salad is A MUST TRY!", "author": "Yuki A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "The food here was amazing!\n\nI came her with a group of six. There is limited seating so ended up having to wait 45 minutes, but was totally worth it!\n\nWe got a variety of dishes, I tried: portobello mushroom tempura (YUM!), laska and green curry. Great vibe, would highly recommend it.", "author": "Saira Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Outstanding. \n\nHad the green curry and a variety of apps and all were cooked to perfection and tasted amazing. Staff is very attentive and genuinely appreciative of their customers. We got there relatively early but by the time we left there were several folks waiting outside. It's a small place so be prepared to wait. It's well worth it.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "I love the shu mai, the noodle soups because of the brilliant broths and the calamari salad. Also, get the fresh made lemonade. It has mint and ginger in it and it's delicious. The only downside of the place is that it's closed on monday.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "I'm from San Jose and went out on a limb to take a drive out on a rainy day. I ended up ordering garlic noodles and shu mai and found myself very satisfied with the meal. Totally worth the drive!", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "We had a fantastic meal here on a Saturday night. We arrived around 9PM and still waited about 20 minutes to get a table. Parking nearby was really tough to find. The ambiance on the inside is really small, warm, and cozy! The service was also very friendly. The food was fantastic and everyone at the table really enjoyed their meal. I had the red curry which was so decadent and I'd recommend if you're in the mood for Thai Curry. We will definitely be back! Only wish they took reservations, I hate waiting!", "author": "Kendra N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Spicy miso ramen is addictive. We live around the corner and Spice Jar is our go-to most work nights. The couple who own it are wonderful and thoughtful. So happy to help support this restaurant for locals ;)", "author": "Bradford S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Cute, friendly with da bomb food! \n\nSpice Jar fried rice - must have! You know something is delicious when you feel a slight sadness that with each delicious bite...less of it is left to eat...sigh. I thought this was the star of the night \n\nSpring rolls - Yummy! \n\nLettuce cups - it was so good that we ended up ordering another round of them. \n\nCalamari Salad - Yummy!\n\nPortions are HUGE! We rarely have leftovers bc my hubs can eat volume, but we met our match here. \n\nService was so friendly and inviting. Highly recommend! Great date spot!", "author": "Candace D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Mongolian Lamb was killer. My favorite part was the ginger mint lemonade! The spicy miso ramen looked really good too.", "author": "Drew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Awesome Asian comfort food! Soooo delicious and the quality is top notch! \n\nRamen is great! \nFried Calamari Salad is a MUST!\nGinger mint lemonade is very refreshing!\n\nThe owner was a chef at a large Japanese restaurant and it shows. There is deep and thoughtful intentionality in all his dishes and you can taste his dedication to his craft.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "We went here in a group of six last week and were blown away. Excellent food, variety, portions, prices and service. There was a bit of a wait but well worth it. Must try the mongolian chicken, calamari salad and the pho ga!", "author": "Kabir S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "WOW! This is really good Asian Fusion food that is prepared with care and tastes great! Prices are very fair and while it's a bit cramped, you'll find it is worth the wait. You are here for the food not the ambiance. Service is good. Nice selection of wine and beer to go with the delicious food. We were here for lunch. Try the Shumai for a starter. We had Tonkatsu Ramen, Laksa and spare rib bua- all were tasty! We were happy and full when we left.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "My husband and I had dinner at the Spice Jar based on other positive Yelp reviews and we were not disappointed. The food was good, flavorful, and fresh. I would suggest you don't come with a large party (anything more than 3) unless you have the time to wait and the right jackets to wait outside. On to the food the Braised Sparerib Bao was really good but small. The cucumbers really made a difference in the flavor of the Braised Sparerib.  The Calamari Salad which was a healthy sized portion had plenty of calamari and flavor to serve as a main dish. The Laksa Soup Noodle was also really good, generously portioned and packed with tons of flavor. In addition to nice ambience, good food and friendly service the food was very well priced our bill was $ 44 in my opinion you can't beat that. We'd definitely come back.", "author": "Lumei M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "I Love This  Place! Awesome food, prepared simply, with the sweetest owners ever. The couple from Kobe who creates this place did a great job. Yay!", "author": "Gina O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "good restaurant，but I think the salad is just so so. The noodles seems good,but I did not try", "author": "Ling C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "This place is ridiculously good!!! From the experience to the food to the ambience. The calamari salad is BOMB! Best food ever. I can't say enough good stuff. The owner was super cool and interacted with us. He was so sweet and humble. His wife works there too. So cute! I will drive from Sacramento just to eat at this place any day!!! Busy as well which shows a lot. Only been opened for 6 months! Wow. Also the ginger lemonade is perfect !", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Perfection in the kitchen and relaxed but helpful service. Come here before this place becomes overwhelmed!", "author": "Ivan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "I heard about this quaint restaurant a few months ago, and while I was in town around mission, I decided to bring my parents here. It was amazing like I expected. I had the Mongolian Lamb with rice and bread and it was spectacular. My parents who are usually pretty cynical about Asian fusion restaurants, but they loved it. The fried rice and the ramen (which usually is extremely hard to please). The staff is amazing and I highly recommend!", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Chez Maman or the Spice Jar. Hmm... It's a toss up and you can't go wrong with either for dinner. One of my TOP 10 restaurants in SF 'nough said. When you come here, order as much as you can afford cuz it'll be worth it.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "I wanted to try this place for my birthday and I was happy that I did. The spice jar did not disappoint. Started off with the short rib bao and it was tasty, the meat was falling off the bone. Next we had the shu mai, they were succulent and big. The fried chicken was next and it was perfectly fried and very flavorful. Last we had the fried calamari salad and what a great way to end our meal! I enjoyed everything that evening and the service was great. The owner was attentive and very nice! Hope to be back real soon", "author": "Ingrid J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "AMAZING food. would get 5 stars except their kitchen/staff gets backed up sometimes and one time it took us an excessively long time to eat (close to 3 hours)", "author": "natalie c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "I generally try to eat somewhere new every week, but I had this place last weekend and had to come back again. Ordered 4 entrees and they were all amazing, savory, great texture, and well presented. The place is a great mix of Asian-Californian cusisine and there are options for everyone. Although the place isn't huge, it's well lit with cool decorations inside. I'll be back again.", "author": "Slaiman A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Delightfully chill space next to bustling 24th street corridor and the the Zuck space at SF General. Pan-asian food disguises expert craft behind simple-appearing specialities like poke, ramen, fried rice. Excellent beer list and outdoor tables.", "author": "Allonsy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "We had the green curry with chicken and the mongolian chicken. Both were just amazing. By far the best and most savoury green curry i've eaten so far.", "author": "Mathieu H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "We live 2 blocks away from this place, and are still not sick of it. Delicious food, great service, and you feel so good after you eat it. Better eaten in the restaurant as opposed to take out.", "author": "Britt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Small place, tasty food. The salmon had a delicious crust. Everything was rich and flavorful. The staff was friendly, professional, and competent. A boisterous, convivial atmosphere, loud enough to be lost in the crowd, but easy to chat with everyone at your table. A great spot.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "I like it a lot. You can tell from the ingredients and tastes that the food is prepared with hearts. The seafood noodle soup has little spicy taste which I like most.", "author": "Quan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "We have been here a few times with our little kids, and it's a neighborhood gem!  The calamari salad was light and delicious, Ramen is delicious, and their fried rice is great!  Wonderful service and a great value.  This is becoming one of our favorite neighborhood grub spots.", "author": "Ashley + Kelvin Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Atmosphere is nice inside, small and cozy. Surprisingly always a wait for a small local cuisine. Food is amazing. The chicken lettuce wraps had a smokey chat taste that was unreal. Braised rib is savory, and the albacore carpaccio is incredible, a must have. Mongolian beef and garlic noodles were full of flavor and had a little kick to them. Staff was friendly. Definitely recommend.", "author": "Kalani M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Absolutely the best Asian cuisine in town! And what great hospitality! You truly feel at home in Chef Hamada's kitchen. The chef and his wife personally attend your table, so special. Must tries: hanger steak, albacore carpaccio, & the Bao braised rib appetizer.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "Mind and heart blown. Can't remember the last time I had such a delicious and reasonably priced meal, in a cute comfortable restaurant. Stop reading reviews and go eat here", "author": "Afaan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-02", "description": "A nice little spot. Menu is small, but what they do they do well.\n\nIt's also reasonably priced for the area/a trendy spot. \n\nWe had the shu mai pork dumplings (excellent) and beef short rib ramen. I would recommend both, but pass on the cucumber salad. \n\nTheir iced green tea is super refreshing and comes with free refills (it also seems to have some matcha in it).", "author": "Devyn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "What an amazing find!!  My husband has been wanting to check this place out, and we finally had the time to stop in. It was Valentine's day and there was no wait.  It's labeled Asian comfort food.. and it did not disappoint.  We started off with the fried chicken bites. Yum.  Crispy, perfect little nuggets of happiness!!  With a tasty remoulade dipping sauce.  We then got the chicken sesame ramen.  So tasty.  Not a traditional ramen in that there aren't a lot of veggies or egg in it, but you don't miss it.. so much flavor!!!!  And the spice jar fried rice.. it has a little bit of everything in it. This was a pretty big portion.. enough to share.  Everything was cooked to order and served promptly. Highly recommend.  I will be back.  The only drawback is that is it's a tiny place, and you are super close to people you don't know... But if you are friendly and social, the should be no problem.", "author": "Mindy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Hope this stays a secret find. The rib bao and ramen are the best. Asian comfort food on a cold night is my jam. Been there twice this week and already hankering for another go.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "My husband and I are turning into a grouchy old married couple, skeptically eyeing new places that pop up in our neighborhood. We watched the drawn-out drama with Local's Corner and then saw it close and very eagerly anticipated what would fill the vacancy. And there it was: Spice Jar. Using our dogs as a daily excuse to walk by, we'd peer in, check out the posted menu, and sort of scrunch up our noses thinking...good luck. A 'Greatest Hits' of Asian food??? What????\n\nWell, I'd say they're about a month in now and we decided it was a good time to check it out. First thing: they got a hood!!!! That was one thing Local's Corner said they weren't able to have in that space, which was why they used induction. But Spice Jar managed to get it approved, which was great to see.\n\nEvery single person we encountered was SUPER nice and attentive. It's a small space and they were packed. But everything flowed so smoothly. No one appeared stressed and we never had long waits for drinks, refills, or food. They were functioning as though this place had been here for years. \n\nFor drinks, we ordered a couple different beers. We love beer and were thrilled to see beers on tap. I tried the green tea iced tea and loved it. Super refreshing and not at all sweet. Great for green tea lovers. \n\nFor appetizers, we ordered the har gow and chicken karaage. Both were fine. Nothing spectacular but just right for a local comfort food place. Yes, we've had better har gow and chicken karaage but for a place literally right around the corner from home, we were totally happy.\n\nThe tonkotsu ramen and chicken green curry came next. My husband is a ramen freak. We love Ivan Ramen and Momofuku in NY. In the Bay Area, Ramen Shop in Oakland is by far our favorite. We weren't expecting to be thrilled by Spice Jar's ramen but were very pleasantly surprised. Of course, if we have the choice, we'd obviously take Ramen Shop any day. But again, to have this less than 5 minutes away on foot is a miracle. It's a totally decent, good solid ramen. Finally, my green curry! I want to eat green curry right up until I die and am forever in search of good ones wherever I go. (Coincidentally, we recent visited Farmhouse Kitchen, a new Thai restaurant also in the Mission where I ordered green curry. Now, my husband and I have eaten green curry a bazillion times from New York, Boston, San Francisco, Paris, Berlin...and Thailand on many occasions. So I think it's safe to say that we're fair judges of what green curry should look and taste like. Not to get off track since this is a review of Spice Jar, but we were horrified by Farmhouse Kitchen's green curry. HORRIFIED.) Okay, I'm back. Spice Jar's green curry really made me smile. Seriously. They nailed the flavor and consistency. The chicken was super tender and moist. They could toss in some more goodies as it was just some eggplant, cherry tomatoes and a little basil. But all in all I am on my knees thanking heaven for access to some very good green curry a stone's throw from my front door. \n\nAnd the price!!! All that for fifty-something dollars?!?! How happy are we?!? For a small neighborhood restaurant, they're doing a lovely job. Great addition to the neighborhood. Great service. Great value.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-23", "description": "3.5 stars? Really wanted to like this place, and it's not like I dis-like it, but it didn't wow me or make me want to think I ought to go there again. At least not for now. It's a cute corner restaurant with decent menu and super kind staff (which I assume is the owner). Food wasn't bad either, but again, no wow factor. If I lived near-by, I might be a regular, but living down this far on the peninsula, it's hard for me to recommend it over at least a handful of other similar joints in San Francisco. Nice interior deco, good beer selection, easy to park.", "author": "Sokokyu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "Excellent green curry! Fun place, I will come back often. Very small and a long wait depending on the time and day. Worth the wait! Gochisoosama desita!", "author": "Keith H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "What a neighborhood gem. Great food, lovely owners, and a fun atmosphere makes this place truly special. Consider me a fan.", "author": "Josh H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "I'm glad that I found this place, it offers something different than what you'd usually get in the Mission. \n\nAbout others who are angry about Laska not being authentic, honestly, I'm Malaysian and I don't think it's bad and it totally satisfied my crave. Sure - it's fried tofu and not tofu puffs, but it's still yummy tofu. The broth, not as spicy as original flavor, but still thick and has that grainy curry powder texture. Overall, it's 3 out of 5 for authenticity, but I still think it's a good dish and I'll have it again.\n\nThe other dish we had was Calamari Salad. It's good portion of calamari, crispy on the outside and absorb some of the salad dressing which is very delicious. I can't wait already to come back for it.", "author": "Guacamole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Full disclosure I wasn't super hungry when we went to spice jar so only can refer to the lettuce cups and salmon. Both were delicious. Salmon can be so boring because it is over done and of course there is the concern about sustainability .  That aside the salmon was delicately spiced ( almost too delicate ) the presentation was nice but overall the atmosphere of spice jar is friendly and welcoming. Want to return to try some more adventurous dishes.", "author": "elizabeth m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "3.5 stars. \nThis new restaurant is still working out kinks.  \nFriday night dinner was very crowded, about 20 min wait to sit, and then another 20 minutes for food to arrive (2 bowls of noodles).  The owners should probably streamline the menu to account for the small kitchen and limited cooks. If you have to make 5 kinds of (very different) noodle broths, on top of all these other menu items, it's going to take forever to serve everyone.  \nTable next to me complained that their appetizer dumplings arrived 40 minutes into the dinner (after they were already full from everything else, and tried to send it back, but the server said something about how he is just the server and couldn't do anything about the speed of food).  \n\nPho ga was light and not strongly flavored; the chicken was rubbery and dry.  When the waitress asked how my food was, I showed her the rubber chicken and she immediately took it away to remake it (even though I insisted I didn't mind eating the noodles alone).  Although this was very nice, my eating companion was then left with the problem of eating alone or waiting for my food to be remade while his soup got cold.  \nZen noodle soup was fine but nowhere near the spice or deliciousness of comparable noodle soups at Kitchen Story.   \nAlso got some mongolian beef and fried rice to go, nothing special there.  Next time, I would probably stick with the japanese menu items.  \nMatcha iced tea was delicious! \nOverall a very clean, hip place with decent food but nothing too special.  The owners are very kind and caring and I hope they work things out!", "author": "T Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-28", "description": "Most dishes were extremely rich and well arranged, but almost nothing we ate stood out as delicious. The selection felt limited and significantly less well rounded than I was expecting given the rave reviews here on Yelp.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Such a cozy lil neighborhood restaurant. We ordered the chicken karaage, the calamari salad, and the Mongolian lamb. The Chicken was perfect; salad was pretty damn good too; the lamb was cooked perfectly (but surprisingly) seemed to lack the distinct flavor of lamb. The service was spot-on, and a great experience in general. The Spice Jar will be here to stay!", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "This is one of my favorite soup places, we have tried every soup on the menu now and they are all amazing!!", "author": "Alexandrina O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "Great flavor in a heapin bowl o noodles. And very nice friendly service. Cozy tree house feel. I'll be back.", "author": "brian s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "I love this little place. Went here for lunch the other day. Ordered the zen noodles. At first I thought from pictures it was like Korean Jambong but the soup was more like a coconut soup with lemon grass and Vietnamese rice noodles. It was a nice little surprise, nicely balanced and not too heavy. I think the best part was the lemon ginger drink. Service was also really friendly. I will definitely come back and try other dishes. Oh and decor is really nicely done. Small space so it feels intimate.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Delicious food, welcoming service. Just what I like!", "author": "Alexander H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "I loved the mongolian beef and the chicken green curry. I can't wait to come back to try the calamari salad and the pho ga.", "author": "Amin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Loved our dinner at Spice Jar. We enjoyed ramen and mishu hanger steak, which were delicious. The Asahi beer imported from Japan was a perfect accompaniment. The atmosphere is cozy and the service attentive. Good price too!", "author": "Michaella S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "tasty food at a decent price \nbig improvement over \"local's\" corner", "author": "Ryan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "i really love this place , good food , great addition , and very authentic \nune bonne adresse avec un service tres attentionné", "author": "Gilberte G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "This is our go-to restaurant in San Francisco. The owners created a menu of things they love to eat, and the love shines through their food. It's a place where people feel comfortable and leave satisfied. The prices are incredibly reasonable for the quality. It's all good. We'd eat here every week, and often do. Don't miss the miso ramen and the homemade tofu.", "author": "John T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Sweetest little spot in the mission! We were so excited to see this delicious spot take over the old Locals Corner property. The owner personally dropped by our table to help me figure out what foods I could eat that are dairy and gluten free. He took care to check into every ingredient and the result was a tasty meal of curries, fried rice, and veggie dish. My dining counterparts loved the sesame bread and Buddha beer! Will be back for sure!", "author": "Jody N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "We really enjoy the food and service of this local Mission District restaurant! I'm not going to go into the details of every dish. The bottom line is the food is creative, good portions, exceptional flavors, and very inexpensive for the city! The owner and staff are very friendly, and the service is efficient. Accordingly, they have done extremely well since opening a few months ago.\n\nIt is a small restaurant, and unfortunately doesn't take reservations. It's first come, first served, so there usually is a wait in line, but well worth it !", "author": "Mark S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-10", "description": "i waited so long for the food. it never came out. it took way too long..\nthe service was.. just Okay...", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Friendly attentive waitress, cute decor, delicious food. We got the green curry with chicken and the zen noodle soup. Definitely coming back to try other items.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Fantastic Asian fusion food. Community friendly. Family owned. Ths best bang for your buck.", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "The boyfriend and I decided we wanted to try out a new restaurant and decided on the Spice Jar. And I'm so glad we did! The food here is beyond amazing!!!!!\n\nWe ordered the three dishes: Har gow, Calamari salad, and bbq korean steak with mushu wraps.\n\nThe har gow was so fresh and well-made. I'm just sad there were only four!\n\nNow the calamari salad was delicious! My bf normally hates salad and if he does order one he never gets dressing. However, the dressing was the highlight of the night.  It packed a lot of flavor, but was light enough not to overpower the salad.  The noodles were a nice touch as well.  \n\nLastly, was the bbq korean steak with mushu wraps. For the mushu wraps we weren't expecting to get tortilla wraps but that's okay. The steak was perfectly cooked and just melted in your mouth. And the sauce that it was cooked in? Perfection. \n\nWe will definitely be coming back. One of the best restaurants we have eaten at in SF.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "Spice jar is such a great neighborhood spot! The food is delicious, service is great, and atmosphere is casual, fun.", "author": "Marisol R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "I've been here twice, once for lunch and once for dinner. I've enjoyed everything I've tried, which I had two soups, ribs, the chicken salad and the calamari salad. I recommend trying. Cute atmosphere, although it can only fit so many people, so sometimes you have to wait.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Great environment and accommodations. The food is just spiced right! Fitting name! Loved the Thai curry bowl.", "author": "So N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "After having lunch at the brand new Spice Jar I couldn't wait to write a review. This place is a treasure.\nSpice Jar is a small, neighborhood restaurant that serves Asian Comfort Food. I had high expectations but the food was so much more complex and delicious than I anticipated.\nMy boyfriend and I shared the cucumber salad (fresh, crunchy, spicy.) Then he had the Mongolian Beef (thin slices of meat with green onion, sesame, hoisin and what tasted like a wine reduction.) I had a seafood coconut broth with basil, calamari and mussels. \nEveryone who works here is so very lovely. The wife of the owner spent a lot of time describing the dishes and outlining their most popular items (their ramen and the calamari salad looked incredible.)\nI recommend you visit at slight off hours (11:50 for lunch, rather than 12:00, for example) because already the place has lines out the door at peak hours (they are very organized and seat you as quickly as they can; but the place is the type where you'd want to linger rather than rush.)", "author": "D Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "My husband and I went to Spice Jar on a Friday at 7:00 pm and were seated within 5 minutes. We are vegetarian so we had a good variety of options in food. We ordered the vegetable gyoza, tofu steak and vegetarian ramen. Taste wise food was great! I usually don't like tofu, but the tofu steak was really good. They don't have a full bar, but good variety of beer, wine and sake. Good value for money. Would go again!", "author": "Isha J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-15", "description": "Sorry to report that from 4 visits I had two times chicken that didn't taste good: It had a taste of not quite fresh. I had 3 times the Pho and one time the chicken green curry. I really wanted to like this place and the people running it are super nice (I would give 5 stars for that). But finding chicken with a side taste is not something I can recommend. \n\nThe cook told me the chicken gets cooked in the morning. I believe chicken stays fresh for a while after it has been cooked, so I assume the chicken is either not getting cooked right away after it's bought OR not stored cold enough OR the vendor might not store the chicken correctly. When I buy chicken, I make sure I cook it within a few hours or I freeze it.", "author": "Mpunkt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Great new spot in the neighborhood!! You have to try the ribs bao - simply amazing!  Very friendly staff too - we will definitely be back!", "author": "Lars W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "My husband and I live in North Bernal and have walked by several times but there was always a line so we did not stop.  We finally went early enough the other night to snag a table (no reservations) and it was delicious!  We will definitely be back.  Great food and service.", "author": "Phil D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Sooo happy about this new addition to the neighborhood! First of all, lovely owners - always a perk when the owners actually run the place & are the ones giving you their recommendations etc.! Food was absolutely delicious - wish we could've tried everything, but we'll be back to fix that! Great variation of dishes (also beverages btw, the homemade mint ginger lemonade is bomb!), and all of them are perfectly flavorful and clearly cooked with passion.\nAnd of course, all that for a more than fair price, which seems to get harder and harder to find in SF. Absolutely love and will definitely be back!", "author": "F F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-12", "description": "Over rated, I had the most boring chicken karaage here, how can you make fried chicken taste so boring?! Had their sesame ramen and tonkatsu ramen, both taste either like Chinese nor Japanese, taste very weird, yes, weird is the only word I can use to describe their food. The food taste very immature, the meat in ramen taste like over night stiff and dried out Chinese left over just taken out from the refrigerator, the minced chicken in sesame ramen is sweet, and just weird. Like what we use for chicken fried rice. The whole thing taste like an experiment, put all together with left over Chinese food. I am very surprise why they have high rating, then my friend told me you can pay Yelp for fake ratings. That make sense. The only thing I liked there was the service and the iced green tea in a nice glass cup. So I am giving them 3stars....", "author": "Diana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "3.5 with food: all the curry dishes are similar to each other and options are limited. not much freshness of seafood in the penang curry... vibe is good. service is rushing.", "author": "Shuting Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "The green curry is out of this world. Perfect amount of spices blended together with tender chicken and vegetables.", "author": "J Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "For appetizers we had the har gow and edamame hummus jar and they were absolutely amazing. The rice paper wrapping on the har gow was absolutely fresh and gooey and so yummy. Then we ordered the fried rice and that was good too. We also ordered spring roles and the inside  of it was so good. It had this pepper flavor. The customer service was amazing. They always checked in and were so friendly and kind. I'm definitely coming back with family and friends and going  to try everything!!! I would definitely suggest you try it!!!", "author": "Julie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "This place is awesome. The food is completely delicious, and comes in generous portions at an affordable price--rare for San Francisco / Asian fusion restaurants imo. The service is also really top-notch. I recommend the Oolong tea and tofu steak. Keep in mind that the venue is small, and there may be a bit of a wait for a table, but it is absolutely well-worth it.", "author": "Charlotte G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "The owners of The Spice Jar were kind enough to accommodate us on their 'Family and Friends' preview dining evening, and we were very grateful for the experience! The service was speedy, the food was delicious, and the decor is awesome. I'm so glad this cosy spot has opened up in the Mission. Thank you!", "author": "Kath R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Wow, wow, wow. The Spice Jar lives up to its Yelp reviews- beautiful yet simple decor, delicious and beautifully presented food, and very friendly staff. I would definitely come out my way to eat here again.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-28", "description": "Second time ordering and I think the problem is the lack of oomph. There's not a lot of spice, tbh, my food tasted bland.", "author": "Phi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Just moved to SF and had no idea where to find a good ramen place. Based on reading some initial reviews on yelp about the restaurant my boyfriend and I opted to come here on a whim- we were floored by how lovely the staff were- going out of their way to provide stellar service as well as serving amazing food. I would recommend this joint to anyone! Great staff, clean, great service and delicious food! A true gem!", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "All the food was amazing. People working here are great and attentive. Was up to my standards and beyond.", "author": "Martha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "The food and service was fantastic.  Love ma & pa places.", "author": "Anna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Great place!  The owners have really put alot of attention to detail in their food and the restaurant.  All the dishes we tried were excellent: garlic edamame, pho, miso ramen, mushroom tempura, spinach and garlic rice, portobello, steak fajitas, spring rolls.  The flavors are amazing in everything as they put their own unique spin on everything.  There is always a wait but it is worth it and never more then 20 minutes.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Very good Mongolian Chicken & Shrimp! The dish was very flavorful and was also quite filling. I ordered the meal to go and it was ready within 10 minutes of ordering. The owner was cheerful and very hospitable. I will definitely go here again!", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "I'm not a big fan of Asian Fusion usually, however I LOVE this place! I recently moved to Chicago, so while visiting I had to come for the oh so delicious Maui Maui. The atmosphere is so lively that I always hate to leave. Love the staff also! Very warm and friendly.", "author": "Kelly A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "What I have been waiting for in this town   Fresh, delicious, friendly.  Perfect neighborhood lunch and dinner spot serving farm to table comfort Asian food.  It's my dream come true!!!", "author": "Nicholas C."}
