{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "I loved the Castro republic! I went looking for food at 3:30pm on a weekday so naturally every restaurant was closed. Seeing the Castro republic's doors open, sunny inside with super high ceilings, and the promise of $3 fried avocado tacos (taco Wednesday, its amazing) was like seeing an oasis. \n\nService was quick and our server was super nice, going along with our request to please do a blind taste test of Corina v pacifico (what's ur go to?)!", "author": "Heather W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Man I was craving some chilaquiles for so long. \n\nEver since I had them in Mexico City, I was constantly haunted by their deliciousness - especially that unique crispy-sogginess of the chips.\n\nSo did these hit the spot?\n\nFor the most part yeah, they're pretty good. Most chips have that crispy sogginess and theres good flavor from the eggs, avocado, salsa and onions. There was a good amount of avocado. I always dig that. I added tinga de pollo as an extra but honestly it was a bit hidden because there wasn't much of it. \n\nOverall it kind of satisfied the chilaquile craving, I really need to go back to Mexico City though. Still better and way cheaper, haha.\n\nService was quite friendly. Food does take some time to come.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-04", "description": "Castro Republic has a Wednesday happy hour with Sangria and Tacos.  Sangria was, well, Sangria and tacos were, well, good looking and tasty but no bargain at two bites for three bucks.\nThat aside, a bunch of friends decided to meet there. Ten of us arrived early (let's call them the Earlies) and I came with the second ten or so a bit later (the Lates).\nThe Earlies were seated in a corner on the East side of the room.  There were few other customers, being just after five.  When the Lates came, the host directed us to the West side of the room.  We explained we were together with the Earlies, but saw that the larger West side of the room was empty except for one couple who was just getting their check.  The was plenty of room on the West side for all of us, so we started making a place.  The gracious couple there encouraged us.  We called over the Earlies.  \nWell, the host was having none of it.\nHe explained that within the hour the place would be so packed we could hardly move, and it wasn't convenient to have us all seated together.\nI suggested that, since it was inconvenient for them to have us there, perhaps it would please him more if we found a more suitable venue (elsewhere).  Host demurred, faded away, and was soon off shift.\nThe other staff was very helpful, got us settled in, and came up with a great system for billing the large group (via tables of four).\nThe promised unwashed hordes never appeared.  In fact, the place was pretty lonely.\nIn any case, having been put off by our welcome and the diminutive tacos, we decided to dine elsewhere after happy hour, with some of us ending up across the street at wonderful La Mediteranee ... but that's  for a different review.\nQuick summary? If you are in the neighborhood, not too hungry, like self-important hosts and can't find anywhere else, it's not a bad place to end up...", "author": "Bruce J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-02", "description": "My third and final course for our weekly office lunch was from Castro Republic. Our delivery order was scheduled to arrive on Friday, September 28th between 11:30am and 12pm via Caviar. It didn't arrive until around 1:15pm, which means it was over an hour late. Not sure who's fault this was, but as a result, everything was lukewarm. Plus, they forgot an order of flautas, so someone at work went lunchless.\n\nTacos de la Republica: Your choice of meat or veggies, 3 tacos on organic corn tortilla, onion, cilantro relish, lime, and roasted tomatillo salsa ($12)\n*Beer Marinated Steak\n*Al Pastor\n*Adobo Chicken\n\nI adore tacos, so I figured this was a good way to sample a few. They all had pretty good flavor, but at $4 each, I found them kinda small. They were basically the size of a bigger street taco. Plus, they needed some salsa or something to give some of the meat moisture. I had some hot sauce at my desk, so I just used that. At least that gave them a little kick. A coworker ordered the plantains and hated them. And she loves plantains. Unfortunately, they ended up discarded. \n\nKind of a fail of a lunch order. My tacos were okay, but they were definitely not worth the wait. If you're hangry, don't order delivery from here. You'll be starving by the time it arrives.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "First time Taco Wednesday night here. Very very tasty; taco truck style. $3 and $4 sangrias. Coming back to try their brunch menu soon. Great courteous service.", "author": "Moy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "I stumbled upon the Castro Republic today while looking for an early happy hour: while they were not having happy hour, they WERE having $3 Taco, $4 Beer Wednesday! I was happily surprised that for a vegetarian taco, they offered a $3 fried avocado taco with turnips, black beans, and salsa. It was delicious and I highly recommend. We also ordered the guacamole and they do not stint you one bit on guac! I had a pleasant early dinner and would go back if I were in the area. Thanks for a fun time!", "author": "Sydney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Was by this morning and have sausage an egg sandwich. Let me tell you it was delicious. It also Santos  y Geraldo are the greatest cook in the San Francisco Bay area. So if you're visiting San Francisco you have to check out the Castro Republic, one of the best places to eat in town. I highly recommend this place.", "author": "Dorian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Amazing food, friendly staff, all around good experience. Thursday night $5 tapas are buenisimas!", "author": "Justin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "FINALLY a place that potentially has staying power; as this place has turned over time and time again every year or so since forever.\n\nGood huevos rancheros, great chiliquiles, good coffee. Servers are friendlier on some days than others. Love the outdoor seating though you WILL be bothered by homeless psychotics. It is San Francisco, after all.\n\nPricey. Cute. Tasty. Sit inside if you don't want to be harassed by toothless Mike.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Came here for a solo birthday lunch.   \n\nI've never had a better quesadilla!!   Worth every calorie.   Light, flaky tortilla, delicious chicken, spicy sauce and pico de Gallo.   This place never disappoints.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Yummy mexican food in the castro. I came here with a group of four - we had some delicious margs, refreshing guac, and amazing enchiladas. I got the enchiladas with mole sauce - the mole was SO GOOD. Not over-the-top sweet, but with a great depth of flavor and very addictive. The chips that the guac came with were super crispy and the perfect match to the guac. I hope to be back the next time I am in California!", "author": "Preeti K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "4.5 stars but close enough to give it 5.  The food has been so deliciously consistent that the occasional service slips can't fault the restaurant from deserving the 5.\n\nFirst, we love that this place just exists.  The place is run by a welcoming staff that takes cultural pride in the food they serve.  And pride they should have because everything we've had here has been outstanding.  Their mole is superb and I would recommend anything in that form.  All of their tacos have not disappointed and the chilaquiles one brunch is something that I continue to dream about.  Really enjoyed their margaritas, never too sweet and just the right punch to make it a solid but not overwhelming cocktail.\n\nServers at very friendly and generally attentive. There have been a couple of times where we were left waiting for something but they remedied it and always with a positive attitude. They are very accommodating of children as well.", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "The Tacos were hella good, servers were great, friendly and really attentive. my clueless friend was able to ask for opinions on a bunch of things and they gave great options for us. \n\nAnd their Tequila Sunrise Mimosa was amazing!", "author": "Mark F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I am so happy this place is here! Way better than SliderBar that used to be there.\nThe food is amazing! So much flavor! (Get the shrimp tacos!)\nAnd even though the foods good, Jose is the reason I keep coming back. His service is really good. He's so sweet to guests and a nice guy all around.\nOnly place I go to eat when I'm in Castro.", "author": "Faris Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Came in yesterday for a friend birthday brunch and the food was amazing, staff was really friendly. I will definitely be back soon! Great Job guys!!!", "author": "Rigo Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "I came by last week for the first time. I live right around the corner, so I have no idea why it took me so long to stop by, but I am so glad I did. \n\nWe came by before watching the Derby, and realized it was Cinco de Mayo so you can imagine the place got crowded pretty quickly. We sat at the bar but had no issues. It was around 11am and there was no wait at the bar, and a short line for tables. By noon there was a short line but people seemed to be seated pretty fast.\n\nService was fast and attentive. They had Cinco de Mayo brunch and drink specials, and we went with classic Bloody Marias. They were great. They also had fresh watermelon juice, and although we didn't order it, it looked refreshing.\n\nThe brunch was on point. Everything was so flavorful, and exactly what we needed to satisfy our Mexican-inspired cravings. I had the Huevos Rancheros, and added carnitas. The person I was with had an order of the brunch special. It had eggs, pork?, and avocado among other things on top of a thick and fluffy tortilla. We shared a little of both and they were both delicious but different. We also ordered avocado toast to share. Avocado toast is avocado toast, but at least it wasn't $10.\n\nBefore we left, our server gave us a cookie on the house. \"You will love this,\" he said. We did, and we loved everything about the restaurant. We will be back for sure. I cannot say enough about the attentive, friendly, positive staff. Everyone treated us so well that it made the atmosphere awesome.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Fantastic! Came here for an impromptu brunch on Sunday. The food was impressively food and service was also on point. Staff were extremely attentive. I ordered the carnitas Benedicto which was a perfect Latin inspired eggs Benedict. The carnitas was juicy but not too fatty.", "author": "Grace A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-27", "description": "I really wanted to like this place - great location, casual interior, super friendly service - $2 taco Wednesdays!  Sadly, the food is just not that great, despite the $4 sangria.  Tacorgasmico, serving the same street style food, does it so much better.\n\nGuacamole was basically mashed avocados.  No salt, no lime.  Bland.\n\nWhite or red sangria was just fruit and wine.  No sweetener.  The waitress was kind enough to let me try both before deciding, but I like mine sweet, so I didn't like this version.\n\nAs for the $2 street tacos, you have to get 3, and they have to all be the same, no mix and match.  The fish tacos are not on special, because fish is more expressive.  I got chicken mole poblano tacos on recommendation.  It was good, but the poblano detract from the mole flavor.\n\nMy dining partner ordered the fish tacos.  They looked good - breaded, deep fried and crunchy, with a creamy green sauce.  He said they were tasty.\n\nIt's a shame.  I feel they are trying to do their own thing, but it could be a lot better.", "author": "Sondra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Surprisingly authentic and excellent food. We went in for breakfast on a Saturday late morning and found everything to be delicious, beautifully presented, and in exactly the correct proportions.\n\nThe service Could have been better, and I was feeling like we were a little bit unwelcome with my beautifully behaved five-year-old, but that's been consistent in this town at restaurants in the Castro.", "author": "Marcie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "This place is awesome! Great choices on the dinner menu AND...they have a breakfast menu as well as sandwiches and salads. The food was so flavorful. Two thumbs up! Great beer selection but only the standard type of margarita. They only have five different types of wine, but remember, YOU COME HERE FOR THE FOOD!! Didn't get the burrito, but saw one delivered and it was huge. Definitely a choice for my next visit. The servers were very friendly and efficient.  Would definitely come back...especially for the ElTaco Wednesday where they have $2 tacos, $4 pacifico and $4 sangria! \nHappy hour is M-F, 1-6 pm. Cheers!", "author": "Debbie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "How do I start AMAZINGLY GOOD!!! First let me start by saying the customer service was and is on spot.  I arrived with a coworker and the rest of the party was lagging behind so they sat us at the bar.  Again amazing got our drinks then sat us at a table, we had five in our party. \n\nJose was on point with getting our orders and the whole staff is so friendly always smiling and accompanying... we are meeting there for happy hour $2 tacos and sangria/beer. We will be back again and again great service.", "author": "RICHARD J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "I don't understand why you can get free refills on the iced tea and free refills on the lemonade, but not free refills on the Arnold Palmer.   That's what I was told by the wait staff.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "Brunch: 3/5\nService: 5/5\nAmbiance: 4/5\nOverall:  an ok place for brunch for the area.\n\nThe extended review...\n\nFrench toast combo - so you can get eggs and a side of meat with your order which is definitely what I did.  Some interesting flavors for the spreads one of which was mango.  I thought the French toast was ok but nothing out of the ordinary.  I did like the portion size though.\n\nService: the staff was friendly and nice. \n\nAmbiance: a very casual place", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-24", "description": "Great venue, service is OK, the Margaritas overpriced at $10 and lousy.\nIn general overpriced menu at a great location.", "author": "Denni P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "Had a wonderful lunch here today.  The mole tacos here are wonderful.  I could eat them every day.  My wife had enchiladas which were also equally delicious.  It was all so packed with flavor.  We loved it.  My daughter even ate most of her cheese quesadilla.  Thats a win in our book.", "author": "Zen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "It's refreshing to find a down-to-earth spot with really friendly genuine service, quality food, reasonable prices and simple dining. Castro Republic offers a menu selection of authentic Mexican dishes with a California influence and modern flare.\n\nOn our first visit, we went on Friday evening intending to go down the street to a nearby spot, but opted for this location instead. It was busy, but we headed straight to the bar to be seated immediately. I ordered carnitas tostada and fried avocado taco, followed by a potato flauta garnished with fresh veggies. All equally tasty, with the exception of the carnitas which was cooked perfectly with the some crispy pieces on the outside, and tender on the inside.... winner, winner carnitas dinner! The SO ordered the asada taco with horesradish and chicken tostada.  The one thing strange about the tostadas and flautas is that they are priced individually, but you have to buy a minimum of two... so really should be priced for the true value to avoid any confusion. \n\nWe had such a great experience, that we went to brunch on Sunday. The SO got the California omelette that was polished off pretty quickly and I order the chorizo with eggs, corn tortillas and 1/2 black beans/potatoes. I also ordered a Michelada, to me is a beer version of a bloody mary that paired nicely with my meal. The portions were quite large so I was able to pack some for leftovers.\n\nWe'll definitely be back again, and of course if you want an even better deal, go on a Wednesday night for $2 tacos.", "author": "Nova P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Stopped here for a great lunch while apartment searching. Got a quesadilla with mushrooms. Larger than your average bar quesadilla and really good. 2 bottles of sauce with it in the side which is always a plus. Service was also great. Would definitely go back", "author": "Jillian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Remember when Yelp would give the example \"They have great mojitos here!\" to get people to give tips?  In those days, I would liberally give the tip \"They have great mojitos here!\" - wherever I went, wondering if anyone would pick up on the fact that they don't serve mojitos at Macy's.  (No one did.)   After 10 years, I can actually report (honestly!) \"They have great mojito's here!\"\n\nWe stopped in around 6 pm for drinks.  I enjoyed sitting at the table and watching the Market Street foot traffic.  Part of the joy of coming to San Francisco is to watch the foot traffic.  Men wearing dresses and walking down the walk ganley in high heeled shoes.  Youthful and energetic individuals with taunt skin sporting fashionable clothes walking with purpose in their stride.  Others wounded by life's arrows dragging themselves along - destination: nowhere.  \n\nOur server and mixologist were both pleasant and made us feel wanted - sitting at the table and ordering them around to get our drinks.  \n\n\"This is a good mojito!\", I told the mixologist.\n\"I made them myself!\", he said - face brighten to a smile.\n\"I know.\", I said solemnly.  \"I watched you do it.\"  Then I felt stupid, but it's a habit to say what's on my mind and follow it up with more useless information.\n\nThe Castro Republic is strange place to enjoy cocktails.  It doesn't have that atmosphere for quiet reflection - you know, lowlights, sad faces and grimey tables.  It's a place to laugh, be happy in the sunshine and enjoy the fresh air that pours in over the transoms.  If you are enjoy laughter, sunshine, fresh air and good mojitos, The Castro Republic might just be the place for you.  It was for me.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "The only brunch spot in the area that didn't have a waitlist, my friends and I decided to take a chance on it and were pleasantly surprised!\n\nA bright spacious spot with lots of windows and outside seating, the service was fast and friendly, the menu had something for everyone, and the food was delicious! \n\nThere are great vegetarian options which is pretty standard at a Mexican restaurant. There are a few dishes that can be made vegan (disclaimer: staff warned that the food may come into contact with non-vegan ingredients in prep, if that's something you're concerned with). I ordered the platanos with black beans as a starter and fried avocado tacos and the mushroom and black bean taco - all of it sans the queso fresco and crema. :) \n\n I had a really pleasant lunch with my friends and was happy with my experience! It isn't really a place I'd go out of my way to go visit again, but it's nice that this is a restaurant in the area that you can count on to seat you if you're not down to brave an SF brunch waitlist!", "author": "Jackie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "The Castro Republic serves up an amazing crispy chicken torta and awesome micheladas!  All the staff is super friendly and very professional.  I will definitely be coming back here on a regular.", "author": "Mike F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "The staff is so friendly & helpful. And then there's the food.\nWonderful. Had the Verde enchilada with chicken, side pinto beans. Great flavors in the sauce. My order had a slight kick, ask for spicy if require more than one step above mild. Homemade lemonade & iced tea. Lots of regulars. Lots of tables inside & 6 outside. \nI've lost count of the restaurants in this location. Hope Republica stays for a long time.\nwi-fi !", "author": "Lynn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "The food here was delicious but the service was a little strange. When we arrived, the restaurant wasn't full but we were told that we couldn't be seated until our last guest is here. I felt that this is generally a policy for very busy restaurants / peak hours only (which it felt like neither). Also, we were a group of 5 and there weren't tables that sat exactly 5 (only 6/7), so it really wouldn't have made much of a difference for them because we would have had to take up that extra space anyway, if that makes sense. Regardless, we later on got seated and had to wait about 10 minutes or so until we were asked if we wanted waters (which came out another 5 minutes later). But overall, I found that the food was perfectly portioned and very reasonably priced for brunch. It was also a cute atmosphere and made for a good hangout spot.", "author": "Charmaine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "We ate here twice In same weekend. Both times food was good especially for the cost.  This review could have easily been a five star had the servers paid more attention and offered us refills. Never once did they stop to ask it wasn't until we flagged them down for our bill did we ask for a refill. Water and sprite was both out.\n\nWe ordered there tapas nachos they were really good if your okay with eating them without meat. I think there carne asada for steak tacos are way better then there chicken tacos. The chicken is too dry and flavorless for my tasting. It was hard to even eat with the sauces they give you. \n\nOther than that the wait time was zero both times and the food was delivered fairly quickly.", "author": "Deborah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "If you go to Castro Republic, try to get that table at the back. If you sit facing the mirror, you can bob your head back and forth and enjoy the spectacle that is tree/pole! On the left, it's a pole! To the right, it's a tree! Quite the deceptive pleasure!\nAlso, the food is good.", "author": "Jacey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Delicious food, fun atmosphere with the soccer game on, and breakfast all day on a Sunday was a hit with kids! The marscapone with the fresh berries and handmade French toast was fabulous! Fried avocado tacos were just the right size and well done, but the star of the day was the mole. Today is the first time I heard mole described as Mexican curry, but it's an apt correlation. Eat here. With kids, without kids, to watch a game, to enjoy a drink... delish!", "author": "laurie s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "We came here today for dinner.  This place is fairly new to the neighborhood.  Menu is creative.   The interior is rustic modern.  \n   The food was great and the drinks were even better.  \n  The service is a little slow so be prepared.  Wait staff is super nice.  Great place for dinner.  We will be back.", "author": "Jack O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "The Service was excellent, I was attended to right away on a Sunday. I just wish the  chips in the chiliquiles were still crunchy and it was a little too sweet.", "author": "Dee D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-22", "description": "I thought I was walking into a restaurant but it was really a bar. After being seated at a bare table and waiting 10 minutes in was just about to walk out when the waiter came by like a passing comet and dropped off a menu.\n\nAfter seeing the prices for simple items in was again tempted to leave. But I stuck it out. I was there for brunch so consider my opinion on context.\n\nI would compare this place to a host of low priced chain restaurants except double the prices and added city taxes. I was never thanked for my patronage and regretted having left a 22% tip. Even though the restaurant was across the street from my accommodations I did not return there. I left feeling unappreciated and, in fact, that feeling deprived them of what could have been additional patronage (and a better review). Maybe they are better at dinner, but I was so turned off I paased.", "author": "Evan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "First of all the service was awesome!!\n\nSecond the order was served at a decent pace\n\nAbove all the food was simply supertastic", "author": "Nirmal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Great food, cute servers and super relaxed environment.  Definitely the best Mexican place in The Castro. I'd say San Francisco but I know a taco truck or two that are too good. \n\nMy regular is a burrito de carnitas, which are perfectly seasoned and browned, not the soggy flavorless stuff you get at most places.\n\nOnly complaint is that the guacamole is quite limey (to prevent oxidizing and browning) and they have nothing truly spicy (like habanero or ghost pepper) However noting their main clientele it's quite understandable.   \n\nPs.  Anthony Burdain was right in that Mexican food is often underrated and under priced. This place is not cheap however it is quality.", "author": "Angel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-24", "description": "So this prime corner property in the Castro is now living its fifth life since I started Yelping, and I'm still not blown away. And isn't the Castro where you're supposed to get blown? Well, let me retrace its history. First, it was the dependable grease pit that was Bagdad Cafe, then it went down N'awlins way to become Criolla Kitchen, then it took a sharp turn into whatever land as SliderBar, suddenly it was the oddly named Ovok and then just as suddenly it wasn't, and now it's The Castro Republic.\n\nI don't know when the neighborhood gained its independence, but I must have missed the Presidential motorcade passing by. The new owner, Juan Romo, also owns the less spacious Tacos Club across the street. He's also responsible for four Mexican places in the East Bay, so he certainly knows his food. I just wish he went for more authenticity with his menu. It seems like he's trying to compete with Tacorgasmico down the street and Tacolicious, magnets for the skinny hipsterati with their generic bar bite appetites and entitled attitudes.\n\nThis sure doesn't feel like a Mission taqueria, more like SliderBar redux with barely an accent. Jamie W. started our meal by sharing the $8 Guacamole, which was refreshing topped with chopped tomatoes, red onion, and cilantro. The chips were clearly house-made, thick and crunchy (photo: http://bit.ly/2gFVKGL). Good but pricey, a consistent theme. Jamie decided to try their $9.60 Burrito de la Republica, which was stuffed with green rice, grilled onions, black beans, and their house-made salsa. For an extra fifty cents, he had cheese added, and for another fifty cents, sour cream (photo:  http://bit.ly/2fuuvKk).\n\nNow $10.60 is not highway robbery by any means, but it still felt like there was a bit of nickel-and-diming there. It was hearty though nothing about it really stood out from any other overstuffed burrito you could find within a five-block radius. I ordered the $13.80 Carne Asada Quesadilla de la Republica (photo: http://bit.ly/2gG4Sej). It was a bountiful portion, quite tasty and really enough for two, but then again, it would have been nice to have a smaller option with a lower price tag. The place was filling up quickly with the young and entitled, which was our cue to leave. The friendly staff keeps things going at a good pace.\n\nFOOD - 3.5 stars...solid takes on Mexican standards but nothing out of the ball park and rather pricey to boot\nAMBIANCE - 3 stars...so familiar\nSERVICE - 3.5 stars...friendly when available\nTOTAL - 3 stars...this republic needs to raise its freak flag a bit more", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Terrific place serving really good Mexican fare and drinks only surpassed by the fantastic service.\nWe've been coming here since it opened and it never disappoints. That said, they've replaced the delicious fish tacos with chopped shrimp tacos which I'm hoping they'll swap over again. Also, their previous recipe for the fried plantains was far better too. Hopefully, they'll revert back to the original fish tacos and fried plantains.\nAnyway, if you're ever in the Castro area, this place is definitely worth a visit!", "author": "Foofa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "Just ok. Weak Margaritas are $3 overpriced, and mole (my judge-all dish) was far too sweet--almost like Hershey syrup over the food.", "author": "Randall S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Always great food and an awesome vibe when we come here to eat! Estella feels like a personal friend and always greets our group with hugs! \n\nI look forward to coming back here again and again! FYI...Try their shrimp ceviche...you won't be disappointed!", "author": "Ray C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-30", "description": "Chill spot. Pricey for Mexican food, but it IS more sophisticated than your typical Mexican eats. I could see this as a popular spot to chill for those who live in the area - not a destination spot though.\n\nI believe it was $3.50-$4 for tacos, $8 for guac, and $14-15 for a plate.\n\nWe opted for the mole since it was one of their signature dishes. It was ~$14 and although it came with a decent amount of chicken for the price, it only came with 3 small tortillas and a tiny bit of spanish rice and beans :(!! A bummer that they didn't provide more of the 'cheaper' filler stuff to make it seem like a better value. The spanish rice wasn't that flavorful and a bit soggy, and the beans were whatevs. Tortillas were soft and doughy though! The meat to 'stuff' ratio was pretty high and we finished our sides faster than we did the chicken...\n\nAnd so, we ordered the guac/chips to round out our meal.\n\nThe guac is pretty fairly priced. It comes with I think a flour-based (NOT CORN!) chip. Nice, thick and freshly fried. Some pieces were a bit undercooked, they could work on cooking it more evenly.. and a dash of salt would go a long way! The guac seemed like maybe 1-2 freshly mashed avocados with a generous amount of lemon juice. No onions/tomatoes within the guac, it actually came as a tiny scoop of pico de gallo on top. Overall, pretty good, I would get this again but I do prefer a corn chip, or it would be nicer if they salted the chips a bit.\n\nI don't think I would return as there are plenty of other restaurants in the area I haven't tried, though I would TOTALLY come for their Taco Wednesdays if I ever had the chance.. except I don't think I would ever be able to get to the Castro before 6 on Wednesdays :(", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Great place for breakfast this morning. Had the spinach scramble (no meat). Was great. The green sauce they have is also excellent.  \n\nI sat outside because it was a quiet time at the restaurant. Prefect weather today. Fun to watch the people go by. It's on Market so you are by a busy street but I really didn't notice. \n\nGood service. Also!", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Found this place because of the great yelp reviews. We were greeted right away and chose to sit at the bar. Our friendly waitress recommended the mole enchiladas and split the order for us to share. Amazing taste comparable to mole from Oaxaca. We also enjoyed the tacos al pastor.  Headed back there tomorrow to try breakfast and brunch.", "author": "Alicia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "Given the 4.5 average rating, my expectations where high.  Unfortunately  the food was not very flavorful.  My mole poblano chicken was more like a shredded chicken in red tomato sauce with not much flavor, maybe they ran out of mole?  Very disappointed.", "author": "Dee Dee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Absolutely loved this place on our visit to San Francisco. Chose items off the $5 special menu and they were delicious!! They forgot to bring out a plate of nachos and they comped our bill and brought out two extra plates of nachos! By the way, best nachos i've ever had in my life! If I come back to the castro, i'm definitely going to make sure I stop here for lunch or dinner. Keep it up guys!", "author": "Patrick O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "More like 3.5 stars but I'll round up for the friendly service.\n\nI stopped by for a late lunch on a sunny but windy afternoon.\n\nNot too many people inside but that was fine by me. I stepped up to the bar, ordered a beer and ordered an al pastor burrito.\n\nThe burrito had tons of flavor and I like they had little grilled bits of pineapple inside too. Just the right amount of spice too; I didn't need to add salsa. The weird thing is that it just came wrapped up in tin foil and dropped on a plate. That was some pretty poor plating - might as well have gotten it to go. The size was pretty hefty but for $12 it really should be.\n\nThe waitress/bartender was very attentive and when they were fixing the bathroom she noticed I needed to go and she allowed me to go to the additional employees bathroom; a very nice gesture.\n\nIt's not too far from work so I might plan to come back for a relaxing lunch.", "author": "Art O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Great service, great food and awesome environment.\n\nWhile exploring the Castro district in San Fransisco we stumbled upon this spot. It looked very inviting and smelled really good. The server set us up at a table outside and really went out of his way to make sure the environment was perfect for my wife and daughter. \n\nVery nice guy who explained the menu and specials well. We all changed what we had planned to order and tried some new options. WOW, this place was really good. My wife never orders a burrito anywhere and finishing one would not be an option. She was loving the one she got and almost got 80% of it.\n\nI went with enchiladas and they also were great choices. My daughter got a couple sliders and they where also unique and over the top. She is a picky eater sometimes and she worked them sliders down. We had no left overs at all and walked away full and happy.\n\nDid I mention the bathroom was super clean. Sometimes out with family that can be such a biggy, it was nice hearing my family say they womans room was very nice and seeing they had a very clean mens room too.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "This place is absolutely wonderful. The service is amongst the best I've ever experienced. I went with my sister for Mother's Day and they gave me a rose it was so sweet. The staff there is absolutely incredible such a sweet group.", "author": "Din Marie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "I love this place! The staff is so friendly and the food is delicious. The service is awesome, I have had José as a waiter twice and he has a great attitude and so accommodating. Highly recommend the cinnamon swirl French toast and the shrimp tacos! One of my go to places in the Castro and very dog friendly.", "author": "Alexa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Come on a Wednesday for $2 tacos!\n\n\nI came with a party of 10 around 9pm and we were seated immediately. We ordered about 4 pitchers, 30 tacos and 3 burritos between all of us and they all tasted great! \n\nI'd recommend the carnitas and chicken adobo tacos. They mixed up quite a few orders but comp'ed us all and  brought us the correct ones.\n\nHighly recommend coming in on a Wednesday to take advantage of their taco deal. $4 for a taco (quite small in portion size) isn't worth it.", "author": "Jasper L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "5:5 for service and interiors. 3/5 for food\n\nThe service was excellent, I asked for no cheese on my tacos but when it came with cheese my hostess just ordered an extra two tacos no charge. She was very smiling and friendly and even have us chocolate at the end of our meal to celebrate Valentine's Day \n\nWe got the chicken mole tacos and pork taco. Pork taco was good but the mole was, well, decent. I've had mole before so I know it's a unique taste but since they take a minimum of 3 mole tacos per order and also highlight it in their menu we thought it was a little bit of a let down. \n\nNevertheless this place is good. Since they have some big tvs I wouldn't mind coming here for a game night when I want to dodge the crowded and rowdy sports bars. This place also has a bar although we didn't try their drinks. \n\nWould definitely give it another try.", "author": "Arjan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Great friendly staff.  Their festival menu is great with $5 items. Available from 4pm-11pm on Thursdays and Fridays.  Food was great and filling!", "author": "Frisco T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Inexpensive delicious food in the castro. I had the mole tacos which I was imagining as tacos with a mole sauce over them. Instead it was a thick paste over the meat. It was delicious and easy to eat as a traditional taco.   I defiantly will be returning to try some of the other dishes. The staff was super nice as well", "author": "Lance M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "Yum yum yum. This location has turned over as a few times and didn't notice until a friend dragged me in that it is most recently Hispanic flavors, my fave and boy did it pack a punch of flavors here to stay! Got the chilaquiles and the California omelet. Both were incredible the mushrooms in the omelet were so good I don't know what flavor they added but I swear I have never just wanted to pick the mushrooms out of something and just eat that. This place was great for an early breakfast! Brunch is tough around here and you hit it out of the park. Service was good and a large size restaurant so lots of tables and patio seating too.", "author": "Morgan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Service with a smile. The food is fresh and beautifully presented. \n\nI got the avocado toast with eggs. My partner got the chilaquiles. We shared the chips and guacamole. Perfect ratio of chips to Guac. Would come back and recommend", "author": "Myrna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "This place is bright and lively, open and airy. The ambiance is welcoming. The staff is unbelievably polite; prompt, friendly service, the food was very good. We had the flautas and crispy chicken sandwich. The iced tea has a hibiscus flavor complimenting the food. Indoor and outdoor seating is available. Place is very clean. \nWe would come back.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-17", "description": "Went for Sunday Brunch with 5 people. The service is professional, but could use a bit more thought. I may be wrong, but shouldn't they bring butter when they deliver toast to the table?\nThe food is good, I tried several of the dishes of my friends. This is a solid place to go in the Castro. Eating al fresco on the sidewalk is very nice on a fine day.\nWhy I only gave 3 stars is that, at least for me, the menu is too fussy, and 3 stars is shown as \"A-OK.\" I suppose fussy (nouvelle cuisine) is what the public wants. They sure didn't like the previous restaurant, \"Slider Bar.\" (I did). It would have been nice to get some regular pancakes and bacon without spending $23/person. It's pricey. But welcome to SF.", "author": "Andreas M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "Pros: The location is amazing, ambiance casual but nice, and it's a great spot for a group dinner. Everyone orders at the register, making it easy to split the check with a group. The sangria and truffle fries were good, I would come back for drinks and apps since I live in the area. This place (regardless of it being Slider Bar or Ovak) is always killing it with the music! Great playlist of upbeat R&b.\n\nCons: The service wasn't great- and we were the only party there. Had to flag down the server when our water was gone, and there were no paper towels left in the bathroom. \n\nThe price point is high for what you're getting.", "author": "Leeyen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "My new favorite place for brunch!!!!! Street parking can be tough so add extra time to find parking.", "author": "Karla C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "The service here is odd. A few examples: one bartender said they don't have sparkling wine or champagne, yet they serve mimosas. A different bartender got me a glass of sparkling wine. We asked if a game could be put on one of the screens, but 15 minutes later with the reminder request, the game was  already over. Good luck trying to get them to notice your credit card with bill. We had to go to the register to pay. We were the only people seated at the bar and they were not busy. The food did look ok good from what we saw come out.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "We are here on our first night in SF. Tasty, well priced food and drink and very friendly and quick service. The 3 mix and match tacos were excellent", "author": "Luke O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "What a strange place. We were in town from Chicago and wanted to grab a quick bite before heading out in the Castro to bar hop a bit. We specifically were looking for Mexican and despite being new saw 4.5 stars for this place. It seemed perfect. But, when we got there it was pretty dead inside, the server was friendly, and the food was good, but it was just an odd experience. They have wine and sangrias (no margaritas?) that were really sweet and not great. We asked for chips and guac to start but just got guac with our burritos and had to ask for the chips after. It just sort of floats in-between a sit-down place and counter service, and I think they would be better off just going more casual and having people order at the counter for a quick bite.\n\nAlso, there are signs that  you get a free drink if you review them on Yelp, which I think is the reason for all the great reviews, which seems like a disingenuous way of baiting 5-star reviews...", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Great place to sit outside on a sunny day enjoy some tacos and a beer/glass of wine/margarita. Service is great, tacos are really well done, fish tacos were amazing, so were the avocado tacos, and fried plantains.", "author": "Jessenotpatrick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Went and tried this on a whim today and boy am I glad I did!!! The server Ana was such a sweetheart and had such a welcoming and sweet disposition. The great latin music filtered through the speakers spoke to my little Mexican heart...\n\nI saw that they offered a Taco Wednesday at $2 a Taco and $4 Beer and Sangria....HELLO!!!! I ordered the Mole Tacos and the Al Pastor with pineapple...Sooo Good and tasty little devils. The hot sauce was amazing and gave the food a great kick. The Red Sangria was tasty and potent, not too sweet...perfect!\n\nI looked over the menu and will definitely be back to try their other food offerings in addition to the Breakfast/Brunch which looks amazing. I highly recommend the Taco Wednesdays! Will be back to check the rest of the menu....", "author": "Roberto R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Love this place for brunch. I usually get chilaquiles and sangria. Cool staff! Love the location as well.", "author": "Wade W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "My family & I hit this place right @opening on Friday (5/19/17) prior to taking our kiddos to see the Castro.  First off, the only server working (I'm an ass - I didn't ask his name or check the receipt) was close to rock star status.  Only server working but knocked it out of the park on being receptive to menu questions, doting on our table, and putting off a professional yet warm vibe.  \n\nAs for food, it literally took me one bite of my chilaquiles (w/chicken added) to form one regret about this place - it wasn't located in our home town for us to be able to return more readily.  The hunks of chicken in my dish were enough to make me wanna cry - if I could make poultry that tender yet not dried out I'd be a proud chicken chef.  Awesome ratio of cheese / chicken / scrambled eggs / sauce & tortilla chips - it really really hit the nail for what I was hoping it would be.\n\nTo continue the chicken theme - my wife's \"crisp-chick\" sandwich (one of the server's favs, and now one of ours) she was kind enough to offer a bite of as soon as it arrived.  Here's the deal - I usually decline a sample until I've eaten my own food & my wife has finished what she's going to..but in this case that sandwich looked so great I couldn't say no I was sooo glad I did not.  I was even more stoked knowing whatever she didn't eat was going to be mine because it was that great - spiced crisp chicken on soft bread w/pepper jack and some heavenly sauce.  I wished I had a cow's four stomachs so I could pack one with this sandwich on top of the chilaquiles I'd already inhaled.\n\nThe kids both rocked the silver dollar pancakes.  I even sampled a bite of these since our son offered.  And yea, whatever jerkwad was working the griddle nailed these too.  Jerkwad? Why the animosity?  Because both of the fruit of my loins said these pancakes were better than mine at home - hence the animosity.  Not surprisingly, our 8 and 10 year olds opted to go straight maple syrup on their hotcakes & took a pass on the mango butter & the mascarpone cheese on the side.        \n\nMore kudos to this place for being so clean it looked like you could eat off the floor (yea we came right @opening, but the lack of a single cobweb in a hard to reach corner & no dust shimmering in the sunbeams is a hint)...also the location - it was right off the stop for the Muni \"F\" line streetcars we took (because we were tourist-ing) & had prominent signage which made it easy for this old dude to spot before we had to roam aimlessly whilst starving.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Quite possibly the best Bloody Mary I've ever had.  Inside is very nicely decorated and the food for brunch was fantastic as well.  Wait staff is great and very friendly. I'll be back!", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "So good...salmon egg scramble, shrimp burrito, and cheese quesadilla were all excellent...huge servings, so glad two of us split the burrito.  Jose was very friendly.  Gorgeous and quaint, clean too...great lunch!", "author": "Melissa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Tacos=they're delicious \nBeer list=it's great\nAmbiance=wonderful\nService=awesome\nI love coming to this place, the neighborhood is great, the people who work here are happy, the Wednesday night specials are cheap for the quality of taco you get, the music is fun \nMy new neighborhood Mexican joint", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Got lucky and found this place on Wednesdays so tacos were $2 each (fish taco was $3.50) instead of the usual $4 and a glass of sangria (white or red) was $4!! I guess because it was Wednesday and everyone knew about their deals, my friend and I waited about 20-30 minutes for a table. Once we were seated, we ordered our tacos and drinks...and then had to wait another 30 minutes until we received our food. One star was deducted for the wait time for the food. The restaurant should know that Wednesdays will bring in a large amount of customers so they should adjust the kitchen staff to decrease the wait time. I also had noticed that another table that had been seated way after me had gotten their food a lot faster as well. The waiter had even came by while we were waiting asking if we had received our food yet, which I replied no. He said he would check on it but never came back. \n\nOnce we had gotten the food, the tacos were DELICIOUS. My recommendation is to eat the fish taco last because I had it second after my steak taco and everything after the fish taco just didn't live up to those standards. I do agree that $4 for tacos normally are a little price-y but definitely go on a Wednesdays when they are $2 each but be ready for the lines/wait/lack of service.", "author": "Ruby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Missing my family and friends, so I had the Cubano Benedict. Why hasn't Miami come up with this?  Slow roasted pork, thick slice of forest ham, poached eggs with  spicy hollandaise sauce. Did I mention amazing!!!! So, this is my cheat meal for the weekend, but so worth it!!!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "Saw their Wednesday $2 taco special on my way to the farmer's market and had to check them out. They also have a $4 beer or sangria special during taco Wednesday. \n\nService was excellent. I got one of each type of taco to try for my first time. Order was to go and servers were very nice. I had to sit around for 10min waiting for the food but that meant the tacos were made fresh to order so I didn't mind. \n\nFood was a bit of a let down. Menu looked amazing and I was excited to try their \"famous\" adobo chicken tacos which only come in orders of 3 tacos (no single taco orders). They had two vegetarian options: deep fried avocado with black beans, or veggies including grilled onions and mushrooms on black beans. What can go wrong at a place that fries avocados? NO SALT. The different tacos had various spices but nothing popped because they did not salt the food at all. Tacos came with two house made salsas--red and green, both of which were bland and flavorless. Again, no salt. The food looked delicious and you can tell they used quality ingredients but everything really desperately needed a healthy helping of salt and seasoning. \n\nI probably wouldn't eat here again because I just wasn't impressed by the food. There are far too many other delicious options in the neighborhood despite the initial appeal of the $2 bargain. Excellent location with plenty of outdoor seating though. Probably much better as a place to sit with a friend for a sangria or beer than an actual meal.", "author": "Betty R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "This place was cute and elegant. Very nice staff, and perfect food. I love quesadillas and this was definitely in my top 3. I will definitely eat here again when I come back to San Francisco!", "author": "Curtis B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-10", "description": "If you want unauthentic, Americanized Latin food, this is the place for you. Most of the items are predominantly Mexican, with some hints of Peruvian (ceviche), some hints of Caribbean (Cuban sandwich), and even a dash of Asian (papaya salad--really now?). The menu offerings are pretty expansive but all over the place. Instead of being all over the place, I kind of wished that the restaurant focused on a particular region of Latin cuisine (and actually cooking those dishes well) instead of offering dishes (which might not be the cooks' specialities or expertise) from all across the Latin world.  \n\nCame here with a few friends last week. For my entree, I had ordered the chorizo/potato and carne asada tacos. Both of which were salty but lacking depth or flavor. The chorizo taco was also pretty oily (as expected since chorizo has a high fat content).  As an appetizer, I ordered the fried plantains which were served in a wet goop of black beans and sour cream and cheese. The plantains were the most disappointing aspect of meal because they were semi-fried -- not heavily fried enough to make tostones and not sautéed enough to make maduros. Instead what was served was undercooked, slightly raw tasting plantains that were also bland. I like my plantains either caramelized (and sweet) or completely deep fried (and crunchy and perfect for dipping or snacking). However, the plantains sadly were neither of these.  Also, the black beans that the plantains didn't seem cooked either- they were cold and looked and tasted like they were just poured out of a Del Monte can of black beans. No bueno!\n\nFrom lackluster tacos to poorly cooked plantains with canned beans, I can definitely say my meal experience was a disappointing one. Most people in San Francisco go to the Mission for Latin food; they don't go to the Castro for that. I definitely would stick to that general rule and skip out on food here. Do yourself a favor and go to the Mission if you want more authentically cooked tacos or plantains.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "We doctored up the guacamole with a little extra lime and some hot sauce which made it perfect! The drinks were fantastic as well as the tacos. We tried the mole, fish, pork and beef tacos which were all superb. Would definitely go here again.", "author": "Angelia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "This place has delicious food. Every time I visit here I'm amazed by the great mix of flavours.  Spinach scramble is my personal favourite.\n\nThe staff is very friendly and cater to your dietary restrictions. It's a great place for low carb Keto options and they will customise the dish for you.", "author": "Saumitra V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "The plates are large and filled with amazing Mexican food. Worth every penny. The servers here are some of the nicest people I have encountered at a restaurant. Their appetizers are no joke.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Decided to go here after line too long for Starbelly. Great call. Good service. Great food ..very fresh ingredient. Good experience. Hope the neighborhood supports this restaurant. I think some people don't realize it's changed hands and is not that average burger place there before.", "author": "Fred R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-18", "description": "Went today for dinner. It was eh. Seriously nothing spectacular. Not even good. I felt ripped off: the food was bland and some was over priced for what it was. Nachos with no meat on a tiny plate for $13! No cheese, just black beans, some guac and sauce. I regret not taking a photo to show. I ordered fish tacos. It was bland and it was more deep fried batter than fish...fish sticks taste better. The mango salsa on it was good though cause the mangos were ripe. The bbq chicken salad was large, but also not worth it due to it being smothered in dressing. Maybe it's just me in this city, but I work hard for my money and to have the food we had today was just crappy. Not worth the $67 after tip. It was not impressive nor any good to revisit. They were nice and the food came out quick. We did come to eat at 5:30. I can see how it may be worth it for Wednesday night taco specials maybe for the crowd that it would get (?). Basically, I'd stick with a taqueria that would serve better tasting food and I wouldn't feel crappy for paying for extremely overpriced below average food. I don't know why they have such a high rating on Yelp. Yelp failed me majorly this time. Ugh, second time in less than two weeks.", "author": "Anh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "First, the staff are extremely kind and take great care to be sure everyone enjoys themselves. Next the food is outstanding!! Get the mole or chili relleno. 100% would recommend.", "author": "Tosh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Absolutely delicious! Loved the mango fish tacos and al pastor tacos. Fantastic and friendly service. A can't miss for lunch!", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-04", "description": "Drinks were decent and the location was great! expensive   but will pay for the view of cable cars.", "author": "Ichi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "This place is ridiculously and surprisingly good. I had some tacos (tempura avacado, mushroom, and pork). \n\nMaybe the best tacos I've eaten. Had zero expectations and they were totally exceeded. Come and eat some tacos and have a beer. You won't be disappointed.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Love this place. The food is so good and we always have the best service. The mole and chilaquiles are fantastic! Highly recommend!", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-27", "description": "Good Food Shockingly Expensive. \n\nHad tacos and the chili relleno. $4 each for a tiny taco and $16 for a chili relleno plate.  $7-$9 for a draft beer is nuts. \n\nThe food quality is good but I can't justify spending that kind of money on a taco. \n\nWon't be going back with those prices.", "author": "Jim O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Great food , love the fried plantains with black beans and cheese , the girl serving was really nice always smiling and making jokes I appreciate a good Server and she was amazing.", "author": "Simon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "I came here yesterday with a friend who lives around the corner.  She had the quesadilla and the draft root beer, and I had the chicken mole tacos and a Lagunitas.\n\nThe tacos were awesome!  They are small - like traditional tacos, not all those tacos you get from super American-ized places, so the 3 per order minimum is a reasonable amount of food.  The mole is one of the best mole's I've had in SF.  It's spicy (YAY) but also has a lot of depth with the chocolate coming through just enough to remind you it's in there and enhancing the spiciness.  \n\nThe new owners have updated the space - including the bathroom!  The last time I was in the bathroom, it was disgusting.  It's now pleasant and very clean.  The whole restaurant feels clean and like it should be free of its troubles with the Health Department.  It has a welcoming, casual decor, fresh blooms on the tables and a great location.\n\nService was extremely friendly and attentive.  I suspect they have read the other reviews and responded :)  They offered my friend multiple free refills on her root beer which she happily accepted.  (I tasted it--that specialty draft root beer isn't even comparable to the regular mass distributed kind!  It *almost* made me want some instead of my beer).\n\nThe menu feels a little all over the place.  It is most heavily Mexican, but they have things like sliders and fries and typical brunch food on the weekend.  Given some of the other reviews, if the non-Mexican isn't their specialty, narrowing the menu to just the Mexican options might be a good move for them - easier/cheaper to buy for and better for food quality.  I'd definitely go back to try other Mexican items on their menu after having the mole tacos.\n\nThey have a good selection of beers on tap and several sangria options.  \n\nThe prices are definitely higher than your standard, hole-in-the-wall taqueria, but I thought the ambiance, service, and drink selection make it worth it.  This is a neighborhood place to come with friends for a leisurely, casual, fun drink and meal versus an in-and-out stop after drinking or when you're in a hurry and just want to grab a bite to eat on the go.\n\nI hope these guys succeed.  It's the best place that's been in here since Baghdad Cafe.", "author": "Sara E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "We walked in here on a whim and ended up deeply disappointed. $38.00 ($43 with tip) got us two tiny sliders, two beers, and a thing of fries. I live in SF and am used to paying insane prices for things but I can't believe that we paid that much for this little. \n\nWhen they dropped the food off we were both shocked! I posted a photo of what we got - look for yourself! We definitely won't come back here.", "author": "Whitney D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-06", "description": "I come by here almost on Wednesdays for the taco Wednesday special. Unfortunately my work schedule was a bit hectic today, so I was not able to sit down and eat. I wanted to place an order to go and I was told that I could not take the 'taco Wednesday special' to go...it only applies if I eat at the restaurant.\n\nI understand the desire to make your restaurant look full. I'm also shocked you guys can be so shortsighted. Not a fan and I will most likely not return.", "author": "Fabian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "I really enjoyed The Castro Republic. Easy to grab a seat at the bar, very friendly service, killer Bloody Marias + garnishments. We enjoyed the Huevos Rancheros and Silver Dollar Pancakes w/ strawberry butter. Solid brunch...would totally return.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "I have had the same salad four times now. The first one rocked! I second time the chicken was dried out and over cooked. I let that slide. The 3rd time I asked for salad to go. There was no dressing and they forgot the  avocado. Now this last time they forgot the BBQ sauce on the chicken. Bottom line is they are very inconsistent! \nOn a good note, the guys who work there are very sweet and attentive. I think the cook(s) are making it very hard to come back.", "author": "julie t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "They have been open for just over a year, and I hope they continue to thrive. In the Castro District, this place serves nuestra mexicana cuisine - fresh, inventive but yet authentic. I dined with 3 others, and we all thoroughly enjoyed our meals.The owner and servers were helpful and a pure joy. Great beer list too! I'll be back if my travels takes me back to the Castro again.", "author": "Ron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "It's a good spot to catch any games.  Came here for the NBA finals and it was extremely welcoming.   The owners are super sweet.  \n\nTheir sangria pitchers are only 20 bucks and both the red and white are worth trying.  Their tacos are some of the best tacos I've tried in the Castro.  Their carne Asada tastes pretty authentic and the fried avocado tacos are soooo good.  Also, 18 dollar bottomless mimosas on the weekend.  \n\nI really hope this place succeeds! Come support!", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "I really really like this place. Been here a couple times and haven't been disappointed. I recommend grabbing their mole or chilaquiles. The servers are all really nice and super helpful. The wait can be a bit long during the weekends though.", "author": "Cornelius V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "The best mole in town !! Oh yes!!! The best fried sweet plantain !! Another hit !! Pleasant waiters and  bright interior!! Great place to grab some good Mexican food in Castro !!! Oh and they have good vegetarian options !!", "author": "Raja K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Very much enjoyed my brunch there. The staff is extremely friendly, the food is really good and the place is beautiful, very clean, warm and inviting.", "author": "Lucky S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Beautiful atmosphere great food and drinks!! Even my young daughter cleared her plate!", "author": "Celi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "We just stopped in for some tacos and sat at the bar   All the staff we encountered were amazingly friendly and attentive even though it was packed due to it being Pride weekend. The drinks and tacos were delicious!", "author": "William O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "I see where other reviewers are coming from with the price point but whatever, this place is so good! We stumbled upon this place randomly last weekend and had to come back today to try more menu items. The fries are legit, the classic slider is tasty but go for the tacos! We've now had the chicken adobo tacos twice, amazing! And today we tried the mole tacos. I love mole, any time any place but I know a bad mole sauce when I taste it. Their mole sauce is AMAZING! The staff is super friendly too. If you haven't tried this place you need to! \n\nUPDATE 11/11/16: Still so freaking yummy and still the friendliest staff around. I could live on the mole tacos.", "author": "Nelly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Very fresh carne and fresh ingredients, fast service, friendly servers, clean environment, four flat screens, tons of beer to choose from, great tacos, amazing sangrias!", "author": "Carmin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "Not even close to 4.5 stars (maybe 2.5-3).  Had the crispy chicken sandwich.  Food was not very fresh and greasy.  I'm still not sure whether there was chicken between the breading...  Don't think I'll be going back.", "author": "Mindy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "This place is so bomb ! $2 tacos on wednesdays is awesome !! Their fried avocado tacos & pastor tacos are so delicious ! The atmosphere is super cute , especially at night outside ! The service is really great , and they speak Spanish & English . Definitely a regular spot whenever I'm by market", "author": "Kassandra A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "This is the place to people watch in The Castro. On a corner with a sky's worth of windows, bright and sunny. The lighting fixtures are made from old hardware from the kind of ladders that roll on a track, like in a nice book store. The service was outstanding, eye contact, smile...it means a lot. With the prices in this city, people like to feel like they are valuable customers...they do here. The menu was extensive for what I thought was a Mexican restaurant...it is that, but it's more than that. The food was very good but not perfect. I had the chicken Tostada. It was really tasty, not a word I use often. Fresh is maybe better, very fresh. The chicken was cooked different than the usual boiled...it was flavorful with all the tostada fixing on top with fancy sliced (little) avocado. There was just too much moisture in the plate and the crispy part was soggy. I like crispy, but maybe it's their style. The seating was awful...really uncomfortable, I sat in three different seats before I could sit long enough to eat but even that...I could;dn't finish my food because I couldn't sit there any longer. Why 4 starts...it was my first try there, Tostadas are like that sometimes...the service was that good. I'll be back and try something else...it's close to the fabulous Castro Theater so, there you have it...the price was low, I thought...I was out of there for under $20.00.", "author": "Rodney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Amazing service, amazing tacos. The quality of meat is high and the flavoring perfect. My favorite is the Tacos de Hongos - just the right amount of acidity makes the flavors pop. Prices are a little high, but if you go on Wednesday tacos are half price at $2. Awesome deal.", "author": "Rebecca A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "I'd been to The Castro Republic before (eating solo) but yesterday, I was joined by three others. Service was impeccable, food was wonderful. We were looking for a place to eat outside because we had a dog.  First we went to Squat & Gobble but they were full.  Then, I remembered The Castro Republic!  They looked full, but as we approached, my eye caught one table with 2 chairs. David (the owner or manager -- not sure) rushed two chairs out for us. We each ordered items that catered to our individual cravings:  Tacos, salad, chicken sandwich, and a burrito along with beers. Everyone was happy with their choice.", "author": "Tony A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "We really enjoyed our meals.  The food was solid- and I had a great bloody Mary.  Nice ambiance, and friendly staff.", "author": "Cory W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Love this place. My husband and I went here with our newborn baby at least once a week while we were both on paternity leave. Friendly staff. Great food. A neighborhood keeper for sure.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Very friendly service. Great beer selection. Tacos and burritos were good. The tacos were small but burritos were so big they're hard to finish. There's outdoor seating when the weather is decent.", "author": "Rise G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "I love this place! Really fresh food. Great service. I especially love the Cobb salad with crispy chicken. One order looks like it will feed two. I order the house dressing which is a citrus mix. I've had some breakfast dishes which were also tasty and well prepared. They have taco wed which sounds great also. Atmosphere is very pleasant. 4 large televisions to look at behind the counter but I'm happy with just reading or enjoying the company I'm with. If you want to go to a place for good food and a NO attitude sweet staff I encourage you to try it out! David by the way is super awesome could not be any sweeter and you'll be lucky to have him wait on you. What excellent service. Way to go David! Please clone this man!", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "I've only had the BBQ Chicken Cobb Salad (a half dozen times), but man it's good. Also, the service is always great -- everyone's really friendly and they seem genuinely interested in making sure you're taken care of.", "author": "Tim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Love this place and go often! Servers are insanely nice and attentive, food is great, and the big sunny windows make for wonderful ambiance and good people watching!", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Love this place! Super affordable delicious Mexican food with a fun vibe. I've been numerous times since I live in the area. I came for brunch and had their breakfast tacos....yum! I came for dinner and had their marinated steak burrito. Their steak burrito is so amazing. I'm not much of a burrito eater since I love tacos, but I'll def be back. SF people love their burritos and not sure why. I've been to all of the top rated burrito places and none of them blew me away. Come to Austin and we'll show what real Mexican food is like. However, The Castro Republic's burrito knocked my socks off. So delicious and def a must try. The staff members are really nice as well!", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "Delicious and expensive.  Sweet server (Estella).", "author": "Pat P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Food: Got the Crispy Chicken Sliders and they had good crunch to it. The radish and chipotle sauce added an extensive flavor to them. \n\nStaff: They were friendly and helpful.\n\nLocation: It is located in the corner of an intersection, hence it is a busy street. Thus for parking it could be a hassle since this is in San Francisco.", "author": "Gilberto A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Pretty good. Nachos are best ive ever had!!! And suuuper cute server! Oscar has the best smile!", "author": "Zee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "The chilaquiles is awesome. I think they vary the sauces, but we like the mild red pepper sauce that's typically used on the huevos rancheros. \n\nThe enchiladas, bacon and sangria are also very good.\n\nThe guys who work here are really nice.", "author": "Quags M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Pretty cool place on Market x Castro. Found the place while still riding my Hot Cookie high so I wasn't too too hungry. I got an asada burrito and added guac (under 1.50!)\n\nit's a sit down restaurant where you order at the till. nice atmosphere, attentive server, and good food for (a burrito) under 10 dollars.\n\nI give the place and 8/10.", "author": "Jaime V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Here for a late lunch and completely impressed. The sliders I ordered were delicious.  The fried avocado taco was fun and fantastic. My friend had the mole and it was some of the best mole I've had.  I'll definitely come back for the mole. \nTotally recommend.", "author": "Thomas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "I live in the neighborhood but didn't realize that this space had recently changed hands. I went into it today and boy was I pleasantly surprised. First of all, the restaurant is open and airy along with outside street seating. It is a perfect place to eat alone or with friends. The support staff seems to really like their jobs and David was just great in taking care of me.\nI had the silver dollar pancakes with real mapel syrup, fresh fruit, and sausage. It was delicious, cooked to perfection, fresh, and reasonably priced. The rest of their menu looks great and I heartily recommend trying this restaurant out...you won't be disappointed. T\nThomas Hyman", "author": "thomas h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Food may be overpriced but it's in the heart of Castro/market so it's understandable. The staff is so nice and they really make the dining experience that much more enjoyable. Nice selection of beers, wine and tacos!", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Good food & the friendliest service. Clean & well-lit space. Republic is our post-work taco & beer place now that El Mercado is gone :(....  So--only have had beer & tacos, but always have been refreshing & tasty fresh on all 4 visits now. Great people watching if you to talk a break from the conversation.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "Karin the server was very rude! Not friendly at all Took forever refill my UNLIMITED mimosas. French toast was pretty good but thats it!!!!", "author": "Carolina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Been here twice now. I love the food, ambiance, and service. Such a great place to go to for breakfast or dinner in the Castro District. Will always come when I visit SF!", "author": "Roland C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "The best place to go in Castro! Great food and excellent service! Carnitas Nachos are the best!", "author": "Anamaria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Such an awesome place for burritos. Great views. Carlos is the best host.  If you go there say hi to Carlos!!", "author": "Adarsh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "Service was awesome, and the food was good. But $4 for a tiny street taco is nuts....", "author": "Anders H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "Another 1st. review!  Yay me.  \n\nIn the old OVOK/Sliders Bar/Baghdad Cafe space.  Just opening and starting off, so I'll be extra nice and supportive.  \n\nThey have done nothing to the dinning area and are still selling Sliders.  They have added Mexican fare to the menu.  \n\nIt's counter service, which makes any meal feel like you are eating at McDonalds.\n\nFood was good. I'll return in a month or so and update this review.  Dinning room was VERY, empty.  Guess folks in this neighborhood still remember Sliders/OVOK's issues with the health department.\n\nI do wish the new owner success, and that they clean up the mess behind the building on 16th Street.  Getting rid of the trash containers would be a real BOOST to the neighborhood.", "author": "EC N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "I've only been here for El Taco Wednesday, which is a treat not to be missed!  Delicious street tacos for $2 (too many great options!) and $4 sangrias.  The restaurant was clean and service was exceptional!", "author": "Jeannette H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-30", "description": "Came in and ordered an chicken burrito for lunch. It was a nice size. I didn't know that a new Mexican place moved into the old Sliders location.", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Here's how I know how much I love this place. I was so sad to miss Taco Wednesday this week that I couldn't get over it and had to do come in on a Friday just to get my fix! The tacos here are the best in the neighborhood, the staff is phenomenally attentive and happy and friendly, the sangria is delicious, and the large windows or outdoor seating make for some great people watching. So happy to have this place in the neighborhood.", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "The food is amazing. I've had the Adobo chicken tacos twice now, I swear I want to lick the plate. The mole sauce is also incredibly bomb. I'm not a fan of truffle sauce on fries, so I got them plain. They were perfect. Fairly thick but with the right amount of crispy, seasoned perfectly. \n\nThe people complaining about the price obviously aren't aware of the obscenely expensive commercial rents. It's really not that bad for a brand new place in a prime spot.", "author": "Seth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Great spot! Very central, incredible food, generous pours of delicious sangria! Def coming back here!!!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Buenísimo ,  the food is great! and so are the servers.  Love the decor too.  I ordered mole tacos and they were the best I have eaten.  Will definitely come back and recommend this place", "author": "Maria Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "It's my first time in SF and I decided to try this place for my first meal in town.  It was great!  I was well attended to and the food was amazing.  I tried the Cubana Benedict.  Tons of meat (pulled pork and ham), perfectly poached eggs, a great hollandaise sauce, and a couple of peppers on top to garnish (I like heat....I wish there was like 10 more peppers).  Anyhoo....I'm hungry again....this place is great.", "author": "Asher P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "GREAT food, nice ambiance, and exceptional Customer Service!!!!! Definitely a neighborhood Gem, ESTELLA always goes above and beyond and she's so friendly! One of our Fav Spots, thanks for giving us a fantastic experience each and every time ESTELLA! :)", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "Posting a 4 because I haven't had the food, but the Sangria is fantastic & the service is sweet and always sharp!  Eddie has the best smile & makes you want to linger another drink longer!", "author": "Shelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "As a rule of thumb, I do not try a new restaurant in the Castro until it's survived minimum of a year. Finally I decided give this place a try after seeing the 2$ taco Wednesday, I was very pleasantly surprised. The tacos were made with very fresh ingredients and tasted delicious, we tried many varieties and the service was great. The tacos were small but I like the option to try multiple flavors without filling myself up on one flavor. Hopefully this place is here to stay!", "author": "R J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "I ordered the lamb slider and the spicy chicken slider. They were amazing ! Everything was hot and fresh. I also ordered a beef taco. Very delicious and reasonably priced. \n\nThe restaurant was simple and clean. \n\nThey had a great playlist going. \nA foodie and music lovers dream!!\n\nOscar was a great host and had really good suggestions", "author": "Jane D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-01", "description": "Really disappointed based off of the reviews on yelp. Came here with friends. Had chicken tenders and fries. The truffle fries were delicious; however, the two orders of chicken tenders were overlooked. They came to the table, almost black. They still had the audacity to serve it. We had to return both orders. Fish tacos, over fried as well. The carnitas nachos, the carnitas overcooked. The service was very poor too. Sorry, but reviews quite deceiving. Bette luck next time! But no, won't be back. Bye Felicia.", "author": "Danny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "The food is absolutely amazing! Tried the chicken burrito & fried plantains. Must have! Very friendly staff, a guaranteed good time", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Excellent food, great burrito and really helpful and pleasant staff. The interior is clean and nice. If you have some dietary limitations they will help you compose your meal appropriately. \n:-) \n\nBardzo dobre jedzenie, super obsługa,bardzo pomocna . Jadłam tam świetne burrito i mimo moich ograniczeń dietetycznych mogłam skomponować coś dla siebie. Polecam :-)", "author": "Agnieszka C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "My son took me here for lunch. We had a great time. Service is good and friendly, food was authentic and I loved the location and Windows.  I had the traditional carnitas plate with a side of fried plantains.  The meat was both tender and crispy. I also tried a cheriso taco. It was a little salty for me but the flavors were incredible.", "author": "Gail N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Stopped by here for brunch because it was rather empty inside. Ordered within five minutes, was excited about the choices, then sat down. The excitement ended after 45 minutes of waiting without having any employee checking in on us. After asking, we received our food within a few minutes. \n\nFrench-toast was good, but definitely a desert. Eggs were runny and not appetizing. \n\nWould give them another try, but wouldn't go out of my way to eat here or rave about it. The long wait for an empty restaurant for breakfast food just didn't cut it.", "author": "Joseph K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "This is my first time here. Very nice and clean. Workers are very nice! Had a michalada and it was amazing!!! And they have the dodger game on!!!I highly recommend coming here", "author": "Sean G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-24", "description": "It's good but not that good. Went there with my family and we had a perfectly fine meal. The price didn't seem exceptionally high and there was a good quantity of food; it just wasn't amazing or anything. There are so many great Mexican restaurants and this was just average.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Best Sangria around! Go for the red, it's more boozy. Apps are a great pairing. Thanks for a good time!", "author": "Jerry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Highly recommend this place! \nSuper friendly staff and great food. Also good selection of beers on tap.", "author": "Sylvestre J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "I need to tell everyone about this place! We got the Huevos Rancheros and the Tinga Enchiladas and they were the bomb (the enchiladas are a little spicy)! Margaritas were great too! You need to try this place!", "author": "Eric V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Stopped here on a Sunday afternoon. It was not super busy, and everyone was very friendly. The wine bottles used as water for the table was a fun touch, and reminded me of restaurants in France or Spain. I had the enchiladas de mole poblano, which were amazing. The rice was good, coffee was good. Great little lunch stop.", "author": "Nathan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Loved it! Small, not a lot of noise and food was great. We weren't really sure what to order so we took recommendations from the server. By the wait the staff was amazing as well. Definitely recommend.", "author": "Kathy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Happy to finally have something in this location worth eating.  The 5 tacos I had were superb. Tasty, and very affordable (on wednesdays!).", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "You really can't beat Taco Wednesday. $2 tacos and $4 sangria, a great atmosphere, and a friendly staff. It's quick, close , and convenient. Pictured: adobado, al pastor, and hongos tacos, and the red sangria. $10. Also, this review earns a free sangria, so what's not to like about that?", "author": "Michaelangelo V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Great food, good prices and very accommodating. The waiter changed the TV to the sports game we wanted, which was great. The truffle fries are so good! Will definitely come here again!", "author": "Christa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "I can't think of a better place to go on a Friday night for a drink and some food. Great place with great people!", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Very friendly staff.  Excellent sangria. Great location.  We were warmly greeted when entering as well. And they have a good music track, very upbeat.", "author": "Jerry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Wow! Well, that kind of sums it up! I had amazing sangrias white and red and to be honest, it was amazing. I have to to try the food next time. The tacos look great. Fun atmosphere, plenty of room at the bar, TV with the warriors and election coverage :( Anyway, if you are in the Castro and want a chill place with great drinks and authentic Mexican flavor, pick the republic :) cheers", "author": "William B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-16", "description": "A friend and I came in and sat down. Not a busy day at all. We asked for a minute to look at the menus as the waiter seemed to be in a rush to get us to order. He forgot about us for 20 minutes. Once there was no one in line or ordering, I came up to ask him if he could come take out orders. He told me that since I was at the register, that I would go back outside, get my friend, then come in to order since he only takes orders table side when there isn't a line. I looked around. It's just me. Really?", "author": "Harley A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Decided to make a quick stop at \"Republic\" Food & Bar to grab a bite after drinks at the Roof top. We grabbed salsa & pico de gallo and \"Pollo Asado\" burritos with everything on it. The chicken was grilled to perfection , very Juicy & tender and packed with flavor . Great place to stop for Mexican /American fusion fusion in downtown SF", "author": "Portia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Amazing food & friendly staff! The Mole Poblano Tacos are to die for!! - You cant go wrong...they have a nice selection of draft beers too :)", "author": "Gustavo G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "Went there for brunch.  The fruit was not fresh.  The burrito was bland and tasteless.  Eggs Cubana Benedict was average.  Service was really slow but waitstaff nice.", "author": "T D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Every time I come here I am happy with the meal, the service, and the beer selection. $2 taco Wednesday's are a win.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Super delicious food, fabulous service! Spicy does mean spicy so be prepared. They also offer a mild version. Had to stick with tacos since I'm gluten free and the don't have the menu marked. Would definitely come back. This place is 5-yums!", "author": "Dina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "Great food and location! I really enjoyed the chipotle chicken sandwich even though it was a bit small for what I paid for ($15). The staff is super friendly and they have a lot of beers on tap and tvs. The decor, though, doesn't seem to have an identity. I had no idea they served Mexican food until I looked at their menu which is amazing. I will be back but I hope the decor improves! Suggestion: add \"Mexican food\" to your awning!", "author": "luis m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "I always have a very pleasant experience going here for food or drinks. On one occasion the waiter was beyond helpful, knowledgeable, and overall some of the best service I've experienced - and I'm in the restaurant business. At other times service might've been a little slow but they were busy and still very nice.", "author": "Kristine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Fantastic, flavorful food at great prices in a trendy environment. The wait staff is friendly and accommodating. Whether you come for the great beers, $2 tacos on Wednesdays, or the heaping plate of black beans, plantains, and crema- you're in for a treat.", "author": "Cassie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "I just love this place- the food is so fresh, and their happy hour is wonderful. Great vibe and Esthela was the absolute best. Highly recommend!", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "The ceviche was incredibly fresh, and the mole was amazing! Great service and a definite place to return to. Can't wait to come back!", "author": "Hannah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Sat down for a quick drink on a Friday night while waiting for our dinner reservations around the corner. Service is friendly, lots of tv's (great for game days, I'm sure), and if you write a Yelp review, you get a free glass of sangria!! We also ordered some guac to tide us over until dinner. It definitely hit the spot.", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "First restaurant I came to eat here in San Fran. Visiting from NYC. We had the carnitas tacos and the nachos and both meals were very satisfying. Everything tasted super fresh. Our server David is a sweetheart and very attentive. Will hopefully be coming back before my vacation is over. Thank you David!!!", "author": "Viviana E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Good food, friendly service, excellent beer selection -- great alternative to Hi Tops if you want some space to relax and talk with friends. Go Warriors!", "author": "Cassie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Great service and amazing sangria! Recommend this place so much! Amazing!! I loved the taste of the sangria and the inside interior was thoughtfully placed! I enjoyed the location! Everyone should come and pre game here! Very classy", "author": "Jose J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "This place is great! Service is awesome, sangria is amazing and delicious fries :) chill place for your dayger!", "author": "Prachi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "Looking for a quick lunch. Ran in here. Menu looked good. Had the Cubano. After time in miami I have pretty high standards, this one is def great - not perfect, but great ;) good beer selection and the sangria is awesome. Super friendly bartender too. Overall would come back. Amazed I used to live a block away and never came here.", "author": "Dominic C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "On my 1st trip to market Street here in San Francisco the drinks are awesome the beer is the best yaaaaasssss definitely recommend it for everyone", "author": "Jorge R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Amazing food and amazing people, plus bottomless mimosas without the crazy lines!! This place also just looks super cool! I'm def. coming back here.", "author": "Shay E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Had the nachos and they were amazing! Add the carne asada for an extra 3 bucks. The other thing that will make me come back is the staff. Super friendly and attentive. Especially Carlos. I'll be requesting him the next time I'm in town.", "author": "Cesar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Love this place.. Best service ever..  Fast and friendly... I would recommend thIs place with no doubt...", "author": "EL Sancho R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "The staff and food here was phenomenal. Came here for brunch on a Sunday and although it was busy, the staff was very quick and caring. We got the California omelet and split it between two people and it was plenty of food and very tasty! Very pleased with my visit and would definitely come back!", "author": "Cody M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Came here to watch the Warriors game. The crowd was fun, food is delicious, and the service is top notch.", "author": "Bernex R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "Ok so this space is just got bad mojo i guess since not one place has lasted that long there since bad dage Cafe! But we tried this place yesterday and from the start it was a battle to like. Just like the noodle place that used to be Fork, you have to order then sit down and they bring you the food .. Hate that an why go out to eat if im doing the work for u .  Anyway we stood in line to order and because we had ?s about the menu the people behind us made us feel rushed and I no the two guys were not thrilled with ?s being ask when the line was long , I don't blame them but thats how your owners set it up ,not our fault.  So we placed our order and I did ask the guy how much for mimosas he said  like 9-13 for a glass which is a small glass or unlimited for 18 and i looked at him an said 18 really! i got a diet coke ! but they did bring the food hot and my taco was really good and they came by to make sure we were satisfied . Thank u guys that were there for doing your best it was really nice , but to the owners you should have waiters ,for the prices your offering ,im sorry its a great location you should make the best of it when there is so much around . \n\njust my 2 cents.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "We stumbled in this place while waiting for our dinner reservation. Great service. No wait and got seated right away.  We only ordered the guacamole and it was delicious, love the sauce that came with it. Bonus point: free Sangria if you write a review!", "author": "Irene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Food and service was great! \n\nTacos, burrito, ceviche -- all delicious. \n\nHot sauce was on point.", "author": "Gurpreet K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "My husband and I tried to have lunch here today and the place was empty.  We sat down at a table by the door and the officious waiter walked over and asked how many was in our party and we said 2.  He said we could not sit at the table and asked us to move to the other side of the restaurant to a less desirable table.  We ended up walking out and won't visit again.  They won't last and we walked by an hour later and there was a party of 2 sitting at the same table we were asked to vacate.  We ended up having an enjoyable meal with drinks at another restaurant so don't put yourself through this - it still wasn't full an hour later.  I hope they crash and burn like the 4 other restaurants that were there before them - Adios Republic!", "author": "Linda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "What a lovely pleasant surprise.  This space has been so many different restaurants over the years, and I think this one is here to stay.  Excellent brunch options, lively crowd...very happy.", "author": "Justin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "This is my favorite restaurant in the Castro.  The menu is excellent (especially the tacos and sangria) but the real gem is the staff.  Oscar, David, Carlos, Stella, and Anna are the BEST.  They work really hard but they are having fun, they are always happy.  Go for the food, but come back for the people!", "author": "Gaylen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "This place is AMAZING! Great tunes, the tacos are top notch and there is a good selection of brews. The Castro Republic definitely does the Castro vibe justice. Oh and the place is friggin BEAUTIFUL!", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "My wonderful skin therapist brought me over here to try out this place! Excited about the lamb be chicken slider I just ordered!", "author": "Jhamaria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Every time I'm in town I stop in for my favorite carne asada burrito! It's a must. Also check out the quesadilla, they don't cut corners and it's cheesy and super good. What's best is I can enjoy my favorite brew while I wait. Friendly staff, great food and across the street from one of the best Castro bars. Score!!", "author": "Nolan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "Mr. Carlos gave me an awesome and friendly service. The atmosphere is spacious and great to eat inside or out if you want to appreciate the outdoors. And it is amazing because it is close to all the bars.", "author": "Juan C. P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-23", "description": "The three of us all ordered different sandwiches -- all fine served with French fries.  The sandwiches were pretty good but the fries were unremarkable.  Who doesn't love fries? I rarely indulge so when I do I want to enjoy and savor them -- but not these.  They were big and fat, and unfortunately very disappointing.   If they could just figure out a way to improve their fries and make them more like the fries at super duper -- I would definitely come back.  I may return and order something other than a sandwich.  Just don't get the fries.", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Great place for a casual, relaxed breakfast. I had the huevos rancheros,  super tasty! Friendly and fast service.", "author": "Brent F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "This place is by far the worst restaurant in the Castro. Terrible and EXPENSIVE food and the most clueless service ever. The two dollar tacos taste like dog food. . Now I know why the place is always empty.. Disgusting and yes they do have infestation problems.", "author": "Manuel V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "We gave this place a try since it has been closed down who knows how many times. Still bad service, over priced, and the food quality is poor. Walk a block for something better.", "author": "Drew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Really enjoyed my Sunday brunch here. Very good huevos rancheros and really nice staff. As of right now, its not yet discovered / mobbed .. Walked right in and got sat down. Seems like a good spot maybe to work for a bit ad well.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Amazing. The spinach papaya salad (added grilled chicken) was huge and delicious. We went during a GSW game and it was packed but the food and sangria came fast. Best part = staff was extra sexy. Cheers.", "author": "l k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "My experience at this location was great Nice place good food those chilaquiles there so good ! The server Carlos was so friendly thank you Carlos and crew", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "I'm writing this review as I'm eating my Sopes Con Huevo. Oh em gee! This is soooo good! I felt like I was eating in Mexico City. The food reminded of this really good place called Primos in Colonia Roma. The staff is super friendly! I'm delighted! And the music is popping but not overwhelming. Awesome to listen to Aliyah while eating.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Awesome brunch!  Fantastic  service!! Loved the California omelette. Great place to people watch too.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "These guys are so nice and the service is awesome. Food looks amazing and it's Latin food now which makes me happy.....White sangria is Hella bomb .....do yourself a favor and come hang out!", "author": "Cristal W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "After playing at Brewcade I was hankering for some food. Saw this place across the street and had a nice \"aura\" to it (relaxed and not loud) so I decided to try it out. \n\nI ordered the carnitas burrito ($9.50, spicy of course) and a glass of water. Burrito is on the dry side, which is actually what I prefer. Not a big fan of soggy burritos, but they have house sauces that you can use for a little moisture. Carnitas meat is well cooked and seasoned moderately. Prices are fair and the inside decor is modern and clean.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Our 1st time here. It was recommended by restaurant nearby since they were not open for breakfast. Good size portions and very flavorful. Definitely coming back again.", "author": "Marty R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Great new place to have brunch in the Castro. The food was amazing and the service was quick and very friendly. I had the chilaquiles with green sauce and it was delicious. We will certainly be going back to try the rest of their extensive menu.", "author": "Keith D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "I finally went here after walking past it again and again, not really getting the concept ... is it  a burger place or is it a taqueria?? Well it's both and  I wished I hadn't waited so long. Had the pollo adobo and carnitas tacos with a white sangria. Everything was tasty and perfectly cooked and plated. Sangria was nice and dry. Maybe a little more variety of fruit would have been nice but necessary. Want to try some of the sliders when I go back.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "On vacation in San Francisco stopped  in to the castro republic for brunch the cubano sandwhich and the tacos were so good. I recommend coming here", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Very friendly staff and delicious food. You can never go wrong with Bottomless mimosas! All the food was prepared fresh and full of flavor. Would definitely recommend!", "author": "Samantha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "I love this place. I live around the corner and come as often as I can. The food is out of this world and the service is fantastic. Everyone should go drink here and eat here. The best!!!!", "author": "Tim D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "Not bad, not great. $6.75 is a bit much for a slider. If you're going to live in San Francisco you have to pay to play. But $30-$40 for lunch for two is a bit much. Much better options in the neighborhood at that price point. I wish them well as they seem like nice guys. Probably not a repeat spot.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Came here for brunch as an alternative to the busier Castro spots. Very chill place and huge menu!", "author": "Shayaan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Free sangria for a Yelp review, but that isn't the only reason I'm giving five stars. Food was incredible and inexpensive for the location. Restaurant was clean and the manager, Oscar, was personable, helpful, and guapo :p", "author": "Nick N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "I stumbled upon this dope spot while I was looking for Ike's. The nachos are amazing, the staff is ultra friendly, and the space is chill. Definitely recommend", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Dog friendly,outside seating. Food came quick and presentation was nice. Ice tea good.", "author": "Autumn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Love this place... Every time I come in town I eat here for breakfast lunch or dinner... Great place and the hot Latino waiter keeps me coming back", "author": "Terry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "The waiters are so sweet and kind- they make you feel at home. The food is very good as well- made with love. \nIt's the second time we stopped by for a bite and it was great. I rarely write a Yelp review - this place deserves it.", "author": "Jeffrey E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-08", "description": "The people who work there are very nice and I hope the place does well, but the food and the environment just aren't what I think they should be to flourish long-term in a city like San Francisco. The Republic is okay, but just okay and far from great. \n\nI ordered the chilaquiles with chorizo and beans as a side and my wife ordered a chicken sandwich (I forget which one, but it looked and tasted just like a regular chicken sandwich) with a salad as a side. Nothing special on both accounts.  Also, the environment came across as cold and somewhat sterile, lacking the color and vibrancy for which the Latin American culture is known. I left thinking - \"What did that place stand for?\" and \"I hope they last for a while because the staff seems nice.\"", "author": "Rocky B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "I love this place. I have been there three times in the last 5 weeks. I have tried many of their items on the menu and found all to be delicious.  Today, I had the Verde Benedict...mushrooms, spinach, red peppers with poached eggs and hollandaise sauce. I think this is now my favorite. \n\nService was great, as it has been from all 3 guys who work there. I am assuming one of them is the business owner.  It was extremely busy and they were a little short staffed for the rush; however, they kept up a good pace, smiled and continued to give excellent service.\n\nI will be there gain next weekend to try something different on the menu, before I head back home to San Diego.  If I could only get them to open up another Castro Republic down in SD", "author": "Gary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Stumbled on this place after parking around the corner. Lovely decor, fantastic service and amazing brunch! We will definitely be back for more of their chorizo eggs.", "author": "Sacha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "The Cobb salad was on point! Carlos was my server and was super rad! The beer selection was struggling a little (but they did have lagunitas) :-p I'll be back", "author": "Jeffery S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "topping off our meal of mushroom tacos and poached eggs, our server brought the best platanos we ever had! This awesome place has a great sun spot for groups to enjoy in the morning... Server realized his own mistake on my Cappuccino order (he brought a regular coffee instead) but i could not accept his offer to send it back because the fancy creamer was so cute. Great food and quality service combine for a wonderful experience!", "author": "Ati C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "Taco Wednesday was great! Tacos and Sangria are on point! Great service too! David is the best ;)", "author": "Greg M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "This place has great tacos and great sangria. Have an awesome Taco Wednesday deal. Super nice staff too!", "author": "Tom C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Omg if you want Mexican food in the Castro, this is it! The food is great and the service is even better. I totally recommend the pollo asado burrito; it is the bomb!", "author": "Brandon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "The food is great especially the truffle fries! Awesome servers! Castro sliders are delicious, and holy wow their burritos are huge and they totally hook it up. Views are great and people are friendly.", "author": "Britt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Finally! A good restaurant in this space! The food is delicious and service is great. The menu has tons of good breakfast and lunch/dinner options. The scrambled egg tacos are great and so are the carnitas. I'm looking forward to trying done if the sandwiches.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "This place has great customer service, reasonably priced drinks, outside seating, and amazing atmosphere! Check it out, you won't regret it!", "author": "Colleen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Taco Wednesday is the best! Great $2 tacos and guac comes with salsa which is cool. The sangria is really good but you don't get a free one with a yelp review on Wednesdays which is a bummer but oh well they were half price anyway .. and we ended up getting a free taco somehow! Sitting outside under the heat lamps on market is nice. Overall good experience, tasty food.", "author": "Corinne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "This place is awesome! I came in with a large party without a reservation and they seated us promptly. They have a great taco selection as the service is great. Definitely recommend it!", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Great  food for brunch and great tacos. There's also a taco Wednesday special that's great for a hangout spot highly recommend", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Excellent Sangria! This place is well located and beautiful and has the best Mexican food ever. Must try.", "author": "Astha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "A great location, very convenient. I stopped in for a quick bite and was very impressed with their tacos! Great service, good food", "author": "Jimmy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "This is the best restaurant this location has seen since it's changed owners more than 4x. I came on a Wednesday and discovered $2 tacos and $4 sangria. The mole tacos and the carnitas taco I had was delicious. White sangria was amaze. Great service! Will definitely be back to support and hope this one lasts", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Had a wonderful late morning brunch- very clean, fresh food and drinks! Chilaquiles were great, especially with the peach mimosas and large slices of fruit to go with them ($6 or unlimited for $19). The staff was very friendly and attentive. I would come back here for sure.", "author": "Hayden S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "I was walking by and the interior caught my eye...and I was so not disappointed! Tacos were awesome and Oscar & David, behind the bar, made for lovely hosting and conversation. Would definitely recommend for a good atmosphere.", "author": "Colleen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "I love the food here! Great service and has that rustic cool vibe. I will be back ! The kitchen is always a deal breaker. Clean and maintained well. I will be back!!!!", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Republic Republic, I'm hooked. I had there Verde eggs Benedict today, one word, delicious!!", "author": "La Toya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Amazing food!!! The mole and ceviche are to die for! Highly highly recommended place! Also staff is super sweet!", "author": "Sydney Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "Their food just wasn't tasty enough to get more than 2 stars.  We had the pork burrito and chicken tenders.  Both were below average tasty and bland.  The chicken was dried and gave a bad after taste.  Not sure how their ratings are that high.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "This place is absolutely unreal. The food is amazing, the service is everything you can ask for, decor is warm and provides an air of a classic SF affair. The people who work here are also really nice, awesome and super trendy!!", "author": "Dashiell P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "everything about this place is YES. happened to come here on a wednesday and the tacos are great. they're kinda small BUT i've had many mediocre tacos in my life that were a lot bigger and didn't taste as good. i'm happy to pay a little extra for tacos that will be flavorful and satisfy my cravings. our waiter was really friendly and i'll definitely be coming back. taco wednesday is my new thing now!", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "Came here for Taco Wednesday and tried the chicken adobo, hongos, and mole tacos and they were all great. Only $2 for the tacos. Also, both red and white sangrias were $4. David, our waiter, was very friendly and attentive.", "author": "omar c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "The atmosphere in this restaurant is fun and cute! The staff are extremely friendly and their brunch menu is killer! I would suggest the California omelette with apply chicken sausage; it's always amazing!", "author": "Gabby P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-28", "description": "amazing atmosphere, especially for watching sports! workers are really nice and their selection of beer is pretty good! food was okay, but you get free sangria if you write a review! haha", "author": "Elena V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Fun friendly place with many choices. Friendly staff and the food is delicious. Walk up and order which I usually don't care for but works here. Try the blood orange lemonade.", "author": "Kathryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "This place has a great location. Servers were fast and professional. Try their truffle fries out, they're heavenly!", "author": "Sean H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Chicken Mole tacos are delicious! Great deal on tacos on wednesdays! :) Carlos is a wonderful server!", "author": "Byron R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "We stopped in here for brunch. The food was great and the mimosas were delicious. Would definitely recommend this place for brunch!", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Is 6 stars possible? Has God herself descended upon this restaurant and blessed this food? One answer is \"I wish\" and one is \"most definitely.\"", "author": "Dorothy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "It was a little pricey for what you get. My sliders were really good but the french fries were awful. We tried the Crispy Fries but they seem like they had been frozen and re-fried. A few of the fries were crispy but mostly mealy and mushy. Overall not very much food for the price.", "author": "Gordon S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-18", "description": "Super nice waiter!! Empty on Mon night? Should of been a hint. Ok burritos, salad dressing tasteless. Pork sandwich too sweet! Good truffle fries. Good music. Again, nice waiter!", "author": "Aquilegia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Delicious. Had the Spicy Tinga Enchiladas. Good quality food. Great flavors. Will go back.", "author": "Christopher B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "Service at this restaurant is awful! I've been waiting for my order for over 30 minutes. It shouldn't take this long to scramble an egg. People seated after us received their food before we did. Still waiting....", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Excellent service and delicious food. Great location and even better servers... a truly superb experience.", "author": "Jordan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Nice convenient location. Meeting some friends here. Two of is had been here before and really like the tacos. We're here for brunch today. Order some drinks at the bar while we wait for our table. Our table's ready...", "author": "Paul F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-29", "description": "What is with this place? The location is incredible, and yet every incarnation of this restaurant is awful. The service is downright terrible, and the food is overpriced and meh.", "author": "Brooks M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "I love this restaurant, the ambiance feels great. They have a good buritto too.  I want to stop by every week. I've been here two consecutive weeks for the buritto. The server Eduardo serves pretty well, he's very nice then can handle a lot of customer.", "author": "Aristotle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "Friendly staff, if hard to get a table on Taco Wednesday. The avocado tacos were great!", "author": "Jacob W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Came in to watch copa america. Not too crowded or loud. Service is great and definitely amazing carnita tacos! This is a great spot if you just want to hang and be able to watch sports:)", "author": "Zahyra G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "Way overpriced for what you get, food tasted good it was just crazy expensive for sliders, fries, and beer.", "author": "Mackenzie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-02", "description": "Serviceable brunch spot no worse than the Castro standard that is mediocre at best anywhere else. The salmon Benedict was drowning in a hollandaise that was one note, tart lemon. The Cuban sandwich was good but a bit bland. Service was stellar though. Super nice FOH. I might try again for lunch but unlikely.", "author": "Brent A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-25", "description": "The menu is extremely misleading and the bill will be way more than you expect it to be. Food is decent but the cost is not worth it.", "author": "amy f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "The chilaquiles are delicious!!! Staff very nice and accommodating. Great place to stop for a quick bev or catch up with an old friend.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "The staff is really wonderful! Bottomless mimosas hell yeah! Such a cute atmosphere. Great for brunch!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "This place is awesome!! The vibes are great and the service was amazing. Oscar was so accommodating with everything and the food was terrific. I highly recommend for a fun brunch/lunch place in the beautiful sunny Castro.", "author": "Ari H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Nice space, great service, good beer list. Food looked good and they had the Warriors game on multiple screens. A+", "author": "E K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "The environment in this Castro bar and restaurant is fun and lively. The staff is extremely attentive and kind. Not a big fan of the sandwiches, but they have lots of delicious beers on tap and their fries are top-notch. Good for watching the game or having a drink with friends.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "5 stars for food. 4 honest portion tacos for $16. And a Taco salad for $10. Good beers. Carnitas were special.", "author": "Ethan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "I got the chorizo and spinach burrito it was great! It's a nice atmosphere and good place to watch sports games.", "author": "Christina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Stumbled upon The Castro Republic while wandering through the neighborhood and was rewarded with great food and service. Oscar and David are awesome!!", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "I live in the Castro. Have walked by this place and few times and decided to go with a friend. The food was good and the service we had was great. They post a menu on the door. If you can't afford it or don't want to pay for what they offer, don't go. There are many places nearby that are much more expensive and aren't that great. This was a nice surprise in a fantastic location.", "author": "Jesse H."}
