{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "I love this place.\n\n\n\nAs of this visit, 5 stouts out of 20 beers on the menu, that's pretty good. Usually you'll find places stacked with hundreds of lite beers but this has everything for all tastes. Great, kind service and clean interior.\n\n\nThe Halloween decor at the time is cute!", "author": "ThienNam N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-22", "description": "Great little place with a nice selection of beers and perfect for a little pre-gaming before a gig at the Civic Center just up the street.  Why three stars?  The board lists the beer at 16 oz pours and the bowl glass was w/5ths full, I asked where the 16 oz mark was and the bartender indicated the top of the glass \"but the head is part of the experience\".\nWhile I agree with that sentiment, the 16 Oz is supposed to be liquid + the head.\nShe was snarky and I don't really expect beer snobbery from a place that pours beer out of a row of taps", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Cool place to chill, drink hearty beers with high alcohol content and have dope conversations with friends. Nice ambiance and has adequate seating for small to medium sized groups. \n\nGreat place to stop after a Saturday afternoon trip to the Asian Cultural Museum.", "author": "Judy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I've been in here twice, perfect place to grab a beer with someone. It's quiet enough to have conversation, they have a fantastic selection, bartenders are friendly, and the bathroom is clean. Don't come here for food, you get very little.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "A very solid beer bar (as the name might suggest). Great selection that I suspect rotates pretty regularly. If you work in that mid-market civic center area, it's a good option. I wouldn't really recommend it as a sports bar since the TV is pretty small, but it's doable in a pinch, particularly if it's a relatively unimportant game (like regular season dubs/knicks).", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "This is not a large beer hall as the name implies, but more a compact tasting room at the corner of Polk and Market. There are about 20 brews on tap at any given time, plus a small selection of light bites and several hundred brews in bottles that you can take home.\n\nWhen it's busy, you'll be quite squeezed in here, and service can be quite curt. If you can come during less-crowded periods, you'll find that the bartenders are somewhat more engaging and personalized. A decent go-to, especially if you live or work in the area or are heading to a nearby concert.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Came back here for a second time 2 years later. This time I was with Zane and 2 other friends. They had beers and I had a ginger beer. I also had the black forest panini and it was good. It wasn't overpriced. They could have some sauce for it. I thought the place was sooo darn crowded, I almost couldn't stand it. It was so hard to get the attention of the bartender and maybe they could have someone floating around the floor because there are just so many people. I like the atmosphere and the people in the bar...", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Whoa. This place. So much to explore. Want a sour beer? The menu has 2 pages of them. Want something with a guava flavor? Yep. Passionfruit? Yep. If you want a bit of the lay of the land: the menu on the wall lists the beers they have on draft. You can sample a few of these, if you ask nicely. Of course, you'd ask nicely. Then there is a book-like menu. I started counting pages, and let's just say it's over 10. These are available in bottles and cans. Maybe even another format that I don't know about. You probably can't taste those. \n\nIf you're like me, and you just can't have that much beer in one sitting, but are curious, you can get some to go. They have different pricing for drinking them to stay or taking them to go. I'm sure you can't have them to go and opened, but that's your business.\nThey also have wine. So everyone should be happy. I didn't try any of the snacks, but good to know they are there.", "author": "Jason P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-30", "description": "Cool little spot, with some interesting selections on tap. The place is small, and the bartender was nice and knowledgeable. Too many IPAs for me, so I had a smaller selection, but it was still a good spot.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "I would call this more of a neighborhood beer bar and not so much a destination, but SF could use neighborhood places that keep it low-key and reasonable. One Toronado is enough. Roughly 20 beer taps, five or so wines on tap, and a big bottle list that spanned the spectrum pretty well but didn't have any \"wow\" bottles like you see at some places when they have a bottle list. The prices are what you would expect in the city.\nThe atmosphere is dark and comfortable. They have an L-shaped bar, some high-tops behind it, then some booth seating. Plenty of places to sit, and I think it would handle being crowded fairly well (wasn't crowded either time I came in). They have TVs, and they were both on ESPN, but there is zero sports going on right now, so it was kind of a surreal show. I thought it was funny, if anything. I'm not sure they actually need TVs at all. It may be better without.\nI didn't get the air of snobbery from the staff at all, but a lot of the clientele definitely were a certain type that you see a lot in SF. But ignore that and enjoy your beer.\nThe only detractor I saw was that they were having issues with the taps (she said it was something with the gas) and, when I ordered a very expensive draft, she poured it into three different glasses and then combined them into the full pour. There's a problem there with the fact that you're not actually getting a beer from the tap but, rather, poured into the glass. I'm not enough of a snob to refuse that, but I also know that shouldn't be doing that. Just fix your fucking lines...", "author": "Colin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Okay, so here is the story. My wife and I walk in and sit at the bar and strike up a conversation with the bartender (Name escapes me). He proceeds to tell us he remembers us from our last visit (a year ago) and tells us we are Daniels parents. Not only that but he starts a tab, identifying us as Daniels parents. How cool is that? Needless to say their beer selection is awesome and I made some real headway on my \"unique beers\" on Untapped.\n\nWe were meeting our son (the aforementioned Daniel) who was coming over after work so we scored seats at one of the tables to enjoy some beers (and wine for my wife) while the place filled up with people coming in after work. The atmosphere is relaxing and the bartenders are knowledgeable and helpful with selections.", "author": "Dave W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Delicious beers on tap, gorgeous rose and other wines, also on tap. Came here during the festive and sunny Pride weekend, and they set up a fantastic outdoor 'beer garden', which was offered a selection of specialty cocktails, vino and beers on tap. The outdoor patio had an array of lovely tables and chairs and the servers were fantastic. Bathrooms are gender neutral and were very limited when managing large crowds of people.", "author": "William H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Great selection with a wide range of styles, reasonable prices, friendly and knowledgeable staff. Only downside is it gets very crowded and noisy at happy hour times.", "author": "Deva H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-27", "description": "\"Place is tiny and overrun with tech bros\"\n\nThis was the text I got while walking over to meet two friends at the Beer Hall. I had been wanting to try Beer Hall since they opened but this text from my waiting friend sort of disappointed me off the bat.\n\nWe got there around 6pm on a Wednesday and it was super loud and crowded. The crowd was overwhelmingly tech and male. They have a nice selection of beers and friendly bartenders but not exactly my favorite clientele.\n\nI ordered an amber ale and a saison and we shared popcorn, burrata and olives. Friends had the IPA's and liked them. I enjoyed the beers I had as well (I'm not really a beer person but they have lots of options and knowledgeable bartenders). \n\nFood was good but high price point for portions. I was just at the Riddler with a free popcorn machine so paying $4 or $5 for a bowl of popcorn seemed high. \n\nOverall, I think I prefer Mikeller for beers and food options. Beer Hall has a good location close to civic center and kind bartenders but that's about it.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "Stopped by here on a rainy Sunday afternoon and I have to say I was pleasantly surprised.  I ordered the saison and it was excellent!  Ladies just so you know the bathroom is one stall for both men and women but it was cleaner than most bar bathrooms so it was not a problem.   Overall I had a great time and would definitely go back.", "author": "Michele M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "What an amazing addition to this neighborhood. The caliber of people working here is so refreshing. Casual and romantic. Classy and grounded. Music on point, and discounts on to-go purchases. And that truffle popcorn!! Damn!!!!!", "author": "George G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "It's loud. I put in my ear plugs. That solved the noise problem. \n\nIt has one TV that plays cartoons. Don't expect to watch the Giants/Niners/Warriors here. \n\nEveryone who comes in is a techie. Lots of full beards. Lots of t-shirts. If you like that kind of clientele, you'll love this place. I don't. I read the New York Review of Books and ignored the people.\n\nOn the plus side, the beer is fresh. The variety is amazing. The panini was decent. The bartender was friendly.\n\nI note that a young woman - a beer lover - noticed my wedding ring, my ear plugs, my wrinkles, my thinning hair, and my non-techie, going-to-symphony clothes. She decided I was no threat. She sat down next to me and examined the beer list like a Jehovah's Witness examines the Bible. She seemed nice, but was a little too much of a beer lover for me to try to introduce her to one of my nephews.", "author": "Stuart R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "This place is not super noticeable from the outside but it's worth a venture in. They have a HUGE beer selection and they also have wine! Some might say, who cares about why? However, it's great to go to a beer place that doesn't only have beer! My friends love beer as do I, however I also love wine so it's great to be able to switch it up! \n\nThis place is cool because you can also take beer to go! I was excited to see a coconut porter from Hawaii that I haven't seen in any restaurant/liquor store since, well, Hawaii!", "author": "Katlyn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "Came here before going to see Bill Burr at the Nourse Theater, which doesn't have a bathroom by the way. My coworker recommended this place because they have so many options available. It's great for beer lovers or wannabe enthusiasts like myself.\n\nPlace was setup like a bar, but overall smaller than I had thought. I couldn't find a seat, so I ended up standing at the bar area squeezed between some people. Somewhat of a hipster vibe, but people like that. I think there might be too many options to choose. It's a great place to explore and discover new beers, but too much of a good thing...\n\nI wouldn't go out of my way to come back here, but if I'm in the area - sure. It's also kind of hard to find. It's on the other side of the second building. They also have a bathroom.", "author": "TJ P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "This is the best beer place is San Francisco.. I love this place.. This is my go to place on all Friday's\n. The bartenders are really good.. Cheers to Jimmy..!", "author": "Jithin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "UM YAS, the beer hall has my heart with their plentiful selection and warm interior!\n\nThe signage is pretty discreet, save for the classy wooden sign overhead with a bold H inside a beer glass. I love places like this where quality beer, unassuming taptenders, and a warm wood-clad atmosphere are all you need for a good time with friends, a party, or your honey!\n\nWe went in after a comedy show ended around 9PM, and stayed until closing which was midnight. The crowds were diverse from couples to larger parties. I didn't see any food being served, but maybe the kitchen was closed. I enjoyed my IPA and tasted a DIPA that was refreshing, but not what I was in the mood for. There were other people drinking wine and beer from the bottle too. I saw a Campfire Stout in a bottle (one of my fave stouts) and lots of sudsy talk going around. \n\nBeer people are so great, and the beer hall is the perfect spot for good conversation and a comfortable night.", "author": "Jodi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "Huge beer selection, and awesome service. The bartender had a conversation about traveling to NYC so I gave him a few beer bars and breweries he has to check out, and he gave me a free beer after I ordered a few. Definitely an awesome beer bar in SF.", "author": "Nick D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-17", "description": "Bartender's service was sub par. And I have frequented the hall on multiple occasions and taken dates there. #neveragain", "author": "Eric J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "Cozy spot for post-work brewskis with a nice variety of brews to pick from. The Beer Hall does fill up right after work so coming in a little later in the evening is preferable if you're looking for a more relaxed setting. \n\nFolks here are knowledgeable and pretty friendly. Feel free to ask for a recommendation if none of the rotating 20 taps tickle your fancy. They probably have something in bottles that will hit the spot but the the variety on tap is pretty legit on its own. Not much for food except for a few nibbles so head elsewhere for dinner first if you're looking for something more substantial. \n\nIf you enjoy great brews, there are now more and more great spots dedicated to tasty beers and The Beer Hall is definitely one of them.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Huge selection of beers in a little gem of a bar. Interestingly they have cheaper prices for bottled beer to take away instead of sit and drink. The staff was very friendly and helped us choose a few options to take with us down the street for a cooking class. This looks like a great place to sit and unwind with a drink after work, which is perfect because it's conveniently located close to the Van Ness metro stop.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Had heard through the grapevine that I could find a great sour beer at The Beer Hall, so my buddy and I wandered in around happy hour and found two seats at the bar. \n\nFirst thing I noticed was the flat screen behind the bar displaying about 20 beers on tap. Solid selection. I opted for a high ABV (9.5%), Imperial IPA which put me on my a$$ after the end of the glass. :)\n\nPeople seemed to be enjoying themselves and this is definitely a place for beer nerds, so two thumbs up there. Only complaint.. the place lacked a bit of personality, and felt like a \"run of the mill\", speciality beer retailer. Regardless, check em out!", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "Don't get me wrong, if you're nearby and want a good selection of craft beers, by all means stop  by. But, only if you're nearby. I wouldn't go out of my way when there are better bars with the same or better betters on tap and with better service (bartenders have a slight \"I can't wait to get out of here\" feel to them).", "author": "Gonzalo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-08", "description": "Went at 4 on a Saturday, so pretty slow. But nice location right near Civic Center Bart, and lots of tables to sit at. Cool atmosphere. Good beer choices on tap, but we picked poorly. If you need some time to kill when waiting for a show, good place to grab a few beers.", "author": "carol p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-29", "description": "On a wet, cold November night, the air conditioning was on. The metal seat was like sitting on cold metal (for some reason there was padding on the underside of the seat). Everyone inside had their coats on. But the bartender was accommodating and turned it off, and it almost immediately become habitable.\n\nI had a nice English Pale Ale, and got a small sample of 2 others.", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Stumbled upon this place during the Women's March, they were open early that day. It's a cute small beer bar, has a great selection of beers on tap, and wines. Don't know how it is in the evening, but service was great, and the vibe was fun (all women customer in their pink pussy hats, how can it not be fun?). I got a panini as well, which was ok, not special, but not bad. I would probably come back here to try more beers and bring a friend or two.", "author": "Meerim I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "My favorite neighborhood stop.\n\nI love the flight options.  It allows me to try a bunch of great new beers, and the taps are always rotating.  Even though I typically stick with IPAs because I'm basic as hell, I almost never see the same ones in rotation, and sometimes by the end of the night they've changed and I can go back and try the new ones.\n\nThe bottle menu is out of control.  Just pages and pages of great and rare stuff.  We honestly will buy bottles to go because the selection is better than the grocery stores in the area.\n\nWe love their burrata dish too.\n\nI love that there is always a buzz and a good crowd energy, but it's never overcrowded either.  A great place to catch up with a friend, try a new beer, and hang out.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Great rotating beer selections, friendly staff, and nice modern interior decor.\n\nbeer/10 would beer again", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "OMG. I found my personal heaven. Located conveniently near the Civic Center BART station, I met a friend here for drinks one Friday afternoon. I arrived around 3:30pm and the place was pretty empty. I took a seat at the bar and saw another girl doing work on her laptop, plugged into an outlet located right beneath the bar counter. WHAAT. I can do work here too?! Or charge my phone since not everything has to be about work all the time.\n\nThere's a plasma screen right above the bar with the current beer selections on tap. I dutifully selected an IPA and answered a few emails while waiting for my friend. Great service and vibe here. There's also a more extensive menu if you're interested in purchasing beer by the bottle instead.\n\nMy friend finally arrived, and she ordered a panini off the food menu. I didn't get any myself, so I'll have to try that next time. Closer to 5:00pm this place gets pretty packed. There is a comfortable number of tables here, ideal for smaller groups unless you arrive early to claim more seats. \n\nI'm gradually realizing how hip this neighborhood is for craft beer, and I'm glad that Beer Hall is my first stop on this exciting journey to try more local bars!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "An excellent beer selection, both on draft and in bottles (that you can even take home!)\nSam, our bartender was helpful, knowledgeable, and friendly. Made our search for a great beer that much easier. Came on a Saturday night and ambience is perfect for someone wanting to have a conversation with their companions.\nWould definitely recommend", "author": "Drew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "TGIF! And with the weekend creeping up, I'm wishing we had a Beer Hall on the East Coast - they would make a killing in Boston/Cambridge.  I'm typically not big on beers, but this place definitely turned me on to varieties I always thought I hated! Kind of like how my trip to Italy 11 years ago gave me a newfound appreciation for fresh and gourmet cheese (to be fair, my experience prior was that out of the deli meat section in US supermarkets - bleh).\n\nFirst, the vibe is casual like the rest of San Francisco, but totally in a chic way! Clean space, fun decor with a wall entirely adorned in bottlecaps - sounds cheesy but you need to see it! Bon chic bon gout! Also tons of vintage beer bottles on a couple walls and the lighting over the bar is perfect.\n\nThe beers. Mm I'm now turned on to stouts and dark beers.  There were some floral smelling beers, too, but the taste wasn't as attractive (although the rest of the my group loved it). \n\nThere was also a sour beer that was surprisingly delish - don't knock it till you've tried it! Apparently a huge trend in Texas and for good reason.  ASK IF THEY HAVE IT!! I'm sorry I don't have a name for you - this review comes as I become nostalgic for a place like this. \n\nTasting goblets were perfectly sized for me! And while the snack options were limited, the snack mix/nuts we ordered were a perfect accompaniment for our libations.  \n\nSuper knowledgeable and friendly staff. The owners were there when we went and they were really nice!\n\nDo yourself some good and enjoy some awesome beer!", "author": "Thanh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Cute little place. Cool beer bottle decorations on the wall. They have a couple TVs so good for hanging out to watch some sports games.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-04", "description": "Impressive selection of beers. Not so many on draft - 16 maybe, but AMPLE selection in bottles. \n\nOver priced. Yes. But I guess that's what you get for mid-market. \n\nNo one there on a Sunday afternoon, but I guess it's more an after work place? \n\nBartender was very kind. \n\nNice and clean inside. A little dark for my preference. I'm a beer garden or open warehouse kinda girl.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "With business at the Civic Center concluded one in my group suggested a drink.  My feet began heading in the direction of Hayes Street, ever anxious to leave this sketchy scene, but a closer alternative was recommended and I headed there with trepidation.  Leaving the Civic Center and heading toward Market Street one isn't often rewarded with good things.  Imagine my relief then, to discover The Beer Hall, a clean place to get great beer without any of the outside brought inside.  It's a winner.  \n\nThere was a lot of beer talk between the waiter and one in my party resulting in two little beer snifters arriving at the table to allow sampling then selection.  I sniffed the beer samplers impressively but opted for wine (glasses run $9 - $14).  With two wine drinkers, one beer drinker, and one soda drinker we probably weren't the target market for this establishment (consider their name) but when all is said and done this felt like the perfect place/escape.  \n\nA side order of mixed olives ($4) sort of had me loving The Beer Hall far out of proportion to what one would expect.  These were the smoothest, tastiest olives ever, supplemented with large caper buds masquerading as olives.  I have the feeling that The Beer Hall knows more about what's up with beer, wine, and food than anyone has any right to expect in this neighborhood.  \n\nAnd for that, I'm thankful.  \n\nIf you're in the area looking for a great place to grab olives, wine, and especially beer I don't think you could go wrong choosing The Beer Hall.  It's more room than hall and it's a most welcome refuge in this neighborhood.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "When your friend claims he's 5'11 (and you know what 5'11 looks like; Bear for scale) you call him out on his BS-over compensating-lies, win a bet, and redeem that free beer asap.  \n\nCozy bar with a beer can shrine on one wall and bottle caps on the other.  It was a full house with a few techies since Twitter isn't too far from here.  I requested for a light beer and he ended up getting me an IPA. Bleh, not a fan.  Never let a liar order for you; cant trust them.\n\nOverall, chill place to grab a drink after work.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Limited selection of foods but the olives are great; large selection of wines, beers and ciders.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "So let's begin with the bartenders who really know their beers and can pick one for you that you'll love (and I definitely am NOT a beer drinker).\n\nThe seasonal beers are amazing (try the xmas bomb right now. it's all the things you love about the smells and tastes of the holidays with a delightfully high ABV).\n\nAsk about beers NOT on the big board. (tip #1)\n\nTip #2, be hungry. the panini's are amazing (rank the meat marvel one over the turkey one but only slightly) and LOVE the burrata. Wow.\n\nIf it's pouring rain and you need a place to hole up and watch the warriors or warm up as you await less musty and damp BART trains (circa 8 pm), this is a perfect spot.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "The bartender was extremely chill and knows his brews. The selections was very nice and the atmosphere was kinda low key casual.", "author": "Colin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "Small, low-key space. Honestly, if you don't know this area well, you wouldn't notice this spot. \nIt's one big square. When you walk in, the bar is on the right. Tables fill up the rest of the place. \n\nLiked the spread of beers on tap. They've got about 20 or so. They've got a bunch of bottled beers you can purchase to take home as well. Small selection of bar snacks, but didn't really bother to check them out since I went to eat elsewhere. Service was a bit slow and they got our drinks wrong but we figured it out. \n\nHere's the catch.\n\nA tad bit overpriced as beer aficionados have mentioned. I guess they're pandering to the Twitter and eNEMA folk. Meh. \n\nStill, it's decent spot to drop in for a good brew after slaving away at the office.\n\nP.S. To the techie (_|_)s who laughed at me for taking a photo of my beer with the cool bottlecap wall as my backdrop, go play in traffic.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "I make it a habit to stop in here every time I am in town visiting my family. It has a great atmosphere, nice clientele, friendly bartenders (Jimmy's our favorite) and a great selection of beers. \nWhat else can you ask for from a \"Beer Hall\" ?\n\"Stay thirsty my friends\"", "author": "H F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "Right in the neighborhood - perfect spot for a Sunday afternoon beer with some friends.  Large beer selection and bartender was happy to help us choose and give a taster before we commit", "author": "Margo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "The Beer Hall offers a large selection of beer and wine at the bar or bottled to go (seriously, what a beautiful wall of beer). They have around 25 items on draft, so you'll for sure find something you like! Drinks are around $7-12.\n\nThis pub is smaller than I expected, but I like that it's cozy! The owners and staff are all super friendly - they went around chatting it up with everyone. I can see why there would be a lot of regulars. ;) \n\nI went on a night where they were featuring the fourth beer in the Game of Thrones Ommegang collaboration. If you ordered the GoT beer, you got to keep the glass afterwards, woot! We also got to play a little trivia, and winners won a bottle of the beer to take home. \n\nThey have two TVs, so we were able to catch the Giants game. Located close to Twitter and the Civic Center BART station, I know I'd be back to grab beers!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "Nice place if you go home and dive into your towering bank vault full of gold coins with your three duckling nephews.  \n\nThe space is enjoyable and the people seem cool but its incredibly expensive and just not worth it to me.  I paid $9 (before tip) for one of the cheaper beers on the menu, which also came in a 12oz glass instead of the 16oz advertised.  Glad I tried it, likely won't be back.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Situation\nSaturday afternoon/evening drinks with friends \n\nPros\n- Great beer selection\n- Awesome service\n- Extremely clean \n\nCons\n- It could probably be a bit crowded for happy hour", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "glad to have finally tried this place! popped up on my yelp search a while back, and because it is a bit out of the way, havent stopped by. BUT for some reason we were in the neighborhood today! yay! \n\nthe place is smaller than i had expected, with fewer selections on tap than i had expected, but theyve got solid selections, and we were happy with the quiet neighborhood feel. there is only one bartender on a sunday evening, and she took care of everyone quite well.  we tried a belgian brew, a coffee stout, and a double IPA.  everything was delish, and the bar bites also look interesting - but i was gonna cook later and didnt want to ruin my appetite. \n\nanyhooo, bottles are 20% off if you carry them out, and they have an entire wall of bottle selections! mmm! we met a few people at the bar, and they were super friendly.  overall, very solid!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-14", "description": "The Beer Hall lacks personality and any decent snack option. Despite my friends and I coming when the place was practically empty, the bartender was bitter and unhelpful.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Favorite place for a beer in the city. It's cozy, has a great craft beer selection, and the staff is incredibly friendly.", "author": "Lainey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-01", "description": "Eureka! An almost-ideal spot to pre-game before a show at Bill Graham -- which is literally around the corner. The only element missing is food, but with a little advance planning you can BYO, and let them take care of the booze!\n\nThey offer tons of beers, both bottled and tap, and about 5 wines. The beer selection is something to admire, with an encyclopedic list to tickle whatever palate you've got. We tried a couple sour beers (bottled) and they were Amaze, capital-A. The space is like a more sleek, digitized version of Beer Rev (actually, it has nothing in common with Beer Rev except for all the beer). They seem to be catering more to the polished tech-industry crowd than the hobo-hipster beer geek crowd, but both could appreciate what they're doing. For example, the beer list is on a big TV screen (digitized) and there are black and white movies playing in the bathroom so you could really get comfy while you're on the pot. Brilliant!\n\nThis area of SF really needed a quasi-classy watering hole like Beer Hall. Even an unenthusiastic beer drinker like myself can give them major props -- for the space, selection, service and overall good times.", "author": "Nique F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Really cool vibe. Beer wasn't too expensive but atmosphere was still very classy. Will definitely visit again", "author": "Kristen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "I want you to ask yourself the following questions:\n(1) Are you a beer nerd?\n(2) Are you committed to your beer nerdiness?\n(3) Are you gainfully employed at Twitter?\n(4) Are you totally pissed off about SQL OR Sequel? Or any computer program, in general?\n(5) Are you male?\n\nDing-ding-ding! If you answered yes to any of the above questions, then congratulations! You are going to love this spot. \n\nAs one of the only females up in this piece, let me answer some questions for you: \n--Yes, the beer list is stellar.\n--Yes, I did start with the Wet Hop IPA from Berryessa Brewco (7.0% ABV). Yes, it was recommended by the bartender. Yes, it was delicious. \n--Sure, I did move on to the Deschutes Jubelale (nitrogen). Of course--that's a dumb name for a beer, but it is delicious. \n--The Lakers/Clippers game was, in fact, playing. \n--Brogrammers from Twitter were, in fact, bitching. \n\nFriends, this is good times. Only open until 11:00 p.m., so you can't get into too much trouble. Have I found a new hangout? Yes. Is the location bizarre? Yes. Am I deliriously exhausted from being sick with a random flu the past 5 days? Clearly. But that shouldn't dissuade you. \n\n--AWESOME BEER LIST.\n--NICE BARTENDERS WHO ARE KNOWLEDGEABLE ABOUT BEER. \n--WEIRD, RANDOM LOCATION. \n\nIt's a win-win, friends. You're welcome.", "author": "Sunny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "The Beer Hall is conveniently located a couple blocks from the Bill Graham Civic. So, it's good for pre-and post-event beers. The folks who work there are very friendly and knowledgeable. One problem: there is incredibly cold air conditioning blowing on the bar at all times - even when it's 50 degrees outside. Brutal.", "author": "Bob A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "The Beer Hall is a nice hip spot located right off Market Street on the first floor of an apartment complex.  I came here with my bf on a Thursday night and found it to be buzzin with the after work crowd.  Beer Hall has a great selection of local brewers on tap (Triple VooDoo, Fieldwork Brewing, Linden Street), a massive selection of mostly local bottled beers and wine for the non-beer lovers as well.  Prices for the drafts are average about $5-$9 depending on what you're getting.  Bottled beers are a bit cheaper if you take them to go which is a cool option to enjoy something you might not be able to find at your local liquor store on the comfort of your own couch.  The bar is nice, not a huge space but ample seating with booths, tables and some stools by the window.  No proper food menu but there are a couple \"snacks\" like olives, spiced nuts, an Panini sandwiches to munch on while you're sipping away. A solid option for the beer lovers looking to try some local flare in the neighborhood.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "WEDNESDAY.  The thing you need to know about this place is WEDNESDAY.  Or sort of.\n\nWEDNESDAY is the day that they allow you to buy beer in flights (UPDATE: this is not actually true.... see below.) and if you're a beer tasting lover like me, this is the best way to try tons of beers.  And yes, you'll be shut down on the whole \"flights in a tasting caddy\" experience if you show up on a non-Wednesday day.  Fact: I learned this the hard way.\n\nNow having actually gone on a Wednesday, I now know that this place doesn't do flights from the taps ever - even on Wednesday.  Nope.  They do \"bottle flights\" meaning beers (or in our case on the night we went, ciders) poured from bottles in sets of three or four.  \n\nThe good news is that if they're not too busy (say on a Tuesday at 8pm, hypothetically) they will patiently pour you any number of mini-tastes of the beers on tap.  Via this method we discovered the \"chocolate milkshake\" from boulder brewing... holy cow.  This is what Young's Double Chocolate Stout wishes it was.  It's very rich and sweet yet somehow not overwhelming or cloying.  Apparently it sells out almost instantly once they get it so we were lucky to have it.\n\nUsing a similar method, we also learned of the \"fieldwork morning time\" which is a positively wonderful breakfast stout.  \n\nWe also tried 9 others (really!) and even committed to a campfire stout in a bottle - without a preview taste. Fortunately, it was excellent.  We also liked the Freewheel Gold on cask, which was delicious and balanced, but, per tradition, not exactly cold.  The HenHouse Black Lager was a winner too.\n\nI'll definitely be back.  Probably on a WEDNESDAY.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "This place has a vast selection of bottled and tap beer. Great atmosphere, clientele and staff.\n- Update 11/25/15 - Someone thought my review was funny. It is straight forward and to the point. Don't be bitter, come here and have a good time.", "author": "Don J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "I came with a group of about 8 people on a random weekday night. Being the drinkers that we are, we decided to order a bunch of beer and play King's cup!\n\nSeptember 2013\n*Cock-n-bull ginger beer 12 oz ($2.50) http://www.yelp.com/biz_photos/the-beer-hall-san-francisco#LO6jS70Zz5SOzQT53MkQ0Q\n*Grand teton sweetgrass apa pale ale 12oz ($2.50) http://www.yelp.com/biz_photos/the-beer-hall-san-francisco#rTgsUOF-qiyQauHES1x76w\n*Almanac pumpkin barleywine 10oz ($9), Speakeasy sf lager 16oz ($6), 18 huyghe delirium nocturnum 10oz ($10) http://www.yelp.com/biz_photos/the-beer-hall-san-francisco#Q-nFsBAGjeV_R_dla5fGpA\n*Spaten franziskaner weissbier, hefeweizen 16.9oz ($4.50) & Hofbrau oktoberfest 16oz ($7) http://www.yelp.com/biz_photos/the-beer-hall-san-francisco#HxTaONvo6sSn0FDK588qZA\n*Anderson valley summer solstice cream ale 12oz can ($2.50) & Alaskan amber 12oz ($2.50) http://www.yelp.com/biz_photos/the-beer-hall-san-francisco#0y5HpFuxO2ibxXywWT--DA\n*Deschutes mirror pond pale ale 12oz ($2.50) http://www.yelp.com/biz_photos/the-beer-hall-san-francisco#Dn1UilyntX1PVap-ZJLrDQ\n\nI had a great time. My group can be a little on the louder side, but we were never bothered. The staff just let us have fun and kept the beer flowing. I love that about bars. As long as we're not being obnoxious, they just let us play our card games.\n\nGreat low key place to grab beers and if you'd like, play drinking games. :)", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "Came in a Friday night around 9:30pm looking for beer and here we are. The workers are friendly, their beer selection is huge, and Muni trains are two blocks away. I recommend the Barrelhouse Oatmeal Stout (6%) for people who prefer their beer dark, but not as bitter as an IPA. It will start with a slight bitter taste, but it ends with a nice sweet kick. If I had to compare it to another drink, Barrelhouse Oatmeal Stout tastes similar to a cup of Joe. Solid place to just hang out and talk to friends, only wish that they served food too.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "This place was fantastic! Eloped at city hall and walked here for our first celebratory drink! The bartender was great in recommending and narrowing your choices since they're are so many options. We also had the spicy nuts as an appetizer which were very tasty! Great place if you are like us, and love good beer.", "author": "Ana B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-16", "description": "I can't say that I had a good experience. I walked with coworkers to have a casual meeting at beer hall and we all ordered drinks. Everyone had their drinks when the bar tender then after the fact asked for ID. I realized I had forgotten it, but we were still charged for the drink. It was kind of a confusing and uncomfortable moment. On top of it she brought out the owner to where we were having a meeting to ask me to leave. Maybe it's a lot to ask, but I wish the method of delivery (attitude and word choice) and process was better! I mean you already handed me a drink and charged for it. If you're going to be busted for underage drinking it would have already happened.\n\nOther than poor training and service place seems like it has great decor.", "author": "Maggie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Grabbed a quick drink with a friend from Twitter, since it's right across the street from their building, and it was an interesting and delicious pit stop before we moved on for dinner. \n\nGreat panini, slightly pricey but it was made so fresh, you could taste all of the ingredients individually and with their flavored blended together at the same time. \n\nThey beers they have are beyond the average pubs and bars, but not as extensive as the place itself isn't that big to start with. However, they still offer a good array of beers to satisfy most.\n\nWIFI was easy to connect to.\n\nService was a bit slow given there's only one girl taking care of order, payment and the bar, and another in the back kitchen. \n\nDecor inside was unique in the way that one of their walls is covered with beer caps, and beer caps only.", "author": "Richard Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "Great and large variety of craft beer and wine on tap, bottled, or available for you to bring home.  The customer service is excellent and a laid back group.  They only have one bathroom and it gets very loud and crowded during the time with people who finish their 9-5 working day schedules.  When the crowd dies down, nice place to bring a date or group of friends.\n\nThe food is a bit pricey but very edible, and the beer is fair price and brewed from local breweries.", "author": "Chan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Currently enjoying beer #13 - Fuchschen l Alt and it is fantastic.\n\nI love the easy going vibe. Service is great, some visits are better than others, but always we always leave happy.", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-10", "description": "It's a cute place close to Market Street and probably where Twitter people go to celebrate their next 1000 Million users ;-). \n\nGood selection of different beers. They even let me taste some of them to help me make up my mind.", "author": "Dario S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "Thank you SF Beer Week for helping me find this place! I am always looking for a great beer bar and this is it folks. \n\nI came in here last night for the Battle of the Brews event which included flights of beer from Speakeasy, Magnolia, Thirsty Bear and Triple Voodoo. We ordered the cask ale flight (yup they literally had firkin kegs on their counter) and the brewer's choice. Everything we had was tasty! We each picked our favorites and ordered a round because we weren't ready to leave! The service was great considering how busy they were. The place is pretty small but it got packed for this event, and I'd imagine it can get that way during happy hour on occasion. Doing a lot of little beer flights like that is difficult but they really held their own, I was impressed. \n\nI love the ambiance of the bar. The decor is really hip and the vibes overall are good. It is not very obvious from the outside, but it is right off of Market across from Twitter. This will definitely be a new after-work favorite!", "author": "Mandy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "Good beer selection, and my panini was pretty dang good too! I would give four stars only the service was terrible.  The bartendress had a real entitled attitude and very little patience.  But I understand, if my boyfriend was hanging out I wouldn't want to serve customers either.  She was super nice when she handed the bill over though.", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "So this review may be a bit unfair as I came here for a wedding in which the bride and groom closed down the bar and gave us cart blanche with their incredible beer list. Now I haven't been to a candy shop in a while, but damn if those memories didn't come rushing back.\n\nWhile I may not have paid for any of the drinks, the prices were on full display, and I must admit, being someone who drinks a ton of beer, they were very reasonable. I also have to give a shout out to all of the servers. I probably interacted with each of them that night, and they were all extremely knowledgable, friendly, and helpful when it came to ordering. They know their shit, and it shows. \n\nNow on to what I ordered. I started out with the Upright Brewing Seven, then tried Cascade's The Vine, followed by Upright Brewing Four, went dark for a bit with the Prairie Pirate Bomb before jumping to Hanssens Artisanaal Oude Kriek (none of that is a typo), followed by various drafts. I mean, that's one hell of a list.\n\nIf you are serious about beer, this place is a must. I can't wait to make it back.", "author": "Josh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Amazing beer selection. I don't usually like beer but I went in while I was waiting for my cousin. I told the bartender about what I usually like and dislike about beer and he provided an amazing selection. The first one was so good, I had to pass up the 2nd and 3rd choices. Wish I lived closer so I could go back and try the others. Mmmm.", "author": "Elizabeth B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "I think the selling points of Beer Hall are (1) atmosphere and (2) decent beer selection. But that said, if you're a cider drinker, there aren't too many options (1 cider if I recall correctly, although a few light beer options). Also one knock on the place is that I got charged an extra dollar for one of the beers I ordered. But it wasn't worth it to go back up to the bar to ask the bartender for the dollar back. :(\n\nThey do a have one TV so you can watch some football there on the weekends. And they have some nice wooden seating areas (some high stools too) and it isn't typically too loud inside, so you can actually have a conversation with your friends.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "Beer Hall? More like Beer Heaven! My friends and I drunkenly stumbled into this place during Pride and ohhhh my gawd what a perfect place to keep the good times GOING... or started! \n\nSuper small shop, cool TV menus with a wonderfully large selection but we couldn't find a seat, what with all the event happenings going on. They DID have a bunch of cool pride specials but it was hard to get the bartender's attention so we eventually got ourselves a beer to go. I don't remember what I got, but the ABV was at %8 and it was 20% off! AWESOME! \n\nThe only thing is they don't open the bottles for you if you do take it to go, so practice your bottle opening skills! Or buy a bottle opener for your keychain. Can't wait to go again though!", "author": "Krissy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Small, but it packs a powerful punch.\n\nI first came through here when I read about a special tapping of an unfiltered Pilsner Urquell, and it amazed me I hadn't been by before. \n\nIt's a beer-nerd's heaven. Probably 8 - 12 beers on tap, with hundreds available in bottle. And the folks that work there are beer nerds themselves, so they're happy to talk with you about the different types of beers they have and let you taste to figure out what you like.\n\nIt's definitely small, and being a really good bar across from Twitter* the appx. 40 seats (a few tables, and about five/eight seats at the bar) means that more often than not it's going to be pretty crowded no matter when you go. But if you can get there fairly early you can stake out a spot and it didn't seem to get so crowded you felt completely boxed in.\n\nThey have some bar snacks (olives, spicy nuts which are really tasty) but no real food so make sure to eat before you go face first into your beer. There're some really strong ones here!\n\n* - they also supply some of the beer on tap at Twitter.", "author": "Danny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Stopped by while visiting San Francisco on a Saturday afternoon. At the time, business was really slow so we got a chance to talk to the bartender, who was super friendly & gave us plenty of suggestions on places to go in the city that the locals go to. I wouldn't have known about Cellarmaker if it wasn't for stopping by Beer Hall! To boot, we were given samples of local beers not available where I live & all in all, the experience was great. The bottle shop is also cool & if you're a craftbeer junkie like I am, you'll appreciate what's available!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "I came with some beer drinkers, but I had the wine. The beer and the nuts were great. The wine pour was embarrassing...it looked like a half-pour for a flight. I saw the bartender pour wine for another party and it was much better but still weak. Bummer.", "author": "C S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "A small neighborhood beer place that unfortunately is right across the street from the Twitter building.  Unfortunate in the way that I probably not likely ever get a seat here if they hosted a SF Beer Week event or even a regular tap takeover.  The appeal of this place is the awesome decor of retro beer cans all over the room.  Adding to that, there is beer for sale here with many well known and not so well known selections and the LCD beer menu on the back of the bar wall is clear to read and very informative.  No more chalkboards!   I like to see names, ABV, beer type, and price all in one line.  It helps me make a decision faster versus delaying the bartender by asking these questions before ordering.  \n\nThe day I came here was for the Green Flash vs 21 Amendment promotional day.  I got a Green Flash double IPA and although it was smooth, it was super bitter and quite a challenge to drink.  It mellows out a bit as the beer warms up, just like wine.\n\nThe staff and management seem challenged to serve and clean up here as it was literally difficult just to move around the small room.  But they seemed to take it all in stride.  FYI, there's no food here so next time, I'm coming here, I'm bringing a pizza.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Great beer selection, good snacks + super friendly knowledgeable staff! Large selection of sours + Belgiums, but the few IPA's + stouts on tap were awesome. Will definitely be back!", "author": "Monica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Small but intimate setting that fills up quickly later in the afternoon.  Lovely decor, I enjoyed the bottle cap wall.  I liked the beer menu and identifying them by their assigned number. I was impressed the bartender knew what \"number 10\" was! Seems like a great place to hit up after work or romping a bar hop.", "author": "Sabrina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Updating my review. Wouldn't come here so often if I thought it was anything less than a five. We've come to know everyone here pretty well -- they're some of the most down to earth San Franciscans I've ever known. We've laughed and cried along with the beer we've come familiar with (the \"Punishment\" will certainly make you tear up).\n\nIt's quirky and small, with 25 items on tap and an enormous library of bottled beer. If you love beer you're sure to love beer hall.", "author": "Christophe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Enjoying beer #17,19,9  loving the dark wheat ale\n\nWould recommend to any other beer lover to come by and stop to try one of the beers on tap\n\nAlso the service was nice and they were very sociable at the same time.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "Cool little beer spot located on mid-market. They have a ton of different beers on tap and in bottle. They have pretty much anything that you can think of. My favorite was their chocolate porter. Can't go wrong with a porter on tap. They have 21st on tap along with anchor steam and many more. I will definitely come back here. \n\nIt isn't the biggest bar on the block, but a great size to grab a drink with a friend. I wouldn't recommend coming here with a party of 20 however you can probably still squeeze in.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "This place is a beer geek's wet dream. The digital board with the stellar selection of rotating taps would've made me happy on its own, but the atmosphere is nice and cozy and totally unpretentious. This is a husband and wife run operation and excellent post-work destination not overrun with d-bags or hipsters. \n\nThey have a \"daily draft menu\" that you can check out online (http://www.thebeerhallsf.com/draft-2/) and the bartenders are real friendly. I'm an annoying sampler-er, which I do with the genuine goal of finding my brew for the night, and there are many bartenders that can't stand that. The people here seem happy to pour a few with their suggestions thrown in. Also, for East Bay commuters like myself, it's right on Market and Polk by the Civic Center BART station so public commuters can feel free to throw back those double digit ABVs after work and all through the night.\n\nThe only flaw that is a non-flaw is that they only do Stone flights, nothing else. Fortunately, Stone is one of my favorite breweries, so I'm still happy.", "author": "Clare B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "The Beer Hall is my new watering hole. It's got a kickass location in reviving Mid-Market. The owners Drew and Jennifer Hall are friendly and nice. The place itself is not so much a hall. It's more like a small lounge. There is only one restroom, which can be problematic when there's a large crowd. Kudos to the looping 1906 Market Street footage though.\n\nNow... onto the beer! They have a great selection on tap. There are easily at least 15 beers on tap in a variety of styles. There is one Beer Hall beer, which is not made in house. It's an ESB made in San Jose, so I guess it's a contract beer. It's still in the evolving stages, but they consistently serve it anyway. All other beers range mostly from $5-8. What's most impressive is their bottled selection. I don't usually ordered bottled beer when there is good stuff on tap, but place literally carries hundreds of beers and some as low as $2.50 per bottle. It'll take me months to get through the list, but you can't blame me for trying.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "If I could dream up a perfect world this would be either in my basement or at every airport terminal in the U.S. Simple, clean, intimate, friendly staff, adequate TVs, good drafts, excellent bottle list and just hidden enough to keep the crowd mellow. Also don't be fooled by the name, they do have wine. Only neg is a small food menu but you can order in delivery using one of the billion apps in SF.", "author": "Rahul H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "What a great place!  It was really hot & we wanted to step into a quiet & cool place. We found it! Melissa helped us figure out the right beer to satisfy us. We had a cider & a Belgium style beer.   Great music & atmosphere. The bites sounded good but we were too full.", "author": "Scott D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "Location location location!!!!  Based on proximity to me, NEMA, Fox Plaza, mid-Market etc. this place gets the WooHoo rating!  A nice selection of beer covering many bases and many brands and at a fair price in a nice setting.  Enjoyed a Firestone Walker Sucuba barley wine that was 25 proof and delicious!  My partner enjoyed a North Coast Imperial Stout and was happy indeed with her pour!\nLook forward to this place developing their small bites menu and trying many more beers!  \nCHEERS!!!", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-11", "description": "One of my favorite places to grab a drink after work. Or on the weekends. Or whenever I'm in San Francisco, really.\n\nIt's a hop, skip and a jump away from Civic Center BART (for those of you who don't want to DD), and they generally have a good selection of beers on tap -- about 15-16 that they rotate periodically. Don't see something you like available on tap? No worries. Beer Hall also has several pages (see: 4-6) of beers that they offer by the bottle as well, sorted either by distributor or by type depending on your fancy. There's also an additional discount if you decide to purchase bottles to take away for later.\n\nThe owners and staff are very friendly, always willing to have a chat or offer up a recommendation if you're not sure what you want -- even if you're not sure what you like. They do offer samples/tasters that you can try before you purchase a full glass to hopefully guarantee that you enjoy what it is that you're consuming.\n\nTheir bathroom is one of the coolest ones I've ever seen. There's a black and white movie that plays on loop on the wall of Market Street in San Francisco during the early 1900s. It's amazing. It even has a soft music track that goes along with it.\n\nIt's simply a cool little venue in an area that's really starting to pick up (what with Twitter being RIGHT THERE and the spiffy new condo/apartment hi-rise that's going up pretty much across the street). They definitely have a regular in me!", "author": "Anna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "Very solid new drinking spot for beer lovers. The location is great and the selection is as well. I will definitely have many more visits to this place.\n\nWhat I Like:\n-20 beers on tap from California breweries. Mostly local small craft breweries and some low production offerings from some of the larger breweries.\n-Prices for beers on tap and for their bottle selection (200 plus) are very reasonable.\n-The owners and bartenders are friendly, helpful and offer tastes if you are not sure what you want.\n-Extremely mixed crowd so everyone should feel welcome.\n-A few wines available if you are coming with someone that prefers that\n\nDownside:\n-Small location, which I actually liked, but it may get crowded once the place really takes off.\n-When I came there was no food whatsoever and I was really wanting something salty to snack on.", "author": "Frank J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Overlook the sterile building and awkward Tenderloin-via-Twitter location. This is the best, freshest (i.e. most rotated) beer selection in the area. My wife loves the great cider selections. I appreciate the IPAs and other ales. This place has something for everyone.", "author": "Justin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Good location to hit up before or after a concert at Bill Graham or a central location for meeting friends from different sections of town. \n-Bartenders: A+\n-Price: B (You won't find Tecate or PBR here - this is expensive craft beer)\n-Beers on tap: B\n-Bottled Beers: A\n-Atmosphere: B (I like going here mid-week spot since it's low key and easy to chat with friends. The atmosphere is good but nothing special.)\n\nIf you're in from out of town though and looking for good beer combined with SF's diverse, fun atmosphere, I would recommend Zeigeist or Toronado over The Beer Hall.", "author": "Megan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Such a great place. Feels like a neighborhood bar with an upscale look. The staff has always been great and they sell bottles to go for 20% off. A must!!!! \nKeep up the good work everyone", "author": "Frank C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Lots of beer options. LOTS! \n\nHipsters rejoice, this is your home!\n\nThe people who work here were very knowledgeable and helpful. \n\nNot a huge beer fan myself. Came with my family when visiting SF. They love the place and it's local for them. \n\nI do, however, believe that any place selling booze/alcohol should have some food to help absorb. :)", "author": "None O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "I love this place! Pretty small and comfortable atmosphere with hip-retro taste. It's a good place to sit down to unwind after a long day at work in SF. You'll see a lot of tech-savvy geeks or engineers loitering around here sipping up refreshing breweries. \n\nThe only thing this place lacks is that they serve no food, but you can bring outside food here, though. Their beer prices are a little high end than usual bars. Great place to pregame up before a show at Bill Graham, which is down the block.", "author": "Jan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "Fantastic in a glass. Great place to hand with a buddy with unlimited amount of great beer from all over. What did catch my eye was the Deschutes Bend, Oregon was in full force here. Not to mention beers for all over the Bay Area and beyond. Five stars!", "author": "Kyle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "Great place to gather with coworkers and catch up, in a small group. The place is on the cozy side, and has crazy acoustics so the noise level can get pretty high quickly. I've got a soft voice so I usually hit this place early when it's not that crowded and mellow, or with 1 other person. It gets tiring quickly after a long day at work.\n\nREALLY cool decor though.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "This is probably one of those hole in the wall beer stops that you won't realize is there, but it's really just around the corner. At least for me I didn't even realize it was there until someone told me about this place.  Overall it's a pretty small place with little space, but man oh man is the atmosphere awesome.\n\nYou get the best of both worlds here if you are a beer fanatic. It's a cozy place that's very dim lit, but at the same time the atmosphere is perfect especially if you're on a date. The size of the place slowly goes away and transforms into a cozy area for you and whoever you want to bring here. But lets talk beer. The beer here is awesome! The selection always changes and carries a lot of different types of beers. Oh and the names for each one of the beers is actually really interesting as well so I recommend just taking a look at them for fun. Overall I love this place and would def. come again.", "author": "Nathan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "Beers, aesthetics and general atmosphere are good. 2 stars because of the innumerable times I have come and one bartender working with 15-20 people waiting to order--waited at least 15\" each time without getting chance to order, so left and went elsewhere. Please staff you bar appropriately when busy!! Treat your bartenders and guests with more respect!", "author": "Greg C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-22", "description": "Huge selection of beer, but it's all overpriced. Plus they got nothing to grub on.", "author": "Nate D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "Went here a few days ago for a birthday party and came away impressed. They've got ~30 beers and 5 wines on tap as well as another 50-75 bottled beers in stock. There's a small food menu as well. If you're hungry, the turkey sandwich is pretty good and reasonably priced. \n\nDownside to the place is really just 1) Location (close to twitter / uber offices but not really near anything else) and 2) size. If there are more than 40 people in there it gets a little cramped. There's only one bathroom and only one TV if you're looking to watch a game there. Other than that, it's a pretty good spot to go to, especially if you're in the area.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Great spot to get hard to find beers on tap and for purchase. Pricey, but that's to be expected.", "author": "Matthew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "Excellent pub in the Civic Center!\n\nIt's a bit small inside and can get really crowded, so be prepared to wait or stand. Pretty easy parking in this area at night.", "author": "Kenny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Very nice place to hang out and just mingle or catch up. Great service and good selection of beers.", "author": "Bao X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "This place is  amazing!!! Lots of beers on tap and hundreds by the bottles. You can also buy beers to take home. They're now serving food every Friday. The decor is done beautifully .", "author": "Tia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Small beer bar with tons of different local and regional beers on tap. Pretty awesome place to grab a good brew. Can't beat that!", "author": "Timothy Jim Roger S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "The range of beer is amazing. They really have a very large number of bottles of beer. But the beer on the tap is really good. Again, they have quite a selection on the tap.\n\nThe place is pretty small however and it can get really crowded in the evenings. Can also be extremely noisy and loud, but when you are having beers, the noise does not really matter I guess.", "author": "Shringar P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-05", "description": "Stopped here on a random Tuesday night with a friend. Not busy in the bar, so sat down at the actual bar. Ten mins later still sitting at the bar & watched as the bartenders kept helping other people. And then I left  without ever being acknowledged. Doubt we will be back.", "author": "H L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "This place has been on my list for a while. Glad I finally made it here.\n\nGreat variety of craft beer. By the sounds of it, the menu changes fairly often. Drinks range between $6-12. And they have a wall of bottles, where you can buy some extra special craft beers. \n\nAlso they have wine, in case you don't want beer at The Beer Hall..\n\nThings I like: \n- excellent customer service\n- beer flights\n- they let you sample beer\n- they actually want you to enjoy what you're drinking \n- if you ask, they actually give you recommendations without scorn! (friendly staff)", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "great variety! and i love the to-go deals ;)\nit's cool that it's so close to where I live, as they have good music and a nice ambiance.\nExactly what you need in a go-to bar!", "author": "Namrata J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Came in for a short trip.  I was looking for a bathroom actually when I happen to find this and loved it.  It's Small, Quaint and has a good selection of beers. What more could I ask for... oh wait that's right good looking people lol. This place seemed to cater to young professionals.", "author": "G P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "I love this place! 20 walking steps from my work. Good beer selection. Friendly staffs. Nice and creative wall. Reasonable price. \nIf you are a stout fan, go for no. 17!\nI would have given a 5 stars rating if they had had some bar bites to offer. All beer no food makes me drunk (too quick)! LOL!", "author": "Joelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "Like Beer? Well, this is the place to go.....my favorite are \"Belgian Fruit Ale\" 9.0%, \"Hoppy Red Ale\" 5.8% and of course \"Faction/Blitzen\"  IPA 10.4%. Bartender very helpful...good service!!! I think, they should expand or get a bigger place...I highly recommended this place - By the way, What really causes that potbelly, and how can you get rid of it? It's not necessarily beer but too many calories that can turn your trim waistline into a belly that protrudes over your pants. Any kind of calories -- whether from alcohol, sugary beverages, or oversized portions of food -- can increase belly fat. However, alcohol does seem to have a particular association with fat in the midsection.\n\"In general, alcohol intake is associated with bigger waists, because when you drink alcohol, the liver burns alcohol instead of fat,\" Remember...A typical beer has 150 calories - and if you down several in one sitting, you can end up with serious calorie overload and also remember that Alcohol can increase your appetite. Further, when you're drinking beer at a bar or party, the food on hand is often fattening fare like pizza, wings, and other fried foods...When you take in more calories than you burn, the excess calories are stored as fat. Where your body stores that fat is determined in part by sex, age and hormones. Ladies have more subcutaneous fat (the kind under the skin) than men, so those extra fat calories tend to be deposited in their arms, thighs, and buttocks, as well as their bellies. Because men have less subcutaneous fat, they store more in their bellies.  So, moderation... Enjoy your beer...Let's sip, Not Guzzle!!!  ;  )", "author": "Jeffrey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Cool spot. They had a pretty vast selection of beers on tap but unfortunately none of them appealed to me so I got one of my favorite beers they had in a bottle. Avery white rascal. Great beer and glad they had it.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-01", "description": "Out of 24 reviews, the only two reviews giving this place less than 3 stars base their reviews on not being open on Sunday and not serving west coast beers. Really? \n\nThis place serves about 20 beers on tap (plenty many more in bottles) and occasionally has free food available for patrons (i.e. Paxti's pizza). On top of that, this place features breweries (currently Deschutes) that will feature several beers on tap and have giveaways like free pint glasses with beer or quality key chains. The beers rotate quite frequently and based on the season so check back in often (or check their FB page or Twitter for latest beer menus, drinks specials, and giveaways etc.)\n\nThe owners are knowledge and will make solid recommendations to your liking in case you have any questions or would just like to try something new.", "author": "E E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "Good selection of beer. I liked that they had wine & cider as well. I wish they had more of a food selection. It's a good spot for a quick after-work drink.", "author": "Cassandra F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "What a welcome addition to the Civic Center Happy Hour scene!  So welcome, in fact, that I may have been to this bar three times in the last week... no comment...\n\nThe staff is friendly and knowledgable (the owners' last name is Hall... get it?  get it?), the space is warm and inviting, and the rotating beer selection couldn't be better.  Everything you find on their giant beer wall is available chilled, and there are even a number of beers you can only find on tap here, like their Beer Hall ESB.  Personally, I am having a mild love affair with the St. Bernardus Abt 12 Quad.  Can't wait to see what they do with the food program and wine list as the business continues to grow!", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "We stopped by with a party of 5 for happy hour. At 5:30 PM it was easy to get a seat for everyone in this small establishment although in about an hour it was quite crowded. I enjoyed how personalized the service was, allowing each patron to sample a variety of beers before making his or her final selection. They are a little light on the food offerings--pretty much just kettle corn and a few panini sandos--but to be fair their main focus is on the beer. I enjoyed my first visit and I will definitely be back.", "author": "Lou S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Great beers on draft (check out that triple IPA! :o), really pleasant service, and tasty little bites (panini and such). I booked the place for a group of 20 just 1 day in advance and they were extremely accommodating in making space for us and ensuring that we had all our needs met. Will definitely return!", "author": "Ted M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "This is my go-to spot to grab a beer after work. Awesome selection of beer, cozy place & fun employees. It can get a little loud in there but overall it's a fun spot.\n\nIdeal spot to pregame before a show at bill graham. Just make sure you grab a burger beforehand!", "author": "Christina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "This place is an especially nice because of the lighting. With the slogan \"Revitalizing mid-market 1 beer at a time\", this place lives up to its claim. I recommend the collaboration, a Belgian Tripel. The service was great because the bartenders are very knowledgeable about their beer. If you work around mid-market, stop by for a drink with a friend. Also a great place to continue your night after the symphony or the opera. Lastly, take advantage of their 20% off deal for beers to go.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "So happy to have a place that rivals City Beer Store right in my neighborhood! I loved the beer selection, both on tap (the brandywine was the best I've ever had!), and in the bottle. They have a 5-6 page printout (with tiny print) of their copious bottle offerings, which means that my husband will be stopping here instead of the overpriced corner stores to bring something home from now on. :) \n\nI liked the ambience, and the staff were great. The only things that could make the place better are happy hour prices if they don't already have them (even if happy hour is later, since it was already super packed at 6:30 but winding down by 8:30), and of course, noshing options. I'll definitely be here often!", "author": "Jen R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-15", "description": "I expected more on tap for a place called the Beer Hall. Several of the spots on the 20 tap menu were blank, presumably because they had run out during the week (we visited on a Friday night). There were also no small bites and limited seating in a place that filled quickly.\n\nThe beer selection in bottle form is very extensive and full of great choices. The menu is segregated by types which is helpful if you are looking to try something new. Overall, solid place for a drink.", "author": "Jacob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Best beers in SF!! No doubt about it. Great selection.  Strong tasting!  It's a small place but it has a good vibe and I have always found it very enjoyable", "author": "Francisco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "A good choice of beers, a nice ambience, and a friendly barmaid! It's a good location to indulge your taste in beer. Only concern: some of the prices are kind of steep for beers... but hey, this is SF and everything is expensive anyway.", "author": "Sebastien C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Beer hall was way smaller than I expected nestled in the randomosity that is Civic Center/Twitterhood.\n\nThe bad is that they only have a tiny TV in the corner, but there's plenty good to make up for it. Large tap list, delicious food (turkey panini and spiced nuts), though you will still feel hungry afterwards. The staff are all really awesome. They'll bring your drinks to you when you order at the bar.\n\nCozy atmosphere. Arriving at 5:30 on a weeknight is no problem, you'll have a table and beat the rush. \n\nAlways excited to try new beer spots in the city!", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-06", "description": "Nice place, decent bottle selection (nothing crazy), good beer spread on tap.  A little tight and a little pricey.  Great bathroom.  Friendly staff.  Loud as shit when crowded.\n\nThey don't update their beer menu online, so you sorta have to cross your fingers and hope for the best when you show up.   Worth checking out, but not worth a special trip.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "Stopped by here after the Giants Parade. The dual combination of coming on the day of the parade and Halloween made it quite busy and lively inside, but still my buddy and I managed to grab a table. Very good tap selection, and was pleased to see them offering a pumpkin beer (T.R.E.A.T.) for the holiday, but was blown away by the Boulder Choco Shake on nitro.\nThey do offer table service, which was very nice and a rarity for a place so small. My only complaint, and lack of a fifth star, is they are a bit pricy. The bottle selection on the wall was especially apparent of this. Definitely worth the stop however. Recommended", "author": "C B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "The BEST new addition to the neighborhood.  Mr and Mrs. Hall have outdone themselves creating a space that is ideal for conversation (the background music never overwhelms) as well as for meetings.  Streamlined, sleek and easy on the eye, the environment alone had me sold on making this one of our regular haunts.  Gotta love a place that has an interesting video playing in the lav.\n\nNow, for the beer ... Such a great selection and so well thought out.  I could bring any beer snob along with me and we would all have ample options.  One of the few places in town that does their best to always have a porter on tap.  Major kudos for that!  Very impressed with Drew Hall's attention to variety of beer styles.  No matter how you feel about ciders, he always makes sure to have a good one for those serious cider lovers.  \n\nWe are sold on this place.  Caveat:  5:30pm becomes a madhouse when the local businessfolk descend upon Beer Hall.  Arrive much earlier OR much later.", "author": "Joe W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "Great neighborhood spot, 20 beers on tap, 100s of bottles available. Very knowledgable and friendly staff.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-14", "description": "That's the beer list.  Please give me something I might actually want to drink. There is still nothing better than a nice IPA, and not a single offering of a classic west coast beer.\n\nSpare me and we give you two years max if your lucky until you close down. Give us something good, great beer, service, atmosphere, but not this!", "author": "Bill K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "I perhaps could do less with pumpkin beer and more with a bitter, but bitter would I be without the Beer Hall in my neighborhood, especially given that you can order in from Little Griddle (with a reuben that one should not overlook).", "author": "Laurel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Lovely environment and great selection of beer. A special shoutout to Sam the bartender for being incredibly nice!", "author": "Caroline F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "Came here for SF beer week and the place was so cute (and crowded). We were lucky to find a table for too. Their Beer Week event was set up like a blind taste test and they had raffles during the event as well. Never found out which beers we liked the best but that's ok. There was a little snafu with the bill but they corrected it immediately.\n\nDefinitely will want to come back!", "author": "Aneilia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Was expecting this to be somewhat yuppie when I walked in, as a friend picked out our meeting spot. Was pleasantly surprised by the chill atmosphere, great beer, and the bartender's knowledge about the beers on tap. The dish of olives was super yummy and make the craft beer taste even better. Gets pretty crowded at happy hour, so arrive early if you want a place to sit.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Off the beaten path and tucked away on a street with almost no other retail shops, a good find for a wide selection of beer on tap and in bottle.", "author": "Canuck W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "Nice place. Small but cool. Nice digital menu. Great beer. Can get very loud after about 6:30.", "author": "Dion G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "New place in town, 20 beers on tap. 280 on the bottle list.\n\nQuite, hasn't become a scene yet. Mostly local or Twitter folks drop in for a drink.\n\nFriendly staffs, and you can bring outside food in as they only serve delicious beer that will wash down whatever you are eating smoothly.\n\nOnly downside, the place close at 11pm!", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "The Beer Hall is a fun little beer bar at the intersection of Market and Polk. I stopped in right at 5pm on a Friday to grab some beers to go.  The place was pretty packed and very loud, but given the timeframe I understand.  The taplist was diverse and filled with quality offerings, and the bottle selection was also very good.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "This place is the best!  Close to work and so easy to swing by on the way home.  The owners and staff are super nice and generous!  They try to cater their selection to the unique and adventurous taste.  Lots of options from ciders, beers on tap, bottles, and even wine.  The small plates are also tasty snacks.", "author": "Elise A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "My fiance and I were in SF for Pride this past weekend, and decided to check out some of the surrounding bars and restaurants when things got really crowded at the festival.\n\nThe Beer Hall was hands-down our favorite. I'm a huge beer geek, so seeing their huge selection and getting to talk to their knowledgeable staff about their different brews was a great experience. I ended up sticking with the Fuchschen Alt. My fiance is a big fan of Bloody Marys, and they were running a Pride special on them, so they stuck with the hard stuff. The Mary was spicy and delicious.\n\nWe live up north of the bay, but we'll definitely be back to this place again next time we're looking for a good drink in the city.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "SF beer week ipa flights & tasting competition. Cozy space, conveniently located, lots of offerings. Come here for the beer not the food.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-12", "description": "I enjoy simple, cool and casual.  Beer choices are decent and it's all good for my taste.  Nothing nicer than beer in a brandy or cognac sniffer!", "author": "Daniel S. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "Great first drink and first impressions. I'll be back with friends next time. Love the location.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "It's hard not to appreciate truth in advertising. It's also nice to see that very rare Young's Double Chocolate Stout on tap.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-01", "description": "Came here to check out a World Cup game after Pride\n\nLet's begin with the good: They have a great beer selection and the space is really modern and pretty.  People seemed to be festive and the place gave off that friendly vibe.\n\nThe bad: The beers were  over priced for my price range but I guess you pay for good selection. Also, I got charged for club soda which I know is fair but come on, have some love for the designated drivers.\n\nNormally, I'm told, they don't have food and we came on a day they were testing out a new vendor.  The food was astoundingly gross.  BUT you're not likely to have to experience that if you check out Beer Hall in the future.\n\nService was slow and inattentive.  Never checked on how we were doing.  Granted the place was packed.  If I was in the neighborhood I'd be happy to give it another try.  Definitely a cool concept in the area with lots of potential", "author": "Meg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "One of my go-to beer places when in SF.   Very good bottle selection, and good draught selection with 20 taps and which seems to rotate often.  Small space so it is intimate, but can also be crowded and loud.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "Nice atmosphere, great selection of beer, great prices, nice and helpful bartender. I'm very glad I discovered this place. I spent some time marveling at the beer bottles on their shelves, before eventually sharing three large 22oz bottles with four friends for less than $40 total.", "author": "Yiannis S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "They have a good selection of beers on tap and bottled. The staff was pretty helpful, and I like the ambience, though the place was a bit small for the crowd it draws. I wish they served snacks though. Worth a visit if you're in the area, but not a special trip.", "author": "Jiselle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-08", "description": "This place has so much potential.  Already forming great events like today's release of Velvet Merkin.  Big fan of the digital menu too.\n\nUnfortunately, that's where it ends.  Their bottled beers for purchase are ridiculously overpriced!  They were selling Seizoen Bretta for $16+, this farmhouse ale is usually $12 at City Beer Store and often $10-11 at other small spots.\n\nWord of advice: Don't assume your location is sufficient rationalization for such a premium markup.  The beer geeks you want to attract can take their money to more affordable places in the city.", "author": "Aalok P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "A small place, but with friendly service and great selection of beer.  The staff was helpful and made good suggestions.  \n\nThe decor was fun and music was at an average volume so I could still carry on a conversation with friends.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "This is a great addition to my otherwise sketchy neighborhood. Friendly service and a great eclectic beer selection.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-12", "description": "Deceptive name.  The place is very small.  There beer selection was good and service was pretty fast considering how crowded it was.  I would come back.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "I love this place. It combines dive and class beautifully, which is even reflected in the price of their beers; they tend to be very cheap or very expensive, with not too much in the middle.\n\nFriendly, attentive staff with a ton of great suggestions for every taste. Best of all, of course, is their fantastic variety and quality of beers from all over for every palate. While snobs will be satisfied, it's also very easy to find something for everyone, including the very casual crowd.\n\nThe only negatives I can think of for this place are 1) no food (I'm not sure why, probably it would mess up their simple execution style)\nand\n2) So low-key that it's easy to miss even if you walk right by it outside. Seriously, I often have to wait outside to meet friends and guide them in because it's so nondescript and the sign is so small. Could use a marketer.\n\nOverall, though, I love this place, and whenever I'm nearby I try and stop in.", "author": "Ned D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Located in downtown SF, parking was surprisingly easy.  The friendly bar tender was willing to pour tastes all day until we found the ones we liked.  With such a large selection of beers be patient cause it can take a while (but that's where the fun is)!  Genuinely, I didn't have a beer I didn't enjoy...highly recommend.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Great beers on tap and available to-go. Not much space inside, but if you can arrive before the techies at Twitter, you should be able to score a seat.", "author": "Michele K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "Great new beer place with an interesting selection of beers on tap, nice ambiance/decor, and a cool video of 1906 San Francisco playing projected on the wall in the bathoroom!  I'll be back here again for sure.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Absolutely love this place! Amazing atmosphere and knowledgeable staff. Beer selection is above and beyond anything I've ever soon. Amanda is smart, hardworking and a beer expert! I LOVE THIS PLACE!", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "Awesome selection of a huge variety of beer. A much needed craft beer bar that is bound to become a staple of the neighborhood. Really just well done through and through, from the beer wall to the live updated tap list. This place gets excellent and hard to find kegs that range all over the beer palate. Fresh \"Drink By...\" IPA from Stone? You had me hello.", "author": "Jesse N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "I don't Yelp very much, but when I do, I find myself in 5 star places. Today I find myself amongst friends here at the Beer Hall. Both of the employees kindly took time to explain the menu and were genuinely nice to talk to. We were looking for a cool bar before jumping on BART to the airport and this place was the perfect place.", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-24", "description": "Great, new spot with very friendly and knowledgeable staff. It's a small and cozy place that has over 200 beers available including about 24 on tap. Hopefully, they will get a kitchen soon as they have food trucks coming by once a week right now.", "author": "Jared C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "If you like beer... You're home!  This place has over 200 beers and great service. We were greeted at the door and they suggested a couple new beers based on our taste.  Great place.", "author": "Mike Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "If you're looking for a place to hangout for a couple of drinks after work, this is the place to be. You get to choose from a variety of beer options. If you find yourself confused at any time, speak to the staff and they'll always be ready to help you out. The prices are reasonable. The place is open from 4-11pm, but it is closed on Sunday, which can be a bit dissapointing for many beer lovers...:D", "author": "Dinkar K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "I would definitely come back. Great selection and atmosphere. Good amounts of shared and private tables. Near perfect bar execution.", "author": "The S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "Too many four stars...this place is a 6 star joint.  best staff, best beer, great food.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "My new favorite beer place in SF.  It's got the selection of city beer store, but actually nice and comfortable inside.  Plus there seem to be a few less beer nerds and even a big tv.  I wish I lived/worked closer so I could hit it more often!", "author": "W W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "LOVE, LOVE, LOVE this up-market (literally, its on Market!) Beer Hall.  Not a dive bar, but a true Beer Hall where the owner works behind the bar and all the staff are VERY knowledgeable about their \"over 200\" Beer selection.  Yes you read right... over 200 beer brands and available for take out!  I had the Dog-patch Sour which after being told where it comes from, how its made and other beers it would compliment I am a true fan!  Wishing you all the best on your new venture guys.", "author": "Simon S."}
