{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Definitely stay in the bustling area, unless you were born and raised here. Nothing happened, but sanitation and security is a huge factor while traveling to a more foreign area.\n\nThat being said, lots of street parking! Lots of great food/restaurants! Beautiful mural art, if you look up from your phone.\n\nDon't forget to check out Mission Dolores Park, Bi-Rite Creamery, Clarion Alley and anything else! \n\nPS: Lots of places are not open until later in the day. So make sure you check your hours before coming!", "author": "Hurjane V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Plenty to do, see, and eat. The Mission District used to be the happening place in San Fran but as of late has become a bit sketchy. I won't lie this is the most homeless populated area I've seen in the city so far. But I will say there are also hipsters so I guess the thing to know I'd enter at your own risk?? On a real note, I felt safe the whole time it's just not as clean as other areas. \n\nA couple neat thrift shops and great restaurants I will say. If you're a fan of Mexican food, you have to go to La Taqueria, best burrito I've ever had! A cool area but if you're wanting to spend the better part of the day in the area, go to mission for lunch and then go through the mural alley to Valencia st. Mural Alley isn't the actual name I don't think but you get the idea, a whole alley with murals on both sides by local artists. Super interesting to look at and there's tons of people also there looking and taking photos. So take this alley over to Valencia and find more cafés and vintage shops. Same area but I would say Valencia is nicer and more hip. More people too but worth it to go down both streets.", "author": "Cara H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "#53/2016\n\nChanging- some might not call it progress- with explosive growth in the past few years, I have mixed feelings about the Mission District.\n\nThe streets are dirty almost everywhere especially on the main/busy thoroughfares (watch your step for piles of feces) and it has strips of super hipster watering holes and restaurants with prices and attitudes to match.\n\nThen you see the blue collar, original Mission with taquerias, green grocers peddling great, cheap produce and blocks dotted with Asian fish markets, social service agencies, payday loan storefronts, mom & pop restaurants, rundown apartment buildings, dive bars and more jiu jitsu, boxing, construction and lumber companies than you can count. \n\nAnd lots and lots of bike lanes with packs of bicyclists. \n\nNoe Valley with its swath of fashionable boutiques restaurants and mothers (often nannies) pushing Peg Perrigo strollers, vacillates whether it's part of the Mission (it is). \n\nEye-catching murals and hidden alleyways with turn-of-the-century tiny houses in various states of gentrification, the Mission offers a kaleidoscope of views. \n\nDramatically hilly streets and tended Victorians that've increased 15X in value over 20 years stand next to contemporary new construction. You'd think the architecture would clash but somehow one complements the other. \n\nOften gritty but paradoxically now out of reach for anyone but the super affluent (hello Zuck and Liberty er, Facebook Hill), you'll find a schizophrenic district that's seen more change and upheaval than almost any other part of the city except for maybe Dogpatch.\n\nBut, the Mission's population density is what makes the dichotomy so striking: The great push forward of an ever-more-expensive city paired with the heartbreak of artists, families, both recent and established immigrants unable to hang on or just pushed out for the far better-heeled new residents, dollar-eyed developers and city leaders way too comfortably nestled in VCs' pockets. \n\nIt's the Mission that makes me pause and question if it's time for us to go. \n\nI think there's still a place for us.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "This area is PACKED to capacity with artistic flavor. I mean blocks and blocks of beautiful street art, awesome restaurants, historic landmarks, revitilazing construction, corporations, hotels, shops.\n\nYou definitely wont have a problem being entertained or finding great food in The Mission. There's everything from health food vendors to good ol' greasy spoon diners along these vibrant San Francisco streets. Shopping is endless from upscale designer stores to local boutiques.  \n\nTake a cable car or trolley ride through the area if you prefer not to fuss with parking.  Personally, I suggest getting your feet to the pavement for optimal views and memorable photo ops.\n\n~Christy loves The Mission, you will too.", "author": "Christy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "Growing up in the 80's, I avoided The Mission like the plague. All I noticed were the dirt, garbage, filth, crime, junkies, gangs, homelessness and corruption from the union halls.\n\nOh wait, that's City Hall. \n\nBut in seriousness, I did not like coming to The Mission and it was my least favorite neighborhood in San Francisco. I was young, naïve, dumb and stupid. Now, I know better and appreciate it a lot more. \n\nLong before it was called San Francisco, The Mission was populated by the Ohlone and Yelamu Indians. After the Spanish Missionaries colonized this place and named it Yerba Buena, they established Mission San Francisco de Asis. The natives were used as slave labor to build and finish the Mission and their population dwindled to just fewer than 50 in a few short years. \n\nSounds familiar to what's happening now? \n\nWith streets named Valencia, Guerrero, Dolores, De Haro, Bernal, Mariposa, and Noe, these were the original Ranchos (mostly Spanish-Mexican families) that were granted lands devoted to raising cattle and sheep. With the expansion of the Mission after the Gold Rush, it was subdivided into permanent housing for the incoming working-class immigrants like the Germans, Italian and Irish.  \n\nDuring the 40' and 60's, there was a large influx of Mexicans as most of them came to complete the western span of the Bay Bridge. Ever since then, through the 70's, 80's and 90's, most of the immigrants came from Central America, which gave The Mission it's distinct Latin culture that has been prevalent until today. \n\nWell, until the Dot-Com boom, Hipsters and Techies suddenly started moving in initiating gentrification as we know it today, which has created a culture clash for better or worse. But the more things change, the more they stay the same and history appears to repeat itself. \n\nBut what I do love about The Mission is the cornucopia of different cultures that has created a vibrant place, especially when it comes to the food scene. You can just about taste the world in this neighborhood with so many restaurants representing each corner of the world, it seems. \n\nThe Mission is home to the first Philz's, Carnaval, Mission-style Burritos, street food, Michelin-rated restaurants, hole-in-the-wall places, great bars, bakeries, street art, ice cream (Mitchell's, Bi-Rite, Humphry Slocombe), murals, music and so much more. It's definitely a great place especially if you're a foodie.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "What's the best place in San Francisco to experience the nice weather? Yup you guessed it, THE MISSION!\n\nOne of my favorites places to visit when coming to SF because I know I can always count on good restaurants and drinks, good shops, and great transportation!\n\nMISSION IS KNOWN FOR THEIR FOUR SUB DISTRICTS:\n~Potrero Hill area is known as a center for startup businesses and also some bomb chic bars and restaurants. \n~Dolores Street is famous for Victorian mansions and the popular Dolores Park at 18th Street. \n~Valencia St, from about (15th to 22nd) and the 24th Street in the south central part of the Mission District are both very popular destinations for their restaurants, bars, galleries and street life.\n\nNOW LETS TALK ABOUT FOOD:\nThe Mission district is influential for its restaurants. There are tons of Mexican restaurants that are located throughout the neighborhood, showcasing a localized styling of Mexican food. \nDid you know that San Francisco is the original home of the Mission burrito? There are also tons of great Salvadoran and Nicaraguan restaurants there as well as a large number of street food vendors. \n\n A large number of other restaurants are also popular, including: Mission Chinese Food, Mission Pie, Bar Tartine, La Taqueria, Papalote, and Foreign Cinema on Mission Street, Delfina on 18th, and Luna Park on Valencia\n\nRELIABLE TRANSPORTATION:\nThe neighborhood is served by the BART with stations located on Mission Street at 16th Street and 24th Street.  Muni bus numbers 9, 12, 14, 14L, 22, 27, 33, 48, 49, 67, and  the J Church Muni  line, which runs down Church Street and San Jose Avenue.\n\nWith that said, this is great place to visit in San Francisco and get a different look at the city from a different view!", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Oh man oh man oh man! I can't say enough about the Mission District in San Francisco, CA. I think the first time I ever stepped foot into the Mission was after a day spent at Dolores Park eating good old Bi-Rite Ice Cream. It was really at that initial experience that I fell in love with everything about the Mission District.\n\nSpanning several blocks, the Mission District literally houses all the best culture that San Francisco has to offer. If I remember correctly, this area used to be all Hispanic back in the 80s and 90s. Now, there's such a hodgepodge of different groups of people that all come together for one person: to relax and have fun. \n\nJust go out onto the street and it will be difficult and nearly impossible for you not to see something interesting. Whether it be a beautiful mural, the famous women's center on Mission, or even the Truffle Man with his \"special\" chocolate, the Mission has EVERYTHING to love and die for. \n\nA number of famous eateries, dessert places, etc. are all located in the Mission as well. Some personal favorites include Yamo (burmese street style food), Poc-Chuch (el salvadorian food), Tartine bakery (best bakery), and of course Bi-Rite (best ice cream). Honestly, there's the best everything in the mission. Oh yes, don't forget El Farolito - the best quesadilla in the world.\n\nSo overall, the Mission is perfect. I am so jelly of people who live around here. There's so much life around here. I don't care when people say it's dangerous. That's life. Hop on Bart and get off at 16th and Mission. You won't regret.\n\nHave fun and prosper,", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Ah the Mission,  its big,  its varied,  why have they not split it into several neighborhoods?  \n\nIt seems to be all things to all people,  sketchy, hip, run down, dirty,  cool, and beautiful,  It all depends on what you are looking for, and where in the neighborhood you are.  \n\nThere is good food,  umm lets say unique people,  good shopping, great art both in galleries, and murals on buildings,  I have been to some great little shows, theater, other events,  Yet somehow nothing bad has happened to me here,  Not even the food has tried and make me sick.  \n\nWhen the weather is nice there are street fairs and other outdoor events,  Watch for them, they are a fun way to get to know the city.\n\nSo I think every trip to San Francisco I make  I will come here, find something new,  and visit my favorite parts, and places.\n\nTip: check to the San Francisco Guides,  They do free guided tours all over town,  They are lead by locals that want you to see their city the way they do.  The tours are informative,  Interesting and there are a number here in the Mission!\n\nTip 2: leave your car at home,  There is no where to park it here.  Besides walking and mass transit rule here.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Top 5 reasons to visit The Mission:\n\n1. It has the best weather in San Francisco City proper!\n\n2. It is THE most culturally diverse neighborhood in San Francisco; Latino, American, African, Indian, European, Asian..everyone is here! I love it!! \n\n3. The best murals, graffiti art and city sponsored art in San Francisco are all around The Mission. \n\n4. Getting here is easy - nestled between 2 BART stations + The 12, 14, 22, 33, and the 49 all pass through.\n\n5. Some of the best restaurants, only in San Francisco grocers and shops are in The Mission. \n\nBonus star... I live here, so it has to be awesome! duh.. Come for a visit.\n \nIt's Always Sunny in The Mission!", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "When I first moved to SF, 22 years ago, the mission was all about 2 things...\ncheap Mexican food, & bars.\n\nI was told by those allegedly \"in the know\" that I had to have a burrito from La Cumbre, Pancho Villa, & La Taqueria.\n\nLate, late night dining was synonymous w La Rondalla.  I had never eaten dinner after 2 AM before going there.\n\nAnd, for drinks, the mission was the destination for the Latin American Club, The Make Out Room, & later on, Bruno's.  \n\nLastly, you had to have your pics taken in the photo booth at Elbow Room if you were to be taken seriously as a legit city peep.\n\nBut, other than that, if you didn't live in the area, it wasn't a neighborhood to venture out to on the regular.\n\nWhat a couple of years can do.\n\nDelfina came onto the scene in the late 90's, & the flood gates burst open.\n\nCheap Mexican?  Yeah, it's still here, but now so is everything else.\n\nGreat coffee? Check!  Both Four Barrel & Ritual are in the house.\nGreat Italian Food?  Check!\nGreat Indian Food?  Check! \nGreat Peruvian?  Check!\nGreat fine dining?  Check!\nGreat pizza?  Check!\nGreat brunch?  Check!\n\nThere's still the old school represented; Muddy Waters is still alive & kicking, as is La Rondalla now that it's back.  And of course those beacons of presence...\nMission Dolores, & Delores Park.\n\nBut the Renaissance of this neighborhood is staggering.  It's old & new, money & no money, hip & unhip.  Sagging & botoxed.\n\nIn a word, it's fabulous.  \n\nBut...\nwatch out for bike riders, & don't even think about leaving anything in your car, or not locking it.  It's also important to be cautious about where you park, because of vandalism.  My former colleague found his BMW spray painted, & I returned to my car once to find foot prints on my hood.  \n\nNo Bueno.\n\nStill love it here, though.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "My boss owns this one place in the mission, and I own getting buzzzzzd in the mission.", "author": "Viv R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Ohhhhhh, Mission. \nYou dirty, dirty whore.\nI can't quit you.", "author": "Kat R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "Do you want people pooping on sidewalks and selling drugs AS WELL AS luxury condos and stores that sell $300 sunglasses?  Do you want $4k/mo. rent for a modern-architecture apartment with a view of evicted Latinos and senior citizens?  Do you want a neighborhood where fires \"accidentally\" claim the few remaining rent-controlled residential buildings, so that you can be the phoenix who sips bourbon cocktails from mason jars in its ashes?  Do you miss your old frat, and wish you could turn it into an entire neighborhood on weekends?  Do you want to guiltlessly step over sleeping homeless people en route to your favorite Michelin-rated restaurant?  Do you want to help hammer in the nail on the gentrification coffin?  Do you want the luxuries of the Marina and Pac Heights, but the perception of feeling hip and edgy, instead?\n\nWell, look no further.  The Mission is for you.  \n\nWhile the Mission used to be full of dive bars, mercados, tiendas, burgeoning artists, ingenuity, moderately-priced rent, bookstores, miscreants, weirdos, family restaurants, and Latinos grilling food in their driveway on a Saturday -- we've gotten rid of those pesky initial phases of gentrification and moved onto the next.  \n\nSo, COME MOVE TO THE MISSION, guys.  There's space for EVERYONE (who earns a tech dude's salary).  ...We've paved paradise, and put up luxury condos.", "author": "Elle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-08", "description": "Great place to come if you like Mexican Food, murals, nice SF weather, and some tension.  There is palpable tension between every single group that resides here.  It kind of reminded me of New Mexico in that way.  For example, was it necessary for another patron to look me in the eye and yell \"viva Mexico\" in an aggressive manner while I'm just trying to order tacos?   I felt like yelling \"I'm Hispanic too bro!\" back at him but what would be the point.   Geez, can't throw a tortilla without hitting someone who has beef.  Or maybe, I just came way too far south (24th).  \n\nI came, I saw, I ate, I got pissed, then I left not really itching to return anytime soon.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "I chuckle every comment I hear about \"The Mission.\"  It's either a love or hate, and rarely in the middle. Those who thinks this is a forgotten place with drug stricken drug lords running the area, they're usually on the other side of San Francisco, sheltered, or they're from the suburbia who rarely come to the city. LOL j/k\n\nSometimes we can miss out on an opportunity for growth particularly here in The Mission. I remember myself when I was 9 years old running around on 24th Street. Sure we had tons of homeless. That's inevitable. They're everywhere in the world. I was lucky my family taught me to think free and provided me with a multicultural experience especially during my childhood years. I am lucky to be a part of The Mission who continues to teach me \"common respect.\"\n\nThe Mission is not for everybody, but one thing for sure when people want to experience cultural diversity, they somehow think of coming here first! Isn't that ironic?\n\nCheers!", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "***** iFeliz Cinco de Mayo! *****\n**** iFeliz Cuatro de Mayo! ****\n*** iFeliz Tres de Mayo! ***\n** iFeliz Dos de Mayo! **\n* iFeliz Uno de Mayo! *\n\nYou might be celebrating later, but I've already started. See, just because there's a thing called Cinco de Mayo, doesn't mean that's all there has to be. Do you know how many Spanish numbers there are? Mucho. Like infinito. That's why you don't have to wait till Cinco and you don't have to stop after Cinco. #hastaelinfinitoymásallá #seguimoscantando #seguimosbailando\n\n(started with Uno star then countdown-ing to Cinco) #iniciadoenlaparteinferiorahoraestamosaquí", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "THE MISSION = Dirty, Druggy, Hipster, Dog poop, Dollar stores, Bad parking, Record stores, a few good mexican restaurants (and a lot of shitty ones)........\nI friggin love it!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "The graffiti art in this area is better than anything I've seen in any city. A really wide variety of artist styles and everything is kept clean and preserved. So colorful and tasteful you could spend all day just walking around and soaking everything in!\n\nA must see for visitors to San Francisco!", "author": "Trevor P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "I grew up in the mission my whole life there's always something new to see especially when I saw all the painting and pictures that people done I took photos you'll see everything here they have great food all kinds of food of the shop's you just walked for hours specially a beautiful warm day.", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "The Mission is a historic neighborhood that boasts of culture and diversity. Nowadays, mainly classified as a gentrified hipster locale; this district stems far deeper in its heritage and roots than anyone can fathom. So yeah, during the 80's or so, there were the Northenos and Surenos that ran the streets... Orale! But, later became the \"New Bohemia\" and onward into the 2000's where dot com boomers and young urban professionals dwell. Not to mention that this was the exact location where the first Mission style burrito that we've all grown accustomed to and have fell in love with was created. \n\nI for one, have enjoyed the Mission District for all its colorful aspects. From the various ethnic restaurants down to the unique storefronts. \n\nI doubt I could ever tire from such a varied atmosphere. I believe that anyone from whichever passion, background, or interests, can find something adventurous here in the Mission.\n\nNot to mention that this is one of the most sunniest areas in San Francisco!", "author": "Ann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "Still looking for a decent taqueria. They're all poor to mediocre.\n\nOn the bright side, it's the warmest spot in SF.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-27", "description": "Depends what you're into. If \"dirty streets\" mean \"colorful,\" then it is! If some pretty sketchy restaurants mean \"authentic \" then it is that! If a few buildings are painted and that means \"up and coming\" neighborhood, then it is. If you are hit up for money and that's \"cultural diversity\", then it's that too. It's got something for everyone I guess. Would I pay half a million bucks or way more to live here? Not in a heart beat.....my family settled in SF in the 1880's. \"The Mission\"will always be \"the Mission\".\nIt's just the way it is.....(but to see \"real estate\" bottom feeders, try to convert this to high end dot.com housing, they can go to %#^#}!! Just let the Mission be the Mission.", "author": "ponyboy b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "This place is full of local businesses and restaurants. I didn't see a single chain restaurant or even a fast food chain while walking around the area.  There are also a lot of murals.  My friend showed me an alley with tons of murals.  She said that they change regularly.  It's worth a visit.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "So it is not often that I feel the urge to write a review of a city. I dont think I have yet at least. However this is about a neighborhood. Talk about kinda random. But this place is one of my favorite haunts within one of the best cities in the world (outside of the politics, strictly speaking stuff to do and places to go).\n\nWell the Mission is totally unique in that there are about 2 bars per block, 1 pizza joint, 1 taco stand, and every shop has homes over it. Flat style living to the nth degree. The food, bars, nightlife here is outstanding. The shopping is kinda whatever for me, the parking is bad, but the times are fun and anything and everything can happen here. \n\nOutdoor concerts randomly occur (not big bands but yeah you know what I mean). Let alone random dance parties can be witnessed as well. There is nothing like taking a stroll between watering holes and being entertained the whole way by different performers and people. You can find fun parades (like memorial day weekend they have a Mardi Gras style one) as well. \n\nPRO TIP: Be careful with your money and keep an eye on any valuables (you dont want to loose them)!\n\nIts easily accessible by Bart and via car or bike. Its also awesome in that it isnt just the main drag but it is many side streets filled with happenings. Whether it is 3am or 3pm there is something happening here somewhere. \n\nSo check this place out sometime and enjoy the experience. My favorite place to chill in the Mission is The Monk's Kettle. You may like it also, if you like beer bars =)", "author": "Schel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Just last year a group of friends and I went on an adventure to the Mission District. Out of all of us, I fell the most in love. When we first emerged from the Bart station the smell was the first thing we noticed lol. Since I am from Marin im not used to all the homeless so I was a little worried almost scared if I'm being honest. But luckily since we were a big group and one of our friends lived in the city and knew their way around I felt okay. As we walked around I started to notice various artwork everywhere. From little pieces on the sidewalk to huge murals. \nWe made our way down and eventually came to this long alley, I was in awe. Beautiful murals covered the walls and even the ground stretching as far as the eye could see. It was probably the coolest thing I had even seen in my life. I looked at each piece in detail and really loved every one of them. \nI've been back 2 times since then to what I now know is Clarion Alley. Each time I go I fall more in love with the mission and I really has so much character and is unique! Although my parents warned me you really do need to keep an eye out and be aware of your surroundings. Always be careful! Have a great time", "author": "Izzy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-30", "description": "being pissed off being told that you have vip table at this venue  then being told by the owner  who was a prick that its his club and he can do what he wants  only to find out your name is on the vip list reserved  table you had to bring out the newyorican in this puerto rican in order to get your point across. ... then the prick never admits his mistake never will i do this venue  again and la india concert  \nher promoters  need to know how we were treated", "author": "Alfred M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "I really crave the banana cream pie! When in the city I will stop and purchase a whole pie for my family.  It's flaky crust is just done perfect ! It's quiet a treat if your in the mission and have a sweet tooth craving. \nCan't go wrong!", "author": "Dottia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "We drove around in this neighborhood on vacation.  It's a neighborhood with its own vibe.   A lot of graffiti, much of it well done.  It felt like another city, separate and apart from San Fran.", "author": "Sheri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "In the end, I moved. For a variety of reasons, the biggest being I was priced out. I'm going to graduate school now in Chicago, getting an MFA. I have so many experiences to look back on from my time in the Mission. The best ones were from before the tech booms, when there were lots of artists living here who formed all kinds of communities. The more you study art, the more you realize space is so important. Space to make your art, space to show it... and personally I could just not afford the space to be an artist any more in the Mission and do something like go to grad school. It was sad to leave, but as I said before, many of my friends had already left. I'm much happier in Chicago now than I was the last several years I was in SF. It feels like I can build a life here and afford to settle.\n\nI'm glad to hear that people are still finding the Mission a fun place to live and explore. I believe that is built on the legacy of generations of many different ethnicities living there as well as being a haven for artists and alternative culture.  If I were nineteen now and looking for excitement, art, and new and cutting edge ways of thinking and being, I would not move to the Mission as it is. But I can see why a young coder would want to live there.\n\nI don't want to sound like I am faulting the techies for moving in. That's their right, it's a free market system. But I will say that for me, the process of watching my community and life erode in the Mission was really painful, and I wouldn't want to go through it again.", "author": "Dusty R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-02", "description": "Don't believe the Hipster/Trust Fund/Daddy Pays My Rent/Never Worked A Day In My Life But I Think It's Cool To Be A Socialist crowd with their whiny rants about how the \"Real\" Mission has died. Due to an influx of hard-working Tech professionals who actually HAVE JOBS and PAY TAXES The Mission has noticeably improved over the past few years. \n\nStill way too much gang activity, bums and annoying hipsters but not nearly as bad as before. Change is in the air and the \"Old Guard\" of do-nothing \"activists\" are running scared, now they're actually resorting to asinine tactics such as standing in front of Google busses to stop people from going to work. It's downright hilarious and I'm loving every minute of it, you can literally smell the fear emanating from these losers as they stage their pathetic \"protests\", because the reality is they will soon need to crawl back into whatever crack in the woodwork they came from and infect some other unfortunate city.\n\nStay tuned, this neighborhood promises to get better and better.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "I tell myself I would never live here, but I may one day.  It could happen.  And despite this perpetual internal and even sometimes external debate, I keep coming back.\n\nIt's dangerous, it really is.  I'm not saying that to scare anyone away or to do my white-person part in using codewords to describe certain neighborhoods or areas in ways that aren't overtly racist or classist but probably are racist and definitely are classist (codewords like \"good schools,\" \"up-and-coming neighborhood,\" \"revitalized,\" etc.) but because it's a simple fact.  A lot of street crime goes down here, and a lot of random people get hurt or killed because of it.  And I've worked pretty closely on a daily basis with gang members from the Mission, so I know it's even more dangerous than the statistics make it out to be.\n\nBut it's amazing.  The hipsters are bad.  They make it worse.  But it's so big and truly diverse and all encompassing and universalizing and exclusionary and welcoming and everyday and little-old-lady-taking-her-grandson-on-the-bus, how can you not love it?\n\nAnd burritos.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "The Mission neighborhood is unique in that its got groups of different types of people.  There are some people that look shady that may possibly approach you for money, drugs, alcohol, etc. Then there are those that are the hard working business owners or blue collared workers.  There are also the artists and performers.  And these types appear during the day.  The area can be quite lively at night as well with young professionals looking to drink, have a good time, and relax.\n\nTons to see, do and taste here. There are a lot of good restaurants in the area as well. As businesses keep popping up and doing well here, I think the area will be more expensive like the rest of San Francisco. Enjoy it while you can at cheap prices!", "author": "Janet E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "I love this part of SF the most, not because my current Beau lives here, but simply because its eclectic, unique, inspiring, rare, rad, uncommon, sui generis, unusual and most of all just COOL. This area has everything you could possibly need, and never need all while being in SF. \n\nThe restaurants go from your local organic vegan restaurants to the most romantic Italian cafes, to the best dive peruvian taco spot open till 4:30am. Endless eateries if you are a foodie like me. \n\nBeing in SF is all about walking and you can have an entire weeks worth of dates just walking to and fro different places.\n\nThe bar scene is FUN! Not your typical douchey Marina crowd with 40yo Peter Pans trying to pick up on barely 18s. Everyone is genuinely there for a good time and never a problem since I've been making my rounds.  Just to name a few, Mission Bar, Elixir, Uptown, Double Dutch and Elbo room I have definitely frequented and had a pretty good night. \n\nAll in All, this area is a great time for any age, gender, race. MUST check it out and have a gab at a fantastic time. :)", "author": "Hillary H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "Wow, what a gentrification and yuppification has taken place here!  I remember back in the 80s/90s when this was a dangerous place.  Not so any longer.  I took a walk through in early June 2014 on a nice sunny day (it seems it's always sunny in the Mission).  Sure, there's still some rundown areas but overall the Mission has sooooo changed and improved.  True enough, the newbies have taken over and are driving rents up.  This is called capitalism.  They've got the capital; the poor/poorer don't.  While I don't like the complete gentrification that's happened, that's the new reality.  Deal with it.  Lots of shops, restaurants, and taquerias everywhere.  And wow, so many of the Victorian houses have been lovingly restored.  And murals all over the place.  Sure, some are just graffiti.  Most are pretty quality.  The Mission deserves at least a couple hour walk about.  Divert off the main streets to see some of the nicely renovated houses.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "The Mission is definitely my favorite place in all of SF. From the food places to the different bars, there's a million and one things to do in this area. The culture, diversity, and atmosphere are a few of things that make me feel so comfortable and welcomed in this area. There are also a ton of small local businesses that are really great to find unique clothes and gifts. As for the food, I would say the Mission's staple is definitely Mexican and Hispanic food. There are so many delicious taquerias that I haven't even tackled half of them yet. Overall, if you're looking to experience something other than the typical SF tourist hot spots, then definitely take a trip to the Mission.", "author": "Cristal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-14", "description": "The Mission is, in many ways, what L.A.'s Echo Park and Silver Lake wish they could be. Lots of street art, independent businesses, creative foods, light rail stations, and it's embraced as more than just, \"Ew... That's where the hipsters dwell...\"\n\nPaxton Gate is a remarkable store, and it's next door to the first ever 826 shop. \n\nBalmy and Clarion are phenomenal alleys. \n\nBi-Rite and Humphrey Slocombe are noteworthy ice cream parlors. \n\nEvery now and then you might find someone with a blanket of old wares set up on the corner. \n\nIron planter grates are covered with Dia de los Muertos-inspired designs. \n\nExcellent Mexican food can be found on almost any block with tamale ladies and men abound. When Mexico beats the U.S. in a soccer game, it can get LOUD in the Mission. Horns are honking, people are shouting, tourists run scared. \n\nThere are about as many dive bars as there are specialty food shops and stands. \n\nIt's all very diverse and unique and full of possibilities.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Hey man, what did you just scrape off of the bottom of your Converse Chuck Taylor All Stars? \n\nThe Mission. \n\nWhere in this town can a guy get a hot dog from some sketchy looking guy selling food out of the top of the filthiest Coleman cooler I've ever seen from  the side of a mini van parked right on the street?\n\nThe Mission. \n\nI'm in the market for counterfeit or off-brand soccer jerseys - where do I go?\n\nThe Mission. \n\nWhat's that filthy neighborhood that the 14 runs through that reminds me of downtown TJ?\n\nThe Mission.\n\nWhat neighborhood has the best burritos in The City?\n\nThe Mission.\n\nWhere do we always end up after a long night of drinking when we just want the cheapest, stiffest drinks we can find? \n\nThe Mission. \n\nWhere do all roads inevitably lead when I'm in The City?\n\nThe Mission.", "author": "Don B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "I'm giving the four stars to the \"good\" part of the Mission, which are the nicer areas around Valencia and Guerro and not on Mission St. itself.\n\nIf you walk down Mission St from the metro station, then it's mostly crappy clothing stores and vendors selling junk. Very poor and rundown.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "Ironic that I have this account, okay I'm going to be truthful, this place used to be a wonderful place where someone would say good morning to you or good after noon by many positive family orientated individuals.\n\nNow it a vast insignificant dry yuppie community that acts like a gargantuan  college campus where the \"white washed Latin food flows\". There are ugly condos built everywhere now, not much culture no more.\n\nI have a love hate a love hate thing about my neighborhood, so if you do not like this post ,tell me , I do not bite, have a nice day you beautiful people :)", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "The Mission is me. I am the Mission. \n\nThe Mission is where my family lived when they moved here from Mexico in the 70s. \n\nThe stoops of its houses are where my parents met and fell in love.\n\nThe Mission is where I used to ride Muni with my grandmother to the carniceria, amidst the colorful murals of Balmy Street, traveling mariachis, street salesmen with fake gold chains, and numerous money transfer locations and produce shops.\n\nYou can still find all of those things there, but you can also find the uber-hip Humphrey Slocombe on the same block where my abuelita used to live.\n\nNot much has changed yet everything has changed. Some people use the word \"gentrification\". I happen to think it's just another movement - a population shift. It's still a heavily latino area, but there is new life being breathed into streets that my mother would never let me walk alone as a kid. Those same streets are now lined with outdoor tables and young couples sipping red wine on a Tuesday evening. But I still wouldn't walk around in blue or red if I were you.\n\nNow, the Mission is home to all types - whether you've lived here your whole life or are brand new to the city. The Mission represents a cultural melting pot that can be home to anyone looking for a new life, or just a change of scenery.\n\nBecause now, the Mission is everyone :)", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-29", "description": "The only good things about the Mission are the weather and some of the restaurants. \nOther than that, I get constantly sexually harassed by the Mexicans, my car windows get bashed in, I've been chased while out jogging, and I call the cops at least twice a week to come out and curb the prostitutes that clop clop around in their heels and yell under my window at 3am.\nYES, I'm trying to move. An ok neighborhood to visit, but living here is crime ridden, dangerous, and risky.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "HERE IS MY 300TH REVIEW!!!!! Yay me! :)\n\n\nThe Mission (this is mostly for the Valencia Street Corridor which is what most out of towner/non-SF natives consider the Mission... which by the way is wrong... but that is a whole other story) has gone through some changes.  I have known it since the low riders would cruise down Mission Street.  It has gone through an interesting metamorphosis and I have a love hate feeling about that change.  I know that in the name of progress sometimes things must change, but in the name of progress... some will lose.  Those are the people that used to live in the neighborhood that have been displaced due to high rent, etc.  The Valencia corridor has become a hipster hang out and I am guilty of enjoying these places.  I wish the same amount of care was placed on the rest of the district without it losing it's identity. \n\nFood & Drink - My favs in the area are Monk's Kettle, Limon, Locanda, Tokyo Go Go & Luna Park.\n\nNo Frill's Food Joints - Pancho Villa (Damn salsa bar gets me all the time!!!), Sunflower Vietnamese, Truly Mediterranean (Tue & Fri Chicken Shawerma's!).\n\nShopping - Multikulti & Therapy.\n\nCoffee - Four Barrel.\n\nBar Only - Giordano's", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "Every time people josh me for being from Oakland I wanna tell them to hit the Mission.  The Mission has a lot more grit going on in one night than Oakland sees in a month (after the occupiers stopped peeing in Frank Ogawa Plaza and spray painting the shit out of everything  and went back to Menlo Park and Marin, that is).\n\nThere's ALWAYS something happening here.  It's vibrant.  It's alive.  It's always seemed like a cool place to live.  I like to visit and get crocked on Margaritas and take the BART back to Oakland.", "author": "Lempi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "I don't normally review neighborhoods, but since this is the one I live in I'm giving it a go. \n\nFirst, I've lived in the Mission for 10 years.  I've seen it change in a lot of ways.  Almost all for the better.  I find all those complaining about the \"marina-fication, or hipster\" nonsense disingenuous and are probably those who don't live in the hood just looking for a reason to look down their noses like they do at everything.  For the record, the Mission in the last decade has always been a mix ranging from sordid to elite.  There's nothing, not one thing, nada that's new about that.  All the spouting to the contrary is ignorance blaring at the top of its lungs.  \n\nThe Mission has some of the best weather in the city.  We are frequently warm and sunny when the rest of the city is cold and foggy and it's less windy than many neighborhoods. That's reason enough to live here for me.  I'd much rather sweat than shiver. \n\nResidents in our hood are incredibly diverse.  Artists, street people, professionals, scum and the general SF lot mix with great ease which is another reason I like it so much.  The Marina, Pac Heights, NoPa and so many other areas are just sterile, clone filled oases of boredom.  Not here I say.  I've met more interesting people living in the Mission than any other place in my lifetime. \n\nThe walking score in the Mission is off the hook.  You don't need to get on Muni, or in your car to find anything you need.  Restaurants, grocery, bars and shopping in tremendous variety and price-tags are all within just a few blocks.  It's entirely possible to buy $300 jeans at one spot and walk next door to a $1.25 taco.  Try doing that in the Marina or Pac Heights.  \n\nYes, the sidewalks are often dirty and the crowd on the street might be scary to the uninitiated, but in my decade of life in this hood I can say I've never encountered an instance where I felt unsafe or had any trouble of any kind on the streets and my car has never been vandalized.  I can't say the same for some other areas of town.  My car was broken into in Hayes Valley the only two times I was dumb enough to drive and park there.  \n\nI LOVE THE MISSION!  It's entirely too hip, too gritty, too old-school, too historic, too new, too unpretentious, too diverse, too cool and too comprehensive for all the small brains to understand it.  So to all you Mission downers pick it up and go hang in another hood.  Thousands of us love it and always will.", "author": "Russell D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "My neighborhood boys and girls! Growing uo with the baconwrapped hotdogs and singing cooks. Taco in hand I explore these streets! Paletas? Oh yes dont mind if I get 10!", "author": "Leo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "The Mission: If you only focus on the Mission as a place for homeless, or lower class people, or excentric people(which I love by the way), and you find them disgusting, or this place disgusting? Let me tell you one thing... Your privledge is showing, and you are overlooking the true beauty of this street. Nowhere else in the city is so cultured, nowhere else will you find ART sprayed all along its walls, nowhere else will you find its bomb a** food... The Mission may not be rich, and it may not be as safe as other streets, but its people-- oh, its people are amazing! \n\nThe culture, the music, the art, the people, the struggles, is what makes the Mission. Look past everything that makes you feel uncomfortable about this place, and youll see what Im talking about.", "author": "Joey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "\"We were so happy poor but when [you] got rich, that's when our signals got crossed...\"\n\nI'm really sensitive when it comes to my neighborhood. The way I see it, newbies* come here to \"rough it out\" and imitate the life of the poor. Once they find their \"real job,\" they'll be outta here in less time than it takes to spot the nearest crackie. But for me, this is where I grew up. \n\nI have lived in the Mission all 24 years of my life. I went to Flynn Elementary, did grocery shopping at all the produce and meat markets on 24th Street with my mom, satisfied sugar cravings with 25 cent cookies at King's Bakery, etc. \n\nI understand why more and more people appreciate the Mission for what it is NOW, but would these same people have had such an affinity for it 10 years ago? What about 15 years ago? Back then it wasn't safe to be out on 24th or 18th after 4pm because of all the gang violence. Have you ever seen a grown man get pushed out of a bus window? Have you ever seen a kid get gutted in the back of the 14? Has your mom and her fellow shoppers ever been held hostage at a Casa Lucas? Has a random gunman ever showed up to your elementary school and stuck up two of your classmates for no reason? Did your elementary school have gun drills because stray bullets entered from the projects across the street? \n\nI can answer affirmatively to all of the above, as can other people who grew up in the old Mission. It's not that I miss all that ghetto shit, but at the same time I feel like I've lost an old friend. Because of TICs, people I grew up with were forced to relocate at the last minute. Mediocre coffee shops have replaced family-owned businesses that used to do a fine job of repairing your worn shoes or hemming that dress that was a few inches too long. Burritos can cost you up to $9. \n\nYet after all that, I still give my neighborhood four stars cuz you can't take the old Mission outta me (yeah, I still wear a mean mug cuz you had to wear a straight face as you walked past the cholos) and because I still live here.\n\n*Just as a disclaimer, the newbies I'm referring to our well-off people who can easily afford to live elsewhere, yet move into the Mission or the Tenderloin and displace families who struggle to make ends meet.\n\nPS: I don't understand why anyone would give this review Funny votes. I don't see anything funny about gentrification.", "author": "Iris V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "Dear Mission, \n\nI have to say.. after making you my home for the last 2 months, I'm hopelessly devoted to you. \n\nYes I may come home to a bum on the floor next to my apartment gate, tiptoing around him so not to disturb his slumber. I may circle around the hood all night unlucky to find a parking spot without having to get up at 4am just to move it for street cleaning, I may stand next to a guy peeing on the streets while he apologizes politely for his indecency, I may get my car window smashed and gps stolen, pay mass amounts of parking tickets on a monthly basis, yet I still come back for more. \n\nMission, the charms of you far outweigh all the above that I've experienced. What can I say? I'm hooked...\n\n...on a whiff of the freshly baked pizza that is Serrano's \n...on the cappucinos served by Ritual Roasters\n...on the vibe and the crowds of Revolution Cafe\n.. on the dark skinny jeans donned by the hipsters\n.. on the obscure trendiness caught on at  the vintage shops\n.. on the sangrias at Esperpento\n.. on the Francophileness of Garcon\n.. on the chicken tenders at Jay's Steaks\n.. on the free Mission Mini cupcakes offered to me by Valencia Wholefood's staff\n.. on a bite of strawberry cardmom buttered french toast at Foreign Cinema\n\nand that's just the businesses closeby me, don't get me started on the indescribable atmosphere and architecture of this area, which you'll have to experience for yourself walking around... there's truly no place like the Mission. \n\nWelcome. Home.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "My other half and my playground on date nights. \n\nNot a place for snobs and hermits. \n\nBest place for bars, bars (haha!), deli, tapas, burritos, crepe, indian, sushi and dildos. \n\nThere is no in between...love it (that be me), or hate it (that be your problem!).", "author": "Elly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-08", "description": "My prediction in 15 years, that the Mission district will cleanup its current image & convert to shops owned by Chinese.Current Chinatown has grown & taken over North Beach.  It will be another alternative to Chinatown i.e. Richmond,Sunset,San Bruno Ave... Imagine another Chinatown in the  Mission,although the Mission is predominatly latinoes.\n\nI am so amped of the propose change for the better in the future. I can't wait to have \"Chinese BBQ Pork super-burrito!!\"\nHow about a Boba drink on 22nd and Mission? or \nHerbal medicine shop on 16th and Valencia?", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-23", "description": "Who would have known that such a non-descript strip of irregular eclectic shops and eateries have remarkably fused the neighborhood into a district known for the availability of almost anything except for fancy smanshy snobbery??\n\nI adore the Mission.  Where else could one walk from the perfect margarita place to the fantastic La Corneta for one of their true giant and filling burritos made to order.  Or if Mexican food is not on the menu tonight, how about some good steaks at Maverick, where entering this joint takes you away from the southwest tinted streets onto a modern wooden rendition of a ranch.  If steaks are out of the question, walk a bit farther and get some decent sushi.......If you still feel too awake to retire, the number of bars/lounges/clubs are amazing.  Bar crawls would be the best way to drench your experiences here.\n\nNot only are there an abundance of eateries, lots of little shops and corner groceries to stock up on.........especially the fresh watermelon and avocados.\n\nFeel free to roam around for a day here.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-12", "description": "Got off the bus and left ASAP. Dirty, dirty, and a little more dirty. And I even like dirty. It looked like there were some good vintage shops, but it was just too sketchy to hang around in.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-21", "description": "Sometimes you have to wade through slime and shit to find the treasures (think of Indiana Jones).\n\nSuch is the Mission.  The people are the best; who cares about the rest?\n\nDiversity.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "Been here a few times over the years.  During a recent visit I got to see both sides of the Mission's face.  \n\nOh she can be so hot & sexy.  I emerged from the BART station on a sunny Saturday to hear music.  I walked around a square to see all sorts of characters and activity.  I was immediately enamored and home.  I was on my way to El Farolito, so all was good.\n\nBut she has a dark side, too.  I ignorantly made my way to Mission on a dark and gloomy Sunday night at about 11:30pm.  This time I was delivered from the BART station to be fronted by a shady character within seconds.  I didn't engage, and heard some profane utterings float my way in the night.  I was immediately on edge.  I (stupidly) ended up walking some back streets to get to the reggae bar I wanted to go to.  Why do the street lights always never work on these streets?!  \n\nNeedless to say, I had a polar opposite of experiences here, but y'know that's what makes the Mission memorable.  And I'd go back in a heartbeat--even in the dead of a scary eve.", "author": "Corey G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-02", "description": "Carneval was in the Mission this year, and we got the chance to walk through it after brunch at Tartine. The music and festivities were up and going. Tons of samba dancers dressed to flash and bare wander the streets and the smell of cooked food line the streets. \n\nI was too full to grab anything from the stands, but they sure smelled wonderful. Next year, I'll make an effort to try the Brazilian foods served in the stands.\n\nWalking through it, it feels half like a samba party, and half like a swapmeet. Clothes booths and jewelry booths also line the streets along with the food stands. Everything in one shot!", "author": "Debby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "I've learned to love it. I find myself hanging out here more and more now (I live closer now so that's part of the reason). What I admire is the diversity. Some folks hate the  recent re-gentrification that's happening in the neighborhood, but I'm on the fence. I like some of the new spots sprouting on Valencia, but sometimes it feels like the marina is taking over. Anyway, I'm just rambling so I'll stop now, I'm almost sure nobody reads reviews for the mission. Reviews here are more like diaries or op-ed columns.", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "Some of the best dollar stores in the world are in the Mission.\n\nA dollar for laundry detergent, dish soap, mousetraps, and pretty much any other household item I might need? \n\n#^@% yeah!", "author": "Murphy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-04", "description": "Pretty interesting. The best part is the church and the graveyard.", "author": "Lauren E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "It's live, vibrant, obsessed, fun, casual, unpretentious, divey, delicious, consistent, warm, incredible, sunny, colorful, beautifully sketchy, rambunctious...and honestly, the best restaurants, bars and establishments are located in the Mission.\n\nEither you love it or hate it here. In my case, I love it here.\nI visit the Mission moreso than any other burrough/district in SF besides coming to work in the FiDi. \n\nThis is my Spanish Harlem.", "author": "Mika D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-30", "description": "Drug-rattled panhandlers brushing shoulders with peacocking hipsters and artists. If not for a few great shops, a couple of decent restaurants (oh, Tartine!) and movie nights in Dolores Park,\nI would probably give it 1 star, but there's enough to keep me coming back.", "author": "Will W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "This is my hood where I work, grub and commute within these city limits.", "author": "Isis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-17", "description": "The Mission rocks! Where else can you go for cheap but authentic Latin American food on every block. Also, on Valencia Street, there are many interesting spots like the Bombay Ice Cream shop where you can get Saffron ice cream and thread your eyebrows at the same time? Walk up the street to Mitchell's where you can get purple sweet potato ice cream or pistacio ice cream crammed with pistacio nuts.\n\nA block or two from Mitchell's ice cream is Freakin' Good Chicken which serves middle eastern roasted chicken (fire roasted) that comes with hummus, salad, and fresh bread. Baklava for dessert, anyone?\n\nAlso on Valencia is a very little shop that sells essential oils, candles, and anything else you might need as a witch. Also, We Be Sushi has good basic sushi with cheap parking nearby. Herbivore serves tasty vegetarian food and is a great place to catch up with friends. Not to mention the many grocery stores that sell cheap but generally good produce (limes, avocados,etc.). And Lucca's has great italian products-- nice freshly made sausages. The Quan Yin Healing Arts Center offers massages, accupuncture, and much more.\n\nAnother great thing about the Mission is that it is close to everything. On 24th and 16th, there is a bart station that connects you to Powell where the biggest mall in S.F. is. No need to even get out of the bart station, you literally leave bart and walk straight into the mall. All you need is a credit card for a day of shopping. Also, the Mission is just below Noe Valley so when you want a cleaner and more refined environment, walk up the hill or just drive your lazy self there.\n\nThe Mission is the best. It's a cultural center where real living takes place.", "author": "Lorissa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "The Mission was cool before the \"Valencia corridor\" yuppies started moving in. \n\nMission to Portrero gets four stars, Valencia to Dolores gets two; I'll average it out to three.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-26", "description": "The mission now reminds me of what Haight/ Ashbury use to be like in the 1960's. Except the hippies have turned into hipsters. \n\nThere is always something fun to do, no matter what night of the week it is. Seriously even on a Monday night it's raging. There's more bus lines that run through the Mission than anywhere else in the city, and catching a Taxi is always easy. Unless it's Cinco de mayo or Halloween, then forget it. \n\nIt  has some of my favorite restaurants and bars, and they are practically the only place in town that has pawn shops. This comes in handy when one is broke. \n\nIt's always a mixed crowd of people, always keeping you entertained until wee hours in the morning.  \n\nAbove all the Mission has the best burritos in town and the bacon wrapped hot dog guy. I DON'T think you can go wrong!!", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-17", "description": "Goddamn fucking white people.\n\nIf I were a Spanish-speaking neighborhood native I'd have a few bones to pick with the suburban-bred fixie-pedaling asshats (pink wheels??) who sip $10 purple martinis and shell out $1000 for a room on Valencia. Thanks for pricing me and my kids out to the TL or Oakland. \"I eat burritos I'm so urban LOL!\" \"I'm drinking PBR from a bag LOL!\" \"What's the Excelsior is that even in the city LOL!\" \n\nQuestion: is it just nostalgia for your lost teenage years (you know, like a decade ago), or is it \"ironic\" to be a cliched flunkie? Grow up and get a job, you fucking cancers.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "I went brown bagging in the Mission last night & LOVED it!\n\nFor those of you that don't know what that is (like me just 24 hours ago), it means to purchase booze from a liquor store and proceed to drink it from a brown paper bag and just walk around.\nNo cops around to hassle you, just a buncha crackheads, tiny Mexican men and bums. \n\nI gotta say that 'Brown Bagging' was WAY better than a club or some bar. \nI am so happy to know a hardcore \"G\" that knows her way around the Mission. This bitch took me down dark streets and nobody fucked with us. Maybe it was her \"crime scene - do not enter\" scarf or her christmas lit backpack? \nNo one even looked at us sideways for drinking from bags like I anticipated. I did get teased for drinking chardonnay from a bag, but fuck that, I have standards even when I am slumming & I don't do beer.\n\nI've come to realize that 'The Mission' is actually purgatory. It's not quite hell, it sure as fuck ain't heaven, but, it definitely falls somewhere in between.\nI left with a $1 Jesus night light in my pocket, a belly full of burrito & booze, more money left in my pocket than if I had gone to a bar and a head full of crazy sights and memories that I will never ever forget. \n\nWhat a way to start the week and kick off the holiday season.", "author": "T C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-05", "description": "Unlike SOME people who live in the Mission, I was actually RAISED there. I would say born and raised, since I'm a San Francisco native, but my parents lived in the Richmond and Sunset while I was born before moving to the Mission when I was five. So I remember the dangerous days of gang shootings heard from outside to the '89 earthquake and the reaction of my neighborhood... when Cesar Chavez Elementary was called by its REAL name: Hawthorne Elementary (even BEFORE the mural went up.)\n\nI remember it all... before the hipsters came to live and the yuppies came to hang out. A lot of the original locals here moved out when they began tearing down the buildings in exchange for more expensive condos and the suburbanites that moved in.\n\nAt first, I didn't think it was appropriate to say it, but since I'm half white, I think I can say it... and apologize to my mom's side later... the white people moved in and it was an entirely new place. I don't know when it happened. Maybe when I left for college and came back? Not really sure... it went from being afraid to wear red or blue to avoiding the pretentiousness of the hipsters. Sure, it's a less dangerous here, but it lost a lot of its coolness.\n\nIs Capp Street still infested with $5 whores? I'm just wondering. (Updated Note: True story... I was about 12 walking along 21st and South Van Ness after playing some arcade games with some friends when I got propositioned by a prostitute and her pimp. She wasn't that bad looking, compared to some of the nastier prostitutes in the area... but come on! I was fucking 12! What kind of money would a 12 year old have? She must have been REALLY cheap and, sadly, REALLY desperate. I digress.)\n\nAnyways, I have a lot of fond memories here... and a lot of bad ones. There's some good restaurants here and some overrated ones. The streets are dirty but that never bothered me. There's this one homeless guy that I kinda befriended who's probably no longer with us... or he's in another part of the City... I really don't know. And then there's one who's just holding out his hand, doing nothing, hoping for a handout. Lamer. There's some cool shops, and there's some I don't bother with.\n\nFor nostalgic purposes, I can't give the Mission anything less than three stars... but for the gentrification and becoming Marina with Mexican restaurants (ok, that's not totally true.... but it sure feels like it sometimes), I can't give it anything higher than three. That and 16th and Mission. That place is STILL a dump, despite the construction on the outside of the BART stations. I've always been a 24th Street kid, I guess.\n\nOn a positive note, they've got a Good Vibes here... so it can't be THAT bad :)", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-01", "description": "I love the Mission for these main reasons:\n - Political Scene\n - Cultural Scene\n - Volunteer Scene\n - My local POC scene\n - Art scene\n\nI will have to get used to the hipsters. I will learn love, if they will learn political awareness...well I will learn love nonetheless....\nThe restaurants, cafe's, the ice creams are just secondary.\nI now here Mission. Teach me something...", "author": "Jay M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-26", "description": "Hi!  My name is ____________ and I live in the mission.  I get off by talking smack about every other hood in San Francisco and telling people how cool I am because I live here.  If you hadn't noticed, right now it is trendy to appear \"poor\" so I drink PBR even though it tastes like beer flavored water, and we all know it.  I wear ugly clothes that I pay a lot for at Macys and Bloomies, but would never say so...in fact I at all times wear one thing, one thing, from a thrift store so I am not totally lying when people ask me where I got my cute _______ I can tell them from ___________ (trendy thrift store of the week).  Every morning when I leave my house for work or whatever I ignore the smell of piss, death, icky people because my zipcode allows me superiority to people who live in other parts of San Francisco, most of all the Marina.  \n\n***It should be noted...I, the reviewer, do not hate the mission...there are cute parts...just the intollerable snobs who treat me like shit for:\n\n-not living there\n-not gushing over  it\n-living in the Marina \n\nLet it also be said, I probably pay less in rent than you do and I only eat organic food, but I don't sneak in McD's when I think no one is looking.  \n\nHow about them apples?", "author": "Jess S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-28", "description": "I know I'm on the wrong city, but since a whole lot of SF people come to the Sac boards to talk about how Mexican food in the Mission is the second coming, I'd thought I'd pop by here to address all that shit directly. \n\nTaquerias in the Mission now cater to trust-fund kids who grew up eating Baja Fresh in Danville and want a vegan option for everything. Basically, if you could wrap a okra and tofurkey burrito in a Yassir Arafat doo-rag, they'd be on cloud nine. \n\nMeanwhile, $1,500 studios were cramping the style of the locals, so they started heading out to Oakland. As a result, most Mission taquerias are full of dudes sporting the Paul Bunyon look and girls who keep diaries. As mentioned above, buche and cabeza don't come in the Boca variety. Thus, the ever savvy business owner started shitting down the menu like an episode of Oz. Meat got bland, spices got dull, and prices went up, (for more information, see the city of SF as a whole). Places like Pancho Villa, that back in the day used to serve fried blood, have gone the Chipotle route. Yeah, maybe Beck shows up there now and then, but who the fuck cares? Like his music, the food there is a total rimjob. \n\nWhat about Cancun, El Farolito, La Altena, etc? Yeah, them shits is ok. They're about as good as any taco stand in any Central Valley town. Like Stringer Bell once said, those places are like a 40 degree day, no one gives a fuck. \n\nSo, if I'm here talking all this shit, what's Sacramento got that's better? Yeah, like I'd clue anyone in on that. Yuppies already fucked up one town, leave mine alone.", "author": "Stan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-24", "description": "I am done with the Mission. Done.\n\nThere are no restaurants down there I can't live without (hmmm... are there even any I like?  maybe a couple I kinda sorta like).\n\nThe bars I can def live without!  The Mission bars always make me either feel like I am in some midwestern town with late 20s-early 30s people who are trying to prove they are still cool by drinking way too much (and not even good drinks!) or else feel I am surrounded by basically uninteresting, unsophisticated people who put a LOT of effort into cultivating a colorful exterior and making sure you know just exactly how hip they think they are. \n\nI would continue to tolerate the general mediocrity of the mission when my friends who live near there make plans for Mission bars and restaurants if it wasn't for the intense grime.  Even in the best parts, the Mission is seriously dingy,  but after last night's short walk through the filth of Mission I vowed that I am done with the Mission.\n\nWhat a relief it was to get back to the Tenderloin!!!  Sure, there are a few streets in the Tenderloin that smell like urine but walking down Mission one can barely breath.  And there are plenty of street people in the Tenderloin, but they don't have that same \"totally deranged and just surfaced after living in the sewers\" vibe to them at all. \n\nLet's just say I was not at all surprised to read Mary's account of human poo on the sidewalk.", "author": "lisa g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-25", "description": "Yes, the mission smells like piss and is dirty. But the people who are bothered by this have probably never been to a 3rd world country, perhaps never even having ventured outside the US. I'm not a fan of the neighborhood because I would not want to live here. But it's an a-ok neighborhood. Have lived here temporarily with my buddy who lives in the mission because the rent was cheap because his place was in a dirty alley that smelled of piss. A trash bag was ruffling under a car and it ran out into the street. Hmmm...I have never seen a trash bag move in a zig zag formation before..oh....the bag is attached to a rat. \n\nBut the people here are interesting with stories you won't find in suburbia. You have the hipsters who choose to live here as part of their lifestyle and then you have the hard-working immigrants peddling street food who would move out of here if they could.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-02", "description": "I live in the Mission, and it's great.  Gentrification!  What's up, biatches?\n\nDo I have to shoo the occasional bum or druggie out of the nook in front of the garage?  Yes.\n\nDo I occasionally find mystery material on the sidewalk as I go to work?  Yes.\n\nDo I occasionally find not-very-mysterious material on the sidewalk as I go to work?  Yes.\n\nHave I been hit on by a crack whore?  Yes.\n\nDo I live in a 1700+ square foot condo with broad-plank heartwood floors, two fireplaces, a fully updated kitchen and bathroom, coffered ceilings and plaster medallions above every light fixture, less than a 15-minute commute from work, with a huge backyard, for less than $800k?  YES.  Hello, Mission!\n\nBring me more Mission, any time.  Those of you from the Marina who don't like my hood?  No problem.  Stay where you are.  Enjoy the 350 sunless days a year.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "I have had plenty of good experiences in the Mission but this is the story set the tone of my opinion of the Mission:\n\nSo I was walking down Valencia to go meet some friends at the Elbo Room. I was all dressed up since it is right after work and we just happened to have a client meeting.  I thought about going home because I thinking I'm a *bit* dressed up to go to a Mission bar but then I said eff it, I'm going to go rock my overdressed look.  \n\nI walk by this cafe with two guys outside talking and they stop talking and watch me.  I walk past and as I walk past I hear in a degrading low toned voice...\n\n\"Professionals\"\n\nAnd with that I give you the Mission Hipster.\n\nIf the Marina gets 3 stars, so does the Mission. Because it's the same freaking crowd, only with more attitude & less expensive clothing.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-23", "description": "Before moving to the DMV Heights and NOPA Valley area, I used to live in the Mission for years. First on Dolores and 17th, then on 17th and Shotwell, then more in the Potrero Flats area around 21st and Harrison.\n\nThe mix of people that live here is great, and I like my urban grit compared to the more manicured lifestyles of the Marina, Pacific Heights, etc. \n\nVery easy to get to, because of BART, and close to the Castro and Noe Valley, depending on where you live/are.\n\nSome of the yelpy reasons I like the Mission so much: Foreign Cinema, Dosa, 500 Club, El Rio, Therapy, Bombay Ice Creamery, Dolores Park, The Phoenix, Latin American Club, Emmy's Spaghetti Shack, Fabric8, Dog Eared Books, the list goes on.\n\nThrow in the best micro-climate in the city and, aside from the random gunfire, you've got yourself one of the best neighborhoods to live in and/or frequent.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "I'm not sure why everyone has to go hatin' on the Mission. Sure it's got it's problems and what neighborhood doesn't? I live in the Mission and I love it. And no, I don't talk smack about every other neighborhood in SF - I think they (mostly) ALL have great qualities and maybe less than great qualities. \n\nNews flash - there ARE some normal people living here too, that don't fall into the hipster/bohemian/crack smoking homeless categories. We landed in the Mission after moving from San Diego last year, and we wouldn't change a thing. It's got an energy to it I just don't think you find everywhere. \n\nYep, I'm sure in time we'll grow tired of looking at the trash, the in-your-face drugs and the hipsters walking around like they own the fucking neighborhood when they don't even live there. Until then I'm more than happy to call it my home.", "author": "margot b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-12", "description": "Reason #27 why I love 16th and Mission:\r\n\r\nWhere else can you encounter a drunken homeless man at 8:00am that yells at you, \"Damn girl, you've got a sexy walk. I'd like to take a bite outta that!\" ????? \r\n\r\nOk, maybe quite a few places... but this one is 4 blocks from my house. Awesome.\r\n\r\n-1 star because I almost stepped in poo again................\r\n\r\nAn update from 7/31/06: I saw my man again today. Today he called me beautiful and asked where I have been all his life. I didn't have the heart to tell him I pass by him pretty much 5 days a week, but he's always 3/4 of the way through his (3rd?) 40 of Ol' E and just doesn't remember. But he called me beautiful! Made my day.\r\n\r\nUpdate: 8/15/06: Today I paid my man an afternoon visit. I was on my way to get a hair cut at The Salon and he spotted me from across the street. He had the green, so he crossed my way and proceeded to tell me, \"You are a hottie. A HOTTIE!\" I was astonished - He crossed the street to tell me this! What a man!\r\n\r\nUpdate: 9/15/06 I have not seen my boo in a month. A MONTH! What happened? Is he ok? Have I done something to forsake his love? I fear our ship has sailed.......", "author": "Trixie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "Oh, where do I even begin?  I'm connected to this neighborhood in so many ways.  I know it almost as well as I know the Sunset District (the *other* neighborhood I'm connected to in so many ways).\n\nIt all started when I was fresh outta SFSU, landed my first job outta college, and answered a Craiglist ad for a room at 22nd and Florida.  Those were difficult times, yo. Crackheads/heroin addicts doing their \"heating-up-some-rock-in-a-spoon\" thing under my bedroom window.  Being mistaken for a $20 hooker ($20?!  Oh come on! I was coming back from a wedding for chrissakes...I totally looked classy!) while walking from my car to my home at  two in the morning...(I *know*, not the wisest thing to do. Live and learn, okay?).\n\nPeople give the Mission a hard time for being dirty, crackhead-infested and too \"hipster\".  That's fine.  It's all those things and a lot of other stuff they don't see because they make their weekly trek to \"Cassanova\" (or even worse, Skylark or Blondie's) and then think they know the place.\n\nThis neighborhood has a certain energy about it that you can't get anywhere else, and whether you like that energy or not, you gotta give it that.\n\nWhatever. More room for me.\n\n:D", "author": "Karen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-06", "description": "I used to feel like I really missed out not being a poor college student, going to the drunken parties, living on ramen and having all sorts of crazy adventures.\r\n\r\nThen I visited the Mission.", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-30", "description": "Once upon a time, I used to live in a place just like the Mission, only it was the ghetto of Hollywood.  Like the Mission, it had cute shops, great taquerias, and cheap bars. And also like the Mission it was dirty, covered in dog AND human feces, littered with drug dealers and users, and not the safest place for a single gal to be at 1 in the morning.  However, unlike the Mission, none of my friends would dare venture into my neighborhood in Hollywood. \n\nNow don't get me wrong... I go to the Mission to drink, and eat, and shop. I just don't think it's the be-all-end-all of neighborhoods and I certainly don't understand the people who seem to glorify the poverty in the area. Trust me, it's not cool being poor and living in filth.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "Mission rocks... why?\n\nBecause the Haight comprises of only 1 street\nBecause Nob Hill is too hard to climb\nBecause North Beach is too touristy... even on a Tuesday\nBecause Inner Richmond only comes alive 3/7 days a weeks\nBecause ditto for Inner Sunset\nBecause your car will rust in the Presidio\nBecause Excelsior isn't really San Francisco (lets be honest people)\nBecause Soma is, well, Soma\nBecause Russian Hill is too expensive\nBecause the Marina will eventually sink below sea level in the next \"big one\"...\n\nAnyone feels at home in the Mission... Anyone. That's why it's the bestest.\n\n*Disclaimer: no districts were harmed in the making of this review.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "I'm reviewing the other reviewers reviewing my neighborhood. I just gotta say, aw, y'all like it as much as I do. Claro que si!", "author": "James-Jimm P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-03", "description": "My dad, from the Midwest, just took a bus here to go \"sightseeing.\"\n\nI'm just hoping he doesn't get stabbed or pee'd on.\n\nMy bet? He'll call me in 20 minutes at work asking me how the hellllll to get out of there alive.\n\nThat being said, the Mission does have great burritos.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-15", "description": "When we moved here from Oakland it brought new life to our enjoyment of the Bay Area. Great cuisine and culture, and an entire world within walking distance. \n\n2 years later it's wearing on me. I still love the restaurants, walkability, and culture. But I recently got clocked in the face by a crazy guy on a busy corner in broad daylight -- no one helped but the police were quick to respond. My friend's apartment party was randomly shot at (different story than Michael H), and two people were hit -- the police dropped the investigation. Gunshots kill three people around the corner, and the news teams ask \"how could this happen in the Mission?\" when there are people dealing and injecting drugs on the Mission St block, in broad daylight, every day.\n\nThe neighborhood could use more enforcement of the laws, Giuliani style. I'm not advocating depriving anyone of their rights, but enforcing traffic (when did red lights become just suggestions?) and criminal laws would go a long way toward sprucing up the place. The neighborhood and the whole city would benefit from more after school and youth-to-work programs. \n\nFrom burritos to ceviche to rose petal ice cream, Dolores Park to Mission Dolores, Carnivale to the Dyke March, coffee shops to bodegas, I still really like the Mission. I could stand to enjoy living here more, though.", "author": "Ian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-15", "description": "Hate it or love it, this is going to be the last \"real\" neighborhood in San Francisco.    \n\nWalk down Valencia street, you won't find a single chain restaurant.\nLook at Valencia Gardens, its a housing project, yet could pass as a gated community.\nYou got gourmet restaurants (foreign cinema, Tokyo Go Go, Delfina) next to $5 taquerias.\n\nIf SF  is about tolerance and the struggle for change, this is it.  I'm glad its my hood.", "author": "J S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-20", "description": "Why is it OK to poop on the street and not OK to be a white middle class person in the mission?\n\nI dunno - and this isn't a test - it's a fact - I ask it rhetorically every other day - \n\nI live here and I still don't get it - but hey - the sun shines here and the neighbors are nice - just watch out for the random bullets flying by - usually preceded by a lot of noise and someone yelling  something in Spanish about stealing someones whatever.\n\nGo to any of the bodegas and you can get the best tamales (sorry tamale lady) ever - EVER!!! (And I don't even like them....)\n\nHey - if you want it - we've got it - it's like a mini Manhattan (Won't THAT comment piss off every Uber PC Mission-ite who thinks it's the best and only place to live in the world)\n\nDid I mention that in the Mission you can have:\n\nHuman feces on the street  (Free!)\nThe smell of urine on every corner (Replaced daily!)\nFresh fruit for really good prices\nThe best fresh tortillas ever\nSunshine\n\nWhat's not to like?", "author": "Marc G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-27", "description": "Yeah, that's right, people, I DO THINK I'M COOLER THAN YOU BECAUSE I LIVE IN THE MISSION!!!\n\nSo, STFU and DEAL WITH IT ALREADY!!! \n\nuh, just kidding...well, sort of.", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-14", "description": "Who wastes their time writing reviews about The Mish.?\n\nWho wastes their time reading reviews about the Mish.?\n\nOh, that looks interesting over there in the corner, maybe I'll stick it in my eye, then maybe in my mouth, then in my again.", "author": "Adrian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-13", "description": "What is about the Mission that inspires such ardent avowals of hatred, devotion, adoration, and revulsion? \n\nEveryone has valid reactions given background, exposure, etc. but to me? I see the Mission as mostly a vibrant family-oriented Latin community, with hipsters and artists thrown in. Yes, there are also slighty-scary elements too, but in most parts, they are more the exception to the rule than they are the norm.\n\nIs the level of crime and violence in the Mission acceptable? Absolutely not. And you know what? 99.9% of Mission residents would agree. They would love to have a safer home for their children too. \n\nI wonder how some perspectives from the \"Mission is sooooo dirty and filled with scary people!\" camp might change if more time was spent outside of this country or in more communities different than their own. Hell, if I never lived outside of the US or outside of suburb-like places, maybe I'd be thinking the same thing too. \n\nAs for the \"The Mission is full of hipsters\" camp: absolutely true. I like playing Hipster Bingo too, but as with life, there be good hipsters and bad hipsters, and everything in between. Right now, I personally think it's worth the trade-off but obviously levels of tolerance differ. For me, the tipping point might come when the level of hipster ridiculosity balloons to cartoonish proportions (witness: Williamsburg, Brooklyn) . But I don't sense that in the Mission, at least not in its imminent future. \n\nWith one star off for the saddening amount of crime allowed on these streets full of families, please place me firmly in the \"Fan of the Mission\" camp.", "author": "Umami Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "there's no other district in the city like the mission.  you feel the  latino culture, and they still carry on strong with the changes of gentrification and hipsters. \n\ni love this area!  my dad's business was here in my youth, and i roamed the streets of the mission since i was 12.  i work in the mission, and you can't beat the melting pot of ethnicities, and the variety of ages and people who live/work here.\n\nto me, the mission exemplifies what san francisco is all about.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-28", "description": "Yes, outside of the travesty that is Papalote the Mission has authentic Mexican food. I'll give you that much.\n\nBut what's with all the hype about this neighborhood? Sure, the bars *used* to be cheap, and *used* to be hip, but now they're all scenesters and fixie-riding assholes staring daggers at you from under their I-just-spent-45-mintes-trying-to-make-my-hair-look-like-I-just-rolled-out-of-bed hairdoos while drinking their $4 pint of PBR.\n\nNot to mention the super-high rates of crime, profusion of crackheads and professional hobos, and gang violence that this neighborhood draws. Don't let the cop cars that lazily drive by fool you, outside of the Tenderloin this is one of the un-safest places to be in the city.\n\n\nThe Mission is the new Marina.\nThe only difference here is that the douchebags have traded in their white pants and polo shirts for fixed-gear bicycles and skinny jeans.", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-18", "description": "Ground zero of the new bohemia. Well, maybe not new. The Mission is still brimming with litter and full of garbage tornadoes and flying plastic bags and trash tumbleweeds. Why? Why don't people know how to use the trash cans there? Why all this litter? \n\nValencia street is a bit better. Less traffic. Less debris.", "author": "Trixie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-18", "description": "Where's Paul Kersey (Charles Bronson) from Death Wish when you need him?\n\nClean it up.", "author": "martin l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-30", "description": "I used to think the Mission was cool. But it is just too freaking dirty. Sure, there are lots of great bars and shops and restaurants, but seriously too much crime and dirt. Recently a friend got mugged at a washington mutual atm, i saw a woman masturbating on 16th, a homeless person diahrea'd on the steps of a house i was looking out while i was inside, and a hooker tried to get some street people into her \"palace\" as i passed by. I just have heard way too many stories about people getting jumped and shot and robbed in this neighborhood.\n\nNow, I love the mission, don't get me wrong, i just wouldn't want to live there. I prefer a neighborhood I can walk around alone in at night.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "As a New Yorker, the Mission is the one neighborhood that makes me and my dog Milo feel at home.  \n\nThe piss drenched streets, the packed bar beneath my apartment, the cars with their shit bass cranked all the way up, cheap food available until 3am, the particularly nasty-dirty bums, the hipsters, and best of all the cheap dirty apartments.\n\nSame price, three times the space. \n\nI miss BK, i miss the Lower east side and I miss my fellow New Yorkers but the mission has enough attitude to tide me over for a few years.\n\nThis place has character.  Although sometimes I think lusty thoughts about Hayes Valley.. . seriously I must be getting old.", "author": "Krissy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-25", "description": "I loved living in the Mission.  Here in the snow and ice of the Northeast, I miss it even more.\n\nI don't seem like the typical Mission resident.  I have no hipster cred whatsoever; my music taste is plebeian, my hair has never seen a funky cut, and I don't speak a word of Spanish (which I regret, the music and hair not so much.)\n\nBut I loved it.  I loved the sun, my apartment, the sun during BBQs on my roofdeck, the flatness cause I walked everywhere, bars with the touchy porn game, having favorite taquerias for different kinds of burritos, delicious fancy comfort food restaurants, and having enough different ice cream places that one Saturday afternoon we did an \"Ice Cream Crawl.\"\n\nI have a lot of awesome and not awesome Mission stories, and if I ever move back to the Bay Area I would live there again in a heartbeat.", "author": "Adrienne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-14", "description": "Just moved to the neighborhood, previously from SOMA/ South Beach. I love the fact that I can just WALK to cafes, restaurants, sushi bars etc. and of course the Mission Dolores park. Paking is not so much of a nightmare since I don't have to drive much anymore. The S permit does the trick. \n\nThe BIG downside are the bums that seem to hang out in solo or in packs of 2-3 who have this pissy smell about them that's a total horror show.", "author": "Divya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-13", "description": "I love the mission! So warm and sunny..... The atmosphere rocks. Sure its a little dirty, but people are having a good time around here. Some of my mission favorites:\nMission Pie\nRed Cafe \nPops\nLa Corneta\nSt. Francis Cafe\nTo name few.....", "author": "P-nut K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-20", "description": "Getting dropped off at my friend's house while I was in town here, words like 'sketchy' came to mind as I tried to read the graffiti on the 4th floor of a building, and observed the poor bums muddling about at street level. However, we:\n-walked around the area all night\n-ate at a tasty and decently-priced tapas place\n-wandered a couple over-priced boutiques (which ones aren't?)\n-I made friends with her friends\n-had various drinks at various bars\n\nand I did not get a single creepy guy yelling obscenities at me, nor sketchy guys trying to pick me up, and nobody was mugged (except of their sobriety). I guess the exception is that one dude who walked past me when I was standing outside checking my voicemail, but he only mustered a mumbled obscenity.\n\nP.S. Leanne V's post is great, though. I do like your scarf and bike.\n\nP.P.S. The places we drank at were happily void of any pretentious bartenders and bustling but not grossly crowded. I'd probably trade bars in DC for this area any day..but I'd trade bars in DC for a lot of things..", "author": "Yiling W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-23", "description": "The Mission cured a bit of my homesick of Hollywood. That area with a whole bunch of little shops with Spanish on, it looks just like Santa Monica and Vermont.\n\nThe bumpy roads driving is just like in Hollywood too. The dirtiness, yes.\n\nThank you Mission. Please stay this way, so that I can come time to time when I feel homesick.", "author": "Kokoro I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "Great restaurants, great bars, best weather in the city, tons of culture and diversity. The Mission has little gems hidden on every block. And for those of you wimps complaining about crime, the Mission is a million times better than it used to be. The Mission is everything right and wrong, great and shitty about SF. What neighborhood sums up San Francisco? The Mission!  These hipsters really have to leave though! Go back to your homes in West Portal! Get your tight jeans out of here!", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-24", "description": "Ew is the first thing that comes to mind when thinking about the xenophobic people who live in such trashy squalor. 25 years after the Mission set itself up as a \"sanctuary\" for illegal refugees of Reagan's military actions in Central America most of the people still can't or won't speak English and they refuse to integrate or assimilate with the culture of San Francisco - preferring instead to keep this area a somewhat self contained ghetto.\n\nThe area is also home to the hardest of the hardcore loony leftwingers who are just as xenophobic as the Latinos - they'll verbally and physically assault anyone who seems to be a \"yuppie\" and damage cars if they don't like the manufacturer or the gas mileage.\n\nThere are small pockets of artsy, bohemian types and that's really the only reason to brave the pick-pockets, junkies, hookers and thugs.", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-13", "description": "I tried two other neighborhoods before I landed here and I have to say I love it.  Nearly everything I need is within a couple of blocks and there's never really a dull moment.  Sure, its not as shi-shi (how do you spell that anyway?) as Pac Heights, but its not as vanilla either.  Plus, in the Mission, I have BART, which is hand and fist over Muni for getting downtown.  \r\n\r\nViva la Mission!", "author": "Kyla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "There are so many ways to see the Mission.\n\nYes you can look at it as a place that the residents 'pretend to be poor 'and hate all the people who live in the Marina..(who competes about neighborhoods? isn't that a gang thing?)\n\nYou can say that all the \"cheap\" bars aren't cheap anymore.\nYou can say that all the cheap shops have become expensive and trendy. \n\nIts all true pretty much (except for the people are better than in the Marina part).\n\nOR\n\nYou can say that there is still much tradition and many traditional places to shop, and eat. There is no other place in SF (Chinatown aside) that you can get meats & vegetables so cheap. \n\nIf you need a cheap bar in the Mission they are certainly there, and they are not in hiding, they are in plain view. They are just not the trendy places that all the trendy folks go.\n\nI don't so much want to live in the Mission, but I love to shop there and eat there on occasion. I'm really happy its walking distance from where I live because I enjoy what it has to offer.", "author": "Marz W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-13", "description": "\"Oooh in the ghhheeetoooooo... In the ghetto...\" \nYeah there are some interesting places and cheap eats/bars but the mission is just so utterly overrated. It smells like pee, it is dirty, parking sucks and certain hipsters that love to preach \"diversity\" so long as \"diversity\" means that you're just like them or at least they precieve that you're just like them. Yeah. I can't wait to go. \n\nOh and since I know it is coming, while yes, I do like the Marina, no, I don't live there.", "author": "Anita B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-23", "description": "Okay. So I've fought the stereotype for a while but here goes.. I'm a vegan tight pants wearing fixie riding living in the mission hipster. I used to make fun of hipsters, note previous yelp reviews, but the longer I am in the city and the longer I ride my bike here I have begun to notice the change. I spend my off days in Dolores Park soaking up the sun, drinking in dive bars with other like minded folks (although I rarely pay for booze, that's what the flask is for) and thrift shopping to my heart's content. Some girl stopped me inside Buffalo Exchange on Valencia this Sunday and asked to take a picture of me for an online fashion blog. Commented on my Chrome bag and rolled up pant leg and basically made me feel like a complete tool for about 5 seconds before I realized I didn't give a shit. Oh well. I'm a hipster. Sue me. \n\nOh & the Mission is sweet. There is that as well. Although I am over my small ass dinky apartment across from the projects. I need a new home. Can I come sleep in your closet? I'm sure it'll be bigger then my room.", "author": "Lydia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-21", "description": "A liberal beacon in an already liberal city. A cast of characters from the hipsters to the addicts, immigrants to the to the established locals. World class dining next door to world class burritos. Sun when the rest of the city is shrouded in fog. Dolores Park. Dive bars and swanky lounges. An abundance of mass transportation if you ever wanted to leave, but why would you? The Mission features a bit of everything for everyone.\n\nOn this particular day, I'm loving my neighborhood more than ever.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-26", "description": "the mission is cool, best pizza in sf (arinell), best denim store (self edge) in the west coast, decent mexican food, and lots of cool furniture, antique stores, and little boutiques... \n\nI would give it 5 stars, but parking is a bit of a bitch, not as bad as nob hill, but it's a bitch... I parked on Sycamore St and Valencia, at a legal metered parking, came back and some fucker probably drove too close to my car and put some minor damage on my car... the clear bras have to be removed and replaced, and I'm getting a body shop to fucking fix the minor dent and have my fender and bumper repaired and blended it... gotta do it right...\n\nso, FUCK MISSION! I'm giving it 3 stars for now...", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "Love the Mission, \nbut understand that It's not for everyone. \n\nYa gotta be able to laugh about the guy following you with your girl friends hollering at them. It's funny, really. They are too shy to say something real, so they yell knowing you'll walk by. \n\nTake shit load of good restaurants, good parks (watch out for Buena Vista Park little shadier than the rest), dance, art and movie venues with murals bloody everywhere and you got a slice of the Mission.\n\nNever had trouble with gangs and such, and I've been round there for 12 years. Keep your head on swivel, and stay alert and you fine. \n\nNote: Don't really know the 21+ scene, i'll update in a year. \nFood Places Hit up:\n(Balompie, La Mexicana, Metate, Dianta's, Jarritos)", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-23", "description": "before I even moved to SF I always said I'd never end up here.\nThen I moved to SF on McAllister and had my car broken into within one week of my move.\n\n7 months after the move , I decided I had enough of the western addition,didnt want to have roomates anymore,and the crackheads who congregated across the street at the shelter.\n\nI found a studio on dolores between 15th and 16th, and man... I am one of those who is now hooked. The mission has tons of problems. I agree ,there are snobby shitheads in the area.packed bars full of those snobby kids. But with that nonsense,there is more sunshine than not,a beautiful park that I could nap for hours at.wonderful restaurants. cute boutiques.mom and pop grocers that I adore. cute houses. I am now a convert to the mission addiction, I hope to live here for a long time I feel blessed", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-18", "description": "So, I recently moved to the Mission from the Lower Haight and while there are some things I really like about it, I've noticed over time some things that aren't so perfect.  \n\nFirst, the likes - I love it's proximity to Bart, living on 22nd street, Bart is just a stone's throw away making my morning commute MUCH easier.  Bart is NEVER as crowded as MUNI even at rushhour.  The weather - the mission has better weather than anywhere else in the city.  Love all the warmth and the sunshine.  Sometimes I actually start to believe that I truly live in California.   Also, there is no shortage of bars and cheap places to eat - good for anyone on a budget.   Also, the Mission has some of the most beautiful and colorful murals.  Fun just to walk down the streets and check out all the free urban art! \n\nThe Cons - people who live in the Mission seem to think that the sidewalks and the little grassy areas around the trees constitute garbage cans. When I take my puppy out, it's difficult to find any grassy patch for her to go potty that doesn't have broken glass, used condoms, other dogs \"business\", or some other variety of trash in it.  C'mon people - pick up after your pets and hold on to your garbage until you find a garbage can.  There's no shortage of them!  \n\nAlso, all the convience stores around my house close between 8-10, WTF?  In the lower haight, convenience stores were open until midnight at least!  Frustrating to have to scour your neighborhood for an open convenience store at 11PM on Saturday night!   Not to mention for a neighborhood with the best weather in the city, there's a noticable lack of outdoor seating at restaurant and bars.   I would figure that with the nice weather, the Mission could become more like North beach in terms of outdoor seating. \n\nAnd while I've never felt particularly threatened in the Mission, the recent rash of violence, culminating in the deaths of 2 of my best friends' co-workers, has me a little uneasy, to say the least.  \n\nAll in all, the Mission is kinda cool - but I think I'd rather live in Noe Valley...", "author": "Alison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-06", "description": "The best of SF in the Mission\n\nFood: \nBi-Rite Market\nRainbox Grocery\nTartine Bakery\nToo many restaurants to mention \n\nVibe:\nMore bike shops than there are Starbucks\nGalleries\nUrbanly Gentrified\n\nTransport:\nWalk\nBike\nBus\nBart\nTaxi", "author": "Farb N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-13", "description": "What a neighborhood!  Cheap stuff, great second hand clothing, yummy food, warm sunny days, friendly and sometimes colorful people.\n\nThis is the passionate heart of the city with hot flavor and sexy edginess.  Come here to feel alive or when you can't afford, or do not have the time for a vacation in a warm, sunny place where they speak Spanish and have great food and bars and you can buy things for cheap.\n\nTintin and Snowy loves the Mission.  It feels like a good place to have an adventure.", "author": "Tintin and Snowy x."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-10", "description": "Is the Mission really so dirty? I have 28-CLEAN on my speed dial and call almost every day. But is it really so very very dirty? I've lived here a long time and I must be immured to it. PG & E created a little filth zone under the freeway that people felt obliged to contribute to, including a case of petroleum jelly that busted open and DPW apparently never got around to cleaning. It got more and more gruesome and is now a stain that steam cleaning might get out, maybe. BART renovated the plazas at 16th Street and used paving stones so cheap and porous that they were filthy before they were even open to the public, and nothing will get the grime out, ever. I went on BART today thinking about Yelpers going on about how dirty the Mission is. Ever notice how dirty the BART trains are? \n\nThe Mission is filthy come to think of it. And it pisses me off, thanks for reminding me. But have you been to Alioto Park at Capp and 20th? Considering the neighborhood, there's no reason why it should be so nice. But it is nice. Kids play there, crazy people take refuge there, people garden there, cholos smoke pot in there, there's something for everyone. Alioto Park is just one of the 1000 things I love about the Mission. I wouldn't live anywhere else. Unless I were suddenly transformed into a successful artist making all kinds of money, then I would go to Manhattan, where I would pine for the Sunny Mission, and look back fondly at the old familiar filth. You want filth? Try dirty snow.", "author": "kenneth m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "Most exciting place in the city. Best bars, food, parks and weather - not as safe as it is exciting.", "author": "Nisha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Pretty cool place. Very diverse. Has its rough spots. Latino district. Really cool place if you are interested in other cultures or people watching. Some call it rough but its much better than the Tenderloin, Mid Market, SOMA, Hunter Point and Bayview. It is probably one of the most crowded and largest parts of the city. Great Place to check out. Although it can look like a 3rd world country. Very unique place in the Middle of San Francisco. The corner of 20th and Mission is known for fake ID's. I don't know of any other place to get a legitament fake ID, social security, or green card. I highly recommend exploring this part of the city. Although compared to Downtown, Union Square, North Beach, Haight st area, it isn't as fun.", "author": "San F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-04", "description": "I love the Mission. I was born at General Hospital and my father is one of the co-founders of the Mission Cultural Center, so I guess the Mission is mine by association. Or at least that's how I like to think of it.\n\nMy main issue with the Mission is not the crackheads or the homeless or the lack of parking (even though I really hate that) or that it's dirty. In fact, I like that it's dirty. I love the graffiti everywhere. I love the drunk artists in front of La Boheme. I love the seedy taquerias that give my white Marin/Walnut Creek friends food poisoning because they are pussies and their stomachs can't handle the good shit. It's not even the high level of crime, even though that does make me sad. No, none of these things bother me.\n\nIt's the gentrification and the hipsters. Goddamn I hate the hipsters.\n\nSo for all of you who hate on the Mission, think it's a ghetto, cry about the filth, rampant drug use, or sketchy characters, do us all a favor: get the fuck out. Thank you in advance.", "author": "Alexis C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-14", "description": "indeed this is one of the city's prime septic tanks. the bohemian bourgeois melting pot of wannabe hipsters and grimy ones who think they are oh-so in touch with the more significant things in life. first things first: take a damn shower, your BO is insufferable. your bare feet would make a tree sloth cringe. secondly, this is NOT your city, you are only borrowing it and you are effing it up badly. when you are long gone you will not have left your mark here -- only the rantings of your idiotic socialist propaganda will remain.\n\nI grew up in the Sunset and we were terrified of Mission denizens. I told my Lola, \"I met the love of my life, he grew up in the Mission.\" the poor lady nearly fainted, then cried how could I have found a criminal drug addict junkie to love. silly Lola, so stuck in the 1950's. of course nothing bad ever happens in the Sunset . . . she was reassured when she found out the man was raised in St. Paul's parish and he disdained hippies and beatniks. but why does he have that strange way of speaking, that Mission St. vernacular ? San Jose is pronounced sanazay. Monday is mundy, Tuesday is toosdy, and so forth. I said I don't know, could it be Mission District ebonics ?\n\nI wouldn't frequent this crapbank except for Ti Couz on 16th & Valencia and even that's a stretch. I have sadly given up certain parts of my fine city to filthy interlopers, oh woe is me", "author": "Prima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-11", "description": "I moved into the Mission about a year ago and am officially head-over-heels for this neighborhood.  I felt compelled to review it of all the PRIME MINISTERS OF HAITI complaining about the 'hood up on yelp.\n\nThe Mission is an urban gem. Sure, it can be gritty and there are sketchy areas (don't blame the Mission, blame the prison-industrial-complex), but the SF Chronicle dubbed it \"the New Bohemia\" - and it was spot-on.\n\nThe Mission is the sunniest part of San Francisco. Consistently.  It's one of the most diverse districts in this nation.  Moreover, its residents boast unparalleled levels of cultural, artistic and political literacy.  If you hate the Mission, you just don't know it!\n\nHIGHLIGHTS:\n  - public art and murals (see Clarion Alley Mural Project on Flickr for amazing examples)\n- DOLORES EFFING PARK\n- folks of every color, origin, class, and sexual orientation\n - Borderlands, Modern Times Bookstore, Dogeared books (free book readings and events all the time)\n - the Marsh, the Dark Room, ATA, Intersection for the Arts  - all wonderful performance spaces featuring well-known and fringe theater\n- The Victoria Theater and the Roxie Theater, the oldest continuously operating movie theater in San Francisco, for indies, film fests, etc\n- El Rio, Elbo Room, Zeitgeist, the Lexington, Phonebooth, Delirium, Lazlo's, the Latin American Club, Double Dutch, the Make-Out Room, Savannah Jazz Club, Pork Store Cafe, the Lone Palm, the Phoenix, Casanova, and I could list five more pages of sweet bars...\n- Ritual Coffee, Revolution Cafe, Cafe Petra, Samovar Tea Lounge\n- World class dining: Limon, Dosa, Range, Ti Couz, Bissap Baobab, Foreign Cinema, Pork Store Cafe, Picaro, Pakwan, Tokyo a Go Go, Little Star, Luna Park, Bar Tartine, Maverick, and the list goes on and on and on...\n-TWO BART stations - hello, convenience. That means I have a 20 min BART ride even though I work in Oakland.  \n\nI noticed many of the one star reviewers live in the Marina.  Need I say more?", "author": "Sid D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-25", "description": "I don't care what anyone says about parking, hipsters, crack heads, homeless people, high rents, \"sketchiness\" , whatever. I LOVE THE MISSION. It was my home for three years & I love everything about it: all the amazing wonderful food, the 99 cent stores on Mission, the bars, being around a Latino community, the fact that BART was right there, and yes, those annoying hipsters.  And the homeless people? I lived in the Upper Haight for over a year & the street kids on Haight are about 1million times more aggressive than any homeless person ever was in the Mission. Viva La Mision!", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "Well eff the haters. I like the Mission. Sure, there are too many hipsters, but so what? The Mission has a lot more to offer than pretentious residents. Incredible ice cream places, burritorias, thrift stores, cute shops, murals, warm weather, cheap bars and Dolores park. Enjoy it.", "author": "Rennie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-11", "description": "I love the Mission except when I get stared at because people either can't figure out that I'm half Asian, or I look like a throwback from the 80s.", "author": "emi s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-23", "description": "To all the haters out there.....if you don't like the Mission, all the better. This neighborhood started getting too much attention after the dot-com thang. I knew we were in trouble when Prez Clinton and Mick Jagger were seen dining at the (old) Slated Door. Please continue writing bad reviews of the Mission so people don't come here unless they want to be here for the right reasons.\n\nWhat, you ask, are the right reasons, and who do you think you are for being so presumptuous (my spelling sucks) as to declare those reasons? Huh? Well, I am nobody special, but I have lived mostly in the Mission for the past 14 years. That makes me a dinosaur. Here are the reasons I love the mission and I hope these reasons inspire others:\n\nPublic Art: I will never forget strolling down Mission St. at night and happening across and entirely free concert by Rube Wadell. They would play a full set under the awning of Leeds (now Sketchers). On another random day strolling in an alley between 25th and 26th I find a full-on altar, complete with offerings. Walking down my street I discover my neighbors have dragged a bath tub out front of their house covered it with broken tiles and filled it with soil and plants. Some person used to post ceramic tile hearts all over the mission, another ties brightly covered yarn strands all over the abandoned locks and bicylces left on meters and street signs. I have never seen any other place so passionately devoted to public art as this neighborhood. I mean just look at all the murals. That in and of itself justifies having to step in the occasional desposit of doodoo or whatever. Everytime I see that free public art my heart leaps. And.  I get to see it everyday.\n\nReason 2: Diversity. This is the only place in SF I know where you can regularly see old people and children. Nearly every other neighborhood is filled with 20-30 something types who never reproduce and have seemingly not been spawned from anyone from a previous generation. It's like they all sprang from the head of Zeus, or something. No so the Mish. When I walk down the street I see hipsters (whose clothing I appreciate as more public art) gangsters, kids, grandmas, overworked and harried mothers pushing strollers, homeless people, immigrants, basically a fun mix of people people way richer than me and people who make me quietly appreciate that I have as much as I do. I don't know why this makes me happy, but it does, all these years later.\n\nReason 3 : The weather. It's always sunny in the Mission.\n\nReason 4: Buying food in the Mission is ridiculously cheap, especially on 24th st.\n\nHaving said all of this, I am ready to leave here in 2 years or so. My son will become a teen soon and while I feel very safe here, I don't consider it a safe place for a teen to live based what I've been told by friends who grew up here. But this will always be my favorite neighborhood in the world and I am confident that when my sons are grown and gone I will return.", "author": "ellen c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-08", "description": "Poverty and misery are so f*^%king hip. Lived here from age 17 (1987) to age 31 (2001). The mission is so last decade. You think it's dirty now? Shoulda walked down 16th from Dolores to Mission in 1990. No trendy cafes/restaurants to show off your tired old skinny jeans and retro 70's outfits. But kids will be kids and they (me included ) always think they are the original hipsters, discovering things already discovered in music, fashion, sex, lifestyle, etc. \nThe Mission is the Mission. It is a neighborhood like any other but with more tragedy. It's not a sideshow on Saturday night. \"Hey check out that crack ho passed out on that Prius on Capp St. Really, what's wrong with some of you people. You are no more hip than the rest of us were. Now we look back at how really lame we were. And you will too.", "author": "j s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-29", "description": "My new home!  It's warmer and sunnier than the rest of the city.  It's flatter and easier to bike and skate around than the rest of the city.  It has more burrito joints and cheap eats and bars and hotties and sun (did I mention that already?) than the rest of the city.", "author": "matt c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-22", "description": "I could forgive this neighborhood for being really, really grimy if it had a lot to offer. Too bad it's really, really, REALLY grimy (and doesn't have nearly as much to offer as its high-rent-paying inhabitants would like to think).", "author": "S R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-12", "description": "I'm sorry, but I am going to have to give the mission a less than favorable review.  It should be noted that this review of the mission views the district strictly in terms of a place to party...not a place to live.  My sister used to live in Bernal Heights and we would hang out in the mission a lot...that was cool.\n\nAs far as a place to go out though, I have always been dissappointed.  Every bar is tiny and dive-y, and I know that some people like that, but I find it boring and claustraphobic.  The only bar I have truly enjoyed in the mission is El Rio...but it is only fun if you go with a group of friends.\n\nI tried to like the mission, but I can't.  So, sorry.", "author": "Jessi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-11", "description": "for the thrid time this year, I tried having dinner, then drinks at a couple of the establishments in the Mission District.  I have heard \"yuppies\" are starting to move in, so I thought I would give this district the benefit of my doubts.  Well, I am still doubtful!  \n\nIn general, ths Mission is a complete ghetto.  The restaurants I ate at, the bars/clubs that I drank at and the stores that I shopped at - are all, for the most part, ghetto too.  The smell of greasy food, dried up piss and smelly, hot feet was too much to bare as well.  \n\nNever going back to this district.  No fun and incredibly over-rated.", "author": "James B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-09", "description": "I do value a lot of wonderful things about the Mission.  There are some wonderful hangouts and some awesome people there.  However, I have had my empty car broken into twice now.  I had it parked on busy streets and I am quite sure someone saw it and did nothing about it.  If you go to the Mission, don't drive!", "author": "Mary Kate M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-15", "description": "i'm so over the mission distirct!  you hipsters can have it, it's dirty, smelly, druggie, and bummy.  FYI- i use to hang out in the mission back in 92-96 before it got gentrified, so no, i'm not marina either.  2 stars are for the taqueria's, other than that, it's all yours you damn hipsters!", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-04", "description": "A lot of the negative reviews are clearly referring to the area around the 16th BART station which is ONE SMALL PART of the Mission and yeah, it is a little rough . . . I'll never argue with that.  If you're writing a review based on running around on 16th street, or immediately surrounding blocks on Valencia/Mission  . . . I'll let you in on a little secret . . .alot of the residents avoid that area particularly from Thurs-Sat 1) because of you 2) because we're not fools and KNOW its rough.   If you lived in that area and dig it you are a more patient person than I, no judgment intended, its just not for me. IF however, your are judging an ENTIRE diverse neighborhood based on what is arguably its least attractive attribute . . . I am judging you. \n\nI live in the mission because of its COMMUNITY. Where else can you find day laborers, progressive yuppies with incredibly well-dressed babies, hipsters, young, old  and  immigrant families (mostly latino/a) that have been here and built a culture here for at least two generations? Answer . . . Brooklyn or Queens, NY and maybe somewhere in LA but really, if you're in SF you don't want to live in LA and the weather here will ruin you for BK. \n\nAs for the Mission/Marina ridiculousness. Many in the Mission (myself included) have been guilty of using \"The Marina\" as short hand for the kind of person who does not value a diverse community (and yes, where there is diversity life is a little more complex) or an independent spirit.  Most of us know better and let's not kid ourselves, I have seen many MANY a group of ethnically/racially uniform Mission residents running around in nearly identical \"hipster chic\" outfits.  Similarly,  I've heard Marina residents use the Mission as short hand for aloof, inauthentic scensters or alternatively some sort of crime-ridden den of filth. Well kids, I've been out around up there and guess what, the population of aloof, inauthentic scenesters is pretty darn high.  And yeah, it can be dirtier here, but don't hate, just get on case of SFPD or Sanitation to care as much about this neighborhood as it does about yours.  \n\nSo I'm not in the STAY OUT camp . . . I love it when people come and check the great parts of where I live (well, until I can't get a table . . . and then I get a little grumbly, but I generally get over it).", "author": "Jen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-04", "description": "3 stars because of some moustached men hollering at me in the street like it was south america! oh right...it is the mission after all...but still....!!!! gimme a break! almost got spat on too - just normal throat clearing by a man next to me, but his spit flew past me (thank fully) and landed on the pavement near my shoe and i could see the bubbles popping and bits in it! Yuck!!!\n\nBUT the burrito I had was amazing. It was a 'baby burrito' but was still massive, and the massive bag of tortilla chips with it was a nice little surprise.\n\nSo, eat there, but watch out for flying spit and sleazy men with moustaches!", "author": "Josephine N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-06", "description": "To simply write The Mission off as a vile cesspit of filth & depravity (which is true in many ways) would be, I think, oversimplifying matters.  But to say that it is grossly overrated would be fairly accurate.  I have very mixed feelings about The Mission, to be sure, and I will do my best to articulate them here.  Let me begin by clarifying that I am not a Mission Hater.  To the contrary, my arrival in San Francisco was THROUGH The Mission, and I, too, once believed it to be the center of the known universe (I have since come to my senses, however).  So, where to begin?  How about that cesspit factor?  It is fairly strong.  Mission STREET is about as disgusting as you can get, complete with crackheads, heroin addicts, drug dealers, prostitutes, gang bangers, mentally ill people, and a constant, lingering stench of alcohol & urine.  It is rivaled in its repugnance only by The Tenderloin, the only neighborhood in San Francisco which manages to be WORSE (hard to imagine, but true).  People speak of gentrification as if it's a dirty word, but in the case of the Mission, it is a much-needed force, because much of it is absolutely disgusting.  There are great restaurants & bars on & around Mission St, yes, but the fact that you have to fight your way THROUGH, and step OVER the above-mentioned degenerates is a real downer.  As one makes their way West, over to Valencia & Guerrero Streets, however, things change quite a bit.  Valencia St, in contrast to Mission St, is much more habitable, with lots of bars, restaurants & cafes to choose from (there's still quite a bit of sketch up at 16th, though).  The negative, once one arrives at Valencia St, however, is The Hipster Factor.  Make no mistake that once you get there, you are in the stronghold of the Hipster Movement in San Francisco, and I find it every bit as nauseating as The Marina.  I can't even bring myself to ENTER such establishments as Ritual Coffee Roasters, despite the indisputable quality of their product.  The scene there is just too much to bear (see my review of Ritual Coffee Roasters for the full story).  Still, there are some gems: Amnesia (one of my favorite bars), Range (always quality), Tartine, Delfina, Little Star, Ti Couz...  These places are all great.  But the overall grit of The Mission, combined with the tragic Hipster vibe can sometimes be a bit overwhelming.  I must also speak of this sort of chip that many Missionites have on their shoulder, that makes them believe that The Mission is just inherently superior to all other neighborhoods in San Francisco.  I remain unconvinced of this argument.  San Francisco is full of cool, vibrant neighborhoods, each with something to offer.  And The Mission gets far too much credit, in my opinion.  The Mission is good IN DOSES, but I wouldn't want to live there.  You owe it to yourself to familiarize yourself with some of San Francisco's other neighborhoods, as they have great things to offer, and are often overlooked in favor of The Mission's cooler image.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-14", "description": "There are some places in the Mission that smell so disgusting that you just want to throw the F up.  But I love it.  I love the nitty gritty atmosphere, the excitement, the authentic Mexican food, and the hip bike scene up the block on Valencia.  I appreciate the Mission's genuine nature and the people that make it what it is.  It's really different than anywhere else in the city.  Plus, it's sunny all the time here.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-23", "description": "To \"Ben P.\" You are exactly what's wrong, though not entirely, with the Mission. Diversity is great, (Love that about the Mission) Gentrification is NOT. I grew up in this 'hood and has watched its change. And though I no longer live in the area, I still find myself here from time to time.", "author": "Sheba B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "The mission is okay . There's lots of restuarants . There's a dirt cheap place that does good eyebrow waxes . There's a boutique that sells cute , sexy lingerie .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-23", "description": "the mission is the best neighborhood in san francisco in my opinion...\nfirst of all, the microclimate in the mission is the best in the whole city.\nthat said, other pros include the convenience of living there.  lots of restaurants, bars, and interesting shops that are easily accessible by foot or by a short bus ride, if you want to go a little farther, there are two bart stations in the mission too.  the diversity is great too, and it's just a lively neighborhood to be in.\n\nbeing in the city of san francisco, one will always have to deal with the few cons of the areas as well... like if you have a car, you'll have a difficult trying to find parking anywhere, then there's quite a number of homeless bums who live in the neighborhood, which creates stinky sidewalks and alot of garbage on the streets...\n\nthe years i spent living in the mission were awesomepossum.  i lived in a cute and clean studio on mission and 26th.  never once did i encounter any problems, day or night and i never felt unsafe.\n\nif i ever move back into the city of san francisco, i want to buy a house in the mission...", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "For a well thought out walking tour of Mission district with google map, check out:\n\nhttp://locomotoring.net/2008/12/29/three-hours-at-mission-district-of-san-francisco/\n\nThis trip has it all - the murals, the mission and the mexican food. M&M&M eh!", "author": "Mishti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-01", "description": "If you like the Sunset then you'll hate the Mission.  There is nothing to be afriad of in the Mission, just don't be out at night 2 in the morning.  I grew up in the Mission, I spend my teenage yr there.  I remember being 16 and go anywhere that I like, live on SHortwell and 15th near Rainbow, awlsome grocery store.  I have never run into any problems, never been shot at, except maybe tripping over some drunk lying on  the ground.  I must agree that it is dirty so don't wear your nice shoes.  The rent had gone up too high forcing all the artist out.   I like the shops, food, the colors, the friendly people.  I go back once a month. Who said life is squeeky clean? Do you want boring or clean? Your choice.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "An interesting place for food, drink,  streetart and home to one of my favorite record shops, Aquarius Records.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-04", "description": "I used to live right on the border of Castro and Mission, but it's been awhile since I have actually walked around the neighborhood.  As part of our weekly walking trip we decided to take a walk from our house to the butcher shop on Mission between 22nd and 23rd.  I really enjoyed our time there!  I don't think it's a place to just wander, but if you set a goal like we did, it's an experience.  Also, if you are there, check out the produce markets.  While they don't have everything what you can get is great quality and really cheap.  With today's prices,  think we may be going to the Mission a lot more than before!", "author": "Sean O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-04", "description": "The hipster, cooler-than-thou ideals of most of the residents can get hard to stomach after a while..but there are still some really amazing people, places, and things in the multi cultural, predominately latinoo neighberhoood...It reminds me of parts of queens back in new york and for that alone it warrants four stars...", "author": "Francis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-27", "description": "It's cheap, pretty good food, a lot of nice cheap thrif stores that aren't pretencious. It may feel a little dirty, feel like you're not in America sometimes, but it's very sunny compared to other parts of the city, and it's  flat, so no walking up major hills. I'd love to live there one day.", "author": "Adrian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-26", "description": "I really don't understand the bitter freaks who give a one or two star review to the mission. (please leave and never return, thanks for stopping by)  I will say that parts of the mission aren't safe at night.  But other than that why do you bitch????? The mission has fantastic weather (at least by sf standards) and produce and meat markets,although i don't cook i think its so charming these types of busineses survive in the mission, most of these types of stores closed decades ago in other neighborhoods.  For the most part the mission hasn't been ruined by chain stores and new condo projects and has changed very little over the years. The mission has almost no tourists and great  mix people.  Although i will say it can be bit uberhipsterfied.", "author": "Jimmy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "First I want to point out to previous reviewers that Duboce Park and Buena Vista park aren't in the mission.  They're nice parks, but different neighborhoods.\n\nAnyways, I was born in SF, and raised in SF, in Noe Valley, and I'm still living here (was born in the Mission in fact, at St. Luke's).   Went to school in the Mission, my best friend lived there (and still does), and I spent--and still spend--plenty of time chilling there.  There is crime, gang violence, grit, but damn what a neighborhood.  I feel more at home in the Mission than almost anywhere in the city, except for maybe the block I grew up on.  It's changing though, and just about everything from Valencia Westwards is basically Mission District lite.  Less and less working class people and immigrants, and more and more upper class white yuppies, hipsters, etc, etc.  I remember when there were crackheads and shootings in Dolores Park.  The police would ride dirtbikes through it, and up and down the steps.  The pedestrian bridge used to be a drug-dealing hotspot that my mom would warn me about.  I also remember when homies would have parades of Lowriders rolling around at random times, and I remember when the burritos at La Taqueria were actually 3 bucks, and Valencia was still a little bit cutty.  For all the change though, I still love it, and in some ways I'll admit, I love it more.  From 24th street and Valencia to Potrero.  Harrison Street, Bryant Street, the old warehouses and factories by the central freeway (wandering around the area as a kid, finding all sorts of interesting...and grimy, disgusting shit).  South Van Ness and Folsom, Back down to Cesar Chavez, and up along Mission, all the way to from the Daly City to the Embarcadero.  You can take Mission Street out of the Mission, but you can't take the Mission out of Mission Street (alright, maybe you can...Downtown, starting at about 5th Eastwards).     \n\nFOOD:\n\nLa Taqueria, 25th and Mission\nLa Corneta, 24th and Mission\nTaqueria San Jose, Mission between 24th and 25th\nTaqueria San Vicente, 25th and Mission\nEl Farolito, 24th and Mission\nPancho Villa, 16th between Mission and Valencia\nMi Tierra, South Van Ness and 14th\nMi Lindo Yucatan, Valencia and 15th\nLa Palma, 24th and Florida\nLa Victoria, 24th and Alabama\nDianda's, 25th and Mission\nTartine, 18th and Guerrero\nPork Store Cafe, 16th and Valencia\nBombay Ice Cream, Valencia between 16th and 17th\nBi Rite Ice Cream and Market, 18th between Dolores and Guerrero\nFritz or frjtz or however the hell you spell it, just down from Bombay\nTaco Bell on Valencia and Hill (RIP)\nTaco Bell at Valencia and Mission (RIP)\nPapolote, 24th and Valencia\nBig Mouth Burgers, 24th and Valencia\nPopeye's, Mission and 22nd\n\nThose last three have special meaning for me from my middle school days.  I was at both Big Mouth and Papalote on their grand openings, and me and my friends became cool with the owners, and we would get free food all the time.  Sadly, I don't think that would work anymore.  As for Popeye's there's something alluring to a 12 year-old about eating at a fast food chicken place (that's better than KFC) where 5 people were shot the day before. \n\n\nOther stuff...You have pawn shops, 99 cent stores, latin music stores and drug stores, hundreds of corner stores, mexican and asian markets, bookstores, coffeeshops, boutiques sprouting on Valencia, autobody shops, funeral homes,  the only gun store in the City, an open air drug market anywhere east of Valencia and north of Cesar Chavez...\n\nGetting Drunk:\n\nThe Dovre\nZeitgeist\nClooney's (the epitome of a dive bar.  The first time i went there, there was a fight within two minutes literally, between a tall skinny white dude, and a chubby, shirtless, tattooed-up homie...it seemed to have started over a pool game.  The bartender lady knew them both by name and yelled at them to leave before she called the cops...and they hung their heads and obliged, as if she were their mother, heh.  I also have fond memories of watching the old drunks stagger out of the place at 11 in the morning, as a kid)\n\nGetting Drunk.  Not bars:\n\nDolores Park\nPoplar Alley\nHouse Parties on 24th and Florida\nSecret spot at St. Luke's Hospital.  Even better on the 4th of July.  \n\nGenerally: stay west of Valencia, and you can play it safe, but still be there and experience many great things.  Go east and you'll find it cheaper and more diverse, as well as dirtier, more hectic and at times dangerous.  Also those who have mentioned the filthy breed of bum that resides in the Mission, you are correct.  They must have spawned in hell and then climbed out through the shower drain in some boarded up crackhouse on Shotwell street.", "author": "c b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-07", "description": "ahhhh hipsters.  thank god you can't find any north of geary.", "author": "Kim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-28", "description": "gawwwwddddd get over the hatred - move!  don't hang out here!  spew your venom elsewhere.  please.  i beg of you.  nay, i beseech.\n\ni love it here.  i'd wanted to live here for the 11 years i've been in SF.  before i did, i hung out here a lot. A LOT.   i'm 45.  i'm not trendy or a wannabe, but i do wear a lot of black.  so what?   i will wear something from a thriftstore if i find something i like, or something from a boutique, ditto.  those who complain about expensive clothes in the mission aren't shopping on MISSION ST.  you're shopping on Valencia.  that's your fault, not the Mission's.  Get off the Mission's back.  Mission Street is cheap.  Mission Street is still old school (yes, i know there's Foreign Cinema - which i love - but it's still good.)  and who said there are no good places to eat???  Jeez, just off the top of my head - La Taqueria, El Buen Sabor (and about 50 or so other taquerias ranging from mmmm to ehh), El Perol, Sunflower, Garcon, Dosa, Andalu, Boogaloo's, Velvet Cantina, Range, Bar Tartine, Pakwan, Ti Couz, We Be Sushi, Delfina, Platanos, a myriad of pizza places, cafes, tapas, cheap chinese, italian, mediterranean, bakeries, donut shops, burgers, an argentinian empanada place  . . . what are you looking for, the next truffle-infused grub bar?\n\nMy favorite thing is walking up Mission on a weekend afternoon, watching all the families with their kids in their Sunday best, doing their shopping, coming back from church, eating fresh fruit on a stick, a bacon-wrapped hot dog, or a sweetened yucca/cheese fritter from the various food carts, speaking Spanish, being all lateeno and shit.  \n\nas for bars, well, yes, they can be annoyingly full of young, so-called hipsters.  but just take a short walk over to Dovre on 26th.  on second thought, don't.  \n\nThe Mission is lively!  it's sunny!  most people i see look happy to be there!  Don't be a sourpuss! quit your grousing!\n\nYes it's dirty, yes, there are crack hos, shootings, and the occasional human feces sighting (huh-if that's what's bugging you, don't even THINK about living in downtown Oakland.)  But where do you think you can live in a city without any of that?  THE MARINA???  \n\nSO GO.  \nGO AHEAD, MUFFY.  \nThe Mission won't miss you.", "author": "maria a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-01", "description": "ok i =ve been reading some of the reviews of my neighborhood and now its time for me to say something ok so here it goes in my eyes a person who was raised in the mission is that all i here is about one part specific part of the mssion and that would be where the mission meets duboce square basically anything below 19th. i can that yes that area isnt the nicest full of bums and and ex fellons who couldnt find a place in the TENDERLOIN but besides that the mission is greAt place to live if you dont like it leave its that simple apparently ppl think that this area is super bad and you cant walk through it and to me that sounds wrong. Like every neighborhood except the ones that cost 3k to live in has its good parts and its bad. i think ppl just need to open there eyes and realize that the mission is just full of families that want a safe place for their kids to live in too and that its not as seedy as it sounds why dont you guys try to explose the neighborhood more i invite you to come hang out with us natives for dia tde los muertos (day of the dead for all you guys that havent learned a lil spanish yet) on Nov 1st at garfield park you guys might learn something.", "author": "Jared V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-08", "description": "Ok so it's a bit rough around the edges but there's a bit of the bad in every neighborhood. The bars are fun and laid back with the OC pretentiousness of the Marina. The restaurants are like little gems of goodness scattered randomly in the Mission. Check it out!! I swear you'll find something new every time.", "author": "Lina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-23", "description": "Theres enough fun bars and places to eat here, that you kinda forget about all the vagrants shuffling around.", "author": "Brendan M."}
