{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-06", "description": "The Roastery has really great coffee! We came in on a whim and got two (regular) iced lattes, although we were tempted by the Vietnamese and Horchata versions. \n\nThe coffee was delicious, and they also have an expansive food menu and fresh baked pastries available. Prices are on-par with chains and SF in general. Will be back!", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "Waited 20 minutes for a bagel and a cappuccino. One very nice person behind the counter by herself. Bagel came out and got cold while my drink was being made. \n\nOwners: how do you run a business like this?", "author": "Jason P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-06", "description": "The new owners have gotten rid of the amazing sausage and bacon breakfast burritos!!! Are you kidding me??? Every single person in my office loves this thing, our CEO even included how good it was during a speech to the company. I have some coworkers that have even gone back for a second one because it is so good! PLEASE BRING IT BACK. I know it takes a long time to make but you are losing customers by removing it from the menu. I'm sure there's some way to speed up the process. I will change my review to five stars once the breakfast burrito is back. \n\nAlso, this is just a review about the breakfast burrito. I have gotten nothing but great customer service every time I come. The girl with the glasses that always works in the morning is so freakin nice and sweet, she deserves five stars and a raise. \n\nPlease bring back the breakfast burrito, my whole office will be back once you do!", "author": "Kerriann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-01", "description": "Had a chicken and pesto crepe here from meal pal, and they ended up making it fresh when we came, wish was awesome (the place is called 6 degrees for some reason on Meal Pal, but the address took us here).\n\nThe crepe was decent, it was soft with decent amounts of crispy, but could have been a bit crispier. The pesto sauce was delicious and the chicken was decent. The crepe was also served with a salad which wasn;t bad as well.\n\nThe drawback was that the crepe wasn't anything that really stood out, it was just a good enough meal that just happened to be well priced with Meal Pal, but I wouldn't pay $8+ for it.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-31", "description": "DO NOT GET THE HORCHATA COLD BREW. It has some weird slime in it and does not taste remotely like horchata. More like day old coffee that they chilled with tapioca syrup and sweetened condensed milk that created a thick oily texture all for $5. To top it off the blonde girl who works there keeps calling me sir and clearly hates being there. Such a weird experience...  \n\nI've had some pastries here before that were ok and the sandwiches are good. Just... wtf.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "This is a great breakfast spot if you have some time to spare in the morning. I work just a short walk away, so it's a convenient drop in for me. I usually get their breakfast sandwich with sausage, egg, cheese, and spinach. It's a pretty heavy meal for me in the morning, so I'm usually stuffed to the brim afterwards. Well worth it? YES!\n\nThere's wifi, coffee, tea, and a wide variety of meals: salads, sandwiches, breakfast, and crepes. I highly recommend if you're looking for a local business to perch and do some work.\n\nTip: Only come here if you have the time. There's usually on one or two people working in the morning, so the wait time for a sandwich is pretty lengthy.", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "My boyfriend literally lives right next to this cute cafe and it has been my go to for breakfast and coffee! It's a cute little coffee shop that sells pastries, crepes, sandwiches, salads, drinks and snacks. \n\nI always get their ice coffee here cause they are super fast and coffee here is pretty decent. I tried their crepes, and it is delicious. They have breakfast crepes, savory and sweet. You can also create your own crepe by choosing 3 items. I made my own crepe with ham, cheese and avocado. It came with a side of a delicious and refreshing salad. I was very satisfied. \n\nI will continue coming back here! Quick, easy and delicious!", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-06", "description": "I am really really sad to say that apparently this has new owners, who have done away with the things that made the place different. This used to be my go-to spot in the morning for meeting people, and they had the amazing pastries from Dianda's bakery -- hands-down the best turnovers, apricot flats, raspberry rings. They also had good breakfast sandwiches. Now they have the same boring scones and bad bagels as everyplace else nearby so there's no reason to go here anymore. It's still roomy, and the coffee (iced mocha is my go-to drink) is good, but with the competition nearby, they have completely eliminated everything that made this place special. Really unfortunate, but it's not too late to undo the damage! Please restore the greatness?", "author": "Mason J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "Boyfriend and I slightly disagree on this review. I think The Roastery is okay and Boyfriend wants to burn them down. Here's why:\n\nHe ordered a Reuben Sandwich on rye. When we think Reuben, we think corned beef, melted cheese, toasted, and whatnot. Unfortunately, he received a few thin slices of corned beef, unmelted cheese, and white bread, not toasted. Needless to say, he was beyond disappointed. Then, there was a poor excuse of a side salad. I think his assessment is fair. But I had a different experience.\n\nThe Roastery has a variety of lovely bagels and crepes. Decently-priced for this area, I'd say. A few months back, I tried the Lox Crepe from my friend and I think it was okay. It's not on the Menu, but the lady said we can mix-and-match basically. Whatever you see on the Bagels section, you can request it as a crepe since they have the ingredients.\n\nRecently, I ordered the Nutella Crepe and it was STUFFED with Nutella that it was oozing out of the sides wherever I cut it! The crepe itself wasn't bad either. Maybe not crunchy, but not too chewy either. I'd be down to go back and try some more of their crepes.\n\nThey also have Breakfast Burritos, but I'm preeeeetty sure they're not self-made.\n\nSo, I'd stay away from the sandwiches, but have at their bagels and crepes!", "author": "Athena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "I popped in here for a coffee and a quick bite before heading into the office while on a business trip and was pleasantly surprised with everything that I had! I ordered their veggie bagel with their recommended iced vanilla latte {nonfat}.  I LOVED the veggie bagel {toasted and packed with cream cheese, avocado, tomatoes, and cucumbers} but the latte was a little on the sweet side for me! I'm super sensitive to sweet things though, so this isn't saying much! If I lived in the city and regularly worked out of the office, I would absolutely come here for my morning fix frequently. The owner was there and extremely friendly + helped me decide what to order. Thanks for the great service + eats, The Roastery! I'll see you on my next trip, i'm sure!", "author": "Hailey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Love this little quiet coffee place everyone e is just nice and sweet.  Vietnamese coffee is wonderful and perfect atmosphere for a meeting or just to work in peace.", "author": "Veroinca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Nothing special, and everything is average. Thier WiFi is good to use a laptop. I like to eat thier crepe. It's yummy and has volume.", "author": "Yumiko H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "I think they have new owners that cleaned up the place. Like the friendly staff, and that its so close to my preferred parking spot :) Their vanilla latte definitely is much better than peets.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Great place to grab a quick latte or cup of coffee and read or work. Tons of seating, free WiFi, and loads of plugs! \n\nThe kind of place you could easily hole up for hours and focus and work. Prices are reasonable and the coffee is good", "author": "Liina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "I like this weird funky little place. Definitely the art school student hang out, but what I love best here is the staff and food. \n\nTheir food is really, really solid. Homemade pastries, great breakfast burrito and very good ham and cheese croissant. The breakfast burrito is awesomely Americanized in my opinion with what I think is a Slice of American cheese nicely melted, I go veggie cuz it comes with a healthy portion of avocado and also it has perfect hash browns in it! For $6 or so it's a steal these days in sf. The owners are Eastern European I believe and so they also get all this awesome European candy like kinder and nestle chocolates we don't get here in the US. Lunch time is a good time to swing by as well, I'm a fan of their sandwiches especially The Curry, chipotle chicken, and BLT.\n\nSometimes it's a little slow to get your food but they make everything fresh and there is a ton of seating and comfy chairs and couches. The coffee is average, but it's cheap. I'm sure the espresso drinks are solid but I'm not really a latte or cappuccino guy so can't comment but I see a lot of those ordered!", "author": "Nate E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-26", "description": "This place has been going downhill in the past few months. It seems they have had several staff changes who are struggling to prepare simple things in an orderly manner. You can literally see the havoc the place is in where every time you see an Intern failing to prepare what you ordered.", "author": "Tejashree M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "This place has had a major facelift lately. I appreciate the renovations they've done and the better service that's been happening. The cafe has a lot of new furniture which is super cute and makes it more comfy than it used to be. I really appreciate that they've added phone chargers that are free to use at the bar.", "author": "Gabby O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "I stopped in here instead of my usual Starbucks jaunt and I have to say, the deluxe bagel with lox, onions, capers, tomato, and cream cheese was sooo good. The place had a ton of selections and the price was reasonable. The sugar I used for my coffee, however, came from a container that could have used some cleaning. That's my only complaint. Otherwise, delish!", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "Have to say that I had one of the worst experiences in a coffee shop in SF.  Ordered a croissant and it tasted like it was three days old. The coffee was not much better.  Am glad I avoided the other items on the menu.", "author": "David Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "The sandwich is good but I mean they gave me 1 slice of turkey. Just 1 slice on the entire sandwich.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "The food was alright but poor/slow service. Coffee came in very cheap paper cups. If you are going to be a coffee shop make sure you invest in the products that make or break your coffee.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-27", "description": "I tried this out on MealPal and was sort of disappointed by my crepe. It was very thick and chewy and the chicken inside tasted very dried out. Meh. I wouldn't bother despite the proximity. \n\nBut it is very spacious and I liked how roomy it was. It's a good place to chill and get some work done especially in busy SoMa.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Great place for a quick bite and coffee. Not too crowded and good prices for the area.", "author": "James S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "Food was alright, but the service was terrible! Came here to pick up a meal pal (chicken pesto crepe) and order another for a friend. Meal pal pick up was fine, but waiting for a second chicken pesto crepe took about 30 minutes while watching the staff arguing with each other. Eeek! Not going there again!", "author": "MP B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-21", "description": "If you don't like lines and you appreciate a sweet iced mocha - then The Roastery is worth a visit.\n\nThe Roastery has started expanding their menu and they now make crepes behind the counter. Even with their growing food options - I still find their selection of food to be boring and not very appetizing looking.\n\nTheir drink options are better. Nothing spectacular - but solid. I had their iced mocha with almond milk the other day - and it was just what I needed for a pleasant midday caffeine jolt.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-08", "description": "Positives:\nCozy. Nice menu selection. Good loose leaf tea selection. Nice staff.\n\nNegatives:\nInternet speed is high-latency and slow (0.22mb/s down) even though there are only two other customers here and only one of those has a computer...", "author": "watson w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-18", "description": "They deleted my receipt photo so I added it back. See how shady this place is? Trying to hide evidence. \n\n\nI came in here for lunch today and bought the salmon burger which comes with a small salad. The burger wasn't good and was loaded with mustard. The vinaigrette for the salad wasn't my cup of tea. The BEST part? Check your credit card and bank statements. The lady (Olha) thought it would be cool to give herself $1 tip.", "author": "? ?."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Pros:\nI love the environment; the music stays interesting and plenty of window to watch the world pass by. The couches are comfy and the people who come and go are mostly friendly. The pictures on the walls are extremely worthy of conversation and lighting, color tones are relaxing. I love the breakfast sandwich and the breakfast burrito. I love that their mochas are strong. The girls that work here are cute. There are 2 stations of condiments, and a very large selection if beverage choices. I've been coming here for a while but routinely ordered the same things. Until this morning.\nCons:\nI ordered a crepe which came with a little salad and both shared a box. Salad was the best part but the dressing ran into the crepe and the crepe was mostly a crepe folded into itself with very little filling of what I really wanted; bacen egg and cheese. Really doughy. My tiny flimsy knife barely stood a chance at cutting as the box lids rubbed dressing on my fingers, until I tore them off. I felt like I was eating from a taco truck, which is fine when eating from a taco truck. \nThere aren't any student discounts. Across from AAU on 180 New Montgomery, you would think they would capitalize. $5 for a breakfast sandwich and a bottle of water will go a long way for those worried about student loans (not offered). Restroom needs more love. Toilet lid is wobbly, dirty floors and walls.\nOverall:\nI'll keep coming here because the mocha and the food is good, and the service is warming. Location is ideal for me, and oerhaos I'll get crepes and use the restroom somewhere else.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "Pretty upset with this place. They took a long time for the food and drinks, even though the place was practically empty. Then, once I got my smoothie, pieces of plastic were left in my mouth after one sip. Tried again, some kind of saran-type plastic was through the entire thing. The banana bread was dry. Thankfully the owner returned my money, but I can't come back or recommend this place to anyone.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "I have no idea why there are bad reviews, because this place is one of my favorite. I work near, so stop by for cup of coffee and pastries almost every day. Pastries are always fresh and really delicious. I love chocolate macaroons or almond croissants. Also cream cheese cup cakes are really good. I am picky in espresso drinks, but latte and mocha are awesome here. Staff is friendly, girls are always nice and positive, so they make me day! Sometimes I meet owner, who also works there and he is always very sweet. Music is different in coffee shop, but I really do not care about it.\nWhat is important to me is that place is clean. I can not buy food or drinks in places, where I see mess. \nSo if you are looking for good coffee and some pastries, this place is perfect.", "author": "Mariia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "You know when you have a hankering for something and it's out of the blue, and no substitute will do? I seriously needed not coffee, not just any joe, but specifically hazelnut coffee, preferably light roast. After finding that Specialties around the corner wad closed, we wandered in here and fell under the spell of the charming lounge like coffee roastery. Leather love-seats and high top tables, only one other couple on a Saturday afternoon, nice and quiet, warm and friendly barista. And yes, they had hazelnut coffee, and my husband hot a cappuccino. It's seems like they house the Academy of Art students, given it's around the block, with a ton of artsy stuff on the walls and magazines of that ilk. We kicked back with our drinks and watched the hipster walk on by . . . all good, and a gem of a find in the city :-)", "author": "Ranjan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "If I could give less than 1 star - I would.  In previous times, I have gone to the Roastery and received good food.  Today was that exception.  My friend ordered a bagel supreme (which is a bagel with smoked salmon, cream cheese, tomatoes, onions, capers).  When she received the bagel, she thought that the cream cheese was off.  She brought this to the attention of the counter staff who then told her they could show her the expiration date on the cream cheese.  Then after saying they would make another sandwich, called her back to the counter and said, the manager said they would not be making her another sandwich and to please provide her credit card so she could be refunded.  Not so service oriented are we - Roastery?", "author": "Sasha C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-21", "description": "For a place that prides and markets itself on crepes, they are wayyy too slow. A simple Nutella strawberry crepe takes 20 mins and when I ask them 10 mins after I've placed the order they don't even remember it. For a small, non crowded, seemingly over staffed place they're really not on top of their game.", "author": "Where A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "I've been pleasantly surprised as I've started to come here a bit more.  I don't ever encounter much of a line, which is awesome.  I've always received friendly and helpful service and prices seem reasonable for being in SOMA.  I've enjoyed several sammies, a couple of sweet crepes and now the chef salad.  The sammies are filled with a good portion of meat, grilled and very tasty.  Both crepes were light, fluffy and delicious.  The chef salad was piled high with ham, turkey and salami over a bed of mixed greens.  \n\nI've always gotten my food quickly too.  Their location is great, since it's not far from the office.", "author": "Lon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-24", "description": "Very low quality food (mold) and bad service.  This place used to be ok, but is sliding downhill fast.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "This used to be my go to spot in the morning, when I just need any coffee without any lines at all. But their speed is very slow, customer service is poor, and for a couple times the girl has a not so nice attitude. I'm walking 2 blocks more now for my daily coffee instead of coming to this place. Straight disappointment", "author": "Wei Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-07", "description": "Good first experience at the Roastery. Opens early which is great for early risers! Has a diverse menu for breakfast and coffee/tea. Had a good breakfast bagel! Wish the smoothie machine would of been working properly!", "author": "Rhett B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This place is my sanctuary..the coffee is great.. and the baristas, they are the friendliest..always try to engage in a conversation and they do remember what you always order. Their pastrami sandwich is my fave and of course my extra dry cappuccino.", "author": "desireejake t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "30 minutes to make an egg sandwich and no apology. And it wasn't even busy. Not much more to say but apparently this isn't long enough to be a review until now.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "My girlfriend says:\n\n\"I go here once or twice a week. I've never been disappointed with anything I've ordered here; The sandwiches, wraps, and crêpes are all very good with reasonable prices. Coffee  is excellent, among the best I've tried In SF.  Also they have Sencha which is not always easy to find. The staff is all very friendly and efficient. From the second or third time I went, one of the female baristas knew my order. I always look forward to chatting with her. Somehow they manage to make a coffee shop in such a large city To have a welcoming, local feel. Definitely recommend.\"", "author": "Shermond W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "Crepe breakfast was good. I think the food is a bit overpriced for what you get. Also, Look to be under staff in the morning.", "author": "Dakota M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-21", "description": "Coffee shop directly across from the Academy of Arts, so clearly this is a student coffee shop--you won't find a lack of design students and teachers here, dressed up in non-conformist clothing.\n\nThe good news is, traffic at this place follows school schedule, so on the weekends it's usually quite empty.\n\nOverall there are lots of seating room, and the furnitures are kept quite clean. Wifi is fast and consistent, and the coffee is also pretty well done.\n\nNot a bad place to stop by even if you're not a design student.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-15", "description": "Just wanted a drip coffee but it came w a barista w a serious I'm-better-than-you attitude. Don't need that included w my simple ass order", "author": "Tiffany Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-03", "description": "I ventured in on a lazy weekend morning and noted the entire place was empty. Except for the dozens of flies crawling around, which I didn't happen to notice until I sat down in the dining area. Not a huge surprise considering no one was cleaning up after the deserted tables.\n\nThey get two stars for a good selection of items and being open on a weekend in this area. I found my crepe to be pretty mediocre, but to be fair I did alter it significantly.", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Love this place! This is my favorite work week hangout. Good coffee, great food, AWESOME people! Olga makes the best Americano and has the best smile!\n\nPeace!\n\nRusty", "author": "Rusty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Cool hangout spot. Lots of couches. Had a good bagel. Took a bit to get my order, but they staff was working hard. Yummy Mocha.", "author": "Ben D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "The folks at Roastery are the best! My day can't start without having a egg sandwich breakfast from there. And needless to say, the handwriting is beautiful!", "author": "Ravi D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-23", "description": "Pleasantly surprised since I wasn't expecting much of this place. Breakfast sandwiches and crepes are perfect hangover cures. \n\nCoffee wasn't amazing and when I asked what type they served, they said \"dark roast.\" No community/ritual/peerless/sightglass/blue bottle fancy coffee here---nope, just \"coffee.\" \n\nBaristas were very sweet. Service was kind. It's good for a quick bite if in the nabe and the crepes are quite good but not a destination.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "This is a really cool spot to go and grab a bite to eat in between classes, get some work done. I had the Chicken Club and it was delicious. I thought it did take a while to get my food and there was nobody in front of me, but the overall satisfaction of the food made the wait worth it. I would definitely come here again and will recommend it to people I know", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "With the long lines at other downtown lunch spots, I decided to pop in here. They have sandwiches, salads, and crepes. I got a chefs salad which came piled high with turkey, ham, and salami. It was $9.73 after tax, but after 5 years working in the financial district the sticker shock of $10 salads has worn off, and this actually seemed like a pretty good deal!\n\nI took my food to go, but the interior is pretty nice with tables and chairs and leather armchairs and sofas, and they have wifi as well.", "author": "Steven Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-21", "description": "Really?! $6 for a pre-manufactured burrito tossed in a microwave for a minute and 15 seconds??!?! At least it comes with franks red hot sauce. \n\nOh, btw, it's pretty gross. Make sure you keep the franks red hot sauce. You're gonna need it.", "author": "BJ N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "I decided to try this place out for breakfast the other morning and it was ok.  The staff were very friendly and helpful and the prices seem comparable to the area.  I wasn't a huge fan of their coffee though so I'm not sure how much I'll be back for breakfast.  They do have some items for lunch so I will check that out.", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-16", "description": "The veggie bagel was incredibly hard to eat - it was not soft or chewable at all. The avocado seemed fresh though.", "author": "Raakin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "This cafe was pretty good - very fast service, but I wasn't too happy with the credit card charge.  I understand that when you have a small order size that credit card charges can be steep, but c'mon, it's a coffee shop.\n\nOrdered a regular coffee - it was SO hot which I'm not the biggest fan of since it makes the coffee bitter.  Asked for ice cubes since I needed a caffeine boost before I went to my meeting.", "author": "Alyx F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "If you're like the majority of FiDi workers and find yourself living life as a middle aged white man, I suggest giving The Roastery a taste, just to get in touch with your inner angsty 4th grade girl. The music they blast here (I think they might have diverted electricity from the fridge to the speakers - probably best to stay away from the milk products here) will transport you into a parallel (arguably *better?*) universe where Linkin Park seamlessly follow a megamix of all four of Jason Mraz's songs and every song ever made between 1999 and 2006 about loving someone despite what people say or being held down by your mean parents. \n\nYou can sip an overly sweetened soy latte like the big money man you are, all the while secretly relishing every full volume Coldplay-into-Evanescence transition, pretending it's 2002 and you're on the cusp of entering high school, buying your first bra, and discovering yourself through lusty late night AIM conversations with Jeremy, the resident hottie of Dronesbrook High. \n\nBy the time I was done here, I was walking at double-time towards the warm embrace of a Hot Topic. I live here now. I will help you find your next set of gauges. \n\nThe internet was pretty quick though!", "author": "Dave G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-22", "description": "Where to even begin with this place? This visit was my first and last, thanks to a handful of factors. I was meeting up with a friend who had mentioned that the music was (to put it kindly) lame. She hadn't told me the half of it. When the music was halfway decent, it was too loud. Frequently, it was too loud and obnoxious. We suffered through nearly an entire Britney Spears CD before someone had mercy and switched to Abba, with occasional Christmas carol breaks. Since we were there to visit and drink coffee, the variable volume and awful music made it difficult to hear each other.\n\nThen, around four-thirty or so, the staff began cleaning the place, which I thought was a bit odd, especially since the floor cleaner was very strongly scented. But no one said anything to us about them closing, and we were going off the website posted times (which indicated that they closed at nine). That is to say, we were not told until the female barista came over to wipe our table and said they were already closed, and we needed to go. Needless to say, that was the last straw. Though the coffee is quite good, the environment was so obnoxious and the communication so non-existent that I have no interest in subjecting myself to that again.", "author": "Tiana H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "Often bad service from an endlessly rotating roster of new faces at the counter. Sometimes has been particular awful, not getting my order correct, not putting the food in to cook, misunderstanding when I tried to say something, then almost double charging me for some items due to their mistake. Did remake the food from scratch to get it right, thanks for that. Frequently there are new cashiers who are nice but clearly haven't been trained on the register or menu very well, and don't always have the language skills they need to have clear communication with customers.", "author": "KC R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-02", "description": "Asked for a latte with a little less milk and instead of giving me a full cup with MORE espresso and less steamed milk, she just gave me half a cup of latte.\n\nJust... who does that?", "author": "Sally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "I love this place soooooo much... There crapes is just wonderful. I got to meet the owner Ibrahim he is such a nice guy. He takes good care of us always. \n\nI highly recommend this place", "author": "Tareq M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "I like the Roastery:)) it is a place where you can grab a cup of coffee ,that the better than I Starbucks,cuz is so aroma:) And staffs are sociable and smile everytime:) and makes the nice pictures on a coffee .Thx for a great experience,want to come back !!!", "author": "Olha I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-29", "description": "Bought a sandwich took hella Long!\nBought coffee. A 7years old kid made it and it's not good.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "This place deserves more love than what the reviews are saying below. For one, it comfortable and comfy. And second, the only roast of coffee they serve is dark roast! The rest of the city seems to love their mediocre \"flavor nodes\" of medium roast. Also, the vibe is very chill and feels like it actually has some soul. Totally feels like a hip college, hangout cafe.", "author": "Dwight J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "Had one of the worst customer service experiences that I had to write review.\nThe woman working was rude. It seemed that everything about speaking, taking my order frustrated her. She didn't smile. She wouldn't even look at my face when speaking to me or my friend. My friend ordered a bagel. The woman looked annoyed and said this was the last one she was making in a rude tone. I saw her roll her eyes when my friend asked for more cream cheese.\nShe was however smiling and having fun chatting with the hispanic man that lingered on the pastry window and was even going behind the counter while she made the food. \nI tried to get look at her name tag on my way out for the review by asking her what time it closed but she wouldn't turn around to speak... \nShe was busy with her boy toy talking...\n\noh yea.. and $5 minimum on card.. or .45 cents charge... Annoying.", "author": "Lupita R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "This is a go to place for me and many other students at the Academy or Art University. With it being conveniently located across the street from one of the academy buildings. I visit here very often, they have fantastic food such as amazing sandwiches and a pretty good variety of bagels. \n\nThe coffee is always the perfect temperature and the baristas that work here are so friendly and always upbeat and outgoing. I'm not sure of names, but the ladies that work here are always so helpful. Not once have I had an incorrect order:) I will definitely recommend this place to many of my friends! Thanks for the great service, keep it up!", "author": "Self I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "The Roastery is more-or-less the unofficial student cafe for the Academy of Arts across the street. It's your typical student cafe - everything from the coffee, sandwiches, staff, and decor.\n\nThere are plenty of tables, chairs, and couches - all of which are mediocre in quality. You won't find the nice stuff in coffee shops like Four Barrel, nor are they clanky metal chairs typical in run-down coffee shops.\n\nThe coffee and food are like the furniture, and reflects that perfect level of mediocrity. I like this place not because of its quality, but rather because it brings me back to those good ol' college days, if only just for an instance.", "author": "Don L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "I really liked it here. Good place to read, work and have some tea, bagel, salad or sandwich, everything has been good. They are very friendly. They play good music too.", "author": "Mohsen E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "4 stars for the coffee and the service.  The chocolate croissant I had wasn't very good though and I'd give the food 2 stars.  \n\nJosh was my barista and he made an error with my order using regular milk instead of soy milk.  When I mentioned it to him he immediately offered to fix it.  I didn't want to waste the milk, so I said it was okay and I could just take the drink.  He then told me that the next time I was back he'd make me a drink on the house.  How nice!  Love the effort to do right by the customer.  I'll definitely be back here again.", "author": "Wayne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "It's decent. It's a great location and everything is acceptable. I wind up eating here a lot. They place a decent mix of pop music if you're into that. If they put forth a little more effort this place could become a local hotspot, but it's just missing that little something something.", "author": "Devon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "Terrible. Absolutely awful. You have to worry about cracking a tooth when eating a bagel. Burnt and hard as a rock. Terrible customer service and lousy food.", "author": "Lon F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-27", "description": "I dropped by here to get coffee and a snack. They had a big sign saying breakfast burritos now served here, $5.45. So that's a bit steep for a breakfast burrito, but i thought why not. Well to my surprise, it was nothing more than a small frozen burrito  heated up. It was pasty inside and absolutely disgusting. I don't see why they advertise them when its nothing more than freaking frozen burittos, still wrapped in their packaging. Very disappointed in my waste of money and not even being able to have a proper breakfast. Save yourself the money and go to McDonalds for fresher food.", "author": "Bevi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-07", "description": "Back in the area after a long day of walking, close to the hotel, and seemed to be an independent chain so I gave it a try :) \n\nOrdered an Americano, tasted fair, a little above a Starbucks one, definitely not horrible. It's also always nice when they ask if you would like room for cream, (which he did ask!), without me looking around guiltily and having to pour some away with a pained expression!\n\nLots of seating, and yay free wi fi! The shops wasn't swamped with laptops though maybe it was due to the heat wave ;) A very  safe place to go for a coffee, I'd say.", "author": "Trudi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-26", "description": "This place is so bad, I made a Yelp account of this.\nA classmate and I chose pay this spot because we go to school right across the street from it. When walking in, its pretty unorganized, but the atmosphere seemed pretty cool. Lots of fellow AAU students seemed to be in attendance. I ordered the Chicken Chipotle Sandwich from a very rude gentleman who seemed unhappy that I even decided to order anything. He spoke so quietly, and was upset when I asked him to repeat something. My classmate also paid note. He had ordered a Turkey sandwich. While eating, it seemed pretty good. The little salad that came with had an acidic balsamic dressing, but not quiet unbearable. Later that night, I woke up with serious stomach pain, and it progressed into vomiting into next day. I missed 2 days of work and of class. I sent my classmate a text, and he said he had diarrhea the next day. Will definitely not be here again, and will not recommend this place. I probably wouldn't have gone back even if I didn't get sick because of the customer service. Just terrible. I really wanted to like this place.", "author": "Jacob Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-05", "description": "So I randomly decided to check back in at this place today, but not much has really changed. I will say they have improved the decor a little bit, though some of the paintings border on the bizarre. The main issue was and still is their prices. I walked out of there this morning with a latte and a ham croissant for over 10 bucks - it's just a silly amount.\n\nI would recommend they either work on their supplier agreements (a croissant should not be $5.75) or choke down on the old profit margin lever. The vanilla latte was poured well, but was too sweet. You're better off grabbing a banana at walgreens and a coffee from a street truck or special Xtra.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "Some dude here complained about the snobby hipster girls behind the counter, and you know what? He probably got turned down himself to be so angered...\n\nMy coworkers and I all value quality food and friendly service, and vouch that you will get both here. We always get big smiles from the girls, and we chit chat and laugh with them. \n\nThey recently expanded their menu to offer bagels and sandwiches, and they are GOOOOD! We just got back from picking up a bagel & lox and a sundried tomato pesto bagel, and both were neatly made and tasted delicious (one of the owners himself made it, and he is a meticulous food handler!).\n\nThe new menu they posted does not include their delicious \"Africano\" anymore, but they still serve it, just ask. Africano is basically a short latte, the same shot of espresso as a regular latte but with less milk. Try the Soy Africano, so good...\n\nBe back soon.", "author": "Anna G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-09", "description": "I go to the Roastery when Starbucks is overflowing.  I actually prefer the coffee here, and there's almost never a line.  Probably because the service is obnoxious.  Most of the time there are snobby hipster girls behind the counter who are flirting with some hipster dude or just too damn good to look customers in the eye or greet them with a pleasantry even remotely approaching sincere.  \n\nGood coffee, nice location and atmosphere.  Just needs a new staff.\n\n$3 minimum on credit cards is annoying when my coffee is $2.75.  C'mon people.", "author": "Matt O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-25", "description": "I'm not reviewing the coffee or the food. Might be a bit odd, but in this location, you're not likely to come here for a leisurely Sunday morning paper and pastry, or meet a friend for a fabulous lunch. You're right in the midst of the downtown skyscrapers and when you stop here, likely it's for caffeinated fuel or workspace. \n\nThe workspace is as perfect as you'll find in a city cafe. Decent coffee, decent food, but plenty of space to sit and work, and a clean restroom.", "author": "Poppy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "Been meaning to check this place out every time I would walk to Specialty's... today was my day to check them out...\n\nAfter getting our pastries (breakfast) from Specialty's ... me catering to a hang over... I opted to get coffee here since I needed to stay awake for the day...\n\nUpon walking in... saw their pastries... damn it!? They looked good! Too good for you that you'll need to work out thereafter! I was so tempted to order one but I fought the urge.\n\nI ordered a triple soy mocha - yup, I needed to wake up! \n\nService was friendly and fast... I might become a regular!\n\nPS: triple shot working its magic now...", "author": "Cath M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-11", "description": "One bad attitude staff who intentionally delayed my coffee and demand another customer to do his job for him. Ridiculous and he can't handle this basic job. Their coffee is not even good.", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-28", "description": "This place is the WORST eatery I've ever been to. Our veggie crepes were cold and all the veggies were raw. The avo wasn't even ripe. On top of the poor quality food, it took 30 minutes to make a shitty crepe. There is a child working at the register and one person making food. Avoid at all costs. I'm doing you a favor.", "author": "Tia F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "There aren't too many independent coffee shops that are open on the weekend in the Financial District, but this is one of them, so I met up with a friend one Saturday morning.  They have a great selection of coffee beverages and also have some fresh smoothies.  My strawberry banana smoothie was pretty delicious!\n\nThe space was big and had plenty of tables and couches if you wanted to stay and enjoy while there.  I thought the service was good unlike some of the other reviewers of this spot.  There was nothing over the top, but this place is solid and a great option if you looking for a place you can take over a table for a while and get some work done.", "author": "Maria K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-12", "description": "Terrible place to get work done.\n\n1. Slow wifi.\n2. Weird smell. Somewhere between B.O. and wet dog.\n3. Watery coffee.\n\n:(", "author": "Sam G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-01", "description": "I was excited to find this place this afternoon - it has free wifi & plenty of tables. I thought I could get used to the strong cleaner smell (at least it's clean?). But that, combined with the unbearably loud pop music, flies, terrible lighting (are they all flickering on purpose?), and boxes everywhere is making me want to chug my coffee and find another cafe ASAP. I can't think of why they would feel the need to play such terrible music so loudly, other than to drive away people who want to hang out & get some work done. Fair enough, it worked. 2 stars because the espresso was pretty good. But I'm out!", "author": "Carrie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "Cute place- clean, well decorated, nice ambiance. 4$ for a Naked juice I can get at the Walgreens a block away for half that? Ouch. I should have gotten a sense of something being amiss when I walked in and saw the place basically empty.\n\nBut--- the people were pretty nice and the cheese and ham croissant is the bomb. I know I won't go back, though. I'd have been better off at the tried-and-true Cafe Madeline, a few hundred feet away. \n\nWay better bang for your buck elsewhere-- nearly 10$ for a croissant sandwich and an orange juice is almost robbery, even in the Financial District!", "author": "Bianca S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "sandwiches are larger than most\nlove the banana nutella crepe, the crepe dough is just sweet enough to hit that craving for sweet yum", "author": "Vange B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-22", "description": "I've come here from time to time to get coffee. I typically like to get my mocha from Madeline's... But, sometimes I get too lazy to even walk a few more blocks. The coffee at The Roastery is alright. The desserts and sweets are alright, too. Again, I prefer Madeline's. \n\nI recently came here with my coworker, and she said that management had changed. I could totally tell the difference. Service was so much slower, and the employees weren't too friendly (some of them). I swear, we waited 15 minutes for my coworker's Americano. Terrible. Other people were also waiting for their drinks for a while... It should not take too long to make coffee when it's not busy...\n\nOh, they accept credit card only if you spend $3 or more. I usually have to pair my coffee with something in order to use my credit card...", "author": "Vera W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-22", "description": "I agree with Vera - I had been getting my morning coffee at The Roastery for a while. There used to be a bunch of super friendly baristas. One day they were gone and there was new management. Sad. Of course, I don't mind explaining my very simple americano drink to someone new... but they're not very friendly and it takes so long. Plus - the sizes have changed and now I have to pay more to get the double shot americano I have always gotten. \n\nI will walk the extra block to Madeline's where it's quick, the people are kind and it's cheaper.", "author": "Holly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "The coffee drinks are prepared very well, especially the mocha. I love the vibe and seating arrangements here also. I'm usually running in from class on a 12 minute break so I never have time to sit and relax. If you ever have a chance to sit in here and  relax, tell me how you like it.", "author": "Court S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-22", "description": "Carmel Vanilla Latte was per-fect... fancy design on top just how I like it. Presentation is everything especially with first impressions. Yeah I'm high maintenance like that... what of it?!\n\nService was fast AND with a smile despite the overwhelming amount of obnoxious business people that were swarming SF for the Salesforce/Dreamforce Conference. \n\nTake that Starbucks! You have a local contender!", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-19", "description": "Oh the misery of life... I stopped in this gray chilly morning in dire need of caffeine..  Any caffeinated substance would have sufficed.  \nWhat a staff at this dive!  As I stood waiting aimlessly as the only customer ready to order I watched two clueless baristas just hang out behind the counter. Neither could be bothered to say a word even after making eye contact.  One dude just peeled carrots at a snail's pace.  Finally a third guy walked past twice and eventually said, \"do you need something?\"\nUmm, no I'm just here to get the life sucked out of me as watch your entire staff lament the awful life they are living wasting away in this crap stand... \nOne piss warm latte 5 minutes later with a little \"fuck you, have a nice day\" stirred in to taste...\nGo anywhere else, anywhere", "author": "Nathan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "Cute spot for a good cup of coffee. Plenty of seating for the Academy of Art students from across the street or the office worker on a coffee break. The service was efficient too. And pro tip, they do have a bathroom-- not an easy find in this neck of the woods. Yay!", "author": "Teresa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-25", "description": "This place makes up their hours day-by-day. But what else can you expect from small-town San Francisco? Especially in a part of town that is a zoning monoculture without much of a residential population to sustain the business through evening hours. Still, why can't this place just be consistent and always close at 5pm or 6pm, instead of varying between 5pm and 8pm day by day? Why cause confusion?", "author": "Chad F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-25", "description": "I work right down the block from The Roastery so I've gone here roughly three days a week for the past four months. It's not Blue Bottle but the coffee will suffice.\n\nSometimes a very pleasant woman who has a faint southern tone in her voice takes my order. Even at 8am she is cheery and helpful. For this kind of service as a means to start off my day I'll suffer through a cup of burnt Maxwell House if I have to.\n\nOther days, however, I get one of the males as my barista du jour. Often times it's blasé, disaffected 20-somethings with tattoos and odd haircuts  who seem like drop-outs from the Academy of Art campus across the street. They're not really holier-than-though, but rather who-gives-a-damn-if they're-helpful-and-friendly in the morning. They clearly do not.\n\nOn the worst days, a blond guy with a short fade-type haircut, somewhere between '80's Corey Haim and a douchebag Marine, who is roughly 5'9\", serves me. He has a sleeve of tattoos on one arm. \n\nI can only describe this guy as the coffee version of Dr. Java and Mr. Fickle. I never know what will happen next after I walk in the door. Some days he wants to interact with me and makes me feel odd when I do not tell him how I'm doing that morning (it's 8am, how do you think I'm doing?), other days he scolds me for having spilled coffee on the counter the prior morning or tells me I have a bad attitude. Then he gives me an odd silent treatment when I ask him why he would speak to me that way. Or, he tells me to leave if I'm on my cell phone even for 5 seconds. Where are we, kindergarten? Evidently.\n\nIt happened again today and he told me I was \"cut off.\" Um, okay. This is like a Seinfeld episode. I inquired why I was banned from the Roastery and the guy who claimed to be the manager was either terrified of Mr. Fickle or was simply a moron (or high?). The other guy seemed to indicate this type of thing happens all the time.\n\nOh well. I'll never go back.\nSad. I like this coffee shop but I refuse to apologize because some jerk who makes coffee for me is throwing a temper tantrum because I won't chat with him about my day or acknowledge his repeated requests that he give me \"room\" in m iced coffee. You odd, fickle, creepy, manic depressive, weirdo... I will give you all the space you need. And, if I want room in my coffee I will ask for it.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "lots of great breakfast items other than pastries and doughnuts", "author": "Brian R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-17", "description": "Caffe Trieste has been replaced! Will this cafe stay one of my favorite lunch spots?\n\nYes,\n\nbecause is still the same.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "Forget about my old Cafe Trieste review.  \n\nThe roastery delivers high quality drip coffee, for a very reasonable $2.  Add in a delicious apricot flat for $3, and that five spot gets you the breakfast of champions, or whatever you call the meal that has added 2\" to my waistline over the last few months.\n\nMIchelle and the rest of the staff are friendly and efficient,  the coffee is great, and while I haven't sampled the lunch menu, they do a brisk business at lunchtime too.  Free wifi if you need it.\n\nMy one complaint remains - how about some extended weekend hours for those of us in the neighborhood who have to live or work here?  It's not just art school students coming in you know!", "author": "dan s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "I loved this place when it was Caffe Trieste, and still love it as The Roastery (although the new logo is lame). Everyone there is friendly, knows exactly what you want before you order and are very chatty in the morning.\n\nThere's lots of room to relax, have a meeting or get some work done. And yes, there is wifi--and yes, you should buy something if you want to use it.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-23", "description": "This place is barely average in all regards, but particularly in the service. Avoid Josh (blonde). Very snide and unappreciative of customer showing support for local biz. His comment to me, \"there's always Starbucks.\"\n\nI asked for a decaf coffee, but they didn't have any brewed, so he offers a decaf Americano as a sub. No prob. But, he proceeds to charge me for the Americano versus the small coffee I wanted when it wasn't that they were out of decaf grinds to make my coffee, but that they were too lazy to brew it. As a matter of principal, you'd think they would extend the tiny courtesy of charging me for the small coffee for the inconvenience of their laziness. I'm wondering if this is what the business owner teaches her/his employees? Yeah, I guess there IS always Starbucks, and for good reason. Get it together, Roastery. Especially in our current economy.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-20", "description": "Really bad customer service -girl behind counter was rude....either hates her job or hates people. Two crepes and two cups of coffee for $28....and they were gross :(", "author": "Tina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-27", "description": "I grabbed a coffee from here. The regular size latte to-go was TINY. It was borderline shot-glass-size tiny and it was $4.00 While the coffee was good. I won't be back. Too expensive and not enough value for the dollar.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Love their coffee!!!!! Great place with friendly stuff, delicious food and the best coffee. They have a lot of different stuff for breakfast and their pastries are always fresh. They also serve panini and crepes.", "author": "Rstay A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "My second time coming here and I've only ordered the Vanilla Latte. So far so good!", "author": "Monique E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "I must say the crepes are amazing! Good coffee and great service! I'll def be back", "author": "Brandy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-12", "description": "Saw this place near work and thought I'd give it a shot. The chicken caesar salad I just picked up for lunch is abominable. \n\nI had high hopes because the salad was prepared on the spot (most pre-made salads are gross to me) and it looked alright when I picked it up, but they hardly put any dressing on it to begin with (I noticed this on my way out and turned around to ask for some more on the side). Now I am back at the office eating it and there is still not enough dressing and the chicken is wonky. \n\nA lot of people here said the staff was rude. This was not the case for me, but there were flies everywhere. I'm not sure if this is an indication of how clean it was. I know sometimes you can't help flies, but I don't notice them at any other quick lunch places in the area.........", "author": "Katie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "Definitely should have left this place a review when I actually lived in the Bay Area.  Efficient counter service, solid coffee, excellent coffee, mellow vibe.  Good spot for working in SOMA.", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-21", "description": "Ordered a breakfast burrito while it wasn't busy. Two people who ordered behind me got their burritos. 15 minutes later I had to ask where mine was. It was stuck in the fridge and then they threw it in the microwave. Friendly people but awful service.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-13", "description": "The house coffee is pretty good; nice strength and flavor, and low acidity. The place is across the street from one of those ubiquitous Academy of Art University campus'. I didn't investigate the pastries/eats here. Just the coffee, which is a solid 3.0 stars for the experience.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Really good coffee and pastries, and generally has no line. I might become a regular here soon enough.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-17", "description": "Great lattes near the Moscone Center. The owner / operator and his baristas were always friendly and it was a relaxing decor. I'll keep going here when I stay in the City, for sure.", "author": "Brian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-31", "description": "Came here the other day to grab a sandwich and they are delicious! The coffee here is also great (in my opinion it's better than starbucks) their lattes are amazing. Definitely a great place to grab lunch. The workers are friendly and the place is clean and spacious inside.", "author": "Jessie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "If you're looking for a spot in the Financial District to chill for a moment, this is a great place.  Good bagels, decent coffee -- usually can't go wrong.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-23", "description": "Cute place in SOMA next to a school. They take credit cards but it's a $3 minimum. Didn't really \"feel the love\" from the staff there....they had their own convos going on the whole time & when I asked questions about the sweet/savory choices - the names aren't posted so you're guessing at some of them - the girl gave major attitude in her response. Oh well, whatever, guess I was annoying to her since I was spending $$ in their establishment & didn't know what I wanted. \n\nCoffee was great - Cafe Trieste for house pour. Nothing added, that's how I judge my coffees & this was better than Peet's in my opinion. \n\nIt works - I'll probably go back if I'm ever in the 'hood again & need a morning cup o' joe. \n\nFree wi-fi w/ purchase.", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-23", "description": "In a sea of Starbucks where they charge you for wifi unless you have att hotspot (which obviously i do not =) where do you go but the independent coffee shops?  nestled in downtown near the financial district and the art academy is where you'll find the Roastery.\n\ni needed a quiet place to work that had internet and the Roastery was a great spot for that. ample seats and wifi in the back, i felt comfortable enough to work but not too comfortable where i would sleep. the crowd is eclectic. there were 2 elderly latino men having a passionate conversation in spanish next to me and some guy playing his guitar (it was 11am)..\n\ndrinks are good-at least the caramel machiatto was tasty (so much more authentic than Starbucks).\n\ni would have given this place a four star but for the barrista's response to my question when i asked her if there was wifi. \"yes\" she replied, \"but you have to buy something\". Thanks, but I  just needed an answer without the side of commentary.", "author": "Betty C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-01", "description": "On my mission to try out every coffeehouse I can in SOMA, at least in my path from the BART station to my office, I finally waltzed into this place one morning. I had checked it out many times from the outside. It looks like a pretty cool place and much more roomy than other coffeeshops in the area. \n\nHowever, I was unpleasantly greeted by an indescribable smell when I walked into the door. Not exactly the sweet aroma of a good cup of Joe -- it was more like food, but not good food -- like the smell of a high school cafeteria. \n\nIn spite of my nose I went ahead and ordered coffee. The man and woman behind the counter were both extra nice. The woman took my order and made light conversation. She even complimented me on my scarf. The man made my iced decaf Americano. \n\nThe Verdict: I have no other complaints about the place, and I may go back at some point to see if the smell was a fluke, but yeah, not a huge fan.", "author": "Cara S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-14", "description": "Since I moved to this city 6 months ago from Chicago, I've been crapped on several times by local businesses. I took it in stride as I know my Midwestern ideals don't always mesh will with the extremely laid back vibe of Cali. \n\nMy recent experience at the Roastery (a place I've really loved up until now) has prompted me to create a Yelp account to lay fire on this absolutely shitty service I received today.\n\nI come in almost every day for coffee, today - I decided to get a Lox Bagel, no tomatoes. The guy behind the counter brings me my bagel - no onions, in which I clarify with him - no tomatoes.\n\nHe goes on to tell me - 'No, you said no onions'. I politely correct him - 'No, I'm pretty sure I said no tomatoes'. Again, he says 'No, you said no onions'. The entire time he's staring me down in front of the rest of the customers in the cafe and being extremely non-nonchalant and rude. I promptly take my bagel and walk out because I don't have time to argue with him over this - I need to get to work. He also stalks away without even a 'thank you' or 'sorry' or 'let me fix that for you', nothing! I can get over that part - I just can't get over the so-called public humiliation/intimidation he tried to subject me too.\n\nI want to call later this afternoon and speak to a manager about the service and I can't find their number ANYWHERE on the internet. Shady, shady.\n\nIt's a shame because I love their coffee and the art student vibe of the place, but I won't be going back.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-30", "description": "I come here out of habit as it's on my way to work.  I always go around 9am and get myself a small house coffee.  That's $1.95, which is certainly more expensive than a number of other coffee places in the area (including Starbucks) and it's not particularly stellar.  It's not bad either, but it's not worth going out of your way for.\n\nThe staff is usually nice enough, but nothing that makes me feel like this is a place that I'd like to do more than get coffee and go.  One of the staff, I will admit, makes it feel like I'm troubling them for wanting to purchase a cup of coffee.\n\nIf this place were one block away, I'd probably just go to Starbucks instead.  At least their house coffee is 30 cents cheaper.", "author": "Alexander S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-14", "description": "The coffee and food is over priced for what they give you. Their new \"Breakfast Burritos,\" which are just over $5, is just a small microwave-heated frozen burrito. You can get much better (for the same price) at the Chipotle across the street in about the same amount of time. There's much better sandwich and coffee places less than a block away.\n\nThe furniture and ambiance is nice and the staff is decent (but they usually feel like they want you to hurry up and order and leave), however, if you're not planning to stay for a while, I would seriously recommend continuing elsewhere.", "author": "Jaclyn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-10", "description": "If I could give them 0 or negative stars I would. This place used to be good. Recently it's gone downhill. Not only does the girl at the counter always get my order wrong and is rude about it, the bartender is an just a jerk. I saw him use whole milk when I asked for soy milk (I'm lactose intolerant). When he put my frappe at the counter I said \"excuse me\" to which he turned around and ignored be before I could finish. When I finally got his attention, I asked if \"this is the one with the soy milk\" to which he replied \"yeah it's the only frappe I did\" rudely and turned around and walked away. Not only did all this happen, but the last couple times I've gone here the coffee is disgusting and basically water with a hint of coffee taste. Forget this place. I know it's right  across the street from my school, but I'd rather walk down a few blocks to starbucks than deal with these people and their crap coffee again.", "author": "Delayna N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-16", "description": "Blah in so many ways, here's my quick tip: don't come here; not even if you're looking for something quick. \n\nWe had an appointment in 45 minutes in the area so there was no time for a sit down lunch.  Oh how I wanted weekend brunch, but alas I did not wake up in time and how I am kicking myself for it.  \n\nService: HORRIBLE.  There really isn't much else to say.  Standoffish cashier, only one person (who takes 20+ min.) to make sandwiches.  I can't stand when people are in customer service and aren't friendly.  No \"thank you,\" no smile, I guess no more business from me.\n\nFood:  Came here around noon and looked at the menu.  Almost half (if not more) of the menu options were bagel sandwiches.  Oooh, the Lox sandwich sounds good...oh wait, they are OUT OF BAGELS.  Seriously?!  \n\n- Paninis: we ordered two paninis (chicken and ham) which came in a gooey mess and was dripping with mustard...the cashier never bothered to ask if we wanted mustard.  As it turns out my brother hates it (and no, the menu never said what the sandwiches have).  \n\n- Hummus & Vegetable sandwich: for the vegetarians - slim pickings!  The hummus sandwich was something like this: wheat bread (no, you don't get an option) with bad quality hummus thinly spread, huge red onions, cucumber slices, and shreds of carrots...literally you get maybe 3 very thin strips of carrots.  \n\nDo yourself a favor and go elsewhere.", "author": "Alvina W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-19", "description": "Got a turkey club sandwich there.  Barely any meat and bread was kind of stale.  I won't be back.  I was wondering why it wasn't busy there at all", "author": "Joseph D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-01", "description": "The Roastery has all the tea and espresso drinks you'd expect from any decent cafe. In addition to their full beverage menu, they also have a wide selection of breakfast sandwiches, panini sandwiches, bagels, croissants, salads and baked goods. You really can't go wrong when you start your day off with a Ham and Swiss Cheese Croissant--it's wonderfully indulgent.\n\nThe newly re-branded Roastery replaces one of the popular Caffe Trieste espresso houses scattered across the Bay Area. High franchise costs have driven this cafe to drop the Trieste name.  It's still a great alternative to the national chains--Starbucks, Peet's, Tully's--all of which are within walking distance.\n\nThis place is frequented mostly by office workers in the SOMA neighborhood and kids from the Academy of Art. \n\nThe folks working behind the counter are friendly enough, but it does take a while for them to get the drinks out. Fortunately, you can grab a copy of The Onion there, and if you're lucky, plop down on one of the sumptuous leather armchairs.\n\nNote: $3.00 credit card minimum.", "author": "Nest C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-30", "description": "the lady making some sandwich is so rude. \nrude and slow. ruin my day. \nEven not clean.\n\n\ndon't' go here.", "author": "Sue K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-28", "description": "Grabbing a drink here, 3 out of 4 times they will get my order wrong. Despite coming here at least once a week, and some employees recognizing my face, they still can't remember my drink. I always ask for soy, but they just seem to give me whatever the barista feels like that day. They give me attitude when I tell them that they made my drink wrong and tell me that I have to tell the person taking my order that I wanted soy, which I always do. Even though I'm a paying customer and usually hand my money over with a smile, some employees act like they're doing me a favor taking my money. There are a couple employees that do genuinely care about good customer service, but not many. If this place wasn't right across the street from school, I'd never grab a drink here. Take this from the Duke of The Roastery, go to the Starbucks close by, they make drinks right, and without the grief.\n\n-1 not so great coffee\n-1 lack of customer service\n-1 long waits for your drink despite short lines\n-1 sub par food\n+1 for being right across the street from school", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-02", "description": "Without commenting on the food, which I've never had, or the coffee, which is okay- let me say that in our current economy it is shocking to find business people with bad attitudes towards their customers. Go in with one of my co-workers at 10:30 a.m. She was hungry and saw the sign for paninis. But when she tried to order one, was told they don't serve them until 11 a.m. Why, I asked, couldn't they make her one anyway - it's not like there were a lot of people in there! First person behind the counter responded with \"That's the rule\". You're kidding, the RULE?? What kind of rule is that? Then someone else says they don't turn the panini maker on until 10:30 and it takes a half an hour to heat up. Okay, now that makes sense. But he doesn't leave it at that - he says to me : Do I come to your house and tell you how to run things? I didn't know that when I was stepping into a restaurant that I was actually entering someone's living room! But that's not enough from him : his next comment is that she could have made herself a panini at home and it would have been much better for her!!! \n\nWhatever my friend ordered to eat was awful and we both made a pact never to step foot in there again. If you enjoy being dissed, go here, otherwise there are plenty of other food/coffee shops in the area that have way better service and food.", "author": "Carla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "What  can I say??? Everyone's palate is a little different for food and drink - but I find the Roastery has a little bit of everything I could possibly be craving...which is troublesome because I love to eat and someone would have to roll me out the door if I spent enough time there...thank goodness it's downtown and not close to my house.", "author": "Dee Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-26", "description": "So sad. This used to be my go-to coffee place across the street from my work. Very nice owner, not the friendliest baristas, but good coffee so I could get past that. Until right now.\n\nI ordered 2 iced lattes. The second one was delivered hot. I thought about just drinking it (not trying to inconvenience anybody, but I did pay for an iced latte). So instead I told the guy \"oh, this one was supposed to be iced.\"\n\nHe mumbles something about paying more and gives me a horrible look. Coffee man picks up a cold cup, pours the hot latte in, puts in about 5 ice cubes, and hands it back as he says - \"here, now it's iced.\"\n\nThe girl that took my order had to come over and pour our more coffee and put in extra ice. I clarified that I paid for an iced latte, and she said \"oh yeah he just read it wrong.\" At this point I'm drinking an awkwardly lukewarm latte and searching for a new coffee spot.", "author": "Anne C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-22", "description": "Saw the $4.95 breakfast burrito sign and thought I would give it a try.  Big mistake.  I order the sausage and it was, by far, the worst breakfast burrito I've ever eaten.  A breakfast burrito is pretty hard to screw up, but they managed it somehow.\n\nI'm not a picky eater, but this thing was awful.  Most of the tortilla was sticky/gooey except the seam down the front and the end; those were hard and chewy (think shoe leather).  The inside was molten hot and everything inside was soft and mushy with little flavor.  Tried adding the salsa to give it some flavor but it was one of those watery, vinegar tasking versions which was no good.   The place was not busy, but the burrito took many minutes to \"prepare\".  I wasn't in a hurry so didn't really care, but couldn't figure out why it took so long.  I figured they were making it fresh and I wasn't watching, but when it arrived it was pretty obviously a pre-made burrito that was put in the microwave.  The ones at 7-11 are significantly better.  I should have kept walking and gone to Lee's, which was my original plan.  I had my own coffee so can't comment on that part.", "author": "Cliff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "Can I get a double cappuccino dry please? \n\nDespite what some of these other reviews state, about the coffee being bad, I find the coffee to be quite mild and tasty...not burnt and not bad tasting. I think this vastly depends on the barista and we've had nothing but good service and friendly baristas. Never had issues with an unfriendly staff. \n\nAs far as food goes I've only had the Hummus / Veggie sandwich and bagels, which are pretty good. They sometimes run out of things...such as, bagels...which sucks.\n\nAnyway, I'll give them 4 stars because we've never tasted a bad dry capp.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-14", "description": "I think I like this place.\n\nI may have walked into this place when it was Caffe Trieste once or twice.  I don't remember it much then, but apparently it's the same, sans the Trieste name.  I think I was intimidated at the time because I wished not to be judged by the hordes of hipster post-teens who went to the Academy of Art across the street.\n\nThere is a $3 credit card minimum, though I'm not sure if this was in place before.  It can be satisfied with a coffee + pastry combo, or a small mocha.\n\nThey brew the same strong coffee: $1.90 for a small, $2 for a medium, $2.10 for a large.  Actually they have some fancy Italian names for the sizes a la Starbucks, but not the same.  I prefer to order in \"small,\" \"medium,\" and \"large\" anyway.\n\nThis has also probably become my favorite spot for white mochas, they are oh-so velvety smooth.  Big props for using Clover milk.\n\nThey also have some unique pastries.  I often find myself ogling the pastry case and trying to figure out what sort of filling is in each danish-croissant breed of baked goodness.  The cherry and the apricot flats are amazing, by the way, and all that flaky buttery nom-ness fills me up all the way to and through lunch.  There's a Cafe Madeleine about a block away, but I find myself coming here more often for their pastries.\n\nI've also had their caprese panini during lunch.  Good panini at about $6 - $7, but not if you're in a rush.  The freaking panini press takes forevveeerrrr.\n\nYes, I do think I like this place.", "author": "L Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "I just had a delicious pesto chicken sandwich at the Roastery. The panini-pressed focaccia-like bread made the sandwich. \n\nI hadn't thoroughly perused the Yelp reviews prior to eating there. Now that I have, I need to go back to try the coffee. Several review say it's \"burnt,\" which is exactly how I like my coffee!", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-13", "description": "I would be giving this place 0 stars if that were possible. One star is too nice. \n\nI went here because I like to try different coffee places and didn't feel like walking all the way to Starbucks - next time I will. \n\nTHE HORRID CUSTOMER SERVICE I EXPERIENCED AT THIS PLACE WAS COMPLETELY UNACCEPTABLE,  and if the manager of the Roastery is reading this: I would suggest that the two employees I am going to write about, be fired and replaced with people who actually care about providing at least basic customer service. \n\nTo be specific, I was here on Wednesday Morning, April 13, 2011 around 10:10 am. There was a man working the cash register and a girl with black hair making the special drinks and working the espresso machine. \n\nI waited in line, and ordered a single mocha. I knew there was a long line and I would probably have to wait a while but I wasn't in a hurry so I didn't mind. But, after waiting for over 15 mins, my drink had not come out, a double mocha had come out and was sitting there but not a single. I tried to get the girl's attention who was serving the drinks, but she said in a very rude tone \"Just take it!\" as she was walking away. Okay, she must not have been in a good mood - so I went to talk to the man at the cash register. I politely explained that I had been waiting and had not received my drink yet. He offered me the double mocha that had been sitting on the counter that no one claimed. I did not want that - so I let him know I would like the single I ordered because I don't want as much caffeine as a double has. He literally rolled his eyes at me and then said a single would be coming out in a minute. As I was walking back over to the waiting/sitting area, I could hear both the cashier and the girl making the coffee bad mouthing me for asking for what I ordered. They were saying things like \"Who complains about being given more than what they ordered!\" and \"That's so stupid, its like saying oh you gave me too much change!\" These loud comments were still going on as I walked out with my coffee.\n\nThe coffee was not bad - but not great either. \n\nI was completely appalled. Not only did they make me feel uncomfortable for talking about me right in front of me like that, but it was also so loud that I could hear it all the way over by the sitting area! They did not have any customer service and on top of it, displayed the behavior of 13 year olds. \n\nI will never come here again, and will be spreading the word of the terrible customer service that is never acceptable! \n\nAnd as stated before, I highly suggest that these two employees be fired and replaced with people who actually care about providing at least basic customer service.", "author": "Tabatha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "I really like this place, and I think it's the best cafe in SOMA.\n\nThe coffee is dark roast, not boutique or \"third-wave\" coffee; just a good standard cup of coffee.\n\nI can't speak for all of the food, but the breakfast treats are great.\n\nI like the staff here as well - they all have character, and there isn't a snobbishness, or a pre-scripted customer service farce that can be found at other cafes.  In other words, the people working here are genuine.  \n\nThis place has genuine atmosphere, and I think the owner had the presence of mind to hire cool, genuine people, and let them play their own music, and let them act like themselves.  This is what separates a place like The Roastery from someplace like Starbucks.  The atmosphere here is generated organically from the interplay between the staff, the ownership, and the customers, and thus gives the place a relaxed and unique feel.  If you, the customer, want a sterile experience where the staff kisses your ass, or you really think that coffee from some specific valley in Ethiopia is going to change your life, you're more than welcome to it.  If, however, you would like a well-made cup of coffee in a relaxing and interesting environment, I suggest you get yourself to The Roastery.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-28", "description": "Within a 3 block radius of my office, this is my go-to coffee place. Usually I stick with the cappucino, and typically it's good. If you get there before 8:15ish, you seem to beat the art school crowd and the place is pretty quiet.\n\nOther pros: Yummy pastries, a good amount of seating, some friendly staff.\nCons: Some unfriendly staff (try smiling! it's fun and good for you!). They frequently forget to make my drink in my reusable mug when I hand it to them with the order.", "author": "Mariah N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-13", "description": "I liked this place better when it was Cafe Trieste, but in fairness it probably hasn't changed much since then...maybe it's just the name. \n\nMost of the staff members are pretty unfriendly. Except for the one rad guy that has longish hair and wears plaid a lot. He's kinda funny. :)\n\nThe Americano I get there is good, though sometimes inconsistent, but every time I've ventured to the food, it's been a big mistake. Soggy, gross yogurt/fruit cup, and so-so treats. \n\nIt's the easiest place to go to on my way to work, and has better coffee than Madeline's or Specialities but if I could just as easily go elsewhere, I would.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "My roasted chicken with veggies and mustard on some sort of ciabbata focaccia hybrid sandwich was a falling apart mess.\n\nA delicious mess.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "A great place for a quick cup of good coffee if you are on the go - or have a meeting for business and need to sit and chat over delicious cafe food and great coffee. The service has always been a delight - it is nice to have a cafe where I can chat with the folks behind the counter and feel so welcome.\nYou guys rock!", "author": "Jamie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-07", "description": "Cozy. That's about all it has going for it.\n\nCoffee? Burnt and overpriced. You'll pay for 20 oz and they'll give you 12 oz. If you're lucky.\n\nNB: Blue Bottle and Peet's are just a block or two away. Even Starbucks and McCafe make better coffee than this place.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "I like coming here because it's right around the corner from my work.  The staff is really nice, it's a cool spot to go to when you have a break and you just wanna sit down and read a book and enjoy a nice cup of coffee.  Their coffee is strong and flavorful...I think it's better quality than Starbucks.  I also enjoy their pastries and their bagel sandwiches in the morning are yummy too.  They also have the best chicken and pesto sandwich.  This place is definitely worth a try if you're in the area and it's a nice homey place to hang out if you're tired of the hustle and bustle of your local Starbucks.", "author": "Leah A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-11", "description": "As many other reviewers have noted, the service here isn't just bad or slow... it's go-outta-my-way-to-vent-my-frustration-with-the-world-upon-all-our-unfortunate-customers bad. The guy who works most weekday mornings seems utterly overwhelmed by anything his job requires- from making a bagel to not mouthing off at customers (which he has yet to try). The food is mediocre at best, and if there's one thing you can pretty much count on, it is that they will be out of at least one ingredient in your order.", "author": "Chelsea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "I just started going to this coffee shop.  The coffee is good.  I havn't had the patries yet.  But I have been looking at the bagel and lox on the menu for a while now.  It had cream cheese, lox, tomato, onion, and capers.  The capers are what really sold me.  I HEART capers.  The only thing that stopped this bagel from being awesome is that everything was cut so thick.  I feel bagels like that everything needs to be thinly.  So I will try this sandwhich again and ask them to cut things more thinly if they can.  Stay tuned to see if their 4 stars turns into 5", "author": "Ishtar P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-07", "description": "I have yet to find anything here that isn't a 10 rating. Even something as simple as ice-tea is a treat. I come here at least twice a day for coffee, ice-tea and maybe a ham and cheese croissant or danish. The guys and girls behind the counter are super cool. Though I don't usually have time to sit and hang out there they have tons of comfy chairs to sit and chill out on.", "author": "Jc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "I just had the most awesome Chicken Panini sand which over here! Wonderful place and equally awesome management! Three cheers to the Roastery!", "author": "Mukul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "Fantastic little independently-owned cafe.  Their coffee is good, as well as their sandwiches.  The only thing I'm not a fan of is their hot chocolate.  Prices are decent, but depending on what you get you may be paying the same price as Starbucks.\n\nI've been coming here for about 2 years now, as I'm a student at a nearby school.  They offer wi-fi that's fast (well, maybe they don't offer it, but there's an open wi-fi connection running through the place), their customer service is good, and their food and drinks are great.\n\nAnother thing: the other week, I took a friend here and he started playing the piano (they keep a piano and guitar available for customers to use).  One of the employees there was kind enough to turn down the music so he could play, without us even asking.  Definitely earned some points with me.\n\nAgain, great place.", "author": "Joe A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-09", "description": "We stopped by here only because it's was close to where we where going today, and we where not impressed.  Drinks where weak, employees where not at all friendly, even a bit stand offish?!?!  I'm glad we didn't eat here...", "author": "C J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-29", "description": "I want to like this place since it is right around the corner from my office but seriously, I just can't.  I ordered a cappucino...meaning I want espresso with a lot of FOAM.  I did not order a latte.  But what I received was a latte.  I guess I will be walking the extra two blocks to Peet's on the regular now since I can guarantee that I will get an actual cappucino there.", "author": "Whitney H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-06", "description": "Nice alternative to the the chains. The \"Africano\" was just what I needed, 6oz's and packed with flavor. The dude behind the counter was super nice and recommended it.", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-05", "description": "Two stars for a terrible, acrid latte and a gloomy, slightly unfriendly atmosphere on both occasions that I've been to The Roastery. With so many nearby places to grab coffee and a quick breakfast, these guys might want to try a little harder.", "author": "Todd H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-14", "description": "The coffee is the smoothest I've ever had. Deep, dark and delicious. Perfectly roasted. Lattes are also fabulous. It's great when someone plays the piano or guitar. Wifi is always up and ready. Great panino. Longer hours would make for 5 stars", "author": "Brian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-06", "description": "I find it quite hilarious how poorly disguised Cafe Trieste is as the Roastery. Their coffee is pretty good, although it suffers from the San Francisco trend of tasting slightly burnt, and it's slightly expensive. It's fun to sit outside here and people watch; Academy of Art is across the street and full of interesting art students.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-07", "description": "I used to frequent the Roastery every morning for coffee and a bagel when I was getting my masters at Academy of Art. Today I was craving a bagel with jam so I walked an extra four blocks to my old stomping grounds. I waited in line for 10 minutes (no one was in front of me, the baristas just pretended I wasn't there). I ordered my plain bagel toasted with cream cheese and jam and waited another 10 minutes for it to arrive at the counter. When my order was called, they got it wrong, making the bagel on wheat instead of plain. I kindly told the barista that I ordered plain and he argued saying I did not and that I should double check my order in the future. Not my job. Needless to say I'm very disappointed and won't be coming back anytime soon.", "author": "Gigi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "Coffee is good, strong and dark, the food is alright, definitely better than in most coffee shops. However, the atmosphere and the people make the place great. I have spent hours in here waiting for friends to get out of class at AAU and watched many owners come and go and yet to my delight they have all seemed to keep the big piano, great music, and friendly baristas. Free wifi is amazing always fast and their comfy furniture makes it easy to spend hours there. One of the best places to pass the time.", "author": "Carolyn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-28", "description": "i actually really like this place. The employees are always nice, and they have a good selection. I'll often get their veggie bagel before work. But it can be kind of annoying that they have a $3 min on credit cards.", "author": "Tim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "they make a proper americano and espresso never tastes burnt. starbucks version tastes more like hot water than anything. pesto chicken panini is super yummy, bagels come with half a block of cream cheese which is otay with me :)   many of the reviews give it a bad rating for poor service , i cant say that has EVER happenned to me.   $3 min. for plastic.", "author": "Wei W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-05", "description": "Come here more and more, enjoyed the music they play most of time, love their free AT&T wifi 99% of time, which is fast and stayed-able. But I still don't like their coffee that much. Too roasted and over burnt, for me. Today, I ordered Espresso, surprisingly good! 4 stars for the Espresso with music, sunshine came through the window, and successful meeting worth to sit there for about 3 hours. The Espresso was smooth and works on me like a sec! Haha... don't make me wrong. It must be having normal amount of caffeine, well, maybe a bit more than normal in there for a regular coffee drinker, but for sure strong enough for the person like me maybe drink coffee twice a week, was super tired seconds ago. Anyway, at the same time when I asked for Espresso, since they have a $3 dollar min order required, I ordered a croissant with my ATM card. But when the bill came out, the Batista only charged for Espresso. I asked, \"does it include croissant?\" Maybe he forgot or maybe he's just being nice. \"Don't worry about it.\" He said. THANK YOU.", "author": "Flora F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-16", "description": "My first mistake was ordering a sandwich at a coffe shop, but I was in a hurry. So I order a panini, mayo only.  Although its well after the lunch rush, it takes the rasta gentleman working the sandwich area a full five minutes to even start on my order.  So ten minutes later, I get my sandwich and head back to the office to eat.  I get all the way back, open up the bag and not only is there no mayo, the thing is drowned in mustard.  I return for a refund, receipt in hand with the words \"MAYO ONLY\" clearly printed on it in large type.  The pretty goth with face piercings  working the cash register shoots me a glare and asks if I want something else.  Well, no I don't have another ten minutes to wait for a sandwich as my lunch break is over.  She rolls her eyes, and hands me my money.  I stand there for a moment, waiting for her to say something.  When nothing comes, I ask, \"So I guess I'm not getting an apology?  She stares blankly at me so I leave, never to return.  Having read some of the other reviews, I have to ask, Who hires these rude people? In these rough economic times, couldn't the owners find people who are actually thankful to have a job?!?", "author": "Tony C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-08", "description": "My carmel frappe was merely ice blended milk with the very slightest hint of caramel. I didn't notice any coffee in it at all. And after I drank all of the milk out of the beverage, most of the cup still retained blended ice, so it was really just like drinking plain old milk. As far as their other items on the menu are concerned, I'm sure they are far superior, I was just disappointed to spend so much money on a milk snow cone that I could have made at home. So judging on this one single experience, it gets one star. Aside from that, nice people seem to work there as far as I could tell. The food looks delicious, and if I had more money I would go back and try that.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "this place serves the best coffee ever. it's reliably strong (not weak or watery like most places). oh and it tastes awesome. the staff has always been friendly to me. they have an extensive menu that covers all kinds of breakfast and lunch items. they're the perfect cafe. thanks!", "author": "sarah p."}
