{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Such a beautiful place to hang out! My fiancé and I always wanted to take a photo under the bay bridge and we finally did! I love it here so much!!! Perfect place to go for a jog, walk, sightseeing, and so on.", "author": "Neloffer E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I walk to and from the Embaracedero Waterfront to work. To me, its a lot better than riding MUNI to work. Walking is much better than being in a crowded, smelly and around annoying people on MUNI. On top of that, I get my steps in a a good amount of exercise. \n\nWalking in the morning you its all business. People all walking, biking, skateboarding, ect to work. There are the runners who get their morning cardio in and considering it is staying dark in the morning I feel relatively safe. People just do their thing and you can just do yours. When I'm lucky I get get to see the sun rising and get some awesome views of the bay.\n\nGoing home, there are a lot of people (obviously). Depending on the time of the year, during Giants games it can get a lot more crowded. Still a better option compared to MUNI. One can time making his or her bus or BART train, rather than MUNI when God knows when that shows.\n\nI like walking along this waterfront. Get some exercise in before getting to work.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "In San Diego, we finally created a similar style food/market place like they have here in the  Embarcadero Waterfront by the Ferry Building.  The  Embarcado area itself is currently undergoing construction so there are barriers next to the ferry building.  It's a wide space but big enough for a long walk from the Ferry Building all the way to the AT&T ball park (home of the San Francisco Giants baseball team).\n\nNot much shade so bring a hat and/or umbrella on sunny, rainy or foggy days.\n\nOtherwise, it's nice to stroll quietly in fall or winter when tourists are not as in abundance.\n\nP.S.  The restrooms in the Ferry Building are clean so kudos to them for keeping it that way despite what I know could be with the current homeless situation in SF.", "author": "Melanio F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Training for a half marathon while on vacation and this is the 2nd time i've used the Embarcadero for my long run.  I start near Pier 39 and ran all the way to AT&T park.  As a woman running alone I felt safe and the view is great.  but a couple of warnings...if running on the weekend, try to start by 8am because it gets crowded and be prepared for some very awful smells.  (human waste was very prevalent in some areas)  As I was running I just tried not to look down.", "author": "Vinyasa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "Without question a tourist mecca, but is that a bad thing?  The Embarcadero Waterfront has an amazing collection of bars, restaurants, shops and views for days.  As I mentioned, it's a major tourist hub, so count on the fact it's going to be crowded; no matter when you go or what the weather is like.  Taking all that into consideration, you really need to swing by, even if it's only for a couple of hours.  There is just so much to see, do and taste that you'll be kicking yourself if you don't pop in.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "The Embarcadero has gone through major changes over the last 10-20 years. Thank God Red's Java hut is still there though....anyone remember a burger and a beer for $2.99??\n\nEver since the embarcadero freeway was torn down this whole area has become one magnificent viewing station for the bay, the bay bridge, and the east bay. \n\nThe public art is fantastic.\n\nThe Ferry building and the Ferry market place are fantastic.\n\nAll the restaurants that have popped up are pretty great (chaya, coqueta, slanted door, waterbar etc)....many have great views too!\n\nGreat for a run, walking the dogs or pleasant stroll.\n\nIf you are visiting our lovely little town please check it out!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "This was a great place to walk around take in the sights and eat awesome seafood. The trolley ride to the pier was perfect !!! \n\nIn n out is a must go to ! The burger was perfect from first bite to last licks !!!!", "author": "Isabel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "This place is the perfect weekend getaway for me. If I live nearby, I will be here every time I'll have a chance.\n\nUpon exit at the embarcadero Bart station, you will be greeted by the famous tram for transport or merely photo ops. From here, you have a choice of hopping on the tram, bus tour or by foot. We chose the latter to explore the entire area.\n\nWe started browsing at the flea market where you can find produce and crafts. I then headed to the ferry building at the port of San Francisco. The place is packed of local and tourists. There's a lot of eateries which all has long lines.\n\nAfter some picture taking, we explored all the piers where different activities are ongoing. The mood is very festive. Street performers are everywhere. There are open patios everywhere to enjoy your meal or even a cup of coffee.\n\nWe passed by the Exploratorium, the different ferry terminals and saw sea lions. Pier 39 is the busiest of all the piers. You'll find the welcome center at the second floor. \n\nNext stop is the fisherman's wharf, boudin bakery and lastly, ghiardelli marketplace. \n\nThis is my kind of place to hang around. So much to see and to do mostly for free. To fully enjoy it, I recommend taking Bart to avoid hefty parking fee, finding a parking spot and driving on very busy streets. \n\nI'll definitely come back to see sunrise by the bay bridge and sunset by the Golden Gate Bridge. That would be spectacular!", "author": "Cris I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "This was such a beautiful place to take a stroll and just hangout! The views of the bay are so nice and the sidewalks have been paved so nicely for jogging or walking. The Embarcadero goes from Fisherman's wharf all the way down to AT&T park. There are so many nice places to visit along the way -- FIsherman's wharf has a ton of tourist shops and seafood restaurants! There's also the Ferry Building that has as nice marketplace and a great view of the bay. At the end of the waterfront, you can also get to AT&T park, where the SF Giants play, and I'm sure there is a lot of buzz going around during game times. \n\nOverall, when the weather is nice and you have time, I'd definitely recommend bringing your family and friends and enjoying some time along the waterfront!", "author": "Austin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "We visited this spot after the Dee Young Museum and were looking for the Waterbar.  After mistaking this place for the Waterbar we decided to try it out anyways.  The hostess informed us that they had a new happy menu due to the tough economical times.  We were seated right away and were pleasantly surprised that they allowed my friend's 2 year old to sit at the bar with us.  The service was great and the bartender, Hal was awesome.  We ordered the $1 oysters, curry mussels, fries, and a small pizza.  The oysters were delicious!!!", "author": "Viet T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "We visited before the ballgame, and then caught the S Train to 2nd and King for the Giants game.  WELL WORTH the visit.  This is a fun, trendy little strip of shops and local eateries with an EXCELLENT variety of treats to try.  We hit the Cowgirl Creamery for some DELISH mac-n-cheese and vanilla milk.  Then, we stopped for some ice cream at Humphry Slocombe's (MUST DO!), and we picked up some bite-size cheesecakes on the way out.  Great little place on the water with a cool, old school ferry schedule with flips tiles as soon as you walk through the main doors!  HIGHLY RECOMMEND the visit.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "One great thing about Pokemon Go is that it really gets me to check out tourist-friendly hot spots I've been too lazy to visit for their own sake. I don't live in San Francisco, but have spent plenty of time there over the years. Never have I devoted so much time to the Embarcadero Waterfront as I did on a recent trip with my (also Pokemon-obsessed) mother.\n\nIt's a great place, as it turns out, a lovely walk by the water encompassing a nice range of San Francisco sights. The stroll is free and rich with municipal flavor, and there are always plenty of people around. The Ferry Building is worth checking out--I've been there a number of times, this last trip for a lovely lunch at Hog Island Oyster Co.--and I can't think of a more pleasant way to burn off some food tourism calories than a long walk by the water. We walked back and forth along the Embarcadero, mostly between the Ferry Building and Cupid's Spawn--a huge bow and arrow sculpture that's pretty damn cheesy but kind of sweet, and also a Charmander nest.\n\nBecause, of course, the Embarcadero is littered with Pokemon. You can't go ten feet without practically stepping on a flailing Magikarp. My mom and I decided to catch enough to evolve a Gyarados each, and succeeded.", "author": "Steph C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-23", "description": "The food was decent. The atmosphere and the ambiance of the restaurant was nice. I got the crudo scallops which I did not like (not my taste). The ceviche was okay.", "author": "Julian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "I love water.   Beaches, rivers even pools are good.  Water makes other things  better.\n\nYou know its true.  Sunsets nice.  Sunsets over the ocean, awesome.  Naps nice, naps by the river?  Better!\n\nSo here you have a nice newer San Francisco neighborhood.  Weather is usually better than at home.  There's a ball park.  CalTran station... And the bay. ...\n\nMore to do would make it better.  Nicer parks, museums.  That kind of thing.  So I am going with 4 stars.  This is San Francisco after all.   There is serious competition.  In most places in the USA it would be five.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "The inside of the Main Embarcadero Terminal Building has a whole bunch of really good places to eat and cool stalls.\n\nIf you don't want to drive all the way to Napa vineyards then there is a Gott's hamburger place inside as well.\n\nRecommended. \n\nIf you want to take a boat trip and tour to Alcatraz then you have to walk further down the boardwalk from the main terminal.", "author": "Christian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "5.5 Stars\nSeriously. Anyone who is hating on our waterfront also hates puppies, sunsets, and koala bears. The shear beauty of this world famous city and her waterfront - the Barbary Coast - makes the Embarcadero a special place. Yes, the aggressive pan handling does linger on the minds of merchants, locals and tourists alike, but the city has not addressed the issue with any meaningful net effect. So some reviews of that issue are indeed warranted. However, a morning walk or evening stroll through the Embarcadero is still a favorite pastime for those of us in our neighborhood as well as the millions of visitors to the City by the Bay. One should make a point of visiting the many places to dine and explore - especially the Exploratorium @ Pier 15, where we can all feel like a kid for an afternoon.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "TOURIST GALORE\n(4.5 stars)\n\nAlthough very beautiful, as a resident we try staying far away as possible. The over populated sidewalks of \"stop-go-stop-point\" tourists can be very annoying when you're trying to reach your destination location. \n\n-over priced food\n-tourist trap activities \n-stinky bay smell as if someone dropped a bomb\n-dodging tourists \n\nBUT... I enjoy my 5-6 mile runs here after work. The view is gorgeous. It's convenient when the office is just blocks away and the gym is steps from the water. The bay breeze and the stunning sunset gets the best of me. I do my running and thinking at places I can marvel at the scenery. I can run forever because my minds racing with constant thoughts. Dodging tourist as you get closer to Pier39 is the mark that tells you it's time to turn around and run the other direction. There's lots of joggers from all levels which motivates you to keep running. Random high fives from random runners screaming in your face \"happy running\" is a very welcoming gesture. \n\nRunning tip.\nStart at the picnic area near Brannan and run towards the stadium, loop around the stadium and run back towards the waterfront all the way until pier39 and back to where you start equates to 5.5 miles. The nice bay breeze helps cool body temperatures so you really aren't sweating as much as you really are. Winter time, it gets pretty cold and layers are necessary. If your ears are sensitive, good to have ear covers. \n\nHappy cardio running!!!", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Walking the Embarcadero is a great way to see the waterfront. It is a very nice, safe area that you can walk for a long way and enjoy the sights and sounds of the waterfront. We stopped here on a cruise and used the opportunity to experience San Francisco. True it is a tourist area but, that how it was meant to be used. I'm glad the locals are staying away, as mentioned by a previous yelper, it gives us tourists more room. I didn't think the prices were that bad nor did I think there was a bad smell other than seafood. What would you expect on a waterfront? This is a don't miss opportunity.", "author": "Richard F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Nothing but amazing views all around from the city it self to the little islands and the bridge. I enjoying walking here because you can visit every pier while walking all the way to fisherman's wharf if your feeling for some exercise. There's also lots of great places to dine around here ranging from cheap eats to superb fine dining. Lots of seafood restaurants, so it's a must to go get some raw oysters on the half shell while your in the area. The view at night is amazing since the new bay bridge has lights. Overall it's a nice place to take a stroll and enjoy San Francisco's amazing views!", "author": "Maybeline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Great walking path along the Embarcadero.  I like to walk down towards Pier 39, without actually going as far as that touristic hell, then turn around and walk down past Red's Java house just past the Bay Bridge.  Great views of the bridge, bay, and downtown San Francisco.  While I do stop into the Ferry building market on Saturdays, the market isn't all that for me.  But it is a good place to get some quick eats and continue walking.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "The Embarcadero Waterfront consists of San Francisco's northeastern stretch of shoreline starting from the south at 2nd St. in South Beach and running north, past the Bay Bridge and Ferry Building, to North Beach and Pier 39 (and eventually Fisherman's Wharf).  The waterfront's total distance is about 2.5 miles and is popular with runners, joggers, walkers, pet-owners, families, tourists, and panhandlers.\n\nWhen the weather is nice (in other words, not foggy), the Embarcadero Waterfront provides some of the best views of San Francisco Bay.  Best of all, it's free.\n\nI think the best views and pictures can be had on the strip closest to the Ferry Building.  When the Ferry Plaza Farmers Market is going on, there is quite a bit of activity and it's a lot of fun.  You can shop, try unique food and drink, listen to live music from local artists, or have a seat at one of the Ferry Building's restaurants or cafes' bay-side patios.  It's relaxing and picturesque.\n\nThe Ferry Building isn't too far from the Bay Bridge itself.  Therefore, pictures of the bridge (or pictures with the bridge in the background) usually turn out great.  If you walk towards the bridge from the Ferry Building, there's a long pier (Pier 14) which runs far out into the bay.  It makes for some additional excellent photo ops.\n\nThe Embarcadero Waterfront is easily accessible by foot and public transit.  If traveling by car, metered street parking is available directly along the waterfront.  There are also various pay lots (parking garages) available a few blocks west into the city.  You can check the Ferry Building's web site for details and directions to some of these garages.\n\nWhen you visit, remember to bring sunglasses, a windbreaker, and a camera.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "The Embacadero is a great place to walk.  The clear views of the Bay and the Bridge are impressive. To really appreciate the beauty of the waterfront this magical area needs to be seen on foot. \n\nBoats on the water, old dock buildings that still look as they did years ago on one side of the street, modern ones of the other side, lots of people walking around and cars whizzing by sure makes this an enjoyable place to spend some time.", "author": "Terry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "I've lucked out that on my recent five trips to San Francisco, we've just had glorious weather. And there is nothing more beautiful than walking along the Embarcadero Waterfront on a day that just screams LIFE IS GOOD.  My niece accidentally called this the EnBarkingDoggo place because there were lots of well-behaved doggies with their owners. Everywhere you turn, something delicious entices you and yes, it's touristy, but it's a feel good place. Enjoy!", "author": "Allie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "I'm a people watcher and a lover of walking.\n\nThe Embarcadero might be one of my favourite places. \n\nUnlike most of SF, it's flat. If you're not looking for a calf workout, walk here.\n\nWant beautiful bay views? Walk here.\n\nWant to run easily? Walk here.\n\nWant to people watch? Come here.\n\nWant nibbles? Pop into the Ferry Building.\n\nWant a beverage? Pier 23 or 14.", "author": "Kristin Leigh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "one word, b e a u t i f u l ...nice place 2 stroll, dine, do touristy stuff, shop, play, watch a baseball game or free fireworks show on holidays & special occasions, hop on a memorable bay cruise or take a Alcatraz tour or ferry across the bay, and more...frm pier 39 to the ferry bldg to the bay bridge w/ re-lit dancing lights to the ballpark (SF Giants' home where i used to work, incl world series '02), beyond & everything in between...even natives, like myself, visit often...esp since i heart bodies of water...LOTS of memories ovr the decades!!..\n\nmuch improvement a while bk...on the road, sidewalks (wider), transit (MUNI), restos (w/ bay views), attractions & all...even more commercialized... traffic can be congested on this strip at times tho...but enjoy one of sf's popular destinations/landmarks!...", "author": "Nettie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "Just in case you've stuffed yourself with a giant eggs benedict, I know a great way to burn some calories.  Take a walk around the Embarcadero Waterfront!\n\nOn this particular day it was sunny with a few clumpy clouds.  We walked to the edge of a pier.  Myself and another photog stood there and took some photos of the bay and the Bay Bridge.\n\nAs I stood there and the light breeze was rustling my hair, I had the feeling I was being watched.  I scanned the water and floating there with the biggest eyes was a seal.  I believe it to be a harbor seal.  It was a fun sight to see.\n\nYou'll also get to see quite a few homeless people that mostly keep to themselves.\n\nIf the weather is just right this a wonderful way to spend the afternoon.  It's also wont cost you a penny to enjoy either.", "author": "Ivy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "One of the nicer waterfront strolls out there.  Definitely a must-see if you're a tourist.\n\nI can't believe there used to be a double-decker highway running along this stretch of the city. Must've completely ruined the view.  Guess good things do come out of earthquakes sometimes.  *cough*\n\nThere are shops here and there, and also a couple of museums.  If you're going to hit up Alcatraz, the booth is also here somewhere.\n\nThe stroll itself is maybe 2km, and can be cleared in an hour or so.  Enjoy your time here.\n\nAs others have mentioned, it's a great place to people watch and clear your mind.", "author": "Edward L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Sitting at the dock of the bay... watching the tide roll away.\n\nOoooooooooooh\n\nSitting at the dock of the bay... wasting time.\n\nNow I understand why Otis Redding wrote a song about the San Francisco Bay. He knows what's up and I'm about to tell you exactly how it iz. \n\nSay whaaaaaat?! Ouuu gurl, you don't even know.\n\nFirst of all, the word Embarcadero is derived from the Spanish verb, embarcar, which simply translates into the word embark. \n\nHere at Embarcadero, you almost feel as if you've embarked upon something pretty darn amazing.\n\nEmbarcadero encompasses AT&T Ballpark, the Rincon Center, Cupid's Span, the Ferry Building, Fisherman's Wharf, Pier 39, Pier 14, the Bay Bridge, and also stands as a magnificent backdrop for the Financial District. \n\nYou can easily become mesmerized by the ferries, sailboats, cruise liners, and even the cargo ships that pass through the bay waters here throughout the day, each and every day. \n\nAccompanied by the cooling bay breeze, this is the perfect place to snuggle up on that romantic date or to layer up for a fun excursion. \n\nFor those of you who absolutely love scenic views while exercising, there is plenty of room for those who enjoy to cycle, run, jog, or take leisurely strolls down the waterfront. Not to mention, the array of Michelin rated restaurants lined along the piers, locally produced farmers showcasing the freshest of ingredients, and also the various special events that take place here such as America's Cup, multiple marathons, and even charitable fundraisers. \n\nLet me break it down a bit more. At one point, The Embarcadero Waterfront was one of the busiest areas of foot traffic in the WORLD. Only the Grand Central Terminal in NY and Charing Cross Station in London were just as busy. With that said, the waterfront was kind of a big deal. During WWII, The Waterfront was a military logistics center and was a major contributor to the Pacific region. \n\nThe Embarcadero Waterfront, since then, has now been recognized as a historic district and is proudly one of San Francisco's finest attractions. \n\nWith such a rich history, it's no wonder that people from all around the world seek to visit its alluring waters. \n\nSoooooooooooo...\n\nAs I sit here at the dock of the bay... \n\nI don't mind wasting my time.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "Came here with the family last Sunday around 5PM. The location is obviously awesome with a beautiful view of the Bay. Service was great. Our waiter was on point with everything and very helpful. I had the Brussels Sprouts chips as appetizer, and that was so good that I ordered 3 more! As entree a got the Sea bass (photo) which unfortunately, was really bland.  If I had to rate that dish alone I'd give a 2 stars. This makes you skeptical as to what if the other entree dishes are also bland. If I ever return, I'll definitely try something else. All dishes came out pretty quickly, which is worth mentioned.", "author": "Crosley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "San Francisco is Embarcadero is a fantastic place for a stroll. Locals interests both will have a fantastic time walking from market Street down to Pier 39 or in the other direction toward the ballpark.\n\nThe situation changes daily. Sometimes you'll find cruise ships more DeLong the Embarcadero. During fleet week it'll be packed with sailors.\n\nOn an average work day locals and tourist walk together seeking food and transportation.\n\n watch out for the occasional high speed bicycle that last past you.", "author": "scott h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "If you get a chance to walk in the area, do so! \n\nSuch a beautiful place to soak in the sun and scenery. We decided to walk along the waterfront after we had dinner. The sun was still setting and we took great pics with the bridge as our background.\n\nWhen the sky is clear and the sun is setting, this is when to take the perfect pics!", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Great place to window shop, eat food, shop, and watch the boats go by. So many differents stores and places to eat. Would highly recommend!", "author": "Patricia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "This a lovely place to stroll on a sunny/cloudy/anytime type of day! \n\nIn fact I was down here last at 5am a few weeks ago when I had severe jet lag and thought it was time to get out and see some cool sights and some sunrises. \n\nYou could carry on walking for ages but I'd suggest heading down to one of the main boardwalks left of the Ferry building which has great views of Treasure Island and also the wider bay area. \n\nThe Ferry building is the main feature point down here - with everything like tasty restaurants, coffee shops, cafes, deli's and more making it a great place to meet friends or chill out. Great views of the bay again from the restaurants facing the water on the back of it. \n\nCheck it out!", "author": "Jonny Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "Shops!\n\nNeat little places, something for everyone here. \n\nit's a great walk from Market & 5th if you are up for it.  The gradual decline isn't hard on the knees as you head to the water front.  And it's quite worth it when you see all the neat shops!\n\nBe Aware! While sitting on the benches out front, while the husband was taking a call, I was approached by a monk (Not sure what kind, I thought Hare Krishna, but could have been some other..) who placed a rosewood bracelet on my wrist and gave me a blessing card.. then wanted money. I had no idea how to refuse as she's already GIVEN me the things. .. I gave $10.. she wanted more.. THE HELL.  I didn't have much more..", "author": "Dianna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "One of the best things to do here is go to the Embarcadero and go in the Ferry Building. Then try Cowgirl Creamery, Hog Island Oysters for sure! Go just down the street and have ceviche at Lamar Restaurant. Or Back at the Ferry Building try The Slanted Door Restaurant. Weekends go there to enjoy the home spun feeling of the Farmers Market.", "author": "Kirk M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "This is one of my favorite spots for hanging out on the rare sunny weekends that San Francisco gets. They have a farmers market on Saturdays and it makes for great people watching entertainment.  This place rocks during sunrise because you can get a view of the Bay Bridge with a beautiful backdrop of a colorful sky. It is totally safe to walk along here, even at night, because there's tons of tourists taking a leisurely stroll. There are also joggers that run up and down the promenade all day long.   It also stays relatively clean and I see city workers wash the walkway regularly in the mornings. \n\nI have to dock the Embarcadero waterfront one star because there were a few occasions when it was really smelly.  On some mornings, when I do an early jog, the promenade smells like some giant sea creature died nearby.  The stench is so foul that it's hard to jog/run because every time you inhale you want to gag.  After you get a substantial whiff of a decomposing mermaid, here comes a bunch of trucks and buses that spew toxic gas in your direction. Sometimes your lungs and nose need a break from these fumes.", "author": "Shirleyanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "Of all the places in Everybody's Favorite City to get a workout, this is the most scenic.  I think it's also the most popular.\n\nGavin Elster of \"Vertigo\" might have lamented that things that spelled San Francisco to him were rapidly disappearing.  But the view to the east is one thing that is unlikely to disappear.  Some piers may change their flavor;  a few have disappeared altogether.  But the Bay Bridge still soars impossibly high over your head.  Yerba Buena Island still looms from a distance.  Many of the pier fronts still hearken from a few generations ago.  The seagulls still fly.  The Ferry Building still chimes and the ferries still stop here.  The ships still sail, as do the sailboats.  And it's all in your unobstructed eyesight, just across the wide boulevard from the rest of The City.\n\nNo wonder people go here.  Financial District workers take a stroll here during their lunch break.  Active types jog and ride a bike.  Tourists get their pic taken at the open space south of the Ferry Building.  Kids run after the birds.  Some make a detour onto Pier 7.\n\nA bit of trivia is that this walkway actually has its own official name:  \"Herb Caen Way...\"  Named after one of the most powerful men in San Francisco history;  he wrote for the Chronicle for over 50 years.  Loved Vitamin V (vodka), hated pigeons, unapologetically nostalgic, had a fetish for spelling and grammar, had a wicked wit and a penchant for puns, was loyal to his Royal typewriter, and displayed an undying devotion to San Francisco.  Caen could build or destroy a local business with just one item, coined words like \"beatnik\" and \"Baghdad-by-the-Bay\", and was credited (blamed?) for getting his best friend Willie Brown elected mayor.  Fitting, then, to name SF's greatest waterfront walk for her greatest newspaper writer . . .\n\nMe?  When I worked on Market Street, I would gladly walk the 15 minutes to get to a bench at the Ferry Building, near Pier 7, or on 7 itself.  I spent many lunchtimes there.  And I wonder what song the Ferry Building bells will play at 12:00 today.  As for lately, one of our family Christmas photos was taken at the tourist spot written of above.  My daughter jumped from box to box near the Java Cafe.  All in good fun, sometimes even with good weather.\n\nJust do it.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "Need to clear your head?  Walk along the Embarcadero.  It's cheaper than therapy.  \n\nNeed to get something yummy to eat?  Walk along the Embarcadero.  I dare you not to find something you like.\n\nNeed to work off that yummy food you just ate?  Walk along the Embarcadero.  You will get passed by an insanely fit 70 year old marathon runner.\n\nNeed to watch the Bay Bride Light Show?  You pretty much have to walk along the Embarcadero.\n\nNeed an excuse to not walk along the Embarcadero?  Too bad, there isn't one.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-31", "description": "I'm from LA....and I can't hate. This is probably one of the nicest spots in the city. The last night were were in \"the City\" my friend mysa decided to take us here. \n\nIt was one of my top 3 things to do in SF before we headed back down to so cal. \n\nThe feeling you get when you're here is impeccable timing for life decisions and much needed meditation. Take a walk down to the ferry station and on the backside you'll see a bunch of cool little restaurants that quite possibly be ideal for a random drink. \n\nIf you have a significant other, take them there...its really nice and the cool thing about the new bay bridge is that it lights up with different patterns to fancy your attention.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "For Review #300, I thought I would write about one of my favorite spots in San Francisco:  The Embarcadero Waterfront.  I've been riding my Trikke around here for the last 6 years.  Everytime I ride is it's always been a different experience, but the view of the bay has always been beautiful!!\n\nBecause it's a long strip of flat land, you'll always find many joggers, bicyclists, free-runners, and Trikke riders like me weaving through the crowd of FiDi workers during the week and tourists on the weekends.  It's definitely a mixed bag of people that visit there everyday.\n\nThe Embarcadero ideally connects many neighborhoods which makes for an awesome walk:\n\n-From the South end you have SOMA which has AT&T Park, FarmerBrown's Little Skillet, and Red's Java House.\n\n-The heart of the waterfront has the Ferry Building and the FiDi along with Pier 23, TCHO, Teatro Zinzani, and Fog City Diner.\n\n-And at the North end you have Pier 39, Fisherman's Wharf, and Ghirardelli Square with gems such as Buena Vista Cafe and Tanguito.\n\nYou can literally use The Embarcadero as your expressway to experience the best of what San Francisco has to offer whether you're a tourist or a local.  So many stops along the way you can literally spend a whole weekend covering each part of it.\n\nIf you're ever around The Embarcadero and you find me riding around on my Trikke (http://www.yelp.com/user_photos?selected=upYRyyDLMpoweNoyORPtNQ&userid=F_5_UNX-wrAFCXuAkBZRDw), please feel free to stop me and say hi or \"I saw you on yelp!\"  See you there!!!", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "We were seated at the bar since we made our reservation just an hour earlier.  The hostess offered to let us know if there was a no-show table became available.  The bartender served our cocktails quite promptly.  There is a beautiful view of the Bay Bridge ftom the bar.   Within 20 minutes,  the hostess kept her word and sent a server over to the bar to carry our drinks to our table.  The front end of this restaurant runs smoothly.\n\nOur dinner server was very patient and answered our questions about the fish offered on the menu that evening.  We ordered the Tilefish and the Alaskan Halibut.  They were perfectly cooked and the garnish choices complemented the fish nicely.  We saved room for a dessert to share.  I recommend the chocolate sundae.  The manager checked on each table and helped expedite the food.   \n\nOverall, this restaurant deserves 5 stars because it is an example of teamwork in sync.  This is the key to having happy diners return again and receiving referrals.", "author": "Sparky D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "The embarcadero waterfront is one of my favorite things about SF. Walking along the pier reminds me of the summer nights spent walking along the piers in Manhattan... except it's SF and it's actually wintertime here. A beautiful reminder that the weather in the Bay is constantly spring/autumn, and what a blessing it is to live in a metro where that is the case all year round. It's also relatively bum-free, so you won't feel haggled or wary of any randoms approaching you. \n\nThe waterfront view is the perfect remedy for when you're feeling a little low on inspiration. The only downside: parking. Beware of hefty parking tickets, even on a Sunday. Your best bet is to park a few blocks away, closer to Battery St. and Sansome St.", "author": "Diana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "I always love coming here! The skyline is just gorgeous and always sets the tone for a great night on the town. It's a shame everyone else seems to think the same thing. Is it me or is this place getting more and more crowded every night?\n\nI don't mind sitting close to perfect strangers when I'm gossiping with my best friend or trying to get my buzz after a week of sitting in an office.\n\nAnyways, great cocktails, cute waiters, Oh and did I mention the view ? Of course I did. As long as they've got that stunning view and good drinks, I'll be a regular for years to come!", "author": "Ruben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "This is the first time I've ever gone to the farmer's market in San Francisco. I absolutely loved it! It was a bit cold but that's neither here nor there. I wish we had farmer's markets in Las Vegas. This is definitely a place I will be visiting again.", "author": "Ana A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "The Embarcadero is absolutely beautiful.  As a tourist, walking along it was one of the best ways to see the amazing views (both of the bay and the city!).   My boyfriend and I walked from the Ferry Terminal all the way to Pier 39 and it was a blast.  We took tons of photos, admired the water views (Alcatraz!  Golden Gate!  Bay Bridge!), watched the sea lions, and interacted with some of the locals.  We wandered through some of the different buildings and areas (Ferry Terminal, Alcatraz loading area, Fisherman's Wharf) and I was impressed by the design of the buildings and the general layout of everything.  It all felt so open and very focused on the beauty of the surrounding water.\n\nTraffic is horrible along here, so avoid driving it.  Besides, you really only get the full effect of the Embarcadero's awesomeness by walking it!  We took the BART in, which provided super easy access.", "author": "Sonya L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "when i lived in sf, i used to run along the embarcadero all the time, esp if i needed a flat, long run.  this walkway stretches from fisherman's wharf in north beach, clockwise, down towards the ferry building, and ends at south beach, near at&t park.  it's a great way to get your exercise in and go sightseeing since you will see fisherman's wharf, pier 39's boardwalk, the exploratorium, the ferry building, pier 14, rincon park and its famous bow and arrow, and south beach park.  of course, while you walk/stroll/run, you will have a gorgeous view of the bay and the bay bridge.  i highly recommend coming here if you're visiting sf and most definitely recommend running here if you're training for a long distance event.", "author": "Ellen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "They should just call this place the Bay Bridge waterfront or Pier City. Most places with this many piers is an actual port, not a tourist attraction, but thought there are many piers they are not all equal. Some are giant with shopping, others are small and gungy. For the most part they get better as you go North from the Bridge, but bring your walking shoes as this is miles when you end and back.\n\nSo rumor has it the Golden State Warriors new stadium will be built on piers 30/32. That should totally boost revenues. \n\nLots of classic peninsula skylines, historic images and super popular restaurants are spackled randomly through out the piers, but 39 tends to have more shopping and is most popular. Great views of the light show on the Bay Bridge running through 2015.", "author": "Walter M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "Located away from the fisherman's market and all the tourists. The Embarcadero Waterfront is a great place to mingle with the fancy finance peeps of SF as they stop into the Ferry Building for their artisanal food runs.\n\nThe view of the Bay Bridge is lovely on a bright sunny day. Walking along the waterfront and finding an empty seat to plop down on and enjoy your Ferry building food finds is highly recommended. It's a quieter area of waterfront and much more enjoyable to pass the time here than at the tourist filled Fisherman's market.", "author": "Oulie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "When I have friends that visit San Francisco, well.. I'll take them to The Golden Gate Bridge first.  But next on the list is definitely The Embarcadero.  \n\nI feel very fortunate to work in one of the most beautiful areas of San Francisco.  You have the AT&T ballpark (home of the SF Giants), the Ferry Building (lots of great restaurants, shops, cafes, and they have a Farmers Market on Tuesdays and Thursdays.. I think there's one of the weekends too?), a ton of delicious restaurants that run all along the waterfront (all with amazing views of the Bay), and towards the end of the strip, you have Fishermen's Wharf and Pier 39.  \n\nThe crowd is a good mixture of professionals that work in the Financial District (right where all the tall buildings are) and tourists.  There's definitely no shortage of delicious restaurants in the area, but of course, they can be pretty pricey too.  \n\nTraffic is horrible, so don't drive if you plan on visiting the area.  Take the Bart and hop off at the Embarcadero stop (the last SF stop before you cross the Bay into Oakland.. dun dun dunnnn!!  just kidding :)  )\n\nOh yeah, and the waterfront is a great place for jogging too!  So bring your dogs and roller blades out and get active!", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "A nice scenic walk.  Plenty of meter parking available when we stopped by.  Plenty of great photo opportunities if you're traveling with your family like we were... :)", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Superb views of the SF downtown and bay bridge. It could be somewhat shady at night and often we see unclean areas plus homeless people (which is expected I suppose). But definitely a good place to chill with many coffee places and restaurants in walking distance", "author": "Jay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "There are great views of the bay, Willie Brown Jr Bridge (Oakland-San Francisco Bay Bridge) and the east bay from here. Most people don't know that walking along the waterfront is open to the public, and there is a walkway starting  before Pier 1. A lot of people get caught up walking along the Embarcadero road, which is crowded with tourists, joggers, families, Taxis, Ubers, etc. Very congested. Just step toward the Bay a bit more and enjoy a nice walk along the water, with spectacular views.", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "My fav place in all of SF. You can often find me walking from ATT Park all the way to past fisherman's warf AND BACK. I'm a big embarcadero girl, especially on warm days. Makes you appreciate the loveliness that is SF.", "author": "Lucky N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "I've been around long enough to remember driving along the old Embarcadero Freeway. I'd get on at the end of Broadway and that big ugly roadway would take me to I-80 and points beyond. I even participated in a bike ride on the top deck, which was closed for the occasion. Then the 1989 Earthquake happened and opened up the waterfront view. The result is a gorgeous promenade, a revived Ferry Building, Pac Bell Park at one end (Go Giants!), and stunning Bay Bridge accented water view that I would have never previously imagined. \n\nAnd here's today's Historical Footnote: \n\nThe Embarcadero was constructed atop an engineered seawall on reclaimed land, and derives its name from the Spanish verb embarcar, meaning \"to embark\". During World War II, San Francisco's waterfront became a military logistics center; troops, equipment and supplies left the Port in support of the Pacific theater. Almost every pier and wharf was involved in military activities, with troop ships and naval vessels tied up all along the Embarcadero. \n\nHowever, after the completion of the Bay Bridge and the rapid decline of ferries and the Ferry Building, the neighborhood fell into decline. The transition to container shipping, which moved most shipping to Oakland, led to further decline. Automobile transit efforts led to the Embarcadero Freeway being built in the 1960s. This improved automobile access to the Bay Bridge, but detracted aesthetically from the city. For 30 years, the highway divided the waterfront and the Ferry Building from downtown. It was torn down in 1991, after being severely damaged in the 1989 Loma Prieta earthquake. \n\nA sculpture, \"Cupid's Span\" by was built in 2003 along the Rincon Park area. Resembling Cupid's bow and arrow with the arrow implanted in the ground, the statue symbolizes the place where Tony Bennett \"left his heart\". Mine too.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "I love the Embarcadero. The first time I ever visited SF I saw a guy walking a llama along the Embarcadero. I knew from then on it was a magical place.\n\nThe Embarcadero is one of the few places in SF that is actually FLAT. That might be why I like it so much. The other benefits is that it's beautiful and a great view of the bay.\n\nOne great place to stop is the Ferry Building. This is must visit for tourists and locals. There is so much great food here.\n\nMy FAVORITE part of the Embarcadero is Cupid's Span by Claes Oldenburg & Coosje van Bruggen, also known as the giant bow and arrow in the middle of the grass. It's a must see and a great piece of art. I love that it mirrors the color and the architecture of the Golden Gate Bridge. It also refers to \"I Left My Heart in San Francisco\" since \"Cupid's arrow\" is pointed directly to the heart of the city.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-28", "description": "In recent years, they've added some cool sculptures along the Embarcadero to spruce the place up. there's good walking, people watching and bench relaxing. If you're a local, it's a nice place to walk up and down if you have a lazy day to kill. There's kids skateboarding, panhandling bums, and people training for marathons along this stretch- you'll see it all. \n\nLocal Insider Life-Saving Tip: Do not, under any circumstances, go here for New Year's eve to watch fireworks. Every crazy person is out in full force and I felt very unsafe being out here. Don't even think about taking BART to and from unless you want to pray that you don't die from the scary, shady underground that comes up for New Year's to watch fireworks, then fights when it's time to go home on BART.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "The waterfront is so pretty. I walked across the street and took pictures on the trolley lane, and also by the fountains. Then we strolled along the waterfront, looking at the random stuff selling on the sidewalks and just enjoying the weather. \n\nIt's a beautiful summer day in SF and we just killed time while waiting for my friend to go to an interview a few blocks down.\n\nThe fountain is an above ground sewer. At least I thought it was until someone told me it was a fountain.  It's really awesome and artistically great. The architecture is fun and I loved the pictures that came out...but there are flies, the water is dark, and the structure is rusted. I still climbed all over it and took pictures though!", "author": "Debby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Always a beautiful view! The air is so crisp here too...love it! Regardless of the weather, its always a beautiful sight but my favorite type weather to see here is a clear, sunny day.\n\nReally, it's just nice to walk along the Embarcadero Waterfront and get some sight seeing in. Along the way there are little informational plaques with history of the area. Don't pass them up, they have interesting facts! Always nice to know the history of the location.\n\nThe Bay Lights have definitely added some magic to the night! Check them out before they are gone! I went with my husband a couple months ago at night and was able to just park right up the street for free and relax and watch the bay lights. Definitely a must see if you are visiting from out of town.", "author": "Cristina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "one of my favorite places in SF to run whether its day or night. Nothing like people watching and also looking at the water for a peaceful stress releasing run.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "The Embarcadero is super easy to get to. You can take the BART down to one end by the Ferry Terminal, which in itself is a beautiful building, and walk all the way down to the Wharf. Great views of the city and the water. It's not super seedy, if anything there are droves of tourists walking along with you you. They also have the retro street cars that run the length if you'd prefer that which is fun to ride.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-27", "description": "Yeah, I like to wear my aviator Ray-Bans and polyester-blend shirt unbuttoned to my bulbous navel - strutting the wide sidewalk in my platform shoes along the Embarcadero waterfront. Does my hair look good?\n\n\"Well, you can tell by the way I use my walk,\nI'm a SoMa man - no time to talk.\nMusic loud and asphalt warm, I've been kicked around\nsince I moved here.\nAnd now it's all right...it's OK.\nAnd you may look the other way.\nWe can try to understand\nthe Embarcadero for this man.\n\nWhether you're a brother or whether you're a mother,\nyou're stayin' alive, stayin' alive.\nFeel the city breakin' and everybody shakin',\nand we're stayin' alive, stayin' alive.\nAh, ha, ha, ha, stayin' alive, stayin' alive.\nAh, ha, ha, ha, stayin' alive.\"\n\nHey Ferry Building!...Lookin' good, man!\nHey Bay Bridge!...Don't let that Golden Gate steal your thunder!\nHey AT&T Park!...Batter up, dude!\nHey T-Line!...Whoa!...you're on time!\nHey Bow and Arrow going into the ground!...Uh, whatever!\n\n\"Well now, I get low and I get high,\nand if I can't get either, I really try.\nGot the wings of heaven on my shoes.\nI'm a dancin' man and I just can't lose.\nYou know it's all right...it's OK.\nI'll live to see another day.\nWe can try to understand\nthe Embarcadero for this man.\n\nWhether you're a brother or whether you're a mother,\nyou're stayin' alive, stayin' alive.\nFeel the city breakin' and everybody shakin',\nand we're stayin' alive, stayin' alive.\nAh, ha, ha, ha, stayin' alive, stayin' alive.\nAh, ha, ha, ha, stayin' alive...\"\n\nOUCH...OUCHHH!...LEG CRAMP!! LEG CRAMP!!!!\nSomebody help me...anybody??\n9-1-1...please!\n\nOK, here's my favorite use of that song...\nhttp://www.youtube.com/watch?v=82zrU3971DM", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "My 1000th review goes to my favorite spot in all of SF.  Where I go to mediate and figure out the pattern of the Bay Bridge lights!  There are a lot more people walking around at night and taking photos because of the lights.  It's a great place to take tourists and visitors since they love watching the lights and it's easy to get to.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "my favorite favorite place in the city. morning runs, afternoon walks, evening strolls... it's always gorgeous! also packed on the weekends, especially if it's sunny and warm out (which is most weekends.. :))", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "I truly love fast walking along the Embarcadero. Great place to exercise for \"FREE\" while enjoying beautiful SF Bay Scenery :)", "author": "Merly I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-05", "description": "I had a business lunch there. I would put a four for the food (but I only tasted the Caesar salad. The overall grade is a three because the service was extremely slow. We waited almost 20 minutes to order and even after that our waiter was not very effective.", "author": "Joanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Randomly wondered in here for a drink and was super impressed with the view and the atmosphere. It's quite busy so a reservation would be advisable.", "author": "Tanya A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "One of my favorite places in the City :] I've walked down these piers in rain and shine, and well.. it definitely is NOT very fun in the pouring rain, but well the company made up for the rain that day. There's tons to see around here - people jogging, the piers, vendors, touristy places, more local places, and.. LOTS OF FOOD!!!\n\n... I love it. Being so close to the water is always nice, and the waterfront provides much better scenery than blank walls at your local gym. Just saying.\n\nOh, and the little walk at the end of the Waterfront has been dubbed by my high school econ/gov teacher as The Romantic Walk. Try it someday - especially around sunset. You'll figure out why we named it so. :)", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "I think my new favorite thing to do while traveling is to go for a run in the cities that I'm visiting. With places as scenic and convenient as the Embarcadero, I can't imagine it being any easier.\n\nAfter checking into my hotel in Union Square, I took up a suggestion from a local colleague and put on my running shoes, headed up Market Street up toward the Ferry Building, and turned right and headed toward the ballpark. Along the way, I enjoyed the clear blue skies, the beautiful weather and refreshing sea breeze, the bridge stretching over the water, the wonderfully intriguing giant bow and arrow sculpture, the America's Cup, and the home of the Giants. Running along the Embarcadero was like a crash course in SF-sightseeing for a visitor like me, and a good, safe and easy flat run besides. \n\nI had to cut my run much shorter than I would have liked to make a dinner appointment (and I'm supposed to be tapering anyway), but thanks San Francisco for a beautiful 4 miles along the Embarcadero. I live in downtown LA, and I am thoroughly envious that you all have such a beautiful, safe and convenient place to run in your backyard whereas I have to drive a ways a way to reach similar conditions, or else constantly wonder if I'm going to one day be jumped or hit by cars in my backyard.", "author": "Mel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "I love running along the Embarcadero.  There are a number of reasons for this . . . which I'll get to . . . but perhaps the most practical reason is that you don't have to worry about dodging (much) traffic . . . Nor should you have to worry (too much) about being San Francisco's next pedestrian roadkill.  Unless you start on the Embarcadero itself, you may have to run down a busy street (like Market St., like I do) . . . and there is the occasional car entering one of the piers or other entry drives that cross over the Embarcadero.  However, for the most part a run on the Embarcadero itself removes dodging (much) traffic from the equation.\n\nNext, and perhaps just as importantly, there are the awesome views of the Bay to enjoy from the Embarcadero!!  I am writing this Yelp review primarily from the perspective of a runner, as this is how I personally choose to most regularly enjoy the Embarcadero.  However, there are countless ways to enjoy the waterfront views as well as San Francisco's skyline, which many walkers, bicyclers, various \"rollers\" (bladders, skaters, scooters . . . and even a few Doobie rollers), . . . plus dog walkers, stroller-pushers . . . well you get the idea.\n\nMy usual route is down Market Street to the Ferry Building, then South down the Embarcadero, passing under the Bay Bridge, past several Piers, down to AT&T Park, which I circle, passing by the statues of Orlando Cepeda, Willie Mays, Juan Marichal, along McCovey Cove, then past the Marina, and return the same route from whence I departed.\n\nYou may find yourself S-curving a bit to wind around the swivel-headed tourists who are also on the Embarcadero . . . but, hey, they're entitled too, as this is a place for everyone to enjoy . . . and you may also have to resist the temptation of stopping for a seat on one of the benches to enjoy Otis Redding sing \"Sittin' on the Dock of the Bay\" on your iPod . . . but other than that , I think you might just agree with me that running the Embarcadero is perhaps San Francisco's #1 choice of location for a recreational run.", "author": "Joel E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-21", "description": "A great walk outside to kill time. Good views, lots of stuff to look at. Would aimlessly stroll through again to kill time if the need ever arises again.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-19", "description": "I just keep running.. Made it here to watch the World's Cup Yachting 2012 in my CITY!!  Go NINERS!!", "author": "Jsphn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "Really, it's like a 3.5 star place, but I just can't justify rounding up.\n\nThe service was great and the food was good, but for the prices we paid and the portions you get, it's just like the other Embarcadero restaurants...somewhat overpriced but decent.\n\nWhen you order crab cakes for $16, you'd assume you'd get 4 or so...nope.  You only get TWO!  They're really good, but damn, that's $8 per crab cake.  I'm pretty sure you can find something comparable for less anywhere in SF.  The DAT burgers looked so good, both my gf and I got them.  We usually don't order the same thing, but we had to this time with American Kobe.  Again, it was very good, but honestly, I can't tell the difference between a Kobe burger and a very good Angus or whatever burger.  So much of the quality of the beef is lost when you grind it up I think it's just a way to make a more expensive menu item.  I'm not knocking Waterfront, it's a general statement.  The fried calamari was good, but their take on butternut squash soup was...interesting.\n\nI think this would be a decent place to take out of town visitors with it's fantastic view, but honestly, I'd have others on the top of my list.", "author": "Dylan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "On Thursday night at 8:30pm, three friends met at the Waterfront and the red carpet was rolled out. Anna, one of the managers made this a very special day for our friend's Birthday. Peter (the bartender) made the most amazing drinks all night and we feasted on crab salad, calamari and cioppino. Each item was prepeared just right...not to saucy, not too rich...just right (as this goldilocks would say).\n\nAt the end of the night a platter of desserts appeared out of thin air, and how can three women ignore that? Throw in the terrific view of the place that many leave their heart, this was an evening to remember.\n\nAbout $250 for three.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-06", "description": "I have always long talked a lot of crap about The Embarcadero, Pier 39 and Fisherman's Wharf due to the fact that I didn't like how jam packed, expensive and overly touristy it can get.  \n\nNow days, I've come to accept that although it does have all of these qualities, it should be distinguished by its even better qualities:  the lovely stroll, views of the bridges, views of Alcatraz and San Francisco Bay.  The Embarcadero waterfront and all of its nearby attractions have come to grow on me and it really can be a fun place to be.\n\nSo for anyone who has heard nothing but bad things about it, check it out.\nFor those who have been and can't stand it, I beg you... rediscover it!", "author": "Jared O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "Start at the ballpark, walk down to Pier 45... along the way, make a pit stop at the ferry building for some blue bottle coffee. Meet a friend for lunch.  Check out the local artists @ Justin Herman Plaza.  Be inspired by the cool and some quirky art along the way.\n\nBe glad you live in such a gorgeous City.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "It was my day to treat myself during a week of business in SF. I booked a message and then tried to get a dinner reservation. The keys for me were seafood, nice meal, and a great view. The only place I could get a last-minute reservation was the Waterfront, and it wasn't until after the booking that I read the reviews on this site. I was nervous as I headed out to dinner, but it turned out there was no cause for concern. Things were great from the first minute to the last.\n\nI got a warm greeting and was taken to a table on an enclosed patio. The view was amazing! The service was attentive without being hovering or intrusive. I appreciated that the bread was presented two or three slices at a time so that it was always warm and fresh. The water glass was refilled any time it headed to half-full.\n\nThe waitress, Sabrina, was a true gem. She made excellent suggestions (this woman knows her way around pinot noir) based on my comments about what I liked. She also offered some nice additional touches that were options not listed on the menu. It's great meeting a fellow foodie who truly enjoys their work and is willing to go the extra mile to make sure the customer has a terrific experience.\n\nI enjoyed two moist and tasty crab cakes for the appetizer followed by a plentiful bowl of good clam chowder. Dinner was a very large portion of excellent scallops seared and served with a variety of sauces on the side. I also ordered the mashed potatoes with crab meat.\n\nDessert was a sampler plate of five selections. Having heard me mention that I'm not a fan of fruit, Sabrina brought me a plate that was a lot more focused on the fabulous world of chocolate.\n\nAt the end of the evening the Waterfront had a towncar at the door. Jesse (jesseslimo@earthlink.net) was great, and we worked out a deal for a one-hour guided tour of the city. He was well-informed, thoughtful, and funny.\n\nAll in all this was a truly wonderful evening thanks to the folks at Waterfront!", "author": "George M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-29", "description": "Farmer's Market on Saturdays is not to be missed!!! Could not believe the huge selection of produce, meats, fruits, flowers, food stands, and much more... it was so hard to leave.  We tried several goodies and still dream about the day we ate our way through the market: korean tacos, strawberry lemonade, smoked salmon sandwich, tuna lox sandwich, pig rind, pig in a blanket, carrot orange juice... it was the perfect foodie day.", "author": "Ally W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Tourist-laden.  Overpriced concept restaurants.  Does that mean it's not worth a stroll, hot dog or snow-cone in hand on your way down to Fisherman's Wharf?  Exactly.  Check it out.", "author": "Stephen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-27", "description": "if you are in san francisco on a saturday and don't go to the farmer's market at the embarcadero you are missing one of the best things the city has to offer.\n\nin my years, and there have been many, i have never seen such an eclectic gathering of fruit, vegetable and other food items - a large portion of which are organic.\n\ni also have to mention all the food booths.  you can eat your way from 1-side of the market to the other enjoying heavenly tidbits of joy from all over the world.  \n\nwhat a wonderful way to spend a saturday morning.  i would travel to san francisco just for this excursion and would readily recommend it to anyone.", "author": "Mike Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "There's something magical about this place. \n\nOn some mornings on my way to work, I look out the window of the T-line train and catch a glimpse of the auburn sunrise against the Bay Bridge - and my heart skips a beat. On some nights, the cries of passing seagulls, clanging of train bells, and distant ferry horns create an urban symphony of sounds. \n\nJog,\nWalk your dog,\nEnjoy your lunch on an empty bench,\nBreathe in the salty air,\nTake in the scenery,\nWatch the sailboats drift across the pale grey water...\n\nIt's places like this that make me fall in love with my city over and over again.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "I love walking around the Embarcadero! Seriously, if I lived in the city I'd run/walk around here all the time. \n\nActually, I wish I had a dog to walk around the waterfront. \n\nIt's such a great place to get some exercise while enjoying the ocean. \n\nPlus, there's a little somethin' for everyone. Don't wanna exercise? Pig out at the Ferry Building or the various waterfront restaurants spread out across the Embarcadero. If you'd rather watch someone play, AT&T Park's your place. \n\nI also love how flat it is, definitely one of the flattest places in the city. Probably the reason behind why everyone loves running and biking out there. \n\nThe amazing view of the Bay Bridge is nice perk as well. There aren't too many places in the Bay where you can get a bridge view that nice!\n\nNot that I'm advocating doing illegal things, but I love jaywalking across the Embarcadero. It's like a real-life game of Frogger! Except the part in front of the Ferry Building that is...", "author": "Constance C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "If you live within an hour of this, you are incredibly fortunate. We have so much to be thankful for in the Bay Area. This is a clean, spacious stretch of shoreline dotted with businesses, joggers, tourists and views of bridge and bay. It's a nice place to go if you have someone visiting because the Ferry Building is there and there are many options from that area. Get a Blue Bottle or something from Mariposa and just stroll along.", "author": "Helen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-08", "description": "I come to The Embarcadero as often as I can. I love the open ocean. I love the endless sky. I love the sound of laughter from other people or the sound of a jogger passing me by. What I love most is all the restaurants I can walk to for delicious food. It is quite peaceful here. Sometimes a bit too breezy, but often sunny. Relaxing here for a bit with no care or stress about anything else in the world. When I look all around me, I am in awe of everything. When I close my eyes, I feel like I am on a cruise ship sailing away. With the gentle breeze whispering into my ears and the sweet kiss from the sun... Perfect. Calm. Contentment.", "author": "Anji W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-12", "description": "It's about time I say something about the Embarcadero, I frequent this a lot.\n\nI run here.  I would start at Van Ness down to the ball park and back.  For longer runs, I make a left on 3rd street and hit the Mission Bay.  \n\nIt's such a visual entertainment, I would almost not mind having no music blasting on my ears.  \n\nYou pass by many interesting people, the runners, the couples, the families, the cyclist, the roller bladers, the dog walkers.  Yesterday, there were several monocyclist on the street.  Other times, cool vintage bikes parade this street.  The pier, the water, fisherman's wharf,  Ferry building, the ball park - so much to see and entertain you.  \n\nI've taken people here as well just for strolls and what not.  A lot of good vantage points for photos - the bridge, the buildings and the sculptures.  Access Alcatraz tours here and you can visit another famous SF landmark.  Or watch a show at Teatro Zin Zanni. \n\nI've also acted like a tourist one time and rode the service bike - pretty cool!\n\nI love the (expensive) restaurants here.  You pay for the view, right?  Whether you dine during the day or the night time, the views are just spectacular.  And did I mention it's a good date place?  \n\nAhhh I heart SF!", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-04", "description": "I love this place during the day. Except for when it's raining, the weather is pretty cooperative resulting in a great open area to breathe some fresh air, bask in the beauty the Bay views have to offer, go for a walk/jog/bike and get some exercise, sun or melatonin, or just grub along the waterfront on some fresh catch. \n\nThere are also some great spots to crab and fish if you don't caught (I mean, or so I've heard *nudge nudge*). And the homeless people were some great conversationalists back in the day, the nice kind that lived along the piers, not the scary creepy druggy kind. Back in the days we would crab around midnight, drink and play cards while talking to homeless people \"like it was the thing to do\".\n\nThe waterfront offers so much to see and do especially for tourists (which I don't really mind), but on game nights, weekends, and after-club hours it just gets annoying to have so many of these non-locals traveling from other parts of the Bay Area (or even further away), invading my city crowding up the streets, causing traffic and taking up parking spaces... it kinda gets on my nerves, I mean, if you have to cross a bridge to get here, you're doing too much for some nightlife. Just move here and save us all the headache, I mean, why do us locals have to suffer the consequences of their visit, it's not our fault they live in a valley out in the middle of nowhere. But it's their added business/revenue that helps this City thrive I guess. But still... grrr... \n\nAnyhow, in short. I love this place during the day.", "author": "Joraine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-29", "description": "Food was decent, price really killed the dining experience. \n\nVery VERY nice view of the bay bridge and the bay!!", "author": "Amiee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-11", "description": "Waterfront = \"...a part of a town that borders a body of water.\"  Activity, commerce and nature all-together along this SF waterfront. What's not to like?  This beautiful shoreline is quite remarkable considering what this area used to look like about 25 years ago.  The fugly since-torn-down Embarcadero freeway was literally a \"Great Wall of China\" eye-sore that was a physical barrier that obstructed views and brought noise and dirt to the area. Merchants along Chinatown, North Beach et. al. complained that the freeway was necessary to direct shoppers and visitors to the area. Nonsense then, comical now. People and business will find a way if your destination point is worth going to. You can walk, run/jog, cycle, drive or do nothing but eat and drink and stare off into the warm haze. Perfect.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "This is a partial review. Let me explain why. \n\nI have never really explored this place entirely. \n\nI have never spent more than 45 minutes here, I've been here twice. \n\nMy first time I came and sat near the waterfront on the bottom deck, the benches were rather clean but watch out for the pigeons! My lunch counterpart said that they will attack so I was weary around them but I really wanted to feed them... still speaking from the first time, we walked through here and saw many.. MANY eateries.. I can imagine myself being obese if I let my appetite do the living... \n\nYesterday was my second time here and since it was rather sunny out, he took me to the top floor, still overlooking the waterfront as we ate in peace (nobody around), the view of the ocean was lovely, our sandwiches from Deli Board was to die for, and when it was 12 o'clock, the clock started chiming.. we both checked in and he took a picture of the clock.. though the signal on the top deck isn't that great. \n\nThis place can be and I'm sure it is always a bustling place to be during lunch or probably for dinner too.. it's a perfect date spot if you plan to dine there or pack your own lunch.. aww.. how romantic. \n\nAfter lunch we shared a long hug and started our journey back.. he had to go back to work and I had my walking about to look forward to.", "author": "Tram N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-26", "description": "One of the few touristy spots in SF that I actually enjoy going to (even on subsequent visits).\n\nThere are a lot of restaurants and a lot of things to do here or around here. If there's an open-air farmers market meeting up here, then I'd really urge you to go.\n\nIf you're driving in the Embarcadero, good luck--the traffic around this area is always terrible.", "author": "Kenny O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "Awesome place to run! I start at Auga Vista Park and I run past the \"Ball Park\", into the Embarcadero past The Ferry Building and into Aqautic Park. If I feel strong, I will run up into Fort Mason and onto the Marina green.\n\nOne day I will make it all the way to Fort Point.\n\nThe San Francisco Marathon goes thru this route. \n\nLots of runners, joggers, walkers. Busy place especially when its warm and sunny.\n\nLots to gaze at!!!!!!!\n\nSouth Beach is beautiful!", "author": "MacKenzie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "Absolutely love the SF waterfront! So much to see, do, and explore! Excellent spot to take photos just walk around and enjoy the Bay. Bring your camera, go for a run, walk around, check out the piers, stores, and restaurants, it's hours of fun! :)", "author": "Akvile D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "I'm going CRAZY... as in I cant stop thinking about this place kind of CRAZY!\n\nForever ago I used to frequent SF like it was my backyard. And yes, it really was kind of like my backyard. The weather is hit or miss but even with the overcast morning, by noon it was getting brighter and hotter. There were things up and down the waterfront that kept me wondering things and pondering old things. There were tourists, a texas tourism exhibit, a trick roper hog tying a lil child on the pavement like a young calf, Slanted door has  a to-go option, birds, wind and the refreshing ocean breeze. \n\nIt was a great day to walk, and enjoy all that life had to offer. The farmers market was a treat to check out as always. The piers were the perfect instant get away from the madness that was city life and all that it entailed. The pier was long enough to immerse one self in the ocean without getting wet while being surrounded by the sights but instead the smells and sounds of the sea left me with nothing more than my innermost thoughts. And if you're lucky, you'll be able to find more of yourself and like who you found.\n\nI did...\n;D", "author": "John-Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "This is my favorite place when I'm looking to have a peaceful/relaxing night in San Fran! The cocktails are amazing! The view! Of that view! It simply melts my heart just staring into the water! What a treat this place is!", "author": "Helen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-13", "description": "PROS: You're literally \"sittin on the dock of the bay.\" It's a nice touristy location and I love the Farmer's Market and the view while I run when I used to live nearby. \n\nCONS: Working near pier39, this is not the place to drive. Traffic is pretty bad because everyone wants to slow down and stare at the view, but it IS San Francisco, and it wouldn't be if there wasn't any traffic. \n\nBUT come here during the still of the night, after a night of clubbing (or drinking) with some good company and you'll know why people leave their heart in San Francisco:)", "author": "RoseMichelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-26", "description": "One of my friends used to live off of Howard and Spear so we often used to walk the Embarcadero to eat and drink at Gordon Biersch pretty much every time we visited.  \n\nI always thought that the palm trees that line this stretch felt out of place and those together with the Cupid's Span sculpture would be more at home in San Diego.  \n\nSD's home to prominent literal statues.  Like sculptures of engagement rings, the ribs of ship hull and 25 foot recreation of the Eisenstaedt vj day kiss photo.\n\nThis stuff aside, the back drop of the Bay and Bay Bridge is nice when it's lit up at night.", "author": "Darren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-24", "description": "The ocean, people watching, and lots of history  encompasses this waterfront. Old rundown piers, a biker bar, the ferry building, tons of restaurants and the witness of a guy whipping it out and urinating in the water were a few of the many things on a perfectly temperate and semi sunny day.  Ahh, the Embarcadero makes for a great leisurely stroll.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "Ahhhh!  The waterfront is such a beautiful place to be a native, local or tourist.  It is just wonderful to exist here, to experience it, to discover it, to return here time and time again.  It is never the same twice yet gives San Francisco it's world class popularity and beauty.", "author": "Rebecca B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "Very pretty from a sailboat on the Bay!", "author": "Devo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-18", "description": "The cleanest natural district San Francisco has to offer. A mixture of tourist, city workers, and regular people that are out here.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-16", "description": "I am in heaven when i am here. this part of town really is sunny much more than the rest of town. it's gorgeous. it makes me love my life and appreciate that i grew up here in san fran. a wondrous city.\n\ntake a walk and see the many smiles and faces. youll spot many joggers too going for an afternoon run. and doggies. \n\nthe view of the bay bridge is wow.\nSan francisco, thank you for these beautiful locations. you can really fall in love", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-14", "description": "Are there lots of people and crowds?  Yes.  Is it worth it to trudge through everyone to see the views and stroll along the waterfront?  You bet!  Sure I'm from out of town and could be pigeon holed as a \"tourist\", but look locals, you have a gem on your hand with this waterfront.  The Embarcadero is larger then Baltimore's Inner Harbor and prettier then San Diego's waterfront areas, not too mention the amazing temperate climate in San Fran.  I was lucky enough to be here by chance during Fleet Week.  Of course it was crowded, but it is amazing to look over the bay at the Blue Angels, Navy ships, Bay Bridge, Alcatraz,....", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-01", "description": "Sometimes it can be a little smelly, but aside from that, what's there not to love?\n\nAn old time favorite of mine, beginning in my teens, I used to run this a lot and still do occasionally. I like to park by the stadium and run down to Pier 39. It's the flattest distance to run in the city.\n\nNow, I do not recommend this run if you are going with hungry newbies! They will want to stop off to get goodies and eats at the pier/wharf and totally ruin your caloric intake deficit with their goody gluttony! Yes, it's hard to resist when those around you are satisfying their binge eating, and you are a recovering foodie! Oh, the torture!", "author": "Ladi Da A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-04", "description": "Not impressed. Tiny, tiny portions. Not much of a menu. Crabby, rude waitress. I had the warm Maine lobster salad. It was the size of maybe a side salad. It was all cherry tomatoes. Boring.\nPositives: Nice view, nice location, good bread.", "author": "Kelley D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-29", "description": "I am really really glad this oldest part of the city has been modernized to where it is now. The views are great, the place is clean. The streets are traffic managed so there are few traffic jams. It is a great tourist attraction that makes me proud of San Francisco. \n\nI love strolling or power walking along the waterfront. Somehow the people you meet are mellowed out and looking at the sights. The tourists are like children, gazing in wonder at the great scenery. There are plenty of places to eat, get a snack, and plenty of (pay) bathrooms. It is fun to watch ships go by too. \n\nSome of the reviews for this site are for a restaurant, which has me a little confused. I am reviewing the 2 mile stroll along the piers.", "author": "Nancy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-03", "description": "There's nothing really to say about this place as only feelings can explain the The Embarcadero Waterfront.  \n\nSeemingly when people say they've \"left their heart in San Francisco\" they probably really mean at first sight of SF, typically when crossing the Bridge over into SF.... whether the Bay Bridge or Golden Gate Bridge, first glimpse of SF makes your heart palpitate!\n\nIt's a beautiful, scenic, and boastful yet short waterfront/coastline we have.  You can see the East Bay, some islands, and Marin from the Embarcadero.  \n\nWhether a stormy and gloomy day or a bright and sunny day, you will never see or feel the same thing each time you are in this part of SF.  \n\nIt's cool to see tourists, locals, and commuters all mixed together in a really tight geographical area.... with all walks of life (including pets) who use the Waterfront.  You can see boats, airplanes, and people all in once place.\n\nAnd there are old and new offices thrown in the mix, the sounds of the Cable Cars ringing their bells, and the sounds of mobile phones going off, it's really the mixture of old and modern, and where Asia meets Europe.  \n\nWe are so privileged to have not just a beautiful city such as SF, but also a great waterfront!\n\nAND right now as I'm typing this, I'm watching the news streams of THE SF GIANTS PARADE FOR OUR 2010 WORLD SERIES WIN AGAINST THE TEXAS RANGERS!  WOO HOO!  \n\nTalk about love for the City By the Bay!", "author": "Allen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "This was my only tourist spot on my to see list. Since we could not find the Bart....damn you again droad navigation...we walked. After conquering the hills of death we fell into the deadly tourist grips of fisherman's wharf....fail. ate at the pier....smh...then hours and hundreds of people later made it to the embarcadero. I love me some grilled cheese and even though I was full on average overly priced fish I was down to get my tastebuds on one. We were to damn late.......the food hoarders had arrived and were waiting. Pretty much ever place there had 20 plus people standing to get their hands on some goodness. Some probably did not even know what they were waiting for. These types of people are proffesionals when it comes to waiting in lines,most likely the same ones who wake up at 1am to hit black Friday sales and camp out to see the Twilight Saga. Me....I say F it, only line I wait in is high quality beer and bathrooms! \nEmbarcadero...we will met again grilled cheese in hand!\nOhhh I loved the farmers market!!!! If I drove up there the ride would be full of flowers,produce,and 21st.", "author": "Carolyn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "When you go to the Waterfront, just know that you're paying more for the ambiance than the food.  The place is spacious, appropriately lit, has a spectacular water view.  Perfect for a quiet and romantic date.  Unfortunately, the food is just okay and pricey.", "author": "Angel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "I really like it when spiders show up from out of nowhere.  Yes, they do scare me when they appear on my skin or close to my face, but they're really beautiful in their strangeness, and most of them aren't venomous.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-16", "description": "let me just start by saying after almost living in SF for four years, i've only recently discovered anything east of van ness. i'm glad the embarcadero is now my \"back yard\". it's perfect for a sunny stroll or late night strolls to clear your mind of life's bullshit. \n\nif you walk far enough to the ball park and swing a left to the end of the pier, you might even see families out late at night crabbing with a grill and all. or you might see some old couple holding hands and reminiscing about their lives together thus far. awww...how warm and fuzzy. other than that, it's a great place to watch hot sweaty men jog shirtless. come on, how can you not love this place? \n\noh, right...the view of the bay is pretty dope too.", "author": "Sally T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "It's always fun to see the old pictures of what the waterfront used to look like, when it was a working wharf. I found a whole wall full of them yesterday on a stroll around the Pier 5 complex, All these fancy restaurants/cafes/shops have replaced the stevedores, 'steam mules' and hemp ropes of the old docks. Now, one Pier 4, three vessels which serve Hornblowers Cruises sit at moorage, bobbing ever so slightly. I spoke to one of the employees about the Santa Rosa, which turned out to be the oldest of their fleet. He told me it used to ply the bay as a passenger/car ferry back in the 30's. The San Francisco Belle, which lies behind the Santa Rosa, is a replica of an old steamboat, having been made in 1994.\nThere's all these little nooks I had not seen before and the public promenade makes it easy to walk out on the piers to take in the Bay Bridge and the ferrys which come and go from the Ferry Building. There's plenty of historical markers along the way along with the photos as well. A healthy, historical stroll which doesn't cost anything !", "author": "michael s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-08", "description": "I used to run the Embarcadero every day when I lived in SOMA. Now I run it occasionally. The best time to get out there to run or ride a bike is in the morning in order to avoid dodging the tourists. Unless you want to hit up on some eye candy like joggers. *wink wink* Then, your best bet is to get out on the Embarcadero in the afternoon or evening and shake your groove thang to get noticed. \n\nI used to love running the Embarcadero on Saturday or Sunday mornings because then I can stop over at the Ferry Building for a nice cup of joe at Peet's and get some fresh pastries or fruit at the Farmers Market. It's also a great place to people watch on a sunny day.\n\n\"Shake your groove thang, shake your groove thang, yeah yeah...\"", "author": "Liz K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-07", "description": "Do I love the view of the Bay Bridge and worship the fresh aquatic air around the Embarcadero? Sure!\n\nBut I also think this former stevedore haven has become polished to the point of uselessness.\n\nWhither the dockworkers? Whither the excitement of watching ships come in to a flock of waiting workers and family members? Whither the frenzy and filth and overall thrill of an active port?\n\nIn other words: Where da fuck are da fuckin ships?!?\n\nNO ONE seems to have noticed that the former docks are now lifeless and lacking. Oooooh, golly, I can watch some South Beach condo owner jogging! Oh, boy, I can see that cute secretary's tits bounce as she walks her dog!\n\nFuck that.\n\nThe Embarcadero is a symbol of all that represents gentrification. Nice natural views. No surprise or life. You'll have to seek fresh excitement elsewhere.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-19", "description": "Women rise up and complain to the management here about the HORRIBLE wailt for bathrooms!!!   \n\nOtherwise, it is a fun place, especially for rich people.  The Farmer's market is really great--esp the pork sandwiches.", "author": "Jorah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-11", "description": "I was here about a year ago - Thanksgiving'08 - and I still rem this place for its charm! Friendly staff, excellent food, fabulous location & view of the pier, reasonable prices, ... the works! Our waiter took some lovely pics of us - I told him to consider photography as a 2nd career; he brought out the best (& smiley-est) in us! We ordered some roast meat, grilled salmon, prawns & calamari & their famous burger for my friend who still swears by it as the BEST burger she has EVER had! Even the fries that came with the burger were SUPER!\n\nThey're right there on the pier/docks, semi-open, and I'm sure some people might appreciate the fishy smell as adding to the ambiance, given their lake-side location & predominant seafood menu. Yet, I'm not a fan & its the one reason I give them 4 stars as opposed to 5.", "author": "Lil' Chef F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-21", "description": "A dining experience at the Waterfront is a bit like being pecked to death by a chicken.  Bring your patience, not your appetite (or anyone you really like).  Seating is slow.  Initial service is slow.  Getting your entree is slow.  Getting the check is slow.  And in case you're not sure, no, your waiter doesn't really care that you are there. All I will say about the food is that it doesn't nearly meet the standards established by the fantastic view.  In fact, it doesn't meet the standards of a view of an abandoned lot.", "author": "Dayna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-26", "description": "They did the place up nice for Christmas dinner. The dusk lighting, the decorations, the cold outside...it all made for a lovely holiday ambiance. My daughter and I arrived for dinner, parked the car and went it to take our table. We were upstairs and the view was lovely; right on the water. We passed on the prix fixe menu and went ala carte.\n\nI started with a Belvedere martini (super dry, up, twist). Since my daughter doesn't drink I perused the wine-by-the-glass menu and was rather disappointed. The wine list is not particularly exciting but the individual glass options were poor. I stuck with my martini and it was done perfectly. On to the menu.\n\nI started with a half dozen mixed oysters. They were fresh and the mignonette was great. For the main course I had the pepper-crusted tuna and my daughter had the Char with crabmeat mashed potatoes. She loved hers and I loved mine as well. The tuna, very rare, was cooked perfectly. For dessert we split a chocolate fondant. Lovely again.\n\nThe food was very good. The wine list so-so. The ambiance was lovely. The service was fine but somewhat lacking in personality (on Christmas) and perfunctory. All in all a very nice experience.", "author": "Gary C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-16", "description": "Went with my father and sister here on Sunday night with the Dine About SF deal. The inside looks very nice, but we didn't get to see much of it since they put us in the outside/tent dining area. There are heaters strewn about here and there but you should still bring a jacket because it still can get cold (ask me how I know). We had a view of the water, TI, and the bay bridge.\n\nNow on to dinner - here's where points started to go down\n\nStarted off with some appetizer bread which was served warm and tasty. You only get one or two slices per person instead of a bread bowl, but occasionally the server will come back and bring you another slice. Along with this I chose to get the ravioli, which was amazingly good except you only get 3!!! I wolfed it down and waited hungerly for the entree. My sister got the salad but she didn't think it was all great.\n\nFor the main course I chose the steak. Here I was surprised. You get 10 or so thin slices of steak, served with french fries. Pretty fancy I know. I was hella laughing. You even get a fancy knife to cut up the steak but there's no reason for it since the portions are tiny. It was good steak, but I was definitely surprised and was expecting something more classy or traditional, not french fries.\n\nAfter main course there was a pretty long lagtime for us waiting for desert. It was about 15 minutes of us waiting by the table. Me and my dad really don't talk much so it was hella silent. Not sure if this is normal for the restaurant but that wait sucked. All we got were three scoops of sherbet, not really sure if that takes 15 minutes...\n\nDesert we all chose the tri sherbet. Mango and green tea were nice, but the lemon one was extremely sour, like 10000% proof lemon. \n\nConclusion: Ultimately you're paying for location. While the food is tasty, it could be better if the portions were bigger. Desert left a sour taste of the experience. From the time we came in to leaving it was about an hour. Definitely would of been faster if we got desert quicker", "author": "Irvin David U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-25", "description": "Beautiful and romantic, a waterside table at this fine restaurant makes for a lovely evening. \n\nI certainly would be drawn to more \"fun\" restaurants; the Waterfront seems like a place my parents would go to. \n\nOverall, you can't deny the location or the service.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-12", "description": "My family came here for Mother's Day Brunch.  It was a selection my sister suggested, but we really didn't have much options due to the lack of time we had to make a reservation.\n\nWe were able to get in a party of 10. The view and the restaurant itself was gorgeous. We had a beautiful day out and everyone (even my lil' niece) were in good spirits.\n\nWe were seated by a kind gentleman that promptly took our drink orders. I have to admit, not getting a drink order off the bat is a huge pet peeve for me, so I was glad he was on top of it.\n\nEverything was going well until we took a glance at the menu.  There were a limited amount of dishes that seemed \"brunch-like\".  Most of the dishes that incorporated eggs, were just served poached.  (Which I have to admit, can be a tad bit boring).  So, even with 10-12 items to choose from, the whole party of ten ordered amongst the same two dishes: The crab cakes with poached eggs and the filet mignon with poached eggs.  The nine dishes came out and out of the nine orders, only one had eggs that were not overcooked.  I don't mean overcooked by just slightly, but all the eggs were hard poached; which sort of defeats getting poached eggs in the first place. On top of the egg-error, the \"filet\" looked like little pieces of left over steak. When the server stated the filet was sliced up, I wasn't expecting it to be side bits from trimming the New York steak they served. \n\nI won't be going back here to dine, but I do thank the server that took care of us. He was very nice and if it wasn't for him, I don't think we would have left a tip.  \n\nI haven't dined here for dinner, but if the quality of the food is like this on Mother's Day, I can confidently say I will not dine here on a regular day.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "This is my #1 ABSOULTE FAVORITE place to go running! From here to the Golden Gate Bridge (a little past Chrissy Field Beach) and back is a little over 10 miles.  This trail is absolutely breathtaking & nothing short from BEAUTIFUL. \n\nYour run starts off overlooking the Bay Bridge. Gorgeous view! You pass all the cute little restaurants & Farmers Market stands at the Ferry Building. Next up is the crowded path through the Wharf/Piers. It's like a video game duckin and divin and moving left to right, all to avoid tackling down tourists and even the locals alike. Past the pier, you head towards the right of Ghirardelli Square, through the little beach where you see people changing into their wet suits to swim. You change your music to something a little louder and upbeat, to help get you through the higher incline hill that leads you to Fort Mason. As you run from Fort Mason to Chrissy Fields, you see people cheering at tiny-tot soccer games and kites soaring right above you. You head through Chrissy Fields, another beach, and finally take a break underneath the Golden Gate Bridge. This is where you stretch, then sigh in a nice deep breath of air as you oooooh and awwww over the glorious sight of our pretty red bridge... who cares if there's a little fog above it???!\n\nYou've reached the half-way point by now and accomplished 5 miles. You head back through any which you want, but best believe the views are far from boring. When you get back to the Ferry Building you'll have reached 10+ miles. This trail is good for running alone, running in a group, and even better running w/ good friend(s) that you enjoy yapping with.  After running for this long, you deserve something good to eat. FYI, there are lots of good eateries at the Ferry Building. Go ahead, indulge!!\n\nRunning along the Embarcadero is a SERIOUS MUST!! :)", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "If you love food this is the place to be. Great specialty shops and good restraunts at the ferry building and a beautiful place to stroll and take in the ocean.", "author": "Art B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "We drove through the waterfront on a clear and sunny day.  There was a farmer's market that I would like to try going to next time.  Across the street were more than a dozen vendors selling items from their white tents.  Very cool.", "author": "Cathaleya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-21", "description": "overall 3.5 stars. no real complaints/criticism.\n\ncame here for DAT and the up was the gorgeous view of the bay bridge. though we didn't sit inside, there was definite old charm to the place. \n\nshe had a bouillabaisse which looked decent.\ni had the hangar steak, which i thought was even better than the one i had earlier in the week at the CIA (napa). \n\ncauliflower soup was a bit on the bland side. \n\ndessert was only ok. something with raspberry couille. so if it wasn't really memorable, i can' exactly bump this up to 4 stars.\n\nservice was decent.", "author": "Milly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "Had dinner here on a Sunday evening. Whenever I'm out of town I look to Yelp for restaurant suggestions. My colleague and I were able to walk in without a reservation, and although the dining room was looking full, we were immediately seated at a table on the enclosed patio. Although the menu was a bit pricy, the service and the food were both professional and proper. The fire and ice raw oysters were perfect. My colleague had the seafood pasta and I had a mesquite grilled swordfish with a side of grilled asparagus. Great ambience, beautiful view, solid service, and good food make this place a sure bet for a wonderful meal.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-20", "description": "The interior is not as fancy as I would have expected with it's location and name...The Waterfront.\n\nCame for lunch.  Again, had the calamari and crab cakes which were good.  Tried their dungeness crab sandwich, which, while good, tore up the roof of my mouth.  The bread was toasted to a crisp.  It was also a bit messy to eat.  Others in my party had fish and chips, which came out on a huge plate with a bed of fries, and some salads which looked like salads.  \n\nNothing special.  Wouln't come back for lunch - don't know if I would come back for dinner.", "author": "Violet C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-02", "description": "The view is all this place has going for them.   Where should I begin?\n1) walking in you notice the passe decor and the lack of local presence.\n2) as you sit down (which it better be a sunny day on the patio)  you will notice the amateur service.  long wait to even be greeted when there are only a few people there at 5:30 on a tuesday.  \n3) then when i order a glass of pinot noir, i am brought (several minutes later by a bus boy) a glass of pinot grigio.  then when our server returns, I tell her that i ordered pinot noir, she says (with attitude), no you ordered pinot grigio.  no- i didn't because i don't really drink white wine.  (i realize that on this rare warm day in the city it would be intuitive to get me a glass of white.  it is not the mistake that bothered me- it si the fact that she argued with me)  \n4) then the meal.  fillet.  still wondering if it really was fillet.  to me it tasted like a sirloin that i threw on my grill at home without any seasoning.  bland.  completely forgettable.  so many better places in the city where you can dine with a decent view.", "author": "Kari P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-23", "description": "Love it, Love it, Love it... never a dull moment. If you trying to shop around or just take a nice stroll but not feeling so state park like? Go to the Embarcadero Waterfront.. Sooo MANY things you can do.. from just your daily work out, grabbing some organic Peaches at the Farmers market,  or  jus doin a little site seeing.. This is the perfect spot to inhale  San Francisco and just take in the diversity of literally everything from food, drinks and People.. a MUST do if you visiting SF.  I do it just about Everyday!", "author": "Analynn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-30", "description": "I love the Embarcadero; it's an easy walk, it's quite interesting, esp between Piers 3 to AT&T Park and there are great restaurants (La Mar) along the Waterfront. Of course, the Ferry Building is the highlight", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-02", "description": "Worst service ever with waiter ridiculing! It took 1 1/2 after meeting with the manager. The waiter said the chef would not change any of his plates like no beef on burger? Hello? Do not enter to this horrid less bring your family to this embarrassment!", "author": "Eddie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "Want an amazing and cheap weekend getaway?\n\nStep one:\nGrab sanwiches, bottle of wine, couple of glasses, blanket and something salty/savory as a snack.\n\nStep two:\nGo to grassy area under the big Bow and Arrow and lay claim to your patch of ground.  Shoes off, sunglasses on.  Enjoy the view and people watch.\n\nStep three:\neat drink and be merry until the wine kicks in.  Then nap.\n\nConclusion:\nCome away so relaxed you can barely walk (and not just because of the wine).", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-08", "description": "Horrible service! I will not go back to this place again, they really bugged us.\n\nWe came in for Happy Hour Specials but never got the menu for it. The snooty waiter said that \"they don't do that anymore\". I had checked out the menu the day of, it was listed on their website. Of course the regular menu had the higher prices for drinks and food. We walked out.\n\nAs we got out outside, lo and behold the \"Happy Hour Specials\" posted till 7pm, it was just before 6:30. I walked back in and pointed that out to them strongly! 3 people came forward and tried to apologize and get us back in. The manager said it was his fault, he told the waiter not to serve the happy hour specials because they were \"too busy\". It was not wall to wall people in there. If they advertise Happy Hour Specials, then honor it, not pick and choose if it's a good time or not/or make more money. In this hard economy right now, businesses need the customers, but if this is the way people are treated, forget about it.\n\nWe went to Slanted Door instead, no Happy Hour Specials but better food. It's the principle of it.", "author": "Cristina V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-19", "description": "so much potential...\n\ndisclaimer: no brunch menu on the weekend but lots of choices for a seafood lover.\n\npros:\n1. the view was lovely.  \n2. the outdoor area was wonderful on a sunny day.\n3. the bartender as well as the host were very warm and friendly\n4. valet next to the restaurant.\n\ncons:\nthe servers did not understand our orders - we had to repeatedly ask for our drinks.  once we got the bill when we asked for the dessert menu.\n\nfood:\n1. the oysters were ok though one was questionably green so we decided not to eat it.  there was no small spoon to serve the mignotte.\nthere were two varietal and no explanation of where they were from.\n2. the lobster risotto - the lobster claw was overcooked and rubbery.  the risotto was rich and creamy  - though it was a wee heavy with parmesan.\n3. the roasted crab was good.  the spices were soaked into the meat so there was no need to dunk the meat into the sauce.  it comes with garlic noodles which were ok.\n4. the apple tart was not great.  the crust was soft and it was a soggy mess.\n\nif they can improve on the table service and adjust some tweaks to the food then they would have a solid competitor with all the other waterfront restaurants on the embarcadero.  for now, there are too many choices at the same price range.", "author": "Anh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-12", "description": "It's true about the fish smell but what do you expect when your on the Waterfront! On a beautiful day, this is the perfect place to hang out with your friends or family for lunch. We love the Farmers' Market and the fresh strawberries my little girl always wants. I used to go for a run down here but it's been a while. Just the ambiance and the outdoors does it for me. Check out the Waterfront if your in San Francisco.", "author": "Robert W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-13", "description": "I made reservations to eat here for my Husbands birthday. We go into the restaurant and are told it's going to be a 15 minute wait. So, we wait for 15 minutes (which seems ridiculous since have a reservation and they knew it was for a special occasion). After 15 minutes of waiting, we are told it's going to be at least another 15 minutes. \n\nI really don't understand what the point is of having a reservation if you have to then wait 30-45 minutes to be seated. I went to talk to the hostess and explained that it was a special occasion and I felt like being asked to wait more than 30 minutes when we had a reservation was ridiculous. She told me, \"having a reservation doesn't guarantee a table.\" Oh really? I thought that was the point of a reservation...\n\nSo, we ended up leaving after waiting about 45 minutes and still no sign of a table. I went home and wrote an email to the management saying that I wasn't satisfied with their service. I never heard anything back and they ended up adding me to their mailing list and spamming me with emails.", "author": "Becca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "Beautiful on nice day, lots of people come to jog.  I used to come here to fish with my grandpa.  That was in the 90's now it's different and better scenery.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "Where can you go and enjoy a three course lobster dinner for under $50.00. Add the beautiful surroundings, with the Bay Bridge right in front of you any your have a moreable experience.  A tastefully decorated restaurant with friendly and professional servers.  My shrimp wrapped with pancetta appetizer in a pepper sauce was creative and mouth watering.  My 1.5 lb brick wood burning oven gave lobster fresh roasted taste. Our waitress recommended champagne with my dinner which wouldn't have occurred to me.", "author": "blaine s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-31", "description": "After a DRY...COLD .... evening out, what better way to walk off some of the carbo intake,  then to stroll along this pathway, without the cement oppression and sound of heavy machinery of a structure once blocking this area pre-1987 Loma Prieta...", "author": "miriam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-10", "description": "Great view.  It's right on the Embarcadero with the bay on one side and tons of people-watching opportunities on the other.  It's a nice outdoor patio: glass protects diners from wind and noise and umbrellas shade the patio from the sun.  The fantastic sparkling lemonade (although the glass could have been a little bigger), professional service, and great food made lunch very enjoyable.", "author": "Kari S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-21", "description": "There is something so calming and relaxing about the movement of water.  It cools on hot days and sooths busy minds with endless motion and light background splish-splashes.  It draws everyone to it and glistens no matter the weather or time of day.  I love walking or running along here at lunch for some fresh air or exercise.  I feel blessed to be of the few who get to come here at will.", "author": "Chard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-24", "description": "This is a nice place to take a walk,sit and just relax.The views are amazing and when it is beautiful out it is stunning.If you work in the area grab some lunch and come here.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-07", "description": "When the weather is warm I recommend sitting out on the terrace.  The service is good...but the hostesses can be a bit rude.  The food is eclectic and good.  Be prepared to spend some money if you are a drinker.  The mark-ups on the booze are kinda crazy.", "author": "Mackenzie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-04", "description": "This is the best restaurant for that special occasion your are looking for, the first time I came to the Waterfront I checked Yelp b4 with really bad reviews, but thanks god a friend of mine dragged me in for a happy hour on Thursday, they have a huge patio with a breathtaking view of the bay bridge with great drinks and a calamari to die 4, the staff were very attentive for our needs, I will definitely be back many and many more times", "author": "Daisy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-17", "description": "the embarcadero waterfront is cool.\n\nthe two metal people \"sculptures\" are stupid.\n\nthe bow and arrow is a little better but kinda dumb too.\n\nmaybe being a plumber has its limits when it comes to appreciating \"art\". dunno.\n\nrating: one stinking pile of poop.", "author": "dave tastic fantasmo x."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-07", "description": "Did Dine About Town here.  The clam chowder was very creamy but nothing special, and my halibut was dry and a little bland even for my hypersensitive taste buds.\n\nMy friend ordered salmon but received a halibut instead, then my other friend got her dessert order mixed up too.  We would normally let it slide without much complaint, but it got irritating especially since it looked like we were only one of 3 tables in our server's area.\n\nIf you do come here try to request outside seating because other than the view of the bay, there's not really much that sets this restaurant apart.", "author": "S L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-03", "description": "I went there for Happy Hour recently. It's an awesome deal for such an incredible location and views of the water. Oysters, Calamari, Sliders - all incredibely tasty and for $5.00 - and great deals on drinks - beers for $3.00 and some wine by the glass for $5.00 and all well drinks for $5.00. I was surprised as this was a Saturday afternoon - an odd day to have happy hour b/c it's so busy on the Embarcadero?!?! We had such a great time that we came back for lunch a week later with a few clients and they were thoroughly impressed.\n\nThe postives:\n\nCrabcakes were some of the best I've ever had. Not too much bread crumbs, sauteed/not fried,  good portions. The prawns wrapped in pancetta came with a sauce very similar to a chimchiri sauce - cilantro, garlic, EVO - I made the waiter double check with the head chef on the recipe. \n\nSwordfish: cooked right. not too \"steaky\" as some swordfish can be. I got a side of crab mashed potatoes with it - WOW - never had anything like them.\n\nDessert: I had the chocolate brownie. Not too rich in flavor which is the way I like it. however, my associate had a chocolate Fondont(spelling?). I should have ordered this. Slightly uncooked in the middle. Amazing!\n\nThe negatives:\n\nParking but I apparently they valet for $10.00 which we will do next time!\n\nI definitely receommend this place if you are looking for a classy, yet not too pretentious location/atmosphere, exciting food/flavors and wine selection from all over CA.", "author": "Grant C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-21", "description": "How can you not love the Embarcadero. I love running along the waterfront or just take a walk... especially on a nice day. One of my favorite areas in SF.", "author": "Anita B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-04", "description": "It's a beautiful place to jog, or ride your bike...the water is so calming and the foggy days are just the best...", "author": "Francis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-09", "description": "sniff sniff...i loved running along the embarcadero in the mornings...can't do it as much now since i work down the peninsula. \n\nmy typical route was from the embarcadero y to aquatic park and then turn around, run to the ballpark and then back to the y. \n\nsniff sniff....i think i'm gonna have to move back to the city!", "author": "Pippi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-01", "description": "We came here for their traditional Thanksgiving prix fixe.  Service was attentive and great.  We were 30 minutes early, but they sat us anyway.  It wasn't that busy.  They gave us a table by the windows with a beautiful view of the bay bridge.  I had the butternut squash soup, roast turkey entree, and their bread pudding for dessert.  Servings were huge, and I was so full by the end of the night.  Overall, I'd say the food was good, but not memorable or awesome.  Too bad the quality didn't match the spectacular view.", "author": "Allison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-09", "description": "\"It's nice outside\"  - this expression was most likely coined after San Francisco in THE SUMMER. Enjoy it while at the Embarcadero Waterfront.", "author": "Carl Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-20", "description": "This restaurant is great for dinners and it's got great views!  I usually bring a group of friends with me and take over a corner of the room - order some drinks and kick-back.   However, they need to improve their crabcakes - needs more crab and less breading.", "author": "Daria i."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-17", "description": "This is a really nice restaurant by the pier. I would recommend dinner because you can probably catch the sunset from anywhere in the restaurant. They have prix fixe menus, but the selection isn't that great. My bf and I ordered the chicken escalope and the new york strip. Both were very satisfying - I don't think we were able to finish it. Food tasted very good, and the sides were ample. Service was pretty good. They kept coming back to refill the water and checking up on us. We brought a bottle of wine for a graduating student, and they allowed us to open it without corkage fee.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-18", "description": "The waterfont is an alright place, but you are paying for the location and ambiance more than the food.  My steak was tough and the lobster was pretty boring. I'm not a big lobster guy so take that with a grain of salt.  But, the view is very romantic and it's a good date spot, so long as your date isn't a hardcore foodie.", "author": "Jerry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-09", "description": "always a fan!!! love their sturgeon dish and sitting outside and/or the 2nd floor.. wonderful view of the bay!", "author": "cecille p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-18", "description": "nice decor, but though the space doesn't seem dirty, it certainly doesn't feel pristine. \n\nFood isn't bad, but it's not top quality and there is nothing very characteristic about the place. Just feels like a restaurant business. \n\nIt's not that this place is terrible, but the 2 star rating is due to unmet expectations. if i didn't expect it to be a nice restaurant (as is tries to project itself both in style and prices), i suppose I wouldn't be as harsh.", "author": "A K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-28", "description": "Wow, I rarely go to tourist traps. I live on TelHill and I know that most of the places on the water, don't have to be good, just have to be there -- but it was a few days before x-mas and my girlfriend and I were making up from a spat and walking around the embarcadero at dusk and decided to take a shot with Waterfront. We came in and at first glance it looked ok inside. They immediately asked if we had a reservation and we said no, and they tried to dump us in a bad spot with no view. It was very empty and barely 6-ish. They finally offered us a 2-top with a side-view window of which only one seat was cherry, I gave it to my girlfriend. The entire serving staff was horrible. Untrained, unsophisticated, a typical experience with the hovering jackals that can't swipe your  plates off the table fast enough. The food was terrible. We decided to go with some apps and share one entree, the soup was cold and not filled, it was more like a halfbowl of cold soup with bagged croutons. There was a terrible draft, servers kept bustling by us as they entered our orders on computerized (aka coporate) -- we had our entire meal and the nice window seats supposedly reserved never had anyone seated there. The wine by the glass was also about half-full. Portions were small, and we were still hungry and asked about the crab-cakes. \"oh, they are phenomenal we were told\", I have to tell you, I have had some ok crab cakes and some unbelievable crab cakes in my life -- really refined and delicate and flavorful -- these were the worst crab cakes I've ever had -- they were small and greasy and hard and seemed like Arthur Treachers frozen crab cakes sitting in guldens mustard. $19 for that treat. I hate to be a hater, I should have known better - bad service, bad food, over-priced and filled with tourists or people from the peninsula who didn't seem to know better... yuk!", "author": "R A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-27", "description": "I think old school is the best way to describe this place.  The decor a little is out of date, the waiters wear stuffy vests and the food is just OK AND pricey.  I like the selection of fish but the sides could be better.  The roasted vegetable side consisted of: turnips, carrots and onions.  Come on, can't you throw in a few other veggies?  The view is nice and the cocktails were good.  I would probably go back for a drink at the bar or maybe dinner if someone else was paying.", "author": "Marie N."}
