{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "I love this hidden gem. It's cash only and inside this dim bar it takes you back to gastropubs like in Europe.", "author": "Miguel E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-30", "description": "A decent neighborhood dive with a fairly large beer selection. Most of the brews are default, recognizable names like PBR, Stella, and Anchor Steam, but there are also a few gems like the Russian River Pliny the Elder DIPA and the New Holland Dragon's Milk stout. \n\nService is perfunctory, although to their credit they were able to handle large crowds when I stopped by. The venue is a bit narrow but is also more elongated than you might think; the front portion feels like a man cave from the '50s or '60s while a rear portion has lots of games (all paid) and feels a bit like a hunters' lodge. Overall, an OK go-to if you live in the area.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "The Page is an average neighborhood corner bar that's not the best bar ever but not the worst. They're a cash-only joint that has no cocktail menu, a pool and foosball table, and some classy furniture. My wife and I were killing some time here waiting to eat omokase at Ijji located on the same block. We shot pool with some nice hipster-type people and enjoyed some Lone Star Texas beer ($4.50). I'd probably only visit this bar again if I was in the area for something random or if I knew someone who lived by it.\n\nPool table costs $1.50 a game--SF prices!", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Great neighborhood bar with awesome selection of beer - and new (at least to me) a handly little printed menu of beers with ABV, IBU, description and cost which is handy to make the right choices.\n\nSlightly Jekyll and Hyde-esque in terms of atmosphere. In the late afternoon/early evening it's a chill, dog friendly locals bar (with a great happy hour as well) that's a relaxing place to hang out for a couple of drinks.\n\nAfter 8pm, dogs aren't allowed (fair enough - the rules are very clear) and it gets much busier and louder with a younger crowd there to party and play pool.\n\nI'm more a fan of the chilled afternoon side of this equation but either way it's a great spot to grab a few interesting beers without the attitude you sometimes get at Toronado...", "author": "Diarmuid R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Favorite bar! Cash only but beers and other drinks are cheap. Come for happy hour where drafts are $1 off. Cool atmosphere with fun people. It's not super loud so you can easily carry on conversation.", "author": "Alexandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Love this place. Perfect neighborhood bar. Great beers on tap, plus a good bottle selection too. If you're looking for a great, non-pompous Friday night this is the place to go'", "author": "Eugene B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Randy is the worst bartender ever!!\nSuper attentive, super inattentive\nSuper nice! Super not nice\n\n\n\n\nIf it wasn't for the lighting I'd never come back!", "author": "Emmy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Awesome low-key bar with inexpensive drinks (cash only, though). It can get pretty packed, so be on the lookout for seats or arrive early. I'm a fan and will definitely be back.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-19", "description": "Came into The Page on Easter--it was pretty packed for a Sunday and a rainy one at that, but it was fine. This Bar is pretty neat, great location on Divis and they have a small lower level with a foosball table, some sort of arcade game (competitive variety game? I think there's pacman on it) and a pool table. We stopped by to play a couple rounds of pool after Easter Lunch. The pool table is expensive! $1.50 to play a game (most places I know are $1 or free) but they do have two of them, one on the upper level and one on the lower one which is cool.\n\nIt's a pretty chill/small bar with fairly reasonable drinks during HH. Your standard chill place to grab a drink and play a round with some friends. There was only one bartender who seemed a bit swamped and one of our friends would grab a round for people and collect cups (she didn't even work there! but she'd go back and forth with 10 cups and bring back a round) but they were super short staffed and things were piling up everywhere.\n\nPretty chill divey place. Can't stay too long, those pool games will add up!", "author": "Nerissa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "Woman with the black and white long sleeve that read \"I like long walks to the bar\" charged me $14 for two vodka sodas while the woman at the front bar with brown hair charged my homie $10 for two vodka sodas.\n\n\nI don't like being mis-charged. C'mon Page! \nGET YOUR SHIT TOGETHER.", "author": "Laurie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-03", "description": "Came here on a Saturday afternoon with my girlfriend, lady bartender was not friendly in the least. Not only was she very hostile with me I heard her bad mouthing customers and scoffing audibly about a group who left her a \"bad\" tip. \n\nGiving this place two stars because the drinks were good and the location is cool however the bartender didn't make us feel like staying long. Would not come here again...bad vibes", "author": "Dylan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "Nothing is more satisfying than landing at the airport and still having the energy to go out. I kept insisting that I would be too tired, but my friend was going to The Page and wanted me to join him. It had been awhile since hanging out on Divisadero, so I went and was glad that I did!\n\nThe Page is your typical dive bar, complete with dim lighting and pool tables. It's much bigger (deeper) than I thought. I grabbed a beer at the bar and proceeded to watch my friend and his friends play pool. I'll have to fit in a game myself next time. We eventually migrated to the lower level (more lighting there) and hung out some more. Chill place to hang out. Nothing special. Feels like a cozy place that's easy to become a regular at.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Decent house bourbon, mellow ambience, and a helpful bartender. Came during happy hour and it didn't break the bank. Going to come again.", "author": "Stephanie O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "Slummy, divey bar around Haight. I'm not usually a fan of dive bars, but I liked that they had pool tables and a foosball table (they cost money though!). If you're looking for a quieter spot to hang out with friends where you can actually hold and hear a conversation without yelling, it's worth checking out. \n\nCash only! They also have an ATM in the very back in case you don't have any on you.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Discovered The Page a couple years ago, while visiting another business across the street. Quickly became a fan of the vibe and music, which tends to sprinkle some 80's alternative in the mix.\nThe staff is really nice too ;)", "author": "LL O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I came in after a long game of ultimate frisbee and Randy the bartender told me that since I wasn't playing a real sport, he wouldn't serve me a Tecate.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Layla Makes the best cocktails in the city. Her favorite is named the French 75. You guys should check it out.\n\nHer smile entices one to return for many of their wonderful cocktails; moreover, her customer service and attention to detail is sublime. I'd happily suggest tasting her mixes.", "author": "Cullen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "I've never really enjoyed The Page, which always seems grimy and crowded, but not in a fun way. I'm sure I'd feel differently if it were my neighborhood bar, but it's not. However, I do like the beer selection and once I find a corner to squirrel myself away in, it's certainly all right.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Pros\n- Good happy hour spot \n- Good selection of beers\n- Great bartenders\n- There are a few pool tables\n\nCons \n- Can get really crowded on weekend nights", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "The place reminds me of a whacky uncle's \"man cave\", and that's just fine with me. I'll come here to play some locals in pool in the back. The staff is kind though are a bit short with you if it's busy. I don't blame them. Overall, a good place to wind down after a long week.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Great dive bar in the Haight area of San Francisco. I headed there with my wife and some buddies on Saturday of the Halloween weekend, it was jumping. \n\nStaff were very friendly and quick to get us all served despite the crowd.  Music was great, PBR was cheap - all I could ask for! \n\nNext time I'm back in San Fran I'll def pop in for a wee beer again.  See you on the next page :)", "author": "Stuart B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "This is my neighborhood bar - dive-y, reasonably priced, and stumbling distance to my place.  Overall, the patrons are a casual, chill crowd and the bartenders are efficient, friendly, and pour a good drink.  It's gotten more hipster-y in the last several years, but remains a neighbor watering hole more than many other places.\n\nThe women's restroom is small and stuffy, but definitely not the most disgusting dive bar restroom I've seen.  Rumor has it that the men's may be less acceptable, but I can't say with certainty.\n\nThe interior reminds me of a Midwestern basement from the 1970s, complete w ugly, dirty carpet (that likely smells, but I am never going to smell the carpet at The Page!) and taxidermy decor.  And, like many of those basements that I can recall from my youth, the decor hasn't changed since it was first installed...and I think that's a good thing and part of the \"charm\" of The Page :)\n\nThere's a pool table, a foosball table and a juke box.  All three tend to seemingly always be occupied.\n\nMinus one star for being cash only.  Though I admit, it probably helps make service really quick at the bar.", "author": "Sara E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "This is a great little place to go have drinks with friends. In addition to the bar, there is also some seating away that is a bit more quite. Overall, great place. Good beer selection. I recommend giving it a try.", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "I didn't even know that Yelp had a \"pool halls\" category, but The Page does indeed have two pool tables, plus foosball in the back! Not really my thing, but it's fun for hanging out with groups of friends. The ambience is a little on the divey side, closer to a neighborhood bar than somewhere you dress up and go out to on a Friday night. It was crowded even on a Thursday night at 8pm, but the vibe was pretty chill. The floorplan is long and rectangular though, so the back can get a little warm and stuffy.\n\nNo special cocktail menu, but they do have a full bar, decent beer selection, and cheap wine by the glass. CASH ONLY!! I did not know that when I was there; luckily, I happened to have some cash on me.", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "I went here for some drinks with friends one night and I really liked it. Seems to be a popular spot for mid to late 20 year olds. There's a pool table in the back but it had a long line so if you're set on playing pool I would suggest getting there early or maybe just going somewhere with more tables. The place is pretty casual but not dive-y since it's decorated in an interesting way. I think the back room is meant to look like a library. I would come back.", "author": "Mimi H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-21", "description": "Awful guy at front of entrance. When a customer goes into the establishment you don't grab him by the arm. My buddy goes in and doesn't get grabbed by the arm. Me being a martial artist you don't grab me by the arm number one im a paying customer. Then when I inform him you shouldn't be doing that because people don't like that he says your out then proceeds to flick me off. This gentleman as some might call him probably not needs to be fired/ reprimanded.", "author": "Nic C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-26", "description": "Just moved into the neighborhood and have quickly settled on The Page as my regular haunt. This place has a great atmosphere and reasonable drink prices. Whiskey neat ran $6, which is a little better than the going rate in SF, near as I can tell. \n\nPretty dive-y. It's deceptively large inside -- the place stretches out pretty far into the back. A shoe-in for my favorite bar on this stretch of Divis.  \n\nI haven't touched the jukebox, but it's one of those new-fangled video screen deals that probably has basically every song on it. Please don't put on \"I Don't Want To Miss A Thing\" 10 times in a row. (Please put on \"I Don't Want To Miss A Thing\" 10 times in a row.\")", "author": "Jim M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "I like the divy bar - lounge atmosphere The Page provides, as well as the good selection of beers. It would be nice if music was played throughout, however, without customers having to go to the Jukebox and paying out of pocket.", "author": "Leonora H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-24", "description": "A quintessential neighborhood bar, The Page's long labyrinth-like layout might intimidate non-regulars at first, but the decent selections of beer on tap more than make up for it.   \n\nIt's a dark and narrow bar that can be packed with regulars who come for booze, music, video games, foosball, and pool. It can smell a little musty too and finding the restroom requires some climbing up and down but when you factor how much they squeeze into the space, it's pretty impressive. And then there's like 20 beers on tap where none of them are crappy. Nice range of microbrews to local faves served to you by pretty friendly bartenders. \n\nI'm not a neighborhood regular but The Page is a nice option to grab a quick pint around Lower Haight. Note that they're cash only though.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Great feel to this place\nDivert classic bar\nGreat service\nPool table , foosball table\nAble to have a conversation \n2 tvs with  sports", "author": "Jones T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-16", "description": "Yeah, not my kind of place. It's dark and divey, which I get it, is part of the charm for some. But I really wasn't feeling the crowd. A few of the women there seemed very... I don't know... entitled isn't quite the word, but they were definitely hogging the bar and the bartenders' attention and as a dude trying to get a drink, they sort of made it clear that their needs superseded my own, and were rather rude about it. \n\nThe bartender wasn't personable, and it took me forever to get her attention, and then there was absolutely nothing special about my cocktail.\n\nWouldn't go back. The place annoyed me.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "DJ Dave loves this dive bar and is upset by the recent closure of so many cousins around the city. It's a great pick-up bar so be sure to bring your wingman. If you do go solo, hang by the pool table, join a game, and you'll start meeting folks left and right. Beer is fairly priced, the juke box is well stocked and there are plenty of chances to get lucky, but your odds do diminish the closer it gets to 2:00am when the vampires and gremlins emerge eager to steel your catch. Act quick.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "I visited this place for the first time tonight, for a work happy hour.  Although it might not have been the idea place for a work get together (the seating wasn't ideal for a large group) it was still a great place to get a few drinks.  Anywhere with a good happy hour and a place to read free New Yorker magazines is great in my book.  Also FYI: it's cash only.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "This bar is just my speed.\n\nAwesome nautical art that feels like it used to live in a hotel. \n\nVinyl short backed bar stools.\n\nCrowds of friends.\n\nA pool table. \n\nThumbs up all around.\n\nA decent selection of beers on tap is complimented by a solid selection of spirits.\n\nI didn't have any mixed drinks, but I was quite pleased with the beer, which was cold, the company which was warm, and the ambiance which was that perfect mixture of divey unpretentiousness  mixed with an obvious amount of giving a shit. \n\nI look forward to visiting this bar again.", "author": "Kipper S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "Nice little spot to go for a drink and play some pool. Although the cost per pool game was a little higher than what I'm used to. Note: cash only!", "author": "Annie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "We came here on a Monday afternoon at 5pm. Our experience has been great: the interior is dimly lit and awesomely decorated, the bartender is super friendly and awesome, the jazz music that they play is so good and relaxing. Overall, a great atmosphere for anyone who just wants to grab a beer and chill. They also have free wifi!", "author": "Catherine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "Cool bar, small, close to my place, thats a plus I guess...\n\nSince I need to write more but I have no more to say Here is a random paragraph from a book.\n\n\"Helicopter money is a reference to an idea made popular by the American economist Milton Friedman in 1969\"", "author": "Nekario V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "Hi Ho silver. Great bar. Young crowd. They are nice. Lots if games in the way back.  Good variety of drinks.  Bar tenders are cool  nice girls. They look like they know what they're doing.  I like the margaritas.  They are served in a funny cactus cup", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "I have nothing but love for this neighborhood dive bar.\n\nThe Page makes me feel like I've been transported to the 70's because the inside is very Harold and Maude. Everything is red and soft.\n\nPatrons and staff are quality, dive-loving folk. Drinks are stiff. There's a couple different pool tables. This is a good spot to just grab a drink with a handful of people.\n\nAlso don't be an ass - bring cash, they're cash-only.\n\n^Personally, I'm that asshole. I don't bring cash and then my friend has to buy me drinks. Maybe they won't catch on...", "author": "K M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-10", "description": "Nice bar that I've been several times.  It's chill, can't say anything bad nor anything special.  Workers are friendly.\n\n-Small little fooseball table thats generally open\n-2 pool tables (one wasn't used last time for some reason)", "author": "Samuel Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-07", "description": "Dark and a little divey, with a lot of fun beers. Check the selections on the chalk boards above the bar, but be sure to ask if you're looking for something specific - they might have it or something like it on a super secret tap or in the bottle. The bartender was able to recommend us a really, really good sour that wasn't on the menu.\n\nMinus half a star for being cash only, minus a full star for the ATM being broken.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Dark and Divey... The way a bar should be.  This is my little sis's Go To bar so she brought me in on my visit.  They have a juke box, two pool tables, and a fooze ball table.  The drinks were stiff, the service was good, and we had a great time.", "author": "Bryanna P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "If I could give it 0 stars I would. Bartender was absolutely horrible. Ordered a vodka soda and couldn't taste any vodka. My party ordered 3 and didn't drink more than a sip each. The bartender said she \"didn't mind\" and made no attempt to accommodate paying customers. TERRIBLE SERVICE!!!! DO NOT GO!!!!", "author": "Resham R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-15", "description": "Women who say they become invisible when the reached middle age weren't kidding.\n\nI want to the Page tonight for a drink. Simple enough. I stood in line behind a few people waiting to order. When I got to the front, I waited for the male bartender (Randy?)to help me. \n\nHe turned around-and asked the girl behind me what she wanted. She told him (a can beer) and he then reached over my shoulder to take her money.\n\nTo clarify: I'm standing right in front of him, the next person in line-and he acted as though I was not even there.\n\nWell, after the blond had gotten her beer he deigned to serve me.\n\nBut it kind of ruined the experience for me. Who knew-being invisible is actually kind of unpleasant.", "author": "Sue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "The Page is a small, divey bar. It definitely seems like it's a place with regulars. The bartender was pretty cool. I ended up just ordering the Ommegang White. They have a decent beer selection that rotates often. They also have a pool table and TVs. A nice place to go to to get away from the busyness of Haight St.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "If you were to look up \"Dive Bar\" in the dictionary, you would find a nice big picture of The Page and nothing else. This is quite simply the divey-est place imaginable, and I'm a big fan.\n\nThis place is very straightforward, so my review will be the same. Here is everything you need to know:\n\n-Good beer.\n-CASH ONLY. So bring cash.\n-Don't complain about it being cash only. No one wants to hear you whine.\n-Not a place to rage. Come here to kickback, drink beer, and talk to your friends. \n-On Friday nights the front bar-area gets crowded, so your best chance to find a place to sit will be the downstairs area in the back. \n-Pool and fooseball tables are downstairs as well.\n\nThat's it. Appreciate this place for what it is, and what it isn't.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "Again, I'm out without drinking. Still, having a good time\n\nPros\nNice atmosphere/decor\nMultiple pool tables\nFriendly staff\nFresh water\n\nCons \nCash only \nFake bookshelf (and I love books)", "author": "Rishikesh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Divey bar. Got here on a Saturday night and was lucky to score a couple seats as these girls were leaving. Drinks are not expensive here compared to other places. I have to say though I don't understand why bars have drinks that are like 6.50. Can you just make it 6 or 7? Although, quarters for laundry. Not horrible. :) I'd come back here. Good relaxing, casual, divey bar.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "Great neighborhood spot in the Lower Haight. We stayed a block away and finally stopped in for a drink on one of our last days in town. We happened to walk in during the very end of the Raiders-Niners game on a Sunday afternoon, which was a lot of fun to watch (although not for the Niners fans at the bar).\n\nThe crowd seemed to mostly be made up of friendly local folks and we had some great conversations with one of the more diverse crowds we saw in the city. I forget the bartenders name but she was super friendly and an old childhood friend of a guy we were sitting next to. The place felt like a pleasant, tight-knit community.\n\nBeer is pretty cheap and they have a solid selection of beers on tap. It's definitely a dive, but an authentic one...not a super-contrived hipster slum that will still charge you $7 for a beer. \n\nWe returned the night before we flew out and enjoyed the nighttime crowd just the same. I'll definitely be back on my next visit to the city!", "author": "Tyler B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Reasonable prices and pool in a brick-clad subterranean quadrant; enough said.", "author": "Wendell A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "Excellent beer selection.\nGreat happy hour prices.\nBad lighting.\nCarpet.\nComfy yet torn up chairs.\nPool table.\nYep, this place screams me.\n\nCash only.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "I've ran by this bar numerous times in the day and always wanted to check it out. Finally got the opportunity this past weekend and was really into the vibe of the place. Good beer selection and a really relaxed area in the back.\n\nMy friends and I sat down in this little nook next to the stairs. The room was decked out with fake brick walls and a fake library panel. There was also a little magazine/book stand with some selections I really appreciated. Any bar with the Aeneid on hand gets an automatic 3 stars for that alone.\n\nI'll definitely come back soon, but will probably try to stay away 9pm and later. At this time, the music distinctly changed from palatable classic and indie rock tunes to current pop/r&b songs. This leads me to believe the crowd starts to get a bit too bro-y in the evenings.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "It's a cute \"divey\" neighborhood meet up bar, with nice bartenders and a whole bunch of hipsters. Used to be called \"Chances\" some time ago, a sleepier place if I recall...\nUsually I have ended up here as going on the way to someplace else or after having been brought by someone else. \nHowever, they do offer many bottles of standard fare American and Imported beer, and you might even recognize some tunes on their sound system.\nThey also have a pool table.", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "5 stars for hosting the awesome Northern California Family Dog Rescue Pints for Pups last night!!!  They also let me try several of the beers before committing which was super cool of them!", "author": "Poochie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "The Page always makes me feel comfortable. Live music and a solid tap selection only contribute to the good times. Easily five stars.", "author": "Szymon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "The page is just one of those neighborhood staples. It's dark, it's dingy, and the decor is out of date, but these are all qualities that add to its awesomeness. They cover the basics well and have a good selection of beers. \n\nThis place is popular, so you can find a decent crowd here most nights of the week. It can get a bit tough to find seats on weekends, but if you are persistent there are some pretty cozy little chairs around tiny tables that you can actually squeeze a ton of friends around if you really try. Lap sitting may be necessary but that is all part of the charm! \n\nThere is a pool table. It is in the lower area of the bar where it tends to be a little less crowded. Seek refuge here on if you are claustrophobic and you come on a Friday night.", "author": "Jena M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Dark and crowded on a Friday night...smells of stale cigarette smoke, has any cocktail, beer or wine you could want and complete with deer heads and a pool table. Perfect typical hangout bar. Not a ton of seating but standing room down near the back room. Cash only.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "IsHey girl \nThank you for coming Tonight \nSimbell cant find her cigarettes \nMenthol.\nDid you take them by mistake ? \nShe asked me to ask you", "author": "Brand B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-04", "description": "We went in on a Friday night and paid 5 bucks because there was a DJ. It was super crowded and it was hard to get a read on the vibe of the place. We wanted to dance but there just wasn't room - people were just kind of clumped together with the occasional shove as someone needed to blaze a path through. Maybe the DJ was popular and that was the reason for the over-crowdedness(??) - no clue.\nThe bar staff didn't seem too interested that we were thirsty but we ended up with our canned beer. But I get it, it was a Friday night. \nExpect it to be crowded and expect it to be hard to get a drink. I'll go back on a different day of the week.", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "You can avoid SF drink prices while still getting the SF vibe. Was pleasantly surprised to discover a beer was 6-7 bucks. ATM in the back and a pool table. Close to Haight bars and Divisadero bars. A good weekday place.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-24", "description": "This place felt a little weird and dirty to me. Maybe it's because the lighting was horrible or because I felt like I had vertigo because the floor was uneven, but I was claustrophobic and uncomfortable the whole time we were here. The bathroom was a dirty closet and I felt sufficiently creeped out in there. The service was OK. We had a large group trying to order a laundry list of items, so it didn't help that people weren't quite on the same page when it came time to order, but the bartender could have been a little nicer. \n\nThough I feel like the place has great potential as a cool hole in the wall bar, I couldn't see myself coming here again. \n\nAlso, keep in mind that it's cash only!", "author": "Kaitlin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-31", "description": "This joint gets better\nEvery time I drop in;\nDamn fine selection.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "Chill neighborhood bar with some good beers on tap. \n\n9 times out of 10 the bar service is good, one time we had to wait 5 minutes while the bar lady hung out with her friend at the end of the bar.\n\nYou can usually get a seat here on a weekday and the pool tables aren't hard to get a game on.\n\nIf you want a break from some of the trendier or diveyier bars on Divis, definitely check this place out.", "author": "Cali J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "I'm feelin this place. \nGreat atmosphere, vibe & bartenders. \nThe pool table is a huge plus. \nGreat mix of SF culture.\nSolo, on a date, or with the homies, this watering hole is gold.", "author": "Louie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "I have been here more than a few times since moved to the area in summer 2011, and this is my favorite local bar. \n\nI can always count on a relaxing atmosphere, great beer and whiskey selections, and friendly bartenders.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-22", "description": "This and fly bar are my two favorites in the area. The Page has pretty great drink deals like $8.50 for a pint of old speckled hen and a shot of bushmills is solid.\n\nMore importantly $5 Pliny the Elder rocks my everything. Hard.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Great dive bar in the heart of the new Divisadero corridor. Pool tables that don't have hour-long waits, cozy tables for two, friendly bartenders and affordable drinks. For these reasons, I'd give The Page 4 stars, but to really enjoy it make sure you go on a night when you're looking for a cozy, local spot - not a classy, sophisticated wine bar where you'll be forces to choose between a 2009 and 2009 Syrah.", "author": "Erin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "Didn't spend much time here, but loved the vibe on a Monday night. Road up with a friend on our motorcycles and grabbed a Death & Taxes. Sat in the back near the pool table and enjoyed a chat surrounded by strange lamps, books and stuffed animal heads (not my thing in general, but it worked in this case.) It's dark and kind of dive bar-esque, which I do love. Heard it's crazy on the weekends, but Monday was super chill. I'll be back for sure.", "author": "Chantill L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-26", "description": "I have a very specific checklist for bars that become 'my favorite' in some capacity.\n\nThis is that check list:\n\n- Divey\n- Cheap drinks\n- Decent Happy Hour\n- Good jukebox\n- Carpeting\n- On my block\n\nYeah the bartenders can be kind of bitchy sometimes (sometimes they're nice!) and the crowd can definitely be eclectic (i.e. hit or miss)... and it can get hella crowded on the weekends... but none of those things are on my checklist (damn that rigid checklist!)... plus carpeting and proximity get me every time.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Dropped by for an Ommegang Glimmerglass saison. That's all.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "I love this bar! No frills and always a thrill. I always appreciate the laid back vibe in there, it's one of my favorite simple dive bars in the area.\n\n2 Pool tables and lots of seating. Pretty decent selection of beers on tap. Can't go wrong.", "author": "Caitlin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "The BEST! A very good beer selection, not the best, but they get some great ones! Sadly they still must offer PBR+ for the douche hipsterbag, that thinks it's cool to drink swill. All the bartenders are great, nice cozy place. Best bar I've found in SF. Of course Toronado is better for beer if you want to be treated like shit.", "author": "Charles K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "Yup. Dig this place. The guy and I do our best friending here on the down time and good place to introduce to my gals.", "author": "Netta W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-26", "description": "I'm pretty sure they were over capacity. And violating a fire code. And with that many people crammed inside, it might actually drive business away, not encourage people to stay. Not that I would know anything about fire codes. Or running a bar. \n\nOH WAIT- I'm a lawyer in training AND I was a bartender. Well, f. me. \n\nThe end of the night was a drag due to the overcrowding and the cash only and the high prices. It could have been so good. But it totally wasn't.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Visited The Page for the first time a couple of weeks ago when I was visiting some friends. This place is pretty cool, and I look forward to coming back. It's not super trendy or fancy, but not a dive of all dives, either. Cash only, so come prepared. It was pretty crowded when we got there, but there appeared to be a good number of smaller tables and chairs along the wall of windows (which would have been ideal to snag) and a back room with a pool table. We just stuck to the far end of the bar and lucked out when a couple of people left their seats. \n\nBartenders were all pretty friendly and the drinks were well made (no skimping on the alcohol) and reasonably priced. My friend's husband was excited about a couple of the beers they had available. \n\nExtra star for the cool electronic jukebox!", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Great neighborhood dive bar. Awesome spot for cheap beers and a game of pool. Be advised that it is cash-only!", "author": "Tanner S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "I met the love of my life at this bar one night.  Her name was Chelsea and she had flaxen blonde hair and green eyes.  We talked about traveling the world together, loved all the same movies, and both had a deep affection for 17th century french poetry.... As the bar closed I couldnt find her.  In her place was an old half blind man named Guss and his mangy dog who kept sniffing my crouch.  Guss kept patting me on the head and saying \"he couldnt believe he was talking to the king of Spain!\".... I honestly have no idea what happened that night!  Also had a great burrito next door and brought it back into the bar.  That was cool too.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Perfectly divey, cheap drinks, pool and foosball. Cash only - at least you won't forget to close out your tab after one too many.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "The drinks.\nThey were cleaning out the beer pipes so all beers on tap except 2 or 3 were available. $5 for beer.\n\nThe service.\nEveryone was served and I sware the bartender looked at twice and still.didn't say anything. Even the guy next to me at the bar said something.\n\nThe people.\nInteresting crowd. Very diverse. \n\nThe bar.\nVery dark. Nice big red man chairs. Looks like old men sit there with cigars and a glass of scotch. Pool table with a weird portrait of a man hanging above. \n\nWould I come back?\nYes it was a interesting bar. Great place to people watch.", "author": "Aleena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "Favorite go-to neighborhood bar. Solid beer selection, chill crowd, comfortable. Also, a super friendly staff that doesn't mind a mid-60's to early 70's playlist on the jukebox.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-29", "description": "I've heard a lot of good things about The Page, but my single visit there was short and relatively disappointing.  The decor was cute, and the beer selection looked decent.\n\nThe bar was extremely crowded (I believe I was visiting on a Saturday night after dinner), though, and the patrons were a little younger and a lot drunker than I expected for that time of night.\n\nI ended up getting pushed down to seats by the pool table, where I spent the evening dodging pool cues and hipster butts.  Oh well.\n\nI would definitely give The Page another shot, though.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-30", "description": "The Page is definitely your go-to neighborhood bar. Everyone is really friendly and laid back and it's an casual and chill spot to grab a drink.\n\nI've been here a few times and can say that it's a solid spot for happy hour or to wind down at the end of the night. They have a wide selection of beer on tap and they are all pretty cheap. Howerver, they're cash only so remember to grab some cash ahead of time.\n\nThere's tons of tables and seats at the bar so it's the perfect spot for a group. There's also a pool table in the back.  \n\nIf you're looking for a casual, laid back, no frills kinda place to grab a drink, The Page is definitely it.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "Cool neighborhood bar. I was shocked to find that it was pretty crowded on a Thursday night. Not so crowded that you can't hear the person you're standing next to, but crowded enough so that you're not wondering whether they failed a health inspection. All of the ingredients for a good, chill bar: cheap drinks, friendly people, enough seats, and pool tables (if you're into that)", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "A great local bar, and a neighborhood classic.  My parents went to this bar with their friends (though it had another name then) in the 60s and 70s.  Bartenders are always friendly, and there is a wonderful old den/cocktail lounge vibe.  I recently hosted a fundraiser/birthday party here (with 10% of the total bar tab, not just our party's, going to a favorite non-profit).  Working with the manager, Bob, was a piece of cake, and my event went off without a hitch.  I also always meet friendly neighborhood folks here.", "author": "Aileen J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-06", "description": "Great local dive bar, someone I work with brought me in and he knew everyone there (lived right there). Very nice staff, reasonable drinks, and a busy place with nice patrons. The neighborhood was amusing as well, I would come back.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-16", "description": "\"Daddy, these arm chairs smell like grandpa.\"\n\"That's the smell of broken dreams, son.\"\n\nAnd Budweiser...but mostly broken dreams.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "You know what?  I was pretty messed up by the time I entered The Page, and I STILL didn't like the vibe I got from that place.\n\nI really like the dive-y interior, but the clientele was just so-so. \n\nAt least they had my favorite scotch.  \nOne shot of Laprohaig and I bolted out that door.", "author": "Samantha P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "after going to a couple other places in san francisco, i've still been dying to come back here.\n\nwhy are the selections of beer in bars in sf so bad?  so many more beers on tap here.\n\ni want to come back here so i can have my magic hat #9...\n\nif anyone can recommend where i can get an ipa that's not lagunitas in sf, let me know!!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-04", "description": "Great: Foosball!!!  (When I can get someone to play with me!)\n\nFair: The drinks and service - can be hit-or-miss in the 'tude department\n\nPoor: Getting carded multiple times on the same night by the same bar-tender. . . or wait, are you just hitting on me?  Cause while my crows' feet sure appreciate the fatuous compliment, my aging intellect does not.\n\nA \"meh\" bar when it was Chances, and an \"A-OK\" bar as The Page.  We come here for after-work happy hour from time to time and it suits us just fine.\n\nFoosball anyone?  \nWhat's that?  Afraid of my 19-year-old spunk?\n\nWait, what?", "author": "Ravena F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-29", "description": "Seems like it's become a bro bar and there are some bartenders that are unfriendly. Rotating the taps a bit more would also be helpful. I miss when The Page was awesome.", "author": "Cori W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-05", "description": "The Page is a great sorta-divey neighborhood bar.\n\nThey have a really large selection of whiskeys (apparently it's the owner's thing) and there's usually a whiskey of the night that's $5/shot. Give it a try! If whiskey isn't your thing, they're well stocked with everything else, including craft beer.\n\nHappy hour runs until 7 daily and is $1 off everything, making that whiskey even more attractive.\n\nCash only, but they have an ATM (beware the fee unless you have a bank that refunds them!).\n\nStaff is very friendly and attentive; I didn't wait longer than a few minutes after coming up to the bar to get a drink.\n\nSeating is a little scarce (there are tables along the outside wall and a few down by the second pool table in the back) but there's enough standing room that it doesn't feel too crowded.\n\nMusic comes from a jukebox, so you'll hear whatever your fellow patrons want to listen to. (Read the FAQ on the website to see what's frowned upon. *cough*Phish*cough*)\n\nNo food, but they're fine with people bringing in stuff from nearby restaurants (I recommend Little Chihuhua. Best drunken nachos ever.) which is good if you're like me and fail to eat before losing track of how many drinks you've had.\n\nA bit farther from my house than I usually walk, but whatever, it's worth the trip. Stop in if you're in the neighborhood and I just might be there sampling the whiskey.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-01", "description": "Go elsewhere if you can\n\nI could rant but I don't have the time\n\n1. Rude bartender\n2. Bad drinks\n3. Rude entitled patrons - hey jackhole, I'm a local too but it doesn't MATTER! We all deserve equal treatment", "author": "Rachel O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-07", "description": "For a long time, I felt like my every visit to The Page was going to be punctuated by a punch to the face from the bartender's Irish boyfriend. I don't know if that bartender still works there, or what her boyfriend's problem was, but I've since outgrown that notion, and have gone on to pass one or two enjoyable drunken evenings there. On my last visit, I really noticed how young and single the vibe was. I seem to remember a slightly more diverse scene reflecting the neighborhood demographic, but that's San Francisco for you, always changing. Still, I'd generally rather be kissed on than punched. Depending.", "author": "Joe V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "This is where plaid goes to drink.\n\nLiterally, like 10 plaid shirts---and by that I don't mean lumberjacks-- where sitting at and around the bar.\n\nWHEN DID PLAID BECOME HIP? (I must have missed that day in fashion police academy when they said NOT to arrest 20 somethings who are trying to look rustic who clearly have never picked up an ax before).\n\nAnyway, beside the horrid fashion, (and honestly, it wasn't' just the men) the drinks were as cheap as the hookers in the TL (I'm assuming) and as stiff as the 'Frisco wind that night.\n\n\nBring cash. You'll need it since it's the only thing they accept.\n\nGreat place to chill...but it's louder than the outfits people wear there.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Oh, The Page.\n\nI've spent many evenings here. It's my favorite little spot in Lower Haight because 1.) foosball, .2) pool tables, and 3.) the carpet. I can't tell you how many times I've discretely spilled beer on accident and no one ever noticed the wet spots on the floor. Brilliant. I can keep my classy lady reputation.", "author": "Mary Anne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "Pretentious locals (including myself): Check \n\nSmall, but thought out beer selection on tap: Check\n\nPool Tables and Foosball: Check\n\nAwesome bartenders: Check\n\nGreat Jukebox: Check\n\nBizarre taxidermy: Check\n\nMan this bar has everything I love! Being in the neighborhood helps too. Everyone that works there is great and nice as long as you aren't a jerk to them. Yes we all know on busy nights it might take a while to get your drink, but that doesn't give you a free pass to be a jerk. I'm looking at you USF kids!\n\nCrowd can be very diverse especially on the weekends. Ranges from Mission hipster to Marina douche.\n\nOne note. It's not the best place to bring a party of more than 3 people since seating can be extremely difficult.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-08", "description": "I stopped by this bar on my way to another bar. The drink selection is good, and prices great (I got my rum and coke for $4 and it wasn't happy hour). Good decor. The bar felt boat-like to me which I liked. \n\nIt was super crowded (this was Friday night) but luckily we got seats. Without seats, you have to stand in a tight space and constantly move for people trying to squeeze through - not worth it as a hang out in my opinion. But if you find seats, or are there when its not crowded, or just want a cheap drink on your way to something else: a very good find.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-14", "description": "Cheap pool tables. Decent happy hour. So so bartenders. Terrible music - in the way too obvious alterna-indie-crap - genre on the jukebox most of the time (but it is an internet one so you can DL new tunes. Sidenote: they only have the censored version of \"Straight Outta Compton.\" WTF is that?). They have a whiskey of the week which is nice.\n\nIt was better when it was Chances, but it'll do for cheap pool and beer. Decent brew selection.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-11", "description": "Cool space to hang out with your friends, but that's about it. There's a pool table and foosball table in the back and lots of nooks and crannies to hang out in, but other than that, there's not a whole lot going on. Just your average bar.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-23", "description": "I love the Page when it's empty and HATE it when it's full.  \nIf you can secure a table, I recommend it.  The Page has a great back space (decorated like some crazy Grandpa's hunting room) with a pool table and extra seating.\n\nThe bartenders are usually pretty indifferent, which I appreciate.  They make their Margarita's from mix, which I don't like, but they were $5 bucks during happy hour so I'll take it.\n\nOn a busy night (Thurs-Sat) be prepared to wait a while for your drink, and then lose most of it while bumping into others on your way back to your group.  Always a good time!\n\nIt's located near lots of buses and close to the Indy.  We sometimes like to pop in before shows, which is nice.  Check this place out if you are ever in the area.", "author": "Carmel U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "Hey what's up PAGE!!!\n\nI have been going here for quite some time, most of the times, you know, you might not be like all good, like a little bit tipsy or just straight up hammered, same thing , right!?\n\nI just wanted to say that this bar is awesome, period.\nIf you don't thinks so, you are probably sober.\nPeople tend to get really drunk here......\n\nAnyhow, short and sweet.\nReally nice bartenders, door guys and beer selection.\nThe jukebox sucks, sorry.\n\nBut I am always back for more.\n\nSniff ya later Page!", "author": "cecilia k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "Great dive bar! Cozy, slightly busy on a Wednesday night. Includes a pool table, and plenty of nooks and crannies to squeeze yourself into. Plenty of beer on tap, including a cider! I loved it here!", "author": "Karina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-22", "description": "I love The Page for multiple reasons:\n\nIt's cozy. \n\nClose.\n\nGreat music.\n\nYou can play fooz-ball and pool. \n\nTheir bathrooms have the best cute-check mirror ever.\n\nThey have quality matches.\n\nThey serve strong drinks (though not exactly cheap)\n\nI feel comfortable coming by myself.\n\nI can watch Simpsons with subtitles.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-25", "description": "$5 for Pliny the elder pints. Nice location. I didn't know it extended to the back with another pool table and foosball. Stools and nice seating. Apparently it's cash only but has an ATM. I'll come again!", "author": "Marty J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-02", "description": "The Page has a lot of potential.\n\nThe inside is rad, it feels a lot like the Red Room in Santa Cruz, except it's got a pool table, you can't smoke, and the jukebox sucks. \n\nDefinitely my favorite bar on Divis, but I'm taking off a star for not giving my girlfriend a free drink on her 21st birthday. Isn't that standard?", "author": "Murphy O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-06", "description": "The best part was when the bouncer knocked half of my drink onto the floor and my friends, and then got in my face about it with his eyes all unfocused and bleary.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "I'd passed by this place more than once and dismissed it as nothing special until I'd finally clued in to the beer selection.  Craft beer, and a fine selection thereof (read: Belgians, wonderful Belgians), on tap or in bottles for your enjoyment.\n\nTo be fair, The Page is no major destination like Toronado or Beer Revolution, but for those in the vicinity who show up at the right time (late afternoon pint-lifting is favored, the place is barely manageable crowd-wise on a Saturday evening) this place is a gem.  Also contains a full bar with other drinks for the beer-disinclined.\n\nLastly, there is also a schmaltzy fabric 'painting' of a deer on the wall that requires your reverence and appreciation.  \n\n Go forth and worship, pint in hand.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "I've actually moved 2 blocks away from The Page since my last review.\n\nSure, it's within walking distance from my apartment and that completely changed my opinion about it. It comes in handy when my liquor cabinet at home is running low and I'm feeling thirsty. On a cold winter night, I don't want to trek more then 3 blocks to grab a drink. Convenience factor = 5 extra points.\n\nThe Page has now become my neighborhood bar. I've never watched Cheers, and I don't even know the entire theme song, but when they say, \"Where everybody knows your nameee...\" I assume they're talking about me and my relationship with The Page.\n\nDrinks are moderately price, my favorite bartender Charlie (shoutout!) knows I need a gin 'n' tonic the second I walk in, and their shitty/old/shady foosball table has grown on me. The crowd is a good mix. And who doesn't love a short stumble home?", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-29", "description": "Last summer, me and my roommates came here every Monday for about 3 weeks and tried to teach ourselves how to play pool.\n\nWe sucked soooo bad.\n\nLuckily, the atmosphere during the week is laidback enough so that the other patrons waiting for us to finish our 40-minute games didn't seem to mind. On the weekend, however, the place is another story, overrun with hipsters that may have took a wrong turn through the Castro and ended up here instead of the Mission. Divis is turning into Valencia's twin, I swear!\n\nThe main perks of the place? The digital jukebox, 2 pool tables, foozeball table, and the facade of a creaky old bookcase and fake flickering candle in the back that remind me of the Haunted Mansion in Disneyland. Oh, and that little nook near the men's bathroom with enough room for just 2, so that you can chill a bit away from the crowd and admire yourself (or your date) in the mirror above the counter.\n\nThere's not much to dislike... it's really a nicer, more spacious version of your typical local dive. I guess I could do without the preserved mountain lion thing and the mooseheads hovering up above, but other than that, this place is great!", "author": "Kate V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Love this place - accidentally came across it last year wandering back from Haight and revisited last night, great atmosphere! Nice staff, nice drinks and a pool table out the back to keep the boys occupied!", "author": "Tracy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "It's hard finding nice bartenders and door staff at hip bars in San Francisco. I'm still reeling from a geeky adolscense and I often don't feel cool enough in a lot of places in the City.\n\nI had an experience last night at The Page that reminded me just how good it feels when you encounter a friendly staff on a night out.\n\nI went to the Page for drinks with a friend and we had a fine time enjoying the abundance of cute little hipster males in the place. As she took off, I went outside to my parked Vespa to ride home. To my dismay, I actually watched myself, in slow-motion, lock my keys in the storage compartment of my scooter along with my cell phone, wallet, and house keys. It was 12:30 in the morning. I had no cash in my pocked. I was a few miles from my house and I couldn't remember anyones number.\n\nGarrett, the door guy, tried to help me pop the lock. When he couldn't get it, he borrowed the bartenders cell phone to call me a locksmith. We waited for a bit and then Garrett suggested that he cancel the locksmith, who was going to cost $200, and try to get home to wake up my roommate to get my spare key. He even offered me bus fare for Muni! I realized that he was right and it was probably cheaper to take a cab to home, grab the key, take a cab back, and then grab my scoot. I did just that. It saved me a lot of money and a lot of time waiting in the middle of the night.\n\nSo thanks to Garrett and the rest of the helpful and hip patrons and staff of the Page! You made this moron's night a little easier to contend with!", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "\"Cheap\" George T. Stagg Bourbon", "author": "Jared C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-21", "description": "Should I like you or not like you? You teeter me on ruination. You make me feel claustrophobic but I feel subservient to a weird masochistic beating by sitting there, taking your surly ways, and flinging my ideas off your walls -- all the way to wanting to try to play two games of pool on the two different tables at the same time. When considering the difficult questions in life: the chicken or the egg, the olive or the gin, the yelper or Yelp, The Page solves one of them, at least: Gorgeous Men in Flannel before The Page. Dare I feel inferior amongst you? Nigh! You embolden my goal to never wear patterns in San Francisco. And that's why I like you.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "The page is great - amazing beer selection...lost abbey, Russian river etc. And pool and bad ass taxidermied animals and super reasonable prices...what more do you want?\n\nAnd by the way to the previous reviewer, I AM a bartender and a hot toddy IS whiskey, water and lemon juice, sometimes people confuse toddies with hot buttered brandy and rum but that's your problem, not the Page's", "author": "Ben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-11", "description": "So my friend offered his house for my birthday party on a Sunday afternoon. It was margaritas and Mexican night and we had a few too many margs, amongst 10 of us, and by 9:00 pm we decided to head down the hill to The Page.\n\nWe should not have been served. Any of us. We were face down ass up, tore up from the floor up, just a bunch of drunken maniacs. So from 9pm - 1am, according to the times on my pictures, we continued to suck down cocktails and nonstop shots of Jagermeister, play pool, harass all the locals, the poor sweet bartender gal, and I even got a free drink at midnight. \n\n5 stars for serving all of us blacked out alcoholics for 4 hours!!!", "author": "Braden B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "The Page was fantastic!  We had a birthday/fundraiser for our nonprofit at the bar and Bob was extremely friendly and open to the idea!  It was my first time there.  The beer selection was fantastic and the staff terrific.  It is cash only, but it wasn't a problem since they had a cash machine on the premises.  I will continue to promote and support The Page whenever in San Francisco.  Thanks Bob and The Page!  Flowering Hope", "author": "Flowering Hope O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-15", "description": "An awesomely mellow bar that has comfy tables and chairs for you and your friends to take over for the week's latest rendezvous. It's very chill, the people are nice, and it's a fav. Points for the Arrogant Bastard on tap, a total tribute to my san marcos-ian past.\n\nAlso a plus, my single girlfriends tell me they usually meet men here.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "One of my most favorite neighborhood bars!  This place is easily within walking distance from my house, the vibe is very laid back and mellow, there is plenty of room to sit down or head to the back to play some bar games, and you are always sure to meet someone new every time you go there.  I love this place as somewhere to start the night, to stop in for last call or to just spend all evening there with friends.  \n\nThe staff is great and friendly, especially the dirty blonde gentleman checking ID's, and the bartenders are attentive and quick, not to mention fun! Drinks are pretty inexpensive and never lacking a strong taste. If I could go here every night and make it seem like I do not have a problem, I would!", "author": "Alexa V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Five stars for the beer selection. Often as good as Toronado. In weekend and later evenings it can get jammed up with a crowd I don't care much for. This was my go to after work spot when I lived here.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-23", "description": "Taxidermy, a narrow hall, pool tables,foos ball tables, beer, wine and lots of young people on a Saturday night pounding back drinks. That's The Page (and other bars in the lower Haight). \n\nThe bouncer and patrons hanging outside the door paid my friends and me a great compliment while carding us. They were playing \"guess how old these old guys are\". They all guessed that we were born in the 70s. Thank you very much, I'll buy you guys beer later (we were all in our late 40s and I'm in my 50s).\n\nGood choice of beer at the pub. We had IPA of some sort then I moved on and tried Sierra Nevada, Glissade. This is a bock beer, I suppose it is of the traditional pale bocks of Germany. A little too malty for me, but when you're getting elbowed by so many people, it didn't matter.\n\nMove down further into the dark hall, and go down the stairs and you'll see an additional pool table and good luck trying to find a place to squish in. This place reminds of my college days and our student union building. Look up and you'll find a multi-point trophy buck deer head mount staring right back at you. ~ Dorfman! What kind of man hits a defenseless animal? \n\nGreat place to hang out.", "author": "Reyz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-13", "description": "The Page is the most authentic \"neighborhood bar\" I've found in this city.  Great laid back atmosphere, personable/friendly bar staff, great beer selection, and a superb selection of bourbons and whiskies.  For hanging out after work, there is no better option in the area, but sadly once it gets later this place gets filled to capacity with amateur douchebags, marina kids, and the B&T crowd who apparently has never been told how to act in a bar.  It's these cretins who I suspect have written some of the more negative reviews below, so if you know how to act ignore those reviews and stop by for a pint or three sometime after work.  You'll be glad you did.  If you're looking for hella shots of jager \"bra\" and will get huffy when they tell you it's cash only, please do us all a favor and return to the marina or polk street where you'll be more at home.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-28", "description": "My guy friends always want to go here - the foos ball table is the draw.  And what a draw it is.  They inevitably play foos, get pretty drunk and I wonder why I came here.\n\nFor me, it's generally too crowded and I've never had a drink I liked here.  At a regular bar, I always order my regular drink - vodka soda.  I'm not particular about my vodka (really), unless I'm feeling fancypants.  Everytime I order that drink at The Page, it tastes like a gin and soda.  I can only assume it's the particular variety of cheap vodka they use (and I'm all about cheap).  So I've remedied that by choosing beer, but I wish I didn't have to.\n\nAnyhow - The Page is cool for a place to meet up or a place to end up, but not my ideal spot.", "author": "Mac M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-13", "description": "I was a good solid fan of the Page, maybe because its one block from where I live but this weekend it all changed.  The Page during the week, 4 stars; the Page on a Saturday 2-3.  \n\nThe Page's beer selection reads like an indie record.  Recently I drank a 3-star beer from Kenya and some super delicious Belgian beer.  The beers and relaxed weekday crowd is worthy of 4 stars but alas the weekend ruins it....\n\nThis past Saturday I walked in to some crowded, weird college singles party.  In the back was a man who looked like the Geico cave man, which isn't a problem per se, I think they are cute.  What was a problem was the two guys in the front corner who looked like skin heads straight out of American History X.   I know, don't judge a book by its cover but perhaps they may want to reconsider bic'ing their head and all black army style wardrobe.  Isn't the most friendly outfit.  Even so they aren't the reason for 3 stars, it was the collective group.\n\nSorry Page I do want you to succeed with your foosball table, so just go during the week, unless you like the college cool kids party then Page away on the weekend!\n\nps.  It's cash only.", "author": "Kristin Marie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-26", "description": "My roommates have deemed The Page \"the last resort\" if your quest to makeout has failed over the course of the evening.  I wouldn't necessarily agree....because no one in here is smiling.  Over the foosball table, brows are furied in concentration.  Artsy dames lurk in the corner, scowling out at the crowd.  I cannot tell you how many eye rolls I've received when trying to strike up a conversation with dudes at this bar.  Look, I know your childhood in upper-middle class Marin must have been a doozey and you are compensating by living the Bohemian life in the big bad City, but could you at least TRY to be polite?  \n\nYou can't win 'em all and I'm not gonna knock The Page just because I strike out here consistently.  The vibe can be described as \"stoner-mellow\" and if your night is on the verge of teetering towards sleepy-time you might pass out in your chair here.  The bar itself is pretty rad though...tons of old, funky detail, tasteful, vintage furnishings, and a pretty solid beer selection.  Would recommend it to meet someone for a quiet drink, but wouldn't plan the whole night around it.", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-24", "description": "I have only been here once, but I'll give you the low-down from what I know.\n\nCash Only. Good to know. They have wine, but I realized this is really more of a beer drinking place, as you get pushed, kicked, and knocked around all over. There's never a safe place to stand as people are always trying to get by.\n\nPool tables in the back... cool.\n\nVery long and narrow space with a diverse crowd. I'd come back, but it probably won't be at the top of my list.", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "It's big, it's cozy, it's comfortable, it's easy to get a seat, it's got two pool tables and a foosball table, the nicest bartenders, tons of beer on tap, generous pours, a motley crew of barflies, and a cheap jukebox. What more do you need?", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "This place is a quintessential dive - the way a dive should be. Lots of beers (incl my fave, double chocolate stout). Red leather chairs. A digital jukebox. A combination of hipsters and frat boys.  No tourists.\n\nLayla the bartender rocks!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "The place smelled very strongly of urine in the main rooms while we were there last week during the early evening... Very off-putting.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "A good crowd can usually be found here but the place is starting to look pretty shabby and worn.", "author": "Rita A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "This was usually a hit but at times a miss. \n\nThey had a great selection of beers on tap, but when it was a miss I would call it a brocation--a bratwurstfest. The pool table is available for you hustlers and as a make-out stool when the bar is full--seen it plenty of times!\n\n I miss you SF but keep a page open for me when I arrive, and soak it with the urine stench I'm familiar with!", "author": "Ishmael V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-30", "description": "I'm a little sad to have to write this review.  I live in western addition, have been there for 5+ years.  The Page has been a mainstay for me while here.  \n\nLast night I was there with a friend and a work client.  We were at NOPA for dinner before, then headed to The Page for some drinks.\n\nWe were immediately snubbed by the two bartenders, for reasons I cannot explain.  We were friendly, talkative, but not annoying.  However, we must not have ranked high enough on the cool scale. \n\nWe had a couple drinks and then the bartender proceeded to cut me off.  I was a little shocked, as I had about 4 beers and a shot.  I don't consider myself a lightweight, but maybe I need to self evaluate.\n\nI'm not trying to hate on The Page, as I think it's probably the best bar in the neighborhood.  However, the bartenders are a bit questionable.  I get that it's a cool part of town and they need to come across as being sort of hip, but the whole 'I don't care about anything, dress like a slob and I'm cooler than you thing' is a little much.  If need be, I can watch the Star Wars trilogy and brush up on my Sci-Fi knowledge, just post a disclaimer at the door.  Plus, the bartender had some boyfriend-type kicking it at the bar while she worked...He tried to get involved once I was 'cut-off', which I didn't appreciate.  When I follow my wife to work and loiter, I at least stay out of her affairs.  Maybe you should do the same.  \n\nIn conclusion, The Page is dope, but the bartenders are whack.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-10", "description": "I'm gonna go ahead and give The Page 4 stars. The girls running the bar Thursday (4/7) night were effing awesome. Super sweet, super cute, very fast! And accurate with their mixes! Not too strong/not to weak of drinks. \n\nThis bar is a diver, but not nasty- at least not when I went. I have only been here one time. I will say, a round of beers/shots (for 4 people) cost $40- woof! If you think about it and break it down to 8 drinks, I suppose that's standard. (The bars I'm used to going to LA don't charge that much, but then again, this is an expensive city.)\n\nI had a really good time, got pretty drunk, but all in all, glad we finished our night at The Page.\n\n*We got a super sweet and badass cab driver right outside which is like, UNHEARD OF for us... so maybe this is the right neighborhood to be going out in.", "author": "Savannah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-14", "description": "Neighborhood bar. They have pool tables and foosball which is always a plus. It can get really crowded at times. The crowd can be hit or miss. Sometimes people run the jukebox that shouldn't. Cash only which is always a bummer.", "author": "Raul R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "I'm a big fan of The Page!  It's the definition of a dive bar... very relaxed and chill atmosphere.  It doesn't look like they've changed the décor in 50 years, but it works.\n\nThey always have a variety of good beers on tap and the bartenders are pleasant.  If you are in the area and you're looking to unwind, socialize, and drink good beer, check out The Page.", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-14", "description": "The bar itself is rad. I totally dig it, and when i'm in the area i stop in, or if i'm meeting someone from across town i suggest this as a halfway spot. The selection of beer isn't small!\n\nBut on a cold night, i like an irish coffee or a hot toddy. The irish coffees i got had too much whiskey (yes, folks, there is such a thing), and were lukewarm at best. There was barely any coffee in them (i got a couple, hoping there would be some improvement with the second--there wasn't), too much booze, and the cream wasn't frothed or floated on top, just poured right in. It was a mess. The hot toddy was only slightly better, though just slightly. It had less booze and was hot, but it was basically hot lemon water with whiskey(?), and a slice of lemon with some cloves stuck in it.\n\nLong story short: I like The Page. I do. I like beer, i promise. But i like hot drinks, and this place could not make them right. I'll be back for the beer.", "author": "Phuong M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "Good local's bar for a chill night with friends.  \n\nGood beer, cheap drinks and a friendly crowd : )\n\nThe service was fast even when busy and it was easy to find a couple of seats...also,  2 pool tables and a foosball table as well. \n\nOverall, I had a great time, although if you're looking for a crazy, trendy scene this is definitely NOT the place. It's very much casual but a nice break on a weeknight.", "author": "Emilee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "Very fun place to hang out.  Reasonably priced drinks, pool tables, a foosball table, and a great vibe.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-28", "description": "\"What are you two ladies doing in a dive bar like The Page?\"\n\nLong pause wherein my friend and I exchange awkward glances and in sync respond in the only way we know how: \"Drinking?\"\n\nThe Page is pure class. I thoroughly enjoy the roaring bobcat and other such taxidermy and the general congeniality of the atmosphere. It gets pretty cozy in here, so you are bound to make a new friend or to annoy somebody who is playing pool because you are standing in their way (\"No really, I don't mind if you jab my eye out with your pool stick!\" [that's what she said] {somebody stop me now because now my asides are having asides and things could get pretty meta if nobody intervenes}). There is also a little make-out nook behind the bathrooms that has always been occupied when I am there but it looks awesome and reminiscent of a confessional. \n\nA staple in my bar hopping repertoire.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "This place is awesome! If you are ever in the area and looking for a quick drink this is the place you have to go.\n\nAre you a fan of fernet? Well... I definitely am and they have it chilled ready", "author": "Bob S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-29", "description": "If you want to get some frat boy hipster valley girl sorority Walnut Creek bridge and tunnel plastic ass then put your best white boy Entourage act on and gather 'round with the rest of your worthless friends in the hottest budget meat market in the Divisedero Corridor!\n\nLiving within a few houses of The Page and listening to frat boy douchebags yelling \"go suck some dick you fucking fag!\" at 12:15am is no longer some strange occurrence, but rather the new mentality that has infected this former neighborhood bar. Gone are the days where it was a chill place with a good mixed crowd and a genuine neighborhood feel to it. \n\nNow you'll find the shallow plasticity of the Marina-bridge-and-tunnel crowd jockeying for some ass. Motivated by their inner need to go somewhere that's safe yet \"dirty\" so they can feel like they're getting their true \"city\" experience. It's much like the white frat boys that bump hip hop and trying to be \"ghetto\" because their Abercrombie lives have no culture.\n\nThe Page is dead to all of those that have taste. The current swarm of \"totally like omg like he was so like looking at me and I'm gonna hella like make out with him and take in the ass if he gets me drunk enough\" has destroyed this bar and the only solution to ending things is to get some real booty ass scene in there to beat the crap out of these kids and make them feel unsafe so they'll retreat back to their Disneyland neighborhoods and hometowns.", "author": "R B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-18", "description": "Dive bar for a younger crowd instead of an older, more alcoholic one.  They have Tecate in the can, which is pretty sweet in my book.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "I love this neighborhood corner bar - they have 2 pool tables and allow dogs (no food here).  The bartender is cool and the drinks are really well priced.  They have a nice selection of beers on tap as well.", "author": "Virginia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-20", "description": "The ladies and I head out for a drink at Madrone a block down from The Page. Apparently it's jazz night there on Sundays; that is what the sign said. But what they didn't say was \"couples only!\" We got the stare from every couple in the place, which was everyone. \"The stare\" cannot adequately be described without sounding like Carrie Bradshaw, so I will just say it was bad enough to turn right around and walk out knowing we were in foreign grounds and did not have the required passport. We were feeling a bit on the lonely single side but we kept looking. We persevered. \n\nSo, we walked down to The Page. We found asylum. We were greeted with smiles, cold drinks, taxidermy (score!) and good music. You can thank yours truely for the good music and whoever accidently left two unused credits in the Juke Box.  \n\nThe beauty of any good dive bar, like here, is that you can easily keep to yourself or mingle with strangers, what ever your preference is. \n\nThe bar stools had backs and the seats had armrests. It's the little things in life that make me happy. Nice seats, although I never had an opinion on before, are part of those little things that sometimes just stand out. One more thing that stood out was the hand dryer in the women's rest room. It was proper. Second best thing to a Dyson actually. That, I appreciated. So to who ever put that in thinking, \"I hope people enjoy this and it keeps them coming back\", it worked my friend, it worked, brilliantly! \n\nSo thank you to The Page, for taking us single ladies in without judgment and reminding us that if we were not single, we may have to be listening to jazz music and the sound of bitching about trust issues or carpet samples from our boyfriends. You gotta look on the bright side!", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "I started riding the 71 Noriega in the mid-eighties though it wouldn't be until the early nineties that I would discover Page street.  Having moved away from the city at the age of 20 I was never able to experiences the sinful pleasures of adulthood in my home town.  Years later I had the privilege to visit what I have decided is my favorite bar hands down.\n\nFrom the funky decoration to the friendly atmosphere I can say for certain that I am as at home here as I might be riding any Noriega bus.", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "Great beer Selection!\n\nLinden Street Black Lager, nice microbrew stouts and a few wild cards.\n\nThis is a dive bar that has upgraded just enough to maintain it's dive status and still appeal to folks that want more than a shot of Jack and a Bud (those that do want Jack and Bud will still fit in).\n\nHappy hour runs until 7 and two beers (when you are buying for a friend) will cost less than $5.\n\nStereo played some favorites -- including Joy Division.", "author": "tjay f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "1. ) The Page is not in lower haight!\n\n2.) I love love love to come here on mellow (M-W) nights with friends and throw some bones or play some cribbage, or some other old person game.\n\n3.) Staff is lovely; door guys are the nicest around.\n\n4.) Revolving beers on tap-not always the same ole stuff; plus they always have a monthly liquor special.\n\n5.) i would give it 5 if I even considered entering on the weekends-long and narrow setup + lotsa people = not quite as fun. Not their fault though! I love the page :)", "author": "Afton T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-18", "description": "Drinks are overpriced, clientele is more like what you'd expect in the Marina: obnoxious former frat guys who refer to each other as \"bra\" and whose humor centered around \"embarrassing\" drinking stories and degrading women. It was a cliche of heteronormativity.", "author": "Nikolas B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-19", "description": "The Page is the Foo Fighters of bars.\n\nNot necessarily bad, lots of redeeming qualities, and intelligently put together, but way overrated and the crowd drives me away.\n\nWhy anyone would go out of their way to go to a neighborhood bar that's not in their neighborhood is beyond me.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "Walked in here randomly while waiting for a pizza.  \n\nABITA AMBER ON TAP. Hell's yeah!  I got a great seat next to a filthy window with sunlight just making it into the joint.  Good beer-drinking music on the jukebox.  \n\nI only went in for one happy hour beer and left. But, it was exactly what I needed.  Thanks for being there The Page.", "author": "Cameron M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "This was stop number 3 on the the impromptu \"Bar crawl of San Francisco, 2009.\"\nIt fulfilled my needs at the moment. A clean bathroom. A seat at the bar. A shot of vodka. and a clean bathroom. the first and last part was the most important ;)", "author": "Mia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "The Page is a fun place to grab a few beers, if you're in the neighborhood. I would describe it as a quaint dive bar. The large furniture, dark wood, and built-in bookshelves give it an old-fashioned charm that I very much appreciate. Add to that a great beer selection and friendly crowd and you're left with a comfortable place to meet up with a few friends.", "author": "Brett B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "The Page is your classic dive bar. Great dark atmosphere with good tunes playing in the background. Bartenders are quick and responsive, and prices are decent. Its your quintessential neighborhood bar, awesome place", "author": "Phillip F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "The Page is perfect.  Its a great bar to meet friends at during the week.  Very local feel and it also has a dive bar feel to it.  What really makes this place is the great beer selection.  Its hard to find any bars with Pliney the Elder on Tap and that alone will always make me love The Page!", "author": "Ben K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-25", "description": "For a local bar with a lot of regulars; this is a pretty decent spot. I like to go here for an early happy hour because it does get crowded quick. \n\nOne of my favorite things about the bar is they have a monthly or weekly whiskey special. Its a great way do expand your alcoholic palate for a measly $5 bucks! \n\nI will say for a bar this close to Toronado I would probably expect a larger beer selection but maybe I'm being a bit picky. \n\nThere are a few pool tables in the back room but we never really got around to enjoying them. \n\nPlease don't bother ur pretty little head with the jukebox. Its a waste of time and money. If there are more than 10 people int he bar you are not going to be able to hear a damn thing!", "author": "Brittany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "My friend told me about the Page, decided to check it out. It didn't disappoint. \n\nI really enjoyed the old school style of the bar and it's refreshing non-hipness (we had just cruised down divis trying to escape said hipness) and the decorum is a throwback to the SF old days. \n\nSeems like everyone in there when we came by might have been a regular and it was packed. The bartenders were quick and attentive. Pooltable and foos in the back. I'm impressed and will be going back.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "When I lived near the Lower Haight this was my go-to neighborhood spot and it still a favorite of mine. It can be prohibitively crowded, but even on busy nights my friends and I have been able to snag a table and post up here for a good time (added bonus when next to their excellent electronic jukebox). Ultimately, I think it's the cozy, hunting-lodge feel of this place that makes it stand out.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-16", "description": "My friends and I lovingly refer to this place as the lumberjack convention because well, everyone was wearing plaid in there (including myself...I honestly felt a little uncomfortable, i thought I was free of uniforms when I graduated high school!)  While the crowd was pretty homogenous, I still had a blast.  Lets just say playing pool while intoxicated when you suck at pool to begin with can prove incredibly embarrassing. My friend and I should never be allowed to play pool there again we were so bad.  Except, that I plan on going back and playing again, you know to get practice and whatnot...\n\nI like this place enough and the drinks are cheap and I live close by, therefore I will be back", "author": "Alixandria F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-17", "description": "I'll still go back even though I think the bartenders are complete a**holes and the music is so low you can barely hear it.  It's in the hood and they have pool.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Very much down to earth bar.  We loved the games and reasonable prices.  Wasn't a fan of the 'cash only' system, but worth the atmosphere.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "Definitely a pretty good dive bar. Nothing special, bartenders are nice though. Someone did steal my jacket, but that's no fault of the establishment.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "The Page is fun and divey on most weeknights.  On Thursdays, it sucks because it's in between divey and weekend-hipster-sceney.  On Friday nights, well, it's just sceney.  Not hipsters-only sceney, but sceney nonetheless.\n\nWhat I like about this place, even on sceney nights, is that everyone seems to be afraid to crowd the lower level.  There's a pool table in the back, but if you go down the stairs, there's yet another pool table.  There's also a foosball table way by the back, and although it can often by overcrowded by annoying hipsters, it's often being used (surprisingly) by people who just want to play foosball.  That's awesome.\n\nWhat isn't awesome is that the last time I was here, I was being distracted in my goalkeeper-and-back-line duties by an annoying drunk girl nicknamed Tim who wouldn't stop going on about the authenticity of her Vietnam War-era jacket.  And I wasn't distracted in that way--I was distracted because she wouldn't shut up, and my team ended up losing because of my poor goalkeeping.  I also don't like the fact that there are three goalkeepers as opposed to one, nor do I like the fact that this is a particularly dangerous foosball table because the bars extend too far and don't have rubber pads on their ends.\n\nBut it's cool hanging out down here, and the change machine works remarkably well, and if you stand in the corner you can guard your stuff effortlessly.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "The Page is my favorite bar on Divisadero- reasonably priced drinks and a funky vibe. It's a good place to go with friends when you want to have a conversation without yelling. Seats are hard to come by, which is the only bummer, because there's only a few tables. I've usually been able to figure something out as far as seating, but during the week it's a good place to hang out for a low-key drink.", "author": "Christine T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-22", "description": "This appears to be a nice, plain, neighborhood bar.  \n\nOn Friday the 13th my Love was in L.A., and I was looking for some decent conversation.  Kudos to Sus.annah B for keeping the DYL going in San Francisco!  At least when I am talking with Yelpers, I know the conversation will be intelligent.  \n\nIt was still daylight when I arrived at 7pm, and about a half dozen Yelpers were gathered in a window where we could watch the street and enjoy the evening sunlight.  I did indeed find the intelligent conversation I was seeking.  I also met Bill B, who keeps the DYL tradition alive in the East Bay.  \n\nA rum and Coke cost me $4.50 + tip.  Service was about normal for 2 bartenders and a busy queue.  \n\nLooking to the back of the room, I saw a very active pool table.  Someone also mentioned that there is a picture of a stuffed animal head back there, wondering what was the point.  I think, perhaps, it's more humane and eco-friendly?  \n\nMany Yelpers took off for a birthday party across town, but I was content to walk back home and dream of my Lover's return.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-10", "description": "Place was pretty packed with what looked like college-age students. They had a great selection of beers on tap, the crowd is more laid back and casual which is nice.\nUnfortunately there is very limited seating here and you might have to be standing and drinking all night. However, there are some pretty cool pool tables if you're into that, and foosball is also all the way in the back. Great little bar for chilling out - if you get a place to sit.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "This place definitely has a meeting-hall-for-mysterious-centuries-old men's-groups vibe to it.  Reminiscent of a hunting lodge, a library or an art gallery, the wood-paneled walls are adorned with deer heads, elk heads, paintings of deer heads on a wall across from an actual deer head (thanks for the alert Keith) and reproductions of fine art.  Two pool tables are available for $1 per game (though one table is poorly located in the middle of the space, causing one to nearly jab people in the eye or the nether regions with a cue stick), and foosball exists as well.\n\nI really enjoyed the neighborhood feel of the bar - it has almost a Cheers-y thing going for it, at least during happy hour ($1 off wells and beer).  It's a great little spot to sit back and watch TV after work, maybe with the whiskey of the month for $5.50, and feel like you're at home, except even better because they probably have more booze.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "Pool Table.  Plenty of seating & close by.\n\nAt times, it smells of \"bar\", but you come to expect that in a \"bar\"  ;)", "author": "sUper j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "I'd just like to say that I have now lived in the lower Haight for almost two years and this is my favorite bar. They have a solid and unique beer selection, a good liquor selection including an ever changing whiskey of the month, pool, foosball, and a great jukebox. The ambiance is great with a friendly bar staff and a great feeling of people having a good time. I love this place. It does lose a star because it often is way too crowded. I guess people share my sentiment. \n\nWhy do I have favor this to other lower Haight bars? Let's take a look:\n1. Danny Coyle's - boring beer selection. Kinda douchie, but not, but it kinda is.\n2. Mad Dog - Why is this place so empty on a friday night?\n3. Toronado - as a developing beer afficionado, I have to love the ever changing unique selection of beers they have. Unfortunately they also have grumpy bartenders, the backroom with the tv smells that very much like the adjacent bathroom, and there is never a sense of people having a good time.\n4. Nickie's - Too far. Fillmore St. is like an invisible fence that I can never get through.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "I liked The Page. We were there on a weeknight; it was nice, quiet and unpretentious despite the hipster crowd. I had a Racer 5. If it weren't 3000 miles from my home in Rhode Island I'd probably add it to my dive-bar list.", "author": "Amelia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "I am fond of this bar, which I'd say is an \"upscale dive,\" for two reasons:\n\nExhibit A: The fact that they serve a good variety of beers, including one delightful brew known as \"Moose Drool.\" Good to the last drop!\n\nExhibit B: The downstairs area that looks like someone's funky rec room circa 1980, complete with pool tables, foosball and the heads of large game animals.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "My neighborhood bar The Page offers everything I need in a bar: two pool tables, foosball, ample seating (gotta love the wooden tables & taxidermy vibe), and great selection of whiskey with a new type featured every month. Sure the chill weekday neighborhood vibe gives way to a slighty homogenous weekend crowd that would do better with a dash diversity. But that's not the bar's fault, is it?", "author": "Quentin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "This small dive-y bar was on the cheap side (yeah!) but got really crowded later in the night (which is good for them & it was a Friday - just not my scene into the late night!).  Not too many hipsters (another yeah!). Beer selection was great - had a vodka tonic which was on the weak side, so when I go back, I will stick with the beer. Also had a fun game to play on the bar top - a \"how are the pictures different\" thing you would see in a magazine but a XXX picture.  I love the raunchiness at my dive bars!", "author": "stephany m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "One of two bars I know that I can always get Pliny.  Not being from SF, this is critically important to my experience. Honestly, couldn't care about anything else, but seems like a fun place.  It's never been too busy when I've been there, so I'd like to see the whole crowd in action...", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "Two girls cornered me on Saturday night.  As we waited in the cramped hallway to the restroom, they began digging through their purses to find me a present.\n\nApparently, I had been nice to one of the girls when I asked if I could steal a chair from her table.  Then, I had been nice to the other girl when my friends and I toasted her with our kamikaze shots.\n\nSee, boys and girls?  Being nice =  free sh*t in the Ladies Room.  Err...\n\nEmptying out their handbags, they chirped  \"Take this!\"  \"No, take this, instead!\"  After much deliberation, I selected a lip-plumping lip gloss from the JCrew worker and a compact hairbrush from the hairstylist.\n\nI'm baffled:  Either the strong drinks helped us form a bond, or I now have herpes and lice.", "author": "Janney B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-17", "description": "I was a huge fan of Chances but was excited 5 years ago when a new direction was taken. Overall I like this bar. It's local, prices are decent and service is good even when packed. The pool tables get a little cramped but it's not bad. I'd say overall it's an above average dive bar.\n\nI Miss Chances, but support the Page...", "author": "Morgan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-18", "description": "Here is what happened last week, on a Monday night, at 11pm, which brought me to this average, dimly lit, loungy in a dated way, semi-hip neighborhood watering hole;\n\n*ring* \n*ring*\n\nMe - \"Hello\"\nEd - \"What are you doing? Lets go drink!\"\nMe - \"No. I am tired. I can't\"\nEd - \"WHY?\" (sound of desperation in his voice)\nMe - \"It's Monday, plus I have an interview tomorrow so I need to be well rested\"\nEd - \"But, come on.....\"\nMe - \"Absolutely not, no way, no how\"\nEd - \"Please...we can meet at a bar halfway between us\"\nMe - \"No, I have to sleep!\"\nEd - \"Rookie\"\nMe - \"I'll be there in 15 minutes\"\n\nRookie? What?? I showed him!!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-26", "description": "Woooaahhh Gabe gave a bar 2 stars?  Yess siirrr\nWoooaahhh Gabe gave a bar in his hood' 2 stars?  Yes sirrr\nWoooaahhh Gabe gave a bar that makes DJC's 2 stars? Yes sirrr\n\nSo why didn't Gabe give this bar 1 star if he doesn't like it?  Tupac Baby!  They got Tupac on the Juke Box..  Name 5 other bars in SF that play Tupac?  I know one other (Thieves Tavern).\n\nAny place where the owner tells you to move away from the door because customers think you are the Bouncer/Doorman, is weak!  ( I got yelpers to prove it) fuck that.. put your doorman outside next time.  \n\nWill the real Doorman please stand up?  His name is Brian.. good dood!  Nothing bad to say about him.\n\nI've been to Page a handful of times and not once did I really enjoy myself.\n*********\nupdate 2 days later ;0)\n*********\nSo add a star for 3 reasons... \n1) Owner was working the door and we discussed what had happened 2 days earlier... I have a lot more respect for the man today.\n2) what's that bartenders name?  Rachel?  Hi Rachel\n3) THEY GOT MOTHA FUCKIN PAC ON THE BOX!!!", "author": "Jamal G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "How the hell did I get here from Jade?\n\nDid I really go there?\n\nCan someone tell me?\n\n\n_________                                                                                ___________\n|                   |                                                                                |                        |\n|   JADE      |                                  ? ME ?                                  |  THE PAGE  |\n|                   |                                       O                                      |                        |\n|      6pm     |                                      / | \\                                     |       12am      |\n|.________|                                       /\\                                      |__________.|\n                                       still wondering 2 days later", "author": "Margie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-30", "description": "Once I had a date with the dreamiest girl here. What started late at The Page ended at her place, where we fooled around with Zoolander quietly on in the b/g (both of us had seen it, never WATCH anything when you're necking). The, um, feelings we shared that  night, well let's just say that in the light of day, the dream was dead. Today dead's about the only time I like (and LIKE's a strong word) The Page. There on a holiday weekend. When it gets \"hopping\". Ugh.\n\nAt its best The Page draws just enough wallet chains so that their patrons with endowments, trust funds and such, won't be a-scared. To yuppies it resembles a dive JUST enough. To scruffy wide-belters it saves them the inconvenience of hauling their slim asses down to La Mission. A real meeting of the minds when you see Yuppio And Hipsterette sharing blow in one of The Page's many dark corners.\n\nBasically a Two Star joint. And I'll bump it One for making me laugh. There's something about standing outside ANY bar talking to Gabriel when a Carload Of Whitey starts handing him their IDs as though he's Bouncy Von Bouncerton that never fails to crack me up.\n\nAnd there's no Hard Cider on tap. The Page had better amuse me again soon or I'm putting that Star in cold storage. At the very least I hope the lighting there limns me up good because I REALLY need to see Zoolander again.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "I'm unsure why I've never been to The Page prior to last night.  I've passed by it enough and it's on the outskirts of my hood.  Thanks to a co-worker suggesting it for a place to meet up, I finally made it here.\n\nNot much to say other than it's your typical dive bar.  They do have an impressive list of beers on tap and in the bottle.  My favorite being Arrogant Bastard!  It was a bit hoppy for me, but I liked the name so much I got it!\n\nThe clientele seems local and pretty low key.  It got a bit crazy for a while with only one bartender but she was working hard for the money!   They have two pool tables so if that's your thing, it's a good place to come!  I also liked the fact that there was abundant seating around at least one of the pool tables so people could watch.\n\nI think I'll be back to this bar...it's close enough to walk and/or a short ride on the 24.  I've also made it a resolution to get to know more beers so this is a good local place to do so!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "As charming as I can be, I am, fundamentally, one scary lady. AK doesn't mess around. So it would probably be really stupid of you to pack yourself and your girlfriends three-deep in the one women's stall at the Page and proceed to sniff, snort, and giggle your way through what I can only imagine is a bag full of blow, on MY time while I WAIT to pee. Over and over again throughout the night. That would not only be stupid, that would be potentially dangerous. I may start to become impatient. I may knock and passive-aggressively ask when you bitches plan on coming out. I may huff and puff and blow the door down before shooting eye-daggers at you for the rest of the night until you curl up in a little ball and cry for your mother. Or I may simply tell the bar staff what you're up to and have them escort your bleached blonde ass out.\n\nSuch was the case on a recent trip to the Page. And even with all that dim-bitchery, I had a pretty good time. The crowd is a lot lighter on the douchebag hipster NOPA (please stop calling it that! It's the WESTERN ADDITION. I KNOW. I GREW UP HERE) crowds at Fly, Madrone, and Waziema put together. And when our favorite neighborhood spot closes early, as they're known to do, I think The Page will be our new default hang out. Door man, You Rock! Bartender with the curly hair, You Rock! Bartender with the ponytail, You Rock! Guy in hooded sweatshirt with long hair undressing me with your eyes on the sidewalk, You Don't Rock! But you didn't bother me nearly as much as you would have had we been outside of Fly. \n\nThe drinks were fairly cheap, there's a lot of space and ample seating (though it gets pretty packed), there are pool tables and a fireplace and all kinds of boys. This is the friendliest bar staff in the hood, with the exception of Bar 821, and they serve alcohol right up til 1:45 a.m. Now that's my kind of place.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-12", "description": "I was told that my reviews are all about men and getting laid. \n\nFuck yeah they are!!!  I live vicariously through my own journalistic whims and imaginary illusions. \n\nOn that note....here goes yet ANOTHER wistfully lustful anecdote:\n\nThe Page is a bonafide sausage fest.  My party pal colleagues of the night decided to rate the bar on a scale of penises....or penii if you will (and YOU KNOW that I will).\n\nWe gave The Page a very decent three penii score.   A horde of boys (a few even being attractive) and cheap drinks. \n\nIf I new about this place when I lived in the area a couple years ago I could've gotten laid WAY MORE often than I did.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-19", "description": "I had a short, intense affair with the Page which ended in a spectacularly bad fashion, as it set the stage for an extremely negative turn of events in my life and ever since, I just can't really come here and have any fun. The other thing is that since moving to the neighborhood, I find that this place is always really crowded and just doesn't have that low key, neighborhood bar, life is rough, let's just have a drink, appeal that I crave.  \n\nI do however, greatly enjoy their jukebox.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-04", "description": "Foooooooooooooosball!\n\n I had barely played since my days in San Diego, when I lived in a house with 4 other dudes & our lives consisted of surfing/skating & weekly Foosball/Ping-Pong tournaments (yes, we even had a scoreboard). Our biggest problem was deciding on what type of beer would stay cold in the kegerator, and I was on my way to becoming a professional Foos player.\n\nTimes have changed.\n\nI have lost my skills on the table, but with the help of The Page they will return yet again & I will be an unstoppable Foos-force. And the fact that I can rock out to their well-stocked digital jukebox will keep me in the Foos-Zone. And if there's a song they don't have, I can simply download it!\n\nLet's not forget about their beer selection, either. It ranges from PBR to Chimay & even some obscure stuff like an Oatmeal Beer. I even decided to throw it back to my San Diego days while I was at this spot... and have an Arrogant Bastard--it's brewed down south.\n\nThe bar staff was quick & friendly, even though it was later on a Saturday evening and the crowds were high. I suggest checking this place out on a less crowded evening for a better experience.\n\nMinus one star for charging $3 for PBR, the most ANYONE should EVER charge for PBR is 2 BUCKS. \n\nFoosball tournament, anybody???", "author": "matt m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "The Page is a good place to start the night, or go early in the afternoon for a few drinks.  Later in the night the bar area gets packed, the pool tables are way too cramped, and it feels like you're just hanging out in an extra wide hallway. Sometimes the bar tenders are a little on the snobby side, but they give my girlfriend free drinks usually so I guess I can live with it. Definitely worth checking out if you've never been before.\n\nThey've got a lot of good beer consistently on draft and a foosball table so it for sure gets 4 stars from me.", "author": "Cameron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "Yelp review:  All High School Elite Edition:\n\nDYL, June 27, 2009, there I was, standing at the bar getting ready to order my 4th pint . . . well I should back up.  \n\nSo a few of us went to DYGay at Martuni's ( http://www.yelp.com/biz/martunis-san-francisco#hrid:iMeBruWXW8MntLVlq6Drhw ), but it ended early since Gregor, Winnie and Adrienne G all decided to leave (was it my breath?), but at that exact moment Critical Mass hit Market Street at Valencia, rendering it nearly impossible to get a cab or even a bus up to the lower Haight, so Rachel F and I walked up to Haight and something or other and finally caught a cab, arriving just in time to see Starla and Matt crossing Divis to the liquor store across the street from the Page (\"going to get some booze?\" I taunted).\n\nRachel F and I went inside to find Stefan, Bill, Drue and Autumn.  We ordered a couple of pints on my dime (Rachel F informed me of the yelp rule that the ROTD winner buys the drinks - and boy am I glad!  Imagine my embarrassment had I not known and made her pay for her own drink!  Dodged that bullet - phew!).  We both got carded, which is always charmingly amusing given my gray hair (I do *not* look 45, Jaime!  Take that back!).  I ate a little of Autumn's bday cake (yummy, chocolate - thank you for being born, Autumn!).  Starla and Matt got back from the liquor store . . . hmm, weird.  I shot some pool with Bill and had a couple more pints.  (We went 1-1 on our first two games, each of us scratching on our ultimate 8-ball shot to lose games that we should have won). I went back to the bar to order another pint.  \n\nBartender: \"ID?\"\nMe: [apparently with a load of unintended snark] \"Uhm - it's all the way back down at the pool table in my jacket with the three empty pint glasses I already drained . . . do you want me to go get it?\"\nBartender: [looking remarkably irritated and offended] \"You could just say 'I've already been carded.'\"\nMe: \"I've already been carded . . . I wasn't trying to be a dick, sometimes it just comes out sounding that way . . .\"\n\nAnyway - he gave me my pint, I beat Bill fair and square on the 3rd and final game, and then I went home.\n\nAs for the bar . . .\nMinuses:  a bartender who is easily offended; pool table felt that feels like the carpeted floor of a porn theater (don't ask how I'd know); Starla kept sneaking up on me.\n\nPlusses:  Great beer selection; two pool tables; I got carded twice; change machine to get quarters for the pool table; chocolate cake; it's close enough for me to walk home (yay!) . . . .\n\n4 stars for lots of yelpers, good beer, and thinking that there might be a snowball's shot in hell that I am under 21.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "Great people watching here.  Solid beer choices, especially Pliny the Elder.  The red chairs mentioned are full of broken dreams for sure, but strangely comfy.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "Decent beer selection, fair prices.  The bar staff has always been fairly friendly and quick with service when I've visited.  There is more seating than it would seem from the outside -- including a back room with pool table and more chairs/tables.  I always have a great time here but enjoy it best early in the evening or late at night (it makes a great stop for a last drink after shows at the Independent).", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-07", "description": "I love dive bars. Always have, probably always will and so when I am in other parts of our fine world and exploring civilizations outside of Hell-A, I definitely like to get at least a few dives in before I consider it a successful trip. With that said, I found a cool one to add to the list. \n\nApparently this place used to be a hardcore lesbian bar and was a rumored sh*thole, but now it seems as though it has been cleaned up a bit and is nicer than it was in prior years. I don't even wanna imagine how bad it was then, because it still definitely falls into the super dive category.\n\nAs for the vibe, it was a Tuesday night when we hung out here so it wasn't the hipster clusterf*ck I seem to be reading about in other reviews. True, there were hipsters, many of whom were wearing awesome outfits and one super sassy vixen hooked me up with a great vintage dress tip, but for the most part it was just full of seemingly down to earth folks enjoying some early week cocktails.\n\nI would hit this place if I just wanted to grab a drink or 4 with some friends or wanted to shoot some stick, as they have a few pool tables in the back.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-31", "description": "I owe this place a review, even though I don't have any strong feelings for this place one way or the other.\n\nThis bar has all the fixings of a decent watering hole.  It features a rustic decor, quality bar lighting, and gaming tables.  They feature a good selection of alcohol served up by an attentive bar staff.\n\nHere's the short and skinny: Seems like a good neighborhood bar.  I didn't feel that this place was anything so special that I would trek half way across the city on a regular basis.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-01", "description": "Best mid-week bar in the city. Devoted locals with a quality selection of drinks and not to mention foosball.", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-29", "description": "The Page reminds me of Sinbad's. \n\nSinbad's is this place on the east end of the Detroit River. In the GHETTO. Seriously, the ghetto. Not the Tenderloin.\n\nSo, so, super-duper cool. Been there since the 40s. Seafood joint and bar with its own marina, and people pull up to it on their boats. They have great fried catfish... Mmm. And a delicious soul food Sunday brunch... Oh damn! I miss that brunch. And upstairs in the summer, the patio is open, and the menu up there is ALL catfish. Catfish everything. Fried catfish and catfish salad and catfish po' boys...\n\nInside, it's dark: all the time. Even when they pull up the shades on the big windows that overlook the little marina, it's still dark. The interior walls are just DARK. Lots of paneling, and wood finishes... And they have a great big painting near the bar of an old galleon on fire, and I remember when my dad used to take me there as a kid, just staring at that painting... At the brilliant red of the flames eating the boat alive... Thinking it was the brightest thing in the whole damn place.\n\nKeeping with the nautical theme, there are ships' portholes in the doors to the restrooms. The chairs and barstools are leather upholstery with brass buttons: very captain-like. And on the placemats, there's a mermaid throwing a net over the word \"Sinbad's,\" spelled out in ship's line. And she's bare-chested (though she doesn't have any nipples, of COURSE). I remember always being embarrassed by her boobies as a kid, and making sure to set my water glass right on top of them...\n\nAt night the place gets rowdy with the sun-tanned boater crowd. All the people moored down in the marina come up to get their schwerve on -- outside on the patio if the weather's nice. I'd feel bad for the neighbors, but hey -- this is Detroit. All the houses on the street that dead ends at Sinbad's are abandoned.\n\nSo now I've painted a completely incorrect picture of the Page for you.\n\nIt is NOT in the ghetto.\n\nIt does NOT serve seafood, or soul food.\n\nIt does NOT have a nautical theme.\n\nIt does NOT have a marina, nor is it anywhere near the water.\n\nHowever...\n\nIt DOES have those same leather-upholstered chairs and barstools, and it IS dark, and it has more or less the same vibe... In that same cozy, cabin-like way. \n\nIt DOES have lots of people getting their schwerve on. They likely came from the Panhandle or Lower Haight, and not off their boats. And they're definitely not sun-tanned, because this is San Francisco. But schwerve is schwerve.\n\nAnd, with enough schewervin', it probably COULD have some boobies, too. Maybe not of the mermaid variety, but I think boobies are boobies, right?", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "Friendly people, good drinks, clean bathroom.\n\nThat's really all I need in a bar and The Page has all 3. Minus 1 star for being cash only, but I'd still go back.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-26", "description": "Not my favorite bar but serviceable if you are in the area. It's downright impossible to play pool here because of the placement of the tables and crowded bar. Drinks are ok but not memorable.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-26", "description": "\"If the doors of perception were cleaned, we would see infinity\" -William Blake(quoted by Huxley at the introduction of The doors of perception).\n\nMy experience at Page last night was similar to the time I took some strong shrooms in Burning Man the afternoon before the Burn. Initially, it was nothing spectacular but suddenly the Playa turns into a gigantic ice skating ring. After some moments(minutes/hours?) of wonder, I close my eyes and I see a huge volcano erupting lavas in my mind's eye. Both the outer and the inner experience of fantasy are so strong that I am struggling between keeping my eyes open or closed.\n\nI reached Page last night already very drunk from the combination of free and Happy hour priced booze plied on me by the loving bartenders of Jade. I sit at the Bar in Page and down a few Coronas in rapid succession. I wonder around and talk to yelpers as well as random people playing pool, fuzball or footsie.\n\nSuddenly, I come back to the Bar and dose off. I see volcanoes erupting lavas in my mind. I open my eyes and see the color red everywhere. From deer heads frozen in eternity on the red walls to the  Eternal Godhead erupting redness in my mind, I am awash in an ocean of red and my inner and outer experience becomes One.\n\nToday I am facing the aftermath of volcanoes erupting in my head last night. However, I will still give a good rating to this Bar as it is a friendly, high end dive/local Bar and I can see that once people(esp. from the broader neighborhood) gets a feeling of familiarity and comfort(like I have at Jade) they come back again and again to Page.", "author": "Kaustav C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-14", "description": "oh...the page. How I love you...let me count the ways:\n\n1. Drinks are strong and almost always available when I need them\n2. People flock here from near and far, leading to a usual run-in with old random characters from my past.\n3. If you like scotch--and I don't mean tape--they have a good selection\n4. There a pool table...that's not always bogarted by dark and nasty types so you can go here on off nights and still enjoy yourself\n\nOverall, this is a key component of my social life in San Francisco. I wouldn't have it any other way.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "Oh yeah, DYL.  Gotta love it.\n\nBy the time my cousin and I got there most of the yelpers had already cycled through.  Got to meet a few cool people and the bartenders were nice and attentive.\n\nIt's an attractive albeit cramped space, especially later in the evening when you are trying to play pool.  If you don't mind a pool cue being shoved in to parts of your lower anatomy it's not so bad I suppose.  \n\nThis isn't as laid back of a spot as I usually enjoy (Kennedy's, Zeitgeist, etc) but as far as bars go I can see myself coming here again.\n\nTwo pool tables and a foozeball table.  A dozen or more beers on tap and a full bar.  Larger than average collection of scotch.", "author": "Theron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-11", "description": "Another vote for this being a pretty good neighborhood bar in a good location.  The interior is nothing too special.  Definitely earns an additional star for having *both* a foosball table and a pool table.  The exterior has that great 50's San Francisco bar feel with the old neon and wall signage, flat stone wainscotting and palm trees.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-28", "description": "The back room with the pool table is a great place to have a surprise birthday party. But, you will still have to order all your drinks at the bar as apparently, there is no table service. \n\nThe ambiance is sort of stuffy study, meaning don't bring your hardcore vegetarian or vegan friends here. There are multiple species represented only by their heads on various walls. \n\nTwo pool tables, and a genial crowd, yes crowd, for a Monday night. The bartenders were cute and helpful. Maybe that's why they get a crowd, eh? I wouldn't call this a destination but I would feel comfortable dropping in if I was walking by.\n\nParking can be tricky.", "author": "Miel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "The Page is a relaxed neighborhood bar situated right where the Castro, Lower Haight, and the Western Addition all come together. Yelp says that it belongs to Lower Haight, but far as I'm concerned it's a Western Addition bar. LH already has tons of bars and we need more; The Page is ours. And when I say 'relaxed' I mean that it's relaxed as a bar can be on a friday night when it's full of yelpers and a wedding party.\n\nThe decor is somewhere between small town watering hole and hunting lodge. There's pool and foosball. Neither the brick nor the deer heads are real.\n\nIt can be hard to get the attention of the bartenders when it's busy, but when you do it's worth it.\n\nThey have Shiner Bock on tap, people.\nTHEY HAVE SHINER BOCK ON TAP.\n\nThe 7 and the 24 run right by this place and there are tons of cabs on Divisadero at night. But there's another way to get here, evidently:\n\n1. Go to Jade and have a bunch of cocktails.\n2. Close your eyes. You'll begin to slip into a trance.\n3. When you regain conciousness, open your eyes and you're sitting at the bar at The Page.\n\nI can't explain the science behind it, but several people have independently verified that it works.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-15", "description": "\"Lets go to the page\"...seems to be the failsafe.  After a house party, after another bar, after a concert, pretty much after anything, or just for drinks mid week.  \nWe have our town meetings here.  When our friends need a mid week cocktail, we head here.  The bouncers know our faces, the bartenders pretty much know our drinks, and at one point in my history at the Page, a certain few friends of mine could always be spotted at the foos ball table.  I like this bar.  Its comfortable, they helped me take over the downstairs area for my 29th birthday, providing me with forks and plates for cake my friends baked.  \nIts walking distance to my home.  sometimes it feels like home.\n\nminus the one star for the overpriced fernet shots.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "The Page is a comfortable bar with a bit of fun and entertainment... I love when I pop in and there is live music. Even when it's not live, they play great songs. They supply a good selection of whiskey -which is my drink and so that make me very very happy. When me and my room mate stop in, we like to play pool and foosball with random people from the neighborhood. There's also a really cute guy behind the bar named Ryan -another perk to the place. : )", "author": "Amaline B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-05", "description": "Not sure why this place is so popular. It's a pretty crappy bar with pretty crappy drinks and pretty crappy service. It's always packed and loud and just not where I want to go to drink. There are way too many better places around to bother with this place just because it's become trendy.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-27", "description": "The Page was neither here nor there...  The ambiance would have been far more charming if it hadn't been packed with people... we did find a table rather easily... But, I ask why is it when I am in a narrow bar sitting at a table, inevitably men choose to stand with their asses in my face?\n\nI suppose it's better than the alternative.\n\nThe drinks were fine... mine had far too much vodka, my companion's had far too little gin.\n\nI liked the dark reddish interior of The Page... it felt very... very from another time.\n\nI don't remember much else about this bar as I was engrossed in conversation, which is always a good sign.\n\nThree stars - unremarkable bar, only made stellar by the company who I choose to spend my time there with.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-25", "description": "Like dive bars, but hate bacteria? Love fooseball,  but hate douchebags?\nThe Page is your new jam, hombre. The Page has the esthetic of a rustic hunting lodge / rompus room. The front tables are a great place to take down one of the many beers on tap or the reasonably priced c-tails while listening to some hot licks from the jukebox. \nThe front room empties into the a open downstairs area. \nI may be the only one, but I for one love the stairs that lead to nowwhere on the left side of the lower bar area.\nPost up on these stairs w/ a peer and shoot the breeze and you will swear you were stoopin it in Crooklyn on a breezy Autumn day.", "author": "Gabe b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-24", "description": "I'm a huge fan of The Page when this place is packed with people.  It's the people that make this such a fun place.  Especially on those $3 Wednesdays.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-24", "description": "God, remember when this bar was called Chances?\nChances are you'd find someone to go home with at the end of the night.\n\nI love the Page, the drinks are cheap, the jukebox is beefy and there's a pool table in the back. It's laid back, has enough charm to not scare away the locals but not gaudy enough to catch a tourist's eye. \n\nIt's a chill local hang, it's got potential for good people watching and I find myself goin there more and more.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-18", "description": "This place sucks.  No, Lindsay, I don't want to play Foosball, and FUCK the internet jukebox.  If you can't pick out a group of CDs that you want played in your bar, then you don't even fucking deserve a jukebox.\n\nOh, and your bartenders are totally never nice to me.  And I haven't done anything to deserve that kind of treatment.  \n\nAND there are never any cute boys here because, well, why would there be?  And the bathrooms are stupid and awkward.  And fuck you all.  \n\nI think I have made my point.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Definitely a favorite in the hood although it can get very cramped very quickly in here. I have been a few times but most notably I stopped by on a Sunday afternoon to find it 1) not crowded at all and 2) awesome happy hour specials. The bartender was really nice and my BF and I sat for a few hours chatting and drinking. Definitely enjoyable!", "author": "Alissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-05", "description": "The Page is that place on the corner that is filled with all the locals! This is the neighborhood bar you'd read about in a Bukowski book, or the type of place where you leave all the \"bar scene\" pretensions behind and just have a beer and a shot. Excellent local secret...or it was, the secret has gotten out (blast!) \n\nThey have a pool table, endless jukebox, gamebox, super bartenders, foozball and a crowd that is relaxed and friendly! Sure it's dark, smells a little bit and has mounted deer heads in back...it is awesome and by no means, lacking in character. \n\nThursday, Friday and Saturday nights this place is *PACKED* with people. Get their early and prepared to be bumped into and/or spilled on. Part of me is happy because this spot definitely deserves all the success in the world, but the content of folks on the weekend honestly makes me want to leave...or scream out \"I WAS HERE FIRST!!!!\"", "author": "Beth M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-27", "description": "Nice dive bar with a nice booze selection (they even had Titos!).  I arrived fairly early in the evening and watched the bar fill up with amazingly normal people (which is saying a lot for SF).  No marina choads, no punks, hippies, or drag queens -- just people like you and me.  Well...maybe not you.  \n\nThe booze was fairly priced, and the jukebox actually had most of my favorite bands on there (bless you, internet jukebox).  This is a mixed blessing however...while you can put on that obscure song you like, some jackhole can also put on really shitty music that'll make you want to leave.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-26", "description": "I would love to come back to this bar when I am not already completely shit faced. \n\nPool, fooz-ball, music, cool peeps, and its surprisingly large! The back area opens up to an area with the pool table & fooz-ball. A great mix of people. Bring I.D.,  I actually had my I.D. checked when I came in, which has never happened to me! \n\nPlus, there is a FANTASTIC pizza place down the street! YUM!\n\nI will definitely be back!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "I've been here slammed on a half a bottle of tequila, and stone sober, always with a large group of friends. Arrogant Bastard on tap? Meet you there!", "author": "Alita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "My neighborhood bar.  Nice happy hour specials...but you won't catch me here on weekends.  FAR too crowded.  Where did all these poeple come from!?  Must be because they don't charge a cover like Madrones down the street.\n\n So it is my week night pool hall equipped with erotic photo hunt, a loud jukebox and a mounted deer head.  Grandpa would be proud.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-12", "description": "$3 beers.  Do I really need to write any more?  I was there by myself and not much in the mood to socialize so I was thrilled with the chill atmosphere and cheap good beer.  I heard some good music come out of the juke box and got a great $12 buzz.  \n\nIf I am ever with a friend and we just need a chill place to go have a drink and shoot the shit this will be on the list of options.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-08", "description": "I appreciate that the Page is a dive; one can only tolerate so much sojo-bar bullshit. While you might go to \"Bar 415\" for a sake cocktail and to show off your new ironic hat, you go to the Page to get drunk. \n\nThe thing is, drunk people are assholes. It follows that this place is  usually full of assholes. It might be better if the bar staff were nice, but that hasn't been my experience, esp. with the female bartenders. At best, they do this good-bartender-bad-bartender shtick that gets old fast. This is the kind of place where tipping isn't correlative to the service.", "author": "Jabe N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-12", "description": "When I lived a few blocks from The Page I found it hard to let myself be charmed by the place (even despite the ridiculously off-kilter boy to girl ratio.) Perhaps absence makes the heart grow fonder, though. Now I'm inclined to think that despite the dingy carpeting and strange lighting, The Page is a perfect spot for one's last drink of the evening, preferably a shot of Fernet with a ginger back.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-14", "description": "THE HOME OF THE TOWN MEETING.\n\nAlas, like any great place where family gather to drink themselves silly, it's got flaws. Just like the rest of us. Hey, are we not human? Or....a bar? Drinks are a bit overpriced (okay, a LOT in cases), but it's cozy & the bartenders are lovable, no-nonsense types, & it's just HOME. In a bar.\n\nAlways packed with locals from the Western Addition/NOPA/Haight areas, ignore the \"sausage-fest\" complaints. My crew rolls with a slew of cute girls. If you were there & it was full of dudes, well, wrong night I guess.\n\nIn conclusion, I LOVE THE PAGE.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "I'm not sure if it's the fake wallpaper bookcases in the back room, or the random moose heads hanging from the walls, or the foosball thats slightly sticky with beer residue, but this place feeds my dive-loving soul in a way that few bars can. We came with a random motley crew, made new friends, I learned some (much needed) new tricks at the pool table, and we stayed far past the intended departure point. Plus, they have Photo Hunt! And if you play the sexy-dude versions, you're almost guaranteed to make it into the hall of fame because NO ONE likes the dude games. Talk about a cheap boost for your ego!\n\nThis would be 5 stars except that the service was slow on a crowded night, and there was no music playing unless you put moolah into the jukebox.  I will be back.", "author": "Chelsea R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-15", "description": "After a night of art at White Walls and cocktails at Bourbon & Branch a friend invited me to The Page bar. I didn't know what to expect and actually don't ever really set expectations so I don't know why I said that. I was so excited when I walked in to see a cute bar, not too packed (and the crowd that was there was lovely), plenty of seating, two pool table in a quaint room in the back set down about 4 steps. There are corners you can sit in if you want privacy and there are large table areas if you have a small group. The staff was on the ball as well as friendly, meaning I got my drink within 3 minutes of entering the bar and served with a smile. I do agree, if you're a single girl, the guys are aplenty and very social. \n\nIt's rare to go to a bar and feel like it has it all, and this is how I felt about the Page. I would definitely recommend it if you haven't been.", "author": "Patience E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "Aside from Golden Gate Park, this is one of the places I miss most about living in SF. We used to live north of the Panhandle and the Page was our favorite local. It's one of those places you can always count on to be fun when you can't decide what to do or where to go. The Page, of course!\n\nMy husband and I inevitably ended up meeting new people and having funny conversations with random strangers here, because it's just that kind of place. The bartenders were super nice and the \"makeout room,\" you know that little tiny room with two stools right by the first pool table? It's awesome! I love love love this bar!", "author": "kelly m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-28", "description": "Took me a while to make it by, but I really like this bar.  I remember going to Chances a few years back and not thinking much of it, and I'm not sure what is really different now, but it's a great neighborhood spot.  I stopped by recently on a Wednesday and it was surprisingly happening for a mid-week night.\n\nI'd so much rather be here than some wannabe LA style bar in the Tendernob with 10 dollar drinks and bottle service.", "author": "George C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-08", "description": "I came here after work one day to meet a friend and during the half hour I was there waiting I was the only female and the only one under 30 besides the bartender, which made me feel a bit self-conscious, so I buried my head in a copy of The Onion. 1 star.\n\nBut then a strange man in a pinstripe bought me a drink. I was momentarily convinced that he might be Willie Brown, being that I'd never actually seen a picture of Willie Brown, and was basing this solely on reputation. Either way, free drink. 5 stars.\n\nIt was a decent enough place to have a beer and a conversation, but we rather quickly moved on. Before leaving I ended up spending 5 minutes wandering around trying to find the women's restroom. A man yelled at me for trying to use the men's room. I felt like a dumbass again. 3 stars.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-30", "description": "The reason there are so many guys around is that this is the perfect place to just go with a buddy and chat and kind of half watch TV, listen to music, etc. I've also seen a lot of groups of women hanging out, too, so maybe when I go on the weekdays it's just a hang with friends kind of place? Weekends are a lot better than other Lower Haight bars, because it's a little off the beaten path, but, it's still sometimes crazy crowded. \n\nAm I the only one who didn't like the former owners when this place was Chances? One brother was nice, the other guy would get drunk and crazy (or, I sure hope he was drunk because he was definitely crazy, seemingly looking for a fight in his own bar and generally starting a ruckus on a few occasions that I saw). All I know is that I like the much more peaceful vibe of the place now. \n\nMy only small criticism is that your drinking experience varies wildly based on who's serving you. The dude who owns it is super-cool and really knows his booze, there's a girl there who has recently been wearing an \"i heart beer\" hat who is great as well, but some of the other bartender women I've had the last few months did not seem to familiar with their alcohol selection--I had to point out to them where bottles of not-too-rare stuff was!", "author": "Josh K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-22", "description": "tends to be a bit crowded, and can be hard to order.  I dig the decor though", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "Looking for a good bar with a pool table where you're not likely to get into a fight over it?\n\nWelcome to the Page.\n\nLots of tap beers. Good selection of whiskeys. Quiet Sunday through Monday so you can show up with a decent sized group and have some space. Great jukebox that no one ever seems to hog up.\n\nThe bathrooms aren't the taj mahal but they get the job done.\n\n.....and they have foosball which used to be my favorite pasttime.....and yes it's a tornado which makes all the difference...\n\nGreat thursday through Saturday if your looking for that full bar action...\n\n\nIn my opinion it's great anytime", "author": "Michael O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-19", "description": "WOO HOO for bars that are crowded and you can get drunk in.\r\n\r\n-----------------------------------------------------------\r\n*Um. I think I wrote this after I got back from this place at 2am. Not quite the kind of review you want to look for... especially since it's a bit facetious. \r\n\r\nSo I will say, now that I am clear and sober, that this place was really crowded, dark, old, a little smelly... I'm not sure I'd go there again unless I had a good reason to. I actually got a little claustraphobic it was so damn crowded. \r\n\r\nIt seems like a cool bar to be in if you don't care about what the people you're with are saying since it's so loud, or you don't care that you can't find a place to sit... Because you really can't talk or hear or sit anywhere in this place. \r\n\r\nBut hey, you can always just get drunk!", "author": "Chantal H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "I have only been here 3x (and have lived a block away for 6 years),Solid low-key vibe. Utterly non-hip, nonjudgmental and on all the nights I was there the crowd was pleasantly diverse. \nIf you end up liking it too, buy me a drink.", "author": "tara s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-22", "description": "Where's my oxygen tank and goggles?  The diviest place within walking distance of my place, it's not really Western Addition, but I've strolled home scarily drunk from this spot before.  Also, while 821 is nice for stopping in to have a beer or two and chill, this is where you go to get hopelessly destroyed and experience the pains of delirium tremors the next day.  Did I say that out loud?  Oops.\n\nThe douchebaggery that forces me to walk on certain sides of Divis as I head home is fortunately missing from The Page.  It's got all of the kitsch of a velvet Elvis, and if you have a problem with that, there's a soju-tini and corny assholes waiting for you a few blocks north.\n\nThe Page is my favorite bar in SF that I don't have to cab it to, bar none.", "author": "Sterling M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-03", "description": "NOT welcoming of outsiders.\n\nI used to really enjoy the Page... it was easy going and a good place for a couple of beers and some pool. I am not sure what changed with this place recently, but it doesn't  stack up to the usual standard of welcoming that great cities in the US have shown me in the last few years. \n\nA bar that does not let people from outside the US buy a beer without first bringing your passport (despite being a local) is not one that I would call welcoming. Frown on you Page. \n\nGood thing there are plenty of places in the area that appreciate us out of towners.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "Love this place.\n\nLive a block away, and it's always a good atmosphere! I would have given it a five if I could use my credit card over there...", "author": "Ryon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-08", "description": "I love this bar... \nvery old tavern feel to it, you walk in and feel like you took a step back.. the bartenders are super friendly.. i went on a weekday so i didnt have to deal with the crowds everyone else is complaining about. \nThe jukebox is filled with random music so i guess something for everyone.\nDrinks werent not anything too pricey, typical i guess. . . \nthey have two pool tables, and a foosball (sp?) table in the lower section. \nits a nice neighborhood bar, ill be sure to stop in again if i am around there.", "author": "jamie z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-27", "description": "The page is a pretty cool dive bar.  It's got foose (awesome) and two pool tables, which is a good reason to go.\n\nIt's a little gloomy and has (I think) ugly red carpeting which is something I insist on for dive bars.\n\nThe Page is all about the back room.  That's where the fooseball table is and the pool table with room to make a shot.  There's also a quarter machine, which is good, 'cause pool game cost you something absurd, like a buck.  The room is down some steps so it's all private feeling with a few tables.  An awesome place to get to early and dominate with your friends.   \nHowever, if you're down there and your not dominating it, some other dumbasses are going to show up and then you'll be thinking \"Mrreh?  Who the F are these douche bags?  I don't drink in the back room so I can be next to these fools.  I'm out.\"  Well, that's if you're me.  I don't like to meet people when I'm playing pool.  \n\nBring your friends.  Dominate back room.  repel back room creeping people.", "author": "Lee P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-19", "description": "I remember when this was chances. \nMy western addition friends like to come here but I favor the 821 place more. The bartenders can be a mixed bag. Good juke. They make a strong  drink. I was not happy that  my IPOD was  stolen out of my jacket here.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-22", "description": "At first I thought that this bar was aight, it was around the corner from my friend's place and we'd go there sometimes on Friday nights.  After a few evenings here, I realized The Page is crawling with sleazy guys in their late thirties, early forties.  My friend met a guy here that was a musician who lived nearby and who turned out to be a total creeper.  If you don't care about the clientele, the drinks are alright and the male bartender is nice, but otherwise, go elsewhere!", "author": "Julia D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-13", "description": "I've been here just a few times and like the dark, neighborhood, dive bar feel. However, I had something happen there that has never happened to me at a bar before. \nI ordered a draft beer and it was really sour. I had my friend taste it too, and he agreed it was way \"off\". So, he went to the bar to get me a new beer and they refused. Said they'd have to ask the owner/boss to get approval and he wasn't around! Now mind you, it wasn't like I drank the whole thing and then asked for a new one. The pint glass was down like maybe half an inch or so. \nFrankly, I couldn't believe it. It's not uncommon for tap beer to get sour and I've never been refused a new one before. Obviously I would never order a beer on tap there ever again. \nSo 1 star for crappy service.", "author": "Margo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "It's dark, red, divey, yet lively. It's probably my favorite bar. Why: the location, the balance between dive and cozy, the beer selection. Oh, and 2 pool tables and the Foosball.\n\nAlso consider Waziema a couple blocks away (no pool tables\\foos there though).", "author": "Julien R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-09", "description": "Came in on a Saturday night for a birthday party and was pleased to find it hopping, but not too crowded.  Bar service was prompt and drinks were strong!\n\nI loved the cabin decor and the laid-back vibe, but I don't ever see The Page becoming a destination bar for me.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-28", "description": "Always good for a shit-show.  Usually me as a witness.  I've left  this fine establishment many a night drunk off  my ass.  The people seem friendly but maybe that's because I'm a fun-lovin drunk.  Who cares?  This is one of my favorite bars although the cute girls behind the bar could be happier.  \nNow if only the Fulton Street Bar would come back from the dead.", "author": "J P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-09", "description": "There's probably not much I can say about this place that hasn't already been said by other yelpers, but I'll throw in my two cents.\n\nIts a classic, chill neighborhood bar. The kind of place you'd go if want to sit down, talk, and never have to wait in line for a drink. There's a full bar (great beers, including Chimay, a personal fav), pool table, and rumor has it they even have a foosball table. I was having such a good time hanging out I didnt have a chance to partake in the bar games, but no worries, it won't be long before I'm back at one of my new favorite watering holes...", "author": "Eran C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "And on the 7th day, God created The Page.\n\nThis doesn't feel like a bar so much as the Billelo's basement circa 1978.  We'd could get some hooch from Frankie and Mikey's dad's supply and spend a whirlwind of a good time mixing it up with the locals or going head to head foosing.\n\nWhen you learn about this place and you're not from the neighborhood, feel lucky, people might finally start calling you a \"Local\".", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "I remember several years ago exploring the Castro with one of my first boyfriends... then we wandered over the hill and saw a place called \"Chances.\" After taking our chances and checking it out, we knew we weren't in the Castro anymore, but it didn't matter because it was a friendly place.\n\nNow that place in the Page and I still have fond memories of that night of exploration. I see it all the time since I live in the neighborhood and it's one of my favotie bars.\n\nIt gets very crowded, though, bummer.  OH and they took away erotic photo hunt!  NOOOOOOOOO that was soooooooo fun.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-04", "description": "Ladies and Gentlemen, I am issuing a moratorium on usage of the word \"dive\" as an adjective that expressly modifies the word \"bar\".  Henceforth, you may NOT utilize the word \"dive\" to describe a bar unless it meets ALL of the following criteria:\n\n1. Cash only\n2. Lots of beer on tap\n3. Contains pool tables\n4. Bears a jukebox of any sort\n5. Cheap drinks\n6. TV tuned to ESPN or another sporting event\n7. Blue collar clientele\n\nYour pampered, monied, gentrified ass really has NO IDEA how to define \"dive bar\".  That trendy Mission joint in da hood is simply NOT a dive bar just because it's a little gritty and has a few floor stains.  Please leave the nomenclature to those who have extensive experience with such things.\n\nThat having been said, The Page is as close to a dive bar as the undiscerning socialite can approximate (minus the blue collar clientele).  It's populated by a randomly generated series of Marina assholes who undergo a serious case of cognitive dissonance: the desperate desire to be \"seen at the scene\" coupled with an over-inflated sense of chic and elegance.  Yet, somehow it still manages to retain its \"old world\" charm, those bygone days manifested by the proletariat partaking of the sweet elixir known as beer after performing some activity resulting in sweaty bodies and callused hands.\n\nI like this place.  The drinks are cheap, the music is generated by the digital jukebox near the entrance (CHOOSE YOUR OWN ADVENTURE, BITCH), and pool/foosball tables abound should you feel the need to demonstrate your drunken ineptitude.  There are a few real people here genuinely interested in conversing instead of touting their own non-achievements.  The ambiance is festive, though this is entirely fostered by the people.  The decor is typical of the \"dive bar\" and in no way remarkable.  But that's the way it should be.\n\nI will return to The Page, as if it were an actual page in a novel that contained my favorite passage, some age old bit of wisdom passed down by the authors of yore.  I encourage you to read the same book.\n\nLan' sakes alive!  I am drunk.", "author": "Rajiv B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-19", "description": "The Page is like that restaurant you go to when you're tired of eating at your usual list of places and are feeling ambitious.\n\nIt's a decent destination if you tired of skulking around the Lower Haight bars.  I like the positioning on the corners of the relatively dark and residential Page and the much busier Divisadero.\n\nThis place is a great location if you want to have some different beers.  They have Brother Thelonious (quite good) as well as Baltika (strong Russian ale).  Other than that the selection is good with a number of Bear Republic and Stone brews on tap.  They also have Hoegaarden and Trumer Pils.  The drinks were pretty stiff and with everything ringing up at about $4.50, I can see myself making my way back at some point.\n\nWhat I was least crazy about (and ultimately the reason we left) was the layout of the place.  It's kind of like the walls are lined with tables, so on a Saturday when they are all full, you kind of really have no where to stand.  You can go down to the little pool room area, but then you're constantly shifting so the bastards playing pool can make their shots.  You can stay up in the bar area but then eventually someone is going to want to get by you.  It felt like our group turned into this gelatinous blob, shifting around the club in an attempt to find a place to settle down, but it just wasn't happening.  Ultimately the Page's charm wore off for me.\n\nProps on being one of the few bars genius enough to put a change machine next to your quarter operated (pool, foosball) games, it saves you from feeling like an idiot when after much effort, the bartender comes over to you and all you order is... $2 in quarters.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "I like this place. It is exactly what it presents itself as, a local corner bar serving beer and mixed drinks. No food. The beer selection is pretty good and it rotates depending on the season. A great place to grab a drinks with friends after dinner or before heading out.", "author": "Shanna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-16", "description": "You've gotta love this bar in theory - it's designed right, the space works, it's got good drinks, specials on the chalkboard, and the bartenders are pros.  The clientele sucks!  Not only are there insane quantities of bros, but some of them kinda scare me.  One time this dude tried to intimidate me into playing pool with him because I moved his ball after his game was over.  But bros aside, there's also weird alone 40-year-old dudes weirding everybody out, crazy lady hogging the Megatouch, and yeah, the worst possible people to ever man a jukebox, combined with the gut-wrenching freedom that internet jukeboxes afford.  311, once.  AND (I'm almost done) why is this bar always so full?  Do these people not have a couple other bars in their rotation?\n\nAnyway, point is, it's not the Page's fault the Page sucks.  I love the Page.  Oh well.", "author": "Nick P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "The Page is a great neighborhood bar.  The bartenders are very friendly, and the beers are extremely cheap.  Plus, they have a huge selection of beers on tap.  It can get crowded on the weekends, but not too bad. They also have a jukebox and a pool table downstairs.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-19", "description": "This is a near perfect bar. Let me go down the checklist:\n1 - jukebox with a variety of beats, rock and bullshit --- check\n2 - a hot female bartender (JK...mmm) --- check\n3 - stiff drinks --- check\n4 - bar games --- check\n5 - near my hood --- check\n6 - feels like a dive, smells like a dive, looks like a dive - it is a dive --- check\n\nUPDATE!!!!!!!!\nBeware. If the Page looks crowded, it may be good to avoid going inside. I thought I was in the marina. Douche bags were everywhere. Maybe someone cool was slumming for their birthday. I went with two female friends. Douche after douche kept getting shot down. Calm down boys... damn. Still a near perfect bar when it is not filled to capacity.\n\nAwesome daytime bar on the weekends.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-05", "description": "The bar is pretty standard dive.  The Drinks are OK and tend to get you drunk.  But there have been more then one occasion where the scene was pretty douchey.  I would recommend to skip this one.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-02", "description": "What a funky bar.  Most of the walls are red, many of the lights are red (except for a few blue ones in back), so the overall ambiance is Red.  There are various and sundry animal heads protruding from the walls, what appears to be a whole bobcat above a door in back, and some paintings that all combine to evoke a French hunting manor feel.  Like I said, funky.\nThere are 2 pool tables, both in pretty good shape, and a foosball table (and a change machine).  Nice!\n\nThere's also a vast selection of whiskey, much bigger than you at first suspect, because it turns out there's a hidden cabinet on the lower left side of the bar that's stocked about 4 or 5 bottles deep with the stuff.  For those who don't like the hard likker, The Page is packing some 16 different taps or so, including a number of Belgian & German selections, as well as a couple of ciders and a bunch of local brews.  Beer prices are pretty average.  Tenders are friendly & cool folks.\n\nAmbiance on an off night is laid back & relaxed.  It's clearly a locals' joint.  But I hear it gets pretty crazy on the weekends.\n\nAnd know in advance it's cash only.", "author": "Don H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "The only place I've found in the entire city to have Magic Hat #9. Hallelujah. That is all.", "author": "Karena Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-23", "description": "I ended up here for some drinks before a game of capture the flag.  Due to where my friends live and where my office is I don't get to bars are neither in the marina or downtown so it was a nice change of pace to end up somewhere else in the city.\n\nSo the atmosphere here is relaxed and there's a pool table (or two?) in back.  The music isn't too loud and the bartender when I was there was efficient about getting drink out.  Made for a good place to have some drinks and actually talk to people instead of shouting over music.", "author": "Jared W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-23", "description": "So, it's narrow, and cramped, and dimly lit, and it's not a pickup spot, but damn if I love it here.\n\nTo get things straight, The Page isn't a destination. The Page is the place you go to when you live in the neighborhood and you're looking to get bombed. It's got the kind of atmosphere that begs for an old alcoholic sitting at one end of the bar, talking to no one in particular about what it was like in 'Nam.\n\nI'm taking one star off because I'm bitter that they're right down the block and not open at 6am for those nights when nobody's sleeping until the world runs out of beer. Bastards.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-23", "description": "Although there are several bars between me and The Page, I'm always willing to walk the extra blocks.  I prefer to go to this bar for many different reasons. \n\nBeer selection- the have a ton of different and varietal beers and more importantly always seem to have a few new beers to try that they don't always have around.  \n\nThe crowd-  everybody in here is always nice and simple.  People aren't too hippy, yuppie, or thuged out - they are just normal people wanting to go to a nice bar and get a drink. \n\nThey have two nice pool tables and a foosball table - although I wish they would put a bit of money into making their foosball table nicer.  We end up going to Place Pigalle or The Rocket Room to place foos, even though we would prefer to to the page.  Just $50 towards improvements would make up for itself in drink sales in no-time!!\n\nOne of the few bars I give 5 stars!!", "author": "Josh M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-10", "description": "Synopsis:  You had me at foosball.\n\nIt has some good tunes, some pool tables, relatively cheap drinks, a relaxed atmosphere.  The crowd on Friday seemed amenable if a little bit into wearing shiny button-down shirts and having exquisitely coiffed hair.  Still, they have a foosball table.  I don't think anyone can have a bad time playing foosball and you add some cheap beers on top of it - it's a three starrer.  \n\nUnlike some of the other reviews, I didn't see the angry frat boy meat market side of things, but then again - I was pretty focused on that foosball.", "author": "Dave E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-07", "description": "One star because they serve drinks, another one because they play music.  Yup.  Two stars for actually being a bar.  \n\nThey serve one of the worst martinis in town; the bar is too narrow and has a pool table as inconveniently located as possible, between the main bar area, the bathrooms, and downstairs.  The worst part, though, is that everyone else likes it and drags you there, and it takes too long to get drinks to numb the pain of being in one of the most overrated establishments in San Francisco.", "author": "Phil K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-11", "description": "I really like this place. It's the closest I've found to an actual pub in San Francisco though I am happy to put the work in and keep looking for more. \n\nLots of comfy seating. A good selection of beers though the new London Pride on draught tastes nothing like it should. There's even crisps (chips) to go with your beer which every proper pub should have. \n\nGreat jukebox, pool table, table-football, friendly staff both behind the bar and at the door. Relaxed crowd, not too rowdy and best of all hardly any TV screens just two small, unobtrusive ones on each end of the bar.", "author": "Pauliee V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "I miss this place when it was called CHANCES, i loved to say, screw it, let's take our chances and go to Chances, natch!\n\nThis bar is kind of weird and all over the place, it has two TV's, and mostly turned to sports, but i would hardly call it a sports bar.\n\nAnd then there's downstairs, spacious and evokes a lodge feel, (deer heads, et al), and a pool table and a ATM.\n\nI used to not like this place, but somehow i kind of like it again, the staff are super friendly, even had free pizza at happy hour lst friday! Oh, and $1.50 Tecates at happy hour that lasts till 7pm.", "author": "wayne s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-13", "description": "What a nice place with a great atmosphere. Wide range of bar goers in here making it quite relaxed without the stench of hipster or douchebagism. \n\nWill come again!", "author": "Oz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-21", "description": "Tornado Foosball Table and Arrogant Bastard (not me) on tap for only four dollars. \n\nMain area kinda packed but place has a good vibe.\n\nAlso two pool tables.", "author": "Allan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-03", "description": "Except for the fact that they always kick my buddy Cal Santos out, I kind of dig this place. Chances, the bar before The Page was the same - neighborhoody, friendly, central, basic, spacious, never-too-crowded mid-town bar.\n\nNothing fancy but thats a given. Other than the arrogant bar staff, its a decent neighborhood haunt.", "author": "Greg R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-10", "description": "After going here about 20 or 30 times so far, I've decided to give it 5 stars. Owner Bob does a great job. All the barstaff plus the locals are friendly. The windows are tinted dark; it's my kind of seedy joint.\nCheck out the website for Tuesday tasting sessions. Last week was tequila, oh boy!", "author": "Ed R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "Animals on the wall, check. Secret nook in the corner near the piss, check. Drunk friends, quadruple check. Time for some fun! I like this place. I'll say that. It's kind of fun because it keeps on going. This is our go-to spot before and after shows at the independent. Good selection of beers on hand and there is usually space to camp out and hang. I don't know why we picked that side room, but it had seats (kegs) and it was dark so I didn't have to look at my friend Josh anymore. SORRY JOSH", "author": "Erik U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "I dropped by here with a friend for some drinks after dinner on a Friday. The place was packed. One you got in past the mob at the door though, it wasn't that bad. They had some really good drink specials ($8.50 for an Old Speckled Hen on nitro and a Bushmills) and some really great English beers that I don't see on a regular basis. I also thoroughly enjoyed the tiny men's room hidden behind a wall.", "author": "Peter V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-11", "description": "I live near The Page so it's cool in that sense.  It has the feeling of a dive bar but for a place to be a dive bar, Pabst Blue Ribbon has to be under 3 dollars.    \r\n\r\nI was impressed by the human turnout.  I was there at 9 PM on a Monday and it was quite full.  Nevertheless I'll be coming here often.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-28", "description": "Oh they have my Boddingtons.  The Page has become a proper rival to The Fly now especially if I am just looking for a drink. \n\nMaybe it was the juke box playing blues for five straight songs or the weird old guy that helped my roommate on with her scarf as we were leaving but this place has just the right amount of authentic dive for a dive bar.  I look forward to a return trip in the future.  You know when I am feeling adventurous and want to go outside the five block radius of my home :)", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-17", "description": "Great neighborhood bar. A deer head in the back room, plus foosball and pool.  Divisadero street used to be a no man's land, dividing lower and upper haight, but there seemed to be many more hipsters there than before.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-12", "description": "guy to girl ratio is empowering and it beats going all the way to man jose \njust remember, quality not quantity...", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-20", "description": "Sometimes I forget this is a destination bar, and since it's, what, three yards away, I sometimes roll up in what could constitute as PJs. But no matter. It's not the see and be seen kind of place. It's the chill with your friends in comfy seats by the window looking out on the neighborhood, or relax by yourself over a cheap glass of wine at the bar watching a game on the little tvs-- kind of place. On weekdays. \n\n At the same time, you want a little more out of you night-- like a friday or saturday-- you can roll up with a whole crew, put a few bills in the jukebox to create the perfect playlist, take over the back room and drink beers and play pool to your heart's content. \n\nFor me though, I like to meet my boyfriend after work (on a weekday), after already changing into comfy sweats and tshirt and have a few beers... then stumble on home.", "author": "Nina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-16", "description": "Like a refined 500 Club.\n\nThe Page is a welcoming environment that coaxes the neighborhoodies, alcoholics, the psuedo-alcoholics, and the bar lovers into its friendly confines.\n\nThe chairs are silly comfy and there is plenty of small tables as well as a large bar.  The staff is super approachable and fast.  The jukebox is nice as well as the pool tables.  The beer selection is pretty diverse and they pour some one-eyed drinks too.  The crowd runs the gamut.  One thing that could be said is that they are all friendly.\n\nWord of warning...it will be packed on the weekends.  Hit it after work on a weekday to get the full effect and a chance to fall for a good neighborhood bar.\n\nOne last thing...bathrooms are small but not a diverbaresque as the 500 Club (read 1/2 the amount of puke and only 10% amount of graffiti).", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-26", "description": "I'm new to the lower haight hood. I finally got a chance to pop into this place before heading off to the Galactic show and the Independent. So far I liked what I saw, dark like a good divey bar should be.  However, unlike a \"real\" dive bar they actually have a good selection of microbrews. \n\nI was already 2-sheets to the wind and only enhanced my buzz by drinking a Racer 5...yum! I'll have to come back for a full recon mission. Then we'll see how divey it can really be ;-)", "author": "isaias J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-07", "description": "Been wanting to go to this place ever since I moved here and told my friend Page about it. And I'm glad I finally went. It's on my street, afterall. \n\nChill atmosphere, decent jukebox...a little crowded, but still comfortable. I like the different sections and levels and pool table in the downstairs pit area.\n\nKind of felt like I was in the galley of a ship here, due to the shape and interior. Or maybe I just drank too much and started swaying back and forth. Either way, it was a great time and I'd definitely go back. \n\nA friend told me this place used to be called \"Chances\" which is another great name for a bar, or for a middle-aged singles event night with shots of tequila on special. Or for a cat.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-24", "description": "They have pear cider on tap but the bathrooms are super tiny.  The jukebox was irritating until they started playing some Bill Withers and then I fully said \"AWWWWWWW hellz YAH mah ninjas!\"  Seemed to be a higher than average ratio of drunk marina types (note to guys: wearing a shirt that says \"Tail Chaser\" means you have a small penis) and I have to say that the heavier set girl exposing her breasts on purpose and stumbling drunkenly was a source of trainwreck entertainment to all my comrades and myself.  \nHowever, it bears mention that we didn't stay at the Page...we rolled to the Amber and REALLY ended the night!", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-18", "description": "I'm very thankful this place is under new management.  Back in the days when this was \"Chances\", a very drunk friend of mine accidentally knocked a beer into the foosball table and was subsequently kicked out.  Not kicked out for the beer, but kicked out for turning over the foosball table in a fit of rage when told to stop playing (\"it's a rainy day at Wembley!\").  The blind roundhouse kicks in the general direction of the bouncers didn't help either.\n\nNeedless to say, I wasn't too keen on showing my face around here for awhile (guilt by association).  But now that it is under new management, I feel like I have a new lease on life.  \n\nGreat general vibe.  Pool tables, foosball, and jukebox  - you name it.  Strong cocktails and Shiner Bock on tap!", "author": "Cully W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-07", "description": "I almost feel obligated to give this bar 5 stars, seeing as though it's my local dive, and I used to go there several times a week.  The truth of the matter is, I went there for as long as I did, and never got a hook up.  The occassional dollar off here and there, but for a loyal patron you'd think they'd throw me a bone here and there.  But NO!  Hrumph!\nHonestly though, some of my favorite people bartend and man the door of this establishment, and they do have a sweet fooseball table and 2 pool tables.  Not too shabby.", "author": "Max M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "I don't frequent many bars not within walking distance but this one was worth the trip. The decor was .... well, interesting and the bar was darkly lit enough where you don't feel bad for ordering perhaps one more whiskey soda than you should. They have an internet juke box so you will never be without your favorite early-90s anthem-o-angst. The Page has plenty of seating and the staff is fine with you re-arranging the tables to suit your needs. Also amazing, they let you eat food from the delicious mexican restaurant nextdoor while you enjoy a beer from fairly diverse selection of beers on tap. \n\nSadly they don't take credit cars, minus one star.", "author": "Rachael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "I'd really like to like this bar more, but the problem is that the service is slow, and it kinda smells funny in there. I know it's a bar, but there is such a thing called Febreze, you know. The crowd are okay, I suppose, a lot of B&T folks at the weekend.", "author": "Mi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-20", "description": "Funky little bar but nice.  Bartender and bouncer were friendly.  Fair prices.", "author": "Sara V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "I don't know who is more unpretentious the bartenders or the patrons. I go to this bar on the regular and have never gotten so much as a dirty look. They serve decent sized glasses of Jameson and have an excellent draught beer selection. No matter how busy it is it is never too hard to get a pool table or play some foosball. \n\nMy only complaints would be their lack of drink specials and refusal to accept credit cards. It is strange to me so many bars are cash only because when they accept credit cards I tend to spend at least twice as much.\n\nI recommend the Page to any neighbors or locals looking for a relaxed experience in a place that looks like bar anywhere. I only have one funny story from this place, a friend and I went in on a Sunday night and as we entered Abba's Dancing Queen was playing. A strange song for the Page, even stranger was that it played six more times in a row, I shit you not. We drank our PBR and then ordered a shot feeling like we wanted to leave but having no where better to go to", "author": "Evan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-03", "description": "Alright, I'll admit it, we stopped off at The Page after a loooong night of bar crawling and many many vodka gimlets. I loved this place for the decor, first. It reminded me of an old bar that hadn't changed in a really long time. Another cool aspect, the chairs by the window! \n\nOnly bad thing, the space in the front of the bar, very minimal. I didn't even make it to the back, but I think they have pool tables back there! Definitely want to go back soon.", "author": "Gabrielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "Love this place! Laid back and cool, large whiskey and draft beer selection. Bonus points for it being right down the street!", "author": "Allison S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-03", "description": "Great beer list for a tiny bar.  Cool old school chairs. Absolutely horrid Marina trash ruined what could of been a cool night out.  I it weren't for the marque, I swore I was at the Tipsy Pig. Ugh, maybe happy hour before they all come out of their pods next time.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "I went here for the first time last night. I'm surprised I've never been here before since I've been to The Fly many many times. Last night was pretty crowded (Saturday night) and they have one of their pool tables right in the middle of the room by the bar. This makes the area crowded and inconvenient for those drinking or playing pool.\n\nDown a few stairs there is another pool table and a foosball table. The bar has a divey feel and animal heads decorating the walls. I liked it. I think I would really like it on a week night or basically anytime that it's not that crowded. I'll definitely be going back. Maybe after grabbing a happy hour drink and pizza at The Fly.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-24", "description": "This is a true neighborhood bar. By that I mean that people from all over drop in - doesn't matter how you dress, what your race or ethnicity is, or any thing else that might set you apart - the Page is just a cool pub to relax with pool tables, fooseball, many beers, and a cool staff. Don't be fooled by some marina idiots who wander in later in the night. The staff can't control that. Bob Wait, the owner, and his entire crew at the bar are awesome people who make you feel at home. Go there and give it a shot.", "author": "Edward N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-06", "description": "This is the first SF bar I ever visited and I am still coming back. Reasons I love the Page:\n\n1. Pool tables\n2. Photo Hunt\n3. Juke Box\n4. It's neighborhood feeling on weeknights\n5. It's in my neighborhood\n6. Good people watching\n7. Awesome bartenders\n8. Strong drinks\n9. I have been known to walk the wrong way home after good nights here.\n\nDo it, but don't make it so crowded I have to remove stars.", "author": "Alicia J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-09", "description": "Cheap cocktails. Cash only. Dive bar.  Exactly what you would expect.", "author": "Athena W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "I adore The Page and have been coming here for years. Though it seems to be developing into a more popular bar and is sometimes significantly more crowded than in olden days, I'd still rank it as one of my favorite bars in SF. Service here is quick, and there's a huge selection of both draft and bottled beers, a few of which rotate occasionally.  Plentiful seating makes it pretty easy to find somewhere to enjoy your drink.  Definitely a good spot to check out if you're in the area and haven't been before.", "author": "Tim A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-12", "description": "Been here dozens of times with friends. It's a stones throw from my house.  They have sometimes have interesting beers that you don't find everywhere.\nAlso they have stiff drinks to boot and a couple pool tables. Some interesting old \"Sea Dog\" paintings on the wall make it feel like a grandpa house. I can dig it...", "author": "Timbo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-03", "description": "The Page has quickly become my de facto surrogate Chicago Corner Bar (see Ten Cat). The Jameson and PBR flow just as freely, the staff is just as friendly and the crowd is just as diverse and unpretentious.\r\n\r\nAnd they don't look at me crosseyed when I read at the bar.\r\n\r\nWhy is The Page such an anomoly in this city?", "author": "Don Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-15", "description": "I like that *this* neighborhood bar does not charge locals a cover charge. \n\nMadrone you blew it.", "author": "Amelia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "A good dive bar. Crowded on Saturday nights, but a good time regardless.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-12", "description": "Ah The Page... I only have one fleeting memory of you but in Yelpland, that's enough to write a review (but you don't need to read it). It was the 10th of December and the 3rd day of Twelve Drinking Days of Christmas. The rules state that you must have 1 drink at the designated bar during designated \"happy hours\". I got trapped at work until about 6:30pm and had a massage appointment at 7:00pm. Given rush hour traffic through downtown, I knew time was not on my side. But, if there is a will, there is a way. I zipped through town, parked my car in an illegal spot, ran into The Page, ordered a shot of tequila, threw it back, hugged a few loved ones, and then like a shot of lightning through the dark, I was gone! 1 pt for me, bitches! And the tequila, well, tasted like tequila.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "Great place to hang out.\nPeople are fun and friendly (DOUCHE BAG FREE)\nevery time i go, i usually have a great time\ndrinks are great.\nbut I ADMIT, guys have a hard time getting drinks sometimes! (witness)\ntwo pool tables, sometimes crowded but always fun!", "author": "Tipay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "Oh the Page. I love you. I miss dive bars in the south and of any I've found in SF the Page reminds me the most of my favorite haunts of the past. Maybe its just the Abita on tap and Lonestar in the bottles but I feel at home here. It gets super crowded, and I'm often here on weeknights when it gets busy, but this place has a magical power to suck you in until 2am no matter what time you arrive and what time you plan to leave. Always a stop when I'm on Divis whether its a big night out or drinks with a friend.", "author": "Kelli F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-06", "description": "Interesting mix of people: Drunks, hipsters, workers, DINKYs, neighborhood folk, haggard and pretty, young and oldish.\n\nNot too sceney, good beer, and minimal attitude.\n\nWeekends get packed and sweaty and it's kinda hard to get a drink.", "author": "Whit P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-11", "description": "Went here rather late on a Sunday.  Place was actually full until closing.  It is small but has a large pool room in the back where you can have a seat and have a conversation.  \n\nWasn't there for long but really enjoyed my time there.  People were a mixture.  Bartender was friendly and the drinks were good.  I will definitely go back the next time that I am in the area.", "author": "Ralph S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-07", "description": "Great   Mon-Thur   bar for anyone in the neighborhood. I love the decor, the highway Motel/ 60's dive bar feeling. I especially dig the paintings, old ships, sea captains, and Henry the VIII above the pool table. Very nice bartenders who will actually remember you only after a few visits. \n\nWeekends get a little crowded and the bar takes on a different vibe. Not as fun as on weekdays.\n\nInteresting people watching opportunities, good beer, drink choices, and Soccer-On-A-Stick! \n\nI wish the jukebox wasn't one of the electronic/downloadable song jukeboxes...it kind of takes away from the hip factor.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-28", "description": "I love the fact that my living room has a foosball table, a pool table and lots of trophy heads all around. I have books painted on the wall and a door to nowhere. I have cheap drinks and bartenders with just enough grit to make me come back. I'm the luckiest guy on Page St.\n\nOh wait, Im sorry, Im thinking of The Page, my bad.", "author": "Big W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-10", "description": "Casual cool crowd kind of bar, with $4 drinks!! Definitely a good reason to go out on Divisadero.", "author": "Erin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-15", "description": "One of my favorite bars in the city - perfect for weeknight pool and conversation or weekend frivolity. \n\nThe bar is dive-ish, the crowd varies depending on the night, one pool table is located inconveniently in an almost-hallway, and there are a wide range of beers available. These things magically combine to make The Page one great bar.", "author": "Abigail R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-10", "description": "I have only been to The Page once so far, yet my experience there was one that was very much enjoyed. The beers were delicious and properly priced, the interior decor and ambiance were wonderful, and the patrons were (generally) fun. The pool table in the back was a nice standard to see as well. \n\nThe eclectic style and decent prices make The Page a fun dive that I'll definitely have to visit again.", "author": "Aaron J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "The first few times I walked by The Page, I thought it was like the kind of old timers bar that my grandfather used to haunt in Detroit. It's got a weather-worn, blue collar vibe to it, and there were some pretty shady dudes hanging out who looked like they could body double for Charles Bukowski.\n\nIt was only when I went inside that I realized that this place is only seedy in an ironic, disaffected hipster way, which is usually pretty annoying, but in the case of The Page I'm definitely smitten. It's cozy, it's pretty chill (except for one Saturday when girls were literally dancing on tables. Dancing on tables! Who does that anymore?), and I had the best vodka martini of my life there once, for like $5. Highly recommended as a place to drink like you just got laid off from the Ford plant.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-08-23", "description": "Not a bad place with full bar, cute friendly barstaff, fun internet jukebox . . \n\nit would earn 2 more stars from me if they ditched the TVs.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-23", "description": "Comfortable, dim, and not horribly crowded, this is a chill bar to stop in for a drink.\n\nIf you're looking for foosball, don't look here.  Last time I was there, the Tornado table was in terrible condition, and filled with a mix of red sticky balls (good) and white smooth balls (awful.)  Blargh.", "author": "Caryn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-30", "description": "Def on of the better dive bars in SF... it's got almost everything you would want in a standard chill, dive..... pool table... foosball... deers heads...low lighting... hidden coves to kick it... decently stiff drinks .... pretty good jukebox ... \nWhat's more to need .... \noh wait .. pinball would be the capper for me :P", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "The Page is the quintessential neighborhood bar where pretty much everyone feels welcomed. I just wish it didn't get so crowded on weekend nights... I mean, it's not THAT great.\n\nWell, that little secret room is pretty great, but beyond that, eh...", "author": "Trey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-28", "description": "Excellent little local dive. 2 pool tables and a foosball table in back, but people use the area around the pool tables, which can make it difficult for a game. Good crowd. Cash only sucks, but if you know going in you can deal.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "if you want to get a little piss drunk before you head back over the bay bridge and into the oakland airport  this is the place to be. weird crowd but good drinks. on your way out try to take a bag of potato chips that are behind the bar, i dare you.  ah.", "author": "Joel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-29", "description": "A great neighborhood bar.  The Page trusts it's patrons with musical guidance (jukebox). Surprisingly, with this crowd it works in their favor.  I only have two complaints:\n\n1- foosball table balls are too heavy and slow.\n2- additional speakers are needed in the back area.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-09", "description": "Pros:\nThis place reminds me of a old hotel lounge bar from the early 60's that never realized it was not in fact the 60's anymore. It's a dive bar. Great place to meet up with friends for a casual drink PLUS I can walk from my place. \nDoor guy is always nice.\nCons: \nThe  boy's basketball locker room smell I have to get used to every time I walk in. And it gets way too crowded.", "author": "liz L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "I really like the Page! The decor is great; it's a little similar to that of the Hemlock on Polk in the TL (kind of rustic, with deer head plaques and raccoon art), but it's got less of a rock & roll vibe. I definitely prefer to come here during off-nights or off-peak hours, though. Went once when it was crowded and the whole atmosphere changed...went from being quiet and Twin Peaks-y to being another hipster hub.\n\nThere are pool tables downstairs, a smallish women's room, and plenty of places to sit - again, provided you go at the right time. Nice, cheap PBR, too.", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-16", "description": "My excursions here have been hit and miss.  There's a poll table in the back, which is nice.  Can get busy, and the path in front of the bar is kind of narrow, making it increasingly awkward to move around when it's busy.  Agree with the other reviewers that the sound system kind of sucks.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-24", "description": "5 stars for when it isn't too crowded and I can play photohunt.  3 stars for when it is too crowded and I can't play photohunt.  All the bartenders seem really nice and efficient.  I would give it 10 stars if they replaced one of the pool tables with Pop a shot basketball but I bet a lot of people would not agree with me.\r\n\r\nI just put it down to 3 stars becuase I never get to play photohunt.\r\n\r\n*****UPDATE**** ok I will change it to 4.  I went after work the other day and it was nice and not too crowded, a relaxed crowd of people watching the giants game.  Also, I realized that they had a great, large selection of liquor. which is always good...", "author": "b s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-27", "description": "A nice little dark bar with pool tables, foosball and an internet jukebox. Unfortunately, it gets crowded with douchebags later on at night. \n\nCome and leave early to avoid the a-holes.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-02", "description": "Pretty much a regular neighborhood bar that pleasingly serves me Myers and Coke in a full sized glass. Not too much rum, definitely not too much coke, yay!\n\nGood place to hang out with friends. Totally worth the extra two block walk from my house compared to Madrone (although my distaste for Madrone has diminished some).\n\nI've never been there on the weekend... Correction: I have now been there on a weekend. My was it crowded. Does anybody else remember when  the Page WASN'T popular?", "author": "Noah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-19", "description": "The Page is by far the best bar in this neighborhood. However, it's probably best to avoid this place on the weekends. When The Page fills up it's not the most comfortable place to be. The jukebox offers a decent collection of music, the drinks are fairly cheap, and the staff is mostly friendly.  \n\nIf you're down with cozy warm wallpaper and taxidermy deer heads, you're down with The Page.", "author": "Laura L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "There's nothing like ending your night right at the Page - an abundance of different draft beers, friendly locals, and attentive bar tenders makes this bar stand out.  \n\nYou gotta respect a bar that carries Arrogant Bastard Ale on draft - one of my favs! Keep it up, Page!", "author": "Scott G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "cool bar. it was a little odd that is was so crowded near the front, yet empty near the back. then again, it's not that strange because the bar was in the front :) they have a solid jukebox selection with a bunch a newer songs(always a plus IMO). the bouncer was cool, although i hate that he carded me when i was coming back from a smoke-break. \n\nthe bartenders were nice and poured some stiff drinks. i love when i order a cranberry/vodka, and it is pink-colored(a sign that it is merely vodka with a splash of cranberry). the bathroom was kinda ghetto, but that's fine with me as long as i dont need to take a shit. although i get freaked out when the stall and urinal are next to each other, as i cant \"perform\" under pressure. \n\nthe pool table is always a plus, although it was impossible to get in a game. and college basketball on the tv's is a-ok with me. plenty of tables and seats. good spot in a good neighborhood. great choice for dyl.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-29", "description": "I've lived in the Divis corridor for about 4 years, and I don't know what it is, but the bars on this strip are a drag. There's something especially irksome about the Page. A dive bar should never, ever, ever have carpet! After two steps, I feel like I should hose off my shoes. And two steps is all you get, because the place is laid out so that it's impossible to walk through with side stepping, even on a quiet night. There is a good selection, bartenders are attentive, and the drinks are reasonably priced, but I never want to stay and enjoy them because the vibe is so off. Kind of like how it smells a little off (I did mention the carpet, right?).", "author": "Wayne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-15", "description": "Fun, upbeat music and a lively crowd. Pool tables, multiple levels and a jukebox set it apart from most SF bars. Overall a great little bar that I'd be happy to visit again.\n\nOf course, Arrogant Bastard on tap always wins brownie points with me, too.", "author": "Jay U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-17", "description": "Ahhhhh! Stay far away. This isn't even dive bar cool. It's just not cool. Drinks are nasty. Go anywhere else. Even Zeitgeist.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-06", "description": "This is a great bar.  It's small enough to be friendly but large enough to meet some diverse people.  Free pizza at the Monday happy hour at the end of the bar.  \nSaturday night isn't so busy you can't move, but it's got a great atmosphere nonetheless.  Go now, in fact, I think every day is good there. Especially if you like Fernet.", "author": "George S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-25", "description": "This place is alright. \nThere are pool tables, foosball, red leather seats, liquor and beer + half decent jukebox.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-26", "description": "Okay crowd, Okay manhattan... meh... thats all I have to say about that", "author": "c e."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-29", "description": "This place sucks.  I've never been to a place where the employees try to start fights with the patrons.  It's a shame that a place that could be some what cool, has to hire an ass to check ID's at the door.  He tried to start a fight with 10 people. First off that's dumb on his part and also pretty lame representation of that bar. There was no need for him to say anything to us but he insisted on the name calling.  Real bully like.  If the owners of this establishment had any cares in the world for their bar to stay afloat they would rid themselves of the waste of space that mans the front door.  Unprofessional.   \nYou lost yourself a loyal patron.  Fire the fat guy and your stars may rise.", "author": "Dominic P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-21", "description": "I've come here twice in the past month and it's generally fun until something goes sour very suddenly and very fast. The first time, it was the watery greyhound and the bartender that refused to admit it -- or much less do anything about it. The second time we were seriously put off by a pathetic group of condescending and pretentious locals who monopolized the pool table and made up rules on the spot, haha. Good times. If I could be moved to care, I would have been quite aggravated. Fortunately, our group was fun and the place sufficed, but it's nothing beyond just OK, the cash-only policy is outdated, and the crowd leaves a lot to be desired. There's simply better out there and The Page has exhausted its benefit of the doubt.", "author": "G. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-05", "description": "used to be my hangout until i moved to the mission...\n\ni love it but times have changed... it's much different now on wknds so be warned.  Stick to the week days...", "author": "Vinh N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-06", "description": "I am all for dark and divey bars but this one smelled like urine in the back area and there was nowhere you could be without getting poked with a pool stick.  The crowd was diverse but not in a way that I would call good.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-29", "description": "I thought this place was super cute.  It's fairly small, and not incredibly ideal for people with a big party (like we had), but I still liked the spot.  It has a dark nostalgic kind of feel.  Definitely a throwback old-style bar...wood walls with animal heads hanging around, comfy 60's looking leather chairs, pool tables under hanging lamps, the classic looking bar...it gave the place a really cool vibe.  Also--for a Saturday night, I never had to wait more than 5 minutes to have a bartender take and fill my drink order--which is pretty amazing.  The people around were pretty decent, didn't seem like any sort of specific crowd.  We made a night at the page, and it seemed like a good spot...but it's also super close to a lot of other cool bars.  So if you just walk by and see the neon sign, I would recommend popping in.", "author": "Courtney H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "Reliably good cocktails at nice recessionista pricing. Close to other great stops in the 'hood. This unassuming bar is a great stop!", "author": "Lorna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "this place has never done me wrong.  its a friendly neighborhood bar with a dimly lit interior and old school decorations.  old school meaning 'west virginia' - for example, there are deerheads everywhere and velvet paintings of deers frolicking lovely-like in a happy forest setting.  i suppose one could take this to be both a celebration of life and death.  the portrait of the happy deer... and... then... the stoic yet fragile deerhead preserved in its true to life form.  reminding us all that we are but grains of sand on an infinite beach in this maddening and fascinating thing we call life.  \n\nthey also have pool tables, which is awesome and a fantastic selection of  beers including frambozen, the brew the infamous gil turned me onto.  i am also under the impression that ghosts haunt this place.  man, is it just me or is this review weird? i might as well start listing random items in dadaist fashion and spelling out my gutteral grunts instead of trying to form words.  its mostly due to the fact that i've been having communication breakdowns lately.  i've been misunderstood and judged wrongly.  i assume too much and take for granted that most people will 'get it' when really they won't.  \n\nsuch is life.  frambozen rules.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-21", "description": "Really fanfuckingtastic neighborhood bar.  Killer selection of draught beers, decor out of some weird 70's living room, SOUL music on the jukebox and a few displays of fine taxidermy.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-12", "description": "the guys really do outnumber the gals by like 10 to 1 ratio here. so if you're a guy looking to hook up, why even bother? go to hemlock instead. and if you're a gal, remember it's the quality, not the quantity. now if you're just interested in getting a drink, page is a decent place for that. solid drinks and for the most part, friendly bartenders. however, with madrone, fly and even toronado all within a few blocks, i just can't imagine going to page these days, unless i'm meeting people for a drink, and if they're paying.\n\nanother thing, it annoys the hell out of me when a bar like page calls itself \"the page.\" the word \"the\" should be reserved for only the best bars in the city. page isn't one of them.\n\n\"the\" worthy bars\n-----------------\nthe bar on castro\nthe stud\nthe attic club\nel rio\n\nthere's probably a lot more, but my brain is going dead right now.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "Attended my first DYL Tour event this past Friday at the Page.  Now, I don't know if it was the Page itself that led to the great time or the fellow Yelpers, but I am more than willing to return.  Extra points for being walking/stumbling distance to my house.  I see major potential that this could become my favorite neighborhood bar.  Oh, and it got thumbs up from the boyfriend...and he's the \"neighborhood joint\" expert.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-16", "description": "Stout drinks and a great jukebox...need I say more?", "author": "Todd E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-18", "description": "What a cool place!  Stumbled on over here from Bar Fly with Jay after our book exchange and beers.  Good selection of beers on tap, including Arrogant Bastard Ale.  If you follow my reviews, which you dont, you would know that ABA holds a special place in my heart.  My visit was on a Saturday afternoon, and the bar stools were about half occupied.  Great time to go since you can chat with the bartenders and other patrons.  Everyone was friendly and interesting.  Ill go back.", "author": "Martin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "Please don't go to this bar. It's my bar. Go home frat boy. Just kidding. Sort of. I hate when it's football night and the meatheads and meat-ettes pour in to get sloppy drunk as if it's the Fishbowl. I much prefer the more low-key vibe. Gawd-bless the bartenders who recognize the regulars, and well...serve us first. :)", "author": "Trinity M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-03", "description": "Page adds to the list of all the neighbourhood bar.. We usually go after work.. and both of the staff Rebecca and Laila are very friendly and good. Very good for late weekday nights. Good prices too.", "author": "Shradha K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-15", "description": "Came here for a nightcap after a long night out with the team, wasn't too impressed, but then again, not really my kind of place.  Deer tapestries and 20+ beers on tap doesn't exactly equal a good time in my book.  I tried something different - a beer that I chose at random from the taps.  I think it was called \"Intrigue\" or something shifty like that.  All in all, a nice place to end the night with friends.  And Fernet?  No thanks....", "author": "Sam P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-11", "description": "The Page is one of the least pretentious bars in this city. No dance floor, the pool tables are too close to the walls, everything is dim and covered in old carpet. Fucking. Perfect. My only wish is that there was some 200 year old sea captain posted up at the corner of the bar spouting mermaid stories, and the legend of his wooden dick. Instead they have a video poker machine.", "author": "Rob D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-13", "description": "If you are a chump, prick, preppy or total douche then you will love The Page. It was a lot cooler when it was Chance's and it wasn't even cool then. We used to say going there was \"taking your Chance's\" (i know it's not funny). The pool tables are uneven. The TV's are always on. The internet juke box is obnoxious. The bartenders are hit and miss. I have to admit a few of them are cool. The drinks are pricy and most of all, the scene SUCKS.  A good place to do some coke and throw up.", "author": "Kyle J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Oh the Page. Definitely the easiest bar on Divisadero. Best for locals for weeknights - weekends seem to attract a different cliente. Very wide ranging beer selection, reasonably priced. Nice old school pub tables for sitting and having legit group conversations. Back room with the pool table, foosball usually has open places to sit if its busy. Stinky carpet that reminds me of my Grandpa's basement 20 years ago.", "author": "Adam V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "I really wish I lived closer to The Page.  I ended up here randomly after having dinner across the street and it's just such a great bar.  I knew I was going to like it from the moment the bouncer struck up a conversation with me, complimenting me on my Obama button AND my coat.  A good man, no doubt!  The Page has good beer on tap, good tunes on the jukebox, and a friendly, unpretentious staff.  The night I was there, the clientèle was cool too-- very chill, young, but not too young crowd.  The place is huge, with two pool tables and foosball if you are so inclined.  I watched Michael Phelps win his 8th gold medal here and I can't think of too many other places I'd have rather been (except Beijing maybe :)  I just wish they took credit cards...", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-11", "description": "It's close to my house and it gets the job done. What more is there to say? If you ever want to go drinking at the Page call me up and I'll meet you there.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-23", "description": "This is a great neighborhood bar with a good selection of beer, two pool tables, friendly locals and bartenders, and the most honest staff I have ever encountered in a city.  I left a brand new black cashmere scarf there about 2 weeks ago. After forgetting to call them, I wrote it off as gone by the third day.  I finally made it back this past Thursday with some friends and thought, \"what the hell...I'll at least ask.\" Sure enough, they had held on to it for me.", "author": "k. w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "This place is a great neighborhood bar. It definitely covers the spectrum. Where else can you have someone sipping 209 gin and tonic with pinky in the air while the guy next to him is sipping Pabst from the tap? I ordered the 21A watermelon wheat beer the last time I was here. It comes in a can, and to be honest I was kinda embarrassed to be drinking beer from a can... at a bar. I think the cute bartender picked up on this and offered me a glass so I could pour my beer into it. At that point I knew this place rocked!", "author": "Brian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "I'd give this five stars, but the drinks are just *slightly* over-priced and on the weekends it gets jammed with people that I never see there on the weeknights. But, yeah, if you live in the area the Page is the best place to catch a beer on a Wednesday night. It's relaxing like peeing in the shower.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-19", "description": "Someone could make an interesting case study of the 3 bars housed in victorians on Divisadero St- Lions Pub, Madrone, and the Page.  \nI'd seen the page on many trips down Divisadero, but never stumbled in until a month ago.  The exterior and signs looks vintage or maybe even run-down.  Turns out, that is part of the charm, rather than a draw-back.\nNow that I live nearby, its a go-to for a low key night, great for conversation or billiards or foos ball.  \nNot scene-y, but a good eclectic crowd.  Most draughts are 4.50, the staff is patient, and the music has always been a nice variety.  \nI especially like that the place moody wall paper, low lighting, dark bar gives it a cozy, victorian feel.  Similar to Lions Pub, but without the pomp and circumstance and fruity drinks.  This a relaxed pub, likely to induce conversations with grad students, and not a place to get into brawls or have a hot night out.", "author": "Christian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "Another great dive.  I drink ketel one & soda so, I can't really say anything about the cocktails, they make a great ketel/soda.  My friend says they do a great dirty martini.  It's just a good wind down (up?) spot for after a show at the indy on a random Tuesday...  or whenver.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-18", "description": "This place has some potential. And oddly enough, it's new name happens to be \"The Page.\" Cool name for a bar, with one of those cool, newfangled internet jukeboxes (no Led Zeppelin, though I'm disappointed to say) and a pool table in the lower level. I was here during the day on a pub crawl so I'll have to go back at night and see if it's swingin'.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-13", "description": "I like this bar in spite of the carpet (why?) and the charmless, dead, machine-like eyes of the bartenders.  Although I do admire the bartenders' unrelenting cheerlessness and the way that I get absolutely hammered every time I go there even if I only have one drink (how?).", "author": "Mokirobinson M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "Ole faithful...the Page never let's me down.  It's the \"neighborhood\" bar where you're most likely to run into people you know.  Great jukebox, pool table, foosball (sp?), and friendly bartenders.  I used to come here all the time and I'm feeling this void in my life...I think I need to go to the Page.  Pete J. (aka Mayor of WAMA) when is the next town meeting??", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-09", "description": "A friendly place to jump in and have some real Californian Ale and some easy random talk with traveling actresses, socialist feminists or linguistics GI Joes at the bar, or just to organize a spontaneous quick foosball championship for the night over the billiard table.  Beware, they have the Tornado table, not the Garlando I've used to play overseas.", "author": "Tamas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-25", "description": "great place. \n\nthe fooseball table is awesome, except when people take the balls with them when they go outside to smoke.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-16", "description": "At first this place seemed cooler. Upon entering and ordering a vodka gimlet I was pleased to see the juicer come out and add freshly squeezed lime juice to my drink! the upstairs was a bit narrow though and it was hard to stand up there with a group. We went down to the fooseball table to hang out and play. Again it soon became a bit too crowded, people needed to get to the ATM machine which was sort of behind the fooseball table and therefore interrupting our group of friends. Then all of a sudden it got ridiculously crowded and no one could comfortably play pool let alone fooseball. The crowd was on the young side - if you're into that. It might be OK to come in for happy hour or something but sat night was a bit cramped for a bar that seems like it has chill intentions.", "author": "Lindsay A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "This is my neighborhood bar.  The crowd is mostly tourists on Th, Fr, Sa, but during the week it's way more relaxed.  Good for pool, chatting.  Jukebox is on or else there's no music.  The bartenders and bouncers are really nice.  Tends to be the go-to bar when the independent closes.", "author": "Neil G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-16", "description": "In all the years I lived up the street, I desperately hoped that if Chances ever went out of business, someone (like me) would buy it and name it \"Second Chances.\" Unfortunately, they sure didn't.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-15", "description": "A mix between a sports bar and a dive bar.two pool tables in the back and sports playing in the front. Unfortunately I think we came on an understaffed night. It took my date a good 10+ minutes of waiting for a drink, and 3 of me interjecting on her behalf to get a drink. On the very positive side the place does have an oatmeal stout on tap, so my tummy was very happy.\n\nUnfortunately this bar is cash only. While that is not uncommon, it is still unfortunate. A pretty decent date place, but expect to be heckled if you are making out in the corner.", "author": "H B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-19", "description": "Basically the page is my favorite bar. It's dressed up as a dive, but it has a really nice liquor selection. Like, there are tons of flavored premium vodkas for the reformed marina girl in all of us. 2 pool tables, foozeball, and pink lights, what more could you ask for?", "author": "Roseanne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-20", "description": "Y'know those places...the ones to see and be seen, this isn't one of them. It is a place to get a drink, play some pool and order something up on the internet capable jukebox. So, if you've just come down from the high of a great shopping spree and can't wait to show off your new---whatever, go somewhere else. If you're looking to hang out with your friends, get a little buzzed and stumble home, you've just found your spot.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "I love the Page! I just love the way it looks! It's a great early evening bar!", "author": "Amy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-22", "description": "Good drinks and I think the bartenders are really cool. They don't get uptight when it gets crazy busy and they don't make mistakes. I like pool and I like the decor here it's a comfortable hangout. The patrons are hit or miss. I've encountered downright hostility....from Brits and Americans...oddly enough...and also have met some authentic long time San Franciscans such as yours truly and had one (upper B list) celebrity sighting: Amy Poehler. Does get a bit too crowded at times. With a little bit of room to breathe and a good crowd it comes highly recommended.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-12", "description": "Two pool tables and a juke box.  Beer and cocktails.  No one pretty so I don't have to dress up.  Lots of friendly, chatty folks--I've met new friends here on more than one occasion.  Good pool players without the pretense.  Great place to hang out.", "author": "Nicci S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-22", "description": "My butthole still hurts from the no credit card register ring. Lame.", "author": "C. Grant M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-29", "description": "Good jukebox with a nice selection of beers on tap. Fortunately, this place is open after some of the other bars close. The pool table and foosball are a nice addition, just wish I could find someone to play foosball against...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-28", "description": "Well, what can I say it was a good night and an equally great bar. I was here last Friday with some Yelpers. I love that it's two floors and is equipped with two pool tables. The bartenders were friendly and made me one very strong vodka and tonic:-)  I will definitely return again since its soo close to home.", "author": "Stacy F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-02", "description": "The Page used to be a bar that I would go to every once in awhile. The people are generally cool there. However last time I went we had an overwhelmed bartender, who was clearly in a bad mood and short pouring all the shots. I watched her do a 10 count on 3 shots. I asked her bout it and she glared at me and said it was a 12 count. I hate to slam a bar for a bad night, but short pouring is a sin....", "author": "Tommy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-28", "description": "Just divey enough.\n\nCheap dranks, and cute skanks", "author": "Ollie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-26", "description": "i remember when this used to be chances. i love that part in rent girl where michelle tea describes going to chances for a hooker party and although they arent in sf when that happens (and thus not at our dearly departed chances on divis), i always imagine it's the same bar and i just might see some girl from the scene slouched on a stool, fishnets torn, pushing her natty birdnested hair out of her eyes, sipping a watery gin and tonic with a bleary red mouth. \n\ni never do, but it always just feels so possible. it would just feel so right. \n\ni live right across from the page so its always my last nightcap on the way home. i love curling up here with a few shots for the night and a pint before bed. i always see people i know here, and usually invite them back to my house for a night-night nightcap --  even if they're two inches from my nose insisting i owe them money or asking if i'm the new girl in the building whos an IV drug user. cause you know, they knew where the best needle exchanges were in the city. seriously, not judging or anything. \n\n\nwhatever.  if you're here on a sunday night, look for the girl with fake birds tangled in her hair, swaying to 'foxy lady' by hendrix. it might not be me, but chances are i'm close by.", "author": "leona .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "You know those days in San Francisco, there's about 100 of them, where its raining and cold and all you want to do is stay indoors and do nothing? Those are the days I want to spend at The Page, doing nothing. Hours can be wasted in here drinking (yes its cash only but we are in San Francisco after all, get over it), playing pool or Foosball (I semi-suck at the former, totally suck at the latter), or contemplating just what that creepy window by the guy's bathroom with the curtain covering it is. Comfy chairs, lots of bar space, but it does suck when its crowded.", "author": "sholeh m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-20", "description": "Don't be fooled. This is NOT a dive bar. That being said, for the most part, I like the Page. Nice bartenders who pour stiff drinks. The crowd can be mixed -- some nights a little overly jocky, some nights a little overly hipstery, but usually a nice balance. A little overly crowded on Fridays and Saturdays, but other nights of the week are good. It can be a bit of a sausage-fest... I'll leave it up to you to decide if that's a good or a bad thing.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-20", "description": "Exclusively ours on my birthday, therefore a fantastic place for a private party!  Not a happening bar, but the bartenders were very accommodating (carbombs galore) and the jukebox was rocking!  Great place with friends on a Saturday afternoon.", "author": "Natalie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "Great bartenders, decent crowd. \"where should we go tonight\"....\"eh, i dont know what do you feel like doing\"....\"not sure, lets try something new\"....\"ok what neighborhood\".....\"not sure what do you think\"......\"i'll do whatever\".....\"well it is getting late to travel to the mission\".....\"ya.....\".......\"guess its the page\". \n\nIf you dont feel like figuring out where to go for a few drinks, just go to the page. Decent prices and you will most likely end up talking to everyone seated around you. Pool tables. Local watering hole. Thanks.", "author": "Diana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-06", "description": "Well I've been living in SF for a month now and I have now designated this place as my local neighborhood bar.  I like the feel and ambiance to it and it doesn't hurt that they have cute friendly female bartenders working as most places should have that as a requirement.  The crowd is good although it tends to get a little meatheady at times but overall I like the place and will return to this place on a regular basis.  The only thing although it's not a huge problem is that they charge $4.50 for their cocktails where most places charge $4....so instead of leaving $5 I have to leave $6 since nobody ever takes the .50 change....I'm going to have to take that change now....will need those quarters for the bus or for laundry.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "This is my local and it's a good all around bar.  They have some tv's, an mp3 juke, photo hunt, pool x2, foosball, and a handful of tables all in a relatively small space.  It's not quite the classic dive it used to be as Chance's, but still has a neighborhoody feel or maybe it's just I feel that way since I live in the nighborhood.  A new name/owner, a fresh coat of paint, small increase to drink prices and this place is now pretty happening.  It gets packed way more than it used to and I would now consider it a destination kind of bar for many as opposed a bar where you'd have a couple to start off or end your night.  Of course, you can still do that, but you can also be out and amongst a bunch of people here now as well.  On a final note, they have a full bar unlike many of the beer/wine/sake places in the lower haight.  The Page is easily my bar of choice on Divis.", "author": "Zach J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-27", "description": "i have a love/hate thing going on with the page...\n\ntoo many college kids but there's foosball in the back\n\nthe place smells but there's faux brick wall lining (PIMP!)\n\nthere's never cute girls in there but the bartenders are cool\n\nim not so sure id go here if i didnt live 100 ft away but then again it's not that bad considering madrone is the other option", "author": "daniel c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-11", "description": "This dark and discreet hang out for locals allows for one to many Basil Handens rocks.  One more, please.", "author": "frankee U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-16", "description": "Oh sweet giver of whiskey, how do I love thee? Cool owner, cool bartenders, cheap drinks...Powers Whiskey represented like it should be. Bye Bye stinky Chances and hello home away from home.", "author": "Ham and Eggs M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-22", "description": "the only local bar in  my hood that i'm willing to step inside, non pretentious & $5 shot of jameson's!  oh happy day :)\n***************UPDATE 12/29***********************\n\nbartender served me a shot with two chips on the glass and showed no remorse for it.  never coming back, classless sober, angry bartenders, door guy is cool though.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-30", "description": "This is a good neighborhood bar that occasionally gets too crowded.  The pool and foosball tables are nice, the drink selections are good, the bartenders average.  They occasionally have some nice special beers from Magnolia.  I probably won't be back much now that I don't live across the street, but it's a pretty good bar, if there isn't too much of a crowd.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-06", "description": "This bar is way fun on the weekdays...  foosball table, pool table, chill locals.  The weekend is another story...  Marina residents flock the bar by the taxi load and it reminds me more of a college dive bar than the local bar I love.  Either way the staff is nice and the beer is cold, not to mention only a one block stumble from my place.", "author": "Timmy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "This was the site of my 1st official DYL event.  Rainy night and I actually found parking just up the street.  The Page is the type of neighborhood bar where you can go and unwind after a long day.  It's a little more low-key than Sutter Station...not as bright on the lights, but ample space for a crowd.  Cool web jukebox.  Foosball and pool in the rear.  And the bartenders are cool there.", "author": "JeFF T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-03", "description": "Solid.  Great selection of brews on tap.  Good crowd for a Thursday night.  No attitude.  A neighborhood plus bar.  They have a full bar but most folks were drinking beer - its that kind of place.  There's a pool table in the back, so you just might sink a shot in the left corner pocket.", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-18", "description": "the page is:\n\n1.small\n2.has good music(i tend  to judge things on their music)\n3. has nerds w obama shirts coming on to me and my friends\n4.decent drinks", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-07", "description": "I tried on a complete stranger's HUGE wedding ring here once. I guess this review is more or less to preserve my grand memories. It was so sparkly!", "author": "Erin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-04", "description": "ahhhhh, i'm so excited that the Page is my new neighborhood bar.   It feels instantly cozy, but not boring.  Whatever kind of night you're trying to have, the Page can provide.  it's the perfect go-to spot.  turns out there's lots to like about life in the panhandle . . .", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-17", "description": "The last time I found myself here was immediately after a friend and I got 86'ed from that other bar down the street for smoking in the bathroom and tampering with the smoke detector (in protest of the impromptu no ins-and-outs policy; can you believe it?!). The repeated pounding on the door hadn't deterred us either, we just assumed it was some dumbass, drunk and impatient coke fiend at whom we continued to yell, \"SHUT THE FUCK UP!!\" Actually, turns out it was the 6 foot 7 gargoyle of a bouncer and he was fucking pissed, to say the least. Hilarity ensued as we were being escorted from the bar with me trying to make a case for the lack of evidence linking us to the scene of the crime and my friend repeatedly denying her inebriation with absurd statements such as, \"I could DRIVE right now if I wanted to!\" In any event, towards the Page we stumbled, almost instinctively, and it welcomed us with open arms. This bar means business and business means booze. No DJ's, no dancing, no theme, no scene. Just a row of worn-out bar stools begging to be warmed. This is my kind of bar.\n\nIn a way, the Page is sort of like your lame friend's cooler older brother with the lame friend being that nearby watering hole. Your motive for hanging out with aforementioned lame friend is clear: you have a crush on her awesome older brother but he doesn't really know of or care about you. He's just there. Like maybe while your sort of lame friend is in the bathroom, you pretend to wander aimlessly down the hall pretending you're looking for her and conveniently \"drop by\" his room, casually \"pop in\" and \"innocently\" ask what's up. Maybe he ignores you because Metallica's on full-blast and you don't have the balls to speak up or maybe he just looks up and nods because you're his sister's totally pathetic and uncool prepubescent friend and now you're totally embarrassed and want to die. True story. Anyway, I forget how I intended to weave this analogy into my point. But back to the Page, go there.", "author": "Jenn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-04", "description": "Long, skinny bar that makes it seem like more people are in there than there actually are -- but an overall good vibe in this place. The cute bartenders are some of the only girls in the place, but at least they make a good drink. If you are feeling a little claustrophobic, make your way to the pit in the back and play some foosball.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "This bar is my living room.  I've been going here since Hank and Sean were the owners and you could smoke.  I have albums of birthday party pix by the pool table.  They have your typical selection of beer and hard liquor.  I would say it's the best bar in the middle Haight.  Just remember, CASH ONLY.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "Racer 5 on tap and a pimp at the bar.  No really, a pimp...  Like Huggybear.", "author": "Tony A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-28", "description": "Better during the week.  Too many people during the weekend, but great neighborhood place.", "author": "stefan d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-21", "description": "Ah Le Page... What can I say except the juke box is always broken, and thats the highlight.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-21", "description": "I just moved to San Fran and live in Alamo Square Park and I found the Page and love it! It's a great place to go for a night cap. The lighting is sexy and the bartenders are very sweet!! The crowd is pretty chill.....", "author": "Cara- Jude S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-17", "description": "Nice people working there, fun and laid back crowd, Duvel, low ceilings, Photo Hunt. And after 2 Duvels, I'm glad it's near my house.", "author": "Melanie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-23", "description": "I used to like this place a lot really but the staff has really been a pill the last couple of years.  The bartenders, really just the female ones, are quite stuckup and bitchy. They will come around and serve you when they feel like ending their conversation with the guy they are talking to at the end of the bar. There attitude is so bad they will make you feel like you are unwelcome and wasting their time. Maybe because I am a girl I don't know but they seem to have it out for me just about every time I go there, which is not often, maybe a couple of times a year. But funny how I have a similar experience every time... So unless you are with a big group of people and the bar is fairly busy (so that these girls actually have to work) I'd say skip it, there are much better and more pleasant places to hang out in this neighborhood.", "author": "Jen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "I liked this bar a lot! Security helped me find a bus route home. Bartenders were sweet. Some of the customers were idiots, but welcome to lower Haight. I'll be back, for sure.", "author": "Dana F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-25", "description": "cute place. it has a really comfortable vibe to it. the drinks were\nsuper cheap. i'm used to paying $8-10 for drinks in chicago so $4.50\nfor a vodka seven is dirt cheap. it was like christmas! we came on a\nsaturday night so the place was packed. i'd come back.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-11", "description": "My boyfriend is completely shy and will generally avoid going to bars with me at all costs, but I could see him loving The Page.  The bartenders and patrons are completely nice and laid back and the drinks are relatively cheap.  Plus they have foosball.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-30", "description": "when a bar gets it (and by \"it\", i mean MY drinking preference), then i am ecstatic. it's as if each time i arrive at a place and survey their bevvie optins and discover they have the ability to combine cider and lager and make magic, then it's christmas all over again. and not the depressing sort of christmas where you're stuck with the part of the family you didn't care to see, but the christmas where you're five and believe in santa again and there's snow outside. THAT sort of christmas..\n\nthe page is a favorite amongst friends. it was even fought over by one in their \"divorce setllement\" - it was actually a point of contention who could be seen at the page after the split. the bathrooms are small, but at least they're not as impersonal as, say, peeing in a trough at bar none. the pool tables (the page has two while most bars only have one) are a nice touch, even though i have yet to utilize them. and the supertouch in the front window is probably the best part. outside of the snakebites, that is..\n\ndo not have the following conversation at the bar, within earshot of the bartender, though:\n\nperson one: \"what are we drinking next?\"\nperson two: \"alcohol? or beer? i was thinking beer.\"\nperson one: \"ok. beer\"\n\nwhy shouldn't you have this conversation? because the page is one of very few places who carry ok beer, and you will be handed a bottle of the russian brew because the bartender thinks you just ordered it. i mean, go ahead and have that discussion, but when you're handed that bottle, don't say i didn't warn you.", "author": "Jeremiah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-16", "description": "I give the Page five stars for one reason and one reason only....Erotic Photo Hunt, which is by far the raddest game ever!  Thank you Page.  You will always have a special place in my heart!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "Solid dive bar with some great beers on tap. Lots of Irish folk hanging out, which is a good sign (unless there is some kind of hardcore football match going down, in which case it may still be a good sign, but you must have a high tolerance for being hit on by incredibly drunk Irishmen). There is a pool table in the back and there are tapestries on the wall featuring woodland creatures. Friendly vibe and lots of good eats nearby.", "author": "Angie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-03", "description": "Seemed sketchy to me with lots of shady people venturing in and out of the bar. One perk though, which made the experience a little  better, was the internet juke box.  I'd say if you have a good group of friends to go with The Page wouldn't be too bad, but definitely not my first choice for a weekend night.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-24", "description": "Minus one star for lack of originality in the naming process. I only entered the bar formerly known as Chances once since the change over. It's lost the entire feel of what it used to be, but don't get me wrong, that is probably not a bad thing. Am curious as to how Page & Divis is considered Alamo Square....very perplexing.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "Considering I live practically as close as one can to The Page without actually living above it or inside or it I go here quite a lot.  Sometimes multiple times a week.  Great beer selection and good seating.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-07", "description": "This bar is the closest to my house and I usually tell friends of mine to meet me there before a night of long-winded debauchery. But it's also a spot where I can watch a game on TV without being surrounded by too many hardcore sports fans. I watched the 2002 Super Bowl and several games of the last five World Series. The bathroom is awkward but not too bad when you're really drunk and I enjoy playing pool there because it's out of the way.", "author": "Klik W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "They have pear cider on tap! That's all I can say. Well, also, friendly bartender, great, old school bar area, and a modern juke box.", "author": "Macy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-19", "description": "Ok I gave it an extra star because of the beer selection. I'll give it that because it is good and different. However, the jukebox is the absolute worst one in the history of bars. You need to pay extra to get what you want and I'm not sure it even stays in there so it's a huge money suckage machine. The cocktails are weakish, and sometimes they're strong so they're very inconsistent...the crowd is also inconsistent. So there's foozball and pool tables, one of the tables is located in the worst spot for it I believe and when it gets packed it really sucks. If I didn't live across the street....well, I do and I almost never go in here because I hear all the drunk douchebags outside all the time on the weekends. Oh and another thing, TVs do not make a bar. Ambiance is fairly cozy and the tables and chairs are pretty homey. And that's about it.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-19", "description": "Pretty sure it changed it's name to The Page, but it's a great neighborhood bar...foosball table and all!  Perfect for the Haight St. bar crawl!", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-13", "description": "This place is gathering some serious momentum.  It used to be sleepy.  Now, the list for getting a pool table is over 5 deep.  Bartenders are super friendly.  Juke box is solid -- you can download tunes to it that it didn't have.  Be sure to say Hi to Jessie -- the resident blonde Pool Shark.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-11", "description": "A great escape if you're sick of Polk St sports bars.  Same kind of vibe, with a less post-frat guy crowd.  With a bar like this, I wish I lived in this neighborhood.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-08", "description": "No frills, no nonsense, neighborhood bar.  Nothing exciting, but it gets the job done.  Yes, friendly bartenders, foosball, and cool jukebox all a plus.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-04", "description": "great drinks...\ngreat hipster crowd..\nbest jukebox...\n\nplayed Doves over + over and no one minded", "author": "aynne v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "I liked it as Chances better, but have always had a pretty good time here.  Never been here at a busy time really.", "author": "Ed B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-05", "description": "I love this place, especially since it's one of the only bars (except for Madrone and Waziema) on Divis that serves hard alcohol. This bar has such a good feeling to it. I'm a big fan of bars that are throw-backs to another time. Another time where people are chill and unpretentious and wood paneling was acceptable. Pool tables are a definite plus.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-13", "description": "This place reminds me of a warm place on cold nights in Minnesota. They have the taps a flowing and the staff is friendly. I was in there when Barack won and the owner bought everyone a round. Definitely a good stop-in type place with a slightly older crowd and an air that's reminiscent of old school smoky bars from the seventies.", "author": "Devi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-25", "description": "I had been trying to get to this bar when it was \"Chances\" but never made it. I have been twice in the last month or so; once on a Tuesday and again on a Friday. Tuesday night was very mellow but Friday was crowded. I liked the bartender and the few people that were there on a Tuesday were mellow. There is a pool table in the back with a good amount of seating for a large group. The Friday night that it was packed seemed to have a very lively crowd. I am glad this place is still a bar; the corner was empty for too long before they had Chances.", "author": "E P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-03", "description": "This bar definitely has that neighborhood-y feel. If you're into that. But that could just be me since I only live a block and a half away. \n\nThe good thing was that I went with six other people and we managed to sit together and all hear each other. The jukebox by the entrance looked pretty cool. I wanted to try it, but didn't get to 'cause I was wedged between our two tables. Overall, I think The Page is a good starting point but I was ready to move on by 1.5 of 3 drinks.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-13", "description": "Fun neighborhood bar; nothing spectacular but nothing too shabby either.  Decent crowd, bonus points for Young's Double Chocolate Stout.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-04", "description": "My local bar. Don't come here and order a martini and expect the world's best. In fact, don't order a martini at all. Don't order a mojito. Don't order a cosmo. Order a beer (the selection is usually great), a jack-and-coke, a scotch-and-soda, or a greyhound, and remind yourself where you are. Play some pool, sit on the stairs and talk about music, see your friends from college or from the neighborhood, take a nice walk home. Great Tuesday night bar.", "author": "kay v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "Good beer selection at reasonable prices.  Good whiskey selection.  Nice and dark.  Low, comfy chairs for relaxing with a beer and being able to talk to your friends.  2 pool tables and a foosball table (!!!).  Solid jukebox.  Overall, a great little dive bar.", "author": "matt c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-16", "description": "your average neighborhood dive.  you can count on them. the drinks are always the same, the crowd is varied but local.  great for a first \"meet\" date.\njukebox, pool, and cozy chairs.  good old time bar.", "author": "regina k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "When you head it in feels like you have walked into some random bar in central CA (like Sonora) and they even have the prices to match (at least if you get there during happy hour).  Wide and frequently changing selection of great beers on tap and a full bar.  Only down-side is that it can get crowded and it is a pretty small space.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-22", "description": "Nothing to call home about. Typically crowded on the weekends. Sometimes I'll play pool here.", "author": "George M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-05", "description": "The page is the type of place where its cool to hang out if its pretty empty, and even when its pretty packed because the people that go there are generally friendly and just neighborhood people in their 20s and 30s.  Great place to go after a show at the Independent.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "After the track suit wearing chain smoking rein of Chances owners, the Page is an immense improvement.  The place used to have a coat of grime and crud but now feels clean and comfortable.  The owner is a super nice guy as is the bar staff.  It's great to have a local watering hole that serves more than beer with a good jukebox and pool table.", "author": "kathryn a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-29", "description": "A little story before anything else:\nThe first time I got drunk off beer was with Zibby and we were drinking 40's of Mickeys.  After the first one I felt like I had reached my limit (boy have times changed!) but Zibby kept going strong.  About halfway through the second 40oz, he started with the trash-talking.  Calling me all sorts of names, pestering me not to be such a pussy and to just drink, etc.  A few minutes into his bantering and just before he was about to take another swig the scenario played out like this:\n\"You pus--\"  BLARF.  *Zibby puking*\n\"Oh man, this suc--\" BLARF *Zibby puking again*\n\"Dude, you're lucky you didn--\" BLARF *Zibby yet again puking*\nOne of the few times that restraint on my part actually paid off.  Also one of the last times where a single 40oz could get me drunk.  \nThat being said, I've always known my cutoff point when it comes to booze.  Well, almost always.  But for whatever reason, The Page is *that* place for me where I test out my limits.  After a raucous night out when I should be heading home, I often go to the page for a last drink.  When I'm starving and the only thing I've had all day is booze, The Page is probably where you'll see me having a liquid meal.  Always full of relaxed and good people, always friendly bartenders, tons of beers on tap...a great place.  One of these days I should start out my night here instead of ending up here.", "author": "Zev K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-25", "description": "The barman knows what he is doing, there's pool and foosball downstairs, and taxidermy ornamenting the walls.  What more could you axe for?  Very good neighborhood corner bar.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-06", "description": "Love this bar.  Friendly bar staff, great beer selection, foosball, pool, and awesome occasional liquor tastings (bourbon, scotch, gin, etc.).  The atmosphere here is exactly what I'm looking for when I need a cold beer.", "author": "John F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-21", "description": "A nice low key bar. Perfect for a date with someone who you would like to be able to hear during a conversation. Two pool tables, good beer, Great for weeknights too.", "author": "Dana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-29", "description": "When this dive was chances it was a five star dive, now with new ownership and an even worse name, it looses a little streat cred.  Still the bartenders are all very sweet and the juke box rules", "author": "brian m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-22", "description": "This one is a keeper! The music in here is really good, but its misleading to say they have a good jukebox when its an interweb jukebox. I mean, regular jukeboxes only have so much space for music. This one has tons! So its not that the jukebox is good so much as it is the good taste of the patrons.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-19", "description": "Just recently moved into the neighborhood and I have to say the Page is by far our favorite bar in the area.  I think what I like most is that I can walk in there on a Tuesday or Friday and there is a good amount of people in the bar, not too crowded but not bare either.  Always a good time!", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-18", "description": "The page is OK. It has a nice atmopshere about it and the drinks are fairly strong -- but at $8 for a double well mixed drink, I'd hope so. For the pool players, they have 2 tables that are well kept. Unfortunately this place gets really busy and it makes playing pool very hard. On top of that , the upstairs table has a wall in 2 places, making certain shots pretty much impossible. The crowd is usually very laid back and the have good tunes. Now that I think about it though, it is pretty sausage festy with all sorts of frat looking guys coming out in their abercrombie and old navy rags. This is a nice bar for happy hour during the week, but for the weekend you better be prepared to stand for a long period of time and get bumped into by a lot of people. 3 stars b/c of the drink prices and crowds.", "author": "Billy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-02", "description": "The Page is a cool, little, neighborhood bar.  The night I was there it seemed to have mostly 20 and early 30 somethings from the surrounding blocks.  The have a couple of pool tables.  But the best feature is that they have a foosball table.  I was pretty happy drinking $2.50 Tacates.  The only negative was the very expensive digital juke box.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-08", "description": "Best neighborhood by far. Good Jukebox, good crowd, mainly locals, good bartenders, pool tables. I like this place on a Tuesday night where I can sip on a Jameson and shoot some stick, or on a busy Friday night playing trivia in the corner taking Fernet shots and people watching. I like when places don;t try to be anything but what they are. So, whereas the Fly wants to be swanksville, the Madrone an artsy DJ hipster thing, The Page is just a bar, and they excel at being a bar, they put whiskey in my glasses, Heineken's in my hand, and memories from my nights, brilliant!!", "author": "Steve l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-12", "description": "This place is a descent local joint, but definitely nothing special.  If they had better drink prices then I'd give this place better marks, but providing a dive bar ambiance while charging premium prices kind of annoys me.", "author": "kiely c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-25", "description": "The best thing the Page has going for it is that it's the closest watering hole to my humble abode.  Decent beer selection, unpretentious crowd.  Good place to grab a beer and bitch about your week with a friend.  Probably not worth the trip if you're not in the neighborhood.", "author": "Arthur S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-21", "description": "meh. Every time I go to the Page, I think it will be lots of fun, and every time i walk back home, up the massive hill that is Divisadero, i wonder exactly why i thought it would be fun. It's possible i simply need to go there with different people than usual, but between the crowd and the volume, i am usually let down.", "author": "Manlio L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "I must admit I like this place when it is not pack full of people.  When it is packed it bottle necks into a very annoying bump and grind hallway.  Most of the female bartenders are cool.  One of them makes a dangerous Manhattan.  Got to say that it needs a little etiquette on the order of who is  next in the line but whatever.  Like I said best place to go to when it is not packed.", "author": "adams l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "The Page is awesome. They are remodeling this week (2/19) so they had a blowout on Sunday night were draft beers were a dollar. I got drunk and left some posters there because I came from a show at the Fillmore. I figured they were goners but i called the next day and they had put them aside for me. Cheers page, I will see you soon.", "author": "Sean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-17", "description": "I've been coming here since it was Chances and I'm glad to say Bob, the new owner has not changed it too much. It's still a great place to go and watch or game or play some pool and have a beer or ten. All the bartenders are great and the vast majority of the crowd are laid back and just looking to relax and hang with friends.", "author": "Rick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-23", "description": "I have enjoyed the Page before. But it seems that every time I am in there the bartenders ignore me for quite some time..no eye contact to acknowledge the patient patron waiting in the same spot someone else just ordered a drink at only to eventually ask for I.D and then walk away to rarely return in a timely fashion. (On this occasion to chop limes and not even glance up at all the other people waiting to order.) This last time, tonight, I just had to walk out. The service is consistently poor, and most often slow, or just plain non-existent.", "author": "Clyde M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-26", "description": "It's kind of an upper-crust dive bar. Old school interior that's clean but not very roomy, with an odd assortment of decorations (animal heads, bad paintings).\n\nGood selection of beers on tap - local & US micros, a few Belgians, and Shiner Bock.  When tired of beer, there's also a fairly wide range of whiskey and even some locally produced spirits.\n\nIf you get there before about 8:00 on any day of the week, there is no problem finding a seat and the average age is close to 40.  Later it turns young and crowded.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-03", "description": "i love it here. it's actually just a normal bar, which is what i love most about it. the clientele is local in a way that feels more portland, maine than san francisco. this is a great place to have between one and nine drinks with a friend or a posse. so versatile like that.", "author": "julia r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "totally solid. pretty good sound track, medium-priced, medium service, standard '8' crowd.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-15", "description": "Your classic neighborhood watering hole! It's dark, dingy and the walls are covered with dead stuffed animal heads. It's pretty awesome! Garrett is the best bouncer in the hood and will always welcome you with a smile.", "author": "Erica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-10", "description": "i've been here a couple of times... it is pretty awesome early in the week. with a really mixed crowd of interesting people to watch and overhear.  and this is also the time when people seem to people really great stuff on the jukebox. but then comes the weekend... when this bar, just like any other, is some how overrun with fratty preppy college types. all of the sudden the music changes for the psychedelic furs to the latest horrible pop/hip hop tune. (read: umbrella ella ella ella ella barf). oh well... happy hour is good.  but not a lot of seating... so get there for happy hour... grab a stool.. and do.not.move.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-06", "description": "Worst vodka tonics I've ever had, and the place smells like a mix between corn and feet.  Didn't try the beer.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-29", "description": "Inside, The Page is a full fledged salute to rumpus rooms of the late 60's and early 70's. Tons of vintage lamps with red bulbs, various animals heads staring you down, two pool tables, etc. Drinks are reasonably priced and they have a nice selection of beer (I really enjoyed the Anchor Steam Christmas Ale). The bartenders might, however, benefit from the understanding that people come in to actually spend money there and deserve only a minimal amount of courtesy. That is, of course, unless I accidentally got this place confused with the San Francisco location of the Dick's Last Resort restaurant chain. 4+ star place, 2- star service.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-09", "description": "good friendly neighborhood bar.  don't come here to find a scene.  it's just local peeps hanging out.  ok maybe one or 2 hipsters.", "author": "Julia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "I used to love this bar, but now I can barely ever find a table here.  Plus, don't expect to hear your music played on the juke box.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-29", "description": "Not worth even one star!  The cliental there is trashy and run their mouths.  Guess that's what happens when you have a thug bouncer.  Angry people at this place...watch your back here!", "author": "Nichole K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-19", "description": "the page aka my living room.  home sweet home.", "author": "Jeni D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-30", "description": "i too am in love with this bar.  probably because a majority of their clientele are just like me- want to play a nice game of pool, while listening to some good tunes and drinking some pbr.  caution: the tables are packed at this place and the bar is way too crowded thursday-saturday night.  all other nights, the page is a great place to relax after a hard days work.", "author": "rachface -."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-30", "description": "nice neighborhood bar. great place to chill if you're in no mood to venture from the lower haight and don't want to deal with haight street.", "author": "Dean E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-11", "description": "good local bar without much attitude.  should open earlier tho.  hard to get a cocktail before 5 in the area  - gotta go to molotov.", "author": "eeeee d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-24", "description": "i love this bar. its laid back. strong drinks and weird and cute people. beardy dudes to flirt with. if i leave the mission or the phone booth closes ever, this would be my regular dive spot. but i do hate the girls that always put stupid shit on the jukebox. the same 2 girls like everytime i go in there. i may have to give them a beat down if they keep it up.", "author": "kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-20", "description": "Although I was once criticized by the bartender for ordering one of their \"girly\" cosmos (note: it was actually for a lady), I've designated the Page my Official Preferred Watering Hole (which is quite a hefty title to wield). The decor reminds me of my parents basement (pre-1980s remodelling effort), the music (internet jukebox) consists of a great mix, but is not overpoweringly loud, and there's a foosball table that is generally not in use (until I arrive).", "author": "nick m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-10", "description": "It seems like it could be a decent place, but every time I've been in, it's completely crowded with people who don't seem anything like the people I see everywhere else in my neighborhood, and I mean that in a bad way. The lower Haight is a relatively mellow area, and particularly this spot on Divisadero is almost exactly between the upper and lower Haight, so it's not too inundated by revelers destined for either, but for some reason whenever I go to the Page, I get flashbacks to the undergrad asshats who made me loathe going out in Santa Cruz. Where the hell are these people coming from?", "author": "Cooper B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "This is great bar to sit down at and drink with friends.  Very casual and comfortable.  Nothing pretentious about it at all.  Good selection, good prices, excellent bartenders.  Cash only is a drag.", "author": "Mason K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "this feels like a real neighborhood bar. plenty of spots within walking distance which makes for a nice pub crawl.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-05", "description": "seems a bit out of place fo the city.  nothing pretentious about this place.  decent beer and enough space to sit down.", "author": "pauline e."}
