{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "This is such a cool spot!\nMy wife is a former wine & spirits rep, so this is her go to spot for quality wine/spirits that are also affordable. \n\nLooks like they also recently brought in a huge craft beer selection, which is an awesome update. I was stoked to see they have beers like Eclipse and Lost Abby, which are sometimes hard to find in the city.\n\nHands down some of the best customer service, and we really love their selections.", "author": "Phillip B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "It is difficult to tell if The Wine Club is just terribly incompetent, or outright dishonest.\n\nFour weeks ago, we bought a bottle of Chateau d'Yquem for our friends on the East Coast. The Wine Club recommended that we purchase 2nd day air shipping to keep the bottle from getting too hot in transit\n\nFor FOUR WEEKS,  the manager continuously gave us the run-around, promising emails and calls that never came. We were finally informed yesterday that the bottle had shipped -- far too late for a timely gift.\n\nThey assured us that the bottle had been shipped via 2nd day air. This too was false; the tracking code clearly shows that they shipped it FedEx Ground. It will be in transit for more than a week, subject to damaging temperatures the whole way.\n\nIf you do buy something from The Wine Club, DO NOT let the bottle out of your sight.", "author": "Donny G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "Been shopping here for years. \n\nSmall off the beaten path  warehouse type establishment.\n\nHelp is always really good. \n\nSelection is good but curated. If you like their taste you'll like the place.\n\nI like their taste.\n\nBonus of private parking lot in front...and super close to hall of justice...just think you can celebrate that dismissal of that traffic violation with a single barrel....woo hoo", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Fantastic store, highly knowledgeable whiskey expert, good pricing, too! Easy to get to, park (own lot) and easy to get back out of the city again. A new favorite place!", "author": "Sam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Staff were very friendly and knowledgeable regarding their wines. Looks small on the outside but when you walk in you'll be in wine heaven! I was actually a bit overwhelmed with their selection but luckily the staff helped narrow down a selection of wines for me. They also sell hard liquor here but the selection is not as great as wines\n\nWine tasting are also available on Fridays and Saturdays", "author": "C O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "I am way overdue on my review of The Wine Club probably because I just figure it's common knowledge how awesome this place is. It's not a club with like a secret password or anything. But perhaps I could go into a pretentious discourse about how the purveyors there found a rare vintage that I had been looking for since the Second World War when I was a member of the French resistance fighting the Nazis in the Alsace. Well, first of all, I'm not that old, you Taylor Swift sycophant, and thank you very much for believing that I knew Hitler personally in my youth.\n\nSecond, I couldn't tell a rare vintage from what comes out of a box through a spigot. Tip it, tip it real good. But I do know classier people than me who throw dinner parties that actually can tell the difference. This is where I go at the last minute to find something special and pretend I actually know about wine and how it complements the palate when digesting the meal the host prepared (photo: http://bit.ly/1hhvfUz). The Wine Club allows me to be a procrastinator because first, it's one of the few places in the city with a parking lot. Second, their staff is really helpful with a minimum of direction from me. Here's a sample instruction...\n\n\"I need something red that looks pricey but costs less than twenty bucks. I think he's making meat.\" From that, I've been recommended some truly great product. I also come here for my spirits since their selection is just as diverse on this front (photo: http://bit.ly/1PudYTp). For some reason, I have a stronger opinion on bourbons and vodkas than I do with wines. To develop my palate, I've been to their $5 Friday Evening Happy Hour wine tastings, and that's a great opportunity to sample some new stock in a convivial way, but for the life of me, I can never remember what to get. Thank goodness the staff can. Now about that rare vintage...", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-16", "description": "OK selection (not huge) - particularly Spanish, French and Italian wines.  Wish they offered a case discount - I'd buy a ton more here if they did.  Otherwise, prices are fairly comparable to other shops like K&L (whose website, btw is much better).  I prefer to spend my dollars at a smaller place like Wine Club over K&L, but sometimes Wine Club makes it hard.\n\nNote: I did buy a corked bottle, which they would not take back.  They explained they only take back corked bottles within 6 weeks of purchase - a crappy policy if one is properly cellaring wines for future consumption.  Beware!", "author": "B M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "One of the most diverse selections by any merchant in San Francisco.  The staff maintains strong awareness of the new releases, and appreciates ongoing maturities.  As a representative of makers and importers, I always learn a lot from their knowledge about wine consumers tastes.", "author": "Rich R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "I grew up with restauranteurs and food people. My Dad knew wine like nobody's business; the whole family has been involved in food in one way or another forever. These folks feel like family. They know their stuff, upside down. And they are interested in showing you new things, getting you just what you want, OR (that other great option) letting you browse until you stumble upon something interesting. No pressure, no \"loss leader\" filler, just good information and honest assessments of everything from Bordeaux and Sauternes to fascinating wineries from Napa with funky names.\n\nIf you're a wine connoisseur, check it out. If you're a newb, go! They will help! I can almost guarantee they'll help you find something and start you out right. \"Try this, then come back for that....\" kind of thing. \n\nI can't rave enough. So I'll stop.\n\nGO.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "I've visited both this location and the one in Santa Ana. Both have great selections of interesting wines and spirits at great value. The staff are very personable, knowledgeable, and willing to share their insights to help you get what you're looking for. I agree with other reviewers that when you visit, you're taken \"into the fold\" and can gain product understanding and appreciation that not every retailer is able to offer.", "author": "Geoffrey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "I was moving from SF to the east coast and had 60 bottles of wine that we needed to transport across country.  Nick helped me package the wine in boxes and ship it across country.  It required a little bit of trust b/c there was no tracking information...  But it all got here in one piece!  Thank you, thank you!!!!", "author": "j a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "The Wine Club is an awesome wine store in SOMA with a huge selection of Wine and other various types of alcohol.  The staff is always friendly and very knowledgable about wine.  They are usually pretty spot on with their suggestions.  They have a system to keep track of what you buy so they can remind you when you want to pick up the same wine but you forgot the name.  \n\nThere is a small parking lot in front that always has space available for those that drive.  The prices are reasonable as well.  \n\nDefinitely worth the trip to pick up some delicious wines are reasonable prices.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "This is my favorite place in San Francisco to go wine tasting! \n\nFriday nights they have $5 tastings, and Saturdays they have $10 tastings. Each include cheese and crackers, sometimes pruscuitto! Friday's tastings are around 6 different wines to taste, and Saturdays have ~10 wines. The choices are always something different, so one can never get bored. Once my bf and I came on a Saturday, and they were pouring a variety of wines from Schafer! They also feature international wines too, from France, Italy, Spain, etc. They pour all types of wines too, including sparkling, roses, champagne, in addition to most reds and whites.\n\nI like the service here. They are extremely helpful and friendly, and you can tell they care about their wines. I also like the atmosphere of their wine tasting area. It's casual, you can mingle with others if you want, or just chat with friends. What's not to love?", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-03", "description": "For customer service, this place is the worst.  I recently ordered two bottles of wine for someone as a \"get well soon\" after coming home from the hospital.  I paid extra to have the bottles shipped faster.\n\nNot only did The Wine Club not ship my order on time (why pay $35-40 in shipping to have it sent off 11 days after order), they were completely unresponsive when I called for a status update.  Despite twice being told that someone would call be back that morning, The Wine Club ignored my calls.  I found this incredibly frustrating--I had tried to get a gift for a family member coming home from the hospital, and their delay meant that it wasn't there when he got home.\n\nOverall, I was severely disappointed in the service here. Selection aside, when a business doesn't care enough for its customers to respond (when they are late in shipping), it is telling. I could not recommend The Wine Club to anyone, and would recommend K & L much more.", "author": "Kurt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "I've enjoyed the $10 wine tastings at the Wine Club both times I've been, but note that this may not be the best place for a large group. Our party of about 8-10 had trouble getting into the already-full tasting area on a Saturday afternoon, so we ended up breaking up the group and trickling in a couple at a time. I think the staff was overwhelmed.\n\nThat being said, I appreciated the experience of an affordable tasting of about 8-10 wines. You can split a wine tasting if you truly want to just taste, too.A fun way to spend the afternoon!", "author": "Clarice W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "On Saturday, I went to Cotogna and asked a bottle be opened, which the sommelier said was corked. I went back to the this shop, where I purchased the bottle on Tuesday and said the sommelier at Cotogna said it's corked. I wanted an exchange or my money back, but the woman with short hair said no. She knew TCA and it had none. Then left me. First she didn't recognize the bottle, asked if I had gotten it from K&L - I wish, K&L would have rectified the situation. So long story short, not a good wine shop, poor customer service. With so many others to choose from and K&L so near, skip this shop. The selections are nice, but service is poor.", "author": "Eve V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "I love this place. I live right across the street and I make it a point to stop in here on weekends. There is an amazing amount of interesting wine, enough so that it's somewhat overwhelming. But the folks that work here are super nice, and always have reasonable suggestions for whatever I'm looking for, usually under my price point (that's a win!). The whiskey selection is pretty impressive, too, and their beer selection is really interesting. \n\nIt looks a little shady on the outside, but it's a wonderland of wine.", "author": "Brigitte J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "They have a HUGE selection of wine and alcohol. If they don't have it I'm sure they can order it. The place isn't stuck up or pretentious at all. It's a \"Warehouse\" of wines I guess. They are knowledgeable and are easy to talk with no matter your experience level. I witnessed one man walk in and stated he didn't know much about wines. The staff asked what he liked drinking and was able to give him a few options for trying something new. Now that's what I like most about this place. Great selection without them having their noses so far up in the air they can't teach you something new. Nice job guys! I go here anytime I have a difficult bottle of wine I know I can't find anywhere else. Something I've always wanted to do but just hasn't workout on timing was their wine tasting. Looks like everyone is having a great time.", "author": "Kyle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "This is a great little find for wine lovers. Or if you dont know how to pick wine, Susan is awesone.  Can't beat their Fri night $5 wine tasting. LOVE LOVE LOVE this place!", "author": "Z A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "I'm giving the Wine Club an extra star because it's one of the better wine stores in the city and my earlier 3 star wasn't fair. Very sincere, people know their wine, it's helpful, they're happy to order anything for you, self-serve tasting room, great selection. They remember you if you've been there before. If you ask how something is, sometimes they'll just open the bottle and pour it for you to try.\n\nFun fact. Although for the most part this is a serious wine store, they have a little display stand of single serve hard alcohol in little plastic bags, made for you to take into the sports stadium or rock concert in your pocket. They tell me this is by far the biggest sales per square foot in the entire store.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "I'm on the hunt for the best place to buy wines in the Bay Area. This is definitely one of the better ones, and located the heart of SOMA, it's in a convenient location.\nI like how the outside of the store is unassuming and you don't get the feeling of pretentiousness when you walk inside. There are no fancy displays, just bottles and bottles of wines in their original boxes. The store is generously staffed and it seemed like each staff was an expert in a particular varietal or liquor. Prices are good if not the best, but their strength is their selection and service.", "author": "Alfred L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "One of my favorite places to buy wine. \n\nLove the fact that the staff are all winos and love to talk about what they like.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "(See pics)\n\nLove the $10 wine tasting, especially this time was when the manager Michael had a nice slide show and a map showing the wine regions he had traveled and described each wine accompanying each region's soil and climate that made you live through his eyes of what vibrant Spanish wines there are.\n\nWines are much enjoyable when it's consumed with a reason or something to celebrate. It gives a multiple notes feel when you learn about their stories and how they are made.\n\nAn excellent place to get some great wines with the help of Michael and David who give excellent suggestions once you tell them what wines you have tried before from certain regions or producers.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "I like this location better than the one in Santa Clara because they tend to have a better selection of French and Italian wines.  The staff are really friendly here, as well.  Recently, however, it seems that the selection has decreased by a magnitude of 2! \n :-(  \nHopefully, it is only temporary!  Parking is tough, so be prepared to park down the street!  Anyway, check out the library wines!  They often have a couple of real gems here.  Still, despite my criticisms, this is one of my favorite places to shop!\n\nYelp seems to think that this is a bar.  Its just a liquor store!", "author": "Jack J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Lovely folks, the wine tasting is a fun thing to do on a Friday night. They often have organic and local wines in the rotation which is a favorite of mine.", "author": "Kim A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-30", "description": "I first came here for a Saturday tasting of Alsatian wines.  For $10 we got to sample 10 different wines of varying prices (bottles ranged from ~$10-$40) while enjoying complimentary snacks (crackers, 2 types of cheese, ham, and pretzels.)  \n\nI had such a great time I decided to come back 2 weeks later for their Friday HH tasting!  For $5 we got to sample 6 wines: 2 whites, a rose, and 3 reds (Tempranillo, Chianti, & Cab -- I obviously know my reds better).  For munching they had BBQ pork sliders.  For ambiance they had a guitarist rockin' out Led Zeppelin and Lady Gaga on acoustic guitar.  And the staff really are very accommodating -- they allow two people to share a tasting which is great if you don't want much to drink but still want to try every wine.", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "While searching the city for a specific beverage on a quick break from work, I found this store listed as a vendor. I even brought a friend who is a total oenophile because I thought it would be a great place for her to know about. We walked in and there looked to be 4 or 5 employees on duty...but not ONE greeted us at all. \nAfter a few moments waiting for the gentleman behind the counter to turn around, I asked for the beverage...to which one of the employees shouted from across the room that he would NEVER carry that brand and that he'd have \"his head cut off\" for it, while he scoffed the sheer possibility of carrying what I was looking to buy.\nWell, gee, the website said that this place was a vendor, I came all the way here, and you want to shame me for looking for this specific drink? It was insulting and rude. Not exactly the way I would speak with a new client in my business and the behavior was such that I was flabbergasted. \nNo assistance, no alternate recommendation and no customer service whatsoever. \nWon't. Be. Back...Ever!", "author": "Liza F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "For the absolute best in customer service... for a massive selection of every wine under the sun, sold from a no-frills warehouse space so you know you're not helping to pay a shop's unnecessary overhead... for outstanding prices on truly great wines... and to discover wines you didn't even know you'd love, that cost half the price of the wine you thought you'd want... you need to visit this shop. Ask for manager David Goodwin, and with his personalized touch and generous help, I promise you will not leave until you're beyond delighted.", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "One of the bests stores to purchase wine in the Bay Area. Best prices, large selection of wine including cult wines and very knowledgeable staff.", "author": "Michael I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-08", "description": "A building with no windows in SOMA between 5th and 6th with the word 'Club'?  Sounds scary?\n\nWell, if you are brave enough to walk in, you won't find bouncers or pink lights.  What you'll find is one of the best wine stores in San Francisco with friendly and knowable staff.  Although it's called Wine Club, no membership is required.  I think they have a wine club that you can join, but they've never pushed this on me.   \n\nMany of their Saturday afternoon tasting events are outstanding.  A wine store that offers below tasting of the best California Cabs deserves 5 Stars.\n\n2004 Big Guns of California Cabernet Tasting\n1. Quintessa\n2. Dominus\n3. Rudd Oakville Estate Proprietary Red\n4. Hewitt Rutherford\n5. Far Niente \n6. Ramey Jericho Canyon\n7. BV Georges de Latour\n8. Joseph Phelps Insignia\n9. Mondavi Reserve\n10. Beringer Private Reserve\n11. Opus One\n12. Ridge Monte Bello\n\nPrices of their tasting differs every weekend.  Most are $20-40. For the special tasting above, it was $80/person, which included a Riedel Glass.  You are allowed to share a glass with someone.  Sure, $80 is not cheap, but opening a bottle of 2004 Insignia would set you back $160, so it was actually a cheap way to try 12 really good wines.\n\nK&L or Wine Club:  Do I have to choose one? I go to both.  K&L is better organized store with a nice website, but I often get more about of tastings at The Wine Club.  They are just a few blocks apart, so I suggest going to both.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "$5 tastings on Fridays only from 5-7pm. The tasting area is small and intimate but you get to ask lots of questions. Very knowledgeable staff. There was even a couple of pizzas there if you needed something in your belly while tasting! \nGreat wines at great prices. Huge selection of wines!   Also, there is a small parking lot outside. \n\nI will definitely be back!", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "Great shop. I've been coming for years, Chad in particular will spend copious time talking through spirits purchases and illuminating the backstory of bottles. I'm a fan.", "author": "Gerard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "Can I just say wow!? WOW!!! The Wine Club has the best happy hour/wine tasting ever!\n\nLocation: on Harrison street right before the freeway. Cool thing about it is they have their own little parking lot. What a rare & convenient find, especially in SF.\n\nAmbiance: It's not the fanciest of places; it actually resembles much of a warehouse. However, this spot does NOT warehouse just anything close to junk....boy oh boy, they carry a wiiiiiiide selection of wines & spirits that will please just about anyone.\n\nYou walk in, and there's an explosion of wine assortments~ locals and imports from Italy, Spain, Australia, & basically from all sorts of the world. The prices range from reasonable to dang expensive...but the expensive ones are premium wines that have been aging forever. Awesome!\n\nService: Impeccable!!!! Everyone was super friendly~ from the person who gave me a tour, to Drew (our wine tasting host) who was SO personable and SO knowledgeable about the goods, to the lovely young woman who brought complimentary samosas & pate.\n\nBottom line: if you haven't been here yet, please do yourself a favor and try it out. It will not disappoint!! We walked away w/ 3 bottles and will be back next week for more.\n\nTip: Come in on Fridays for their happy hour wine-tasting @$5. It's from 5-7pm and you get to taste soooooo many different types of wine & try their complimentary dishes. Tell me now, what can beat that?? =)", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "It's like a wine costco!\n\n Really one of the best finds in SF that I have bumped into in a while. Well priced wine from every region. Knowledgeable owner. Massive selection. l I left happily with a malbec and granacha for under $20. \n\nCheck it out!", "author": "Jade W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-20", "description": "The good:\n\n- The tasting was great, the person running it was knowledgeable.\n- I liked that the tasting was focused on Spanish wines.\n- Free snacks are available.\n\nThe bad:\n\n-  We asked a salesperson where one of the tasting wines was located in the store and she made no attempt to help us at all.\n- Store is a little dingy and disorganized.  Price of wine on tasting list did not correspond to price listed on paper stuck the cardboard box.\n- Wine did not taste like the tasting wine.\n\nWould probably not go back.  Our tasting was $10, not $5 as others have mentioned.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-26", "description": "This is the only place I go in San Francisco to buy wine.\nGreat selection, very knowledgeable staff and reasonably priced.", "author": "Conrad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Great wine and liquor selection , friendly staff, very helpful recommendations. They carry tons of hard to find wines at great prices. I am always pleased when I head over there!", "author": "A. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "Great selection for every price range.  Love the staff, always so knowledgable and willing to help but won't stay on you if you want to browse.", "author": "Lyndsey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "This place is excellent if you need party wine or spirits. Their prices are very, very low compared to other places (especially on spirits) and they have a large selection of both.\n\nTheir wine selection can have some holes in it (it's possible I am just looking for obscure wines) but they have a great selection of domestic and imported user-friendly wines at great prices.\n\nWith so many other places to buy wine in the area, I find myself coming here a lot because while their selection may not suit my tastes, I do find good \"party wines\" here at excellent prices.\n\nThe staff is great and they also do $5 wine tastings I believe on Fridays. Definitely worth the trip.", "author": "Tala D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "We had the pleasure of doing our tastings today with debbie who was both a very knowledgeable wine enthusiast and an engaging conversationist. She taught as many things about different varietal of grapes and wine producing regions and just a pleasant person to chat with. \n\nThe wine themselves were very good. Since both my fiance and I usually prefers reds, we haven't had much exposure to whites, but today's theme is whites from the alsace region of france, we had the chance to explore all different kinds including brut, pinot blanc, riesling & gewarztraminer. When you put those wine side by side, you can really start to appreciate how different and similar each may be to the others and really hone in on which you may enjoy more. Although we may all have different preferences, I liked all of the wines I tasted today, some more than others obviously.\n\nThey also had cheese, cracker and ham for pairing. The munster cheese today went nicely with the wine.", "author": "Mel Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-10", "description": "I love this place!  They have an amazing wine selection at really reasonable prices.  The staff knows a ton about wines....  Everyone you ask will really take the time to help you pick out the right bottles of wine and answer any wine questions.\n\nAlso, they have tastings saturdays from 2-5 for $10 a person and every saturday is something different but I really think its an awesome deal to try a fair amount of wines.  \n\nFor buying wine, this is a place I would go out of my way for.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-23", "description": "Got nice French wine for my bf bday 3 yrs  ago. Their selections are exclusive and the staffs are extremely helpful. I didn't know much about French wine back then, got this wine by the staff recommendation. Bf enjoyed it, and my wine snob friend was so jealous-!!! will go back if I need any wine for special occations.", "author": "SY Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "Who can beat a $10 wine tasting?  And with meatballs, cheese and crackers...\n\nWent here with a friend for their 2008 Bordeaux Release Tasting.  10 different wines total that we tasted.  Very educational.  They do different regions every week.  So worthwhile to come and if you have a coupon, it's a steal.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "Great place to buy and taste wine.  I especially love it when the guy in the wine suit is outside trying to bring in customers :)\n\nStaff is so so friendly, so much better than K&L, and even cheaper :)\n\nIt's kinda hard to find, but that's what the guy in the wine suit is for.", "author": "Kris O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "We love this place. Great owners and staff, wonderful selection, and always a fantastic recommendation for a good value or a fun splurge.  We love spending time here and it's our go-to spot for every event - whether its a superbowl party or a fancy dinner soirée - they've always got the goods!", "author": "Lis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "Yay what a great place!!! So many wines to browse through, it's like sensory overload. The guy working the floor today, David I think? He's SUPER helpful and knowledgeable. The rest of the staff came across as very friendly as well. They have wine tasting as well as wine retail, but we were too full from lunch today to even think about it. Next time though!", "author": "Heather K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "THE WINE CLUB IS AMAZING!\n\nI had to throw together a company event in less than 24 hours.  The Wine Club was amazing.  I had called every other catering/wine bar in SF and no one could help me. I worked with Steve, he was awesome and took care of everything.  I have some wine snobs in my company and Steve picked great wines.  Everyone was very pleased.  \n\nI will use the Wine Club any chance i can!", "author": "Katrina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-28", "description": "No membership needed. The best wine store in SF! Very knowledgeable staff on domestic and foreign wines without being pretentious. Excellent price-points and tastings are on the honor system. You get a piece of paper and write down your tastings and check out when you are done. Love this place:)", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "This place is terrific. Knowledgeable, approachable staff. Excellent selection and great value. Really enjoyed my experience and will be back.", "author": "Zach T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Groupon brought me here yesterday (Sat afternoon)\n\nIt was crowded! Had to wait a few minutes to taste, but was not a problem. I walked around the store and browsed as I waited, then got called over.\n\nThe first station had a bout 5 wines to taste. Wines were good, true to their varietal. Second station was packed. Wines were also good. Each week (i think) the tastings change. It all depends what is in stock. \n\nWalked away with 2 bottles. The empolyees were helpful in picking a cheap but high point wine, which I really appreciated.\n\nThe owner also mentioned their happy hour deal. \n\nFridays from 5-7 $5 tastings. I will see you there.", "author": "emily f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "The best wine store in San Francisco. By far the best tequila store in SF too!! Just love this place.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-09", "description": "Really great place to both taste and buy wine.  I'm a big fan of their Friday night tastings -- for $10 you get a few glasses worth of quality wine and some light snacks (once they even had fried chicken).  They have a great selection of both California and Int'l wines, especially Europe. Staff is friendly and unpretentious, which is a rarity when it comes to wine in SF.  \n\nAlso as a few other posters mentioned their collection of hard alcohol is really good.  Their prices are much better than most of the better known booze outlets here.", "author": "Tbone M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Wine tastings here are so fun to do with a group of friends! Don't expect them to teach how to drink it with all the fancy techniques...you shoud already know. Or just pretend you do like I did. Swirl, inhale, repeat twice, drink. 8-10 tastings on a Saturday afternoon for only $10? What's not to like?!!!", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "My buddy just had his bachelor wine tasting here.  The folks were knowledgeable and worked with him and the best man to choose wines for the group tasting.  They allowed us to bring in outside food and prepared it for us!  They were cool, unpretentious and oh-so San Francisco.\n\nDon't be alarmed by the location (pretty sure I walked straight through a drug deal across the street), once you're inside you'll forget where you are.", "author": "Jenn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "This place is amazing.... The staff is fantastic. They will help you pick wine in any price range you choose. The selection is great. They also have a terrific selection of liquor and wine glasses.\nYou will save several dollars per bottle compared to other wine stores in the area.", "author": "Robert O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "They host $5 happy hours on Fridays with generous servings of food and wine and $10 tastings on Saturday afternoons.  It's a cheap and fun way to try a bunch of wines, and leave pretty drunk for just a few bucks.\n\nThe wine selection is fantastic and the knowledgeable staff can really hook you up with some good choices.  I just told him what I was looking for \"park date wine\" and 3 bottles appeared in my hands, and they were PERFECT.\n\nAnne S. their newest addition and besides being a good friend of mine, is really knowledgeable and more importantly, LOVES wine.  Her enthusiasm and passion shine through and make this place a joy to visit.\n\nI've been going every weekend that I can and although it only costs me $5-10 to visit, I end up blowing a lot more than that on wine every week -- with pleasure.", "author": "Ankur P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-01", "description": "A couple of my friends have told me about the Wine Club and how great the wines are.  Well finally I made it there this past Friday.  I asked my friend if she was interested in going since she enjoys wine as much as I do.  On Friday's they have $5.00 tasting from 5pm-7pm.  You also get a chance to taste a few wines. The tasting area is small and did tend to get a bit crowded.  You pay for your tasting first, bring your receipt over to the person pouring the wines.  I didn't get her name but she was knowledgeable  and the wines we tasted were so good.  There were couple wines that were my least favorite but most of the wines we tried were lovely and the prices were great.  I purchased one bottle since I am not working, otherwise I would have probably purchased 6 bottles.  They also had a couple of pizzas for us to snack on while sipping the wine.  They also offer parking by the entrance.  Which was a bonus since I drove in the city to meet my friend.  I definitely will be back again, so glad I finally paid a visit there.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-10", "description": "I really like this place. The staff is friendly and knowledgeable, and the selection is excellent. The prices are good too. They have onsite parking and will keep tabs of your wine purchases (just like my beloved K&L). Just don't go at rush hour, or you may have trouble getting in and out.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-19", "description": "Thanks to my good friend Eric who directed me to The Wine Club.\n\nThe Wine Club is my favorite place to shop in the city straight up. The level of satisfaction I have going in and checking out of this place is unparalleled. I have had the satisfaction of purchasing a couple of the best bottles of wine I have ever tasted. One of those bottles was $10.00! \n\nThe staff are wonderful, helpful and so removed the cliche of wine snobbishness.  Ask a question and let them take care of you. This is the place for wine.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "These guys have EVERYTHING! And the prices are great. Very friendly, too. My only complaint is that it's a little out of the way. Worth the trek, through, when it's time to stock-up on higher-end bottles.", "author": "Gary P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "The manager, Dean Alexander, is a pro's pro. Stick to his advice.", "author": "George T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-16", "description": "Superb selection and awesome pricing. There are certain things I use as a barometer for pricing; Silver Oak, Dom Perignon, Crystal and Opus One. Not that I drink them, but it helps me know quickly how pricey a place is. Credit. This place was the cheapest in California that I've seen. Great selection, super friendly staff, and great wine. Thanks, guys!", "author": "Jared H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-14", "description": "Best place in SF to buy wine, bar none!  Friendly and informative staff with very affordable prices.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-02", "description": "I so agree on the comment \"K & L or The Wine Club, do I have to choose one?\"   I love The Wine Club.  Great selections of wine.  I never go wrong here.  The staff is real, down to earth..  Just my type of pep.\nThey had recommended a Christine Andrew Petite Syrah '05- Excellent and an Edmeades Zinfandel 05'- Incredible.  I just went here last week, at 6pm, when they were closing and they gladly opened the door...sweet.", "author": "Stacy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-28", "description": "This place is really cool and offers some great tastings on both Saturdays and Fridays. the staff is knowledgeable and the wine is usually quite good I do, however, have a couple of complaints:\n\n- Steer clear of the heavyset guy with long hair and the messed up teeth. He can be mean and condescending, especially if you don't as much about wine as he does.\n\n- The used to offer bread and cheese with their tastings, these days you'll be lucky to scrape up somebody's left over bread crust.\n\nAll in all, a great down-to-earth wine shop.", "author": "B G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "You can find some some good deals here as long as you know what you are buying.  I will definitely be back if Costco's selection sucks.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-12", "description": "After reading the reviews, I bought a Voice Daily Deal to the Wine Club.  We were in S.F. for the weekend.  I pictured this as a nice place, with a nice bar to taste wine.We taste wine all over Calif.\nThis is located in one of the undesirable places in S.F.  It's a junky old wine/liquor store. They have a funky little spot in the back, amoung cases of wine to taste.  \nThe Deal said we could taste between 2-5, no specific time or resv.  When we got there, the grumpy owner stated that we had to wait 40 minutes to taste, no chairs to sit in.\nNeedless to say, we left.  They do serve a little appetizer, but the rest is really tacky.  \nI got stung on two Daily Deals.  Have unsuscribed!!!", "author": "Deborah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-09", "description": "Fantastic selection, knowledgeable and friendly staff. What else do you need? I particularly like the Australian Shiraz and French Rhone selection. The Burgs aren't bad either.\n\nAffiliated with stores in Santa Ana and Santa Clara", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-22", "description": "I'd driven past this place hundreds of times before giving in to my curiosity. It only *looks* like a crack den -- open the door and you'll find . . .  a giant wine store, operated by a bunch of approachable oenophiles.\n\nYes, there is such a thing. \n\nI like wine a lot, but I can not partake in the high-end market. You can buy a $300 bottle of wine here. I'm sure it's good, but I'd rather have thirty $10 bottles. The great thing about the Wine Club is they have both, and the guys will treat you just the same as the big-roller. \n\nThey have wines from CA, the Pacific NW, France, Germany, Spain and pretty much everywhere else, most marked with signs that tell you a little about the wine, which I do like. \n\nI stopped here yesterday and bought ten bottles of wine for $100. The guy in front of me got five bottles for $375. SO, something for everyone!", "author": "jim b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-10", "description": "Call me crazy, but I like the place cos it smells dirty.\n\nDirty as in earthy, nitrogen enriched, like it's Fall and it's been raining for awhile, and the roof has a leak. Which it hasn't. The place is actually quite dry and dusty. Well, except for the wine.\n\nThe name's a misnomer. It's neither a club in the sense of a dance club, nor a club in the sense of a Price Club. It's just a shady looking warehouse with a little sign on a side entrance. Inside, you'd expect mountains of pirated porn videos. Or recalled Chinese toys and toothpaste. Except it's not. It's booze. Mountains of booze.\n\nMy cousin was in town for an interview and wanted to do something stuck up. She's trying to improve her wine tasting ability. We came here because the wine tasting hours were still going -- her first choice place, some other well-known place with a bigger selection, well they were pricks and they closed early.\n\nGood service. A solid wine tasting menu, with stiff pours from ten or so choices of the week -- ~$20 goes a long, long way. Their selection seems smaller than the competition, but you should be able to find something amicable if you're looking for high point wines.\n\nWill I be back? Probably not. I do have a refined palate for fine wines, but I honestly prefer alcohol the way God intended: hard liquor, and lots of it.", "author": "Perci N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-27", "description": "Don't register there!\n\nWe had a wedding registry there because we are older and we have so much stuff already that getting some good bottles of wine sounded like a real good idea.\n\nI don't even feel like writing the 3 pages it would take to explain all the ways they screwed up. Bottom line it took us for ever to get the wines and know who gave them to us AND we think we didn't get everything. Which means that some people probably bought us a present there, and we won't know about it nor get it. Unless of course we send an email to people from who we haven't received a present and ask about it. That's really bad!\n\nIf it wasn't for this bad experience I would have given them 4 to 5 stars because they are a great place to buy wine otherwise.", "author": "Elsa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "Good stop to replenish your wine stock. The people who work there are knowledgeable and will help you find the best wines given your taste, budget, and geographical preferences. However, if you happen to find a bottle you like and return for more, there is no guarantee they will have any available.", "author": "Susan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-13", "description": "I always have to ration my visits here, as I can't stop myself from picking up more than I should.   Wines from France and Italy are the main attractions here, although there is a sizable selection from Australia, Spain, Germany and the USA.  \n\nSaturday tastings are a great way to sample some stuff that you would have to shell out the big bucks for.   These Saturday events are quite fun and can be very educational if there is a only a small crowd.  Towards the end of the day, my wife and I are sometimes the only people doing the tasting.\n\nSign up for the email list, as you can get advance notice and pre-arrival specials in your inbox.  They send out quite a bit of email per week, so be prepared for a deluge.  This service is especially helpful if you are a Spectator/Advocate Point Whore.  It can take awhile to get though, as I am still waiting for stuff that I ordered a year ago.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "This is a secret I love to share. Supremely curated wines. Excellent price spread from the under $10 finds to how much do you want to spend. Every bottle they sell they care about. Friday night tastings for $5. They do a deeper tasting on saturdays for $10 but I work on Saturdays so I never made it to one of those. I always walk away with an armful of great new wines.  Have fun my fellow wine enthusiasts. Oh, and if you don't know what you want...ask. They know their stuff.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "Love this place! Went for a $10 tasting, very mellow with crackers & cheese (great cheese, btw) provided. Low key atmosphere, location is in the middle of yuck, but it's actually pretty easy to get there and they have a great selection. Highly recommended.", "author": "Sam Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "Great place and great people.  They know their business and know a LOT about wines.  Friday happy hours are great! Being neighbor next door I do go there a lot and often.  Michael is the best!!!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-16", "description": "This place has an awesome selection of wines!  The staff are super nice, incredibly knowledgeable, and always help me find amazing wine for great prices.  I like looking for good quality value wines, and they have always been honest with me about what they think has the best flavor bang for the buck. Based on their recommendations,  I've emerged with some fantastic Zins, refreshing Vinho Verde,  excellent German Riesling (Kabinett style at non-Kabinett price) in recent delicious memory.  I have to exercise major self-control to not buy more than a half dozen bottles at a time!\n\nIt's totally not a fancy wine shop - they are in a somewhat ghetto warehouse on a corner of 6th and Harrison that's easy to drive past.  And the display cases for their wines are really bare-bones minimum, often the boxes themselves.  But I think that is what keeps their overhead so low and keeps their wines at good prices.  And I like that aspect.... a lot.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-12", "description": "\"Join the Club and visit The Wine Club\"\n\nI like this wineshop. . .it's a lot different than K&L. .. most of the wine is displayed in boxes and not on neat racks, you'll see a lot more write-ups and ratings than you will at K&L and there's also an area in back where you can taste several wines-----you simply tally up what you've tried and bring it to the counter when you're done (it's on the honor system). They also do formal tastings, though I've never been to one.\n\nThe staff is very friendly and eager to answer any questions you might have. \n\nAs for one reviewer's comment that one should be wary of the \"mediocre wines\". . . well this isn't exclusive to The Wine Club-----just about every wine shop has mediocre wines. That's why you need to ask questions, not be afraid to purchase the occassional lemon and do a little research before you go there (that's just the smart way to purchase wine anywhere). \n\nThe prices at The Wine Club are fairly competitve. .. sometimes they are cheaper and sometimes they are not. . . so again, research (especially if you're buying something to lay down for a few years). As for the lack of windows, I actually like that. It means the sun isn't beating heat into the place through the windows on hot days and that means the wine is being stored at a fairly good temperature. There's nothing that irks me more about a wine shop than when I see good wine being displayed in a shop window as if it were a plant in a nursery. \n\nOne major drawback is their Web site. It can't compare to K&L's because it doesn't synch up to their in store inventory. They have a location in SoCal and for some reason they haven't figured out a way to provide real-time inventory from both locations on their Web site. It's a real shame, because this could really help their business.\n\nSo try The Wine Club and decide for yourself whether it's a worthwhile stop.", "author": "David R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-17", "description": "I kept hearing about the wine club but could not get past the outside of the building. We finally stopped this weekend and I have to say they have some good wines at great prices. The place is cramped and not at all fancy, but I guess that is how they keep prices down.\nStaff was not overly friendly, but did make a few recommendations. I will defiantly go back. I think it might be easier to get around during the week, as Sat was kinda busy.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-01", "description": "I stopped by earlier this week. It seems that I don't get up to the City very often any more.  The staff here is always great.  I was a little disappointed that the Bordeaux selection seemed so small .  I guess its the bad economy.  I only bought a case, but would have bought 2 or 3 cases if the selection were better.  Still, always a great wine shop!", "author": "Dan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-05", "description": "Grace K. inspired me to write this review after reading her K&L Wine Merchant review...and also since I'm here every week cause it's right across the street from me!\n\nThe Wine Club is not a fancy smancy place like K&L but more like a small warehouse for wines and champagne.  When you walk in, there are rows of wines that are sitting in boxes that they came and most all with a lil review of what you can expect to taste from them on the box courtesy of the Wine Club.  They have a relatively good selection, especially French wines, and the staff is pretty friendly and helpful to answer questions.  Their tastings are well worth it at about $20 you can taste from 8-10 different wines.  What I really like about The Wine Club is their prices which tends to be lower than other merchants, thus the sparsity of their decor.  I've found a few great values here that you can't find in other places.\n\nThey have 3 locations: SF, Santa Clara, and Santa Ana.  The Wine Club and K&L are the 2 places I normally get my wines from in SF but since K&L is too far (3 blocks from me...heheh) I usually just dodge across Harrison St. traffic to go to The Wine Club and carry my box home.", "author": "Rick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-27", "description": "Pro tip = This place is the real deal. Hands down the best place to get wine in the city. Their inventory of Australian Shiraz has been on the rise again lately after a dip last year, so I'm stopping by on the reg (like Kenny Powers). The staff is extremely knowledgeable and friendly, and I always feel comfortable asking for recommendations. And so far, all the recommendations have been solid.", "author": "Scott V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "This is place is full of some interesting varietals, especially from Italy. And if you're frugal like me,  value wines don't take much searching. I found the people here very helpful and not snobby. I will be back!", "author": "Roger H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-27", "description": "I've been a customer ever since moving to the City.  It is a good place to get wine.  The decor is not fancy and that suits me just fine.\r\n\r\n- Good selection & prices, I like browsing the Aussie wines.\r\n- Sign up for their monthly buying guide.  They stock some different wines depending on their locations; the guide allows you to peruse their inventory by store beforehand.\r\n- Very approachable staff.\r\n- Parking lot is small but you can also park the alley if needed.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-29", "description": "I'm a little biased since my bro works here, but I think this place rocks.  I actually lived in Spain for 8 years so you would think that I would picked up a thing or two about wine, but instead it made me totally clueless, because since the wine is all so good there (even bottles that cost less than 5 dollars) there's no need to actually do any research on what you like.  But I digress.  \nThe staff at Wine Club is great, they are always willing to take the time to help you pick out the right bottle and work with your budget.  I also love how the store is organized, they have an awesome selection but it's arranged in such a way that it's not overwhelming.\nThe Friday tasting is the best, for $5 you get to taste several different wines plus they always have food to nibble on and the crowd is usually pretty cool.  \nI've seen a few comments on here about the location, and I have to say that I've been here quite a few times and NEVER witnessed a drug deal outside.  :)", "author": "Dana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-10", "description": "Sometimes I just like to go and have a little look-see...\nI just popped into this cool little closet today for a couple bottles, one Cono Sur 05 Cab from Chile and a Slipstream 05 Shiraz/Grenache from South Australia.  I have not personally been to Chile or Australia yet, but I hope these two gems will get me that much closer...\n\nIt is hard to put into words the delight and overall excitement this place gives me. The guys behind the register are always low key and informative, but not  pushy or pompous.\n\nTheses days it it hard to find a solid and respectable place to purchase and comb through rows of wine without getting huge waves of over zealous loud mouthed consumers and sales people giving their jaded view on life and leisure. This place is a quite exception to the normal everyday wine shop. You can taste wines and purchase wines here as if you are in a sweet library of vineyard fantasy novels. They carry a pretty eclectic group of bottles not falling pray to anything to popular or blown out. \n\nAs for prices, they seem to be dead on. Sometimes it even seems as if they can get you a better deal on a bottle than the wineries that produce the juice! \n\nThis group of Jedi's keeps it cool and legit in my book, so roll your wheel barrels of cash over to this joint ASAP and fill up on some bottles of  'guaranteed good times'...", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-21", "description": "Great Friday night tastings ($5 for a flight) but it can be a little crowded since the squish you in this tiny roped off space of the warehouse. Great selection otherwise and the staff is super friendly.", "author": "Jennee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-04", "description": "Really great place to have in the neighborhood. They always have great recomendations -- David gives me little tips every time I go in.\n\nReally nice and casual tasting bar, too.", "author": "Margie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-24", "description": "The Wine Club has an excellent selection, great prices and David.  Other stores might have an excellent selection, not great prices, but what really makes the difference is David.  Once he knows what you like, he will walk around the store with you and fill your cart.  Not with things on promotion or at a higher price than what you want to spend, but with wine that matches up with exactly what you want to take home.  So go to Wine Club any day but Sunday or Monday and ask for David, you will get great wine, great advice, and not spend more than you planned.  The only thing you won't get is atmosphere, but you're not spending the evening here, you're buying wine.", "author": "Spike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-11", "description": "I have yet to go to a tasting here, but the selections this place has are really vast and very good.\n\nI'm not currently in a place to be purchasing the expensive wines, but I can definitely speak for their \"budget\" wines and they have all been good choices.\n\nThey have wines that are 9's in the Wine Spectator and also Wine Enthusiast for under $20.\n\nI can honestly say that if you walk around there enough and really look and read, you can go home with some really nice bottles for an unexpected low price.\n\nCan't wait to set up a tasting.", "author": "Marz W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-26", "description": "I have been to quite a few wine stores in this town, and The Wine Club is absolutely one of my faves. \n\nI don't want to say huge, but definitely a very large selection of wines, with most wines having a description posted by the staff (very helpful!). Their prices are hands-down the best. Many times I have bought a wine at Wine Club that I also bought somewhere else - usually with at least a $4 mark-up.\n\nThe people are approachable and knowledgeable, and there is a lot to choose from regardless of your price range. \n\nI live in the Presidio, and make special trips to SOMA just to shop here!", "author": "Natalie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "Best place to go for wine, every time we go the staff is beyond helpful. They always make great recommendations and I love their passion for wine. My boyfriend loves this place and every time we go we leave with a case or more!", "author": "Alexa V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-29", "description": "nice selection of wines. you can also view lists of incoming. on their web site. i didn't care for the wine tasting. one sip couldn't  tell me if i liked it or not. one sip would only tell me if i didn't like it.\n\nby the time i finish a bottle, i will really know it i liked it   or not..", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-02", "description": "My dad said that this place looked like a combination of a warehouse and a speakeasy.  And that was after I told him that I agreed with the yelp review that the wine club looked like a chop shop from the outside...\n\nDon't let the no frills exterior deter you: there is a ton of wine waiting for  you inside.  Go in and check it out.  \n\nI have found that the staff will leave you alone unless you make eye contact with them and act inquisitive.  I prefer it that way, frankly.  Once you have looked it over, if you have questions, they are very willing to share their advice and opinions.  \n\nSo far, I have not gone wrong with staff recommendations offered there.  (Some of the signs seem a little rah! rah!--typical wine stuff, but the recommendations from the staff have been solid).  This is the kind of place where you can tell them a price point and a general preference, and they will steer you to something good with no worries.\n\nI find the prices to be a buck or two under K&L for most of the stuff I buy.  They have a website if you want to get an idea what they carry.\n\nI have not done any tasting there yet, but they do have a tasting area.  Something to look forward to.", "author": "Rusty M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-03", "description": "Solid wine selection.  Very helpful and knowledgeable staff.  \n\nI called and inquired about an obscure bottle of wine.  The person who answered the phone recognized the wine immediately and told me that they were sold out.  :(  When I ventured in later that day to look for an alternative bottle, they remembered my phone call and told me that they found one last bottle of the wine I originally sought.  Thanks!  :)", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-23", "description": "A neighborhood staple with an intelligent staff that actually EMBRACES the fact that I'm looking for wines with a $10 limit of which they have a huge assortment of.  I've splurged for more expensive vintages here and like the relatively cheap ones I've never brought home a bad bottle of wine from this shop and I've been going here since before I can remember.  Highly recommended and now they have an extensive assortment of wicked spirits.  Love this place can't recommend it enough.  5 stars of the highest caliber.", "author": "Polynesian m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "The Wine Club couldn't be less inviting from the outside.  But once inside, it is full of uniformly good wines, and the knowledgeable, totally unpretentious sales staff will always help to find great wines for great value.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-02", "description": "This place is pretty cool. I went to meet up w/some friends and we left shortly after I got there, so I only had time for about a small glass of wine, but it tasted yummy. Not only that, but each wall or section of the restaurant is a different vineyard, and apparently they have yummy mini-cupcake pairings that go w/the wine. I missed out on that, but sounds so cool! I would definitely go there again.", "author": "Emy s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-12", "description": "worst customer service period.  i have went in about 5 times, and called many times after as well.  every time they tell me they will call me back, and each time they haven't.  u always follow, they never do. not once.   what is wrong with the staff there?", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "i am not into wine, i already have one expensive hobby & don't need  another, but i love going to this place when i need presents.  David is very helpful & has always picked the right wine that made my wine snobby friends happy.  Sure the environment is a  bit \"industrial\" but i don't need fancy environs to complete my shopping experience.  Big ups to this place.", "author": "Yong K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-23", "description": "Prices are some of the best (if not the best) in the city except for Champagne (that will be K&L). Great selection of French and Italian wines and maybe the best Burgundy selection in SF (Premier Cru is in Berkeley). Staff is very helpful and knowledgeable especially David. Will now win an interior decorating award but that helps keep the wine prices low. From $10 Cotes du Rhone to $1000+ DRC wines, you have it all here. Tastings happen every Saturday and you can taste some very good, rare and expensive wines for very reasonable prices but they also pour local wines as well, pretty good mix. \n\nMy only complaint about this store is their online website sort of sucks especially when compared to K&L, but I am reviewing the store here, not the website so 5 stars it will be.", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-14", "description": "This is one of the best wine shops in town.....hands down!   The extra star is for David who is so knowledgeable about wines and has helped me on many occasions.  He's also very nice thus you don't feel intimidated as you ask questions.   \n\nThe Wine Club has a great selection of wines from the lower end all the way up to the high end.    You'll find a lot of great wines that you just won't find anywhere else.   I'm always sure to learn about a new wine when I visit the store and talk to David.", "author": "Oscar F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "Much more a sister store to Winehouse Unlimited than nearby K&L--warehouse setting, not yuppified at all (indeed, it has a very homegrown, DIY feel).  Why they would call it \"Wine Club\" and scare away potential customers is beyond me.  \"Wine Cave\" or \"Wine Shack\" or something would be a better bet.  Anyway, there are plenty of cheaper wines and good, creative descriptions, and although it's a little difficult to navigate, the staff are more than happy to help and not pushy or patronizing in the least.  Only downside is that the pinot and syrah I tried, while adequate, were pretty unmemorable, and didn't have the distinctive and delicious taste you can usually rely on from wine stores.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-22", "description": "By far my favorite place in the city to buy wine.  Stacks of cases with one side opened to see the jewels that await you inside... friendly staff, with high wine IQ.  I highly recommend this place, but also kinda like it being my secret place to find great wines in the city.", "author": "Jan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-09", "description": "I like it a bit better than K&L, the other warehouse-y south of Market wine shop, if only because I find them a bit friendlier. But there are mediocre wines here so watch yourself.", "author": "patrick g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-28", "description": "do not be deterred by the fact that the building could easily be a front for a chop shop. who needs windows when you should be looking at the wine anyway? i like to pretend i am a wine distributor as i walk amongst the cases-- think like i am buying 5 dozen instead of one.\n\nmake sure you talk to the guys that work here. they have a lot to say and perk up if you show an ounce of enthusiasm. they also have good tasting deals and they're open to ordering bottles of rare finds for you at a reasonable price. plus, we once bought a bottle of white that tasted like ramen, no joke. bizarre. but they took it back!", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "The Wine Club on Harrison between 5th and 6th in San Francisco has, bar none, the best selection of wines in the city.  From bargins to vintages that are hundreds of dollars.  Every time we have one of our \"major dinners\", we hit the Wine Club.", "author": "Randy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-12", "description": "We use Wine Club as pretty much the sole provider for all our work events. Sometimes they might only have a case or two in stock but if you speak to them in advance they can get you what you need in bulk. David is the main sales contact we have and he is great but the whole staff is knowledgeable and works to find wines that meet your budget. We've had a really good experience with them and the wines they have recommended have been crowd pleasers every time. They have a wide selection from throughout the world so it makes it easy to find wines we like. A lot of folks in our office are wine connoisseurs and will want $60+ bottles but since we can't buy such expensive bottles in bulk, David and others have been helpful in finding a wine that tastes similar or pleases that sort of palette at a more reasonable price point and have been spot on. Overall, great selection, good prices and friendly service.", "author": "sasha h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-20", "description": "here's what i like in a wine store: copious signage, low margins, and a friendly staff. here's what i don't need: fancy mahogany racks, shelf-talkers, and a sizeable collection of single malts. \n\ndon't be put off by the warehouse feel, cardboard boxes, or sketchy location of this incredible little store. there's something for everyone here - from $9 argentine malbecs to $600 barolos. they consistently beat k&l by a few dollars a bottle and are much friendlier. subscribe to their email blasts to keep abreast of new releases.", "author": "Jeff O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-15", "description": "Damn you wine club.  You have made me poor.  I love you, I can't live without your disorganized aisles of tucked away gems and ridiculously expensive (yet relatively, a bargain!) wine.  Damn you wine club.", "author": "Kosuke I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "Awesome wines and even better people!  This staff really knows their stuff and is always happy to share.  I meandered onto their new website and found a video with Michael Reynolds explaining the coolness of tequila.  It's clear that Michael has a passion for what he does.   After two minutes I left as a educated and thirsty tequila fan (and even bigger Wine Club fan).  Well done!", "author": "k b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-14", "description": "Generally better prices than nearby K&L, but the space is cramped and the selection noticeably smaller.  Their San Jose store is vastly larger and brighter, and provides more useful email alerts on inventory additions and tastings.", "author": "Don H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-26", "description": "I particulary like the Spanish and Italian aisle. Secured quite a number of Rioja Crianza bottles here for a moderate price. Staff are always knowledgable, friendly and willing to help out with wine selections. There is also a tasting corner for a nominal fee. Ignore the name sake \"Club\", there is no membership fees needed to shop here. The placards which describes the wine and provides the ratings are helpful and recommendations for food pairings are a PLUS. I'm totally SOLD!", "author": "Yan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-26", "description": "A trip to the wine club always makes quite a dent in the bank account. ah, well, to bad. we come here for the burgundies and to stock up on champagne.", "author": "sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-26", "description": "This place is excellent, despite being a bit cramped, their recommendations are generally pretty reliable.", "author": "marie m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-15", "description": "The Wine Club and Premier Cru are the two top discount wine shops in the Bay Area.  If you cant find what you're looking for there, then go for K&L.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-21", "description": "Fantastic hidden gem!  Great staff with exceptional knowledge and zero attitude.  Super easy to approach and ask for recommendations.  \n\nGood selection, great place to pick up a special occasion or party bottle of wine without paying the big bucks!  Perfect for the economy, eh?", "author": "Natalie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "The \"Club\" part always threw me.  Do I need to pay a membership?  Do I need to know some sommelier secret handshake?  The answer, my friends, is \"No.\"  \r\n\r\nAnyone can walk right into this SOMA goldmine and find a decent selection of value wines.\r\n\r\nDark and dank.  You feel hungover before you leave.  But the staff is friendly...and understanding.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-21", "description": "It's a good place for winos. The selection is great, and most of the staffs are quite knowledgeable of your selections, and they are happy to recommend based on your occasion too. The price is fairly reasonable. And you can order pre-arrival and futures as well. It opens 7 days per week.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "Great wine merchant! The selection is fairly decent. The service is really great. The guys that work there are probably the most helpful/knowledgeable/friendly I've had the pleasure to speak with. The prices are not spectacular, but are fair. Picture a Sports Basement for wines and you'll get the idea.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "In my mind, the best place to buy wine in the Bay Area. David Goodwin, in particular, is a kind of populist Sommelier who if you say you have only $12 per bottle to spend will walk the store hand picking terrific wines for you, and as earlier postings have said, treat you the same as the '$100 a bottle and up' crowd. We haven't been steered wrong to date. Free parking out front.", "author": "n f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-02", "description": "we're winos, like, big time. i love to snob out on terroir, palate, vintage, fruit-forward, jammy, big luscious vino. not bad here! the folks here are real helpful and stock the best of napa, even the smaller and most awesomest vineyards, as well as french, australian, italian, etc. they do tastings too - even the big $$ wines. the guy was telling me they were going to crack a $150 bordeaux for the \"best of the best\" on saturday. sometimes you can find a real steal but you need to comb the aisles, so come with your patience. otherwise, moderately priced but always worth returning to see what's around.", "author": "Mary V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "perfect wine and cheese pairing when you don't have time to go to Napa", "author": "Steve V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-23", "description": "I go to the wine club - no membership card needed - is a purveyor with a nice selection for it's tiny space.  I am not a fan of this wine shop.  I have never found the service friendly or engaging believe me I hav tried (which I know is the case in many a wine shop).  I do find some interesting selections and others have been there for years.  I was disappointed in their sherry selection.  K&L has a much sturdier sherry assortment.   Sherry a highly misunderstood wine that if served most everyone would be bracing themselves for a wine they fear; but there are many styles-- and cooking sherry is neither (this is what most think of when they ponder about sherry)--so if your idea of sherry is the cooking kind--that is not what sherry is about.  there are many styles from bone chilling dry to unbelieveable dessert style wines like Pedro Ximenez, Oloroso or Cream.  I digress; I think a wine shop cannot be always about having obvious labels but for a thoughtful assortment that includes things like sherry or gruner veltliner--which I did not see there.", "author": "Jaime Patricio M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "Went there on a Saturday sparkling wine tasting.  They even had chocolates and chocolate covered strawberries too.  We had no idea what to expect.  Would it be like Napa/Sonoma tasting rooms?  Would it be seated?  Was it in a separate room?  Would it be a scene?  Anyways, it turned out to be low key in 2 areas on the edge of their wine inventory.  The hostess pouring was very attentive and friendly.  It was crowded but not uncomfortably so.  Although I was expecting the space to be a bit nicer, I kind of enjoyed the casual vibe to it.  They poured some good sparkling wine.  Although I enjoyed it, I'd be interested in going back for a tasting of some red.  Afterwards, I asked one of the people to suggest a bunch of Cabs/Pinot/Merlot.  Gave them the pricing range of $15-25.  We picked up about a case of wines on his suggestion.  I had never heard of any of them.  However, we've gone through 3 or 4 selections and all of them turned out to be GREAT.  We thoroughly enjoyed it.   You just need to know that this is a specialty wine store with highly knowledgeable staff.  The location is a bit off the beaten path, but I preferred it as it was easy to get parking.", "author": "Pete T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-13", "description": "In general, I like this place.  It's got a wide selection of wines in various price ranges, places of origin and quality.  The staff are friendly and most of their recommendations are good.  Some have been not so much.  Parking and location near the freeway are pluses.", "author": "iii i."}
