{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Fun people here. Friendly folks who say hello & ask your name. People will assist you if you have one too many lol. My favorites are to get shots & margaritas. Not good for selfies as posted below.", "author": "Rene C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "Always love the mix and the staff there but don't know if it was either a recently  hired bartender or maybe just the fact that it was a Wednesday and not weekend (staff that I know) but last night the girl behind the bar could not have had worse demeanor. After getting tipped quite well and trying to establish a friendly relationship with her, her attitude and annoyance was reflected quite transparently.   \nAgain I love the weekend staff there. \nBut if you are serving with attitude, and basically acting like you are mad at life or hate your job then quit. \nI will be boycotting the place and telling my friends that if you want to be treated like shit to go there on a Wednesday front bar.", "author": "Angel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "LOVED this bar, honestly such chill vibes, good drinks and good people. \nEveryone is so accepting and loving, it was truly a beautiful thing to witness. \nThe happy hour specials are dope as well, although I believe they only take cash.", "author": "Gabi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "I had an epic happy hour here. Surrounded by the happiest people on earth, we left all our cares and worries at the door and partied it up like it was 1969. The place looked and smelled like it was from that era- divey for short. The drinks were stiff and dirt cheap. G&T for $4? Hell, yeah! We hung out at the back outdoor patio with music blasting and people mingling. It felt like a house party as if everyone knew each other - until a little fight broke out between two girls but they instantly got kicked out. Everyone cheered thereafter and went on with the party like nothing happened. Gotta love this neighborhood bar and Castro, of course. Cheers!", "author": "Marissa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "The strongest drinks ever!!!!!! I love starting out my night here especially for happy hour! The prices are perfect for balling on budget.", "author": "Nick Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "I do love myself a good ol' gay bar and this one is no different.  I think my brother and I were just so exhausted from traveling that we just weren't able to really enjoy the atmosphere of this place.  As much as I love a heavy pour for my whiskey, I couldn't even drink my Jameson and diet because of the lack of any soda.  I could have gone back to the bar to have them top it off with more soda, but it was a Wednesday night and not a lot of action happening.  We did like the heaters on the back patio because it allows everyone to enjoy the fresh air but also stay warm during those chilly SF evenings.  Hopefully, I can come back and check this place out when I'm ready to hit the town and have more than one drink.  This will more than likely change my experience.", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-13", "description": "Wow. My soul is destroyed. I cannot believe that someone would intentionally steal from me at this bar. I gave the Latino bareback $20 for a $6 drink and he handed me back $4. I gave $1 for a tip, but it took me a minute to realize it. I couldn't believe it. I spoke up. I flagged down the bartender and told him NOPE I gave that dude $20 and he apologized profusely and made some excuse for him. I was given $10 back in addition to the $3. People be aware.", "author": "Arnold B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Great place to start. Great drinks and atmosphere.  Love the back patio.  Pool table.  On the divey end, if that's your preference.  It's a friendly, mixed crowd.  Very light on the weekdays but it's the best time for drink specials.  Fri and Sat are packed and is a fun way to start and hang out with friends, especially on those rare sunny days here.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "The bartenders were condescending, and our bags with our phones/jackets/computers were stolen. The door guy told us that he watched someone leave with a few backpacks about 30-mins before we asked and that it was a common occurrence that phones/bags/jackets were stolen.", "author": "Tara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "The Mix is always a great choice! This place is nothing super fancy but I love it. The drinks are decent and very-well priced. The patio in the back of the bar is fun. Always a diverse and friendly crowd, have always struck up a conversation with someone new when I'm here. Great place to stop by before headed to the club or concert.", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Awesome fucking place! Literally smoked a joint in the outside patio as we got our drink on, meet a lot of new friends! I would recommend this place to anyone (Gay bar)", "author": "Linda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Probably one of the chilliest bars in the Castro. I love the patio, the atmosphere - the drinks! I've always had a good time while at the Mix.", "author": "Jeannette A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "I love this place and have been going there for years but be warned my wife and I both had our phones stolen from our purses while our bags were sitting next to us. It sounds crazy but it's true, I'm not blaming the bar for it, I guess I just felt too comfortable. I would also add that this is NOT a good place for your hetero bridal shower or bday party. It's a small space and nothing is more obnoxious than straight people taking up too much queer space (check your privilege if this statement pisses you off). Don't get me wrong, I'm not saying straight people are not welcome. I'm saying that there are plenty of hetero dominated bars in the city that have more room. In a world catering to straight people it's nice for us queers to have a rare welcoming spot where the rainbow family is the majority.", "author": "Amaris B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "I had a TERRIBLE experience last night. First off, in the process of getting a table that was \"on the dance floor\" it took about 30 minutes and the employees were just standing around. Once we got inside at seated, our table was no where near the dance floor... Actually about as far from the dance floor as humanly possible. Then when I got the bill it was 2X the amount I was told at the door and they did nothing to help when I made a comment about that. I will NEVER go back here and I was very unhappy with my experience!!", "author": "Forrest W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Can't beat the prices for drinks.  Can't say the rest about the joint but a quick stop in for a cheap buzz is what this place should be used as!", "author": "Yadi G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "Tonight sat 2-10-2018...10:55pm.. we decided to walk in to have some drinks for my girls bday. The bartender was cool and nice. Anyway after I paid of course I took my change and tip our bartender $3 for 2 drinks. We like the atmosphere till a crazy,  short , short hair old lady Bitch with glasses which bartender said is a regular came behind me and said\" (bitch)Are you from here? (Me) yes. (Bitch) no I mean are you from the United State? Because we here in the US tip (Me and my friends) what ! we did tip you can ask the bartender yourself and on top of that why did you bring that races discriminating remark. Is it because we were the only Asian there ( Bitch) oh I apologize \"  my friends and I was so mad. My girl even told the bartender what happen and he did not do or say anything so overall I will not come here if your a different ethnicity because of the awful people there which no one said or did anything . Very sad that Castro has always been a place that everyone is accepted and not treated different because you are different. All I've known and grew up here since I was 3 and and still treated different because the color of our skin. Well it's not as bad as the world around us who has no food , water, education etc. so it's nothing but a brush off my shoulder and move on . I just feel bad for that naive Bitch ... She could have approach it differently without using racial comments.... karma is a bitch!", "author": "Christy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "This place is fun and it's no frills....everybody jives well together and there's no attitude period.  Nice to drop by and have a drink and encounter interesting people to converse with.  Paul was filling in for a co worker yesterday, as she is always there on Thursday mornings, and afternoons and he was great.  Made the tito's with fresh lime chilled straight up in martini glasses the way I like them....fresh lime and not too limey....peace and good vibes to all of you who drop by....and enjoy!", "author": "David V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "On the rare occasions that I come to The Castro to hang out, rather than to dance, I like heading to The Mix with my guys to catch up and enjoy a drink.\n\n-Stiff drinks\n-No bull\n-Pool Table\n-Patio with full bar in the back\n-Tv's throughout the bar\n-Cheap cheap cheap. Yesterday we enjoyed $2 beers $ $5 cocktails.\n\nOverall still a small space and spot get filled up quickly, especially the patio. Also, it's nice to be out in the back, but people smoke there and the haze can get to you if you're a non-smoker.\n\nThen once you're inebriated enough, you can haul your drunk ass over to La Tortilla which is just around the corner.", "author": "Lanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "I love coming to the Mix ever since my friends introduced me to this place.\n\nWhen you first walk in, you're sort of like- that's it? You see the pool table and the bar. But then if you're sober enough to realize there's a back, you keep walking and reach an outdoor area. As a Southern California native who misses her outdoor bars, The Mix gets me. \n\nDrinks are strong and cheap, good indication that you must be in the Castro. Crowd's always super friendly and it's a nice place to hang out with a group of friends. I wouldn't come here if you were trying to dance- it's a more relaxed, laid back atmosphere.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "We were waiting in line for 15 minutes and the bartender kept serving his friends. When I finally got to the bar he told me to get in line again... horrible service... they are a**hole", "author": "Ricky L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "I was told I couldn't be there because I am straight. Even though my sexual orientation is looser than the washed out queens who go there.", "author": "Claudia F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "I don't normally write reviews but my experience here was awful. Stopped by with some friends that were visiting from out of town. Ordered three drinks and tipped a dollar per drink. Bartender was a young Asian female (irrelevant info if I actually caught her name). She was seemingly nice when I ordered my drinks which is why I tipped. She picked up the cash and as I started to walk away, she yelled at me across the bar \"three dollars, that's it?!\" She looked utterly disgusted and angry. I was shocked as were my friends. We left shortly after. I won't be going back.", "author": "Bilal K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Ooooooeh I feel so gay right now! Gay as in in happy, not as in sexual preference. But hey, that would also be possible here. All's possible here and that makes me LOVE The Mix! Marked as \"my favourite bar in SF\", by my colleague - I heart him for taking me here. \n\nFirst impression; wow what a small bar. Pool table, some heavy drinks (order a vodka soda and I swear you breath fire. Love it!), not bad... But then... Then I walked to the bathroom and BOOM! Second bar outside with music, people dancing, made new friends (seriously everyone was sooooo friendly), and again those strong drinks. \n\nAbsolutely a great night, even during the week so definitely recommend in the Castro!", "author": "Philippine W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-07", "description": "Former and off duty employees hang out here and harass people and dominate the pool table etc.  Welcome to the frat house.", "author": "Nate S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "Went last night 8/4/17 and I'm extremely dissatisfied with my visit. Waited in line to get a drink for almost 5 minutes and the bar was pretty empty. Bartender was to busy helping her regulars. I ordered a beer and a fireball shot and the price was good but when I took my shot it was not fireball. I have no idea what she gave me but it was the most disgusting shot I've ever taken. Idk if they're refilling bottles or she just didn't care what she was serving. I'll definitely not go to her again unless I want some mystery shots.", "author": "José A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "This is a really cool bar to hangout with some friends. The place is small and can fill up quite fast but the outside patio is just too cool not to hangout at especially those warm clear nights. The drinks are really strong and cheap; i ordered  a Jamison and ginger ale and i swear all i tasted was Jamison haha. If you don't like the smell of cigarettes this is probably not the place for you, since this is a patio bar you'll be surrounded by cigarette smokers but if you have no problems with it you'll definitely enjoy yourself.\n\nWhen i went on saturday night they were playing old school '95 alternative songs and the music video projected on the wall. The Mix is just as it's name with a total different mix kind of crowd along with different mix of music genres they play compared to the normal bar and clubs around the Castro which really set this place apart from many small divey bars around the area.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Great staff! Really welcoming and had us staying for hours. Chill place and the staff really made it. Whoever worked may 28 at night was great!", "author": "Trevor R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "At last, a Castro bar that's just slightly more diverse than most, with a far more lively and friendly vibe to match. Prices are fairly decent, and despite the fact that it can get quite busy here, I love how there's never any reason to feel claustrophobic because the front windows are almost always open, and because there's an outdoor patio in the back.\n\nIn a neighborhood and, increasingly, a city where non-whites are often given the cold shoulder, or simply shoved aside, this place shows that there's hope yet.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-12", "description": "Not trans-friendly. My transgender friends always get ignored by the bartenders, while everyone else gets served.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-13", "description": "Not what I expected on a Thursday evening. Took a while to get a drink, the bartender focused on the regulars even though I was waiting. There was a bar outside in the back that was closed and that's where most of the people were located smoking. They had a pool table so I thought I'd be in heaven, but cushions were worn and no one shooting.", "author": "Claude R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "I love places like this....really small inside bar leading out to a lively garden at the back of the venue. The music is a mix of pop/commercial mainly but there a seriously good bribe to both the inside and outside spaces of this place.\n\nBig shouts on the drinks here which are honestly some of the strongest and cheapest I have ever had. Five dollars for what can only be described as pure vodka tinted black....known in other venues as a vodka and coke.....wow....\n\nBest venue I have found in the Castro if you want chatty drinks rather than dancing :)", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "This place was so awesome! Super friendly, smoker patio and just a fun place to hang out", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Torn. I love the mix but I don't want straight people to find it! A lovely crowd, friendly bartenders, stiff pours, good music. Pool table ain't bad either!! One of the best in the Castro, if not THE best.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-12", "description": "It's an open air bar, a little too small for the crowd it receives. I didn't like the music they played - they were cycling through Beyonce, missy elliot, and Sean Paul for close to 90 minutes. The bartenders were really nice, but the long Island iced tea they made was the most potent I've ever had. It only had alcohol.", "author": "Amit D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "The Mix is a decent bar in the Castro. The reason why I said decent because there's really nothing that stands out here that's expected from a bar.\n\nThey have alcohol, they have an outdoor patio in the back with a bar, they have a pool table, and they have music.\n\nBe aware that the outdoor patio is also an area where people can smoke. I know some people don't like secondhand smoke like me so I just move away. When it's cold outside, there are heaters in the patio unlike some other bars.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Came here on a whim on a Saturday night because some friends and I were visiting San Francisco (me from Arizona, and them from Fresno) and their cousin who ended up meeting us by the Embarcadero, who then took us here. \n\nFriend's cousin ended up meeting a friend, who we met his friends, and we ended up on the back patio which was nice. Liked that it had a more of a laid back vibe, than what I'm used to in general setting, especially a new place, and in a city you don't visit often. \n\nI didn't have a drink since I had been drinking since lunch, and then stopped by another place prior to coming here, but based on what I saw, they seemed to have a good selection of products. \n\nBut, if you're a lady, I'd be a little weary about the bathrooms. They are unisex, and guys can be a little messy. \n\nOh, and it's cash only.", "author": "Mercedes Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-11", "description": "Love this place; however, I've have now had the worst experience with the blonde elderly bartender. she was overly demanding toward what I wanted and wasn't able to recommend anything because she didn't know what would be good for a \"sweet tequila cocktail\" \nSo, I suggest any new customers to not get a margarita because they will over charge you for tequila and don't come in the day because this woman will be there demanding your order.", "author": "Andria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "The Mix Is Truly The Heart Of Diversity In The Castro.\n\nIndeed, one of my Top 5 choices for, playing pool, mingling, having a smoke or having a good drink. This bar truly stands by its name, \"The Mix\" because it's truly a mixed crowd. \nOld & Young\nFit to Fat\nBlack & White\nDaddies to Twinks\n\nThe atmosphere is very chilled,\nInside there's a Pool Table,  Full Bar & Great Music. (Top 40 - 90's)\nThey have an outside patio which I absolutely love.\nThe audience there is very colorful and warm, meaning Nice Colorful Lighting with Heated Lamps, another Bar, and this is a Smoking section as well. \nThere's TVs back there to watch your sports games or music videos.\nIf it's raining don't hesitate to not come out To this bar, \" they have you covered, literally\"\nWhen it rains, the outside patio is covered so you can still have that outside experience without getting rained on. \nThe outside patio is really where the magic of The Mix happens....\n\nWanna get a Way from the typical, traditional bars ? The Mix is your destination.\nIt's a mellow bar.\nA local bar.\nA cash Only Bar\nAnd Last my favorite A FREE BAR....  (No Cover) \n\nSo I recommend this bar if you're just starting off your night or just need a nice relaxing night out. \n\nTHE MIX.... COME MIX IT UP... \n5 Mixed Stars", "author": "Anthony J G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-11", "description": "Sooooo\nHaving a nice drink....\nRoach crawls across he counter between our drinks. \nIf I could give negative stars, I could. \nYuck!!!", "author": "Kim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "Located in the heart of the Castro.\n\nPros: Juke box, pool table, and dual bar with outside patio. Lots of tvs and a happy hour with reasonably priced beers and wine.\n\nCons: can get very crowed during sport games and the outside patio can get stuffy when everyone begins to smoke cigs. It also becomes very difficult to get a drink during rush hour.", "author": "Mel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "It's a no frills smoky bar that sits in the center of All Things Castro. I love it.\n\nCash only and a crappy ATM fee. Bartenders pour strong drinks. Frozen margaritas at all hours.\n\nGuys can get crabby on the patio if the place is overcrowded, but I guess that's true with most SF bars. It really is a \"mix\" of customers, which for me is the best part. I can talk to people just to talk. I don't like how polite they are to neighbors, though. Turning off the music on the patio at 11ish? Lame.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "It is always a fun bar to stop in and grab a drink or 2 with good friends. \nThe prices are good and drinks are nice and strong...", "author": "Mateo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Love the mix.  Great local hang out spot.  Bartenders are always nice and fast.  I like their lit up back patio", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "+ Cheap beer\n+ Nice patio seating\n+ Good music\n+ Outdoor TV's with good sound\n+ Heat lamps\n+ Plenty seating\n\n\n! - cash only\n! - watch your drink, there are shelves in the restroom for this (thank you)", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "Nice open air bar, and great margaritas. I love that it is also pet-friendly during the day for a happy hour. Overall, the prices are good and drinks are nice and strong. Didn't stay there past happy hour, but I am sure its fun.", "author": "Diane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "Great bar! I don't usually frequent the back patio but there is one if you want to enjoy the sun or just put a little smoke in the air. Staff is amazing just don't piss them off otherwise, you could probably get away with murder.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "Cash Only\n\nThe Mix was the first gay bar I have been to since I moved to SF. This was certainly a unique experience that no words can really explain. I definitely felt out of place but thankfully the people I was with were cool and helped me to adjust. \n\nApparently, drinks served in the Castro area are cheaper and stronger than most areas so that's definitely a plus. \n\nThey have a large space with a pool table in the main area and a great outdoor area with a second bar area. They play a good mix of music and allow you to smoke outside. The bathroom set up is co-gender \n\nOverall Thoughts\n\nA lively atmosphere serving reasonably priced drinks with a heavy pour", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Friendly service and people. Come as you are with no judgments made. Like the title indicates it's a large mix of people that just want to enjoy a drink and play pool sometimes while socializing with friends and new people.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "I'm not sure why this is categorized under \"Dance Clubs\" on Yelp. As many times as I've been here, I've never seen any dancing, not \"dance club\" dancing, at least.\n\nPersonally, this is my fave spot in the Castro. I like to chill and lounge, and this spot has plenty of room to do just that. There's a spacious outdoor area in the back with plenty of seating, but it can still pack up pretty fast on some nights. There are two bars with friendly bartenders and solid drinks. The crowd is probably the most diverse for the area (all ages, all identities) and I love that!", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Now this is a bar. Larry the owner is nice. Bartenders are nice. Bouncers are nice. Never had any problems here and frequently the place often. If I was to ding one thing, it's the back patio. Unfortunately, there not much you can do to control the smoke, crowdedness, and loudness beside restricting access. I tend to stay inside which is fine. Ok fine, second ding...music videos could also use a boost :-P. I'm still going to keep coming back with my friends as the drinks are GREAT and perfectly priced. Heart this place.", "author": "Honest C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "I moved away from San Francisco about 15 years ago, but still visit several times a year. Back then, I think this place was called Charlie's? Uncle Charlie's? Doesn't matter. Mix is always my first stop of the night and sometimes it's the whole night. The drinks are great & the prices for, say Grey Goose, are nicely priced. I like the patio very much. It's great for people watching and striking up random conversations with such a random crowd. If you wanna hook-up, you can do that. I have. If you wanna just people-watch, you can do that, too, and it's a great place for it. It does get quite elbow-to-elbow as the night goes on, so get your spot early!\n\nIf I had a vote, I'd beg them to accept credit cards...it's a pain in the ass to hand over $200+ in $20's, over the course of a night (even more, depending if I bring friends, or make friends)  Also....imagine! People running a tab can be more generous, spending far more...I know some nights at other bars, I don't even know what I spent until the next morning.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Couldn't have a better name. Crowd is diverse, fun, and relaxed. Bartender named Michelle gave me the best pour for a RB+vodka for only $7. Way to my heart. 10s across the board. Fun place to start your night, play pool, or have a relaxed conversation with friends.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "I love coming to the Mix! Its one of my favorite bars in the Castro. they know how to make a stiff drink and they are affordable compared to the other bars. And they have a patio in the back with music. Its a great place to come and relax. Pretty much every time I go to the Castro I make a stop at the Mix.", "author": "Thomas J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "Sure its sticky and I regularly walk home instead of use the restroom here...\n\nBut the beer is decent, the vibe is unpretentious, and the back patio is an AWESOME place to meet a group of friends on a Sunday Funday.  They have TVs out there to watch football or (zzz) the Gigantes.\n\nNo food...no problem - grab a pizza across the street and bring it over.\n\nI love that nobody feels out of place here and all can \"come as you are\" - in drag or in your workout clothes.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "The downside:\nCash only bar \n\nThe upside:\nThis bar never let's us down when we're in town. Definitely my favorite bar in Castro. It's predominantly men and I am a married lesbian. At a typical male gay bar the men are not very welcoming. They look at you like you're taking up valuable space that another man can be at. NOPE NOT HERE. Bartenders are very friendly to all us and treat us equally. \n\n$14 for a Whiskey Sour with Jack not too shabby! \n\nSee you again when we're in San Francisco.", "author": "Liz N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "As a heterosexual woman, I visited this place occasionally with friends who were semi-regulars. The drinks are a kick in the head - be careful with their margaritas, for they are formidable and too many will leave you forgetting where you live.\n\nThe back patio is the place to be - but it's quite cramped. At least it gives you the chance to make new friends [which I have, many times]!\n\nAn adorable dive in the heart of the Castro... very recommended.", "author": "Stephani C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-16", "description": "Gay Bar Pub Crawl, Part 2. \n\nThis was another loud, crowded gay bar. I get that it was a Friday night, so I am most certainly not complaining. Lower lights, pool tables, and again--a strong pour. (I really, really appreciate that).  \n\nWe stood out on the back patio this time, surrounded by tiki torches. Again, we shouted at each other over the din of noise, had gay guys sort of elbow their way past to get to their friends (Saying \"excuse me\" never hurt anyone, ladies), and we bounced after one drink. \n\nI wish there were more to say. It seemed a lot like Midnight Sun in terms of the crowd, while physically it had lower ceilings, a place to smoke, and a more intimate(?) feel. Not sure if that's the word, but whatever. I enjoyed my vodka tonic.  \n\n3 Stars.", "author": "Nathan I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "I can't believe I haven't written a review of this place. I've been here several times and it has neighborhood bar feel to it. It's not \"upscale\" like Beaux but has a nice homely kinda feel to it. Large patio in the back to kick back.", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "I love it here. \nHappy Hour drinks are really, really cheap,it's a nice and fun atmosphere with a loud outside patio.\nAbsolutely relaxed place to go to when you just wanna grab a beer during the week.\nLongdrinks are as strong as they can get. You might wanna order a chaser on the side if you can't take it.", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "The front of this place honestly looks pretty sketch. It's all low-ceilings, dim lights, and pool tables. When I was here, not too many people were making use of this area so it was just a few random lurkers playing pool or loitering which did not give off a great first impression. Once you walk past this though and through this little door in the back, there's a cool outdoor area and it's a complete change in mood. \n\nATMOSPHERE is friendly, chattery, and fun. There's a full bar here too that looks like a giant wooden lemonade stand. There are hanging lights and umbrellas with tables to stand at. It kind of feels like you're in someone's back yard.\n\nSERVICE is fast and efficient. They're also really friendly and talkative. Because of the backyard, it starts getting crowded even on a Thursday afternoon so maybe try to come earlier, especially in the summer.\n\nIf you don't regularly frequent Castro for nightlife, The Mix might be a cool place to come. Definitely was not expecting the back patio area to be so nice and it certainly was a good experience.", "author": "Junes S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "In the ever changing neighborhood that is The Castro, The Mix is still an oasis amongst the craziness that is 18th/Castro.\n\nThe best thing about The Mix are the bartenders. And owner, Larry, who cares so much about his neighborhood, his customers, his staff. \n\nSilvia, Sloane & Gil have been slinging drinks for years and they do it with charm and professionalism.  The reason the bar is packed is because of these 3 amazing people. \n\nWhen I was in need of human spirit, back in the day, The Mix was my go to place of solace. \n\nWhether sad or happy, this is the place to drown your sorrows or cheer to the new job, apartment, boyfriend. \n\nJust know this:  Silvia saves lives.  She is a Godsend and I am happy to call her my friend.\n\nCASH ONLY, ATM on premise.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "The Mix bar is a favorite because of it's patio that allows people to smoke.  When major sporting events occur, they have all their tv's turned on.  The place has been remodeled in bits in pieces and still doesn't have a cohesive look or feel beyond a neighborhood bar.  The restroom area is all pink and while it functions a whole helluva lot better than before, it doesn't make any sense from a design perspective.  At any rate, you will feel comfortable there.  If you smoke, you'll love it because it's only 1 of 2 bars that allow smoking on the premises.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "Even though the back bar can get smoky, that is certainly the place you want to be. The inside is alright too, with pool tables and all, but the island-themed patio is so much better. There's also heat lamps, plenty of stools, benches, and standing room. I love that they make themselves out to be a neighborhood bar, unlike the other dance bars in the vicinity. This one is actually homey. The bartenders are awesome, fast, and real hardworking. I don't think I ever saw them take a breather for a single second. The drinks are strong and keep you going. The beers on tap were not impressive, so stick with the well drinks or cocktails. The long island iced tea and tokyo tea was great. As exposed as the restrooms look, are nothing to fear.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-11", "description": "Honeymooning visitor, here. I was under the impression that Castro was our mecca, our one place in the US to be \"at home\" and enjoy gay bars that welcomed all of the queer community. As a bar that comes up on the list of \"greatest bars in SF\" according to Google, I was disappointed.\n\nI am not a hot gay man with 6-8 pack abs and I am not a regular, but damnit I am a paying customer that would love a drink in a timely fashion. One bartender was more interested in the cute boy at the end of the bar and the other walked past me, twice, before asking what my order was. If I was looking for that kind of service I would go back to Charlie's in Phoenix -- at least they have an awesome taco stand next door. My wife and I ordered two draft blue moons -- you can't really go wrong there -- but the 10 minutes it took to get noticed was a bit ridiculous.\n\nOnce we sat down, we commenced people watching. I enjoyed the three games of pool I watched -- damn, it would have been nice to get a chance to play instead of the guy setting up the table and waiting for his friend for 20 minutes. Real mature, Mr. I'm-A-Regular-Here Guy. Give someone else a chance, yo.\n\nI guess it's a \"thing\" in San Francisco to only be a cash bar (QBar, Twin Peaks, The Lexington Club, I'm lookin' at you, too) but holy hell is that irritating.\n\nI give this place 1 star for the diversity and 1 star bc my Blue Moon was delish and only $3. Remember that lesbians are paying customers too, Bartenders, and you might get even better tips from us.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "Castro dive, good happy hour. Drinks never disappoint. Good music or something interesting on the television. Cash only!! Not a lot of space to sit, but there's a pool table!", "author": "Ifetayo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "I tend NOT to be a neighborhood bar guy. There are a few reasons for this. Firstly, for some reason, it seems (to me) that they are far cruisier than the dance clubs in the area... I know, that's opposite of what people usually say. But I think that in a neighborhood bar there's a different sense of 'friendliness' and the acceptability of talking to total strangers. When you're a regular here, people tend to get a sense of who is there to hang with friends, who is there to meet people, who is there to be generally social, and it's all good. But as an outsider, in a neighborhood bar, I think that people are more likely to chat you up than in a busier venue, and if you just want to kick it with friends, that can be annoying after a time. But I digress...\n\nThe Mix is one of the better venues of its type. The large back patio is inviting, the people are friendly but maintain boundaries, the bartenders are chill. I knew I was back in SF when I saw a young guy (early 20s) pull out a bong and hit it right at his table, looking fairly unconcerned that anyone in the bar would take offense. Too funny.\n\nCheap drinks, good overall vibe, fun times.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-13", "description": "I didn't find anything particularly interesting about this spot - it was okay.  It does have a patio area, which I guess could be nice on a warm, sunny day, but it's just okay - a very basic, somewhat run-down, set-up.  The drinks were fine.\n\nI guess when I go out, I want to experience something different or interesting and here it just feels like sitting in someone's backyard.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-21", "description": "I am highly susceptible to clever marketing ploys. Take this super creative idea I recently fell for at Mix: a sign.\n\nYes, a sign near the bar with a picture of Henry Weinhard's Root Beer (my favorite root beer!) The moment I saw it I wanted one. The rest of the boys ordered cosmos. . .but I was firm.\n\nThen Sean, who was buying the first round, walks back from the bar and hands me a rocks glass. I am puzzled. Where is my dark bottle of Henry Weinhard's Root Beer? Turns out the bartender has given me a root beer shot? What the heck is a root beer shot?\n\nWhen I took it back to the bar and pointed at the sign that got me craving the root beer in the first place he begrudgingly got me my bottle in exchange for that nasty shot.\n\nMoral of the story? If you want a non-alcoholic beverage at Mix you better be loud and proud about it or else you might get stuck with a root beer shot.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Randomly ended up here this weekend because of one thing: their back patio. It did not disappoint! Stayed for a couple beers before moving on, but any bar with an outdoor space on a beautiful day in SF is a gem in my book. Had a happy hour (that lasted 7 hours) on a Saturday too = win. Cash only.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "After an early dinner nearby we were walking around the neighborhood, and stopped in here for a drink. \n\nThe bartenders were fast, and and the bar has a great neighborhood feel. I loved the mix of music that was playing, and would totally stop here again when I'm nearby.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "This is probably the closest thing Castro will ever get to a dive bar. (It's not like the Mission is all that far, if that's what you're craving), but it was a great chill spot to meet a friend who didn't want to hit the dance floor while the sun was still up. (In other words, he's from out of town.)\n\nThe Mix was appropriately busy without being packed, and the bartenders were on the spot, so nobody waited long for service. It's a friendly environment, the pool table takes up a bit more room than recommended so it probably gets packed on a late night, but if you want a place to just sit, drink and mingle in the Castro, The Mix could be your spot!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "I absolutely love the staff at this bar.  Everyone is so friendly, funny and generally kind every time I've been there.  They don't even complain when I order coffee or a Calistoga.  Thanks to Sloane, Sean, Silvia, Todd and Buddy.  Killer staff!  Love you guys!", "author": "Matt A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "Affordable drinks. Friendly crowd. And indoor and back porch options. Good if you are bringing your posse with you. Plus ADA friendly!!", "author": "Regina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-04", "description": "After this experience I had a chance to meet with Sylvie and discuss the situation. Not only has she worked with the staff around acceptable processes, she has made me feel like I am a member of the Mix family. Truly a landmark for SF, and one of my favorite places to grab a drink, eat your food & socialize.", "author": "Kai N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-20", "description": "Wandered in here on a Friday night, because it seemed less packed than most places. Was with a friend visiting from out of town, who was really excited to be in the gay mecca of the USA. \nI was with my partner - we're two ladies, he's a dude. He paid 1$ less on every drink and got faster service..... So that's pretty uncool. I get it, it's a gay bar, you're catering to the gay crowd, but hey there, mr probably straight anyway bartender, we planned on tipping too. So, yeah.\n\nThe patio was great, the drinks were good and strong. Great crowd of people.", "author": "Kristin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Best no-attitude bar in the neighborhood. Friendly crowd, amiable staff, pool table, and comfortable back patio.", "author": "Aldus M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-21", "description": "Awesome gay bar for straight people. My girlfriend and I went with a large group of friends and we had a blast. The music was fun, the crowd was rowdy and friendly. \n\nThe drinks were strong and the bartenders were some of the friendliest I have met. \n\nIf you want to go to brunch at Lime and then come here, you definitely should!!! \n\nAlso, if you are starting your night out in the Castro, make this your base of operations. \n\nSincerely,\nStraight Dude/Girlfriend haver/Fan of the Gays", "author": "Lucas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "Best parts of the Mix:\n~Super friendly patrons\n~Awesome bartenders\n~Fun music\n~Chillaxy back patio, with rolling cover depending on the weather.\n\nThe only thing I would change would be the restroom. Ick. I'm fine with non-gender-segregated bathrooms, but do the urinals have to be right next to the women's stall? The floor is always wet, and it ain't from frequent mopping.", "author": "Umilia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "After 15 years of attending this bar I ran into the most disgusting issue ever. One of the Bar backs who attempted to hit on my husband ( by trying to kiss him when I went to the restroom a few weeks earlier) and got turned down was allowed to use my disabilities to discriminate and make me feel unwelcome. I recently lost my hand and have had all the muscles in my back removed and tendons in my legs harvested for transplant into the remaining part of my arm leaving me unable to stand for periods of time. The bar back actually came and took a stool from me saying I cannot have a stool on that side of the patio ( where lots of other stools are located) then when I told him I need it and when he pulled it away he told me to sit on a bench while shoving other people's drinks ( they were drinking) off on a frenzy. He proceeded to carry it away while smiling at my husband and giving me a F you look.  Not sure if I should take this straight to management whom keeps him for unknown reasons that doesn't include courtesy to patrons  or deal with a discrimination  claim which isn't the bars fault Any more than allowing their staff to do this", "author": "Brad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "Cool hangout spot in Castro. Little patio out back (gets smokey), pool table, and a nice crowd!", "author": "Jill B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "One of the few places you can have a drink and a smoke in the back and catch the sun on sunny days while watching a ballgame.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "We came here for last call (gays always run so late). They made us insanely strong drinks. After one, I was outside siting on a random stairwell cracking up. This was a great way to start one of the most memorable, crazy night I had in San Francisco.", "author": "Darija D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "A great place to hangout. Fun neighborhood vibe. Down to earth place. Good drinks. Friendly service. What more could you ask for?", "author": "Jonas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Preferred hangout bar. Great back patio with heaters, seating.. The works. \n\nGreat beers on tap, and the bartenders are incredibly pleasant and more often than not remember what I ordered last, ready to pour the next round.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "Surprising really good! Here is what u should expect, a warm unglazed donut with ice cream inside. It's not overly sweet and the donut is amazing just by itself. Believe it or not, I wouldn't mind the donut by itself or the ice cream by itself. Both together is really good!", "author": "Giang N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "Nice bar wtih pool table, patio, good staff", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-08", "description": "Some friends and I started our night out at Q-Bar last weekend, and ended up here.\n\nDrinks were good, but it really sucks when you really have to pee, but get the [unlocked] women's stall door shut in your face because people happen to be having sex in the stall.  Keep it classy!!", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "Great neighborhood bar in the Castro - great staff, great crowd of regulars!  On our visit, had the chance to visit with an old friend from when I lived here who is now bartending at the Mix - so, go by and see Buddy - great bartender, great guy!", "author": "Jerry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "I like the Mix - it's comfy, casual, good drinks (strong!), pretty friendly people (mostly) and outdoor/indoor seating. Also, there is pool, a juke box and clean bathrooms. \n\nIt's centrally located in the Castro where I can easily meet friends for drinks without having to go too far. \n\nGreat place to just chill and talk with friends or even a date (if very casual).", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Fun place to grab an afternoon drink and hang on the patio with friends.", "author": "Lyric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-12", "description": "Not the best place if you want a cheap, strong drink. Other places have two for one drinks with strong pours. This is usually a wind the night down place for me, or a im tired of hearing Britney blasting across the street so I'll come here to chill.\n\nThe bartenders are hit or miss. There are a few usual bartenders that are pretty nice to me. The ones that are a bit sketchy are chubby blonde lesbian, and the buffer looking latino guy, not Gil. His drink prices are inconsistent.\n\nI consider myself a regular here, yet everytime I come here, the regulars look at me like I'm some creep out of Kansas. Patrons here are pretty grimey and gross looking for the most part. Pretty prissy too. Especially on the back patio area. And dont get me started on the Sisters of Perpetual Indulgence. Everytime they come here, they think they own the place. Needless to say, this place is full of gay attitude. I dunno if the patrons get it from the staff or vice versa.\n\nEither way, I dont come here to be friendly with others, I come to enjoy company with who im with so all the bitchy queens can pretty much kiss my ass", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "This is a fun little bar with a great atmosphere. There is a nice inside area with a pool table and an outdoor/partially covered patio. Bumped into a ton of nice people here. Great crowd.", "author": "Tacia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Amazing bar. Great atmosphere. Nice people. This is the bar to go to in the Castro. Bartenders are incredibly friendly and people are great. If you want to have a drink and a good time this is the place to be", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "I would give this a 5, but I am trying not to be biased, as service is spotty sometimes, and it is cash only.  However, it is easily my favorite bar in the city, gay or straight, and I am not gay.  I do not go to bars to meet girls, or try to get laid, nothing like that.  I go to bars to drink, hang out with friends, people watch, and get some ridiculous stories.  And, depending, if I am drunk enough, to dance my sweet little ass off. \n\nThis bar has a great patio to hang out with friends and people watch, the general clientele is all very friendly, and unlike some gay bars, where being the straight one is frowned upon, no one seems bothered by the fact that I am there, and many still offer to buy a drink, even when I say \"Just so you know, I am straight.\"  Sure, to my hopefully narcissistic self, I take this to mean they find me sexy as hell and hope they can get me drunk to woo me, but hey, if they want to try, as long as I am honest, why the hell not?  \n\nAs far as the stories from people watching or drunken friends go, I have many.  From the time my female friend decided to walk around topless after allowing some random guy to touch his first vagina (hers) and then those two made out with my other friend, only for her to be left out as my gay friend and this random guy disappeared into the bathroom to 'service each other\" as I walk in to witness it, to the time when one of my friends legit pimped out me and another guy for drinks.  (Yes, this happened: story,  girl I was seeing came with me, two gay friends, and a straight buddy.  Guy approaches us, we say we are straight, but she is our pimp.  He proceeds to hand her cash if she will make us spin around and or let him touch our butts.  She then used the money to buy rounds for everyone involved, the payer included, and then returned all the change to him.  He hung out with us the rest of the night.)  \n\nThe patio allows smoking,  and based on what I have witnessed, not just tobacco. There is a bar inside or outside, the margaritas are KILLER, and every drink is strong as hell (think Pop-Eye on Spinach).  There is pizza across the street, and pretty much any major bank I can think of within half a block, so  cash only shouldn't be an issue.  \n\nWhen I say I would choose this bar over any other in the city, I do not exaggerate.  My best nights out in the city either start or end here, and sometimes, both.", "author": "Dick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-21", "description": "I'll try to trace back how I finished my Saturday night here.\ni went for a Hike at Muir Woods, had dinner at Stinson Beach, drove back to the city, went bowling for the first time in my life at the Yerba Buena center and then all hell broke loose.\n\nI don't know if the beer was particularly strong or if the 7 mile uphill fast pace hike contributed for my accelerated drunk state.\n\nWhen I situated myself after leaving the Bowling Alley we were at the entrance of Le Cafe. The 4 bloody/ drunk individuals being handled by the police and the half naked dude dancing inside kinda threw us off so we just walked around until we found the Mix.\n\nI guess Alex and Paul had a very attractive phenotype for the crowd/ bartenders,  the service was uberfast and everyone was friendly.\nAt some point I got tired so I extracted myself from the group to sit down (in the back patio) 8 friendly gay man joined me to try to figure out where I got the polka dress and matching shoes. Eventually one of them mumbled some words in portuguese and my two working neurons at that moment recognized him as Jamie (the sweet guy that gives me forearm massages at the Aveda store at the Westfield).\nI had a few more drinks with them, noticed how revealing the mirrors behind the seating spots can be (i guess it gave me a different view of 3 three way makeout session LOL).\n\nLeaving the place I said goodbye to everyone (including the friendly bartender that was telling us endearingly that we needed to leave, that the place was closing), got distracted for a microsecond and lost my group. \nWhile trying to find my pack some random huge guy hugged me and said I was gorgeous (I suppose he was extremely inebriated or he just didn't take a good look at me).\n\nIt is a fun place and I will definitely get lost there again.", "author": "Bea L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "I'm not much of a bar guy. But when I do hit the bars in SF on my visits, the Mix is a great place for me to go. Nice space outback, quiet for the most part, easy to get to the bar.\n\nThere's a really friendly unpretentiousness there, which is something considering the attitude going on a block away. That's what I really like about it.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "love the pool table was a designated driver for a friend", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-06", "description": "When I drink, I smoke\nSo their patio just rocks\nBartenders are HOT", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "a fun place, good music and drinks! excellent outdoor patio for smoking!", "author": "Marwan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-03", "description": "Great outdoor patio; especially when it's raining outside! (Perfect for smokers!) & the music was up to date and perfect for the Castro!", "author": "Haley K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-13", "description": "1-star for the bad bartenders on a Thursday night. The butch dyke with the bleached, short hair working the bar in the front needs to be fired. How hard is it to be professional? I'm not even asking for politeness, good manners or, god forbid, a smile. All I ask for is that the person I'm PAYING my hard-earned money to leave the attitude at home and to just be professional on the job. And professional, this woman was NOT. Really, if a \"neighborhood bar\" needs to rely on repeat customers and good, word of mouth testimonials to stay afloat, then I think the owners should think twice about keeping this person on board.\n\nAnd the Latino bartender in the back. Wow. Not sure why the drinks he was pouring for me were 10x's weaker than the ones he poured for my friends. Whatever his reasons were, that wasn't cool.\n\nWhy, oh why do the bartenders who worked here that night think that they can be assholes when there are PLENTY of great bars nearby with better service? There are a lot of great places to drink and socialize in the Castro. Nothing makes this bar more special than the rest. So, to the bartenders that night, stop being assholes because you are taking this business downhill. I'm taking my money elsewhere. I don't have patience for bullshit. That is all.", "author": "Tita L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-27", "description": "I was always hesitant going the this bar but last night I figured out why. There was a twinkish Asian-American (the reason I mentioned the his ethnicity is so he knows who he is) guy that was ignoring his clients across the board.  It appeared that there was a problem with the videos and there were two guys taking care of the problem - he kept getting involved with the technical part of the videos and ignoring his patrons.  The guy that was cleaning the bar was also ignoring the patrons.  \n\nWhat a freaking JERK.  I am certain that I will go back and give it a 2nd chance but it is going to be a while before I go there again.  \n\nThe environment was okay and I see a lot of potential but with unprofessional bartenders, it will loose customers like it did last night.  I walked out and went to Midnight Sun and as always, the bartenders were attentive and friendly.  \n\nSorry MIX - I am not a fan of yours and I am certain there are other guys that walked out as upset as I was.", "author": "Eric J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "This is a neighborhood gay bar.  It's not fancy.  It's not necessarily fun on its own.  The crowd seems to lean older, higher up on the BMI scale, and less facially symmetric.  I'd recommend for Saturday or Sunday day drinking.  You know, a nice warm up before you go somewhere with a bit more flash in the pan.  What does that mean anyway?  Flash in the pan?  I personally have always liked Green Lantern more than the Flash.\n\nI have determined that people use the term neighborhood gay bar when they don't want to say it's teetering on the edge of lame.  Oh, I did like the patio in the back.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "Fantastic back porch with plenty of sun, benches, and tables.\nWhat's there not to like?", "author": "George F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "I like how the drinks here are not super strong like Badlands. This is DEFINITELY a mixed crowd. You have ALL types of ppl here. (Age, genders, size, race, style, etc.) I have never stayed longer than 2 hours. There's not much of an area to dance. This is more like a place to come in and grab a drink and sit down. The DJ haves an eclectic taste in music. You'll hear from punk rock to pop. Can't remember but I think they have some pool tables. Back patio is a great place to get some sun if you're there in the afternoon or early evening and you can smoke.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "You are in the Castro the night of game 6 of the NBA finals and need to watch the game before your dinner. Quick: where do you go?\n\nWell, I want to seemingly 8 other \"bars\" on the same street before stopping at Mix to watch the game. \n\nWhat bar doesn't play the NBA finals between the Celtics and Lakers? Usually that would be a rhetorical question, but one quick hurried jaunt through the Castro answered that question. \n\nThe scene here was lively and the staff were friendly as I was one of the few people watching the game. Everyone else was too busy having fun as I agonized over the Lakers being demolished.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-10", "description": "I like how this place has all my bar essentials:\n- pool table\n- outdoor patio\n- with heat lamps!\n- friendly strangers\n- well-lit bathrooms\n\nThis place is a good starting point to any night out in the Castro.  You get your reasonably priced drinks, nurse it out back, and then head out to the next joint.\n\nDon't plan on getting into an intense game of pool here.  This place closes insanely early on a Wednesday night (midnight).  Fine.  We were on our way out anyway.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "Ah the Mix, I used to be a regular. Why? Cheap, strong drinks and it's never too crowded. The Patio is pretty nice in the daytime, and overall it's just a good place to hang with friends and get tipsy. If you're looking to find a hot guy... go elsewhere. Only the bartenders are cute. Especially Gil, not sure if he still works there.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "Came here with my friends to do a little pre-drinking, socializing, and just enjoying THE MIX. I really like the atmosphere and how the bar is set up to seem like its outside. Great music, the lighting is amazing and kuddos to the bartenders who made my drinks! It was real strong and I was totally drunk off of my Mai Thais, Thank You! Next time I'm in SF I will definitely come here again.", "author": "An S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "As a straight girl in the castro this is one of my fav bars. Why? Because unlike badlands I don't get asked questions like \"are you a lesbian or are you just here with one of your 'gay' friends.\" But sorry...I really was with one of my gay friends. Sometimes I like to dance to Britney with my gay friends, i can't help it if i'm straight, it's not like i'm gonna crush his game or nothing, serious, hook up at will. end rant.\n\nAnyway, this place doesn't have any attitude. The crowd is mixed of younger and older. The people are friendly, the music is awesome (they have a jukebox with *everything*), the bartenders are sweet and pour stiff \n....ahem...drinks.\n\nAn excellent place to pre-party, have a round with friends, or shoot some pool whilst listening to Kelly Clarkson.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "5 of us Got bottle service tonight.  Good times, ok waitress.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "This is a great place...what I call our neighborhood bar.  Fantastic bartenders, reasonable prices, and I LOVE the outdoor space.  a great hidden find.  Always an interesting crowd.  Classic SF.", "author": "Nancy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "Cool little dive bar with TV's for sports. Friendly crowd.", "author": "Kathy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-15", "description": "Some light once in awhile could wonders for this place. It's the first dive bar I've been to in the Castro and while I love seeing young kids and bears mesh in harmony, it gets a little crowded.\n\nI've noticed the drinks change depending on who you are. Listen: my friends and I all got the same drinks. One right after another. Depending on who was cutest, they got the cheapest drink. I was right there with $6.25 an the most expensive drink was $13! Yay! I'm cute to a gay man!\n\nThe back bar is awesome with the twinkling lights and park benches to sit on. A little crowded but a very relaxed atmosphere.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-24", "description": "This place serves Guinness,\nSo it's A-OK with me.  \nI'm straight and loved it.", "author": "Josh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "my go to bar in the Castro. For a beer during lunch or margaritas at the end of a long day, its one of the more inviting bars ive been to in the Castro. The back patio is awesome on a sunny day (which can be rare in the city). always go when Sylvia is working, she makes the best cherry lemonade and drinks in the bar. can be a little loud sometimes, but its my favorite either way. always come back here, first choice for me :D", "author": "Rosie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "Do I want to order a drink from the bartenders or just F them?  \n\nEither way - great times to be had!", "author": "James V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-02", "description": "Upon arriving, I do what I always do first (pre-intoxication). I look around, give the layout, the people, and the general ambiance a good run down. There was a pretty diverse crowd that day; plenty of men (of all shapes and colors) and a few girls here and there.. We were lured to The Mix by the potentially uber crowd and (more importantly) the outdoor patio, and the bartender instantly said that I wouldn't be able to go... (I forget - was it closed, full, or was I just not good enough?) Rejected.\n\nAfter the obligatory first round of drinks, I finally realized - I obviously wasn't hot/gay/man enough to get the bartender's attention. Once again, rejected. It wasn't until we made friends with the hottie next to me who offered to talk to the bartender for us that we finally got seconds, thirds, fourths... and the rest of the night was a blur.\n\nIt's true, the drinks ARE strong.", "author": "Asha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "I came to The Mix on St. Patrick's day and I must say, it feels kinda like home. Everyone was very friendly and social without being obnoxious; no complaints there. The drinks were VERY cheap and strong, which is also a plus. The music was good and wasn't too loud. Lot's of smoking going on outside and i could smell some weed. Didn't get a chance to play pool but I will next time if anyone is down. Can't wait to come back!", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-21", "description": "Nice chill place.  It's been \"remodeled\". We love the bartender.  Cash only bar.", "author": "Trynh K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-15", "description": "So...a Friday night and a group of friends are meeting at the Mix. I walk in (around 4/5pm) and everyone seems friendly/lively. I am ready to start my weekend. I don't see my friends at first so I walk to the back...I see them and then try to get a drink...I go back inside and ask the bartender if/when the back bar will open...I get a look (of \"what the f@##\")...and a scolding that it will open soon...I get my drink and move to the back patio. Patios are great concepts...and seem like a cool place to hang to get some fresh air...WRONG...this is where I decided I won't be coming back anytime soon. \n\nI get headaches/lightheaded around cigarette smoke...it was like being in a cloud in the \"open air\" patio. I was paying for it all night with my headache...plus my clothes smelled like an ashtray. I swear...it seemed like everyone in the back was blowing their smoke at me?? I mentioned the lack of \"breathable air\" to some of my friends and they agreed...we moved on to somewhere else (with a trail of smoke coming off my clothes).", "author": "Tom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "If it's sunny outside, I will be here, blacking out on Budlight. Look for the brunette floozy in the back of the bar with her eyebrows drawn on, that's me.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "Total neighborhood gay bar-- tamer than Badlands, more casual than Cafe or Blackbird, cleaner than just about all the other bars. Not as much of a good looking crowd here but I always felt like it was the perfect place to go with just one other person you really want to chat with because the noise level is just right and that back patio is fabulous!", "author": "Chris W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "Don't quite understand the appeal of this place. Its dirty and old looking and resembles a basement or garage. The bathroom is not private and shared with all genders. The back patio area is not that great in my opinion and anyway people are mostly smoking there which I am not interested in being around. It looks crappy. Why bother?", "author": "L. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "This is my go-to-bar when I want to drink....bartenders are friendly and they dont hit on you...;-)\n\nand they hook you up with alcohol.\n\nIf ever your here...call me...i will drop by ;-)", "author": "Malou C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-05", "description": "Usually love The Mix, but plan on boycotting it for a while, if you have friends from out of state don't go here because the bartenders don't know what other state IDs look like. My boyfriend just moved here from New York and the bartender wouldn't serve him because he doesn't know how to properly check IDs. It's part of your job dude to know what other state drivers licenses look like! So we just went across the street to Moby Dicks and had no problems.", "author": "Joey H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-24", "description": "I was there twice while in SF.  I had a decent time.  But the bartenders seem to be disconnected with the patrons I waited almost 5 minutes before he even acknowledged me. The second time I went I couldn't believe I was actually watching the bartender smoking pot with other customers  wow that was really crazy had a beer and got the heck out of there I don't live in sf so I don't know if that's everyone's experience but I wouldn't go there.", "author": "Art D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-16", "description": "you have to be welcome first then you will like. the bar staff wants your money , not you there.", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "I love The Mix! It's my favorite gay bar in SF. They have a great happy hour on the weekends, and even during the week PBR is only $3/pint. All the bartenders are friendly. And the best part is the back patio which has a second bar. It's huge and perfect for a sunny day in the summer or a rainy day in December.", "author": "Candice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-20", "description": "This place is the tits, cats meow, or whatever she said. The bartenders are all super nice especially Tessa also see biggest smile and brightest hair in the joint. There is an outdoor patio to bask in the glories of Castro weather, hello sunshine! And if you can't wait for the ladies room, there is always room to \"Mix It Up\" in the coed bathroom.", "author": "Janelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "THE MIX is a very chill bar. Its one of those places where everyone is welcomed and everyone would feel comfortable. The crowd, as well as the music, can be called \"eclectic\" at times cause like i said \"Everyone is welcomed\". Which can be good to some people... and NOT to others. Funny enough, theres always this guy here with a small dog running around the bar... I'm thinking \"OK... I guess...Work that little Puppy!\" Anyways, the decor won't win anyone over aswell, its a DIVE BAR not a GLAM BAR, but it has its charms. \n\nMoreover, the drinks are good and cheap! One of the bartenders, my fave at THE MIX, would always serve us large shots! They are almost the size of a double shot, and I'm like \"Damn!\" But I'm not complaining. Who I look like?? We all know that LARGE SHOTS = A DRUNKEN FUN TIME! So were definitely always by the bar drinking shot after shot, being a hot mess! I know I'll be dancing, I'll be dancing, tonight I'm not taking no calls cause I'll be DANCING pon de floor style... somewhere else though! Since theres no dancefloor here...it being a bar and all.\n\nBack to THE MIX We always manage to have a good time here, its usually a good place to start and get buzzed before a night of fun, crazy, non-stop dancing, and club-hopping. Its better than buying OVERPRICED drinks at the other clubs. Its CASH ONLY though so thats kinda annoying but apparently ALL of the BARS/CLUBS in the Castro street are CASH ONLY so thats fair... I guess. But STILL were in the 21st century!", "author": "Lorénz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "I frequent this place when I'm hanging out with my best bud. The patio is the only place where I've ever hung out at this bar, and even though I'm a woman, I've had a great time with friends and those around me...I've never really met a fag hag, nor do I think I am one...\n\n...as a matter of fact I don't think gay men understand women at all ^_^ heck I don't even know if I understand gay men very well!\n\nDEBBIE!", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-26", "description": "I really liked their outdoor patio area since it was gussied up for the holidays, so little rainbow lights twinkling along the rooftop. Heat lamped and such, so it wasn't chilly at all. Plenty of space to stake out a corner to talk with a date or with friends. Definitely less crowded than the Blackbird, but of course the cocktails aren't as interesting. $5 draft beers.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-18", "description": "So, in general I hate getting dragged to the Castro. I have a few gay friends so we comprise and come to the Castro once in a while. So I went here the other day for some mid-afternoon drinks. The back patio is pretty cool but I would have to say the crowd is a little bit older than a lot of the places I have been to before and not as good looking. If i'm going to hang out in the Castro, I want to be surrounded by hot fabulous men, and this wasn't quite the case. The back patio is pretty small and janky. If you want to enjoy some cockails outdoors to enjoy the day, I would suggest The Lookout or Toad Hall.", "author": "Raheleh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-09", "description": "Cool bar.  Wednesday afternoons I believe they have a charity pool tournament you can join for $5.  At least they used to.\n\nNice staff...Sloan the bartender is cool.  \n\nSmoking area out back.  \n\nGood place for 30-something queer folks (and older) and friends.  Not full of twinks (young gay guys) like Badlands, The Bar (aka B.O.C. for Bar on Castro)  and the Cafe are.\n\nYou can watch Ellen there and L Word also....But I wish they would turn the volume up when Ellen is on.  I love Ellen.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-27", "description": "My first night visiting San Francisco and my friend invited me to this bar.i had alots of fun..we was hanging out in the back patio and they had this HOT LATINO bartender working..i wanted to jump over the courtner and ripe his clothes off...lol\nThe bar it self was clean people there were was very friendly and the drinks was very cheap", "author": "Mike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-30", "description": "My friends and I were in the area waiting for a restaurant, and decided to stop in here for a drink.  \n\nThe crowd was friendly, but not rowdy.  The bouncer at the door was a nice older man, and checked our IDs with a little skeleton lantern. Points for cuteness + festivity.  Since this IS a bar in Castro, it's definitely not for everyone, but I didn't have a hard time settling in, despite not being used to it. \n\nThere was a $4 \"True Blood Margarita\" that night (10/29, so very close to Halloween). Upon closer inquiry, the special was revealed to be a cosmo, and we ordered a round.  It was strong, which was a nice surprise since so many places offer drink specials but just proceed to water them down so you really aren't getting much bang for your buck.  They also had $4 Skyy drinks and some other well specials.  \n\nWe stopped by again after dinner for another quick drink before heading to see a show.  The bouncer remembered us and chatted with us for a bit before waiving us on through.  At this point it was around 11:30 on Friday, but it still wasn't that crowded (although it definitely wasn't lonely in there!) and we were able to order drinks quickly and be on our way.", "author": "Vi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-20", "description": "Don't get me wrong, I like this bar for many reasons: the drinks are cheap and strong, the clientele is mixed and often unpredictable, they have a jukebox (which is a rare find in bars these days), there's a great neighborhood vibe here which I appreciate in a bar, and they also have a membership card that gets you drink coupons monthly (woo-hoo!)\n\nThe one thing that bothers me about this bar is how many issues I've had with the jukebox. Often there's a sign on it saying it's not working (which means the bartender is playing his iPod.) I found this out later when after seeing the sign taped to the credit card slot, I asked the bartender politely if the jukebox wasn't working or if it was just the credit card slot and he just shot me back the nastiest look and said \"I have no idea\" as he walked away. Then last night I put in a dollar (since there was no sign and the bar was pretty empty) and played a few songs and this same bartender commented to another patron about how he didn't like the music and that he was not surprised and to just look at us. That was rude.\n\nI've liked their other bartenders in general, and I like this bar, which is why I gave it 3 stars. I just don't really want to go back.", "author": "Allister F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "The first gay establishment I ever went to remains the best and my favorite. Nice crowd cool set up.", "author": "F T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "I really like this bar. But like all good things, I hated the few times going there. I went here one time a few years back with my ex. It was fun..\n\nBut yeah, this would be the kind of bar I'd hit on a Saturday if I was in the Castro and just talk to all the random boys on the patio. Then go to Delores park.\n\nThe crowd here is a lot of young gay boys...so gonna go where they are.", "author": "Lana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "Great neighborhood spot! Always a good place to take friends. Tho they have lots of beer busts, especially during Softball Season, I dig it. \n\nMy friend loves their slushy drinks, but we can always find something good!\n\nThe only let down was the sleepy people here during the World Cup. Do they even KNOW soccer?", "author": "Gina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "Came to The Mix on Friday night and it was filled with lots of boys and some girls.... pool table, music, a little bit of seating.... overall nice crowd with back patio for smoking and unisex bathroom.\n\nThe Mix has like a \"reward\" program for alcohol! I love that idea! Basically for so many drinks you purchase you can get a gift card/ voucher thing to use in the bar. They even give you a sticker that they scan for each purchase! Great idea!", "author": "Julie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "When I visit sf I always stop by the mix. Great bartenders and hot bar backs.. Sylvia is my favorite bartender, she is amazing. Great place to hang out and no drama.", "author": "Keith P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "Cheap, fun, divey, gay, straight, internet jukebox, decent booze selection...throw these all together, give a couple of shakes, and VIOLA = The Mix!\n\nLove love love it.  The crowd is great. The service is great. The atmosphere is divey - great place to start or end your night/day.", "author": "Erin V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "Truly the only gay sport bar in the Castro. With hints of Cheers mixed in with it.  Great neighborhood bar.", "author": "Titan Critic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "As I embark on my fifth year of living in San Francisco, I've already assembled a mindset of \"my favorite places.\" The Mix is my go-to bar, with that said; it is also my favorite bar. What I love about The Mix, is the loyalty it has to its name. For instance, If you go to Badlands, you'll most likely drown in a sea of top 40 mainstream gays who all have the same collared shirt from Forever 21. The Mix strives to be the complete and polar opposite of that. There's always a mix of a younger and older crowd. Twinks, cubs, otters and bears all harmonize peacefully in the beautiful back patio. The music isn't too loud and the lights aren't too dim, the ambiance is always just right. I really want to know who is in charge of the music, the play-list is always superb. It'll range from '80s to indie and rap to chill-wave, none of that crappy music you hear on the radio. The bar tenders definitely know how to pour you a strong drink, but I'm a sucker for their slush margaritas (no salt, thank you). If you're visiting San Francisco, I implore you to come mix it up at The Mix.", "author": "Joseph P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "I love this place, friendly, good drinks and always a MIXED crowd.  Great place in the hood.", "author": "EC N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "It's nights like this that I wish I was a cute gay boy.\n\nThe Mix. Tuesdays. Hot men everywhere. $2 frozen STRONG margaritas.\n\nYes please.\n\nInstead I get to play psuedo-wingwoman with my hottie little roommate and pose like supermodels when the tourists come in, see, and take photographs of a 6'2 blonde chatting up a 5' nothing gaybie on a heated patio with Scissor Sisters and Madonna playing in the background constantly.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-27", "description": "I am straight. Yes, I know I have made out with my share of women in drunken moments, but I am straight, I swear! That being said, I HATE going into a gay bar and either being labeled a \"fag hag\" or being relentlessly hit on. We are all just people, and I am not a fruit fly just because I have a variety of friends, nor am I \"curious\" just because I am in a bar that is predominantly lesbian. \n\nGet it through your heads people. I am not your arm candy, obligatory link to the straight world, sex toy, salt lick or any other number of things I have been mistaken for in some of the bars I have walked into in the Castro.\n\nThat being said I am happy to hang out on the awesome patio of The Mix. The atmosphere is great, the drink prices reasonable, they have  a pool table and it is a great mix of people, just hanging out with other people. I have never once felt like a salt lick here. Not once.\n\nI have felt like a complete freak magnet here, as there are a few crazies from time to time....but I feel that way everywhere. If you hang out with me enough you will understand what I mean.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-24", "description": "Typically have a decent time here, but had an unpleasant experience with unprofessional staff who really made the night end on a low note.  1:52 am, approaching closing, and a staff member said \"time to go\" and snatched a half full beer from my friend's hand. He then pushed him towards the door. We were standing talking peacefully, and it was incredibly rude. Will rethink coming back.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "Since moving to SF, I've learned a lot about gay men. First off, they're cool as shit. Second, not all of them secretly want to bone me. Lastly, some of them like to watch sports on tv occasionally. Now, I'm not talking about ice dancing or rhythmic gymnastics. No, I'm talking about \"manly\" sports. The NFL, NBA, NHL, boxing, college football, Nascar.\n\nLast week, I watched a part of the AFC championship at the Mix. It was crowded. People were cheering, and not only when Tom Brady's ass came on the tv. The right parts, like first downs and interceptions and stuff. The Mix also has a nice shaded back patio with tiki torches. It almost felt like I was at a straight sports bar, until I saw a dude sitting on another guys lap. I dunno, maybe they were working on their center to quarterback exchange. \n\nOk, so I admit that I've never actually met a gay man who likes Nascar. But then again, I don't know any straight men that watch rhythmic gymnastics either. If there are any, I bet they would hang out at the Mix though. 4 stars.", "author": "John T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-31", "description": "Cheap and easy. Just how I like it.\n\nIt's just a bar with a mixed crowd... nothing spectacular. Drinks are pretty inexpensive so it's a good place to pre-party before heading to the club... back patio is heated and not too noisy or crowded. Music depends on who's money is in control of the jukebox!\n\nYou may or may not run into someone you know here. Actually you probably will.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "When I started working in retail, I fully expected the occasional overnight shift. I planned to bring a lunch, my ipod, comfortable shoes, a sweatshirt for that late-night chill that can creep up on you. But then a certain woman, who was also my supervisor, strolled into my life. \n\nShe's a pinch of crazy mixed with some ex-gangster (no joke there) street cred and an unparalleled adoration for the life of a gay man. She also can't say most names correctly, and if she pronounces it wrong the first time, she'll most likely never get it right. \n\nTherefor, it could *only* be she who would ask me, after 9 hours of pm -to-am labor, if I was up for \"The Mix at Six.\" I didn't know what that meant, but seeing as who was asking me, I knew it would probably be something I didn't want to tell my mother about. \n\nSo my first and some of my only experiences with the Mix have been at 6am, when we were by no means alone in that bar. There were a few regulars, some people who looked as though they hadn't been home in days, and a man overly eager to compete with my supervisor in a game of pool. Classy broad, that woman. And she turned me into one swell lady myself. But at least we had worked through the night and were relaxing afterward... my other friend who woke up early just to join us borders on being an alcoholic.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "I have been trying to find something different to make my 200th review - something surprising, different, and uplifting... I guess The Mix fills that bill.\n\nHaving lived in the Castro for some 15 years, I frequently bemoan the lack of good quality bars restaurants and stores. Sure, if you are 20-something and/or gay and/or male and/or a Swedish tourist, you will probably enjoy the charms a packed meat-market bar with a dance-floor followed by a slice and some mediocre pasta and trip to the video store (the one next to the all-lube store - no not that all-lube store, the other one). \n\nI must admit that when I was a tourist (albeit, not actually gay or from Sweden - England, actually - I know, I get that a lot!) I did revel in  the insanity and debauchery of many of these establishments, but these days I look for a steady down to earth bar where I can knock back a few and laugh of the woes of the week.\n\nThat's why after all these years, I was pleasantly surprised when I finally ventured into The Mix. I guess you can't judge a book by it's cover as I had always taken this place, peering in from the outside, as a cramped and sweaty all-boys, all-the-time action bar. \n\nBut what do you know? While the joint sits firmly and proudly on it's gay-bar monika, it is simultaneously straddling the cozy-local-bar mount. There's plenty of booze, TVs, pool tables, and welcoming bar-staff. There's a bright and breezy conservatory out back and the drinks are reasonably priced. \n\nThe night I first went, there was a tequila promotion going on and free mini-daiquiris for everybody. WooHoo - what a pleasant surprise all round! I love this place! They don'y mind a bit if you're not from Sweden!\n\nA word to the wise for the ladeeez - there isn't one! Ha! But you are quite welcome to slip in past the urinals and use the stall in the Gents! I am not kidding!", "author": "Kingpin X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-01", "description": "If you had told me I'd be at the Mix at 6am, STILL drinking, with the most adorable barista from from my favorite Starbucks, I'd have said BULL.  SHIT.  But it happened.  At The Mix.  At 6am.\n\nMe, Starbucks Guy, his friend, and the staff of a certain bar also on 18th St. shuffled over to The Mix as the party we were at across the street was winding down.  As daylight filtered in through the front windows, we defiantly kept drinking and shooting pool.  \n\nWe\nwere \nunstoppable.\n\nThe bartender was a real gem--far more pleasant than one would expect at 6am on New Year's Day.  The drinks were strong enough to keep my drunk going for another few hours, and the jukebox was full of great music.  I had more fun than I ever thought possible during the early hours of the day.   \n\nAND they have \"Oh Sheila\" by Ready For The World on their jukebox...4 minutes, 2 seconds of audio gold.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-20", "description": "Drinks are strong and cheap. The clientele is the least enthused. \n\nIt's a good place to go when with friends and want to start the night out with some good drinks before you go to more appealing destinations. I've found that the overall crowd is steadily aging though. About a year ago it seemed about 10 years younger and now it's acquiring the same demographics as 440. \n\nThey have a patio as well, but it's barely open - they should remedy this.\n\nOh, and there's never a cover. Score.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "Drama! Everytime I'm here I seem to get into text-fights w/ Ramo...to the point where my fingertips ache.  He seems to think I'm doing a \"toy\" which is silly Tagalog slang for what you or I would consider a booty call.  This is not a reflection on the Mix, rather one of silly Pilipino voodoo superstition, gossipy apparitions and me apparently not answering his calls in a timely fashion (definition: before the phone actually rings.)\n\n\"Sorry baby...but the Mix plays the jukebox pretty loud.  I never heard the phone.\"  \n\nConsidering there's the vibrating feature on my phone, I'm told that this is not an acceptable excuse.  Fine...next time I'll set the darn thing to vibrate and I'll pee my pants when he calls me.  \n\nLove you baby...really I do.\n\nOh, I dig this bar.", "author": "Mc Matty b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "I love the Mix.  As someone who enjoys playing poole and being out early in the morning, I don't think I've ever been to a better spot.  Bartenders are all awesome, and the outdoor patio is great if you want to get some sun and have a quick smoke.  \n\nAt night it gets a little hyphy so watch out!  Sundays are a blast.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-01", "description": "I love me some Mix, it's always just what I need.  The crowd is oh so nice, the pool table is always being used, the back porch is clutch, and the drinks are good.  Mind you this is not what I would consider a pristine bar, but it's great.\n\nOh (and I never do this, but she was just that good), if you go and there's a blonde chick that quasi looks / acts like Pink go to her.  She'll be the best lay you never had.", "author": "Girls Named Cherise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "This is a good place to unwind with friends. They have pool in the main room, but there is always someone using it, so good luck on that. I remember this place used to get super busy, where pool sticks were bound to hit someone in the eye, but a few months ago they've placed a much lower max capacity, which tends to fluctuate. Sometimes they make you wait to enter when there are barely any people inside. And other times the place is completely packed.\n\nDo they have different max capacities for different days of the week? The person stopping us didn't say why we couldn't go in when there only a few people in the bar, which you could obviously see. That was kind of blah...\n\nBut besides that experience, I've had a good time at the Mix. They have a really neat outdoor patio in the back with heaters in case it's cold. And they have special dollar off drinks depending on the night of the week. $3 pint for people who work in the Castro is really nice. I ordered the Summer Ale on tap and it was delicious with the perfect amount of head. :)", "author": "Xavier G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-09", "description": "Sssshhh!  \n\nDon't tell anybody about my favorite little gem of a patio bar tucked away around the corner of the heart of the Castro!  We don't want the rest of the world coming in and crowding us out.\n\nWhere else in the Castro can you hang out with your friends on a heated patio, drink your beer, smoke your ciggypoo AND eat your hamburger/veggieburger/chickenburger, fries, taquitos, jalapeno poppers, onion rings, etc?\n\nTHE best place for a Martini or Manhattan or Cosmo.  The secret(s)?  Sylvia, Nicole and Sloan.  The gals make the best mixed drinks.  The guys are good, but nobody beats Sylvia's Bloody Marys.  Soooo tasty!  Actually, most of the guys that work there are pretty tasty looking - and friendly too.", "author": "Drew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-08", "description": "The back porch really makes this bar... but more than anything is the fact that I can bring my dog, Bumper, along with me to the Mix anytime... and he really loves the bar (a bit more than me, I think).\n\nPerhaps my favorite part of the bar right now is the holiday drink specials... which feature everyones holiday favorite... a hot buttered rum (wow, do they put a hell of a lot of butter in that or what... time to go to the gym... again... that and NEVER need chapstick after drinking one). \n\nLove it.", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-30", "description": "I love the Mix.  This has been my favorite Castro bar for years.  The management knows what they are doing.  The staff is great (though sometimes moody, but who says the patrons aren't sometimes moody).  When it is good, it is good!\n\nThe crowd is friendly, and you'll feel like you have a friend.  Unless you are a psycho, then, like everywhere else, people will avoid you like the plague.  Same at the Mix.  If you're friendly, they're friendly.\n\nAs to the Patio, it is the best part of the bar.  A recent commenter said it is \"barely open.\"  I don't find that to be the case at all.  Unless you are there between 6 and 10 am (Yes, they open at 6!), or after 10 on a week night, the patio is closed.  Otherwise, it is good times in the back!\n\nThanks, Mix, for great times over the years!", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "$3 Tequila Slushy. Flavors include Lemon, Raspberry and Strawberry. \n\nArriving at 11:00am for a slushy and seeing tranny messes on the patio was the perfect way to start the afternoon. But the kicker was returning after a long day in the park at 5pm and the SAME tranny messes were still there. \n\nI could live in San Fran, I really could and the Mix only adds to my love of this neighborhood.", "author": "Tyler J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-23", "description": "The sign of a good bar is one in which you have been there more than once and yet you can't give a good review. Is it because you had so much fun with your friends that you don't get into the surroundings? Is it because your drunk? It is bc it is a good bar with little fighting and few bitchy bartenders? hmm not sure. \n\nThis bar has a back patio - which is great to get some air, smoke (not me people - those are cancers sticks)  and not breathe  in the smell of sweat. The girl at the back bar Friday night was awesome! She was fast, nice and didn't F up any orders. Also, we changed our mind a few times and most bartenders would give an eye roll - she totally put up with us. Great prices - we had 4 drinks for $17!\n\nThis place would get 5 stars IF: \nTHEY CLEANED THE BATHROOMS (horrendous bathrooms -  hold back breaking  the seal as long as possible) and if,\n there were straight hot men for me...", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-22", "description": "Truly a cute little neighborhood bar.\n\nI love that they have their back patio - it is essential to sunny and bright days during the weekend.\n\nThere drinks are average priced, and I don't think I've ever had to ask them to remake a drink (if it's not poured and mixed correctly, I will - and have - but not with this place.) \n\nIt's cool because you can pretty much request your own music, via Jukebox, and play some pool inside. Or you can step outside and listen to whatever music, enjoy the weather, laugh and giggle with friends, enjoy a tasty cigarette, and if you come on Sundays...they make a pretty decent burger as well. Always nice to soak up the liquor!\n\nAll in all, a cute and fun place. Definitely check it out if you haven't already. :)\n\nAside from the great environment, they are constantly holding great fund raisers for people in the community - local sports teams, people running marathons or doing the Life Cycle, or any other number of amazing and worthy causes.\n\nMy favorite moments are when the entire back patio breaks out in song. Oh, you think I'm kidding? Just this past Saturday they were playing the \"Grease MegaMix\" and everyone (gay and straight) sang along, while a few of us (yes, I'd be one) did a little dance in place. It was quite wonderful and truly memorable, and I can say that it's only places like this that it'll happen. LOVE IT!", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-10", "description": "I got drunk.  I think this place had something to do with it.  How did I get home?  I don't remember walking?\n\nThe crowd was very unattractive but for some reason got better and better looking as time went by.  Was it the booze?  Yeah. It was the booze.\n\nThis was a great place to lower my expectations before going to scablands.  Made it seem like I was walking onto the set of a model shoot there.\n\nI know for a fact I will be back.  The people were friendly the drinks were strong and the bartender out back was a hoot.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-01", "description": "Cute neighborhood gay bar in the Castro. No attitude and really strong drinks. the back bar is thebest area to sit outside and get drunk:) \nLike Juan L said-- yea if you are pee shy hmm go somewhere else as the urnals are almost facing everyone as you go by! and the sink is out in the open bar area.. trashY!!", "author": "Christian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-15", "description": "Oh, what memories this place brings! \n\nThe bartenders are excellent drinks as far as cocktails-in-a-bar go. My absolute favorite part of this place is the back patio. It has a \"tent\" feel to the patio - you gotta go to understand. It's also heated. BIG plus on the cold SF nights.\n\nNice size, I would say. The crowd is of the 25-45 range. What a great place to just chill.", "author": "Sharelle W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-08", "description": "so so.......not really a super hip vibe but there are some cool peeps there on the weekend starting off the night.\n\nBeware of spme of the bar thenders they think their the end all be all of bartenders.  (serving 3 dollar frozen margs).\n\nThe outdoor patio is great tho on a nice day. :)", "author": "Fred R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-20", "description": "Really DIG the hidden back patio. Great happy hour specials. Pitchers for 6 bucks. I almost thought I was in college with that deal! Bartenders were WAY cool and accomidating to my boy and I. Our pitcher was half full when the keg went out and he just gave it to us. One and a half pitchers for 6 bucks? Yes Please! The back patio has heat lamps for those cold nights, and we were lucky enough to catch a drunk tranny mouthing off to a big queen/diva. Was that good wholesome SF entertainment or what? The table next to us were burning bowls throughout the night and nobody seemed to mind. That's always a plus! Good spot to chill and have a drink. \nP.S. Girls/Boys share a bathroom stall with a locking door. So if your to nervous to pee in public, you may want to take a potty break before you come.", "author": "monika l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "this place would be the chillest bar, i say. chill crowd and chill environment.. pretty small though but i don't mind.\n\nwhat's interesting is their patio. patio is where everyone stays since inside is where the oldies are. everyone would probably feel inclusive coming in since you can see a whole mix of different people. i mean, it's called \"the mix\" for a reason, no?", "author": "Marc K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-02", "description": "I wish the patio wasn't always so crowded, some nights I'd really like to sit and smoke, but most of my visits have found standing-room-only crowds. 'Course, I could always not smoke and hang out near the pool tables, but that's not as fun.\n\nThe crowd is more accessible and friendly than any other Castro area bar I've visited, but I'd reccomend bringing a friend along anyway. Most of the people I've encountered here travel in herds, so it's not easy to visit when you're alone.", "author": "Jere K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-29", "description": "I've only been 3x, granted 2 of the bartenders are obnoxious and rude, I still dig this place. It's a place you can meet good people, young and old.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "A very unpretentious gay bar in the Castro. The Mix refers to the crowd and in my experience it's always been a pretty good mix of diverse people. Drinks are fairly priced and they have good Happy Hour specials. The back porch is the place to be, though it can get a little overwhelming with smokers. But if they have the retractable roof down, more circulation happens. A laid back place that I enjoy often. Perhaps a little too often.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "Oh I love this neighborhood spot.  Quiet-ish, great patio, locals, good drinks, wonderful and perfect.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "When they call themselves \"the neighbourhood bar,\" they mean it: it looks quiet and unassuming (and TINY) from the outside, but enter and it feels like EVERYONE in the Castro is at this bar - it's packed from Friday afternoon to Sunday night. Everyone from the trendiest twink to the lustiest lesbian pops up at the patio for a drink or a dozen, and even random straight kids such as myself will feel welcome.\n\nI just wish it were a little bit bigger to accomodate all those people - I mean, yeah, we're all friends here so I have no objection to getting up close and personal... but I'm small (height-wise) and always get crushed in between two muscle daddies (who clearly aren't interested in me anyway). But besides the space issue, I always have a blast - this is one of the friendliest bars in one of the friendliest neighbourhoods in San Francisco, and there's always someone cool to chat with in addition to the already-cool friends who bring you here.\n\nAlso, the mixed-gender bathroom (stalls and urinals) provides for some hilarious repartee when you're a stall-using straight girl in a crowd of sassy, urinal-using gay guys. And how adorable is that banner in front that features people all holding martini glasses?", "author": "Joanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "Let's be honest - this place is a total dive. The pain is falling off the walls, the floors are concrete and the back patio furniture looks like it's going to collapse at any moment. \n\nBUT, unlike many other gay bars, you won't find a hint of pretentiousness at The Mix. Guys aren't there to cruise or look you up and down and give you that \"God, he's fat\" eye-roll. The Mix is a simple and honest place to meet friends for a beer or two. Is it a great place to stay all night? Definitely not. I'd suggest grabbing a few drinks at The Mix and heading to The Cafe for dancing (Badlands is SO over). \n\nIf you venture out to The Mix, check out the tranny regular. She/he is pure entertainment. She speaks in some foreign alien language no one understands and I don't think anyone really knows where she comes from. Amazing.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-15", "description": "Without the back patio, this bar wouldn't get my attention.\n\nMy friend and I stopped in for a beer yesterday and we perched ourselves on the bench, soaking in the sights and engaging in a very deep conversation about San Francisco gays.  He was approached by a very aggressive man who made us both a bit uncomfortable, but I guess that's the price you pay when you're a cute 22-year old (my friend, not me).  \n\nOn our way out, I stopped to talk to a friend who was near the exit.  This scary old man who sometimes stalks me punched my friend in the side when he walked by us.  I guess he thought we were together.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-10", "description": "Great Location and the Crowd is very good. You can either hangout and have a drink or play a game of pool.  The staff was very pleasant and when it took awhile to change a keg, they were very nice and made up for the wait.", "author": "Rix G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-13", "description": "This place is great. Classy, busy on the weekends (but not TOO busy) roomy, great drink variety, and a lovely back patio. The bathroom is interesting. I guess the biggest plus of the evening is my new friend who one of the bartender's has a crush on. He supplied me with a variety of good, free, STRONG drinks all night long. I can't complain.", "author": "Natalye R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-24", "description": "There's usually a good crowd and you really can't beat the location, BUT that unisex bathroom is super disgusting!", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "I've always liked this bar, and I think I've seen at least three name changes in the past 14 years.  The bartenders are always nice and friendly, and the drinks are poured reasonably well (like at the Eagle in SOMA). The crowd is friendly to people they don't know, and the best thing about this bar is the small pattio in the back.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "As a hag to a, well, a gay man, it all began on a Wednesday night in June.  Ever since then, I often come here late at night on Wednesdays and occasionally Friday/Saturday nights.  The bartenders are ridiculously nice, almost to the point where you have to wonder if they're working you for tips, but it doesn't matter as they always end up giving us free rounds because we return the ambiguous, friendly favor with our, well, our generous tips. The drinks are heavy on the sauce, so I stick with MGD (if I'm driving) and it's entertaining to see which way Nick or Gil will open my bottles.\n\nThey have a jukebox with all of the classic songs as well as modern-day radio shit; a pool table that is always in use; touch-screen video games; and a nice little lounge area surrounded by blue lights.  My favorite thing about this bar (aside from the bartenders) are the coat hooks. They're everywhere!  Any bar with a place for my purse and my bffs' murse is fine by me.  The back patio is a decent size, enough to fit at least 30-40 people (as was the case the whole weekend of Pride) and it has a nice cozy, private lounge across from the back bar.  It also has gas heaters, televisions inside and out, and retractable awnings.  It is often used by us smokers, so if you're looking for a smoke-free patio, I'd suggest you take your pink lungs and look elsewhere.  \n\nAs far as the patrons go, its the usual kindness you would expect from drunk people - easy to mingle with anyone of all ages, especially if you, a gay man, wear plaid.  As far as the women, occasionally you will have your group of lipstick lesbians who make fun of everybody.  By everybody, I mean they will directly talk shit about you, your friend(s), the bartender you ordered from, the guy you were standing next to, the guy he was standing next to, and the air that you, \"all aren't worthy enough to breathe,\" all within a 11-inch radius of your ears. It makes for a good laugh to know that they want to think that they're giving everyone a hard time, even though they aren't, because they're THAT insecure and attention hungry.  Aside from the lipsticks, you have your friendly scissors, hags, and supporting straight men, so its easy to not feel out of place, whatever sexuality you are. But then again, that's just how the city is. \n\nOh, and did I mention the fish bowl full of free condoms?", "author": "shannon s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-24", "description": "This bar (formerly Uncle Berts) is one of the few bars in the Castro that is woman-friendly, and one of two that isn't owned by either Les Natali or Greg Brownstein. (I never really understood why those two would buy up every bar, and make them exactly the same, and have them cater to the exact same clientele.) The drinks are reasonably priced, and the bartenders (the ones I know are Sloan, JR and Sylvia) are friendly, down to earth, not pretentious, experienced, and know their drinks. Many of the regulars are friendly, grounded people...\n\nTip your bartender! And if you've been tipping $1 a drink for 20 years...I hate to break it to ya, time to raise the tip...it's no longer considered an excellent tip....", "author": "Nick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "Um.\n\nGoing to the Mix is like going to some gay man's house who knows how to party.\n\nThe whole bar is half taken up by a bar. One to your left as you walk in and another one on the patio.\n\nHad a delicious time here on Pride, just being able to mix it up with the crowd. The crowd was off beat, but it was nice to see the faces of the neighborhood. The music didn't stop (well it did a few times with the shotty sound system) but the inebration from the strong drinks held down as a capable filler.\n\nI'd go when it's busy however, if you stumble by and it seems empty - it might seem more dive-y then a party. \n\nNote: The jukebox here blows.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "Great vibe! Reasonable drinks that are stiff, strong and promptly served. Cool hangout place complete with covered patio, outdoor bar and heat lamps (an SF necessity!). Friendly bartenders and very pet friendly! Great music, especially on the weekends! Fun happy hour place to hang out, unwind and just chill with friends!", "author": "Joey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-28", "description": "This is the grown up more mature cousin of The Bar on Castro. Mostly 30 to 40  something guys hanging out in the back patio chatting it up and cruising one another. The patio is definitely  the main attraction especially on the weekends when it is sunny.  There is a bar in the back patio  and they have a grill where they sell  burgers or barbecue on certain nights or on the weekends. (never had the food) \n\nInside there is a long bar and a pool table but not much room to shake your botty. I usually stop by before going to the B.O.C.", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "I like  this bar is olways something new n new fgaces , plus strong drinks, friendly stuff good gender mix  crow,  freindly for  your four legged  freinds  too :).  cheers!", "author": "Mauricio R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "Fun local bar... a great \"Mix\" of gay and lesbian people, and straight... a little bit of everyone... would have gave 5 stars but I dont smoke and the patio sometimes reeks of smoke...", "author": "chris c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-27", "description": "A good place to grab a drink before heading elsewhere.  I like it because the drinks are good and cheap, bartenders are friendly and you can smoke outside on the patio.  I don't like it here because it \nkind of smells funny and can get really crowded.", "author": "Valerie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "I came here two days in a row. Once on a Friday and then on a Saturday. I came here with a friend who frequents the bar and we hung out inside and outside. \n\nIt's strange going there on guy nights and being a straight girl because a straight guy will probably hit on you. But all in all, I had a great time. Lots of laughs especially when you're waiting in line to use the restroom. Only one stall and a couple urinals. Not the cleanest thing in the world, but when are bar bathrooms ever squeaky clean?\n\nBest thing is to get drunk and walk across the street to get some pizza at 2am. :P", "author": "Grace L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-27", "description": "The bartenders are moderately unattentive.  The drinks are... drinkable.  The inside bar area is crowded and when it's busy there is clearly not enough room for people AND the pool table.  I'd give all that 3 stars.\n\nThe 4th star is for the patio.  The thing that makes this patio better that the Pilsner's on a hot Saturday afternoon:  the fan that mists water into the air, thus making everything a little moist and a lot cooler.  \n\nIf it's not a hot Saturday afternoon or if you don't particularly like water spraying fans then stick to the Pilsner.", "author": "LeSLiE W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-10", "description": "The Mix is my new favorite Castro spot after they closed down The Pendulum (that FagLands asshole!). It's women-friendly, the gals working at the bar make pretty tasty drinks (nevermind the bartender guys, they're pretty high on themselves and their twinky bodies...specially that shirtless douchebag. *looks at douchebag*), there's a patio where you can sit down and eat some American grubs like a cheeseburger or some jalapeno (alt+164) poppers.\r\n\r\nThe crowd is rather mixed. Specially towards the end of the week, when some brown and asian folks will come out. I'm just happy to see people who don't necessarily look like your typical Castro clone. There'll be chunky guys, tall guys, short guys, guys in their 20's, 30's and 40's... all behaving properly and having a good ol' time. And not many old guys either, thank God. No offense, you daddies out there. But sometimes it feels like if it's not the gym-bunnie/Abercrombie ficticious TV-shit, it's grey haired hairy men who'll grab your butt at random.  The Mix is NOT that. And that's what's been making it special recently.", "author": "Tomas V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-25", "description": "One of the best bars in the city. The bar exemplifies a neighborhood bar even with its large(r) size.\n\nIt has great drinks specials and constant fundraisers for the LGBT community. \n\nA go to place!", "author": "Art A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "DRINKS are STRONG! \n\nAfter lunch my friend and I had to walk our lunch off. During the walk we got thirsty and we looked to our right...there was The Mix. We ordered two vodka tonics and it was soo worth the money. Bartender liqueured me up at 2PM.", "author": "K L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-08", "description": "Aaaw, the memories, this was a while back, but felt like just yesterday. I can never forget the Mix:\n\nMy friend had just come back from college and a group of 3 of us went out to the castro for dinner and celebrating. After dinner and dessert, went looking for bar for a quick drink because my friend was really craving a martini. \nWell, one martini turned into 2 and 2 into 3 and a long island, & a tequila shot....so we went over and turned on the jukebox, switched on Lady Marmalade and watched the whole bar come alive, singing, dancin and everything. \n\nWe were in the chill spot in the back corner chatting it up and dancing with a couple of guys when I got a tap on my shoulder. \"You girls have gotta go.\" I chuckled and continued my conversation ...I got tapped again...\"You girls have got to leave, like right now\"...It then dawned on me, \"this man is serious and talking to me and we are getting kicked out, oh shit\".....In shock we got our stuff and left...\n\nI had a great time there, the drinks were cool for the size and price, the people friendly for the most part...just sucks for getting kicked out because we got the party started but oh well....", "author": "Maya L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-24", "description": "Only once or twice have I graced the wooden halls of the Mix in the castro, and I have to say that I have left intrigued each time...but never do I make it back. I think I will attempt to do so, since I need to get hit on in some capacity.\n\nThe space is actually pretty decent in size, with a lot of room in the front...it never gets crowded like badlands or the BOC, but it has it's own following. The back was really cool, when I went they had some little party thing going on and were serving drinks.\n\nThe people were cool...the staff was nice and I really liked the atmosphere. I will visit this place again and update this review....5 star potential.", "author": "James J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "I love pre-gaming at the Mix, because despite the 'tudes of the bartenders do display, they always rock out my own signature drink, which is not easy to make. SOME of them even remember it by name...so ask for a Poison Apple sometime ;)\n\n\nI haven't really spent -too- much time here..but I did get randomly made out with by two really hot guys...which is more than I can say in kissing ratio to any other bar. The Mix is a chill joint to hit up if you arent in the clubbing mood.", "author": "Rylan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-28", "description": "Just your average boring little neighborhood bar with good prices on strong drinks.  Bartenders are super nice.  Was there twice over the last week with some friends who live there in San Francisco.  The second time was not as crowded as the first time and reportedly the Fire Marshall had been there the night before with some enforcement about capacity, so we had to wait for a few folks to leave before we could go in.  Once inside, it seemed nearly empty compared to the first night.  \n\nOnly thing unusual,  there seemed to be a high percentage of men there.  ;)", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "This place is great and draws a pretty groovy crowd. They've got pool inside and there's a great back patio. Cute guys too.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "4 stars! went on a crowded sat night, met up w friends that were visiting from LA, had an incredible time! 4 stars, even after having my iPhone stolen out of my purse!", "author": "Enjoying Each Momen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "Very Cheap! You can get drunk here for very little money and the crowd is neither sketchy nor looking for hook-ups. Very relaxed atmosphere with outdoor patio that is heated and covered during the colder times. People can smoke on the patio, which is kind of annoying as a non-smoker, but can deal with it. Bartenders are very nice and the drinks are big and deceivingly strong. Perfect go to place to start your night before you go somewhere else to dance.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-20", "description": "There is never a dull moment at the Mix. Friendly folks, stiff - STIFF - drinks (guess what I get) and the prices are oh so reasonable. My partner in crime, Valerie, and I have decided that this place is our default bar. When I say meet in the Castro, we just assume there till we decide to scoot elsewhere. \n\nThanks Mix for making a pretty shy gay boy feel welcomed.", "author": "Allen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-18", "description": "My friends and I go to The Mix pretty regularly (enough to at least know why everyone in the bar yells 'Debbie' whenever someone breaks a glass).  It's a good, chill spot to start a night out in the Castro, or have a drink on the patio on a sunny weekend afternoon.  Sunday beer bust can be fun and is a good deal, but gets fairly crowded.  Like most Castro bars, no credit cards are accepted so bring cash.  Drinks are very fairly priced both during and after happy hour, and you most definitely get more than what you pay for on the mixed drinks!", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-26", "description": "Aw...this was my first castro bar ever. I loved it then and love it now. Its a nice change from the the normal bars that the gays usually hit up. Fun mix of people, pool tables and cheaaap drinks. I love the patio and the larger bathroom. I was satisfied with the other one but uhh,,,you know. Its kind of small inside(which is the running theme with some of the 'stro bars) but make friends and smoosh together. its worth it.", "author": "Spencer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Lately I've been feeling a little depressed. Don't worry, I'm fine and I have no inclination to throw myself off the GG bridge and the eye makeup isn't running down my cheeks yet -- besides I've never been one of those perpetually peppy people who always accentuate the positive -- but I kind of want to go to sleep for a long time, like FOREVER. Know what I mean? Maybe it has to do with my broken penis pump or longing for my immortal beloved or my usual post-Pride crash but frankly I feel like a fucking leper. I mean, shit, my self-hatred is even outpacing my misanthropy and everyone knows that rarely happens. Robert Burton told me the Ancient Greeks had a word for this -- melancholia (black bile) -- then devoted over a thousand turgid pages to chronicling it. Personally, I prefer the less-clinical FUCKED IN THE HEAD. I know you're saying: THAT'S WHAT YOU AND YOUR ASS FACE GETS FOR WRITING SHITTY REVIEWS, MONKEY BOY! And: cry me a river! Like you're the only one who's felt like that! To which I say: fuck you. And: WHERE'S MY ZOLOFT/STOLI/TWINK PORN/LOADED GUN?\n\nSo in an effort to exorcise the emo demon, some friends brought me to The Mix for booze and boys since the best way to cure problems is by becoming an alcoholic who will bone anyone with a pulse. Also, Jesse Helms just passed and I wanted to celebrate his contributions to society by possibly giving some hot male ass a tongue bath. We passed the interior bar, the pool table, the plank benches, and made our way for the second bar on the back patio where the smokers congregate under gas heaters. It's not my favorite bar in the world, but the drinks are fairly priced, the pours are steady, and the folks aren't full of themselves unlike a lot of the other Castro haunts. I sat there, Tom Collins in hand, inhaling second-hand smoke, calming my nerves and feeling better about myself, when I noticed this guy across us staring at me.\n\nMe [to Friend]: Hey, see that guy?\nFriend: Which one?\nMe: The one in the blue hoodie, brown hair. He's on the other side of the patio, smoking. Kind of to your right.\nFriend: Oh yeah...Oh shit, he's totally checking you out!\nMe: I know!\nFriend: So?\nMe: Well, he's pretty cute.\nFriend: Yeah, so go over and talk to him.\nMe: Huh? Shit, you know I stink at talking to strangers. Plus I feel retarded right now.\nFriend: Yeah, yeah, yeah, whatever. You're fine. Look, he's clearly looking at you. Over half your work is done.\nMe: I guess you're right\nFriend: Fuck yes I am. GO! [nudges me in the side]\n...\nMe: Hey.\nDude: Uh...hey.\nMe: I'm Darin. What's up?\nDude: I'm R______. So, Darin, aren't you that crazy gay guy on yelp?\nMe: Um...yes.\nDude: Yeah, that's what me and my friends thought...OKAY, it's getting chilly out here, I'm heading inside. Buh-bye.\n\nWHAT THE FUCK?!? AAAAAAAAAGGGGGHHH!!! DO YOU THINK IT'S TIME FOR ME TO TONE IT DOWN?!?!", "author": "d s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-30", "description": "I liked this bar, very low keyed ( at least when I was there). Good Drinks and a place to drink and talk. The music was not that loud, so you weren't shouting at each other. They have a patio too with a bar, so you can order drinks out there too and not come back inside.  I would go back too.  Pool table too. Also mixed crowd girls and boys...", "author": "Susie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-01", "description": "A friend of mine dragged me to his side of the sandbox last night and suggested this bar because it has a large outdoor patio. I am usually resistant to crowded places, but this wasn't too bad. Because of the heat, we had their frozen margaritas, which were kind of pricey at $8 for a tall, but they were pretty strong, so there you go. Alas, the most memorable part of this experience (for me) was observing the preparation of one of their house specialty shots ... the \"Ovarian Burst.\" It looks just as disgusting as it sounds -- plus contains butterscotch liqueur, which is even more vile to me than the gelatinous bloody clot floating inside the shot glass. My buddy was upset because a really butch lesbian was wearing the exact same outfit he was, but looked so much better than he did. Who says a night in the Castro can't be entertaining?", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-31", "description": "Friday night happy hour, and if it's cold, the two kerosene heaters will be blazing hot and the roll-back tarp will be closed---Otherwise, the open patio has a nice SF garden feeling, stuck between all the buildings like it is.  It's nice and crowded on Fridays so we like to get pitchers of Stella or MGD, to reduce the need for trips to the bar through the Happy Hour traffic.  Even though the music can be inconsistant and sometimes non-existant, I usually don't care because it's a great place to hang out with friends and catch up.  Alas, for the Uncle Bert's days; but life is change, and Mix is still my favorite spot in the Castro.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-10", "description": "I just read there is ladies night on wednesdays, so i may check that out... i went here for the first time last night (a saturday).  it's bigger than it looks, because they have the largeish patio out back. it wasnt too crowded - we got there at 11 something maybe? and got a table.  this is not a place where you will find many cute people, men or women, (except us) but everyone seemed to be having a good time.  the music was pretty quiet. i guess u can get food there too.  i'd stopped in there once solely to use the bathroom and i like the weird slidey door. they also have pool tables. i'm just not a bar person. so, its ok. good for meeting friends before you go someplace i guess. and i will eventually check out the ladies night. cuz well, there's ladies, and i dont have to wander far from my house to see them. lol.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "They pour the drinks really strong here.  They have specials every night and long happy hours, until midnight on sunday.    \n\nThe patio is always very crowded.  You can bring your dog, but I think it is a little too crowded and rowdy for a dog to enjoy it there later in the eveing and on sundays.  It is a good mix of men, friendly, all types, with very few women. \n\nLike most gay bars, the music isn't really my style, but they throw in some Yeah Yeah Yeahs between the thumpy gay boy music.  There is a jukebox with a decent selection.", "author": "Carla K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "Oh, The Mix. This was my replacement for my 'default' bar when I moved out here from Indianapolis. It is ordinary and about 80% predictable- both in very good ways. It is the type of bar you keep going to because you know you'll see the same people. So don't be a jerk or walk around like you own the place, because everyone will remember.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "A lovely heated patio to meet old friends, and make new ones. Fair warning that there seems to be a higher than average ratio of batshit crazy patrons, but really--that just adds to Mix's charm.", "author": "Tamara B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-19", "description": "The Mix is normally really dirty.  When I walk in, I feel like I shouldn't touch anything.  The reason I do enjoy the Mix is because I strategically use it to my advantage.  If I'm looking to smoke a clove or something and it's \"too cold\" to stand outside without a jacket, then I'll hit up the Mix because there is no cover, and you can smoke in the back area that is tented and has gas heaters.  The bartenders didn't seem too knowledgeable, but the drinks are stiff.  All-in-all this bar is alright, but it isn't the best place to go to on Castro.", "author": "Brent A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-28", "description": "They have a smoking area and I always feel like I am getting ripped off for some reason when I go here, it is a very friendly homey bar and I like it but there is something that I dont like about it that bothers me in my mind grapes.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-14", "description": "I like this place because the cruising queers aren't here.  The folks are generally people who want to shoot pool, have a good drink and be around friendly company.  It's a nice oasis away from the madness of the other places in the area.  Oh, and if you happen to be with friends, take control of the jukebox, and you can have your own \"private party\" in the Castro.  Weekday or weekend, it's a nice place to be.", "author": "Dudley F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-06", "description": "i like the outside space here, but it's not anything that special.  it's gritty.  If it weren't for the people, I probably wouldn't really go here again.  It's ok.  I mean booze is booze right?", "author": "Nick G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "Drinks are cheap and the bartenders are super friendly. The back porch is a bonus. Overall a great place to meet friends and enjoy some cocktails.", "author": "Valerie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-19", "description": "An unpretentious little place. Has a bit of a dive bar feel to it but without the smell, so it's obviously kept clean. Friendly staff, very stiff drinks, and the most mixed crowd I've seen so far on my trip to this city.", "author": "Donovan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-30", "description": "drama city\nlaughable characters\n\ngreat bartenders, great drinks\nlively place\n\nbut a small and cramped pool table..\n\nbut then again i come here to see and play with the guys.", "author": "tanner r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-13", "description": "NO pretense here. The bar is simple and dark, and the people who frequent this place are people that I like to talk to. The attitude is checked at the door, and that makes this place great! The drinks are great and always strong too! And if you like to play pool, there's a pool table for you to enjoy!", "author": "Guy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "I was going to meet my friend because we were going to study together we stopped on Castro St  for what was supposed to be a cup of coffee. After finding parking I found myself not studying but inside the mix drinking Bloody Mary after Bloody Mary. The drinks were strong and the sun was shining so fuck it we drank and Drank and I would do it again.", "author": "Kim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "Disclaimer. Im not a fan of the castro bars. \n\nI really dont go out much in the castro. I have had bad experiences on most of the visits. \n\nI went to the mix with a friend late one night. The bar itself looked really small on the outside but was surprisingly bigger on the inside. My friend and I both ordered beers and the prices were reasonable and the bartender was really nice. After several rounds, the bartender gave me a free round. I played a round of pool and was enjoying the bar alot. It began to get more crowded later in the evening so you had to wait for a table. \nI met a lesbian couple who my friend and I played at pool. They were very cool and seemed to like the bar as well. They said they liked it more than most of the bars in the area b/c it had a more comfortable feel. I can see what she meant. The other bars seem to have a superiority complex. \nThe deck was really good too. The bartender outside was friendly as well and it was a great night. I havent been back since but would go back. \nDid I mention they have really cheap drinks?", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-15", "description": "great place to watch the game!  we came here this past weekend remembering the tv's from the last time we were there (cuz they kept distracting my tv-lover of a wife).  at the front bar, we planted ourselves right in front of the big one!  \n\ni think they usually have a special, and when it's beer, i'm golden!  the bartenders are nice and they don't give you small drinks for big drink prices!  the crowd is favorable, they're chill but get excited when it's time to get excited!  the pool table is always being used, but i'd rather watch anyway.  it's like a gay bar not in the castro, but it's in the castro.  \n\nnot a fan of the bathroom though, but when ya gotta go, you just go!\n\nget drunk here, i always do!", "author": "Monk R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "Awesome place! I stopped going only because I work too much now to enjoy the Sunday specials at this bar. I would go every sunday for the best beer/cocktail specials during the day...and the patio can be very loud with the occasional loud flamboyant guys blowing smoke in my face...but other then that I always have fun playing pool and relaxing with friends here!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "Great frozen drinks (at an excellent price), convenient location, relaxed atmosphere, nice bartender, friendly regulars, and really nice back patio...  which can result in an extremely full bar, because it is so popular.  Try it at different days and times... I am sure you will find the right \"mix\".  (ba-dum-dum)", "author": "Ross H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "Love love love the Mix, it's gotta be the friendliest bar in the Castro. Extremely dyke and hetero friendly and I must say that there's never a day that the drinks haven't been strong enough to send me out on my ass if need be. They now have a ladies night on Wednesdays that I'm tres excited to try out.  The bar staff is extremely friendly and they even hooked me up with some free drinks on my birthday. My favorite place to hang out when I just feel like going to the local spot. The Mix is so unpretentious you almost forget your in the Castro....see you there.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-25", "description": "hairy shirtless bartender... wasn't really my thing, but didn't disgust me either.  he was a nice guy, made me a strong cocktail, which i appreciated.  Their back patio is awesome, but they didn't have that open last night... so... that wasn't that great.  The best thing about this place is that they open at 6 am, so if need be, you can start the day there.  perfection.  Plus, the company was good :)", "author": "Caleb D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-24", "description": "The Back Patio, the Great Staff and the Atmosphere of the Castro all make this place a great place to have a drink and meet great people. They have pool tables and 3 bars in this little place so you should have no trouble getting a drink!", "author": "jen t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-28", "description": "Overall, The Mix is a great neighbourhood bar. Friendly people and staff (mostly) and an unpretentious atmosphere make for a good time for all. The back patio is a great space for hanging out rain or shine. I kinda miss the food back there I must say- but I guess the retrofit of the area is probably a better win. \n\nBartenders are among the best in the Castro.  Wonderful people.\n\nOverall, there is really no better place in the area- hands-down.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "Love coming here for a mellow drink or to get a little drunker and play pool.  Friendly staff know ya by name and drink :)  Fun with drag queens, bears, twinks, and just drinking buddies.  It truly is the Mix", "author": "Sean M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-28", "description": "4 stars for the patio but its never open late enough in my humble opinion.  Cramp everyone in altogether on the inside and its not so fun.  The crowd is a little well, if you're from Fresno, you should feel right at home.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "Some of the best bartenders in the Castro - Sylvia, J.R. and Sloane!   I've always been treated very well.   About the only place a gay guy can go to meet some fun lesbians.   I really like the VJ.  He plays good current music and slips in some classics for variety.  Also, this is one of the few (if not only) bars in the neighborhood that REGULARLY hosts benefits that help the gay community.    Pet friendly with cute, well-behaved doggies!", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-09", "description": "A very friendly neighborhood bar with an excellent back patio. Attracts an eclectic mix of folks, most of whom are far more polite than at the more \"desperate\" Castro haunts. Still, I miss the good old days when they didn't narc so much in the back... oh well.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-06", "description": "The back patio is great, although having spent the 2004 're-election' debacle here, it is bittersweet. The patio was closed last night, but perhaps as some sort of compensation, the bartender got in a fight with some guy who kept yelling about being 'accosted.' The bartender had the poor fellow face down on the floor, with his arm lodged firmly under the gentle-man's chin. The ribald youngster struggled gamely to stand up, trying to eschew the erstwhile barkeep by thrusting his ass into his attacker's groin area. But to no avail. When we left, he was still making sport of it, just grunting and grunting and grunting...", "author": "Big S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-18", "description": "I have to like this place no matter if it sometimes smells, the crowd is a bit, um, well sketchy, curmudgeonly ladies in the front (sorry ladies not all of you, just some), and the service is so-so.  Truly an original place.", "author": "J J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-02", "description": "The mix is fun.  I think my friend leo has a crush on the bartender, but my other friend told me he's straight.... Can we go to the transfer now?", "author": "Matt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "Went here with a friend last night and luved it! Cheap, super strong drinks...seriously did they add any cranberry to my vodka cran? There were nice, fun ppl, American Idol was blasting in the background, ppl cheering to Obama and being a girl I didn't have to worry about being hit on by creepy boys! A fun night!", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-07", "description": "Its open everyday at 6am.5 stars in itsself. A great Mix of Boys and Girls in the Castro with a awesome back patio. Friendly place, loud juke box, and they got a pool table too. The bartender can make a mean bloody mary, though they usually suggest a bottle of beer, hee hee", "author": "Missy I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-15", "description": "My partner and I, with a couple of friends in tow, decided to check out The Mix after meeting for dinner the other night. We have been several times before, but for one reason or another I have never gotten around to writing a review. We walked in the place was full, but not so much so that you couldn't breathe, we ordered drinks, and immediately headed to the back patio. We each had vodka tonics, and all I can tell you was that they were damn strong! Just the way I like them. We sat next to a cute lesbian couple, with the most adorable Labrador I have ever seen. They were so friendly, and we made friends right away. In fact, we met tons of cool people that evening. Bartender was friendly and fast, which is a plus in my book. We decided to go inside after awhile, as the friends we came with wanted to play pool. Stayed a couple of hours longer, and God knows how many drinks later, finally left and went home and promptly passed out. So glad we took Bart, 'cause I was 3 sheets by 12:00am. Another fun option for us when we venture to the Castro. Strong drinks, friendly patrons, and great bartenders! Four Stars!", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "My absolute favorite bar in the Castro, because of the patio in the back.  Only problem is that they close it when it's not busy and make you smoke out front.", "author": "Kenneth K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "The drinks are cheap and strong at the Mix.  The bartenders aren't really that interested in talking to you.  I'm not a big sports fan so I don't often hang out here, but it makes a nice change sometimes.  The patio is relaxing, sometimes they have shows outside which are very entertaining.  The food served on the patio is not the best, I've tried it twice without enjoying it.  The pool table crowd can be a little annoying as they use up all the inside seats and don't look where they are jabbing with their sticks.  However all in all it's still a nice place to go once in a while.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-06", "description": "Went here for a birthday party where I barely saw the birthday girl.  Fun place in the Castro, though.  It was crowded from the front all the way to the back patio where it was still so warm and muggy because of the sweaty bodies under heat lamps and shrouded in a dense miasma of smoke.  I'm willing to overlook all of this because the bartender made me an extra long island.", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "I have been an on-again/off-again regular of Mix since it opened.  The manager, Silvia, makes the most amazing margaritas and is one of Castro's most popular bartenders.  She really treats everyone with kindness even when super busy.  Linda on Sundays is pretty famous for her bloody mary's.  The bar really does get a mix--from gym bunnies to locals getting off work to chain smoking alcoholics with no teeth.  The owner, Larry, is often around and keeps the place clean and well-maintained.  One of the best outdoor patios around.", "author": "Richard N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-15", "description": "My friends and I would saunter over to the Mix on Sunday nights to watch the L word.  It's a pretty decent sized bar with a patio in the back.  If you are going to watch the L word, they have a bunch of flat screens around the bar, so you don't have to hover around one screen.  The bartenders are kind of aloof, in that I-am-cooler-than-you kind of way.  They have a pool table, for those of you who just want to be seen, but don't really care to watch the show.  The only gripe I have with this place is that they need more than one toilet!", "author": "jen n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-16", "description": "I really like this bar.  It's a gay sports bar and it fits both those descriptors very well.  There are always games on the tv and great eye candy.  They have an outdoor area that is covered and has heating lamps so you can smoke while drinking and not freeze your ass off.  They always have some kind of special drink which will be like $2-3.  It's pretty casual and has a good neighborhood feeling.", "author": "angela k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-09", "description": "great locals bar with a rockin back patio.\nalways a fun time\n\nthanks for sponsoring our Softball team!!!", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "The nicest staff in the Castro!  AND, the most welcoming patrons.  I love that the prices are not over the top and you get one mean drink for that low price!", "author": "Wen Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-16", "description": "Good drinks and a great hidden back patio.  It even gets some sun when it is nice out.  Good margaritas.", "author": "Liz E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-13", "description": "The back patio is the best.\n\nNice place to hang out on sunny weekend days.", "author": "kyoto s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-05", "description": "This use to be a great place to get drinks but I can never get a drink that tastes right anymore.", "author": "Justin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "I just wanted to send a shout out to the staff @ Mix Bar.  What a great month of hosting all the World Cup Games,  and what a final weekend.  Thanks for a fantastic time.  cheers, t", "author": "tom s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "the back patio is kind of whimsical when you're on the right substance.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-11", "description": "love it, especially the back patio. but one star deducted for the straight male bartender who gave me 'tude. it's the castro - what are you even doing here?", "author": "Marla W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "After a crazy experience at a place which shall remain nameless, my friends and I came here to end the night. They didn't have a DJ, but  the music was so much better than where we came from, plus we had room to breathe. I liked how there was a long bench along the wall where people could sit. There's also a pool table which I had my eyes glued to for a good minute because the guy that was playing looked like he could be a professional. Interesting part for me was when I headed to the restroom. Theirs is co-ed. I didn't even experience that in college. Awkward? No, not really. Although it would've been nice if my guy friend had closed the stall door before going about his business (#1 mind you). I was so close to walking in on him. O_o This would be ideal pre-party territory. I suggest that you try one of their shots. It's called, wait for it....a c*ck sucker. Sounds nasty, but tastes damn good. Don't knock it 'til you try it!", "author": "Rhia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-21", "description": "Went there Friday night around 10.  Very stiff and yummy Long Island.  Not too crowded, mellow, but also not dull.  Good place to go after already having a couple drinks, and great for having another drink before dancing.  The three of us went to the back area and had a marvelous time chatting.  There were some Sisters there that evening, one who was lovely and kind enough to warm my freezing hands.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "nice drink prices, fun back patio. i am hetero and lived in the castro for awhile- which i loved: safe, pretty, everything open late- and mix was a place i frequented. i always felt welcomed and always got really really in bad form drunk. the crowd is fun, the music is loud but good luck trying to get in a game of pool - the space is a little crowded, and i think the bathroom borders on rank but hey after you're drunk .....its all good.", "author": "Adrienne P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-20", "description": "heat lamps for the smoking patio that has seating = double sweet, double stars.  another star for having the kind of place where gays will actually have a friendly conversation with a female unlike the queens ELSEWHERE (read: badlands) who are strictly on the prowl. another star for no cover. i cant remember if i was too tanked to remember my drink here or if i had the presence of mind to pass. ill have to drink a double upon my next visit and amend this review", "author": "Miz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "i'm tired so i'll keep it quick... this place is great for hanging out and having a few with the friends. not too loud, everybody's nice and they have a back patio for smoking. it's a little old, but you feel comfortable being there.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-12", "description": "This place has an awesome hidden patio out back.. It's a chill neighborhood bar with friendly bartenders, strong drinks, and a very mixed clientele. Expect the patio to be buzzing on a sunny afternoon.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-19", "description": "Overall a really great bar.  I typically hang out at the front bar and avoid the back patio as I am someone that does not tend to like alot of people in a small space.  The bartenders are super friendly, the drinks are great and it is fun watching the regulars playing pool when they are drunk.  The Mix has two different crowds as well which is kind of unique for a Castro Bar.  The front is a little more laid back and the back is more roudy.  Basically it is a great bar for everyone regardless of what your crowd may be.  I only wish this bar would hop on the band wagon and accept credit cards.  Until they do this I cannot give them a 5 star rating.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "I always stop in here to have a beer when I am in town.  I give it three stars for the patio as I smoke; patio is always open whenever I have been there.  The little tiny gal there that bartends is a real sweetie.  A couple of the staff can be extremely rude so I simply avoid them.  Someone else here mentioned the tranny regular who speaks in a foreign language that no-one understands.  I also get a kick out of her/him; have never heard her/him speak a word of English.  She speaks some sort of jibberish with crazed fits of laughter every few minutes.  I always say hello to her and she smiles and then mumbles incoherently for several minutes before falling into another fit of laughter.  I want whatever she is on.", "author": "Mario C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "This place is cool, the staff is cool and friendly. Drinks specials. Fun karaoke!", "author": "Samantha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-12", "description": "It's ok out on the balcony, but unfortunately this is an open invitation for smokers so it's a double-edged sword. The bar itself is too small inside.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-07", "description": "The mix is truely a magical place. im usually here after my pharm. parties and generally am non coherent. As it is they have a juke box which allows me to frantically snatch at the air as if im catching invisible flys while listening to some of sineads greatest hits. I'd be lieing if i said i didnt spend countless hours breathing on the mirror in the bathroom writting my name and then screaming \"youre ugly! youre ugly!\" For almost a year i had planned on running away from home and living under the pool table until i found out thats where they keep their alcohol. I stopped washing my hair after that.", "author": "youric v."}
