{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "I have been hanging out in The Castro off and on since 1982 long before The Edge so I have had a few favorite spots.\n\nI will say that I have always like The Edge, but this trip it just felt like home (bar) Moms place was much nicer.\n\nIt's all about the service. I had several great bartenders, and then Eric... that smile, that wink, that amazing service. \n\nProbably the best prices in The Castro, excellent service and a STIFF...drinks makes The Edge my favorite stop!", "author": "Jim V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "I am often very hesitant to spend much time in the Castro nightlife scene because of various reasons (i.e. boring drinks, repetitive top 20  music, drama queens, drunken messes, racial discrimination,  etc.), but the Edge has become my go to watering hole over the past few months now. \nI have to say that this is all thanks to their bartender Eugene, also known as BamBam. He's always been very attentive, friendly, and engaging when I've stopped by for a drink...to the point that I only care to go when he's behind the bar. He truly puts care into his work and taking care of his customers. And it's not only his customer service skills, he creates delicious drinks on the spot...outside of your regular vodka-sodas,  gin & tonics, or Jack-n-cokes, after he's gotten to know your tastebuds a bit. He even remembers his customers' default drink ordering habits...a critical part of anticipating your customers' needs. On top of all of the aforementioned, his personality in general is always uplifting and humorous. And if you go on the right night, you might get drinks and a show from him. Haha\nThere are other staff that make the Edge such a welcoming spot to enjoy a cocktail, either with friends or when flying solo, like Kenny, Dom, and Roxy Cotten Candy...but Eugene is the motherf*ckin Starboy.", "author": "U. Sacred M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Based on my recent visit for Musical Wednesdays, I wish I: lived in San Francisco and/or had a bar like the Edge I frequented in Philly.\n\nThe atmosphere & song selection all night was great: fun, engaged, ready to sing along to any and every showtune. \n\nThe drinks are pretty cheap, and the 2-for-1 is hard to beat.", "author": "Herbie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "Dirty Musical Sunday's, Musical Monday's, Musical Wednesday's...3 best days of the week...if Derek is DJ'ing...otherwise, the other guy, regardless of how much you tip (over $30) will still only play the same \"white bread\" musicals that only he wants to hear...walked in, bought a round, left after two sips...that DJ is toxic", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "Watered down vodka - their vodka is clearly watered down I would avoid this place or choose non clear spirits they are clearly taking advantage of patrons and an inspection by the regulators is due.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "Went to The Edge for the first time since 1992, and i see why I hadn't been back since. Being 1 of 2 African Americans in this bar, I've noticed the bartender took almost ten minutes to even come over to us at the bar and acknowledge us. Being treated as though I'm a 3rd class citizen isn't cool and I'll never spend nor return to this bar", "author": "Xavier K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "With nothing to do on a lazy Thanksgiving afternoon, what better activity to do than drink and converse?  It was relaxing that afternoon, with a few peeps having some hooch.\n\nATMOSPHERE:\nThe small corner bar is dark and a bit dreary due to its black everything, with a small section looking out through big windows.  A long bench runs the length of the place, with a few high tops and bar seats.  Like at most bars during the day, it was chill and easy to communicate.  Saturday night brought in a few more patrons with a go-go boy dancing on the bar.  No official dance floor.\n\nThe bathroom... There's two.  One is a regular lavatory that's more suited for developing black and white photographs in.  The second is a broom closet with a trough that would look at home in a contemporary barn.  \n\nBEVERAGE:\nLemon Drop - I'm usually a beer guy, but was not feeling it on turkey day.  The drink was strong, but had a bit too much lemon juice in it, and the sugar rim was missing.  Gulp, next!\n\nCosmopolitan - WTF is going on with me lol?  My second quaff was this girly drink, but I didn't care.  Vodka was ruling on this day.  x2 = oh yeah!  Off to dinner!\n\nBudweiser - Now we're talking!  A man's drink lol!  Saturday night brought me back to my beer roots as we started here and hopped around 18th Street.\n\nSERVICE:\nFast and friendly, just how I like my men.\n\nOVERALL:\nCool place, not overly crowded, good prices.", "author": "Vince N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "We frequent this bar as often as our spirit allows, and have the experience made so much more pleasant and memorable because of the fantastic bar-tending skills of Eugene Bibbs! Personable, attentive, and sweet; ask for Eugene!!", "author": "Jeffrey A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "So, it's pride weekend and I thought it would be fun to bring my friends here to have some fun. I've been to the edge before and had a good time; but this time, it was different. My friend was waiting at the bar for 5 mins, waiting for the bartender to at least acknowledge her. So, I stepped in and just waited at the bar with her, holding my credit card in my hand, waiting for him. He looks at both of us and says \"that's the worse way to get a bartender's attention\" and serves everyone else around the bar. My friend and I look at each other and think what did we do. I've always thought castro was a judgement-free zone, but tonight I know how it felt to have some prejudice against as he continue to serve everyone else who was not Asian. It wasn't until another bartender who came to us and took our order. That same bartender then went to the bartender who was serving us and gossiped about us. Honestly, being a gay Asian male, I've never felt this kinda of discrimination before and will not ever come back to this establishment because why would we, as lgbt family and folks, come to castro and be judged or discriminated against.", "author": "Wilbur C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "This bar is chill AF. Always feel welcome there.\nEugene Bibbs is my favorite bartender when I usually go on Tuesday $1 well drinks night, go to him!\nThe door man was really nice too, and actually found the wallet my friend dropped, gave it back with everything in it when he asked if somebody dropped a wallet.\nGood times.", "author": "John Karl D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-03", "description": "I was waiting for someone inside for about just a minute or two and the bartender came up to me and demanded to see my ID. I explained to him that I was waiting for someone and will show it to him later when I'm ready but he said he'll throw me out if I don't show him my ID. I'm guessing asian females are not welcome there. My bad ‍", "author": "Sara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "Ive been in here several times and always had a good time. The staff is super friendly and the crowd is always chill and fun.  The only reason it doesn't get a 5 star is because Im not a fan of the trough style urinal.", "author": "Marc E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "Very laid back bar here. We usually come here on Sunday afternoons for happy hour. It's 2 for 1 meaning you buy 1 drink and you get a token for another drink. Just so you know, if you order 2 drinks you don't get the 2nd drink free. You pay for your 2 drinks and then you get 2 tokens to use later. Still a good deal when you want to get sloshed on a Sunday afternoon.", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "The two times i've been here I had a good time. It's not very difficult to meet people in this bar, since it's small enough that we bump into someone every way we turn. We were here on a Monday night and ended up meeting some older guys to hangout with for the night. They were fun guys and ended up inviting my buddy and I over to another bar so that they could go shirtless. I didn't mind.....They were very good looking dudes. \n\nThe drinks are strong. Music is good. Not a bad place to be. Bathroom is a bit gross, but not a big deal.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "My partner and I are new to the city.   Love this bar.   We went for show tunes on Wednesday and it didn't disappoint.   The space is smaller but people are friendly.  You may request songs to the VJ and sing along!   Drinks are normal prices and strong.   I would recommend this place to anyone looking for a fun time out with friends!", "author": "William G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "Douglas is soooo awesome. He's sweet & efficient . He really cares about his job and his customers. I deff would come back just to see him only. They had a drink special so drinks were 2 for 1 and beers were $2.50. They also have usb chargers all along the bar so don't forget to bring an extra cable.\n\nEugene on the other was a total douche. He wasn't very friendly and ignored my friend. We tried to give Douglas a $10 tip. He took the tip and said we share anyway. I understand you probably do share but let Douglas grab it then he will share it with u later. Idk it was weird but besides that we had a great time!", "author": "Annabelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Love going on Sunday afternoons for Gavin's great Bloody Marys. Get them with the Effen Cucumber Vidka - yum!  Mixed crowd of all ages. Musical Mondays, Wednesdays and Sundays are always a hit.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-25", "description": "Some of the bartender are rude. They seem to think that their unpleasant attitude will cheer up the crowd. If you wanna be a bar tender and achieve a decent amount of tips by the end of the night,  please have a fucking cheerful attitude dudes.", "author": "Hugo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "The place to get soused lol. I guess it depnds on the day or time but your likely to find a giant 24oz masson jar filled with Tokyo Tea or a Manhattan tea for only $10. Super freaken worth it. My friend & I both had days off on a weekday and decided to check out the castro durring miday and just so happen to walk in to us the bathroom and decided to stay for a drink... That was a happy mistake  the bartender was polite and shared a joke or two, it wasn't too busy but just enough for a buzz of convsations that blended into music playing.", "author": "Amer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Whatever you do, wear a white t-shirt and jeans and \"werk it!\" Luckily, I was even wearing one of those pouch under gear that I got as a gift for Christmas that made everything between my legs, well... looked liked I have a 3rd leg!!  Even the patrons at this \"fine\" establishment squeezed my \"Charmin\" if you will, to ensure that my \"package\" was in fact, for realzzz!!!  So you can only imagine,  I had been manhandled.  But, that's when my free drinks started happening, and that's when the fun also began! :p And as the ole saying goes, \"Sometimes, you ought to live on the EDGE of time!\"\n\nDrinks here were fantastic.  They were strong, and lots of it.  They made killer Long Island Ice Tea, and the Jose Cuervo Shots.... they were fantastic.  The bartenders were great even though they were busy. The patrons here were super friendly considering I'm no burley, hairy or otter dude. I'm just your average clean cut Asian guy, with a few inches of fat here and there, but I guess it pays to have hard nipples all night long, peeking through my white t-shirts, and a live package for \"touchy-touch\" because my bank account that night, stayed the same.  Drink up folks, because the more you drink, the prettier they get!!\n\nUntil then, Cheers! ~ :p", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Im always present here every tuesday with my friends! I wanna give a shoutout to my favorite bartender Eugene Bibbs you the best!", "author": "Ivanlandle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "This is one of the best bars in the Castro, bartenders are great, friendly, take care of you, specially if you are a regular, drinks are great.", "author": "Luis E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-11", "description": "If you're into vapid, inefficient, self absorbed\n and attitude-laden bar staff, then this is your spot. Rude, rude, rude. I guess the management have removed mirrors from their employee's homes because the self importance is baseless. Get over yourselves guys!", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "The bartender Bam is sexy and always remembers my drink order :)", "author": "Bucko W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-27", "description": "Me and my co-workers came here during last Saturday for Pride weekend. This place was fun! we danced and drank all night. This place can get pretty crowded so prepare! The drinks are alright but the atmosphere is on point. I definitely recommend coming here with a bunch of friends and just having a good time on the Castro!", "author": "Allister D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "One dollar cocktail nights on Tuesday are fun and thrifty the music is very diverse and the people are easy going", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "One of my favorite bars in Castro. The VJs on Sunday, Monday, and Wednesday are amazing because I love musicals. And Eric and BamBam as bartenders are amazing. Come here if you want to feel like family.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "The bartender Bam was super friendly and made me the drinks to my exact order. He was friendly and fast. Great customer service", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-24", "description": "Jesus- I tried to write a good review/ I tried to wait and have them serve anything anything/ but Jesuit I've 15 minutes at the bar and three different guys just ignored me. 2 stars", "author": "Xander M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "A-ok", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "WOW! Fun bar- especially on Tuesday night ($1 well shots all night). Ask for Eugene- he's probably one of the BEST, funniest and attentive bartenders in the Castro. He makes sure ur drinks full and keeps you smiling. Definitely worth checking out!!!", "author": "nick w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-16", "description": "I have never felt so unwelcomed before. I came here with a group of friends. When we walked in, the guy merely asked for ID didn't even say welcome for have any sense of gratitude with us coming. We then go to the bar, the bartender was snappy and forcing us to pick things as soon as possible. He messed up half of our order, and we were like that's fine we'll just take it. But then he snapped and was like YOU ALL NEED TO MOVE. When we were still waiting on the last drink. He made us a moscow mule which was 2 dollars, and then later on, after we moved, the bartender on the other side, made us one too and charged us 9 dollars....Seriously? You can't just go from charging 2 to 9.. We then told him, and he got upset saying that we didn't say we wanted the 2 dollar one.. How are we supposed to know.. he's the bartender.. He again kicked us out and made us move away from the bar. There were stolls at the bar, and there were 2 men that sat there earlier. After we left, my friend and I sat there, and he made us all move. That is just ridiculous when it comes to service. I have never felt so so un-welcomed. It was truly an experience NO ONE wants to experience. I will never be coming back to this location.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "Musical Mondays is honestly one of the best inventions. Here you have an unassuming, crowded bar with basically nothing special about it. It's not swanky nor divey. But put on The Little Mermaid, serve cheap drinks, and you've created some of the friendliest gay men I've ever seen in San Francisco.\n\nThey've got a lockable bathroom that shockingly never seems to have a long wait. And yeah, they put shows on, too.\n\nOne request, Edge? Tell your door people to stop saying \"we're asking for\" a certain door cover. I straight up just wanted to say hi and bye to a friend of mine one night, and the door person said \"we're asking for $5.\" Well hon, if you're \"asking\" for it, it sounds like a donation, and since I was only going to be in there 5 minutes, I didn't want to pay a cover; she got super sassy about that. I've since recovered, haha, but next time, just tell me \"the cover is $5.\" Like okay, I'll deal.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-11", "description": "I've never been treated so badly by a bartender as I was last night at the Edge. The bartender with the beard and black hat was so rude to me, giving me overt attitude when I asked about the 2 for 1 drink special. He wanted me to pay for 2 drinks and get 2 tokens instead of letting me pay for one drink and get the other one free. He rolled his eyes at me when I asked about this and then proceeded to ask for my ID again even though I'd showed it get into the bar. Later that night, he even asked me to move from the seat I was on so this other guy could sit there. I am seriously still shocked that someone would treat their customers like that. So unprofessional.", "author": "Rexana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-11", "description": "Bartender with the beard and black hat on the right side of the bar was very rude to our group last night. Like on multiple occasions and interactions with different people.", "author": "Timothy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-24", "description": "My two stars are primarily because of the unfriendly late afternoon weekend bartenders.", "author": "Fred S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-09", "description": "Wednesday, February 5, 2015 my friend was drugged in this bar. My friend was coerced back to our home (we are roommates) where they were sexually assaulted and the assailant(s) robbed (and violated) each of our rooms. \nThere was a surveillance camera pointed right at the spot where our roommate was sitting all night.\n\nUpon going to the bar the next day to retrieve this surveillance tape, I was given the contact information of the manager because the bar tender was unable to access the tapes without his permission. The manager's name is Michael Schuaf. I called and left a voicemail that day explaining the events of the prior evening and the importance and urgency of getting those tapes to us. No reply. I called again leaving another voicemail on Friday. No reply. Today's date is Monday, February 9, 2015. Still no reply.\n\nThe Edge is a playground for sexual predators. If you so choose to patronize this establishment, please know that their surveillance is only used to protect their cash and their establishment, not their customers. You've been warned.", "author": "Deborah R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-29", "description": "I like the Edge, but Tuesday night's bartenders suck. One (I think his name is Brian) prefers to tidy up his workstation rather than serve customers; the other (relatively new) likes to eat bar food and chat with his friends. Guess what, there are other choices on the Castro on Tuesday night vs. dealing with these two losers.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Michael, Douggie, Bruce, Jeff, Chad, Brian, Mikey, Erick and Keith are some of my favorite people on the planet.    For me, the staff makes me feel so welcomed every time I walk through the door (except for one asshole barback).  But, I digress.  LOL!  Love you guys a lot.  Thanks for always being so kind and loving.  You guys are the best!!!!", "author": "Matt A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-15", "description": "Stopped by here one early evening to partake in their happy hour. The happy hour prices were great and the drinks seemed to be poured pretty stout. I will say this our first visit and the bartender had attitude and wasn't the most pleasant. I enjoyed the environment even though they were not that busy and also the drink's but with the type of unfriendly hospitality the bartender was giving for no apparent reason I am not sure we would go back....Maybe if we had another bartender we would try it again..If we do I will update the review accordingly.", "author": "Shawn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "This bar is fun. BUT! The bathroom smells like a rotten clam market, which is ironic given that this is a gay bar. I have been trying to pee, but I am so confused about weather I am am in a clan graveyard, or a bathroom, that I am completely turned off to the idea that there may be a chance to tinkle in the castro. Give me clam chowder, or give me toilet!", "author": "Evelyn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Best way to get over a hangover is to drink some more? True or not, myth or not, I'm happy there are bars open early enough to fill my cup. I've never been here at night, but I can tell it's a total boys' bar from the décor and posters. Loves it! After a night of debauchery in the Castro, we came back to nurse our sluggishness and it was just what we needed! During the day, it was clean, had good, indirect natural light from the windows, they didn't play any loud music...just perfect for the hungover.\n\nCash-only bar.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-10", "description": "My co-workers and I stopped by here for Happy Hour after our shift. We got here at around 4pm, and the bar was relatively empty. There were about a dozen people inside, which seemed like a comfortable number.\n\nAn hour or two later, and it was so crowded that you couldn't even make it to the door or the bathroom without bumping into five people.\n\nFor someone like me who feels a little bit claustrophobic in densely populated areas, it was not a pleasant feeling. A couple of us stepped out for some fresh air and came back to find that our seats had been taken over by three fellows. They did not move when we came back to join our buddies, so we just found a way to huddle around our table awkwardly. \n\nDrinks are very cheap from 5-9pm. $2 bottled beers, and very reasonably priced well drinks. Someone was drinking a Mason Jar Tea ($8) that looked a lot like an Adios Motherfucker. I'll admit, that blue beverage looked very tempting, but I know my limits, and I did not want to the finish the evening with my head in a toilet. \n\nVerdict? If you can get here early, go for it. And make sure you use the bathroom before you start feeling like you're going to burst, as there is only one stall.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Tonight I truly felt and embraced the vibe of this bar after having a horrid experience(not naming the place) at an established long time bar that I've gone to 19 years and I'm sure banned from because I flipped off the GM and said a few choice words.  Luckingly I have met one of the investors so I'm good! Fantasic bar especially Monday and Wednesday's", "author": "RD R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "This could have been a decent review with a higher number of stars.\n\nBut when some greenhorn bouncer makes flippant, unwarranted threats of physical harm... forget it. They must have been new; no bouncer worth their salt would ever conduct themselves like they had. Hell, the guy running the door -- a fellow employee -- was even perplexed!\n\nThe Edge? More like The Daycare, considering that bouncer's behavior.", "author": "J. S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-04", "description": "It's a sad situation when this happens, but the new doorman on Wednesdays (a taller man with long hair) is letting minors into the bars as my husband and I say this evening we counted no less than 4 underage drinkers enter the bar that we know personally from work or school. Unfortunately, I cannot support any establishment that allows underage drinkers inside and I fear that the Edge will soon lose their liquor license. I hope that the management corrects this situation by getting rid of the doorman. The Edge is our favorite bar because of Musical Wednesday's and we would hate to lose our favorite hangout.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "Alright so there's obviously pros and cons to any bar but I do have to admit the edge is my favorite in the Castro. \n\nPros: cheap drinks, easy to obtain drink tokens during happy hour, overall friendly crowd - which is hard to find In the Castro! No door charge. Good music and strong drinks.\n\nCons: kinda smaller, could use more seating\n\nRegularly good experience!", "author": "Tyler K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "Friday night. Small group of friends. SJ to SF? Ok.\n\nMy friends and I wanted to check out a different spot around Castro. Instead of  hitting up the usual places we dance and drink at for a casual or crazy night of fun, we paraded ourselves over to The Edge.\n\nFriendly bouncer. He quickly glanced over at my group of friends, smiled and led us through. Small venue, lightly decorated, men on men porn action playing on the plasma tv screens from the bar area, enough seating arrangements, and well played music? Yeah it was the kind of spot we were looking for. \n\nA handful of older men....we felt out of place. However, we stayed anyway because of the cheap drinks!! 4 cups of cherry vodka mixed with red bull or tonic soda, sex on the beach, and beer, everything came out to a total of less than $15!! Yippee!! This spot is a gem if you ask me. I had a great time hanging out with my friends and cheap drinks in hand.\n\nWould I come back? YES!", "author": "Fraulein C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "My best friend and I stumbled upon this bar after dinner at Lime. We just wanted to check out the nightlife on the Castro. \n\nThis place is a bar for gay men. My best friend and I were the only females inside of the bar! 2 straight girls surrounded by gay guys, cute gay bartenders and hot gay dancers! Everyone was real friendly! No one seemed to care that we were the only girls! Everyone just seemed happy and enjoying themselves! Awesome place! \nThanks for the entertainment!", "author": "Majileen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "MUSICAL MONDAYS OMG. They have a fricken music video DJ who has a library of musical numbers with sing-a-long captions. Came here for St. Patrick's Day and sang, \"Let It Go,\" like 5 times. Was fantastic.\n\nI don't remember spending a lot of money, and my bank account says I didn't. They also hand out wooden chips for free drinks during happy hour. Fan-fricken-fastic.\n\nNot too spacy, not too cramped. Space outside to drag a cig. Was fun, and I'll definitely be back again soon!", "author": "Ethan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "The Edge is a really nice gay bar in the Castro. It's very clean, and seems to be the place where locals go to just hangout. The drinks were not too expensive, I think about $5 or so in the afternoon, and the bar seemed to be a good place to strike up conversations with strangers, if that's your thing. Also, the Edge seems to be a good place to bring your flame dame / lady friend. I saw a one or two of them there, and they seemed to be well treated -- which is not always the case in every gay bar.\n\nOne big thing to know: the bar was totally okay with customers bringing pizza back from the different pizzerias in the area, so if you're hungry, don't worry. You can bring some pizza for your drinks with friends.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "I have perused the comments made by others and let me say I think they are all isolated incidents. I have been hanging out here for years after the renovation and let me say...be polite to your bartenders. They are people too and they work hard.  I'm a big supporter of all of the bartenders at the Edge. I won't name names (Douglas) all of whom I love for their unique personalities. \n\nI have never felt more at home than at the Edge and these guys work harder than hell and deserve to be recognized as well as all the bartenders in the Castro who have to put up with patrons who believe they are entitled to bash people who are just trying to make a living.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "New to SF and so happy to have found a Showtunes bar...from Chicago and Sidetrack it is not but it does the job.  The drinks are cheap and strong..fabulous.\nLooking forward to getting to know the bartenders and becoming a regular!", "author": "Wesley W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-30", "description": "Music was ok, nothing extraordinary. A little hint of techno, nothing that I could dance to. My preference is un-remixed original songs but this place had a lot of remixed, hyped up tunes.\n\nAmbience was clean and dark like other bars. The night I went here the windows were blocked off so you could not see outside. It was a little hot and muggy inside.\n\nCrowd were reasonably well behaved considering it was Dore Alley weekend.\n\nBouncer was really friendly and polite, I give him 5 stars.\n\nToilet is an issue. There is ONLY one restroom in this entire place. Expect long lines.\n\nDrinks were average like other castro clubs.\n\nBartenders were hardworking.\n\nGo-go dancers were boring!", "author": "Sunny E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-26", "description": "Great place. It really small, but I love the feel to it. $2 well drinks on Tuesday nights, you can't go wrong with that!\n\nOne star off for having one bathroom which gets covered with urine quickly so wear a pair of shoes you don't mind getting dirty.", "author": "Gaëlle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "Ohhhh, Edge. I heart you, too.\n\nThis corner bar has been a Castro institution for many many years. Decades even.\nThey had trouble a while back and they almost closed. But magic happened and the new and improved Edge is even better than the original.\n\nI remember the day, many years ago when a flatbed truck pulled up on 18th/Collingwood to drop off a huge penis.  As the crane lifted the penis it was like an erection, I will never forget how my head spun with thoughts of \"only in The Castro\" will you see a giant penis, becoming erect and brought into a gay bar for a theme.  \n\nAfter it was installed it really was quite tacky but iconic at the same time. \n\nNow, The Edge has prettied itself up and some long time bartenders remain but I see mostly fresh faces when I come.\n\nThe Edge is still very community minded and they host many events that benefit the community.\n\nBack in the day they had \"Basket contests\" and boy were those a hoot.\n\nThey also had the latest last call in The Castro. And the largest draft.\n\nYou can still get a very strong cocktail here and the bathroom is still very cruisy with a strategic mirror over the trough urinal.  FUN.\n\nCheck it out, but leave your attitude at the door.", "author": "James S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-02", "description": "Post dinner drinks at Edge on a Saturday night. \n\nPros:\n - We did not feel the least unwelcome (2 girls and a straight guy), in fact, the bartender was extremely friendly\n- Good people watching. Drag queens, crazy outfits, and half naked men, oh my!\n\nCons:\n - The gin to tonic ratio in my drink was about 9:1. It was more like an enormous shot of gin than a mixed drink.\n\nI can see this place being really fun, we went home probably before the night crowd arrived.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-28", "description": "The bartender who works in the afternoons on Sunday must think people cant read the sign by the bar and charges patrons what ever he wants based on his mood. Dumb. The night bartenders on Friday/Saturday are way better and nicer this dude gives San Franciscans a bad name.", "author": "Bertamus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "This review is for Tuesdays only. \n\n$1 well drinks...what more can you ask for? It's not my music or venue of choice, but I go the drinks so that shouldn't matter. \n\nStaff is friendly and the and the drinks are good. I will be returning next Tuesday.", "author": "Louis C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-27", "description": "We used to come here all the time when we lived in the city. And even after moving to the east bay, this was still our favorite bar in the Castro. Why? Because the staff was really friendly and the atmosphere was great. But today we were ignored by the bartender. The barback smiled at us but did not alert the bartender. So despite sitting at the bar Jack had to get up to get his attention. And when we asked for the wifi password. We were told it was private.", "author": "Nobbi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Fun little bar at the edge of the Castro. Drinks are pretty cheap and super strong. Definitely gets the job done. The only downfall is there is only one restroom and it's usually covered in piss and other gross things I'd rather not discuss. I usually go on Thursdays because of the drag shows and the amazing queens that participate in them. Super entertaining and always lots of fun. I would definitely suggest stopping by if you haven't done so already.", "author": "Cassie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "I used to tend bar here from 2006-2009 and had many many issues with the bar, building, ownership, management, etc... however this friendly bar has such a heartfelt sense of community and appreciation for each other that I did consider everyone \"family.\"\n\nIn April of 2012 I was welcomed back to the \"family\" with open arms from all the patrons and staff with a feeling of \"welcome back\" and several people telling me \"welcome home.\" I can't express how attached to this bar and extremely thankful I am to everyone that is part of it, and as cheesy as it may be the intro song to the \"Cheers\" sitcom suits this bar very well. I may not be able to remember everyone by name, but I know what everyone drinks and every drink I make here is poured from my heart and full of love... and hopefully you'll be able to taste it! \n\nCheers! \n\n\nBrent M. Olivier", "author": "Brent O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "Hands down best neighborhood bar in Castro. All the staffs amazing and it's a good crowd. Good drink prices and specials combined with awesome bartenders make it a no brainer. Love this place!", "author": "Alan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-27", "description": "The demographic here is target towards older men, bears (brown, panda bears), and maybe a rare occasion of an Asian twink looking for a sugar daddy. Monday's they have show tunes which I believe starts at 9pm. They also have go-go dancers, but they should work on their abs more.", "author": "Vinson H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "This place is pretty fun. I've only been one time but would go again. The bartenders are friendly and felt welcomed. I'm new to the Castro scene so I was looking for a good place to chill, have fun with friends and meet people. This is one place that I felt didn't have the stereotypical flamboyant gay vibe to it which I was happy about. Another positive is their strong drinks. :)\n\nOne thing I would recommend is going with friends unless you are looking to hook up. There seems to be a ton of guys there that are willing.", "author": "Zack E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-18", "description": "Best music and sound system in the Castro hands down.\n\nI always find I prefer the music here and the sound system is so much better than Toad Halls which has music just as loud, but far less intelligible.\n\nNot always my favorite crowd, but still enjoy it more than some of the other options in the Castro now.", "author": "Ennis O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-22", "description": "My friend and I refer to this place as the \"daddy bar\" because that's pretty much what it is; and I mean that in a good way because it's a whole different atmosphere. I love coming here to chill and relax because there is no cover, the bouncer is sexy, the drinks are cheap, the music is pretty decent, and sometimes they show 80's porn, which is interesting to watch because it is nothing like the porn I enjoy watching. They also have condoms in the back if anyone ever needs it. \n\nMy only issue is a personal issue I have because of one of the bartenders. I don't know if he's doing it to be cute, or if he's just naturally cautious and skeptical, but every time I try to order a drink, he cards me!!! If the bouncer allowed me to enter the bar, then clearly, I have proven that I am at least 21-years-old (21-years-young compared to everyone else in that bar) and should be able to purchase alcohol without a problem. I know I look like I'm twelve, but he sees me almost every week, and I show him the same ID every single time. I don't understand what it will take to convince him that I'm 21 so that he can stop carding me. Maybe I'll just show him my birth certificate and passport the next time I go there. Better yet, maybe I'll bring my mother to that bar so that she can reassure him that I'm 21. \n\nI just really want to know if he's just being cute, or if he's genuinely unconvinced about my age. \n\nHe's attractive though.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Went with my cousin for sing-a-long Monday and had such a great time. Found the place online so we were hesitate to check it out, but 5 minutes after we arrived we were so glad we did.", "author": "Sandy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "The change in ownership has done wonders for the place. I liked the Edge before, but I love it now! They've massively remodeled and added a ton of fun events. \n\nThe drinks are strong. The bartenders are hot and friendly. They have fun events like $1 well drinks from 9pm to closing on Tuesdays, Showtunes Mondays at 7pm, Basket Contests once a month on Wednesdays (the other Wednesdays are just generically saucy), Monster Drag Shows on Thursdays and fundraisers most weekend afternoons.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-31", "description": "The Edge certainly has it's place in the Castro.  Guys of all ages and types hang out here.  While the crowd changes constantly the mix is usually fun.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "My ongoing love/hate/reboot relationship with the Edge continues, this iteration with a little more love.  The new owners have done a FABULOUS Job with the remodel. The unclean dark ally feel has been replaced with a light, airy, and interesting look.  I could do without the mega-TVs all over, but even they are so much better than the mystery mound that used to be on display behind the bar.\n\nThe renovation also has improved the sound system and general acoustics. Even when the music is loud, you can hear your friends talk -- unless, of course, there is an insecure DJ on duty.\n\nAnd, there's life in the bar again.  Contests, sing-alongs, and special events.  I don't go out late enough to benefit from the scheduled happenings, but I like that The Edge is out there and doing stuff.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "Jason. The rudest bartender I've ever experienced. My friends and I were having a great day today. Gorgeous weather. Our Beautiful city. And we wandered into Edge where we normally go elsewhere. Obviously they don't want any other business because we were served by jason - a really strange bear type bartender who within minutes made us all so uncomfortable, we all left. He wasn't busy but treated each of us so rudely we had to leave. Even after we bought drinks. I've traveled a LOT. AND BEEN TO A LOT OF BARS   And this was by far the worst bartender I've ever had. We won't ever be back.  And we will not recommend it to anyone- as long as this idiot is behind the bar. I read another review where someone was drugged in this bar. If I had my guess, it would've been this creep JASON. if the management doesn't fire him, they're just as guilty. Left such a bad taste in our mouths. We'll never be back. Congrats.  Jason", "author": "Sean G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-22", "description": "My work department went bar hopping and this was the last stop. This is the first time I ever drank a long island ice tea out of a mason jar with a straw. Kind of interesting. That long island was mixed pretty sour too which I liked.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "Our favorite bar in Castro. We are an heterosexual couple, but still love the atmosphere. Waiters and clients are super nice and friendly, drinks are good and cheap, no cover, good music... Nice find.", "author": "Lionel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-05", "description": "The Edge was recently remodeled and thank god!  It was SO overdue for one!  I hear the new owners are the ones that own Q Bar.  That would explain why the Edge's new styling closely resembles the Q Bar.  I'm fine with the new design.  It's more open now and the place seems larger and free flowing.  I'm really happy how the place turned out.  However, there is one thing that I'm not a fan of and that's all the TV's they put up.  The Edge is the last bar to add TV's.  I miss going to bars that don't have TV's because it encourages peeps to be social and engage in conversation.  The vibe of the old Edge was really cheery, happy, and chatty.  Now they're just another bar showing soft to mildcore porn videos.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "My husband and I have been going to San Francisco for years, and always hang out in Castro.  We make our rounds to the normal places, but this year decided to try out The Edge - and am very happy we did.  There was a great vibe, great people, and hella drinks!  If you are looking for real men to hang with, go here.", "author": "Kevin V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-14", "description": "I'm the second girl to Yelp The Edge and I might have been the second girl to ever go in the Edge.  This is a gay man's bar.  It is a bar for men who are looking to hook up with other men.  \n\nIt doesn't matter if you're straight, gay or still thinking about it, unless you can grow a penis while you're standing there considering your options you should show some respect and go somewhere else.  \n\nIt doesn't matter how hot you are or how fabulous your outfit is, they will not think you're cute.  They will think you're in the way.", "author": "P J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-15", "description": "I absolutely love this place.  My fiancée and I used to go to q bar before we stumbled onto This place.  It may be small, but at least the drinks here are cheap and the vibes are good.  I would definitely recommend coming on Tuesday nights. Well drinks are $1!!  The bathroom though needs an air freshener", "author": "Jodie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Came here to see one of Cookie Dough's famous shows and had a pretty good time! I can't comment on the cocktails because I only drank beer, but I did notice the interior had been redone since the last time I was here and it actually smelled pleasant inside. No more sour bar smell! The staff was courteous and I had a pretty great time! I am glad this place got the makeover it needed :) I will be back for sure.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "I've only been here a few times, but love the overall feel of the place. Definitely more of an older crowd the few times I was there during the day, but seems like the younger people come around at night. Definitely go for their Mason Jar drinks or beer and shot special! They've got a whole list of drink specials right behind the bar.", "author": "Evan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "I have began to like this place again.  The bartender at the front bar on weekends, who has been there a long time is great!   I keep coming back because of him.  But the \"go go boys\" need to not shove their STD asses in your face as your trying to by a drink.   Seriously that is too much.  \"and take care of them Hemorrhoids mr go go boy, you know who you are....\".  But I'll be back.  ;-)", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "Checked this bar out while my last visit in town. It was fun, nice bartender, good music. Will try it again when I'm back in town.", "author": "Keith P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "My straight friend and I decided to go to SF and spend the day partying it up in Castro yesterday (Saturday). I had only been there once before about 5 years ago but it was just my boyfriend at the time giving me a quick tour. Anyway, yesterday, at one of the random bars we went to, someone said that if we're just barhopping we should check out \"The Edge.\" It was a great time! The bartenders were super-friendly, almost flirtatious even though I'm sure that was just the service, very welcoming. The crowd was awesome; everyone wanted to give us hugs and kisses for whatever reason. The guys were handsome and non-judgmental of one another. THE BIGGEST BONUS: one of the guys dancing on the platform there was someone that I've seen in a few of my favorite porn clips, WOW! We went to The Edge right before Badlands and there couldn't have been a better pre-gamer bar. Thanks Edge!\n\nAaron\n\nSacramento", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "The first time I ever went to this bar was around 5 years ago and I never actually stayed for a drink because the smell was soooooo bad!!! \n\nSo last week I met up with some friends there and the smell is gone!  Also, it was about 12:30am and the place was not overly crowded.. 80's music was playing and the drinks came in these tall cups and boy were they strong!! and for damn cheap!!! my kind of drink!  \n\nI'll be sure to come here again... at least to start the night out!!!", "author": "Jasen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-07", "description": "Totally gross, unless you're into hooking up with old guys in public bathrooms and drinks that taste like jet fuel (though with tons of alchohol for cheap).\n\nI get that I'm not the target demo for this place, but still find it gross.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-07", "description": "I went here one day for some reason. As I walked in, this guy smiled at me. I went and I think I used the bathroom. Him and I talked, he was cute. He was this homeboy from Washington. Turned out to be gay-gay. \n\nThe owner then gave both of us jager thongs and keychains.\n\nBut this is a nice bar. The architecture just gets to me. It's really claustrophobic in here. Really...\n\nThey had great go go dancers here on Xmas.", "author": "Lana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "It took awhile for the dust to settle after the change of ownership a couple of years past, but Terry the manager has brought a sense of stability and tradition back to the old bar.", "author": "Raymond B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-24", "description": "Went tonight.  It was slow and cool inside.  I was able to cool off after dancing at Badlands.  A local guy bought me a drink which put me in a good mood.  It was nice to meet one of my neighbors.  Bartenders were cool.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-31", "description": "Frick.\n\nThis bar is the scene of one of my most humbling/embarrassing drinking-related experiences. It's actually only embarrassing because I'm telling you about it. Otherwise no one would have ever known.\n\nSo, we were out celebrating the Friday-After-Thanksgiving holiday (OK, it was my friend's birthday) and this was the third and final stop of the night. Oh how I wish the night ended sooner and I didn't blindly/drunkenly hop in a cab with friends not knowing/caring where we were going. They could've taken me to a dark alley, tied me in a potato sack and dropped me in the Bay. I probably wouldn't have noticed. Especially if they gave me one more Long Island Iced Tea for the road.\n\nAnyway, let's just say that after waiting to use the single unisex bathroom that two -- yes, TWO -- dudes walked out of, I went in -- sorry, stumbled in. I did the squat-over-the-seat move (you ladies know what I mean) but as I went to stand, my legs said \"ha ha ha! You shouldn't be trying to use our muscles after consuming large quantities of booze!\" (yes, my legs spoke to me).  Anyway, luckily I did not fall down onto the seat, but rather forward onto my knees (wearing jeans, not a skirt, thank goodness). I clumsily zipped up and stood up. Anyway, long story short -- sucked to be me. Who knows WHAT is on the floor of this bathroom. Only my jeans know. (My boyfriend would not touch me once I told him I was on the floor of this bathroom).\n\nAs for what I remember of the bar itself, it wasn't really that bad. Pretty small, not too busy near the end of a Friday night. A few gay guys hitting on our straight guys, but that is all good with me. Bartender was OK. Drinks were OK. Me needing to practically be carried out of this place: priceless.", "author": "Lea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-21", "description": "Great bartenders, great prices, no attitude.  The place has seen it's ups and downs with recent change in ownership, but definitely on the up now. And....if you love margaritas, Jack, one of the happy hour bartenders, makes a killer margarita.  I've been on a quest for a good margarita since moving here from LA and Jack makes an excellent one.  Makes me feel like taking my clothes off and dancing without feeling like I'm ready to fall face down on the floor.", "author": "Dan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "Been coming here off and on for years. Have had my share of being disenchanted with it, but found myself coming back more frequently since their re-model and such. They also seem to have attracted a series of fundraising producers and that bring some fun events around. Not to mention the CHEAP drinks and friendly-cute 'tenders. I go there, on average, more than I ever did in years past, and see friends on most of those occasions. It's just a good fun local watering hole... I love 440, too, and Twin Peaks, but this seems to get my attention on most weekday happy hours. And, it's probably more fun with company.. their musical Monday's have my attention as of late, too. Have a drink and hum a tune (or sing aloud.. the place is pretty noisy, so you wouldn't have to worry much about being overheard/judged). ;-)\nEnjoy.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-07-19", "description": "Like prime beef on display in a butcher shop, patrons compete for seating at the wide front window, the better to see and be seen by passersby. They actually slide open for convenient walk-by cruising. Inside, it's typically loud and not particularly friendly if you're on your own, although the blaring music with its driving beat isn't conducive to conversation, casual or otherwise. A fairly mixed bag of a clientele, so both macho men and sweet young things have a shot at getting lucky. If you're still on your own at 2:00am, there's always Collingwood Park right around the corner for late night meet-and-greets.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-24", "description": "I like a bar where the music is eclectic to the point where I'm hearing Pebbles next to Rick James.  The crowd is older than some of the other Castro hot spots and as everyone else has pointed out, a real bear trap.\n\nThe bartender was super-friendly.\n\nI have to mention the smell as some reviewers have - it is vile.  It truly smells like a feces-filled diaper. I can't imagine what an earth is causing this stench, unless some of the deceased regulars requested to be buried beneath the floorboards.", "author": "Sean O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-27", "description": "Fast becoming my new favorite bar in the castro. Good strong drinks, . great bartenders, hot barbacks, clean, fun crowd, only thing I don't like is the trough in the bathroom, but that is what the other one is for I guess. New owners have done a great job,.", "author": "Dave O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-13", "description": "I like trashy bars as much as the next guy, but really can't they do something about that smell?\n\nIts not the average beer and piss smell that most dive bars have.  Its smells like diarrhea.  Last Tuesday I walked in there with my friend.  We both agreed that it was like having a diaper from a very sick baby waved under one's nose.  Anyone for cocktails?  We left right after the wall of smell hit us.  The bartender seemed surprised.\n\nI used to like this place, they should update their decor though.  Maybe line the walls with those colorful little air freshner pine trees as a pop art display / odor controler.  Until they fix that smell I'm at 440 or the Eagle.", "author": "Izzy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-06", "description": "As a straight-boy interloper, I must say that this place is no joke. Shirtless bartenders, bedroom eyes and some sort of a gangway/rafter thing going on over the bar. Plenty of dark corners for a straight couple to have a make out session.\r\n\r\nI do have one question, however. what, exactly, is a 'basket contest'? I have a feeling it doesn't involve wicker...", "author": "Big S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "I love this bar! It change ownership and they've really fixed the place up.  It's your local bar but people are friendly and they do a lot of specials and events so people are having a good time.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "I have a love/hate relationship with this bar. When the mood strikes me, I get pissy just walking by and smelling the b.o., but then some nights I want a solid dive bar without the hike to SOMA and then I'm in love.", "author": "Joe W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-11", "description": "Edge, I love you as bars go. I miss the bar-long phallus from 1999 but then all good things come to an end.\n\nThe staff are always friendly and clinetele and great mix of all types.. you can find Gucci-wearing guys next to leahter-clad daddies next to a guy who after a number of drinks seems to find his pants at his ankles...\n\nThe location is ideal and I always feel welcome and eager to return.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-06", "description": "I'm new to town and came in by myself one Friday night looking to get a drink and maybe meet some new people. I was a little surprised by the crowd, I guess it's kind of a daddy bar, and I think I stuck out a little. But the bartenders were really friendly, there were hot gogo dancers on the bar, and I spotted a queen in the corner so I decided to stay. I'm glad I did! Before I knew it I had a guy talking to me, telling me which bars to go to, and just making me laugh. Several other patrons approached me and either complimented me or struck up conversation. Everyone was very friendly. It seems like a great place if you're a single guy into 30+ hairy guys. Anyway, even if you're not you should check it out. It's a cool bar. I'm keeping a star because it's a little small and crowded.", "author": "Clint W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "this place always has a good vibe and wonderful customer service! also $2.00 drinks on tuesday!", "author": "Randy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-13", "description": "So much eye-candy! ... I don't hang out in the castro too often, maybe I should start. It makes me feel like a kid in a candy store except all the candy is plastic and I can't eat it! :-(\nAnyway, the edge was kind of like that -only good looking men, great drink specials, fun setup, a recipe for a good time... but not for straight women.", "author": "Rada I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "Okay so the word on the street is that they closed for two days and redid the plumbing ... and indeed, my dear queens...\n\nIt doesn't stink anymore!  I know, I couldn't believe it either.  I had to see for myself.  Pleasantly surprised.  \n\nNow we just need to lure in some nice handsome late-20s early-30s men, do some education about the appropriateness of \"gear\" outside the bedroom after a certain age, and we'll be on our way to a homerun cause it's a nice dark little bar with nice staff.\n\nMy name is Dwayne A. and I approved this message because I believe in stank-free bars that are welcoming to everyone.", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-31", "description": "Oh, The Edge, why did you get me so drunk? Was it so that I didn't notice that the place was crowded? And not just any kind of crowded, but crowded with bears who take up twice as much space as the twinks and muscle queens at the other bars in the Castro. Was it so that I'd stay in the dark back recesses of the bar where it was easier to breathe, but much harder to leave in any kind of a hurry? Or were you just trying to get into my pants, The Edge? Well, maybe you did and maybe you didn't because I'm not claiming I remember everything about Friday night's happy hour.\n\nDon't be fooled by the simple math logic puzzle. A \"tall\" Captain and Diet versus a \"short\" isn't just double the alcohol. No, because the amount of soda on top remains the same (once short squirt), so you're really getting more than double the alcohol in the tall glass.", "author": "Jere K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "What a great neighborhood bar.\n\nI've never been here when I couldn't find a seat or I didn't meet someone interesting.  Granted, the crowd is a mixed 30's - 60's group, but they're still fun.  Retro music, unique decor.  I shouldn't like it as much as I do, but it's almost always the first bar I stop in when I'm in town.", "author": "Brent R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "Great bear bar with very friendly patrons and staff. Cheap drink specials make it fun for bears and heteros alike.", "author": "Alexandra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-16", "description": "Sombre and stinklangweilig. I entered this slight manhole just for a short visit, as my friend demanded that we visit someone he knew indoors.  I didn't like the place, as I don't drink much.  The bartender liked me for not liking booze. Shucks, you do me too much honor!    \r\n\r\nEntertainment ensued when we learned how many queens and wimps at the Yoga hole next door complain about The Edge's noise.   This slapped my funny bone.   What in the mother frack is a yoga hall doing in the middle of the gay cloister? Unless I'm mistaken, The Edge was there before Yoga walked in.   I own a business above Harvey's, but at least I knew what noise pollution I was getting myself into!", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Friendliest bar in the Castro by far. Great bartenders, great music, and a diverse group of people make this a TRUE community spot.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-12", "description": "Met some random people who dragged us here.  We're 2 straight girls and we had an AWESOME time here.  The drinks are super cheap (and WAY strong) and everyone was amazing!  I LOVE this place!!", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "a huge shout out of thanks for The Edge Bar for hosting a great \"Irish wake\" for Barnard yesterday.  The manager Terry and the staff all ways do a great job of participating in events within the 'hood.  Thanks !", "author": "tom s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "This has become a local hangout for my friends.  I enjoy it's layout, bartenders, and patrons.  It truly is a neighborhood type of bar.  I like that.  Yes, the men in there can be very stereotypical, but you find that anywhere.\n\nIf you are looking for a place to grab a beer and not worry about what you are wearing...go to The Edge.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-09", "description": "Stiff drinks, stinky, loud and really f'in crowded Fridays. I always ask myself, \"why am I here?\" and then I remember - oh yeah I got bored at Dad's. I guess there aren't that many bear / levis bars in the Castro. DOH. \n\nBasket contest is a hilar and Friday happy hour is the busiest. People are friendly... almost too friendly if you catch my drift!", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-03", "description": "5 stars for cheap drinks and 2 for 1 happy hour.\n\n1 star for the creepy stalker who claimed he knew me from years ago and kept following me until I finally left.", "author": "Kenny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-03", "description": "This place rocks!!! It is my favorite bar to go to in the castro. The bartenders and customers are super friendly and the drink are great and are not very expensive.  This is a place to go to relax and visit with other people from the neighborhood or elsewhere.  NO ATTITUDE.  \n\nIf you truly like having a good time without pretense, then this is the bar for you.", "author": "Informed C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-24", "description": "Good bar if you like 30 & up white bearish/daddy types - otherwise nada.  Friendly enough crowd, and has a dedicated following.\n\nps. did I mention..\"white\"  ... do PoC ever get into this place?  Walk past every day and never seen any evidence to the contrary.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "An establishment that seems to be short-schrifted, even maligned by others, just because of the associations with the flag flown in front of the establishment (and no, not just the one rainbow flag, silly). After getting over my preconceived notions at the door, I walked in to find a cave-like interior, with a beautiful \"rainbow flag\" of feather boas adorning the ceiling. And quite the range of tunes, more so than you'd get at many other establishments in the area. No complaints about the drinks my friend and I had; the bar backs put on a nice show for us of just being silly together, and you could say personality, personality, personality. In spades! Perhaps I don't \"fit in\" with the average Edge clientele, so it was a chill place for me, no cruise-y messes hovering over me. Oh sure, I'm not opposed to visiting this establishment again.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "My usual bar is the Pilsner but now The Edge is become my bar.  I'm not much into hanging out in bars but I found the bartenders (especially handsome Scott) to be friendly.  It's nice to go to a bar in The Castro where a 40 and up crowd can hang.  As far some of the comments by the younger crowd that the Edge is an old crown, remember in a few years you will be part of that old crown.  Great drinks too!", "author": "Unemployed A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-12", "description": "Did I really go here?  Did I really make out with a buff daddy? How did I get home?", "author": "Ian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "Under excellent new management, the remodeled interior is fresh, the music groovy, the crowd diverse, and the drinks strong yet affordable. No need to drive to Guerneville for the signature Long Island in a giant Mason jar. Hot bartender Mike mixes it with his secret recipe: An easy smile and friendly attitude which keeps boys coming back for more, but beware of more than one more!", "author": "M F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-21", "description": "Let's get something straight .... I am, but this bar isn't!  I had a great time with friends here (all queer but me).  Hell, my friend and I increased the population of females in this bar by 200% when we walked in.  There was plenty of penis on the walls to remind me where I was.  So, I think as a straight female you should only come here if 2 conditions are satisfied: (1) you love gay people (2) you were invited.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-04", "description": "The Edge is much more than a bar, it is a community gathering place. Out of the mainstream for tourists, it fills with mostly local folk looking to relax, throw back a few and enjoy each others company. The bar tenders are knowledgeable, very friendly and quickly get to know you by name and your favorite beverage.  The crowd is more mature which is a refreshing change from the 20 somethings that over run nearly every other establishment.  Call me an old geezer if you must, but I prefer my fruit fully ripe, thank you.  Yes, the drinks will knock you on your keester, but that is a tradition at the Edge. If there is one word to describe the Edge, that would be comfortable in attitude. Fridays are a bit steamy though as the place fills up, as we would say in the Navy, from nuts to butts, for happy hour.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-08", "description": "I have quite a history with this bar. When I moved here several years ago it was Standing Room Only every day at happy hour, and they had constant fun events and fundraisers and handsome clientèle. In recent years that have had terrible management and the place became stagnant and grim, although the bartenders have remained top notch, for the most part. The business was recently sold and I'm praying that the new owners replace the management and somehow retain the sleazy feel of a good men's bar. Please no more drag queens and try not to start attracting RGs and/or Badlands overflow.", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "This was my first stop in San Francisco.  The bartendars were awesome!  The guys were totally cool!  I just liked this little bar and I intend on going back next time I'm in the neighborhood.", "author": "Clint S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-21", "description": "I walk by The Edge all the time and there always seems to be a happy crowd there, so why oh why don't I like it?  I keep thinking I will grow into it, but so far I haven't.  When it's crowded it's just way too crowded even when it's not it still smells.", "author": "Sean O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-27", "description": "As far as Castro bars go, this is one of my faves. I like my bars with a little grime, a little skeeze, a little sexual danger. The Edge provides. Three stars, why? Because the music usually sucks -- they play the crappy pop radio station on DMX or something most of the time. Only so many times I can hear the Mariah remix and still want to hook up with that daddy I've been making eyes at.", "author": "Fred L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-08", "description": "i semi-recall being here a few years ago and it being better than last night.  My friend who is more of a local to the hood said it went downhill after they redecorated and took down the giant penis shooting a wire of light from its tip from the wall.  Now they have those chinsy  lights on the wall that look like little cauldrons of flames.  And so many old folks, late-40's+.    It's rare to see old guys (or gals) in a hetero bar (versus a gay bar of course), so this was an interesting social drunken ponderment for a brief bit.  But, overall, not a lame place, not horrible, fine drinks and with company you can have a grand time.  The oldies were having fun, just a little-too-not-my-style.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "its my local and smells alot better thanks terry...its always a mixed bag in there thats what i like quite often they'll play your mp3 and the drinks will fire you up for the rest of the night..no pretense and all the bar tenders rock!", "author": "wilma m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-12", "description": "The Edge has gone down recently.  It definately used to be the place to be early on the weekends but not so much now.  It still draws a small crowd.  The place just doesn't seem as friendly as it used to be.  Drinks are cheap though.  I used to enjoy the performances they had on their little stage, but I guess they don't have those anymore.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-08", "description": "Nice bartenders, strong drinks... But why does this place always smell like bleach and feet? Ahhh... ok, well that explains the bleach, now about the feet...", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-17", "description": "Alhtough crowded, they have the best Friday afternoon happy hour and its where I usually get my weekend kicked off.  I've found the Edge to be friendly and the drinks well-poured.  My preferred place to hang out in the Castro.", "author": "Don O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-26", "description": "Went for dark tuesday and enjoyed it. I need to go back really soon and explore a little more. I don't remember most of what I saw last time. That warrants a re-visit, right?", "author": "James J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-29", "description": "You just have to love this place!  Great drinks, great bartenders and I think they play pretty decent music too.  Good the smell is gone, and I think there's always friendly people to chat with without the badland's attitude, however recently there has been this new guy who works there, \"she's\" kind of chubby looking with fake blond hair..total attitude of a bitchy queen...They need to kick her ass out! although I wont take a star just because \"she\" sucks!", "author": "Justme I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-21", "description": "You know, sometimes you're just wrong.  And I can admit that.  I'm actually re-editing this entire review and giving The Edge an ass-whoopin' 5 stars.  In my original review, I only gave it 3 stars and complained about the odor.  Well folks, it still stinks like hell, but I've had a change of heart nonetheless.  In the 4 months I've lived in San Francisco, The Edge has become my favorite Castro gay bar.  (Wait, is it necessary for me to say it's a gay bar?  Like is there any other kind in The Castro?)  What I love about The Edge is that it doesn't have to make any hype about what it is in order for it to exist.  They don't have to advertise underwear night for guys to get off in the back room like Daddy's does.  They don't have to create an event like Starfucker at Deco in order for guys to get naked in public and act sleazy.  Witness the fat guy drunk off his ass, dancing around with his pants around his ankles and making out with his boyfriend in the main room.  Totally unscripted.  Completely tragic.  Fucking hilarious.  I've even seen the burly bartenders get into it with stupid patrons and cuss each other out at the bar.  It is what it is, and I love it.", "author": "Flip C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-12", "description": "I heard that in the dark recesses of this bar you can get some action...but I wouldn't know anything about that. If you like your men in leather, but don't really care about actually seeing it, come to this dark dark DARK bar.", "author": "Michael G."}
