{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "I hosted an event for about 70 people here on a Saturday night. I had little time to dedicate to planning. The Treasury compared to the other 30 venues I contacted was incredible. The buyout was reasonable, the staff was so friendly, and the drinks were incredible.\n\nA small story to highlight this.. I had emailed that I was going to stop by to see the space. I walked in and my eye was caught by on of the employees who found us a table and brought chairs. This was before they knew who I was (so before they were trying to 'sell' me on the space). They were welcoming and friendly to all.\n\nElisa and Ryan with the rest of the crew were spectacular.\n\nI truly can not recommend the Treasury enough.", "author": "chelsea j."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-02", "description": "I'm not a fan of the treasury. It's crowded and awkwardly shaped to get large groups together talking. The bartenders can be slow at service, goofing around at the register while many are waiting. The drinks are SF expensive.\n\nOverall, I honestly don't see anything special to this place. It's clean I guess.", "author": "Dylan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "I work nearby so I used to come here quite a bit during non-peak hours. I'd probably rate the treasury a 3 during happy hour and a 4 outside of that.\n\nOn the weekdays starting at 4pm, the place starts getting crowded once the traders start getting off work. Around 5pm it's almost impossible to get a seat let alone edge your way to the bar. The seating area is scarce since the area  around the bar is pretty narrow.\n\nBesides the crowd and the lack of space, the super fancy cocktails are pretty tasty. My favorite was the Flash which they don't seem to serve anymore. It was a nice gin (or vodka if you prefer) with kiwi, cucumber and lemon juice. Super refreshing! Some of the other drinks are tasty as well so just make your way down their cocktail menu :)\n\nOther than the cocktails, the food is just okay. The pigs in a blanket with the mustard dipping sauce soaks up the alcohol quite nicely.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Great service, but it is so loud it there. Something about the noise insulation and not because the employees or patrons are loud. It's just - loud. :/ could barely hear myself talk let alone anyone else. \n\nAgain, great service. :)", "author": "Mandy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "I enjoy grabbing drinks here at anytime during the day. I've had drinks here at lunch time as well as around 3pm. It's a pleasant place with friendly service and delicious cocktails. When I'm feeling under the weather, they'll make me a Hot Toty. Their lunch food is good as well. My friend liked their Ramen. It's not a big portion but enough. My Caesar Salad was a decent size and the chicken was moist.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "3.75 stars.\n\nThe Treasury is such a treasure in many ways: It is in a great location ( deep in the heart of FiDi), It is a lovely space with high ceilings, a beautiful bar, interesting light fixtures, and most importantly.....they're serving before 5pm.\n\nDon't get me wrong the service was pretty indifferent.....as if we were inconveniencing the bartenders....but once she warmed up it was okay.\n\nDrinks are pretty amazing...but pretty expensive! Cocktails are 15-18 dollars.\n\nFood is pretty good: They serve lunch and than a nice happy hour menu. Food was pretty good: Deviled eggs were good. The chicken sandwich was pretty tasty.\n\nProbably the highlight of our visit was the making of one cocktail I ordered: The Tycoon ( it's a nice smoky drink and pyrotechnical floor show all wrapped up in one) https://www.yelp.com/user_local_photos?select_video=ouk27s6ZcwMHk_BKfgGfYA&userid=kroQYWSj-BhIEXT4VwLRHA\n\nI can see the Yelp rating but my buddy took me out for my birfday and paid ( thanks Alvin!) so freebies always make me rate higher!\n\nStop by for a cocktail and the amazing space!", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "Didn't get to hang around for too long here since I just stopped by while the person I was with grabbed a drink (bar hopping on a Monday, I guess that's when you know you go real hard). \n\nBartender was friendly and chatty. Even though they were closing up, they were kind enough to let us stop by and chill at the bar. Apparently they make a lot of their alcohols in small batches, so once it's gone, it may not be back for a while!\n\nSpace is nice, with the long bar as the centerpiece and tables to the side for food. I can imagine it being fairly packed for happy hour though. It's not your traditional bar in the sense that it's basically part of the lobby of an office building. Classy place.\n\nI'd love to come back and try their food sometime-- I've heard it's really really good!\n--\n\nEdit: Back almost a year later for the comida. Got the pigs in a blanket and deviled eggs. Verdict: tasty bar food, but very expensive for what it is (e.g. $15 for 1.5 eggs). Pigs in a blanket crust was layered and crunchy. Mustard had the right slight burn to compliment the appropriate saltiness of the sausage and pastry. The sausage was of good quality and felt like real meat.\n\nThe deviled egg: white part wasn't salted at all, and a bit hard, yolk was fairly standard but didn't wow. The toppings, while small in amount, were good quality.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Narrow bar, but refined cocktails for the FiDi after working hours! \n\nThere was this smoky cocktail that they lit to make the drink.  Pretty swanky!\n\nI like the whisky and dark liquor these days.  $15 bucks a drink on average from the menu.  It gets pretty crowded here and uneasy feeling of people being in my bubble.  One has to stress their voice to be heard at times. \n\nFood bites available. \n\nGrab a drink, chat and go for me.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "The Vibe: 5\nThe Music: 5\nThe Food: 3.5\nThe Drinks: 3.75\nThe Service: 5\n\nBest bartenders. Awesome atmosphere. Good for dates, friends and happy hour. The empanadas were delicious, the pork sliders were terribly dry. It was Negroni week and we ordered two drinks off of that menu. They were a bit above average. FYI, you can't drink out of the light bulb drink. Bummer haha. Cool spot though! I'd go back!", "author": "Chava S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "Came here for happy hour on a Friday because of my co-worker's suggestion. I arrived at 4-4:15 pm & the place was already getting crowded. Definitely need to arrive early (with your entire party) to secure seating. Probably better for smaller groups of 2-3 here.\n\nI secured a seat at the bar while I waited for my friends to arrive. Ordered the Watermelon Slushy & Roasted Squash & Burrata. Why? Because I could never say no to watermelon (my favorite fruit) & burrata (one of my favorite cheeses). The Slushy was pretty strong in alcohol, so I couldn't taste much of the watermelon. The Squash & Burrata on levain slices, on the other hand, was AMAZING. I would return just for it, but I think The Treasury's menu changes.\n\nOh yeah, I also ordered the Spicy Chicken Sandwich to-go for my bf, but it wasn't that great. Chicken was on the dry side & the sandwich didn't really come together. Wouldn't get it again.\n\nOverall, would come back during their happy hour during a less busy day!", "author": "Carol N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "Beautiful bar albeit small space., I'd try to make reservations if you are able to plan in advance. Cocktails will run you $14-16 but they were poured strong. I enjoyed their Old Fashioned with house-aged rye which was a neat feature.\n\nFood-wise my group ordered the empanadas, chips and dip, bruschetta and popcorn. I didn't try any of the food myself but it was noted that the popcorn looked better than it tasted.\n\nIt gets loud in here with the high ceilings and various groups talking, but we could still hear a bit of the music playing - some of the classic 90s hip hop.\n\nI like that their waitstaff use iPads to order, handle the bill, and email the receipt so everything can be processed on the spot and just expedites the whole experience.", "author": "Bonnie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "This is for lunch. Very expensive and subpar quality.  I got the feeling that it was 100% COSCO sourcing. Chairs have no back support. Service was pleasant.", "author": "Cathy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "REVIEWER # 104\n\nTreasury has a sexy vibe to it & I'm lovin' it! It's a wonderful cool lounge right in the middle of the Financial District (FiDi). Just like any other bar around the area, this place gets packed! But, the customer service is exceptional and the drinks are to die for!\n\nLocated in a 100-year-old Beaux Art Building; it provides a small, intimate bar lounge that offers dim lightening and candles. Just perfect for any occasion. Perfect location as its right down the street from the Montgomery Bart Station. It's convenient for everyone. I came on a Thursday night for a Meetup and was surprised at how beautiful the inside space was. I sat in the bar area and ordered a Shattered Ceiling, which consist of: absolute vodka, blood orange, manzanilla  sherry, sage and honey. Very tasty and delicious!\n\nThey have a good Happy Hour and grabs many drinker's attention. It does get loud, especially during the bar area. They offer seating near the windows (right by the bar) as well as in the back. Many people come up to the bar to order their drink and take it back to their seat. \n\nOverall, cool atmosphere. This place is poppin' during happy hour time and seems to grab a lot of attention. Prices are steep-no lie! Be prepared to cash out for drinks! But, it is in the FiDi area, so it's understandable.", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "I came here with a couple friends on a Friday late afternoon for some cocktails. They do not have happy hour, but they do have a wide range of drinks to choose from.\n\nI ordered the \"Selfie,\" ($13) which was a twist on a gin & tonic, with some honeydew cubes and lime. I found it refreshing on the hot day and really enjoyed it! One of my friends ordered the \"Blackberry Slush\" and my other friend ordered the \"Watermelon Slush\" (Both ~$15/each). I tried their drinks as well - all the cocktails were very well made and presented beautifully. The Blackberry Slush was particularly strong, but not sure if that was a bartender accident.\n\nWhat I really loved about this spot was the ambiance! The indoor decor was beautiful and there was a good amount of seating considering the size of this place. It's kind of located by a hotel right behind Blue Bottle Coffee, so it's a strange location but very cozy.\n\nPrices ranged from $12-18 for most cocktails. Although you can go elsewhere if you're looking for a cheaper happy hour, this is a really nice place to come with friends if you're looking to just chill and get some pretty cocktails!", "author": "Sunny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "I have been here a few times with coworkers to indulge in their cocktails. They are creative, tasty and pricey. It is an upscale FiDi group so expect to pay $14 for a cocktail but it is not your weekend night type of fancy lounges. They also don't have Happy Hour either time I came so I am not sure if they actually offers? Seating is also limited since it is a small space inside the lobby of an office building right next to Blue Bottle. \n\nCome here for some nice cocktails and watch other tech hipsters or financial workers sip on fancy drinks!", "author": "Athena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "After having dinner and cocktails at Leo's Oyster, we came here for a night cap.\n\nWe ordered some stuff to snack on because I wasn't full from dinner. Haha\n\nThe service was on point. \n\nThe drinks was good, but could be better. I was surprised they didn't have whiskey that night. \n\nThe food was great. \n\n\nI like the Treasury. I like the music. I like the chill vibe. \n\nI hope you give this place a try. Cheers!", "author": "Owie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Neat location with great drinks and great bar snacks! Comfortable couches and lots of counter seats. The door is the central door to the building as well (don't head to the sign.)", "author": "G F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "This place is unique and drinks are good but they are a little on the pricey side. \n\nWe went there on a Thursday night and pretty much full with people stopping by from their office jobs since it's located in financial district. Everyone was wearing suits so I wasn't sure if that was typical crowd or it was a special meet up.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "It's a small place but was very nice for an after work drink. It's pretty popular and all the seats and bar spots were taken up by the time I arrived at 5:50 but I snagged two seats at the bar through observation and quick movement. The bartender was really nice, gave us water and actually kept them full, made delicious drinks and was genuinely a good person to us.\n\nI didn't try the foot but the drinks are solid. It's also a cool location, it's basically the lobby of an office building.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "This has got to be one of the best bars I have been to in SF even though we had an odd interaction with the bartender. We asked what he was drinking and he said nothing but I'll take a shot with you guys (we didn't need any) and proceeded to pour out the shots and charged us $60 for three shots!! I thought that was a little ridiculous given that we already ordered 3 drinks and this is a pricey place. \n\nBut I got the slushee drink which was amazing and my boyfriends got two negronis which he said were some of the best we had had! \n\nAvoid the pricey shots with the bartender and you should be fine", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-06", "description": "I was meeting up friends for happy hour last week and had one requirement. Find a place by work I haven't been to. One of my friends picked The Treasury. I met them up on Thursday, July 28th around 5:45pm. It was packed, but I was the second one there and my friend had snagged a seat at the bar.\n\n*SMOKE & MIRRORS: Anchor Old Tom Gin, pineapple & smoked tea, lemon, Dale DeGroff bitters ($14)\n*PINKERTON: George Dickel rye, Blenheim \"Hot\" ginger ale, bitters ($13)\n*STANDARD OIL: Rittenhouse rye whiskey, Dolin rouge vermouth, Drambuie, coffee bitters ($14)\n\nSince there were three of us and it was super busy, the friend who got there first just ordered three drinks. The Standard Oil ended up being mine. Basically a twist on a Manhattan, so this was the most like my type of drink. The rest of the drinks were pretty and colorful, but everything seemed light and I like my drinks dark and strong. I saw a bunch of people ordering the daily slushie, so maybe that's the drink to get? It looked more like a drink I would enjoy on the beach versus a SF HH drink.\n\nMost bars in the FiDi are busy after work and this one is no exception. Drinks are fun, but taste wise not my type of cocktail. And the atmosphere was not really my type of place either. A little too uppity? More so because of the clientele than the bar itself, I think. Normally we'd have a couple rounds at a new bar, but we only stuck around for one.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Excellent drinks, bar tenders, service, and atmosphere.  Their house made vermouth was amazing--order a Manhattan with it! Excellent shrub cocktail as well.  Bar tenders were friendly and knowledgeable. Made 2 trips here during a long weekend trip.  \nHad the deviled eggs --very good--but $15 for 3 is a bit crazy. What is it with the price of deviled eggs in this town?\nDrinks are worth it!", "author": "Robyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Our office came here for happy hour yesterday afternoon. We made a reservation and were seated promptly. Our waitress was friendly and informative. I was impressed by the cocktail menu which boasted interesting drink combinations. I got the \"Flash\" which was gin, lime, cucumber and lemon. It was super refreshing and easy to drink. For round two, I got the \"Smoke and Mirrors\" which was gin, pineapple, smoked tea, lime and bitters. This was really unique and tasty.\n\nOur table also got a few small bites. I really liked the asparagus and burrata. I would come back for lunch to try their vegetarian udon. \n\nThe only gripe I have with this place is the music is way too loud/noisy and doesn't really fit with the atmosphere, especially during the daytime. Most of the clientele seemed to be business professionals and the loud hip-hop music gave the place more of a club vibe. I would have preferred soft jazz music so that I could actually hear my coworkers talk.", "author": "Joan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-14", "description": "The drinks were ok. The ambiance and the service definitely left something to be desired. Food was expensive for the small portion.", "author": "Bradley S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-27", "description": "We stopped by The Treasury on an early Saturday afternoon.  It's located in the Financial District and has the upscale, modern decor you'd expect.  Cocktails are strong, creative and service is on point.  Despite the lull before the later crowds, our bartender happily shared a sample of their slushy (strong!) and explained all the cocktail ingredients. \n\nPaso De Drake - $13. Served in a tall glass, this cocktail was strong but refreshing.  \n\nPurple Rain - $13. Colorful, fruity, and strong.  Hit the spot.  The names of the cocktails are more playful than the cocktails themselves which are all business. \n\nCheese Plate - $15.  The chef was out so they only had a limited menu.  I was disappointed we couldn't try the more interesting items.  Cheese was fine but not memorable. \n\nOverall, we had a nice time hanging out before hitting the town. The owner stopped by to say hello and ask how everything was and I imagine this is a work happy hour hot spot.  As it was, shortly after we arrived, a company party took root and the atmosphere was lovely and fun. \n\nThe Treasury accepts credit cards including American Express.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Great snacks and drinks. I always stop here and get drinks with my friends. Its in a great location so its amazing. The bar is dope and the styling is sick. Do recommend.", "author": "Beth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "This bar is situated inside a hotel with not too much of space. It's definitely fancy and their drinks are very aesthetically pleasing. I tried the Members Only ($13) and then the Pajarito ($13). Both incredibly strong drinks if that's what you're going for. There really isn't much space to stand around, but luckily my friend and I snagged a table after 15 minutes or so. With a table, we were finally able to order some food! We ordered the Roasted Squash and Burrata ($15), but then also added the Popcorn ($5). The burrata was good, but not really worth the value. On the other hand, the popcorn here is absolutely amazing! They flavor it with seaweed and twenty-five other seasonings. Whatever is in that seasoning is to die for! I would come back to The Treasury simply just for the popcorn --absolute must.", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I loved this place!  A beautiful space with great food, drinks and friendly staff.  \n\nI don't often go out after work, but when I do I'll come back here.  I had a couple glasses of cabernet - it always bothers me when the bartender doesn't warn you the glass of wine he's about to serve you is $16, but I digress...  my girlfriends and I shared the empanadas, the trout, the popcorn and the mushroom and burrata tartine.  Everything was delic!", "author": "Elise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "I love this place!! Right in the heart of the FiDi and a block away from the Montgomery Bart station...it's convenient and perfect for lunch or after work small bites/drinks. REALLY good food, well crafted cocktails, good wine (especially the flat Rosé) and great staff!! Oh they also have a good music playlist. \n\nI've had just about everything on the menu and it's all good. My personal favorite - the Banh Mi sandwich (amazing - perfectly seasoned) and the Mac and Cheese. Only downside is that the space is small with limited seating and they don't have any Happy Hour specials...Womp Womp. Prices are on the higher end ($13 drinks) but that's kinda to be expected anywhere in the FiDi.", "author": "Krystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "cool space and great cocktails, it's always nice when the bartender makes exactly what you are looking for,I also have the pork sliders which were really good.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "I met a business acquaintance after work for a quick drink and snack. We were impressed by the grown up vibe (no hipsters), excellent cocktails and great bar food. Not too crowded (though I went on a Monday) but definitely popular. We chose cocktails off their menu and were impressed with the execution and quality.  We also ordered their popcorn (with yummy herbal flavorings) and burrata crostini - both were perfect. I'll definitely return and am excited to try lunch.  The decor is luxurious and the architecture historic and interesting.", "author": "Jen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Very fast and attentive bartenders. Love this place! D wade hooked me up and made some great drinks. Will be back soon.", "author": "Donovan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Very cool bar. Our hotel recommended it this last Saturday night and we loved it, perfect place for what we were looking for. We wanted a casual bar with good drinks, good food, and good setting to catch up with friends and this is your spot. Although it is a bit tricky to find, as its in a building with an entrance that isnt that obvious but we found it eventually. Our server was SO NICE and the food was all really good. We will definitely be back!", "author": "B B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "This is definitely an after-work kind of spot. I bet it would be great for people watching. \n\nWe came late in the evening and it wasn't crowded which worked since we were able to grab a corner coffee table/couch/loungey chairs situation. \n\nI also like the long bar and the bank-themed decor with the dark colors, mirrors and chandelier are pretty cool. You feel fancy in here.\n\nDrinks here are $12-15. I had the Flash which was a rare green drink! It's topped with a kiwi and has nice notes of cucumber. It didn't seem too strong but was pretty good otherwise.\n\nBartenders are friendly and funny and I'd definitely come back!", "author": "Ninette C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "Decent happy hour, packed house on a Tuesday by 5p. Cool bourbon fire stick trick. Prices are \"SF typical!\" so definitely not a place to find $2 Chuck! Definitely got loud so practically had to yell in each other's ear but it made for a fun time.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-20", "description": "Crowded.\nClassy.\nCrafty (cocktails, obvi).\n\nI feel like next time I come to the treasury I should be wearing swanky shoes and a slick gray sports coat. A lot of variation in the cocktail menu with more atypical recipes than what I have seen. The bartenders are nice yet not overbearing and certainly seem to know what they are doing. Great place for a trendy drinks after work pitstop before dinner.", "author": "Miriam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "A buddy of mine took me here this past Wednesday after work. I love the space, the decor, and the vibe. Great service, just enough seating space and a good amount of floor space for folks to stand about while drinking.  The cocktail list is impressive, with customary pricing for FiDi.\n\nI was impressed with the Standard Oil, very good drink.\n\nCarlos, the owner, stopped by our table, and that enhanced our experience significantly. What a great guy, and an enterpreneur in the city of San Francisco.\n\nI will definitely be back.", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "Date & Time:  Wednesday February 3, 2016 @ 8pm Opening Night\nCompanion:  The Husband\nScene:  75% Hot FiDi Guys in Suits Sans Ties & 25% Hot FiDi Girls in Fitted Sweater Dresses w/ Over-the-Knee Stuart Weitzman Boots\nDecor:  Gilded Jazz Age; where Jay Gatsby Would have Parties for Daisy Buchanan.  Massive Gold Bar\nService:  Professional, Friendly, Hospitable 5-Star Service\nImbibe:  Standard Oil, Glass Ceiling, Shark Tank\nDevour:  Pigs in a Blanket, Blue Crab Roll, Liver Mousse\nTotal:  $63", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "This place is DOPE. My smoky old fashioned was off the chain. I don't remember what they called it, but essentially they take a torch to a piece of wood (I think it's oak). They put the glass on top the smoke to get that smoky aroma. It was a solid drink.\n\nWhat sets this place apart are the SLAPPERS (good music) they play there. The vibe is cool for sure. Forgot the homie who made my drink, but he was chill too. I want to say his name was Anchal? Sorry dude, if that's wrong. \n\nThe only downside, limited seating. But that's to be expected for a downtown SF bar. Sick spot, I'm def going to go back.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "Creative cocktails, convenient location. The downside? Unbelievably loud. Don't even attempt to talk shop. You'll lose your voice in 10 minutes flat.\n\nIf you despise sweet cocktails, order the \"AEW\" instead. I.W. Harper bourbon, grapefruit, muscovado, basil. Heaven.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Honestly such good service. Loved our servers (shout out D.Wade!!) keep it up!!!!\n\nFavorite drink by far by the group was the Flash. Also can't go wrong with the empanadas", "author": "Taylor R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "place is too cool for its clientele. but that doesn't mean stop coming. #twss\n\nmusic was cruntup (crunk x turntup) from the time i stepped in to the time i left. grownups trying to converse *in spite* of it; i was the only muhfuh moving *with* it. ::shrug::\n\nplus i met the pork adobo chef. i know nobody expects auth filipino flavor in a random FiDi bldg but brah rocks nightly.\n\n(^_^) Pork Adobo Sliders $15 (http://bit.ly/2gJGWpe)\ntenderrr; made me forget other dishes\nbun wasn't all that but the adobo tho\n\n(^_^) Roasted Squash & Burrata $15 (http://bit.ly/2hLXURQ)\nsante sata squash burrata #lionking\n\n(^_^) Empanadas $13 (http://bit.ly/2htzNrs)\nboom you go eat the cream joints right\nnow all you all you dip is this shhh ritere\n\n(-_^) Pigs In A Blanket $12 (http://bit.ly/2hrxQP6)\nalso dip in the empanada cream\n\nrestobar is a sliver of space beside the bldg foyay. i lucked out w some date vacating their seats as i walked up otherwise idk. saw a nice chunk in the back roped off for rsvp so they make do spacewise.\n\nate everything that interested me; when / if the menu rotates i should revisit to try more.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "For those of you who know me, you know I am the easiest guy to please when it comes to drinking.  All I need is a glance at the top shelf single malts, and I'm bound to find something.\n\nThe Treasury has a lot of craft cocktails, which is cool, but being the simple guy I am, I always reach for the top shelf. \n\nIf it were not for my office being down the street and a Blue Bottle Coffee in the building, I would have never found this place.  Be prepared for a lively crowd!", "author": "Ron L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "the space is beautiful, the bartenders are great and it's popular after work, but one less star for the ridiculous pricing. two Manhattans and two club sodas were $56 (!!!). I asked for a particular bourbon but nothing that should have been priced so outrageously. If I ever come back it will be for a beer or glass of wine.", "author": "Bob U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "This place is so awesome! The bartenders are really nice and super knowledgeable and make great drinks. The snacks are yummy. Had the Southside and loved everything about it! \n\nThey do get packed on weekends, but it's fine if you're able to be patient for drink art. I would try earlier on a week day or post work crew on a week day to get a more one on one experience. \n\nOne of my favorite downtown stops in sf!", "author": "Kelly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Carlos the owner was so welcoming and cool! Magically appeared exactly when we needed something (but never when we didn't). Deviled eggs are amazing!!", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "I came here for a work lunch recently and was really impressed.  It's tucked away inside a business building across from the popular Blue Bottle so I didn't have high expectations.  But I was thoroughly impressed.  It was a drinking lunch so I had the hard bargain and smoke & mirrors and both were excellently made.  For lunch I had the tuna melt and it was perfectly prepared and tasty.\n\nGreat spot for a little fancier drink or a nicer lunch in the Financial District.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "Great place to hang out with friends. Very chill. The music was awesome. The drinks were good. I would come back here! :)", "author": "J C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "Treasury, I used to like you. I thought we had a thing and then you turned out to be something entirely different.\n\nI remember the first time we met. It was pure serendipity​. Blue Bottle across the way was too busy and the line too long. It was Friday late afternoon so you were actually the better alternative. I just wanted to relax, have a drink at the bar and catch up with a friend. You couldn't have been better. There was a nice after-work crowd enjoying the same thing. I had found a place I could come back to again and again. I could chat with the bartender. You were perfect - right around the corner from my office.\n\nBut, you had to change, didn't you? The last few times I was looking for that same place I thought I knew. Relax, have a drink after a long day at the office and enjoy some conversation at the bar.\n\nUnfortunately​, the music was so loud I couldn't have any conversation. This happened on more than one occasion. Who were you trying to become - some club hot spot? Your new appearance might work certain days of the week (Fri or Sat?) or times of day (after 10PM?) but not at 6PM on Tuesday after work.\n\nIf this is your path to success, I wish you the best of luck. I'm regret that I will not be a part of it. In the event you change, I may some day come back to you. Until then, I'd rather stand in line at Blue Bottle.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "Perfect for 4:00 PM meetings.\n\nPeople think you are going to Blue Bottle, but instead you order something a bit stronger.\n\nSolid cocktails - tasty without being overly complex or clever.  \n\nCrowd is youngish, but bartenders and staff are attentive and quick.", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "This is a relatively recent addition to the FiDi. You would think there are enough bars in the area but clearly we need more given how crowded they all are. Treasury is in a cool older building, check out the architecture and detail outside and in the lobby. It is right across from Blue Bottle, so pick your poison.\n\nMy favorite cocktail here is the Tycoon, it is a drink and a show. They use special wood from a whiskey barrel to smoke the glass and the flavor is pretty strong and awesome. HIghly recommend it. The food is ok, you can't go wrong with popcorn or the buratta toast.  \n\nTreasury has always been packed everytime we have come here except the last time which was early on a Monday right after Thanksgiving. It was nice to actually get to see the nice decor, not be packed like sardines and actually get to talk to the bartenders and wait staff. Nice folks actually.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-25", "description": "SO SO SO loud during happy hour. Not really my scene; lots of tech bros and ladies in pant suits paying $20 for a cocktail. Also there are waiters who come around often to ask how you are but do not take orders (you have to order at the bar). Kind of weird.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "Close to the Montgomery BART station, I came here on a weeknight around 6 pm and it was packed! The crowds cleared a little bit by 6:30 pm though, so I guess it's busy with the early after work crowd. I got the Smoke & Mirrors because I was curious for the combination of gin, pineapple/smoked tea and lime. The lime was a slightly stronger flavor than the other items so it tasted more citrus; it was a very refreshing cocktail. I liked my friend's cocktail too.", "author": "James K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Crazy good bar program with intense attention to detail, delicious snacks, and an unpretentious and friendly disposition. Truly one of a kind.  A new mandatory stop in the FiDi.", "author": "Shona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "This bar isn't just legit. It's too legit to quit (hey hey!). And I mean that in a good way (with all due respect to MC Hammer).\n\nI'll be honest... I wasn't sure what to expect from The Treasury tonight. From the outside looking in, it looked like another crowded, douchey FiDi bar full of arrogant finance dudes. But looks, as we all know, can be deceiving. When I actually walked inside, I was delightfully surprised by how unpretentious The Treasury really was. Although it was super packed at 5:30pm, I had no trouble flagging down a friendly bartender to make me a drink. I ordered a Manhatten with Maker's Mark, and it was one of the best Manhattens I've had in ages. Not sure what their secret is. And for my second (and final) drink of the night, I ordered the Tycoon (their version of an Old Fashioned, made with Elijah Craig 10yr Single Barrel bourbon, smoke, muscovado, and bitters). Wow - this could be my new favorite bourbon cocktail. They literally smoke the cocktail on the bar with one of those torch-thingies that chefs use to make creme brulee. They somehow capture the smoke (and the flavor of the smoke) in the glass, and then mix in the rest of the ingredients. The end result is liquid perfection. It's $16, which is a bit more than I'm used to paying for a libation. But the presentation alone is worth the price of admission.\n\nWhat really blew me away about this place was the food. This kitchen isn't just putting out peanuts and charcuterie. They're serving gourmet bar bites that rival the best restaurants in town. My friend and I shared their Pigs In a Blanket, the Deviled Egg Trio (which is topped with caviar, piparra, and chorizo), and their Pork Adobo Sliders (braised pork shoulder, Acme baby bun, slaw, sambal aioli). These were probably the best sliders I've had in years. I would come back just for those bad boys any day of the week.\n\nService was top-notch. Friendly and attentive without being over-bearing. All our food and drinks came out in a timely manner. And even though the place was packed and loud, my friend and I were still able to have a conversation without a bullhorn.\n\nI've gotta say... The Treasury has won me over. And judging by the crowds, I'm not the only one.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "********************* 1516 **********************\n\nTreasury Bar is a cool spot right in the middle of FiDi in San Francisco. Beautifully designed, high ceiling, gorgeous chandelier and the couch in the front if you are able to score a reservation there.\n\nThe bar offers plenty choices for you to choose, cocktails list are well crafted by their famous mixologists. \n\nThe bar bites are also inviting. I tried the deviled egg, the house cured trout, and the date were all good. The Louisiana Blue Crab roll and the oysters are always good choice. Don't forget to check out their caviar sekectio as well from $79, $105, $130 per OZ. After all, this is just some change for you if you are a banker in FiDi right?\n\nService was attentive by the bartenders. The bar filled up quickly by 4 PM. It's definitely a hot spot now, Spring 2016! \n\nI can't wait to come back with a banker for that caviar fix, seriously!", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "Service was solid. Staff super friendly. Food... well, the miso ramen tasted like instant ramen in a weak beef broth. Again, the staff was really cool and attentive, but I would't go back unless they drop the price of that Top Ramen down to a dollar or two.", "author": "Matthew I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Chill place to get a drink at the Financial District. I love the high ceilings and the clean, trendy yet casual vibe.\n\nWake up the next morning and walk across the lobby of the building for some Blue Bottle Coffee.", "author": "Teri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Went here for an anniversary reception.  Entire space was reserved.  They served a bunch of appetizers, really good. They even allowed my friend to serve her cannabis eats.  Really attentive staff.  Didn't even know this place existed, but it's really nice.  Music was cool, can't comment on the crowd since it was a private party. Cocktails were on point.  Would definitely come here again.", "author": "KB B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "I enjoyed the Treasury's gorgeous interior and creative, upscale cocktail program. I had a gin-based drink, The Flash, which had a perfect citrus bite to play off the juniper berry's heavenly distillate. A slice of kiwi on a swizzle stick added a swank accent. My colleagues enjoyed the business and finance inspired drinks like Standard Oil and the Glass Ceiling (though maybe that name is borderline sexist?). \n\nVisually, it's a treat, with a gorgeous, long bar beneath chandeliers and a generally sparkly, high-ceilinged interior. We had a high top, around which were circled about 10 of my fellow worker bees. Our server was friendly and efficient, and no one had to wait more than a few minutes to place an order. That doesn't mean you'll be knocking 'em back two minutes after walking through the interior gates. Wine came quickly, but the cocktails took awhile, especially as the crowd grew around 5:30. And this was on a Monday night mind you. \n\nIs this a hot spot in the making? I think so. $13 cocktails aren't cheap, but I think the location is on you can bank on. Get it?!", "author": "Ted R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-22", "description": "The ambiance is good, the cocktails are average at best, and the service is solidly below average. All the seating away from the bar is marked as 'reserved,' but they give that seating to walk-ins that they seem to deem as worthy. I was pointed to the bar to vie for a bartender's attention...and the bartenders didn't seem eager to serve me. Oh well, some more wasted space in FiDi.", "author": "Bobby N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "I was starting to think this place was never going to open, but then to my surprise I saw signs of life last week when passing by to grab lunch. The bar shares the lobby of the building with Blue Bottle Coffee and isn't especially large, but does make the best of the space. My only complaint is that the bar curves out at one spot where there is a table placed against the wall. Add in some people sitting at said table, people standing at the bar and servers attempting to move back-and-forth past that point, and, well, I think you get the picture. (Suggestion: move the table.) That aside, the decor of the bar is actually quite appealing.\n\nMy girlfriend and I were waiting for some friends to arrive in the city, so we had plenty of time to explore the menu. We were able to grab a table and a server promptly came over to take our orders. Our server for the evening was extremely nice and attentive: this made a great first impression!\n\nWe mainly stuck to their cocktail menu, but they have some wine and beer offerings in addition to an extensive Sherry selection.  In any case, here's what we had:\n\nCOCKTAILS\n- Shark Tank\n(Cutty Sark 108 scotch whiskey, huckleberry & coconut shrub, absinthe, lemon)\n- Flash \n(Aviation gin, kiwi, cucumber, lemon)\n- Paso de Drake\n(Kappa pisco, fino sherry, Velvet Falernum, grapes, lime)\n- \"AEW\"\n(I.W. Harper bourborn, grapefruit, musovado, basil)\n- Standard Oil\n(Rittenhouse rye whiskey, Dolin rouge vermouth, Drambuie, coffee bitters)\n\nWINE\n- 2011 Peregrine Cabernet\n\nFOOD\n- Half Dozen Oysters\n- Cheese Plate\n- Louisiana Blue Crab Roll\n\nAnd the verdict is...everything was great! Well, my girlfriend finished off the oysters before I could get any, but I'll take that as a rousing endorsement. In terms of food, the crab roll was my favorite. And in terms for drinks, I would pick the Shark Tank as my favorite with the Flash and Paso de Drake being runners-up.\n\nI'm eager to come back to try out the rest of the food/cocktails and possibly dive into the Sherry menu. I'm also curious to see what crowd this place ends up attracting: there was an interesting mix of an after-work crowd, a trendy evening crowd and some random football fans -- Super Bowl City was located a few blocks away -- on the evening we visited.", "author": "Rodney G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "It's the perfect after-work spot for drinks! I just wish it wasn't so crowded. It's a pretty small space and can start to feel somewhat claustrophobic after a while.\n\nIt is a bit on the pricier side ($13 cocktails), but that's to be expected in the middle of FiDi. I stopped here for a quick drink with my brother before we headed out for a networking event. I had the Flash (Aviation gin, kiwi, cucumber, lemon) and it was delicious and refreshing.\n\nI'd love to come back to try their food if I can snag a table. Caviar, oysters, and cheese? SIGN ME UP. It's close to my office so hopefully I'll luck out soon. :)", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "I've been here a couple times and all the tables are reserved, and all sections are roped off. I was literally standing just inside the rope to order a drink, and some smug bro bussing tables tells me to move outside the rope. Gotta thank this place for bringing the Vegas club screen to SF happy hours. If you're looking for a happy hour spot in this area, I'd recommend heading over one block to Per Diem.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "new cocktail bar in the fidi - so we obviously had to check it out. it's in a historic building, right next to the new(er) and big blue bottle. the decor is classy and it definitely makes you feel pretty fancy. came in on monday at 830 and it wasnt busy at all - suited us just fine since we were just grabbing a few after a long day.\n\nbar area is huge; there are a few two-top and four-top high tables too, and a sofa type seating for 6-8.  service is quick - they poured water and offered us additional menus as soon as we sat down.  they have about 10 cocktails on the menu, along with beers, wines and bar bites. i'd be interested in trying their food next time, but we had dinner already.  we ordered 9 drinks between the 3 of us, some were duplicate, and most were pretty delicious.  the standard oil is like a manhattan, the flash is refreshing and fruity and yummy, smoke and mirrors is nicely balanced.  definitely consider this spot if you're planning happy hour! prices are classic sf fidi, so be prepared to spend a bit on your drannks :)", "author": "Christina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "Had a small client outing on Wednesday at 4:00pm. I arrived an hour early and asked bartender if I could reserve a table (there were probably 5 unoccupied tables at the time in the reserved section). Was told by bartender it would not be a problem, to just sit at bar until my guests arrived. At one point, after securing my tab with a credit card, I asked bartender where restroom was, she told me, I left my drink at bar counter, went to restroom and upon returning, found someone in my seat!!! I asked bartender about it and she said \"oh, sorry.\" When my guests arrived, asked bartender for my table, manager came over. I told her bartender had promised me a reserved table when my guests arrived and manager said \"That is not true.\" When we went to bartender to determine who was lying, bartender had nothing to say. Apparently cat got her tongue. After discussing with manager for a moment showing my displeasure, I dropped it as my clients were waiting by the door. Manager took us a cramped table in a tight corner where we had drinks for an hour. Bartenders who are clueless, a manager who is cold and displays the worst customer service ever, (suggests a customer is lying???). Being from out of town, all I can think of is that locals get preferential treatment. Will never return.", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "This place is a little hidden because you can't see it from Sansome Street.  It's on the first floor of 115 Sansome.  You have to walk in the building, then you'll see it.  It's a pretty small place.  For drinks, I had the standard oil and my friend had the glass ceiling.  We were both very impressed and we thoroughly enjoyed our drinks.  They didn't taste super strong (disclaimer: I have a high tolerance for liquor), but I know they were boozy because we ordered a bottle of wine after!  LOL  We also tried the Louisiana blue crab roll and chilled white gulf shrimp.  Both were delicious.  The crab roll is on the smaller side, but I thought the shrimp dish had a generous amount of shrimp.  I would definitely visit this place again when I'm back in the area.", "author": "Lan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Aside from a fantastic staff, great vibe, great music, and great drinks...I've made friends at this place. I'm tempted to call it the best bar in SF. Cheers", "author": "Nich D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "I have a love/hate relationship with New York City.  I love reading about THE City; keeping up with its art, design, architecture, fashion scene; and missing the directness with which residents engage with each other.  But I hated being there on that 3x7 island.  The Treasury simmers of that Manhattan attitude - from the cosmopolitan cocktails (no pun intended), the unspoken suit-and-tie dress code, and the bravado with which the patrons carry themselves, be they being flirty or flirting with business dealings.  This is probably as close as I get to stepping back again to NYC.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Excellent drinks and a cool vibe right in the heart of FiDi. The service is excellent - shout out to Dominick for being such a great server. Will definitely come back and recommend this place to everyone.", "author": "Christian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "Went here with a friend. While it was pretty crowded, it was during the holidays and the drinks were great.", "author": "a f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "The Treasury really is as good as it gets - great music, awesome drinks and really nice servers that truly care. The only thing that would make it over the top would be letting down the left and right side curtains at night to give it a genuine bar vibe. The lobby is beautiful but the bright lights can sometimes bring down the allure of such a great spot. \n\nI would highly recommend it to anyone looking for an after work scene in the Fidi.", "author": "Jean H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "What a fantastic place.   Great space.  Visually appealing and warm. The staff are fantastic.  Just met the owner Carlos and what a nice guy.  Very helpful.  Introduced us to a Spanish white we had never tried.  \nWine list and beer list is small but solid.  Great bar selection though.  I used to work at 225 bush across the street and know the neighborhood. This is a unique and welcome addition.  Would like to see more seating at the bar but enough room to move around. \nGrab the couch seating and get a view of the bar.", "author": "Darius D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "Great bar with strong drinks, friendly bartenders and great music choice. Great ambiance of an after-work crowd but still get people from early 20s (myself included). What else can you ask for?", "author": "Eve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "Members only, All gold everything and luxury suite are my fav here! The bar bites are good too!", "author": "Aya J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-27", "description": "This place is HOPPING for happy hour, but we came by later on a weekday and it was --dead--. That said, chill bartenders and a pretty solid cocktail list.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "Okay so I've been here a couple of times. The cocktails so far for me have been too sweet or too sour or too...something. I've had more balanced cocktails. Maybe I'm getting the wrong things, but I just can't get into it. One cool thing that I did appreciate was that the bartender was nice enough to let us sample some of their blended specials for Cinco De Mayo. Solid. Thanks for that! However, I didn't really end up liking them either. One was a strawberry tequila cocktail/margarita? The other was a blended pineapple cocktail of some sort. I personally just felt each was too sour or tasted strange to me. Service wise, they were friendly, but I would probably go elsewhere for drinks. I think they have bar food/snacks as well, but I haven't gotten a chance to try them. Maybe those are worth going back for? Perhaps? I would go back again if someone else wanted to go, but nothing I tried there was standout to me.", "author": "Mariel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "It's very nice to stop in here for a drink after work.  The bartenders were kind and very attentive, especially given how crowded it was.  I am a fan!", "author": "Jessika S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Came here last week after work with my boyfriend and some friends. It's definitely a hidden spot. Tucked in an office building across from a blue bottle. It was a bit crowded due to a private event, so we hung around the bar for a bit scouring for a table. A host/manager(?) noticed we had been waiting and came up to tell us that a party was about to leave. He was more than helpful going completely out of his way to make sure we got the table even in the first come, first serve environment.\n\nMust try drinks:\n\nSeasonal slushie (we had watermelon)\nMembers only \n\nSide note: A week after we came, my boyfriend noticed he had been overcharged. When he reached out to the staff via email, they responded promptly even going so far as to call and text him within a half hour. Obviously these kinds of things are annoying, but mistakes happen and what matters is they rectified the situation and professionally. \n\nLooking forward to coming back for another slushie!!", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Cool spot, gorgeous original floors and antique chandelier. The drinks were really delicious and the service was great. Will definitely be back!", "author": "Vinitha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "The drinks were great- they had tons of creative cocktails with something for everyone. We got a selfie, which is basically a fancy gin and tonic with some added fruit. Definitely recommend. If you come with a group of 6+ you get to sit in their cozy couch areas. The ambiance was nice, well decorated, clean. It wasn't very crowded on a Saturday around 5/6 and it was easy to hold a conversation.", "author": "Claire G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "6pm on a Friday. Crowded, but not overwhelming. A friend and I were able to grab 2 seats at a bar without a problem, I think we got lucky. They have different a rotating slushy drink special and today, it was a watermelon slushy. Super refreshing! \n\nCome here if you want a bumpin playlist (Flume, Disclosure), grand interior decor, and yummy complex cocktails!", "author": "Erica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-15", "description": "Holy moly, their specialty cocktails are so, SO sweet. If that's your thing, then you would love this place. Otherwise, you'll feel like you're drinking syrup. I had an immediate hangover after 2 of their drinks due to all the sugar in it. Their drinks are around $13, so it's pricey but typical of the area.\n\nThis place gets super packed too so arrive early if you want a table.", "author": "Venus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Chicken liver mousse: 5/5.\n\nPopcorn: 5/5.\n\nVibe: 5/5.\n\nSeating: 2/5. Limited seating.", "author": "Clarence H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "I went to the treasury early this week for a happy hour. I thought the place was very interesting though gave off the vibe of a ground floor hotel bar. With that said, the drinks were amazing!! I would definitely recommend the pisco sour cocktail--it was so good my girlfriends and I got ourselves 3 helpings of that. It was light and extremely refreshing--and best of all, no bad aftertaste or headache. The bartender was on point and the convenient location will make me go back again for happy hour after work, since it's a short 3 blocks from my office. All in all, I'd give this place a solid B for decor and an A for its cocktails", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Newly minted bar.\nStrong cocktails lead to tall tales. \nFi-Di liquid gold.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "I've been meaning to try this bar out for a while. It's a great location--perfect vibe for the FiDi. Drinks are good and strong--and priced for the FiDi for sure. Definitely will be back again soon.", "author": "Juan T. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "Things I like about The Treasury:\n- The drinks are creative and well made\n- The bar is long (aka plenty of room to saddle up) and service is on point \n- The big windows so you can sit and drink and observe others that are not sitting or drinking and feel superior\n- Music choice is odd yet perfect\n\nThings I really really like:\n- The decor (hello sparkles and metal)\n- They manage to balance being clearly upscale catering to downtown crowd with a supremely chill vibe*\n- The bartenders are knowledgeable + willing to share knowledge, I always end up trying something I have never had before\n\nI really didn't want to use \"vibe\" in this review but couldn't think of a more suitable word", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "This is the place to grab really good cocktails for happy hour! They make really good slushies like the blood and bougie. I love that the vibe is sleek and sexy and they play really good hip hop music. It can get really crowded sometimes since the place is pretty small. The bartenders are really sweet and gave us samples of their slushies(so good) and a free shot. Definitely love it here.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "Nice looking place, serious looking, looks like the financial district. The bartenders were attentive and chill, had all the information. My cocktail was fair not amazing. I had a cheese plate that was probably better suited for two but solid! I'd totally do business here; it's impressive.", "author": "Tommy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "I love the vibe, the food, the bartenders. Everything is perfect at the treasury! Also, the flash is my favorite drink in the entire city.", "author": "Meagan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "What a cool hidden gem! It was pretty busy with the after-work crowd even when I went around 9pm on a Tuesday- but it cleared out by 9:30ish. I had the \"selfie\" which was fantastic and came with a whimsical paper straw. The food is also great: popcorn, pigs in a blanket, sliders- everything was fantastic. It can get loud, but what bar doesn't? Highly recommend!", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Bruh O_O I'm definitely a firm believer in HATING BEER.... Until they introduced me to a couple that made me think the complete opposite. \n\nPlus there Cognac collection is any thing but basic... I asked for Hennessey they gave me HINE. Best experience I've had at a bar so far.", "author": "Donminic W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Awesome drinks - get there before the happy hour crowd or on weekends for some breathing room  :)", "author": "Morgan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Was in SF attending a conference. Came here with a group of people. We came for 1 drink... we stayed for 4 rounds. All the drinks were REALLY well made. I plan on making this bar a stop every time that I'm in SF if I can.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Awesome spot, minus the crowds on Thursday nights. The selfie is a great take on the traditional gin & tonic!", "author": "Erin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "5-stars for sure!\n\nDelicious drinks, wonderful ambiance, convenient location, and such great service. I will definitely be returning to try more of the delicious cocktails.", "author": "Miranda J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "An OK bar with interesting drinks, but very limited menu.  The service was very professional without being stuffy.  On the downside I noticed on the check that they calculated 'for you' tips at 18%, 20%, and 25%.  Really 25%???  Found that completely obnoxious, and never seen that in any other restaurant or bar.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Awesome spot, very chic, great drinks, Andrew was very laid back but took his drink making very serious, which is an amazing combo, had a great time and can't wait to go back. Had the Standard Oil, super tasty, and a locally brewed Kolsch recommended by Andrew which was bomb.com.", "author": "Darius D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Well that's the best drink in SF! And the food is pretty great too. Tried several different drinks on the list and also gave the bartender the go ahead to make something else. Really don't know that I've ever had better drinks. Had a few things to eat that were perfect. Will be back!", "author": "Jake P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "Cute little place tucked in the Fidi. \nGood for a quick HH place but they seemed to be open on the weekends too which is pretty cool. Good cocktail menu / sherry menu.\n\nWould recommend calling to reserve a seat if you are going on a date / meeting.", "author": "Yas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "This place is amazing!!! Beautiful ambience, super friendly staff and really tasty appetizers. The decor is beautiful, with high ceiling, gorgeous chandeliers, lovely couches.Very chic, and trendy!!!\n\nThe bar offers great selection of drinks and of course you will love Izzy and Achel, the most amazing bartenders in San Fransciso, who do their best to please their customers and always with a smile.\nFrom the first time, i went there, i have been hooked and make sure that i go there for at least once a week!!!\nLove it!!!", "author": "Roshi Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "Friendly staff (including the \"door guy\"), tasty drinks, and cool little details such as using a blow torch on a piece of wood to create \"smokey\" drinks and little metal doodads on drink toothpicks (seems costly from a business perspective, but we definitely paid for it + it's cool).", "author": "Drew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "The treasury is a neat spot for drinks. Its definitely on the pricier side but you pay for quality. My favorite drink was the smoked old fashioned. The bartender took a blow torch to the plank of oak and then placed the cup upside down to capture the smoke before making the drink. Huge fan of the presentation. Come check it out!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "This was a fancy bar off the lobby of a building in the financial district.  We got seats at the bar, had beers, and enjoyed the quiet ambiance.", "author": "Myles L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-07", "description": "Customer service is fab, drinks are too pricy for the quality of the drink.", "author": "River D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Upon getting there around 6pm on a Thursday, there was a greeter who was perfect for his job. Super friendly without being phony. When I said I'd wait for my friend outside, he rightfully encouraged me in so I could try to establish a spot. I'm glad he did because it was packed with a 30-something crowd (perfect!) and, it turns out my friend was already inside too. I just couldn't see her because of all the patrons.\nI forget what they were called but the gin drink I ordered came with watermelon/ginger ale (I think) ice cubes, which was refreshing toward the second half od the drink. \nThe appetizer we had was delish: Burratta  (sp?)\nThe owner himself was bussing tables and making friendly conversation and recommendations, as requested. He told us that he had opened several other bars successfully for other owners but this was his first of his very own. He designed every detail - to include the bead at the end of the cocktail skewer and the industrial looking aprons they wore.", "author": "Vanessa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "A new find! My BF introduced me to this spot, conveniently located in the heart of the Financial District, at Sansome & Bush. Love the name, relevant and clever. Beautiful bar and a tasteful decor. Drinks are great and so is the food. The vegetable wrap is amazing, could become a favorite of mine. Highly recommend this place, but be aware it gets packed in the evenings.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-02", "description": "Great drinks. Too loud and crowded. Unsmiling bar-tender.", "author": "Mi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-17", "description": "Not enough seating for the crowd it gets for happy hour. Cool spot, easy to find, and friendly service.", "author": "Bryoni L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "Great place for a good quick business lunch. Not too crowded, quick service and good food. Happy hour bar scene is lively, gets a little loud but think that's just part of the atmosphere.", "author": "Greg D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "Absolutely delicious cocktails and service is absolutely exceptional, even on a busy Thursday night,", "author": "Laura W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-06", "description": "Delicious cocktails but the configuration of the place is very poor.  This place is good to grab A drink (on the earlier side) but anything more, you're basically spending your time maneuvering, bobbing & weaving out of the way so people can get up to the bar...That to me, doesn't make for an enjoyable time!", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "im a fan of the cocktails but it is super crowded so....yeah\nhip and trendy vibe with lots of worker bees coming in for drinks after a stressful day at work of probably checking their snapchats and instagram\notherwise the staff is great and attentive!'\nwould love to come back and try the caviar bar", "author": "Marie r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-14", "description": "Eh.  Not a spot I would choose to go back to apres work.  I thought the lay out kind of stunk and it was too small and if you're not sitting you're in everyone's way.  It was also not the crowd I expected for where it was situated and the fact that it was happy hour time.", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "Coming to this place is like the worst experience ever.  The bartenders act like they work in the hottest club in LA. No good looking people come here. It's like grinding my teeth on asphalt. #StayAway", "author": "eli o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-13", "description": "Had a drink here on a recent Saturday night. It was early so there wasn't a scene. The drinks were on the light side so I don't think I'll be back.", "author": "Robin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Proper ice, a wide selection of whiskey and rye, and an impressive crowd for late on Monday evening; what more can one ask for? This well-appointed cocktail bar boasts more than the average bar: solid beats, soulful ambiance, and a staff that knows how to pour.", "author": "Rudy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "A great place to get a high-quality cocktails and tasty bites.  Good addition to downtown if you're looking for a cool place to hang out. The Standard Oil is highly recommended, and the oysters were plump and fresh.  A well edited selections of wines by the glass as well.", "author": "Rakesh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Stopped in for some drinks last week.  Had the Standard Oil which was fantastic.   Great vibe, and cool decor.  It's like someone put a bar in bank.   It can get loud and echo easy, but don't worry.  Have a second Standard Oil and you'll forget about the noise.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Bartenders are hella cool. Drinks are always on point. Lunchtime food menu is the shit. Pork banhmi sandwich", "author": "Martin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "This is the classiest bar in SF. The vibe isn't pretentious and the bartenders are all super cool. Would highly recommend if you're in the Financial District or have out of town friends who want to have a cool bar experience! It's across from Blue Bottle so it's also really easy to find.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "My friend and I stumbled onto this fine place for a late lunch. Fantastic fresh chicken kale salad. Looking forward to sampling the rest of the menu. Clearly, they pay attention to everything. Love their beer on tap and Carlos the owner is super friendly and nice. Will definitely be back for happy hour.", "author": "Denny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Wow what a great spot! Ryan and his bar staff are beyond educated... Make your own mix or take a recommendation from the staff... Amazing handcrafted cocktails and amazing straightforward bar food... Try the blue crab sliders and don't look back! You would be hard pressed to find a more accommodating staff!", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "One of the best cocktail bars in the fidi. All drinks are LA inspired cocktails with real sophisticated taste. The place gets popin on for happy hour so be sure to get there early!", "author": "Chandler H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Solid after work hangout for wine and cocktails. Get there before 5pm if you want a seat as there are few bar seats.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "This is by far one of the best bars in SF.  Recently they started serving lunch and it's now one of my favorite go to spots for lunch downtown SF.  The food is excellent and the prices are surprisingly reasonable. Haven't tried anything I wouldn't want to order again and again.", "author": "Carrie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "The sausages rapped in cheese are really good. Loved the service. Owner gave us a coconut drink!", "author": "Hanna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "A great bar who really cares about the details.  We ordered some drinks and just as I started to sip my cocktail the owner Carlos rushed over and told me the syrup had gotten made wrong in the kitchen and didn't want me to take another sip. He made me a new drink, apologized and made the whole thing no charge just to show how much he cares about our experience.  A top notch establishment", "author": "Erin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "not bad for a place to grab a quick drink, nice setting, has some unique drinks that were good", "author": "Grapes T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "I was there last night with friends and watched something fall from the high ceiling right in front of another patron's face! It shattered drinks and everyone at the table seemed to be in shock!!! I don't think anyone was hurt - but can you imagine sh*t falling from a ceiling inches from your head??? No THANK you! Check the building safety permits!!!", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "Great atmosphere. Open, bright and legit music. Diverse cocktail menu with select brews on tap. Recommend for smaller groups looking to relax and have fun.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-30", "description": "A very pretty space for overpriced cocktails and a limited selection of bar bites, served by mostly bro-type bartenders.", "author": "tw s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Great drinks and awesome bartenders. Great addition to downtown. Their watermelon slushy is superb. The decor and music are on point.", "author": "Abram C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "New GM Ryan an absolute dreamboat.", "author": "W. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Very cute hidden cocktail bar downtown. Love the high ceilings and open feel. I could see myself hosting an event here, it's a nice size for small events likely 50-70 people. Although it just opened I think there's potential with the very fresh produce driven menu.", "author": "Kaego R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Excellent spot for after work drinks and apps.  usually great local crowd", "author": "Gueric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Stopped in for an after-dinner drink because our hotel was down the block. Amazing cocktails (try the tycoon if you like a serious drink), great atmosphere, and fantastic bartenders who will help you find your perfect drink.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Across the board solid. Drinks are exquisite (things I would not normally order (something with a strawberry shrub) were delicious) and the food is waaaay above average for a cocktail setting.", "author": "zach b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-13", "description": "NIce place. Not too hipster, not too tech bro either. Just right.", "author": "V. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "great moscow mule! too bad, hard to park around there", "author": "Lorna L."}
