{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "The Saratoga offers excellent food and fabulous cocktails in a very cool atmosphere.  Being the sister restaurant to Spruce, I had very high expectations for the food, and they were completely met.  The two story cocktail bar on the corner is a loud and dark venue with loud music, but it is a fun atmosphere.  Reservations are likely a necessity, and I would never try to come in without them.\n\nThe staff is very helpful and attentive.  While a bit slow to take orders, I think that there was an initial deluge and every other need was quickly met.\n\nThe venue is elegant but casual.  Because of the dark nature of the place, I didn't feel like a loser in my jeans and sweater, but I also would have been quite comfortable in a dress for a night out on the town.  Expect bistro towel napkins, lacquered tables and Edison lights - ubiquitous but it works.\n\nThe drinks are excellent and meet every flavor profile.  Each of us had a drink that we loved, even though we did not necessarily love each other's.  I had the Sibling Rivalry ($15), which was made with Rye, Canton Ginger, St. Germain, Regan's & Peychaud Bitters.  It was a perfectly executed, smooth and toasty drink that made my own day of dealing with sibling rivalry feel SO much better.\n\nSpeaking of sibling rivalry, there is no kids' menu but the place it not family prohibitive.  No crayons, but they were served just as well as the rest of us.  The LOs enjoyed having a Chicken Slider ($8 each) and splitting a order of the tomato braised kale ($10).  Both dishes were well prepared and used quality ingredients.\n\nDM and I split the Branzino a la Plancha ($28), which was ridiculously good.  The perfectly cooked and fresh fish had crisp skin and was alongside black forbidden rice and this sweet and roasted Puttanesca sauce that had just the right amount of salt.  We also shared the roasted green beans ($10), which were sweet and crunchy haricots vert tossed in a sweet chili glaze and topped with chopped peanuts.  These were very good, but the Hen of the Woods Mushrooms ($11) were OUT OF THIS WORLD! 6-8 crunchy fried and woodsy mushrooms were practically meaty and were pushed over the top with a tangy and creamy lemon aioli.  I wanted to order some for dessert but thought that might be pushing my belly over the top.\n\nThe prices are pretty average for San Francisco - expensive for the rest of the world - but the food and cocktail program shines in a city known for excellence in both.  I would definitely come again.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Came in for my birthday. The service was decent, but the service downstairs was outstanding. Was looking for the bathroom, and the bartenders knew what I was looking for, and told me where I needed to go. \n\nAnd yeah, the burger and fries were good and arrived within 10 minutes.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-12", "description": "***Only been here for weekend brunch***\n\nI came because it was on the Eater Brunch list and my friend told me that their burgers are one of the best in the city. That I would agree with, the burger was really good and they cut it in half for us knowing we wanted to share everything. Was a very nice touch. \n\nMUST GET: Burger. If you don't like very strong cheeses, i'd recommend that you ask if you can change the one they usually put on there or just take it out.\n\nDON'T GET: Billionare's bacon unless you have 4 or more people to share it with. It's very thick and very fatty. The first bite was awesome with an explosion of fattiness but the 2nd and 3rd just became too oily and fatty that I felt gross after. French Toast was disappointing. It's a huge portion and was really mushy and not crispy on the edges either. The syrup they made was too strong in bourbon. \n\nI've heard great things about their dinner so maybe i'll come back to try that and see if its better!", "author": "Rohenne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "My friend and I greatly appreciated that their kitchen serves brunch later than most restaurants, up to 3 pm. I had been meaning to come here for dinner or cocktails, but they were the only ones open near an event we were heading to. It seemed like there was only one server and one bartender to take care of the five to six tables and parties at the bar, yet they still managed to be attentive - even apologetic for a slight wait. They gave us a sort of alcoholic amuse bouche that tasted like sparkling wine to tide us over as we waited for our actual drinks. I was impressed with the presentation of my drink with a perfect egg white foam, but sadly the flavors didn't quite work with gin, watermelon, and something extremely sour.\n\nThe brunch menu is limited, but well-executed. Simple parts like the English green peas with the benedict or the sauce on the cheeseburger were impressive on their own. It is pricey for the short list of dishes, though. The restaurant and bar areas are nice both upstairs and downstairs, and the bathroom is one of the nicest I have been in.", "author": "Cat N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Great cocktails, great atmosphere, they have two bars and most importantly not too crowded like other bars in San Francisco. I recommend this place.", "author": "Madhu J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-11", "description": "Had an ok time here, would just come here for drinks and maybe a bite or two in the future, not a full sit down meal. Ambiance is ok, but since we didn't have reservations, we sat at the smaller tables on the 2nd floor (too low for the chairs provided!). Service was so-so, ambiance is kinda whatever in my opinion. We shared several bites, the mexican street corn (eh), the fried green tomatoes (too much batter), and the crispy hen of the woods (batter was too similar to the fried green tomatoes) and the mushrooms were way thick, would have preferred smaller slices. Might return just for drinks, and not a full meal.", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "I've been eyeing the Saratoga for so long, and despite my friends' complaints about its unsavory location on the outskirts of the 'Loin, I managed to drag them here for dinner. There's a downstairs area as well as their main area, and when I arrived at 6pm on Friday, most of the spots at the bar were full but there were still tables empty. The dimness, heavy chairs, and attire of the waiters makes the place seem swanky and luxurious.\n\nI'm surprised not many people have tried the Boothby Bowls at this place (or written about them), but the $100 price tag is a bit off-putting. The four of us decided to chance it anyway, considering all cocktails are $14 anyway, and ordered the Jalisco Spa Treatment. It arrived in a huge vase with a spigot, a thing of beauty. It also tasted so delicious and refreshing - I would gladly get drunk every day of my life if it meant I could drink this stuff instead of Kirkland vodka. The best part was that each of us got a good 5 glasses out of the bowl, so you can definitely try this with a bigger group if it seems expensive! \n\nFor food, we ordered a number of small bites, including the soft pretzel, 'Toga Tots, hen-of-the-woods mushrooms, asparagus salad, and shoestring fries. Everything was so good! The cheese dip that came with the soft pretzel wasn't super thick and had this delicious, deep flavor. The tots were my favorite, with the saltiness of chorizo and a satisfying crunchy outer layer. I also really enjoyed the asparagus salad, which had a creamy but light dressing and a nice crispness. The only thing I thought wasn't that great were the fries because they weren't super hot when we got them, but they were great for filling us up.\n\nOur waitress was just the right amount of attentive, and the check came to around $50 per person.", "author": "Sophie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "Super cute and hot spot, walking distance from Union Square if you don't mind to walk through a little sketchy part of town.\n\nTwo level, beautifully designed. Love the gorgeous bar with an amazing selection of liquor and spirits. \n\nAccording to them \"The cocktail and spirits program features a grand selection of \"lost and forgotten\" spirits, such as Chartreuse, Fernet, Pimm's and Benedictine, dating back to the 1920s and 1930s. The nearly 800-selection-long spirits list is also particularly deep in bourbon, scotch and rye whiskies. In addition, a well-curated cocktail list is broken down into subcategories: Highballs, Bottled & Barreled, Shaken, Stirred, and \"Cocktail Bill\" Boothby Bowls.\" That's impressive.\n\nAwesome handcrafted cocktails list, trust the bartender and ask them to make you what you like.\n\nSmaller wine list but well for by the glass, we enjoyed it.\n\nFood was solid. We enjoyed the Street Corn in a Cup\nBerbere-Spiced Aioli, Feta, Chili Powder dish the most. \n\nThe 'Toga Tots Fiscalini Cheddar, Chorizo, Cilantro was good. \n\nChicken Liver Pâté Strawberry, Peppercorn, Endive Slaw, Candied Walnut was on point.\n\nRoasted Green Beans Toasted Almonds, Thai Chile Glaze, our second favorite dish here. So simple, but so darn tasty! \n\nThe Saratoga Burger Taleggio Cheese, Slaw, Onion Bun, was good, but I wish it has tomato or some citrus.\n\nIt was during Google Next and SNIS Conferences week, they were packed with corporate. We were at the bar... a little slow but the bartender was nice. \n\nThey need to fix the chairs at the bar, it's unbalanced and crooked. \n\nI put the pix on IG, and their social media people thank you right away. Good work that you care about your guests. We'll definitely be back.", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Came here for a double date night and was impressed by the beautiful interior and the extensive cocktail/whiskey menu. \n\nWe shared the tater tots, the chicken pate and the pretzels. The chicken pate was most excellent, with a perfect mix of sweet and savory with the saltiness of the pate and the sweetness of the stewed strawberries. The toast and the walnuts give the dish a nice contrast in textures. I wasn't too into the pretzels, though my it wasn't soft enough and the cheese dip was pretty average. The tater tots were great, too. There's basically cheese whiz and bacon bits on top. \n\nFor entrees, we had the steak, the halibut, the burger and the hotdog. I went halfsies with my friend for the burger and hotdog and both were excellent. So juicy and flavorful and the buns were nicely soft to soak up the deliciousness. The hotdog also had thinly sliced roast pork. The table also shared the fries (claimed to be shoestring fries but they're just regular fries and aight, nothing to write home about) and the Mexican Street corn. I didn't really tried the corn but my friend liked it. \n\nFor dessert, we shared the scotch pudding and the funnel cake. Incidentally, the pudding is a perfect dip for the funnel cake because the two dips that came with the funnel cake wasn't great. The chartreuse sugar dip was disgusting, gross gross cough syrup and neon green/blue. The chocolate sauce was just ok. We all ended up just smearing the scotch pudding all over the funnel cake and it was great. \n\nI don't even remember what drinks the group ordered, but it was a lot. I am pregnant so only had a a virgin drink, some sort of lemony and tarragon concoction that was a bit too tart and not all that complex. My friend had their famous burning pineapple drink and she liked it. Most of their drinks were pretty boozy and the gentlemen also sampled a few of the offerings on the whiskey menu. \n\nWe are upstairs but went downstairs to check out their lovely bar. I actually wish we were seated downstairs because it was quieter. The service was great, too, people came by to pour water a few times and we never wanted for anything. I like how they have a small menu, too. All in all, great experience and will come back when they update their menu for the season.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "We came here for Easter brunch. It was easy enough to get a reservation (even the night before).\n\nThe service was a little off, we (and they) were confused as to who was our server.  Once it was all sorted - my husband and I got the french toast and the breakfast sandwich of the day (a Cuban hot dog with an egg) and a side of billionaire bacon (all to split).\n\nOur friend ordered the Jenga tots (HUGE!!!) -- a life-sized Jenga tower of about 12-15 LARGE tater tots - served with lox, capers and sour cream\n\nI wanted to love the hot dog - for me it was too over-loaded to enjoy. The French toast was good and the billionaire bacon was the highlight for me (really just pork belly) - I used the leftovers on a home-made pizza the next night and it was a hit!\n\nI would love to come back for dinner.\n\nThe room and the bathrooms are beautiful (but in the heart of the not-so-great tenderloin). The wine list is HUGE.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "We stopped in before a concert for a couple drinks and some apps. We didn't have reservations, but we're still seated promptly. We knew going in it was pricey, but at the end, worth it. The food was great, drinks were delicious, service was excellent. All those things considered we would definitely come back, next time for a full meal.", "author": "Adan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "I have been to Saratoga several times and enjoyed it. I tend to sit at the bar and order drinks and appetizers and it's always been consistent. But, today the experience blew me away. \n\nEmily was working the downstairs bar (and I thought I had recognized her from Spruce), but her cocktails and skill level are at the top in this city. We watched her make over 20 cocktails and she was both creative and personable. Her drinks looked like art and were they were perfectly balanced. Wow, she is a reason to come back! If you haven't had the pleasure I recommend coming in right away!", "author": "melissa l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I thought this place was great from the jump. Classy, chic, and somewhat mysterious on the outside, it can easily be overlooked. But don't let yourself make that mistake. Walking in, you see a beautifully decorated bar that has all the accoutrement one could possibly need OR want in their dining experience. (They even ordered a shaker for one of their gin drinks, which delivers the most beautiful, fluffiest, DELICIOUS shaken, Gin Ramos Fizz's I have ever seen.)\n\nEach time I have gone there, it's been nothing but a delightful experience. First, for dinner in the downstairs seating area - somewhat recluse and perfectly romantic. Having been in the service industry myself for 15+ years, I'm picky. And nothing was amiss. Luckily, we've been acquainted with the manager here, Mandy, and she literally runs around making sure everything is perfect. Her attention to detail, her culinary creations behind the scenes are not to be left unnoticed. This place no doubt owes a lot of its smooth-running success to her. And we couldn't be more grateful :)\n\nWe've also gathered for drinks and late night snacks (more specifically, the harissa fries with a yummy yogurt dipping sauce. It's a late night go-to, and the bowl is big enough for 3. Maybe even more) in the lounge area, and keep coming back for more. Til date, I have been there more times than I can count, and it's worth it every time.\n\nWhat you can't miss? BRUNCH. And little known tip? They're open for Saturdays too! Less busy, not as much of a wait, and still just as mouthwatering-ly delicious. (I'm not exaggerating, you guys. Go see for yourself.) \n\nWHAT WE ORDERED (I'm going to include both brunches here, so don't think I'm a fatass and ordered this all at once) :\n\nTHE JENGA TOTS: it's a feast for your eyes AND your stomach. It's a MUST if you're dining here for the first time. The presentation is beyond beautiful, and will capture diner's eyes from all over the room. You wouldn't think the taste could compete with the visual appeal, but alas. It more than delivers. \n\n\nTHE FRENCH TOAST: THE BEST FT I HAVE EVER HAD (I am not lying. They accidentally brought it out with the bacon crumble ontop, but instead of returning it - we just got another one so we didn't have to share. One w/ bacon for him - one without for me.)\n\nTHE EGGS BENEDICT (substituted ham for salmon): So delicious w/ the pretzel bun, but I feel like I would've still been hungry if I didn't order something else. So go to town and order all your heart desires!!\n\n\nDRINKS: \nBLOODY MARY w/ JALAPENO POPPERS: Mmmmm POP! Nothing like a drink that comes w/ snacks!\n\n**THE STRAWBERRY-RHUBARB GIN RAMOS** (probably my favorite drink I've had ALL YEAR.) The shaker machine is used here, and it tastes like the lightest milkshake/cocktail/fruity but NOT too sweet drink. Perfection in a glass. Can't wait to have more!!\n\nTHE PINK LADY: My boyfriend loved it, but I was too caught up with my Gin Fizz to steal too many sips. Can't go wrong.\n\nTHE ROOT & VERDE BLOODY MARY'S: not my favorite, I felt they were a bit sweet, but again - the boyfriend loved it, so nothing went to waste here.\n\nPROSECCO: seems basic, but delightfully light and refreshing. Would 100% order again.\n\n\nOk, I've rambled on for a bit - but you get the idea. Go to Saratoga, order all the things. And have Nikki, Alan, or Jeff make you some of the best cocktails you've ever had. The END.", "author": "Tiba G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "Here for a casual Friday night date. \n\nHad a reservation, but restaurant was half empty. Good ambiance and service.\n\nThis is probably more of a drink place rather than food place. Our foods were good, but overpriced. The toga tots (4 stars) were good. The sauce of the chicken liver toast was a bit too sweet, which overcame the taste of the liver (3 stars). Roasted chicken (4 stars) was good but nothing special and the side of french beans was a little too heavy in the sauce for my taste but the flavor was food (3.5 stars).\n\nTLDR: the food was good but nothing stood out. 4 stars for food but 3 stars considering price and value.", "author": "Nancy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Came here for brunch after finding out they had cereal milk punch (my fiancé is on a hunt to try every type of cereal/milk tea punch in the city apparently)\n\nWe got the jenga tots, mimosa donut, side of eggs, and cereal milk punch (we knew the order of tots were huge so we didn't order two mains).\n\nOverall the jenga tots were good, though they're pretty heavy handed with the cream cheese. We were scraping it off the tots just so avoid it, and I think I'm good off cream cheese for the rest of the year lol. The mimosa donut was good, but don't be fooled, it did not taste or vaguely taste like a mimosa at all. It's a very dense donut if you like that type too. \n\nCereal milk punch was pretty good, a strong drink but you could still taste the flavor. In our journey to try all milk punches in the city, I'd rate this above The Kabuki Bar but below Eight Tables (which has thai milk tea punch for the best $22 you'll ever spend on a single cocktail). \n\nPricing: pretty expensive for what they're serving, but it's SF so I guess it's fine? Seems like brunch and overpriced go hand in hand now anyway so this place is priced just the same as everywhere else. \n\n+1 star for service too! My fiancé (can't take him anywhere smh) tried playing actual jenga with the tots and a tot and a huge piece of salmon fell on the floor. The waitress cleaned it up quickly and even brought back more salmon for us!", "author": "Jillian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "When my gorgina glamazon goddess friendgirl who recently relocated from Miami told me that that this place in SF came close to matching the Miami Vice(s) scene in terms of glam, first I worried about her mental health. Then I decided to check mine and set up our next GNO.\n\nI dusted off my furs, anticipated her Ellery, and we alerted our one other faboosh fashionista friend, who I shall reference as Gucci Womane for obvious reasons. Any given time 250 in her grill. (She iced out but she don't got snow man.)\n\nOur triumvirate was complete. Off to the trap house. \n\nThe space didn't disappoint. Beautiful light fixture and sexy double story bar space with limited seating upstairs, more ample space downstairs. \n\nWe were introduced to the Green Goblin, a chartreuse based herbal basil cocktail that was delicious and topped with cherries. \n\nShout out to the  bartender launching his inaugural Saratoga career that made these, I forgot your name (job well done) but you had a very successful first day. At least, that's what AmEx tells me (15$/cocktail!)\n\nWe also had small bites: Chicken Slider, Carrot Salad, and Hamachi Crudo. I opted for the carrot salad and it was an excellent savory complement to da 'gob. \n\nDefinitely would return! \"What's a goon to a goblin?\"", "author": "Spartevan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Location is eh. But really easy to get to. \n\nWe went for brunch and were seated in the area downstairs which has this amazing speakeasy feel to it. The wait staff was amazing and provided such a good experience. The food and drinks were amazing!!!\n\nFirstly, that tater tot jenga thing is amazing. It has all kinds of salmon, capers and other goodies on it. I ordered whatever was on the special along with trying just about everything else that my friends ordered and they were all delicious. \n\nI would love to come again for lunch or dinner.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "A restaurant good enough to interrupt a blistering coke bender. Easily the best food in the Tenderloin. Bar None. Better than ORSON used to be. Professional service from cool people. Great interior. \n\nThe weakness of this place is the shitty tables -- and if you're interrupted mid-bender.--the goddam yakking of dorks & morons in every direction.\n\nBEST CHICKEN LIVER PÂTÉ IN CALIFORNIA.\nBEST FRIED GREEN TOMATOES IN SF.\nBEST YELLOWTAIL CRUDO IN SF.\n\nThey know how to trim and cook a strip steak. \nTHANKS SARATOGA.\n\nI meant better than the tastier than Orson place called HUXLEY. (It wasn't you, Hux, it was The World. Nay, ''twas the wicked and corrupt 21st century American Lameness and silver car SAMENESS that killed you. Your hood and forced intimacy was robot averse.)\n\nYes: Saratoga is bigger & better. Looking and Tasting.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "A little pricy depending what you order but great food and atmosphere. Its in an old historic 2 story building thats been around almost 150 years. Theres bars up top and down below in a modern atmosphere with some funky jazz music going. I ordered their famous burger with loaded tots and a few mix drinks.\n\nIv been to all the best burger spots in the bay and this ones a close 2nd. Quality bun, 2 rare and juicy patties, salty taleggio cheese, and im usually not big on slaw but it complimented the flavors nicely. The togo tots rocked as well. They come stacked in cube shapes that look sorta like fried tofo instead of your standard tots and covered in cheese and chorizo.\n\n For drinks they have hundreds of options including rare discontinued liquors. i had a walking dead and a bourban highball. The bourban was good. It was mixed with cherry vanilla and cola. My favorite was the walking dead tho. Rum, lemon, papaya, pineapple, pomegranate, and tiki bitters served on fire with pinapple. They make the drinks strong here too.\n\nAll around a great experiance check this place out!", "author": "Sean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Excellent dinner last night with the Restaurant week prefixed menu- though I thought it was weird they didn't let you choose between options for your main. The carrot salad definitely had a Far East flavor profile, hints of cumin and maybe allspice, balances with Greek yogurt drizzle. Very tasty and refreshing to balance out the tots (which are more like hush puppies). I wasn't blown away by them honestly, but they were pretty good with some chopped bacon, chives and an aioli. \n\nThe short rib for the main was phenomenal! Served on a bed of creamy polenta (or grits, are they one in the same?) with some arugula to cut through the heaviness. The short rib was perfectly cooked, crispy outside with a tender and juicy inside). I do think that another acid could have been added to cut through the fat, perhaps pickled onions or something. I asked for a side of hot sauce to get some heat in there (and their hot sauce was amazing, sort of a chicory smoked bbq sauce). \n\nWe asked for some pork rolls on the side which were puffy, warm, salty and fabulous; but I didn't care much for the pimento spread it was served with. I think it could've benefited from an herb infused butter instead like rosemary or basil. \n\nDessert was delicious and super heavy, not for the faint hearted. Chocolate ho ho with a crisped marshmallow spread base! The chocolate cake was moist with great fudge-y consistency. Drinks were very strong, and very expensive (2 totaled to more than the meal). Folks next to use ordered the burger, octopus and chicken escalope, and all said they were prepared perfectly and tasted sensational (pics included). \n\nThe atmosphere of the place is great. Open dining area, beautiful dark/modern design, great upbeat music- perfect for a date or night out with friends. Staff was friendly, not really notable in an either good or bad way. Will definitely return after my bank account recovers", "author": "Tash B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Solid 4 stars for a great restaurant week experience!\n\nWe came here tonight for dinner.  The venue is super cool - all black decor with an awesome chandelier in the middle of the restaurant, which hovers over the stairs that take you to downstairs seating.  There is a massive bar with a great alcohol suggestion and the overall vibe is very swanky.\n\nWe had a seat near the front and immediately were helped with what we wanted to drink (cocktails) and eat (restaurant week meal).\n\nWe started off with the Himachi.  It was very delicious, with three pieces of fish accompanied by mushrooms, apples, and delicious sauce.  Overall very good.\n\nSecond course was a choice of Toga Tots or a Carrot Salad.  Now I'm a tater tots gal, but am trying to get more vegetables in the mix these days.  Therefore, the hubby and I ordered one of each.  The Tots were AMAZING.  More like fried potato cubes with delicious sauce on top.  Small portion but the perfect amount if you don't want to be bogged down by fried foods.  The carrot salad was also AMAZING.  I actually hate carrots generally, but these were deliciously seasoned and grilled with avocado and a yogurt sauce.  Honestly I could have eaten a massive plate of those carrots.\n\nLast savoury course was a generous short rib on top of grits in a delicious dark sauce.  It was perfectly cooked - moist and fatty - and was a great short rib.  I do wish the sauce was slightly sweeter, but overall was great.  We also had a great syrah which paired very nicely with the dish.\n\nFor dessert, we had a Hoho which tasted very much like a hoho.  It also had chopped up caramel pretzels which were delicious.  A pretty sweet dessert but not very heavy.\n\nWill definitely be back here - even if just for a cocktail!", "author": "Jade R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "Had an amazing dinner here a few months back. Two people, seated upstairs. \n\nOur server was Sophie; she was incredibly helpful, friendly, knowledgeable and fast.\n\nWe had:\nParker rolls - amazing!\nShoestring fries - amazing!\nAsparagus - amazing\nSteak - amazing\n\nWe were in a hurry to get to a movie after and they awesomely packed an order of the cracker jacks for us to go.\n\nIt was an overall awesome experience and a place I'm happy to keep going back to.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "If it was a little less expensive I would've given it 4, but for the price I would recommend going to other places for dinner.\n\nHowever, if want a spot for drinks and go and light food it's a good choice. The tater tots are super good but they should increase the number of tots you get. \n\nFood we ordered:\n\nTots - so damn good. Would've ordered another round.\nFries - okay but not worth getting, just get the tots.\nBurger - no flavor. Pass.\nFrank cubano - good but not amazing. I've eaten better things elsewhere. \n\nDrinks:\n\nWalking dead - good, but sweet! Presentation was awesome (flaming pineapple)\nThe avenue - good, but sweet bourbon drink.", "author": "I S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "This review is long overdue. I had an amazing birthday day for a friend here a year ago and everything was great. From the music to the vibe to the food, it was easy to see this would be our spot. Recently, I went back to try their happy hour and it was bangin. I'm telling everyone. Saratoga HH- nothing better.", "author": "Ayanna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Wow! Fantastic brunch! Absolutely gorgeous restaurant. The bar is stunning. Ambience fun, hip and sophisticated. Wonderful brunch menu. Great upstairs table with view of bar and windows looking out on Street. I can't wait to come back for dinner. The downstairs dining room (brunch is served upstairs) is absolutely beautiful, with another stunning bar. A perfect place to go for a drink some evening. Must try the billionaires bacon. The best I've had. The burger juicy and delicious. Jenga tots with smoked salmon is a must. Nothing like it anywhere. The avocado toast had fish roe sprinkled on-top.... so good! \n\nNow for the cocktails. We had the Hail Mary. A delicious Bloody Mary with add-ons. I had beef jerky, fried pickle and shrimp added... delicious! \nThe Sommelier  was super welcoming, knowledgeable and easy to talk too. She gave us an education on chartreuse. No doubt one of the best bourbon lists  in The City. They are offering a McCallum food pairing night which looks delicious and fun. I will come back for dinner where I will start with a bourbon tasting at the bar then dinner in the beautiful dining room. For quality food, amazing cocktails, exemplary service and a speakeasy ambience.... a home run.", "author": "Ann D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Great customer service. We had the tapas for the happy hour menu and all of it was really really good. I will return and come back again.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Alright people this place is freaking awesome! First off the staff is very professional and friendly and know what they are talking about and secondly, gonna get right into it the \"BEST BILLIONAIRE BACON\" so juicy, yummy and scrumptious. Definitely a MUST TRY.\n\nMe and a friend went here for brunch and had a great time, we walked in without a reservation and still no wait time which was really nice! Really nice decor and ambience, the tables/seating is a little too close to each other so we could hear the neighbors and I'm sure they heard us too.\n\nWe got the sandwich of the day which is a cubano hot dog with egg, I don't really like cubano but it was our fault since our waitress asked us if we wanted to know the ingredients or just surprise us, we chose the latter so I'm not gonna hold them to it. Also got the flautas, which was alright, could use a little more spicy sauce/ flavor. We also got the donut, forget the name but it was yummy, but not the super soft dont if thats what you are looking for.\n\nWe also got the vieux carre, which was one of the best I have had so far. They have a huge wine list, didn't get to try it but definitely will next time. So definitely want to go back for the dinner time and try the food and drinks here. It is a little expensive but we were mentally prepared so all in all a good time.", "author": "Darshana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Absolutely enjoyed having brunch here! The Hail Mary Bloody Mary was an amazing experience. It's a meal in itself with very creative food skewers. Loved the tater tot jenga, too. The library of whiskeys is impressive as well. Highly recommend!", "author": "Elisa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "Dark, swanky & sexy... A bustling two level restaurant, The Saratoga serves up contemporary american cuisine that will satisfy all of your taste buds!  \n\nSome of the outstanding menu items I tried:\nMichelada Mussels: 4/5\nStreet Corn: 5/5\nGreen Tomato Burrata: 5/5\nPrime Dry Aged Rib Eye: 5/5\n\nIt's get pretty packed here on a friday night!  Who knew it was so happening in the T-loins?!!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "In an area of the city that does not have many good choices - this bar is a jewel. The concept is clear, provide some few but upscale food options along with some bar food and then focus on fine spirits and cocktails. After starting of with beers paired with roasted nuts and beef Jerky, we chose their signature burger [basically a cheeseburger] and the Cuban hotdog loaded with what you put in the Cuban sandwich. The highlight were clearly the cocktails we had - all freshly made ingredients and upscale liquor. Along with the upscale atmosphere a 5* cocktail bar experience.", "author": "Chris Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "The Saratoga has been written up by so many place that we needed to check it out for our latest dinner club with friends.  It's definitely more of a bar than an actual restaurant as their drink menu looked like the bible.\n\nThe appetizers of pretzel bite, toga tots and hot link set a good layer for our main meal.  The link had a nice kick to it.  For the main meal I ordered the dry aged NY and while it was good it wasn't worth the price as I've had better elsewhere.  The sides of brussels sprouts and fries were really good though.\n\nI'd check our The Saratoga on a date night versus a larger group.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Go check this place really cool and nice \nCarrot salad amazing Himachi wow \nThank you", "author": "Sanfrancisco O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-06", "description": "SF Restaurant Week at The Saratoga did not disappoint ! \n\nThe Hamachi Crudo to start was fabulous, fresh and a must-have. I loved the Warm Chantenay Carrot Salad on the prix fixe menu so much I ordered seconds off the regular menu! \n\nI was not as in love with my main course, the Red Wine-Braised English-Cut Short Rib. Though it was really good it was a little too fatty for me to fully enjoy. I would not order again. \n\nLast but certainly not least, the Ho Hos dessert was one of the best desserts I have ever had. A gourmet take on a Ho Ho that has hints of s'more flavors with a rich chocolate outer layer. If I hadn't already been so full from ordering seconds of the carrot salad believe me I would've ordered seconds of this! \n\nMake sure you reserve or ask for a seat downstairs. The acoustics of the main floor / upper floor provides for a very loud, unconversational experience. We asked to be moved downstairs and it was worlds better. \n\nI did not get a chance to dip into the wide array of spirits they gorgeously display but I'll be sure to be back to try their infamous cocktails (and to of course, order more hamachi crudo, carrot salad and ho hos)!", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "WE WERE RIPPED OFF!! Our waiter brought out an extra order of the tater tots \"since your drinks were taking long\" and then ADDED THE ORDER TO OUR BILL. She then proceeded to bring out TWO orders of the bread, which we did not order, also playing it off like she was giving us a little extra. These too were added to our bill. In the end the food was not good and we paid far too much for it. Don't come here to eat. \n\nNo idea how this place is rated 4.5 stars except that the cocktails are decent, and they have an extensive spirits menu.\n\nThe only thing that saved this evening was the company at my table, but it would have been an evening much better spent somewhere else.", "author": "Christiana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Pretty cool venue on the cusp of the Tenderloin. The food is soooooo good and the cocktails are delish! I also really like the layout a lot. My favorite thing to eat so far is the sea bass. Holy Moses!!! Crispy skin and juicy fish!!! Love, love LOVE IT!!!!!", "author": "Ali R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "Drink selection and prices very good, overall fair deal considering location and a great atmosphere. I had the strip (very over cooked) and green beans (delicious). Probably not going back for food.", "author": "Gary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "i didnt expect to love the saratoga as much as i did! have been here for cocktails prior - but wasnt super impressed by the quality and they are quite pricey at $14 a pop. but i was craving a burger and boi was kind enough to oblige so we came here for brunch with a specific goal in mind - the saratoga burger, as seen on quite a few 'top xxyyzz' lists in sf and regionally.  restaurant wasnt as busy as i had anticipated on a sunny sunday and we walked in to get seated right away without a reservation. the bar (both upstairs and downstairs) is a good option if you dont have a ressie as well. \n\nordered a brunch cocktail to start - something orange-y and fizzy, but i wasnt impressed.  at $14 i expected a bit more. also i wish i enjoyed bloody marys - they have quite the line up and topping options! boi ordered the boozy house coffee and really enjoyed that! great presentation on both, i must say.  he also said that the coffee is delicious on its own and didnt need any booze, per se.\n\nwe obviously both got the burger, and shared an order of the jenga tater tots with smoked salmon.  super happy with both!  the jenga tots were pricey at $23 for an 'appetizer' but it was unique and tasted so good. the tots themselves were super crispy on the outside and the potatoes are shredded on the inside - amazing. traditional lox and toppings as adornments on the tots.  the presentation is also hard to beat and truly instagram worthy.  i will be ordering the half order next time as we had several tots left over.. sad face* \n\nnow - the BURGER. is. so good. that is it. i didnt feel overly guilty for devouring the thing in about 6 minutes. i migggghhhhttt like it more than the charter oak burger, actually! TBD. right amount of cheese, slaw, good thin patties, cooked well, good bun. 100%.  would come back just for this.\n\nwe also had incredibly great service during brunch, and im sorry i dont recall her name. but usually brunch is such a rushed affair in sf with long waits and customer bumping shoulders in crowded spaces - this was a refreshing change! our waitress was sweet, accommodating, attentive, and super helpful when i asked where the water classes were from.\n\nlife hack - stop by mr. holmes around the corner before your reservation to pick up some dessert items and/or breakfast next day! nommzzzz.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Came here for drinks with a friend on a Wed night. We arrived a little after 7 and didn't have any trouble snatching two spots at the bar.\n\nI started out with the Free Trade Agreement ($14), which is pisco, cachaça, singani, lemon, agave, egg white, bitters. Presentation was spot on and I really liked the layer of whipped egg white foam on top. It was light and refreshing but I wanted it to be a little bit less sour and more sweet.\n\nI also ordered the Gin highball ($14), which is honeydew, tarragon, lemon, tonic. I'm a sucker for anything fruit flavored, and honeydew is one of my favorites, so I really enjoyed this drink. This was probably my favorite drink from all the drinks we tried here.\n\nMy friend ordered the Japanese blended highball ($14), which is yuzu, mint, and soda. I took a test sip, and the yuzu flavor wasn't as strong as I expected. Given that we were both excited about this drink because of the yuzu element, it was a bit of a letdown.\n\nWe had already eaten previously so we just grabbed some harissa spiced shoe string fries ($8) to munch on with our drinks. This was surprisingly tasty, and we ended up finishing most of the fries by the end of our time here.\n\nI like that it was pretty spacious here; there was an upstairs bar/dining area as well as an additional bar area downstairs. \n\nI enjoyed my experience here but don't think the drinks were compelling enough to to make me want to come back, at least not until I've tried some of the other bars around the city.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "I've been stalking the Saratoga's menu since they opened. Along with Black Cat, it's definitely part of the New 'Loin. \n\nCame here on a weeknight (Wed) for a drink. It was pretty crowded but we were able to get a table for 3 for drinks. Seems like most people who go make reservations so take note.\n\nThe space is gorgeous and the bar on the first floor is really impressive. Downstairs is quieter and also has a bar. Feels very high brow but the hostesses and bartenders were really nice.\n\nI had the Avenue and a glass of Rosé. I liked both of my drinks and the wine was a suggestion from our server. Drinks are around $14-17 which is on the high side and bill adds up quickly even without food. \n\nWe didn't have food this time but the dishes coming out of the kitchen were seriously envy worthy. I want to try their burger at some point soon.\n\nOne star off because this restaurant, like many recently arrived establishments in the nabe, is painfully homogenous and feels like stepping into another world from the neighborhood steps away. I hope they seriously consider who they hire, train and hire people from the neighborhood, consider diversity in staffing, look at the racial disparity between the front of the house and the back of the house, donate leftover food to shelters, etc. etc.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "I only came in for a drink and a small bite and everything was fantastic. I had the \"free trade agreement\" - which was like a pisco with egg froth cocktail. It was delicious and refreshing. \nI ordered toga tots and that was a wonderful surprise. I think they were tots made in house. First, they were square (which I never see square tots), and second they just tasted so fresh and home made. It was wonderful. \nService was really good, ambiance is sleek. I'd def come back for a full meal.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Great place!  The Saratoga Burger is seriously one of the best burgers I've ever had.  I'm posting a stock photo, bc it's better than my sorry ass dark photo.  Excellent bourbon selection.  Really nice atmosphere.  Good job, Saratoga!!", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "You wanna know what happens when a bunch of teachers have a conference in San Francisco? They dress fancy and go out! Since I was so impressed with this place the last time I was there (see previous review), I took my work peeps to the Saratoga. We had a blast! We drank, we ate, and good times were had. Thank you Saratoga for making me look like a sophisticated city girl. Everyone was so impressed (with the two story decor and the unique drink selection) that we are hoping to go back. Luckily, there is another conference scheduled for 2019. #girlsnightout #didIjusthastag #dohastagsworkonYELP #idkidcare", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "There was a happy hour being held here with a few friends, so a friend and I dropped by. We came around 5:30ish, and wasn't too crowded. But def picked up as the evening went on. The ambiance is very classy..it's a mix of a nice bar and sit-down dinner area split between upstairs and downstairs. The space isn't too big, but our happy hour group was about 20-30 of us and we held cozily mixed between both floors.\n\nWe stuck around the bar, and the bartender was helpful in recommending drinks for us. Even when it got pretty busy the bartender somehow was always able to help us out and take our orders. There's a great variety of highballs, barreled & bottled, stirred, and shaken. They also have an extensive menu for different types of bourbons, whiskeys, gins, reds, whites, you name it. I can imagine for those who love trying diff types of bourbons would love to visit here. Being an old-fashioned bourbon fan, the bartender recommended I try something a little different, and suggested the Brooklyn. It was Bourbon, Dry Vermouth, Amer Picon, and Maraschino. All I can say was that it was delicious! Apparently the green goblin is popular as well, so my friend ordered that which has Botanical Vodka, Green Chartreuse, Maurin Quina, Lime, and Basil. I personally wasn't a fan of it, but maybe it's because I just really enjoy bourbon. Another friend ordered gin which has Honeydew, Tarragon, Lemon, and Tonic. That was also okay, but I wanted want to order that myself. All that to say, there are a ton of different drinks to try, so pace yourself and have fun. And if you like bourbon, please try the Brooklyn..you won't regret it :) \n\nService is fantastic..bartenders, servers, hostess..everyone was quick to help and accommodate such a large group without reservations. Will bring friends here again for another happy hour!", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "The burgers are so damn good. I got one for dinner and then got one to go, and ate it for breakfast the next day.", "author": "Love F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "We had a bad experience with the hostess when we first came in but the rest of the staff really did a great job making sure we were taken care of for drinks. The drinks were really wonderful too. But honestly we we really appreciated the care the rest of the staff showed us after the issues we had starting out.", "author": "73and9 7."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Went back for the Billionaire's Bacon...OMG...it was just amazing.  In my previous review I said they make the best Eggs Benedict we have had anywhere in the world.  They were just as good the second time.  I ordered poached eggs with the Bacon and they make the most perfect poached eggs I have ever had.  The eggs themselves are very rich and flavorful and they poach them to a runny perfection.  There is not a trace of water.  Service remains superb.  Shout out to Mandy, the manager, and the rest of the team.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Came here with a friend to have some drinks before dinner. I love the decor, so glam and modern. The bar is gorgeous. We got in around 630pm and it was packed. Order the drinks at the bar. The bartender was great, forgot his name but he is from NYC. So friendly and I can watch him make drinks all night long. Very crafted and reason why I love the experience so much. If I am paying for a $12-$15 dollar cocktail I rather have it crafted. The cocktails are $14 dollars here but honestly worth every dollar. I got the Free-Trade Agreement. The prettiest drink ever and tasted amazing. Attention to detail is on point. I can't wait to come back and try everything else. \n\nFYI there is a wait to sit at the bar as well as the restaurant seating. Got a seat at the bar about 15 mins later. Not bad at all.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "The Saratoga has been seriously high on the list for a long time. My friend and I checked it out on a Tuesday night. We made a reservation for 7pm one day in advance.\n\nThe menu has 20+ pages, all but 2 of them are for drinks. I got the Walking Dead (Rum, Lemon, Papaya, Pineapple, Pomegranate, Tiki Bitters) and she had the Free-Trade Agreement (Pisco, Cachaça, Singani, Lemon, Agave, Egg White, Bitters). Both were beautiful and I liked hers more than mine.\n\nWe started with the Toga Tots that everyone seems to rave about. Perhaps our expectations for them were too high; they were good but I didn't think they were that special.\n\nFor our main courses, we shared the Saratoga Burger and Mussels Ciopino. I was surprised that the server did not ask us how we wanted our burger cooked. It was a good burger, I suppose. Again, it didn't make a lasting impression. The Mussels were the hit of the evening. The sauce was flavorful and the mussels were plump. I would've loved to have more bread to soak up the sauce.\n\nWe felt that we needed some sort of vegetable to balance out the meal so we ordered the asparagus & endive salad. This was a total miss.\n\n4 stars is on the generous side. The space is beautiful and the drinks are the draw here.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "Michele was super fun and oh so smooth with his service, and he wasn't even our server. The table next to us got that honor. \n\nThey utilized the space very well, with a bar and table service upstairs and a lounge-like area, smaller bar and more tables downstairs. Lighting is cozy and the interior design is mesmerizing. \n\nSome of the food were better than others. Drinks were quite off. \n\nConfused why there were inedible limes placed with our mussels when their juice could have been added in the kitchen with a good squeeze and they were hidden underneath the mussels so adding nothing to the visual plating. Wondering if it's to give the illusion of more volumne in the dish. The meat inside the mussels were also not impressive. Small with some missing entirely, but soup had good flavor and good for dipping bread.\n\nThe tater tots were quite different, with the potato were mashed and then set in cubes. Inside is thick, meaty potato and outside is a crispy exterior. Uniquely delicious. \n\nThe burger came with a lot of meat. The pickles were removed because they didn't taste as good and almost took away from what was otherwise a well seasoned dish. The bread was light with a pinch of sweet for the perfect added flavor.\n\nThe drinks were a big miss. The martini tasted \"weird\" and almost as if water had been added. Perhaps the ice had melted a bit too much in the cooler? The sibling rivalry was recommended as being similar to an old fashion. Though not a bad drink, it does not resemble an old fashion. It's lighter and the presence of orange stronger. The wine (though not bad in taste) pouring was almost shameful. Lifted it up to make sure eyes weren't deceiving and there indeed was very little in the glass. Only the European nearby serves a similar shy pouring. Better to just get the bottle.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "A must while in San Francisco, best hamburger I've ever had. Also had the Millionaire bacon (pork belly) totally decadent! We walked there from 7th st in SOMA, wouldn't do that again, some sketchy blocks to go through. Restaurant is gorgeous inside. Service is top notch professional.", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I decided to plan a bachelorette dinner for six last Saturday. It has become my go-to spot in the area. This place brings so much vibrancy to SF that we don't get enough of; especially when you're not looking to spend a ton of money for a date night or dinner for GNO. The service is great by delivering the family feel when you walk in. Mandy is superb starting at how personable she is and how she makes your experience coming in feeling so warm! \n\nI would simply put that The Saratoga has the nice/trendy restaurant with the \"ma & pop\" feel. I highly recommend going in for their amazing cocktails (walking dead!) and their amazing bites (chicken, hamachi, pretzels, and steak!)", "author": "My N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Love hanging out this place on a friday night! Awesome cocktail and bartenders. Food is good too but I didn't try the main course but only appetizers.\nDef will bring friends here again!", "author": "Roxy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-11", "description": "Boy, I really wanted to like this joint. Looks swanky, lively vibe, started well...but then the food came. Octopus was way overcooked and just not good. Burger had no flavor- how do you screw up a burger? Drinks were tasty enough, but for the prices? Thank you, but I can get libations just as tasty elsewhere at 2/3 the price. Bartenders were personable and engaging, so def one star for them, but otherwise, a very surprising and expensive fail on multiple fronts. Expected much better considering its pedigree..", "author": "Evan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "A MUST \nVery friendly and knowledgeable staff \nSmaller brunch menu but everything on it OUTSTANDING", "author": "Marion T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "I never made it inside to try the food. The overflowing trash can by the front door made me change my mind. The experience begins before a person even enters the premises. How hard can it be to for someone to sweep up the trash before you open? Gross.", "author": "Sandra W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-07", "description": "3.5 ice cube spheres\n\nI love watching things being built. \n\nEveryday I would drive down post street and notice this space being built out on Larkin and Post Street....thinking who would build out a space in such a wratch hood.\n\nThe metamorphosis into a stunning bar was nothing short of spectacular: especially at night when the lights show off the stunning bar.\n\nUnfortunately the drinks and food don't really live up to the beautiful interior: My two drinks were actually pretty weak and lacked character ( maybe I'm just an alkie?)\n\n The walking dead didn't have a punch that one would expect with the fruit juices and rum (smugglers cove makes killer rum drinks in contrast)\n\nThe Japanese Highball ( I have been a huge fan of Japanese whiskys for many years) really did not display any flavor of Hibiki, or the Suntory blends it was supposed to have. (Nihon Whiskey bar does this amazingly well)\n\nMy wife did like here lovely wine so that was nice.\n\nOf the three plates we shared none was really great: \n\nSure the fries were fine ( tough to mess up) but the Kale salad was way overdressed and soggy ( the soft poached egg really didn't add anything due to the sogginess).\n\nThe Cuban frank was pretty good but the cheese was not melted and was just a cold piece of cheese...this was texturally unappealing compared to all the warm items in the plate.\n\nProbably the best part of The Saratoga was the wonderful warm staff. Each person was truly lovely and a joy to be around...and in a way made the experience pretty special.\nIf the food had been a tad better I could easily give them a solid 4 stars...So I will be back to check them out again.\n\nPlease experience them for yourselves as the vibe is great.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "best cozy place to sit and best variety of cocktails to drink. due to mandatory yelp condition filling in characters now", "author": "Jayant S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Such a fun/trendy place in Tender Nob. The ambiance alone was def a 5. Bar is impressive, wine selections was great. Not too many craft beers but no biggie. The menu is very creative for comfort food. A lot of it is pretty heavy but thats what comfort food is. They def use quality ingredients. \n\nThe tomato burrata is amazing! Salty, cheesy goodness! I saved some and added it to the Kale Salad I got. We also tried a chicken slider that was so good but only came with 1 which I alone couldve ate 2-3. Sadly we were too stuffed for dessert which I had been looking forward to the most. I cant wait to go back for just some small bites and drinks! The menu isn't too veggie friendly but you could make it work!", "author": "Hetal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Okay, I'm 55 and I've eaten thousands of burgers in my life.  Best burger ever at the Saratoga.  Amazing bar menu as well.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "The owner contacted me and encouraged me to come back and visit them again and assured that I would have a better experience. Since we live in the neighborhood I was willing to come back and try new items on the menu. On my third visit we were greeted by Elizabeth who was very refreshing and got us a table right away. Our server was right on with our drinks and dinner. The whole night was worth the updated 5 starts. Looking forward to coming back soon.\n\nThis place is way over rated! I came here for dinner and the service was amazing. Drinks was worth the 5 star and the food was good but not great, never the less I was looking forward to return and try a new dish.\nI have given them the 1 star due to their manager rude attitude when I return. I had made a reservation and for some reason she could not find it. She was loud and very rude so I left and went to an amazing restaurant in Union Square. There is just way too many restaurants in San Francisco for me to spend my money and experience this behavior.", "author": "Paulina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "4.5 stars - my fiancé found this restaurant heading up Larkin and seeing the massive brown liquor assortment behind the bar.  The bourbon selection was in fact very impressive.  We had the chicken slider which was perfectly fried, and the jumbo asparagus salad, which had a great sauce verte.  For our entrees we had the Saratoga burger (surprisingly with no sides or fries) and the cubano frank which was a niman ranch beef frank covered with pork, cheese and mojo relish.  Everything was very good.  Service was excellent - I wish I asked our server's name but he really paid attention to my dietary restrictions and knew how the dishes were prepared or modified.  Great ambience and huge bar.  The downstairs area was quieter and also had a cozier ambience, with another bar.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "What a find. I'd rate The Saratoga well just based on the liquor display behind the bar, a towering glass wall of mostly beautiful whiskeys in every lovely shade of brown imaginable. But that wouldn't be fair, so naturally I had to stop in and experience everything they had to offer. \n\nMy friends and I came in around midnight on a Wednesday, so I can't speak to how busy they get. On out night it was perfect - low key with plenty of time for quality service. Our bartender was a friendly gal who knew the shelves behind her like an encyclopedia. I ordered the Free Trade Agreement (Pisco, Cachaça, Singani, Lemon, Agave, Egg White, Bitters) and couldn't have been happier with my order, plus I genuinely enjoyed watching the process of it being made. The real hit, and this was unanimous, were the 'Toga Tots, a decadent combo of Fiscalini cheddar, chorizo and scallions on top of, well, tots. I instantly regretted offering to share them with the three fellas I was with because they were gone in a flash. \n\nIf you're looking for a nice date spot or a place to quietly appreciate good liquor, The Saratoga would be a top recommendation. I know the tots alone are my kryptonite.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Man, I've never Yelped before but my experience here was just so worthy of some praise...\n\nMade a reservation online after reading countless mentions on Eater and Thrillist.  When we arrived we were greeted with a beaming smile, the super sweet host explained our table wasn't ready yet which was fine with us.  Time to grab a drink at the jaw dropping bar!\n\nThe incredible back-lit bar is just stunning.  The bartenders were so knowledgeable and didn't mind walking us through their extensive selections and suggesting just the right fit for everyone in our group. \n\nWe were so pleased when the food turned out to be just as good (...better?) than the cocktails!   I loved that the menu seemed to take classic items and add fun quirky twists. We started with the tuna tartare on a fried black rice cake.  SO GOOD!  It kind of tasted like a fried sushi roll.  It was spicy and sweet and earthy but most importantly still tasted light and fresh.  I had the NY Strip for my main and OMG I'm now obsessed.  It comes topped with this creamy cognac peppercorn sauce that is truly to die for.  We ordered a side a fries just so we could mop up every last drop.  Will definitely be dreaming about that sauce for some time.\n\nA few days after we dined at The Saratoga we were reminiscing about our meal, and while the food and drinks were on par with so many other popular restaurants in SF the one thing we all really agreed stood out the most was the hospitality.  From the minute we walked into the building we felt the warm welcoming nature of this place.  The manager even came and checked in on our table, cracked some hilarious jokes, and made us feel special. \n\nThey really have a great team over there and that is what will keep us going back!", "author": "Mimi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "This was my first time at The Saratoga.  \nWe were lucky to get a table right away, usually need to book a reservation. \n\nWe had: \nToga tots - $8   5 stars\nSalmon Crudo - $16  5 stars\nTomato Fondido -$12  over 5 stars.  This was the highlight of the meal! \nS.T corn - $7  3 stars - way too spicy for me.  But if you love spice then this one would be good for you\n\nWas slightly disappointed in the dessert options\nWe tried the Ho-Ho - $9 and decent but not amazing\n\nI'm also giving the service 5 stars\nEverything came out quickly and very friendly staff \n\nOverall experience was excellent.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "This is a really nice and upscale place!  We had Sunday brunch, and we really enjoyed it. I recommend trying this place. We will have to go back for dinner sometime.", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "This location is awesome! The alcoholic collection is amazing. I popped my head in for the 1st time, and I was totally impressed. The ambiance was incredible. Great music great bartenders they even have a downstairs bar. \n\nI am truly impressed I will definitely be back!", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Excellent !!! All the way around the food is amazing the Ambience is great! music is nice I mean we are visiting from Houston and this is definitely going to be a go to spot that's open till 1 AM. Liz was our waitress she did not miss a beat. Friendly, great service, I was very impressed. Thumbs up!!", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "Boyah!! I think I found a new go to spot to enjoy delish libations and nice chill atmosphere!\n\nFriends and I rolled in here last night as the last stop to end our Long work week and enjoy a final beverage or two. \n\nLocation wise, it's not the best nighty pedestrian traffic if you will, especially those standing on street corners earning . However, you can find street parking around on Larkin & Post where this cool place stands out.\n\nWalking in, pleasant restaurant/bar staff opening a curtain to let you in this chill/ hip place. The bar with floor to ceiling  shelves and cool chandelier near the stairway pops out in the background from the black walls and ceilings. \n\nWe only had some beverages, no food. The Saratoga had a detailed cocktail and wine menu which is very impressive. Wine & cocktail prices $12-$16 of what we sampled, some libations were great and some were norm. A wee bit over priced in my opinion. Hence the 4 stars.\nThe service staff were very accommodating and professional. I will be back!", "author": "Nawar F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "My second visit was tonight.  \nLove the place.  Extensive spirit selection and creative bartenders, friendly and professional staff, chicken sandwich and crab Louis special are standouts.  I've tried over a half dozen menu items and loved every single one so far.  Can't wait to try the rest of the menu. \nI prefer the downstairs, where they have a noise suppressing fabric on the walls dampening the noise a bit.  (The all glass upstairs can get pretty loud).  \nMenu is shorter than you'd expect, and hidden inside the drink menu but what they do, they do really well.  \nExcept coffee.  They use some kind of drip system that makes coffee so slowly, it's cold when they get it to your table.  \n\nSo definitely go to the Saratoga, it's amazing.  just skip the coffee.", "author": "Ken W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "I'm not a fan of the Loin, but this place is in a ok location. Very cool space. Top shelf drinks. Excellent service and the food is delicious. The bread yummy, the hamachi crudo yummy, the spicy chicken yummy. Awesome 2/8/18", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "The doorman, Frederick was kind enough to chat with me (super nice guy) while I waited for my friend to arrive. If you want to impress your date, he suggested ordering \"The Walking Dead\" cocktail for that \"wow\" factor. \n\nMy friend ordered it and our server lit it tableside but the flame quickly went kaput. She tried lighting it again, and kaput! \n\nBummer....it was like a whiskey d*ck.\n\nIf you're coming to The Saratoga for a hawt date, make sure your equipment doesn't go kaput later that night ok? Which means don't go overboard with the drinks at The Saratoga because trust me, you will want to! \n\nFrom the owners of Michelin starred Spruce and The Village Pub (Woodside), The Saratoga is beautiful two-story restaurant and bar serving elevated comfort food with a huuuugggge booze list (opened 11/10). If you like whiskeys and rare spirits, this is THE place to go to. I was told they have over 300 whiskeys and there's even a $1,500 shot.\n\nThe cocktails are the highlight of The Satatoga. I had the Highball Gin w/ honeydew, tarragon, lemon, tonic ($12): http://bit.ly/2eT5Crn and the Green Goblin: Botanical vodka, green chartreuse, maurin quina, lime, basil ($13): http://bit.ly/2gaHo0I. Both were equally good and well-balanced; the Highball was refreshing while the Green Goblin was more potent. \n\nAs a fernet lover, I was happy to see five rare ones on the list including one from 1950. \n\n\"Where are you ever going to see this Fernet on the menu again?\", my friend said. \n\nUmm, never. \n\nI caved and ordered a shot at $32 an ounce: http://bit.ly/2fr8K1w. Fernet is a digestive and tastes medicinal (think Chinese herbal drink your mom use to make you drink x 10) and this one was x 100...really smooth and aged. TMI, but I was bloated from the food, and this was like Gas X in a glass (also works like Pepto if needed). \n\nSolid cocktails aside, my friend and I both agreed that the food needs some work, as well as, the pacing of the courses (we didn't even dig into our salad when our mains arrived). Grand opening kinks are inevitable so I'm sure they'll work it out soon. \n\n*'Toga Tots w/ fiscalini cheddar, chorizo, scallion ($8): 3.5 STARS\nhttp://bit.ly/2f9721E:\nWhile they were nicely crunchy, they were barely warm and we couldn't taste any of the chorizo. The cheese and sauce could have been more evenly distributed.\n\n*Chicken Liver Toast w/ honeycrisp apple butter, endive, walnuts ($9): 3.5 STARS\nhttp://bit.ly/2g7FTBv.\nDeliciously creamy and the bread was nice and crusty. Personally, could have done without all the endive.\n\n*Baby Kale, Quinoa, and Persimmon Salad w/ crispy bacon, egg, gorgonzola dolce ($13): 4 STARS\nhttp://bit.ly/2exSTyW\nOur fav dish of the night - greens were fresh and perfectly dressed with a nice salty crunch from the bacon and blanket of creaminess from the perfectly poached egg. \n\n*Cubano Frank w/ slow-roasted pork, yellow mustard, mojo relish ($15): 3.5 STARS\nhttp://bit.ly/2fPSAvx\nThe soft buttery toasted bread and the deep fried hot dog was good but the mustard was overwhelming. Also, the swiss overpowered the pork so we couldn't taste it. No sides included. \n\n*Burger w/ taleggio cheese, slaw, onion bun ($15): My friend ordered the burger which had two thin patties that were cooked to a perfect medium but the copious amount of coleslaw was very salty. No sides included.\n\n*Cracker Jacks: Caramel popcorn, peanuts, maldon salt ($7): 2 STARS\nhttp://bit.ly/2eTcLYB\nIt was nostalgic to find a prize inside but we didn't like the popcorn. The caramel was not evenly distributed and some clusters were really salty.\n\n*Fried Apple Hand Pie w/ cream cheese frosting ($9): 3 STARS\nhttp://bit.ly/2fNpwpz \nIt was just ok. We expected a flakier crust and the cream cheese frosting was too hard to even spread. A glaze dip would be better. \n\nFor having just opened, the FOH staff was definitely on their A-game. Loved our server - she was super friendly, genuine, and attentive without being intrusive. I forgot to get her name but she also works at The Battery. As I was looking for the restroom, a guy (manager?) personally led me to the restroom downstairs. Nice touch. And, of course the doorman - super cool cat, he greeted every single customer who walked through the door with a welcoming smile. \n\nThe Saratoga is going to be the hottest date place in town with its vintage glam vibe, gorgeous illuminated bar (there's two), and floor-to-ceiling chandelier. Even though the downstairs dining area is more formal (white linen clothed tables), it felt a bit claustrophobic so I preferred dining upstairs. It's equally loud both upstairs and downstairs so if you're looking for a quiet, romantic place for dinner, you may want to look elsewhere. \n\nAs for parking...good luck. Take an Uber or Lyft here.  \n\nHighly recommend coming to The Saratoga for drinks. When I win the lottery one day, $1,500 shots at The Saratoga for everyone!\n\nP.S. - This is an unbiased review as we paid for our meal.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Came here wanting the burger, since it was listed on Eater's Burger Heat Map (https://sf.eater.com/maps/best-new-burgers-san-francisco-oakland-berkeley-heatmap). It looked so amazing in the pictures! The Saratoga is also from the same owners as Spruce, another wonderful restaurant with spot on burgers. \n\nOn Thursday, we checked for reservations on Sat. None were available online, but when we called, a 7:15pm reso popped up for them! Score! \n\nDrinks:\nThe two had I had were amazing - The Walking Dead (Rum, Lemon, Papaya, Pineapple, Pomegranate, Tiki Bitters), and Green Goblin (Botanical Vodka, Green Chartreuse, Maurin Quina, Lime, Basil). Each cocktail is $14, which I guess is higher than going rate, but the amount of alcohol was perfect. Loved it. Very beautifully crafted drinks - see my pic. For the Walking Dead, they poured rum on the pineapple, and lit it on fire. It was sweet, caramelized, and so good. \n\nFood:\n-YOU MUST GET THE WARM TOMATO DIP!!!! I was expecting something like a warm hummus type thing, but NO. It was a tomato that tasted braised with lots of olive oil, butter, and garlic. Apparently it's some Piedmont, Italy tradition. You dip the wonderful tomato mixture on top of the bread - simply amazing.\n-Toga Tots - these tasted like sophisticated carne asada fries! The tater tots are cubed, which is a fun play on food, with cheddar, chorizo, and scallions to top. It definitely tasted like a grown-up version of carne asada fries. If you're into that type of dish, like my bf is, then this is a must.\n-Burger - Pretty good, but I'd say that their sibling's Spruce is better. Saratoga's burger felt like it was missing tomato, grilled onions, etc. But the meat was perfect, as well as the cheese. I also liked the shredded lettuce & mayo mixture! There are no add-ons, like Spruce. But also, the restaurant as a whole is trying to achieve something different. This is a bar atmosphere, not a michelin-star neighborhood-gem restaurant. \n-Harissa-spiced Fries - big enough portion to share among 2 people if you're both getting the burger. They were crispy shoestring fries, with seasoning on top. It came with a cucumber lime dip, but just get the ketchup, because it tastes damn good even with the fries seasoned.\n\nAmbiance: \n-The bar is so beautiful, and your eyes can't stay off of it when you enter the restaurant. It has really cool backlighting, so the lights illuminate the drinks, very cool. It was kind of similar to Black Cat (bar in the same area) in a way, with a trendy feel and black furniture/paint. \n\nService:\n-Excellent. Food came out very quickly, service was attentive, and personable. The bartender who made our drinks came from Spruce, so you know they are well-trained!\n\nI would definitely come back to this restaurant. I think the burger is worth trying, but now that I've had it, the other entrees looked amazing, and I need to try other drinks too. Can't wait!", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Great food, drinks and service. Kinda dressy but easy to get in without a reservation.", "author": "Rabia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "The Saratoga just opened a few weeks ago and it's not bad! Great food and  service but..... I didn't like the way they literally plated most of the food we ordered at the same time. I also had my kale salad last and my main entree before. Could do better of spacing the food out and not in random order. \n\nThings I ordered:\n- Crudo \n- Toga Tots\n- Chicken Liver Toasts\n- Baby Kale, Quinoa, and Persimmon Salad\n- The Saratoga Burger:", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "We were invited to the grand opening, and dinner was on the house!\n\nThe restaurant has a cool modern yet speakeasy inspired vibe, ground floor and basement level dining rooms and 2 bars with a full menu being being served. The seats are comfortable, the staff is well dressed and friendly as well as professional. \n\nWe kicked things off with pork belly buns, kale salad, pickle plate, fries, and burger and chicken pallard for the mains. \n\nI loved the simple, locally sourced menu with some fun twists like use of persimmon, grapefruit, labane, and just well balanced flavors. The burger came out salty so they had to redo, the cheese on it is also very overpowering, it's also served by itself so you have to order a side of fries or whatever and it seems overpriced. Chicken was excellent and fun dish, the rest were solid.\n\nWe had a lot of fun trying the cocktails, something they are going to excel at, all we're well balanced and labor intensive, again shows skill and creativity.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "I came here late a night for a burger, a beer, and a shot.\n\nThat's exactly what I got. for $20+ bucks. Was it worth it? Probably not - the beer and shot were average, but the burger was not great. The patty was a little too loose and fell apart when eating too quickly, and there was some sort of horseradish dressing?? or something on the lettuce. After a beer and a shot, sure, I'll have one. Other bars will serve a side, but none to be found here.\n\nExtensive wine/beer/cocktail/sprits menu, but sometimes simpler is better. Old-school fancy ambiance. Not the worst place to be at the end of a night, but let's just say my boi Jack Dorsey knows what's up when he says Alta is his fav. restaurant.", "author": "Albert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "WOW! Great experience at The Saratoga, totally pleased with this new spot! A GF and I wanted a night out for drinks/gossip and bites, and decided to check this new place out since it has the \"hype.\" I looked online day before and didn't think I needed to make reservations, but when came around 8pm on Thursday it was pretty packed! They have separate waitlists for the tables and the bar, so make sure to choose where you want to sit. \n\nWe snagged a couple seats at the bar, and were served some amazing \"Green Goblin\" cocktails, AMAZING! We had two of them each, so were lightly buzzed when we had some of the most delicious Toga Tots, Salmon Crudo (FAV) and warm parker house rolls...buttery and so delicious. By this time we were craving dessert, and was suggested the cracker jacks (custom made in house) but decided for the fancy ho-hos...the bartender (Malcolm) being awesome, gave us a sample of cracker jacks on the house as well! We were STUFFED and so happy with the place. \n\nIt's pretty crowded and definitely the spot to be at, dates, groups whatever. The downstairs is packed as well but more dinner type accommodations, a little too stuffy for me. Thanks to the wonderful and friendly staff, definitely will recommend and be back!", "author": "Mahsa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "Beautiful bar. Came here on the fly for after dinner drinks. Only negative was the very bright cool toned light upstairs. It was a little off putting and uncomfortable. The light fixtures and decor are quite stunning, but we preferred the cozier, warmer bar downstairs. Our bartender had exceptional knowledge of his collection, particularly whiskeys, and introduced us to Nikka Gin also - which we had never seen. We all enjoyed our drinks, and as for bites, the shishito peppers were undercooked but I appreciated the cherry tomatoes... My friends inhaled the tater tots lol", "author": "Gabi Taylor R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "This is a great place for drinks or friends meeting up after work. The bar and bartenders are top notch.\nMy only draw back would be their dinner/food menu. We had drinks Saturday early evening and were hoping to have dinner but the choices were not as extensive as we would have hoped. We did have appetizers and they were fantastic!", "author": "Pstephan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "Had to try this new spot in my neighborhood -- and it was a good experience.  It gets busy on weekends, so we called and managed to get squeezed in but strangely enough when we got there -- about half the tables were available.  \n\nI ordered the \"Walking Dead\" cocktail which is very pretty and pretty entertaining since they light the pineapple on fire. (get your phone ready you IGers and Snapchatters)  I will say it was a bit strong tasting for my taste -- it was hard to drink. (but pretty? lol)  Oh -- FYI their drinks are expensive, mostly around like $15.  \n\nWe ordered a bunch of appetizers for the table:  We got the \"Toga Tots\" which were a big hit with our group -- everyone liked them.  The \"Spicy Pork Belly Bun,\" which was alright.  My personal favorite was the \"Chicken Liver Toast\" -- this has apples and almonds, and oh my gosh, yum -- so good!  \n\nFor my entree I got the \"Grilled New Caledonian Blue Prawns,\" which FYI still has the head attached (if you're a 5 year old like me, this is valuable info).  The prawns were delicious, however the serving size is fairly small.\n\nI would come back for the ambiance and the atmosphere of the restaurant/bar.  The decor is beautiful and modern, and its a gem in the neighborhood (but an expensive gem).  I wouldn't necessarily come for the food, I would probably recommend it for a glass of wine and an appetizer (specifically that Chicken Liver Toast).", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Wow the tenderloin is changing fast! This place fancy! Totally a techie spot with the price range, 2 of us dropped in the high $200 to $300 for an evening there, but it was a lovely evening. The drinks were yummy, my favorite was one with a flaming pineapple (sorry forgot the name, look at my photos). \n\nThe food! Surprisingly so good! Both our favorites, Home made tator tots and Salmon Crudo! \nAlso had the following, Chicken wings, yummy fall off the bone. Burger, amazingly juicy and flavorful burger, no fuss stuffers, just juicy meat. Mole Fried Chicken, the mole was tasty, good size portion but we were so full already, couldn't enjoy the full experience of it. But then we also ordered some apple pie pocket, it was ok. The hohos were yummy! \n\nWe walked in and was seated within 45minutes on a Friday night around 8:30p.m.\nGreat staff and experience. The doorman was even cool! Props to him standing in the freezing cold.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Amazing brunch spot. Was in San Francisco for the weekend . Definitely recommend!!! Was very delicious. Had the Eggs Benedict and Bourbon French toast. Sooo worth it. The service was great too. Can't wait to come back.", "author": "B R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-20", "description": "I will never return--- our cocktails arrived at our table AFTER our food.  My dining partner ordered the Parker House rolls; they were inedible.  They were tough, hard, evil rolls.  She sent them away.\nMy hamburger's bun was -burned- and the thin patty barely cooked.  I was too tired to even deal with the bad food, so I ate around it, we got our adjusted bill and got the hell out of there.  \nThe drinks were good, yet they would have been so much better if they hadn't arrived after our 'dinner' had arrived.\nZero star...", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Beautiful decor and the same owners as Spruce. The cocktails were amazing - on par with Park Tavern which has the best Manhattan's and Vieux Carre's. The food was decent - I thought the tater tots 'toga tots' were too salty but the salmon crudo was very fresh. Salads were good as well. \n\nThe menu is pretty sparse so most of us got the burger which was pretty good but not the best ever. Service was excellent - I would go for drinks and apps next time.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "I really like this place great first date spot. I got the chicken slider I ordered two I didn't think it would be that big but one is good enough.", "author": "Honey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Came here for a friend's birthday....we were way too many people for the downstairs bar area so we had to split the group between upstairs and downstairs and we made it work. \n\nIt's a beautiful establishment, as noted has 2 floors. The drinks are really good, expertly mixed and they have a very decent whiskey selection. I also tried some of the bar food, specifically the Tater Tots (amazing) and their pork bun (really great, full of porky goodness). Service was also very good.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "I was looking forward to coming here for awhile and was so elated to finally go. Unfortunately, the experience was less than desirable. We sat down and didn't get any acknowledgement from anyone for 20+ minutes while the two top behind that came in after us was offer water and drinks. Somehow we were the table they chose to ignore. We finally had to flag down a passing busser to ask for our server. He arrived shortly after and coldly took our drink order without saying hello or telling us the specials or offering water. He lacked experience and clearly wasn't equipped to be a server. It was fly-by order and go. Drinks took another 15 minutes to arrive - mind you this place has two bars and it wasn't that busy. Needless to say the rest of the night was as predictable as the first 30 minutes. We had to order more sparkling water throughout the evening since our server didn't seem to notice anything on the table. We had initially asked to have our dinner paced out but soon realized it was a bad idea bc of the slow, inattentive service. Food was dropped off all at once and left. It was such horrible service. Our bill was $600 for 4 ppl so it wasn't like we weren't eating. The food was fine - not extraordinary while the service was atrocious. Our busser was the only redeeming aspect of the evening. Yes it looks great inside but what's the point if you get horrible service. What a disappointing experience. Never going back.", "author": "Aech2 O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "I love Spruce, so when I heard they were opening a casual spot in the loin, it was an automatic that I would pay a visit.  \n\nThe space is a lot glossy & a little clubby. Though the latter might be my fault for going at 10:30 on a Saturday night.  \n\nFirst, they deserve major props for their stellar fernet selection.  Top shelf fernet?  $32 a shot.  That's top shelf fernet.  I also couldn't help noticing the ample supply of chartreuse.  So SF old school.  If money is no object, they have a green chartreuse from the 30's that goes for $440 bucks an ounce.  Maybe someday I'll find out how it tastes.\n\nUpstairs vs. downstairs...\n\nThe first level, or rather, the level that the entrance is on, is actually the upstairs.  It really sparkles w the ultra shiny, full bar display.  And w the gorgeous light fixture, it's a vision, even from the outside, thanks to the floor to ceiling windows.  It's peppered w several small tables, in addition to the bar seating.  This is the floor to be on if you want to see & be seen.\n\nI preferred the downstairs.  There's another full bar, but it's smaller, & way more intimate.  More tables & bar seating. If you really want privacy while still being able to witness the action, try to score the cozy corner to the left when you reach the bottom of the stairs, all the way to the back (against the back wall & ideal for 2 people, no more than 4).  It's like a miniature living room.  Alternatively, there are larger tables on the other side of the staircase, which you will pass on the way to the restrooms.  While the rest of the joint was packed & noisy, those tables somehow remained quiet & out of the way.\n\nI had just come from dinner, so I didn't try the food yet.  But when I have a 20 dollar glass of Pinot Noir that I think was actually worth 20 dollars (Deovlet, Santa Barbara, 2014), I'm happy.\n\nNice joint, for sure.  Swanky & cool.  But if you're not into noise or crowds, don't go on Friday or Saturday nights.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "Is this really the TL? This place has so much glitz and swank and less of that hipster \"I'm trying to make this place look all industrial and minimal purpose\"... it would feel right at home in Vegas or LA. Even the majority of the clientele are here wearing a jacket with slacks and dress shoes for the men and fancy cocktail attire for the ladies. Kinda feels like I walked into a tech startup's sales team's holiday party (If you work in that industry, you'll know exactly what I'm talking about). I never thought I would feel underdressed anywhere around that neighborhood.\n\nIn any case, you can consider the food here to also be a fancy rendition of bar food. The burger is superb, with lot of juicy meat flavor and a perfectly toasted, charred bun. The other dishes such as their giant cubes of tater tots with tons of fixins on it (reminiscent of Trick Dog's manimal fries) are also pretty solid. Definitely enjoyed that scotch pudding dessert as well.\n\nWe had some of the cocktails out of the shaken/stirred section, and that's probably where this place felt a bit short. The drinks were good, but not great. There are better drinks at other bars. With that being said, there are very few places in the entire city that both excel at food and at drinks, so this place is still worth visiting considering that they do a pretty decent job at both.", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Love! Perfect brunch. Perfect steak dinner (share, it's generous). Beautiful Caesar salad. I'm a neighborhood local and am so stoked this awesome restaurant is on my block.", "author": "Breana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "This place is AMAZING and has the sweetest most accommodating staff. The drinks were well balanced, the food was out of this world delicious, and the service was fast even on a Friday night?!!!! Will definitely be going back! I must say again the staff was phenomenal and the reservationist was very charming.", "author": "Cherie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "Went here with a few friends for dinner. Everyone thought it was ok, but no one was planning on going back. \n\nThe ambiance is nice and cozy. Not too loud. Good for a nice sit down dinner.\n\nThe cocktails were ok. The Vieux Carre was as expected, the Green Goblin was sub par. Wine was fine.\n\nFood:\n- We had one person in our party who wanted to eat light and hence wanted something vegetarian for the main ... unfortunately, they didn't have anything vegetarian for a main dish; just side dishes. I found that a bit strange, but oh well.\n- Tuna tartare: very mediocre dish. Wouldn't recommend it.\n- Warm tomato dip: good, interesting flavors ... definitely surprised me.\n- Heirloom squash: i liked the texture, but the flavor profile was average.\n- Octopus: good dish, albeit, on the small side.\n- Crab sandwich: this was a special for the day and was definitely my favorite dish of the night.\n- Pork chops: other in the group liked it a lot; i thought it was just ok.\n- Brussel sprouts: below average.\n\nNot a bad experience ... just expected more.", "author": "Ankur V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-03", "description": "I'm attracted to lights.  Traffic lights.  Candlelight dinners.  Spotlights.  But most important, I'm attracted to lights showcasing a wall of liquor.\n\nI sat at the bar after a hard day at work, scanning the bottles of brown liquid happiness that was going to temporarily take my stress away.  Not today I thought...it was going to be a cocktail, chased by a beer.  I'll save the scotch for another time.\n\nBeware that this is a cocktail place, with bar food to accompany the drinks.  Don't come here for the food unless you're fine with an assortment of sliders, buns, and small bites.  It's a lot of flash for the cash, but hey...drink up and shut up.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-06", "description": "First off, kudos for having the guts to open such a beautiful restaurant in the tenderloin.  The restaurant consists of two floors, a ground level and a basement. The basement has a very clubby feel to it with white tablecloths and nice art  on the walls. The concept is very alcohol-centric: The first floor sports a  huge backbar with an amazing assortment alcohol.  The food is good but the crowd was mostly 30ish corporatist posers.  \n\n   One of our group was clearly disabled and having a hard time walking with a cane. (We had showed up on time for our 9pm reservation and we had now been waiting/standing  25 minutes for our past-due table.) When we plopped our friend down on an empty bar stool we were told curtly that  \"all our bar stools are reserved\". I explained that my friend  was having a problem standing, needed to sit down , and I wanted to speak to her manager.  After a few moments Mr. Manager showed up and said my friend  would have to move. I was over their attitude by this point & said \"Sir, you are a public accommodation and I demand reasonable accommodation for my friend under the American's with Disabilities Act. There is no where for him to move to, our table is 30 minutes  late, so you call your owner, and let him know he has a big problem on his hands.....\" \n\nMr. Manager look startled, but did find us a table in about 2 minutes.  Saratoga needs to clean up their act a bit.", "author": "Mark E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "The food was very good - green beans were so good but other food dishes we ordered were really tasty as well. The service was great. I would recommend it if you want something casual but nice at the same time.", "author": "Violet D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Great drinks, great food, great service. Anything else? No parking, take Uber or Muni. I've been dining out in SF for 5 years and this has hit the spot. The best bar counter service ever.", "author": "Vijay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Emily & Will at the downstairs bar were the best bartenders I've had in a long time. They took the time to chat with me and my boyfriend and gave us some great recommendations for our next few bars. Their service was amazing and the drinks were so fresh and delicious!", "author": "Laura K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "I came in after dinner for a nightcap so I haven't tried the food yet.  I will say the drinks are good, but the desserts were better.  Service is friendly, ambiance is good, the upstairs with downstairs give it a speakeasy vibe fitting for the neighborhood.  \n\nThat said, they need to work out some of the operational stuff.  I think bars at restaurants should be first come-first served.  Save the tables for reservations.  I went on a rainy Friday and was told there was a wait list for the bar then watched as 2 guys, that came in after me, grabbed some empty seats and were served.  That's fine if it's a policy but be consistent.  I ended up leaving and coming back another night with a reservation.", "author": "Olivia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Such an original space and cocktail menu! Bartender Emily was top notch, as were the drinks. Totally dug the burger and can't wait to go back to try the 'toga tots and more specialty drinks!", "author": "Rosalita S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Good cocktails, good music, delicious food!! This place is amazing!! For sure Im gonna show up again and again!!", "author": "Bruna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "We tried so many food between the 6 of us and they were mostly great! Nice cocktail and alcohol selection. They had some french toast with Foie gras. Unique and tasty. We had pepper popper after to refresh our palette. Tots were great as others also mentioned, and ceviche was also refreshing. The tomato and bratta cheese dish was tasty! For main, we had mole sauce fried chicken, octopus, beef, burger. With green been, corn, potato as side dish. Each dish was big! Fir dessert, we had the Ho Ho, cherry pie and pudding! We were all stuffed but managed to clean them all up. As it got later, the place got more crowded. Nice bar to hang out to. Downstairs was much quieter.\nSmall and cozy place. No valet parking was a minus... but there is a parking garage one block away on sutter I think.", "author": "Akiko I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "I wanted to give The Saratoga 5-stars but I just can't.  The food and craft cocktails were very good, but we waited 30 mins for our first round of cocktails and then we were asked to vacate our table the instant our meal was done. Nothing like being rushed out when their service was slow.  And we were celebrating a birthday.  It really left a bad feeling.", "author": "S S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Short staffed and slow service! The space is hip... attracts tourists and drunkie crowd. The food is ok to good. Parking is very challenging. Pricy for such poor service. I'm sure the young loud and drunk crowd will enjoy.", "author": "Stefan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "For me to give a rating of 5 stars everything at an establishment has to truly be exceptional. First visited The Saratoga a couple of weeks ago sitting at the downstairs bar and truly enjoyed the cocktails, shared plates we had and the exceptional bar tender Larissa. We visited again last night, NYE, with a party of 5 and reserved a table upstairs. Was so happy to see that Larissa was making drinks at the upstairs bar and she did not disappoint with all of our parties cocktails. We are especially fond of the \"Sibling Rivalry\". Everything about our evening at The Saratoga was exceptional. Our wait staff was amazing! Our waiter Michele was wonderful; friendly, knowledgable of all the dishes and extremely efficient at making our time pleasurable. All of the dishes we ordered were exceptional and cooked to perfection we ordered the seared scallops, chicken paillard, NY steak in peppercorn sauce, a kale salad, sauteed kale and tater tots with chorizo. The deserts are wonderful as well as we ordered the Ho-Ho and the Scotchy Scotch Pudding which is off the hook! The atmosphere is upscale and lively and not annoyingly loud which makes dinner more pleasurably. They are also very cognizant and as accommodating as possible with dietary restrictions and food allergies. One of our party is vegetarian and one of our party has a peanut allergy. Michele was great in showing our vegetarian friend what dishes were great for her and he also had an order of the tater tots prepared without the chorizo. He was also great in letting our guest with the peanut allergy know that the tots were cooked in peanut oil and letting her know what dishes were safe for her.\n\nI should also add that the spirits menu is unbelievable with something like 600 different spirits to chose from. We counted 169 different bourbons alone and if sipping an 80 year old chartreuse is your thing, they have that.\n\nExceptional cuisine, cocktails, spirit selection, staff and ambiance earns The Saratoga 5 stars easily.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "I liked this place! The appetizers were great . The drinks were awesome! We were 7 of us and payed $500 before gratuity. The reason i held back a star was the bartender was very rude when he was checkin my friends Id and it was his birthday. He made a big fuss about his id expiring at 12 a.m and it was 9 o clock when he checked it . Total buzz kill (it was my friends 28th birthday) . Other than that great place . Drinks were alright i ve ha better . I would recommend this place for the food", "author": "Dev B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "We rarely venture into the TL after dark, but I'm thankful we did for this restaurant! Loved everything we ordered -- loaded tatertots, michelada mussels, the burger, even the dessert! My fiance kept ordering drinks because he wanted to try them all too.. HA! And they were all amazing! Needless to say, we'll be back next month to try more items on the menu..", "author": "Kim I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-02", "description": "Cheap bar snacks during happy hour. Pretty good drinks and beer/wine selection. Food overall just just so-so.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "I love this place! The atmosphere; the cocktail bars both upstairs and downstairs. The owners did a fabulous job with the place; I can not wait to be back again!\n\nThe staff is delightful, helpful and knowledgeable. I felt like I was treated to one of the best service experiences. \n\nI wish they keep all the Christmas decorations all the lights make it feel so warm and welcoming. \n\nFantastic whiskey and scotch selection!", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Had the pleasure of visiting The Saratoga with my wife when we were both in San Francisco on business.  Beautiful venue, great food, and amazing drinks.  We enjoyed our experience so much that we came back a second time before our flight out. \n\nThe cocktail program here is the real standout.  We gave the bartender an idea of what each of us preferred and the cocktails she came up with did not disappoint.  My wife still says that the \"Green Goblin\" is one of the best cocktails she has ever had.  I was impressed with the Chartreuse selection and the Manhattans were spectacular.\n\nWe are looking forward to visiting The Saratoga again next time we're in the area!", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "We had dined at Saratoga twice this year since our first disappointing experience there last year and I have to say, both the food and service have improved significantly. The standout dishes are tuna crudo, lamb shank and sea bass. Also, this year we got seated upstairs and it contributed to the overall dining experience.", "author": "EG P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-23", "description": "The drinks were very good but $15 for a Hanger 1 vodka soda is ridiculous.  Overall it was waaaaayyy too expensive, even for San Francisco.  Won't go back unfortunately.", "author": "April R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Best place in the Bay Area 5 stars service 5 stars food 6 stars Managment huge spirit and cocktail selection super cool bartenders this is a beautiful spot with 360 degrees choices. Amazing Sunday Brunch I love Saratoga.", "author": "Michele B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "4.5 STARS\n\nMy girlfriend was lucky enough to get invited to The Saratoga's grand opening. What does that mean? Everything was free! Luckily, she decided to invite me! She made a reservation for two a couple days prior for Saturday, November 5th at 6:45pm. (Prices below were what was listed on the menus we received.)\n\n*'Toga Tots: fiscalini cheddar, chorizo, scallion ($8)\n*Spicy Pork Belly Bun: carolina gold bbq sauce ($7)\n*Chicken Liver Toasts: honeycrisp apple butter, endive, walnuts ($9)\n*Baby Kale, Quinoa, and Persimmon Salad: crispy bacon, egg, gorgonzola dolce ($13)\n*New Caledonian Blue Prawns Baked in Rock Salt: shaved escarole, garlic-chili vinaigrette ($18)\n*The Saratoga Burger: taleggio cheese, slaw, onion bun ($15)\n*Flannery's Dry Aged New York Steak: smothered in cognac-peppercorn sauce ($28)\n*Fried Apple Hand Pie: cream cheese frosting ($9)\n*Scotchy Scotch Scotch Pudding: black label scotch caramel ($9)\n\nWe actually didn't order the prawns, but I'm glad they served them! I adore head on prawns, so this ended up being one on my favorite dishes. The liver toast was great as well. Creamy and flavorful. Everyone knows I love greens, so I had to get a salad. The soft boiled egg made it that much richer and delicious. The steak was cooked perfectly, but the sauce was a touch too salty. The burger was moist and tender. I loved the slaw on it. Had a great pickle/relish flavor. The tots were our first dish. I liked the ingredients, but I wished they were crispier. The insides were also a little mushy. My least favorite dish was the pork buns. Sounded great on the menu, but they were basically small bbq pork buns. More bread than meat which I didn't enjoy. As for dessert, the scotch pudding was so good! I love scotch and I love caramel, so this was my kind of dessert. The apple pie was nice and crispy, though I didn't love the cream cheese frosting. I would have rather had something more comforting, like an ice cream.\n\n*Japanese Blended Highball: yuzu, mint, soda ($14)\n*Vieux Carre: rye/cognac/sweet vermouth/angostura & peychaud's bitters ($13) ×3\n*The Walking Dead: rum/lemon/papaya/pineapple/pomegranate/tiki bitters ($14) ×2\n\nOf course we had to have drinks! I asked the server what he recommended and he suggested the vieux carre. Great drink to start off the night. I liked it so much, I had two of them! My gf started with the highball. She didn't really like it that much, so she moved o to the vieux carre as well. For our next round, I asked the server what he suggested as a follow up and we decided on the walking dead. I'm normally not a fan of rum, but this was delicious! Pretty as it was served with a flame on the pineapple. It was fruity, but very balanced and boozy. And I normally don't like fruity cocktails. For dessert, our server recommend two glasses of Champagne. I didn't catch the kind, but it was nice and dry, which I prefer.\n\nService was excellent. Our server was sweet and attentive. Such a friendly guy. And the bar at The Saratoga is beautiful. Wish I could have such a pretty bar at home! They gave us our comped tab at the end of the night. Total with our one bottle of sparkling water and one bottle of still water was under $250. We ended up tipping him $50 before we left for the night.\n\nI'd say the food was more a 4, but the service was so good, I'm rounding this review up to 5 stars.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-22", "description": "Upon arriving tonight for our 6oclock dinner reservation, I checked in with the host who then proceeded to answer the phone and seat other guests before asking if I would like to be shown to the table or communicating that I have to wait for the rest of my party to arrive. Finally after standing there looking confused, I asked if I was supposed to stand or if I can be seated. Her response was, \"it's up to you\". I requested to sit, and as I was being shown to the table she tells me there is another reservation at 7:30 so we need to be finished by then. \n\nShe then tells everyone else in my party the same as we arrived. Our waitress then proceeds to tell us 2 more times that we have to be finished by 7:30. \n\nOur food takes 30 minutes to arrive, which by the way was mediocre and nowhere near deserving of the price. While my friend is still eating and as a drink is being being delivered to me at the table, our waitress then again tells us that \"it's 7:20\" ... we let her know we thought it was very rude to keep reminding us of this.\n\nOther than this our drinks were delicious and our waitress was very attentive. It wasn't her fault but it also isn't our fault that the hostess accidentally booked two parties too close to each other. We spent a lot of money to feel rushed. I won't ever be back.", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Top notch service, food and of course cocktails without the pretension. \n\nSip a Rare whiskey solo at the bar and house their insanely delicious unconventional burger....\nBring mom for a luxurious 4 course dinner and bottle of wine....\nGather with a group of friends and lose hours ordering specialty cocktails - the underrated chicken sliders and other easily shareable snacks....\n\nHowever you wish to enjoy the Saratoga it would be hard to not leave full & happy. \n\nIt's refreshing to go to a bar that's not run by a pretentious kid with attitude that rolls his / her eyes at someone's 'uncool' drink order... \nEnjoy your white wine spritzer ! \nThey'd also be happy to recommend some lesser known spirits or a different variation of your usual libation. \n\nFood and cocktails can easily be ruined by a lesser than experience. \nDon't foresee that happening here - hospitality is first. Great marriage of old school hospitality and charm with creative and inventive twists from ambiance to menu. \n \nWill always be a solid go to in SF - especially that neighborhood. \nLOVE that Mezcal highball too", "author": "Larissa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Great service, food and drinks! Nice modern interior with 2 bars. Fairly decent size for the city.", "author": "R W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "I can't believe I've never been here before today! Amazing cocktails, out of this world food, and a super cool interior. You must check out the bar in the basement!!! Jason was our bar keep and server, he was very friendly and informative! Started with the drinks, Brooklyn-5*, burbon highball-5+*, walking dead -5*, decaf coffee -3*(You can't be great at everything) \nFor food had the tots-4*, chicken sliders -5+*, asparagus salad -5*, ho ho's-5*\nSo many tastey sounding menu items,  so little time...\nI will be back to try more, soon!!", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "I'm glad my last Friday night plans for happy hour got quickly nixed.  Taking two close friends out for drinks and bites for belated birthdays turned into so much fun.  The lower level bar was where the fun was at.  Our expert bar/mixologists knew all the right things to suggest for our 2 hour soiree at the bar.  For $200 out the door with tip, 3 of us ate enough, drank a lot and met new friends.  \n\nDef a little too far into the Loin for my taste, but this area is quickly going gentrified and the businesses/restos are turning upscale.  We will be back soon!", "author": "A W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "This review has been a long time coming. The Saratoga has definitely become our favorite spot. It is beautiful! Drinks are amazing and the bartenders really know their stuff. Everything we have eaten off the menu has been tasty as well. It can be busy but we try to go early. The downstairs bar is usually our first choice. Definitely a gem!", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "I really enjoyed this place. At first I was disappointed to be led downstairs since upstairs was not that busy. Turned out to be very cozy downstairs, I liked. Vieux Carre was super yummy, although my husband didn't like his and said it was lacking.. it was good. Very good Brussels sprouts, on the saucier side compared to other versions of roasted sprouts. Good fries. Although the gentleman next to us was about a minute too late in telling us to get the tater tots. Our waitress was very approachable, I was worried this place was gonna be snooty, and friendly. I think the only reason I gave 4 stars instead of 5 is that the menu is a bit more of a bar menu than I had expected. I'll definitely go back.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "When I found out there was a swanky bar/restaurant nearby named after my hometown I immediately had to bookmark it and ended up stopping by with a friend on a Friday night. I did not have a reservation but they put me down for the waitlist and estimated a one and a half our wait time - they do take your number down, which is nice so you can go to a nearby bar to wait. Well by the time I got to Upcider down the street and ordered my drink they called me for my table! The wait was only 30 minutes!\n\nMy friend and I were sat in the upstairs bar area right next to the door at a small table. The atmosphere is very lively, more bar-like than restaurant-like. They have a lot of smaller sized tables upstairs and I saw some larger tables and couch seating downstairs. Seems like a good place for a date!\n\nWe ordered some drinks, the Walking Dead came out on fire which was a nice Snapchat moment!\n\nFoodwise we ended up getting a bunch of smaller items to share and I enjoyed them all. Toga Tots are a must, the fried chicken sliders were good as well. The chicken liver toast was not the best I've ever had but I did enjoy the hamachi crudo.\n\nAll in all it was a great spot to eat on a Friday night and the fact that it's so well located with tons of other bars nearby is a major plus. I'm sure I'll be back!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "I live on the same block and have watched this space go from boarded-up nothing to the beautiful restaurant it is now. So there was lots of excitement when we went on opening night. Did it live up to expectations? Yes. And that's both a good thing - and bad. \n\nThe Saratoga does everything you'd expect from a mid-high range restaurant/bar hybrid in SF. The retro-modern fixtures, the suited staff, the loud - let's be honest - terrible music, you've kinda seen it all before. And sure, it works. But is it groundbreaking or memorable? No. \n\nWe ordered five plates to share between two, ranging from apps like the deliciously salty toga tots, to the larger spice-encrusted chicken paillard. The fried apple pie dessert was a fun nod to the classic McDonald's apple pie - and I don't hate it. Drinks are tasty, but the pours are a little on the smaller side. \n\nAt $130 for two people, it'll probably be a while before we go back. But I also know it takes a lot of guts to open in this neighborhood, so yes, I can drink to that.", "author": "Ky W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Beautiful two-level bar/restaurant.  Pick your vibe--the airy and open upstairs bar and dining room, with gorgeous unique chandelier focal point...or go downstairs, for a cozier lounge-like feel and a smaller but no less dramatic marble bar.\n\nThe Saratoga is one of my favorite spots to go for a drink with friends.  And the food is so good, we always end up getting something to eat, even when we didn't plan to.  I'm gluten-free, and while there's definitely some stuff on the menu I can't have, the servers and bartenders are always very knowledgable about what's safe for me to eat, and happy to make alterations to the dishes as needed.  Current faves are the octopus and the pork chop...and to drink, try the 'Look at the Flowers.'  I've never been for brunch, but it's high up on my to-do list!", "author": "Julia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "Fresh. Whether you're looking for a vibrant bar scene, a hip place to grab a bite, or a more intimate setting to dine and grab a drink, The Saratoga has it all. There are two floors that create separate ambiances to fit the vibe you are looking for. \n\nBefore getting into food and drinks, I want to give a shout out to the great staff. They were some of the most professional service providers I have interacted with in SF.\n\nDrinks are flavorful and crafted with care. If you are with a group, you must try the \"Cocktail Bill\" Boothby Bowl. It is beautiful AND delicious. My photo attached does not do it justice. \n\nOf the \"snacks\" on the menu my favorites were: Toga Tots, Spicy Pork Belly Buns, and the Seven-spice chicken sliders. \n\nAnd the burger needs its own paragraph, but I will let the reviews speak to it. Just get it. You won't regret it.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Fun and energetic atmosphere with friendly staff and delicious food. We had a great night out and managed to scarf down the whole dessert menu between the four of us! You'd be dumb donkey to skip the deep fried apple pie pocket. Don't be that donkey!", "author": "Jack J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Great  cocktails and attentive service. Came without reservations but was able to find a spot.", "author": "Costel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "The upstairs bar is So Beautiful! We began with cocktails and then added bar snacks.  The special the night we were there was soft shell crab sandwich! So lucky as it's 1 of my fav.\n\nAdditionally there is a second bar down stairs.", "author": "Nat D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Checked this place out on a Friday evening. The scallops were very good and well portioned. The appetizers all came out cold, though. Apparently it's an issue they've been having and can't figure out why? Maybe just run the food out when it's ready?! Very short staffed so wait times are long.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "We had a wonderful and memorable meal here. Our table had the burger, fried chicken mole, the mussels, corn, burratta and the pork chop. Everything was so delicious but our favorite was the pork chop. \n\nThe ambiance was perfect. Low lighting, comfortable table with the music at the perfect level. I would say this is a great date spot. \n\nAll the staff was very accommodating and friendly from the hostess, the bartender and the Busser. \n\nOnly criticisms were that I felt the server was a bit rushed with us and that the desserts were not as delicious as the dinner (butterscotch pudding and the chartreuse donut).\n\nI will be back soon.", "author": "Leilani B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-10", "description": "A very nice bar, good ambience, attentive staff etc. This place has got all the ingredients to be a hit. However, 3* from me because of the rip off prices. $21.08 for a beer and a G&T!!! I mean, how can that be justified, even in this city, it's just robbery. Cannot go back for that reason. Sad.", "author": "Simon P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-18", "description": "It's a pretty place in a dark part of the city. \n\nLast night (9:15-10:30) it was full of people who seemed to be three drinks in: shrieking at each other, spilling stuff, and falling into the tables. I've seen it like that before: this is a bros-night-out place. Every 15-20 minutes, the loud sound of breaking glass cut through the yelling. (Sometime a patron had dropped something, but the staff were breaking things, too.)\n\nWe ordered the ribeye ($36), the burger, the spicy fries, and the snap peas. Companion had a dirty martini and I had a half glass of Bordeaux ($16/glass).\n\nThe ribeye is billed as \"marbled, aged, prime.\" I asked for medium rare. It arrived thin-cut, dry, gristly throughout, medium-well, and barely warm. Pretty much inedible. We were sitting at the bar engaged in conversation, and were largely ignored, so didn't have a chance to say anything about it. There are several places in town to get a great ribeye: eg. Rich Table, Monsieur Benjamin. This is not one of them.\n\nThe fries, accompanied by a variant of cucumber raita, were nicely spiced but unremarkable. Go to M. Benjamin for frites.\n\nThe Bordeaux seemed young, thin, and not really ready to drink. This is a cocktail place - skip the wines.\n\nThe staff is attractive, and the snap peas are delicious. The cocktails might be good. But I will not likely go back soon.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "We shared a special evening here on the night of our engagement. Will, the bartender (who also served our dinner) went ABOVE AND BEYOND to make our evening one to remember. The comfort food and amazing cocktails were A+. We were even given a dessert donut and a champagne toast, along with a congratulatory card! \n\nWe will definitely be back to The Saratoga; I hope Will is still there!", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "This place is fantastic! The food is unreal. The chicken slider is so delicious it is the perfect size and literally melts in your mouth. The atmosphere is great very hip. The service staff is always nice and really knows their stuff. Great place to grab dinner and drinks. Miko the manager is incredible he is always so kind and accommodating! He is half the reason we keep coming back! They should keep him around for as long as they can!", "author": "Jazlyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "Beautiful Art Deco inspired space. Solid simple comfort food. Good selection of whiskeys. Reminds me of a romantic film noir setting.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "The most wonderful service at the bar. Had the burger with extra lettuce as suggested by the lovely bartender.", "author": "Yoli V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Really enjoy this place. Make sure you make a reservation or you will not get in. You can only make reservation by calling which is annoying for these days.", "author": "A Nicole M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-27", "description": "This is a beautiful bar with imaginative cocktails and the most extensive list of spirits I've seen. The wine and short beer list works too. We were here for a kinda splurge dinner drawn by the dry aged steak on the menu and interesting small plates. The tots were tasty as advertised. And while the tomato dip wasn't quite what we expected, the flavor absolutely worked. However a special shrimp taco had a mix of flavors but none of them was shrimp, just crunchy bits. And for me the steak was a complete disappointment. Ordered very rare it was barely rare. (They didn't check until about halfway through the course.) Plus it was smothered in the peppercorn sauce which somehow took away from any sear on the steak. It wasn't that tender either. May go back for a drink and a burger.", "author": "Sally S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "I've now been here twice: once for drinks/snack, once for full on dinner.  Both times we sat at the bar on the ground floor.\n\nThe cocktails are lovely, but I was disappointed by the conspicuous dearth of libations including Chartreuse, considering the fact that the Saratoga is (apparently) focused on Chartreuse, owing to the crazy Chartreuse list and the prominently displayed wall o' chartreuse.  I happen to love the stuff, so I was very much looking forward to having an oyster of a cocktail list-world to choose from, but sadly there was only one.  So I ordered it, and it was GOOD, but, you know, choices are better.  I happen to like bourbon and chartreuse together, and the one cocktail with it was a vodka base.\n\nThe food.  Guys.  The food.  It's good.  OK. It's real good. Like super, really, extra, good.  The menu is somewhat unsuspecting.  It's maybe not the most eye-popping menu on its face.  But everything is simply scrumptious and perfectly executed.  Case in point: the tots.  So like, tots are having a moment right now and I guess \"totchos\" are the new hotness.  These are not that.  These are handmade shredded potato cubes, fried to perfection, super crispy outside, perfectly tender potatoey center.  Somehow the edges on those potato cubes are sharper than a drill Sergeant's hospital corners.  I don't know how they construct these tots, I only know they taste good.  The fixins they come with send them right over the top.  You gotta get these tots.  They're really more of a gorgeous potato croquette, if we're going for accuracy.\n\nAnywho!  There was a tomato dip, bagna cauda, thing which was AMAHZING.  Like, the most tomatoey thing I've ever eaten.  Like, tomato distilled to its most essential, that you can dip bread into.  I was into it.  I would have liked to actually bathe in this bagna cauda.\n\nThere were other things too, we over did it, big time, but it was worth it.  Go there. Eat the things, drink the drinks, you won't regret it. \n\nNext time I'll shoot for a spot downstairs as it was much quieter and more intimate.  There's another bar down there, too, FYI.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Brandon and staff made our evening amazing!  The food, cocktails and ambiance were over the top. Do yourself a favor and get over there soon!! Gorgeous bar upstairs and downstairs!!", "author": "Phyllis R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "One of the most phenomenal meals that I have had the pleasure of having in several months in San Francisco. This place has nailed everything. \n\nAmbiance: 5 stars. Beautiful bar and dining area, very comfortable seats and a cool vibe.\nFood: Delicious.  No need to elaborate, try it all.\nService: The servers were SUCH a joy and gave us great recommendations.  \n\nWill be back!", "author": "Maggie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I went here for the first time several months back and just getting to this review. There is a special memory to the one time I was there, so my 5 star could be a influenced by that...lol. It is a solid 4-5 star place to me regardless of that. I only had drinks and an app here, so I can't say anything about dinner, but I still remembering enjoying the drinks and app very much. The ambience was nice and the service was great - from the guy who made sure to open the door when I arrived and when I left, the host who gave me her two cents on where to sit based on why I was there, and the waitress that served us. I would definitively go back and recommend to others.", "author": "Kat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "It used to be our favorite go-to spot for environment and pretty solid food/menu. Then they took their chicken mole off the menu which we thought was their best dinner item. Very disappointed...\n\nThe restaurant then contacted me and stated they would make it upon special request with advance notice. I would say that's going above and beyond. Sounds like they are trying to make improvements constantly which is awesome", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "For sure was my fav spot on my trip!! The ambience is great and the food was delicious. The staff took such good care of us also. A must try are the ribs and the mole!!!! Definitely give it 5 stars!!!!", "author": "Victoria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Stumbled upon this gem after bar hopping through the Fillmore. Their drink and food menus are expansive, where every option has you licking your chops. I ordered a couple of dishes off of their snack menu: the beef tartare, pork bun, and fish crudo. The tartare was exceptional: Asian flavors with homemade, salty kettle chips - the perfect textural and flavor contrasts. The pork bun was pretty good, a lot different than baked pork buns you get at a Chinese bakery in SF. The dough was crispy on top and thick on the bottom, but the flavors were awesome and the mustard based sauce on the side really made the dish. The crudo, on the other hand, I could have done without. Though pretty to look at, the fish was not cut thin enough. Overall, this was a good meal accompanied by a delicious cocktail that just makes you feel freakin fabulous. I will definitely be back.", "author": "Adriana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Ate dinner hear at the downstairs bar.  Wifey and I were pleasantly surprised at the quality of the food and drinks.  The cocktails are really good, and different enough that they alone are worthy of stopping in.  Meanwhile we are some appetizers and loved the Tater tots, Kale Salad and chicken sliders.  I also got a burger, which was only so so (but every burger is now ho-hum after having eaten Plan Check burgers).  \n\nThere's not many restaurants that we go to and I look forward to coming back, but The Saratoga will be on the frequent dining list.", "author": "Todd W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Fabulous Restaurant! If you want a chic night out in Sam Francisco, this is your spot. One of the bartenders, Will Morgan made me the delicious cocktail. I highly recommend the avenue! So delicious!! I would give this place, 10 stars if I could.", "author": "Carlotta W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "The place is really cool, and the cocktails are amazing. The space is gorgeous with perfect lighting and the seats are comfortable.  The beef tartare was really great as was the kale salad. I liked their chicken sliders and tater tots though I don't think I'd do the sliders again. It was fine but just not that great. \n\nService was top notch and servers were very well trained. High quality stuff from the makers of Village Pub and Spruce. Great job.", "author": "Sean K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-16", "description": "Location was just around the corner. Interior was stunning. Loved the drinks. Food was alright. But I will head there for drinks.", "author": "Kalyana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "This place is legit. \n\nI came to the Saratoga when I had absolutely no right to be going out: I had just returned from over a month of traveling, I was feeling wildly introverted and it was a Friday night. Needless to say, checking out a hip venue didn't seem likely in the cards.\n\nBut I'm glad we came here.\n\nWe were well taken care of at the Saratoga. Despite being full of people, we still managed to find a nice corner to sit in where a really friendly server took our orders with a smile (literally... not a figure of speech). I ordered the Sibling Rivalry (Rye, Canton Ginger, St. Germain, Regan's & Peychaud Bitters; $13) and we all agreed it was the best drink. It soothed my soul.\n\nSo if you want a place to chill that's classy, hip, yet comfortable, come to this joint. Saratoga, I think I love you.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "This place is amazzzing!!! Food and presentation was awesome. The Mole was my favorite. Service was incredibly too.. I will go back next time I'm in San Francisco!", "author": "Susana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "This place is amazing! Food was excellent!  Service and atmosphere were perfect! Will definitely be back next time we are in San Francisco!", "author": "Margo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "I liked this place. Great ambience, service, drinks and food. I was impressed with the server Liz. She explained several of the menu items and gave suggestions. We were very pleased. The side salad was a palate surprise! We also enjoyed the chicken sliders and tots. A great treat at the end is to order one of their aged chartreuse shots! It goes great with any of their desserts. I definitely plan to return. Especially to try their new Sunday Brunch.", "author": "Cat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "One of my favorite places in the city! The food is always great, the liquor selection is amazing, and the employees are wonderful.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "The Saratoga is undoubtedly on the top of my list of favorite bars in San Francisco. The atmosphere is sophisticated yet intimate, making it the ideal choice for both professional and personal occasions.\n\nThe service is unbeatable, and arguably some of the best I've experienced in the city. I have a dietary restriction that oftentimes makes dining out a challenge. The waitstaff here is always so accommodating of this restriction, making sure to point out what I can eat, and what they can modify for me. They are extremely knowledgeable about the ingredients in every dish on the menu. The food here is a lovely twist on comfort food. I highly recommend the Spanish octopus and the New York Steak.\n\nThe bartenders here are among the friendliest I've engaged with, and they make the most impeccable and beautiful cocktails. My personal favorites are the Free Trade Agreement, and The Walking Dead (they light a pineapple on fire!)\n\nI can't say enough positive things about the Saratoga. It has become a staple among my friends and family for happy hours, cozy dinners, and late night drinks.", "author": "Liza P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "I have been to The Saratoga on many occasions and wanted to share my experience of it with yelp.  I dine out in the city often, and what strikes me most is how often I am disappointed with the service that I receive.  For sure, I dine out for the food, the drinks, the atmosphere of a place... but what really gets me returning to a restaurant or bar again and again is the hospitality that I receive.  The staff at the Saratoga are always gracious and always make me feel welcome.  The drinks are killer, the food awesome, and the ambiance is wonderful - but what really sets them about is their service.  Kudos to them!", "author": "Emo A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-14", "description": "Went tonight for my birthday 1st time we thought it's a weekday a Tuesday not needing a reservation because it's almost at the middle of the week. Got there and basically we got told tables  are reserved and bar seats and corner seats are the only available ones. So I went to open table and what do I find? Open seats for two in 15mins. Odd right? Well yah I did made reservation hubby went to the hostess and said we have reservation well she told him that she was surprised that it allowed us to do that. Well maybe because when we look at that open table app it shows there were open reservations between 8pm-9pm which will be ample time that we will spend there. But then she needs to give us a table now because we have reservations. Waited for a little bit and while we wait we ordered some cocktails which is one of the reasons why I gave it one of the stars since drinks were tasty. Got on our tiny tiny table of course shoved in a corner server she was nice that's what the second star is for I was debating at first because our food came so late and cold plus she was more attentive to the table that was drinking heavily. Then we looked at a two page menu and 98% of the menu book consists of different kinds of cocktails and other alcoholic beverages. Ordered a snack and two main dishes first menu was really pathetic. Food ordered steak, hamburger and tater tots? Verdict it was Blah best thing we ate were the tater tots. That's why I didn't give it another star cause food sucked! Oh yah Did I mention it was my birthday? First time here and wanted to have a good experience since it had such a great review in yelp. Well, by the way we got treated when we first got there that should already be a sign not to push through and being treated that way on your special day that was a huge mistake I wouldn't want to spend anymore money on a place that treat you like shit! That's why sometimes it's good to stick to the great places you know and not take a risk and just have a very disappointing experience on your special day. I think giving it two stars is still very generous. Worst dining experience we've ever had to date!", "author": "Dawn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-05", "description": "Finally walked in to try the 'new' spot & lounged around for a bar stool to become available. \n\nOverall A-ok (as yelp puts it)! Food, nothing that stood out and your usual drinks!", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Great new bar near tendernob. Definitely recommend getting a cocktail here with friends. Beautiful art all over the walls. Also yummy burgers.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-18", "description": "Pretty shocked by all the amazing reviews this place has. My friend and I visited for the first time on a Tuesday night - it was very full with a pretty heavy tech scene. The place itself is nice but I wasn't super impressed with the ambiance - it has the look of most hipster places that cater to a 30+ crowd (which isn't a bad thing, just saying it isn't very unique!)\n\nThe wine list started at $18 by the glass which is insane. My friend even sent back her first glass because she didn't like it. My cocktail (I think the Brooklyn) was very very good and def a highlight of the night. We ordered the kale salad, pickled veggies and steak tartare. None were that great. \n\nOur waitress was good, service was good.\n\nOverall, giving it 3 stars because it is overpriced, not interesting and didn't stand out.", "author": "Heather C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "It is so wonderful to find out this restaurant has good food and service. After we tried the 1st, we felt we want to go back again sometime soon since it is right next to our area. For me to give a rating of 5 stars everything. The service was truly be exceptional, it was super nice customer service, as well the good.  We were sitting at the downstairs for party two of us, enjoyed the food and truly enjoyed the cocktails. Looking forward to try their other dishes.", "author": "Meichelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "This place is Vibe-y. It's got that swagger...It's where the cool kids are and everyone has those shoes you want and are rocking that perfect cat eye look you've been working on. \n\nThat said, the food is good/fine--we only ordered apps (which you can totally do btw and leave full). I hear the mains are just so-so (even our waitress said she prefers the apps to the mains).  But we loved the parker house rolls, the chicken sliders and the pork belly buns.\n\nSo what you do is: go here if you need a cool spot to meet some friends for great drinks and a bite to eat--the bar is legit in it's own right. Don't go here for the food, it's just not the reason this place is hot.", "author": "Lola C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "5 stars for the drinks! WOW. The highball cocktails are fantastic! My boyfriend and I ended up trying all of them and we had a hard time picking our favorite! Each was well balanced, well thought out, and very well executed. \n\n3 stars for the food- we ordered the beef tartare with kimchi which sounded interesting and just tasted a bit off. I applaud them for trying to be different, and it worked in a sense because it did make me order it.. but it was just too funky. And the potato chips it came with were so overly salty that it took away from the delicacy tartare is known for. We also ordered the pickled things, which was delicious... but more \"soaked in vinegar and simple syrup\" than actually pickled. The best thing we had were the rolls with olive butter!!!! SO GOOD! I could have eaten 100 of them.\n\nAnd of course, the inside is absolutely beautiful. It is a stunning space. And the service was beyond excellent- which is why they deserve the full 5 stars. \n\nWill be back for sure!!! (And will order some entrees instead of sticking to the starters.)", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Delicious food in a really cool space. Taking off one star because it seems like they still need to work out some post-opening kinks - we had a reservation for 2 & had to wait over 20 minutes for our table (which is fine, we weren't in a rush) so went to the bar for a round of cocktails (Walking Dead is amazing). We were told we could bring the drinks to the table & it would be added to our bill. One of the bartenders followed us to our table and scolded us in front of the other tables for not paying (he thought we were trying to skip out on the tab). VERY awkward. We will still be back and will hopefully have better service at the bar!", "author": "Sarah U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Great vibes, delicious food, yummy drinks and great service (shout out to Mandy). Must try the pretzel and hamachi!", "author": "Loan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "We came in for a casual dinner last friday and had the most AMAZING service. Mandy (one of the managers) gave us the super interesting background on the building and how the restaurant concept came about! she also poured us a complimentary drink, and had really great recommendations. We loved everything we ate and the atmosphere is perfect for date night or a group of people. We will be back for sure!", "author": "Tara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "Love the design and decor. My husband and I had dinner at the bar. I don't remember either of the bartenders names but they were excellent and personable. My husband had the burger which was pretty incredible. I had the octopus, which,unfortunately was not. It was way too tough. But that was the only miss.", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-13", "description": "As a bar, this is a 4 to 5 star place.  Gorgeous bar and decor, great cocktails, bartenders, and a lively atmosphere.  Definitely worth a stop for a drink or two.  \n\nAs a restaurant, this is 2 to 3 stars.  The food completely misses the mark.  It's overpriced, improperly seasoned, and the menu could use a serious overhaul.  I love a good parker house roll and this wasn't it.  It was not warm, buttery, and soft as they should be.  The kale salad with persimmons desperately needed the persimmons to be grilled and the salad also lacked acid/brightness.  The toga tots were the only dish we liked, but who doesn't like tator tots?  The prawns were nothing special and overpriced for the portion size.  Even the dessert (Ho Hos) were sad and uninspired.  I get that this menu is supposed to be dressed up American classics, but at the price point, there could be a lot better inspiration and direction.   \n\nBottom line: Go for drinks and maybe the dolled up tater tots, and then go eat dinner elsewhere.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "TL;DR Great service, food was delicious, reasonable pricing, loved the selection of cocktails and whiskey. Also loved the ambiance and their liquor display!! (Another reviewer said it was overpriced, I disagree. Remember to compare fairly and where you are eating. This is SF and it seems they put a lot of work into sourcing high quality ingredients in their food and drinks. The $$$ is accurate, it's between $30-$60 per person.) Yes, we had a full belly too!\n\nI live 4 blocks north from this place so I was excited to see it pop up on my yelp radar. I had a reservation at 8:30PM but unfortunately I wasn't seated until 9:10PM (maybe a one off). At first I was a little disappointed but they quickly made it up through their amazing service. The servers and hostess was apologetic and they quickly started off our table with complimentary Toga Tots. We were going to order this anyway so we were even more surprised they gave us two orders on the house! They also threw in some Cracker Jack popcorn with our desserts AND ended our dining experience with complimentary green and yellow Chartreuse. - It was strong, a tiny bit medicinal, and refreshing. Ashley (our server) really made sure we had the the best experience. Honestly it made me forget that we even waited for our table and prompted me to write this 5 star review. Big thanks to Ashley, the hostess and the other server with a beard! This was a better service than some of the Michelin star places I've been to so we made sure to tip big! I hope they stay consistent.\n\nIf you want more details, keep reading!\n\nHere's what we had:\n\nDrinks: \nAvenue, Bijou, Brooklyn (All very, VERY good, they have a great selection of Japanese whiskey too!)\n\nSnack: \nWarm Parker House Roll -  (4/5 served with whipped kalamata olive butter. so good)\nShoestring Potatoes - (4/5 crispy, not too salty or greasy, well seasoned)\nToga Tots - (5/5 LOVE THIS, reminds me of my grade school days)\n\nVegetable:\nPoached Tomato - (5/5 LOVE, seems simple but its bursting with flavor [bet it has good margins lol])\nBaby Kale, Quinoa and Persimmon Salad (5/5 LOVE! I think the persimmon was marinated, the other toppings and dressing was perfect!) \n\nMeaty:\nMussels cioppino (5/5 I've had my fair share of mussels in Brussels so this was the most tender mussels I've had in SF!)\nChicken Paillard (3.5/5 chicken was tender, flavor was on point, but the skin was too charred)\nThe Saratoga Burger (3.5/5 burger was good, the meat was well cooked, they noticed we were sharing and so our burger came cleanly split)\n\nSweet: - all yummy depending on your preference\nFried Apple Pie \nScotch Pudding \nHo Hos\nCracker Jack\n\nThis is my longest review but well deserved. Welcome to the neighborhood Saratoga!", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "The Saratoga is a swank bistro from the folks who brought us Spruce.  The bi-level venue is gorgeous and has an up-tempo vibe, great service, an active bar scene, and very good food.  The clientele is composed of swells, couples out on a date, groups partying at the bar, and even single diners like yours truly.  \n\nMy meal started with an appetizer of bagna-cauda poached tomato that came swimming in garlic cream and basil.  On the side was slices of grilled levain that one could either dip in the sauce or spread the tomato onto.  This was a lovely plate of food with just the astringency needed to liven the appetite.  Score one for The Saratoga.  \n\nNext up was the dry aged New York steak medium rare that came surmounted and surrounded by a cognac peppercorn sauce.  This huge chunk of perfectly cooked steak is of a suitable size for sharing by two or three guests.  Being alone I ate the entire steak and enjoyed every bite. \n\nTo accompany the steak, I ordered a second appetizer: the warm chantenay carrot salad with avocado, toasted seeds and vadouvan.  Here, I over ordered (my server let me know this) but what the hell it sounded like a great plate of food.  And I was correct.  The salad was superb.  \n\nIf you order as I did The Saratoga is not inexpensive but it is less so than Spruce.  If you are rational you can have a cocktail, a few of the smaller plates, an appetizer or two and get out inexpensively. \n\nIt would be appropriate to close by noting that the serving sizes here are quite generous.  So there you have it: great venue; wonderful service; a feel-good vibe; and wonderful food.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Great atmosphere, friendly service, great food and drinks! \n\nThere is a vast whiskey selection, and the energy is great!", "author": "J N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "This is a good review. I walk by all the time and was curious of what they were doing with this corner. So on a Saturday night I allowed the doorman to sweet talk me inside. The Saratoga is a dark and very luxurious looking bar classy romantic. The entire staff is very friendly and outgoing. \n\nI ordered a chicken dish and some french fries warning lots of garlic they were wonderfully presented I didn't eat much and took it to go. I'd go there again. \n\nI would compare this place to The Black Cat except they don't play jazz and the food and staff is much better!", "author": "SF T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "The Saratoga is absolutely fantastic. I haven't had one thing on the menu that wasn't delicious. Both food and drink! And we've had pretty much everything on the menu! The atmosphere and the service has been great as well! Love it and can't wait to go back.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "They just opened 2 nights prior to us going, but things were running smoothly.  It was completely full upstairs when we arrived around 10:30 on a Friday, and lots of people were eating.  I had read about the food, which seemed highly anticipated, but we came after dinner, so we were too full.\n\nI like the decor a lot - clean, classic but modern, interesting.  The display of the collection of rare bottles is nice with the back lit shelves and the library style ladder (I'm obsessed with getting one at home one day).\n\nDrinks: \n1. The avenue: bourbon based; it's hard to find a passionfruit cocktail that's not overly sweet, but theirs is actually just the right amount of tartness. I'm guessing they use a fruit puree instead of syrup because most other ones I have outside are way too syrupy\n2. Grand pendennis: gin based, with apricot brandy, bitters, lime. This is also on the tart side, not super sweet. I am not a huge gin fan, but it was a pretty good cocktail.. maybe a little strong on the bitters (in combination with the juniper from the gin)\n\nDrink prices are pretty reasonable.  Presentation was nice - my drink had a flower with a tiny clothespin to attach it to the side of the nick and nora glass, which was nice since the garnish usually falls in my face when I take a sip. Also, I love their glassware - I saw some of the cutest mini coup glasses (not sure for which drink). \n\nThe bartenders seemed experienced and calm/collected.  Extra nice touches: a doorman, water refills, and when I was looking for the bathroom, one of the servers personally walked me downstairs to show me where it was.\n\nI would definitely come back.", "author": "Marilyn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-11", "description": "Good drinks (the Negroni). Slow and inattentive service. Uninspiring food. Nice venue and atmosphere. Won't be returning for dinner, but maybe for happy hour some time.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Excellent date night. Real amazing and beautiful interior design and great atmosphere.", "author": "Mary N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Fantastic Service. Great Food. Even better drinks. Our bartender was super knowledgeable and friendly and recommended some amazing whiskey from their tremendous selection", "author": "Sean M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "I had an admittedly odd meal at The Saratoga. Not due to anything they did; I'd had a big lunch, was not super-hungry, and feeling a wee bit out of sorts, so did not want another big meal.\nI'd never had chartreuse, picked what looked like one of the milder drinks, with mint, pineapple, sprinkle of nutmeg. Less sweet than many liqueurs, more herbal. \nExplained to helpful waitress I was going to just get a couple of small plates. Started with chicken liver pate. I know this is not to everyone's taste but I liked it and Saratoga's version was good. Crusty bread spread with pate and apple butter, grating of endive and very fine threads of apple - can't imagine what kind of tool they use to get them? Nice contrast of tastes & textures. All three salad options looked good. With difficulty, decided on carrots. A very generous portion of warm roasted carrots with avocado (could have had a little more avocado), tons of seeds, yogurt. Really, the carrots and pate were a very satisfying meal. \nAsked helpful waitress if they had any herbal tea. They don't, but she said they could steep some fresh mint, something I frequently do at home with mint from my garden. Ordered the rolls to eat with the mint tea. I don't want to know how much butter is in that bread dough! Obviously with that much butter they tasted good, if unhealthy. Came with \"butter of the day\", I think with nutmeg. \nTried the ho-hos for dessert. That was the weak point. A nice concept, cute, generous portion but neither the cake nor the icing tasted especially chocolate-y. I liked the meringue. \nMight return for one of the other salads and an entree. This was post-ballet dinner and rest of season has dinners lined up, so next year.", "author": "Carol S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Great dinner and service! \nBest steak I had in a long time! Our waiter Alejandro was super and so professional! Just a pleasure all around! We are restaurant industry people and totally impressed from beginning of our our meal to the end! \nThe Italian waiter came by for a chat and also totally made our night. All around great and we are looking forward to coming back again soon. \nThank you!  \nKudos to the owners!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "My boyfriend and I came here for dinner prior to attending the Opera show Tarandot. I ordered the pork chops and my boyfriend had the rib eye steak. Let me just say.. the moment I took my first bite of the pork chop, I literally closed my eyes to take in all the goodness. It was perfectly made and full of yummy flavor. I know that sounds silly, but I'm being serious. Ha! Service was amazing.. and the atmosphere was idylic for a romantic night out, especially for a young couple in their 30's.", "author": "Tamara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-08", "description": "A cold characterless new establishment in one of the warmest and characterful neighborhoods in San Francisco.\n\nI stopped in to try things out as a neighbor and had two drinks, the Green Goblin and Bamboo. Both were fine but pretty standard. The bartender was very cold and only had the bare minimum interaction with me required, the bar was very quiet too. The biggest problem is their prices, $30 before tip for 2 drinks on a Tuesday night in the Tenderloin is just silly. They are doing a SF mandate surcharge of 4% which is one of the highest I have ever seen, plus being a new establishment they should just have built it into their already high prices.\n\n3 star quality at 5 star prices in my 1 star neighborhood.", "author": "Kurt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Such a fancy establishment.  I enjoyed a GIN highball drink and it was worth every penny.  Friendly bartenders too!", "author": "Cynthia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "While the cocktails were excellent and the food good, I can't recommend this place because it was like eating inside a rock concert!  The noise level in the upstairs dining room was off the charts - on a Wednesday night.  The people sitting next to us left because of the noise.   I might go back for a cocktail right at opening time, before the noise level takes off, but I won't try to eat there again.", "author": "Donna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "Great food and ambiance, good drinks. The Saratoga has a very extensive selection of cocktails and spirits, however they do come at quite a premium. And while the drinks look and sound attractive, in reality they are a little underwhelming. The real star of the evening, surprisingly enough, was the food, which was delicious and a bit more reasonably priced than the drinks. The rolls are a must-have, and between an order of those, a pair of apps (the fried chicken slider and toga tots), and a pair of lighter vegetable dishes (the tomato dip and kale salad), my partner and I were happily satisfied without feeling stuffed. While The Saratoga may seem more like a cocktail lounge from the photos, is the place to go for fantastic bar food, preferably after grabbing a few drinks elsewhere.", "author": "Cam O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Excellent! Huge whiskey selection! Great service. Beautiful place! The bourbon and rye selection is huge, they have a really nice Japanese whiskey selection!", "author": "Liz D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "this is a good place to come and try a new cocktail, but unfortunately none of us were partaking at brunch.  four of us shared the jenga tots, which were delicious.  tater tots w/ lox, cream cheese, capers, tomatoes and onions.  so yum.  i also got the avocado toast, which was topped w/ smoked trout, tomatoes and a poached egg.  also good but a bit steep at $14.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "The best food and drinks I've had in a very long time.  The restaurant is beautiful and classy.  The staff is super friendly and quick.  The drinks are strong and original.  The food is to die for.  This place is my new favorite place.  So, so, SO good.  I will definitely be back.", "author": "Ghazal S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-28", "description": "I vacillated between giving two to four stars and settled on two because I won't return to this restaurant.\nFive stars:  The hamburger!  Absolutely delicious!  One of the best burgers I have ever had  The service was great!\nTwo stars:  The french fries were ho hum, not very hot  or crisp when delivered to our table.\nOne star:  The pickled plate we returned since it was not actually pickled, but dressed.\nSo I will not return for two reasons: the inconsistency of the food, but primarily the uncomfortable atmosphere.  The volume of the music and the bass was accosting.  I am not sure if it is the building acoustics or the music volume or the combination of both, regardless, it makes dining very unenjoyable.   The waitress had to yell for us to hear her and we had to yell for her to hear us.  We had to yell at each other rather than converse at a normal volume.  By the time we left I was so relieved to be out of that restaurant!  Truly, the noise level was ear aching.", "author": "mi m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "Loving the Whiskey selection. haven't had food there yet, looking forward to going back to try it out.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Definitely a fan of the food and friendly, attentive service here. We were lucky to nab a little table and tried several items.  The chicken liver, toga tots, daily special beef tartare, and burger were all really really good. The hamachi crudo and prawns were also really good, too.  There wasn't anything I didn't like. And the scotch butterscotch pudding was amazing and so were the ho ho's.  Can you tell I like this place?", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-06", "description": "NOTE: The service was pretty impeccable. Great, attentive staff and great decor/interior. PLEASE MAKE FOOD TO MATCH THIS EXPERIENCE! I'm sure that will improve as this rather new location gets more feedback and more people let staff know that this needs to be upped if it's going to sustain it's reputation as a $$$ restaurant. I probably won't be coming back for a while. \n\nI'll go into detail about my experience: \n\nThe servers were amazing, very knowledgeable, kind, and attentive. They even fold your napkin when you get up to go to the restroom (service I've only experienced at places like Gary Danko.)\n\nThe dinner rolls were so dry, much too salty, and the butter had olives in it which was okay for me but not mentioned by the server or on the menu. My partner does not like olives and we wouldn't have ordered this considering that detail which was omitted on the menu. \n\nThe poached tomato, although way too much to eat for one or two people, was delicious. It was so rich though. This needs to be mentioned as a dish for about 4 people to share if they don't want to be terribly full by the time other dishes come out. It also comes with about 6 pieces of bread which were wayyyyy over buttered, maybe the butter should be served on the side??? People like different amounts of butter! \n\nThe warm carrot salad had a dreamy flavor, really delicious. BUT---the carrots were basically raw! I expected them to be charred or a little roasted at least. Some were too hard to eat delicately or even cut with a knife. Disappointing. :/ \n\nI did not have the burger, but my partner did. She only ate half. So you can determine what her feelings were on that. \n\nOver all, wonderful service that would keep me as a loyal customer, but please improve your food quality!", "author": "Cherish P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Excellent cocktails ( get the green goblin). Excellent food and service. They go the extra mile here.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Love the concept. 70% high end bar with excellent craft cocktails 30% Restaurant offering great food to go with your drinks. You can opt to come in for just a drink, a drink and snacks, or a drink and a full meal.", "author": "Gino M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "New place which overall delivered quite well. \n\n1. Atmosphere: really awesome vibe, high ceilings, inspiring and impressive liqour bar/wall, well dressed waiters and hosts. \n\n2. Drinks: solid cocktails, ordered a few and although not quite as good as some of the places I have been in SF they were good and I am hoping they can refine their craft a bit here in the future.\n\n3. Food: only had a few small things, including the burger which was ok. I generally enjoyed the burger but it was overly dressed, and the bun became a bit soggy and it was hard to really taste the meat, my suggestion here would be to put less dressing on it so the bun doesn't go soggy and the meat quality can stand out more, maybe it was a one off? Maybe they are still figuring this one out? Also tried some bread with truffle butter and it was great, and a lot of things on the menu look great so will definitely come back to try some other things. Oh and the bourbon pudding was incredible, but very spirit forward.\n\nRight now it is a 4* for me, but I can see them getting a solid five if the food gets better in the future. \n\nAlso, this area at night is still a bit sketchy but probably safe so just keep that in mind if you aren't familiar with the area or uncomfortable in sketchy areas.", "author": "Brent F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-03", "description": "Had higher expectations I guess as it was coming from Spruce. But let's be clear, this is not really much of a restaurant. It's more of a great bar with fun and playful bar food. \nUpstairs is incredibly loud, no place for conversation and tables are poorly placed. We had reservations over 3 weeks out  and were still seated by the door (blasts of cold and twice hit by overzealous door openers!)\nOur waitress was kind but she had three tables seated at the same time so she had difficulty keeping up (guess that is a hostess issue) Speaking of, the hostess was the only not-nice person. She simply shrugged off our concerns with table, service time, door issue, etc...,\nTrust me, we are not picky people, we just wanted a nice evening of food and drink with friends, but the little things add up. \nWe had to go get our own drinks at the separate bar downstairs because our drink order took over 15 minutes. \nThe food is tasty fun (tater tots: amazing, bagna calda bread dip: delicious , 5-spice sliders: yummy, all desserts: wickedly good (cracker jacks included a prize, as it should!) \nThe Cuban frank was lukewarm and burger was small. \nThe bar is THE THING!! it is amazing and they make my favorite drink (The Brooklyn) but did not have Belvedere vodka. \nOk, to really make my point regarding \"is it a restaurant or a bar with food?\": the menu is two pages food and 10 pages drinks \nWe ended the evening by heading downstairs and it was significantly more quiet and intimate. Still small and low ceiling but, trust me, ask for a table downstairs if you want to dine/drink/converse. \nI know it's New and still working the kinks out so will try it again...downstairs", "author": "Laura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "Amazing place, really flawless.  Best service I've ever had in my life. A little pricy but as always you get what you pay for.", "author": "Tyson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "I actually got to meet the red headed chef from this fine establishment during my Christmas holiday in San Francisco. Come to find out he is a West Texas boy. Question ... how did he bottle up that mole to SF? should be bottled!", "author": "Geneva H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "We were in SF for 5 days over Christmas and this was by far my favorite restaurants. We had a good sized group so we ordered one of each off the menu I order to get a taste of everything. Even my 3 and 7 year olds loved the chicken and French fries. The service was excellent. My personal favorites are the tots and the mussels, but, we didn't have anything that wasn't delicious!", "author": "Isabel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "I am not a big yelper primarily because I just don't have the time to post stuff, however I did want to give some love this this spot for my recent dining experience with my partner. I recently went in being lucky enough to have the night off and I have heard about the liquor selection here. The beauty of their bar setup, and we were surely not disappointed. Their menu size is aggressive, but nicely organized, and if you are a local lover of spirits, and whiskey this your spot! We started with some vino,  the mussels, then moved on to the kale salad which was on point! Our server Liz, was really great about pacing our order sizes, and was very welcoming and funny! I felt she was very attentive and personably. Our main course was the dry aged steak with the peppercorn sauce, with the shishito pepper side, and good lord sweet baby Jesus!!! I will go back just for that sauce in the steak!!! And surely not share it.... lol. Our server was kind enough to gift us some crackerjacks, which took me back to childhood. Overall a really great dining experience. Thank you for the great new memories.", "author": "Katrina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Finally a place with a cool vibe style chic and a great  ambiance. Kinda feel like home NYC. Great job!", "author": "Myriam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "Burger was delicious, service was a welcome reminder of the charm of old-school (a la NYC) restaurant/lounges, and the place was aesthetically pleasing.  I recommend for a group of friends who want to dress up a little and feel like an adult again.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "The appetizers were amazing. I had the rare beef tartar and my friend had the carrot plate (I can't recall the name) and it was all sooooooo delicious. The drinks are really good. I didn't get much help with trying to figure out what to try considering they have a million options to choose from so if you know what you like, this is the place to be at otherwise, go with the flow on drinks.", "author": "Olivia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "We waited patiently for this restaurant to open in our neighborhood, and it did not disappoint. We arrived early in the evening - only the second or third party there. Did not have reservations and were easily seated at the downstairs bar. The service was very attentive, even as the bar/dining room filled up. We ordered the Toga tots, chicken liver toast, warm carrot salad, and Saratoga burger. Everything was delicious and I wouldn't miss out on any of these items. We also had some very delicious cocktails, although I don't remember which ones now.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "Never go there. The treatment was spectacularly terrible. If I could give negative stars I would. We came from a charity event, dressed nicely and sober, and we ordered cocktails and the \"manager\" (probably a 20 year old kid that got slapped in high school) kindly notified us that we were too drunk and that we should pace ourselves with water... That never happened to me and I have been to many nicer and fancier places in the world... Hope they close soon!", "author": "Danilo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-18", "description": "Great burger. The food came out quickly. Service at the bar was below average - it took a lot of effort to get the bartender's attention.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "a really good meal! and just amazing service! im\nall about this place. went with a group of 6 and we all got different things and ate off of everyones plate. everything was amazing! the steak had an amazing peppercorn sauce that was to die for. definitely coming back because it was worth the money...", "author": "Didi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "The ambience is great! Toga tots and street corn are a+ but we didn't feel the mains were as good. Pork was solid but the mole fried chicken was completely cold in places and hot in others which makes me think it was reheated? I don't know but it was certainly the disappointment of the night. Staff are friendly and service is good. I would go back for a drink and light bite again but probably not a whole dinner.", "author": "Relle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Great food and drinks. Some of the wait staff need training - our waitress kept pouring our wines into the wrong glasses. Wouldnt have been an issue if 1-they weren't incredibly expensive wines or 2- she acknowledged the error in a way other than laughing and walking away.", "author": "Keenan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "The food was top notch the kale salad with persimmons was perfectly seasoned. and the chicken was tastier than a steak. The drinks are highly crafted cocktails and very enjoyable. A place to go if it's a special occasion and ready to be surprised by the food.", "author": "N A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Great atmosphere and fantastic attention to detail. Staff was extremely friendly and accommodating. Good cocktails and comprehensive liquor list. This isn't, however, a great place for dinner in my opinion. There are a handful each of snack, vegetable, and entree options (all served a la carte), which results in a rather expensive and incomplete meal. I ordered the burger for $15 and it's an additional $7-8 for fries or tots. There are many fantastic upscale burger restaurants in the neighborhood, all much cheaper than $22. e.g. Hopwater Distribution ($14), Alta CA ($17), Rusty's ($15), Nopa ($17)... I just wish the Saratoga was a little more on the competitive side, and perhaps had a better notion of whether it wants to be a restaurant or a bar.", "author": "Eric N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Stopped in here for pre-dinner drinks. Awesome vibes with strong artfully crafted drinks. Had the El Hacon mezcal drink. Will probably come back to try the pisco.", "author": "Sophie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "My wife and I have heard about this place opening- We were in the City for The Thanksgiving Weekend- and decided to try it- We are glad we did!!\n\nThe layout and decor was warm and envying- The GM Miko was attentive to everyone- Chef Sullivan came to our table to check on our food- speaking of the food, we tried 5 different appetizers and an entry- all were unique, well thought out and totally enjoyable- we tried a few specialty cocktails and enjoyed them- the wine list was extensive and obviously was done with a great deal of thought- \n\nNext time we are in the City, we will definitely go back- BTW, don't go without trying the apple turnovers- they are a must and neither of us are big dessert fans", "author": "Terry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Awesome experience at The Saratoga in San Francisco this evening. I love the music, the bar, the food, the decor! 1000 Larkin St. http://sf.eater.com/.../the-saratoga-san-francisco-restaurant...\nThey serve the comfort food you know and crave - re-invented with the sophistication you know is meant for your indulgence!  Try the Hamachi, the kale salad, the chicken sliders, and the Ho-Ho's for dessert.  Amazing, i\nncredible selection of spirits in the bar.  I think the staff is having as good a time as the guests.\nhttp://sf.eater.com/2016/11/10/13589910/the-saratoga-san-francisco-restaurant-tendernob", "author": "Martha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "This place is so cool! Impeccable drinks, incredibly cool vibe, great staff, and obviously a fantastic pedigree (see Spruce, etc). We will absolutely be back, probably several times.  The whiskey selection is insane and the food is delicious", "author": "Matt V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "great drinks, great food option, and great ambiance. people from all walk of life seem to gather here - and it's refreshing! def a fun, energetic place. great for dinner or just snacks / drinks.", "author": "Ruben K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Amazing tots, drinks and baby kale salad. The chicken sliders were also great. The hamachi was a bit on the sweet side and so tiny/ not mind blowing. Great service though. A reservation is a must!", "author": "Natalia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "This place was very interesting! Tasty ! Nice service but no fish as a main course  on the menu . \nThey have very nice hamachi appetizer and tomato spread !", "author": "Alia B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-29", "description": "Toga Tots- ok.   Burger- ok.   Fried apple hand pie- ok.  $28 for a glass of Cabernet- Really?", "author": "Fred X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Loved this bar and atmosphere there. Maybe its not a place for food but honestly I totally like it. Great place to hang out and relax. Stuff was friendly and welcoming.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "I really like this place. Our waiter was a bit awkward but the food, drinks and atmosphere overshadowed that. Wish they would offer more reservations as it's hard to walk in and grab a table (wait was an hour at 8:30pm on a Thursday night). The burger was awesome - highly recommend. Friend also really liked the kale salad. Hope they continue to be successful.", "author": "Robin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "Incredible atmosphere and food. Every part of our experience there was amazing. They also have one of the largest chartreuse collections, so you have to try some while you're there!", "author": "Alexandra T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "Super swanky new restaurant with an awesome atmosphere. I ordered \"The Walking Dead\" to start and it came out with a flaming chunk of pineapple on top! What a surprise. I split the pickled plate with my friend and had the Bagna Cauda-Poached Tomato for my main. it was delicious! Highly recommend checking this place out!", "author": "Nina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Delicious cocktails, one of the best burgers I've had in a very long time, and EXTREMELY friendly service. Nice ambiance too. Coming again ASAP", "author": "Kathryn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "I came here on a Friday night (3weeks ago) with no reservation  (not recommended). I called ahead and spoke to Dian the hostess she did inform me that they couldn't accommodate my party of 6 but that we could go to the bar area and receive full service. We went downstairs and Larissa the bartender got our cocktail order and quickly asked if their was anyway she could help. I told her my party of 6 situation and she LITERALLY MADE IT HAPPEN (Wow, thxx girl!).  Within 30 minutes she kept an eye on the lounge area and made sure my group was seated there. Once we squeezed into that area Alejandro was bomb.com. He was the best server. I highly recommend the steak, scallops, warm carrots, and honestly just everything!  My gin highball was impressively tasty. I can't wait to go back and bring more friends.", "author": "Debbie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "best i have ever had, do not come to count calories, this place can cook!  chicken slider app was insane, buffalo pork wings are off the hook, best best best!", "author": "Scott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Great Spot!  Sort of has the sophistication of Spruce with some of the energy of Park Tavern. I particularly like the contrasting vibes of upstairs and downstairs, where the upstairs feels like a busy brasserie and the downstairs feels more like a speak easy that serves great food. A really nice central staircase in the middle of the restaurant takes you between the two. \n\nThe menu is short but very good. Steak Au Poivre and fries downstairs at 1 am is an instant classic and produces that \"fuck, life is good\" feeling that you get from NY's Balthazar around the same hour. It's a damn good steak. \n\nThe restaurant has only been open a month so I'm sure it will get better.  A couple areas to work on---The bar staff doesn't quite have the polish with customers that Spruce's does, but they are also much busier, and Spruce is particularly good.  The drinks aren't as well made as Spruce's either but, again, they are much busier.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "Drinks were good, the food was fine. Still would rather sit at the bar at Spruce and have the tartare there.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Wow...we just found a heavens little \"niche\" worth gold. This restaurant/bar is upscale, stylish and fun. The bar downstairs was managed by two very knowledgeable bartenders...Jeffrey & Sam. Brandon & Sarah were a gem. The background music & dim lights made a dazzling evening. Patrons were well behaved - actually friendly perhaps due to the fun & exciting environment. Finally a place to please my loving Jen, and God knows how difficult this  is!!!   P.S: for whiskey connoisseurs...this is the place to come!!", "author": "Fernando B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-08", "description": "3 stars. 1 lost because the host (hostess was on a call) proceeded to tell me that the bar was full and that there was a waiting list for a \"cocktail table\". Which was fine, but he made no movement whatsoever to put us unto the \"list\" we had to ask him, while he starred at us awkwardly \"so can you put us in the list then?\" Anyway about 45mijs later we had little cocktail table. Waiter was very nice and the cocktails were great. I got the Cubano frank and my wife got the NY steak. We also got an order of the fries which were great as well. Just a heads up the cubano frank is a hot dog. The reason for the other star lost was my cubano frank was only warm, it wasn't hot. So it felt cheap. Overall taste was good and atmosphere cool. According to the guy at the table next to me though if you are just now trying to learn how to Skateboard you are a poser and a loser who works at Facebook. WTF? Oh and SF is training wheels for LA. Huh?!?", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-17", "description": "Ok, my review is going to be different than many of the others. I read the other reviews and was prepared to be really impressed, but was not. I was left utterly unimpressed. From the moment we walked in, I hated it. I was greeted with cheesy 90's R & B music in what looks like a bar. I had higher hopes as we made our way downstairs to the table, but same music and smaller room. In fact, there may be 15 tables total. We noticed as the night went on, this is the way to the bathroom. All throughout dinner, people were strolling by to get to the restroom - very poor planning as it seemed strange and as out of place as everything else. I was also unimpressed with our server, who seemed to fumble over her words and do strange things. For instance, left ¼ inch of coffee in a carafe, so left the entire carafe on the table (there was plenty of room left in the cup). The coffee was HORRIBLE. We ordered the parker house rolls, which were served room temperature (not warm) with some type of gray goop. I asked and learned it was \"olive butter.\" Flavor wasn't great, regular butter would have been a huge improvement. I had a salad, which was decent except for the bones of the leaves all over my plate. Next came the chicken liver appetizer, which came on bread - 3 total. The entire plate was covered in what I think was endive or radicchio leaves. Very strange to look at, like camouflage. I ordered the steak with peppercorn sauce. It was decent but nothing great. Tough meat in my opinion, but the sauce was tasty. Also ordered were The Cubano, which was a hot dog, with pork on top, and cheese, a lot of cheese. I would not order it again. Next were the sides - potato cocotte, and wine cooked mushrooms. The potatoes were NOT a cocotte, but were merely fingerling potatoes that looked like they were thrown on a cookie sheet and baked. They came with a ramekin that looked empty, but upon inspection had about 10 flakes of rock salt, which I used to cover everything I was eating. The mushrooms were beyond sweet (again, more rock salt to try to balance it) and were barely eaten. We skipped dessert altogether, and got our food packed up and left it on top of the nearest garbage can outside. I didn't want dinner to be a complete waste. I would definitely NOT go back.", "author": "Kath v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Food was fantastic and the service was spot on. I didn't get a chance to drink the many selections of scotch and bourbon they have. But, I plan to next time I'm there. The tater tots are a must. I also love they're fun style of desserts. Ho hos and Cracker Jacks, are you kidding?  Not only do they taste amazing, but, there are prizes in the Cracker Jack box. Every dish, except the poached tomato, was delicious.  The tomato was a little too acidic and the flavors of the tomato were too strong. But, the broth and toast were very tasty.  You must go to check out this place. Btw, I almost never write reviews. But, this one was worth it.  I only write reviews if I love a place or can't stand it.", "author": "David W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "The food is mediocre and relatively uninteresting, especially for the price. The best thing in the menu is the chicken sliders, everything else makes you nostalgic for your other favorite San Francisco restaurants. By far the worst thing about this place is the waiters, they're rude and unprofessional. Go there if you like to be manipulated.", "author": "Mohamad T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Wow. Just Wow. Went for a quick drink and stayed for a few and some yummy food! Beautiful new buildout, super friendly staff and the manager was great! Try the \"Walking Dead\" drink it comes on fire! The burger is to die for and the chicken slider was mouth watering juicy! #MyNewSpot", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Great addition to the neighborhood! Fantastic service, incredible drinks and really good food. Highly recommend.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "I went to Saratoga for my birthday with three friends to get a classy but fun dinner. We started at the bar to get drinks and had a few questions about the wine. The server was very helpful and offered us a tasting (incredibly generous). For dinner we received complementary garlic fries because of a slight delay in seating (which wasn't a problem because of the good bar area), which were very tasty and unique. We also got the chicken tenders and tater tots for appetizers. I will say that these dishes are incredibly unique--great balance of flavors and well presented. For dinner I got the flattened chicken and my friends got the burger. The flattened chicken had a light coat of herbs and spices and was cooked perfectly. The accompanying greens balanced the flavor of the chicken very well. The burgers were also delicious. The service was also great--the server checked on us multiple times and the chef came out to see how we enjoyed the meal. You can really appreciate the originality and creativity that went into the menu here. I will definitely be coming back.", "author": "Adam P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-20", "description": "Food was so-so. The flavors of the Spicy Pork Belly Buns were good but the dough was burnt on the bottom, hard on top, undercooked inside. The mushrooms were worse than anything you'd find at a strip mall deli -- simply raw button mushrooms in red wine. The steak ($32) was a nice piece of beef that was drowned in one of the saddest pepper sauces I've ever had. Not all the much pepper and it had a very strange texture/mouthfeel -- it managed to have both a greasy feel and taste like it had some sort of thickener like flour or hydrolyzed protein. The service was up and down, mostly down. There was a mix up with the reservation for our party of five but they did their best to accommodate us. Our wine choice took three tries to get right. The server blamed the noise level (i.e. he couldn't hear what I ordered), which was in the low 90 dBls according to my iPhone app. The first bottle of Kistler Chardonnay ($95) was properly chilled (maybe too chilled) the second was warm. The ambiance is OK, but this is much more a lounge than a restaurant. It is certainly not worth the $$$ for the quality of the food.", "author": "Tom M."}
