{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "\"I own the bar.\"\n\nWent to the Stud for Pride...bought tickets in advance and everything.  Standing in line for the coat check (awesome coat checker!) a woman walked up beside me, didn't acknowledge me, didn't make eye contact, didn't say anything, just slowly inched past me.  When she finally was fully past me I said, \"uh, I'm in line.\"  She turned to me and said, \"I own the bar.\"  Now, I know the Stud is owned by a collective, so perhaps she's part of the collective.  But if you joined a collective so that you could tell your patrons \"I own the bar\" rather than \"I'm glad you're here\" then maybe the collective needs to re-evaluate its priorities.\n\nNot \"Happy Pride\"...not \"thanks for coming\"......not \"excuse me\"...not \"I work here and I'm not heading to the coat check I'm just trying to get to the office\"...just \"I own the bar.\"\n\nAs some of the other reviews have noted, the Stud is an SF institution.  I've been there many times.  I want the Stud to be around for many years.  And, honestly, everyone else was great...from the enthusiastic, kind coat checker, to the bartenders who jumped to offer me a drink even though the bar a really busy, to the staff collecting the remaining drinks at 2 am.  They were all professional and positive and it was great to see that kind of spirit in the place.  So, the 4 stars are for them...and it could've been 5...but I really had to resist making it 1.\n\nI left with a bad feeling because of that one person who felt they needed to assert their importance in order to feel good about themselves.  Don't know when I'll be back.\n\n\"I own the bar.\"  Well, good luck with that.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-19", "description": "It makes sense why this place has repeatedly faced closure. My last two experiences here have been exceedingly meh - which is a genuine shame, because queer & weird space in San Francisco is increasingly rare and special.\n\nIt comes down to an attitude problem, which - as someone who works in nightlife - is all too common among staff at places struggling to pay their rent. Ordered a couple cocktails the other night from the one bartender on staff and asked what was going on, since the bar was eerily quiet. This person was hella dismissive and obviously irritated to serve me.\n\nMy other experiences have been fine enough - I've never stumbled into an event I've needed to see or stick around for. It's a bit too off the beaten path for me to make a trip just for the hell of it. I live in Sunset and often make SoMa pilgrimages - but I do so to venues that spend half a minute trying to connect with me and make me want to return. I haven't had enough experience at STUD to say this, but I get the faint impression that this is one of those sacred queer spaces, where everyone is so politicized and potentially pissed at everything around them. It's bad that the vibe rubs off.\n\nOh, good cocktails though. Love all the sparkles on the walls. Also enjoy the moody, colorful lighting, the temperamental ATM, and the retro arcade games.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "I recognize that The Stud is an institution in SF. \nI respect the history of queer progressiveness and inclusion that The Stud has offered throughout its lifetime in SoMa.\nWith this said, I do not recommend this bar to anyone else. Ever.\nHere's why: I paid a $10 entry fee to get in. The gatekeeper was kind enough to take my money and let me in to buy a few drinks and dance around.\n The gatekeeper I met had not stamped me as a paid patron.\nOne hour later, I chose to exit for a cigarette. A new gatekeeper was manning the door; the gatekeeper who had greeted me to begin with was replaced by a new, unfamiliar face. \nThis new, unfamiliar gatekeeper chose to hold me up and treat me as a suspect. This new gatekeeper thought I had not paid my entry fee. \n\nThis bar does not treat their part time workers seriously. The Stud has a serious miscommunication issue. The gatekeeper who took my money did not stamp me as a paid costumer. \n\nI It was this miscommunication that inspired this 1-star review.\nThe replacement gatekeeper held me up and treated me like a common criminal. This new gatekeeper did not know I was a paying customer, and treated me as such, as if I were a con-man. \nI am not a con-man.\n\nI paid to get in, and this new gatekeeper was not privy to that fact.\nSo, without this information, they treated me like a common criminal. \nThey bullied me. They demanded I pay the $10 entry I had already paid. I refused. \nI was only let back in because of one of the gatekeepers' generosity.\n\nThis miscommunication and unprofessional behavior has caused me to embargo this bar completely. \nTHIS BAR IS NOT PROFESSIONALLY MANAGED.", "author": "Jared A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "I drank too much at The Stud and the ladies here really took care of me. Got me into a safe space where I wouldn't be disturbed and allowed me to sober up in privacy. They checked on me frequently to ensure I was okay; I felt very much supported. I would definitely recommend the place for the care of the staff but also, drinks and food were pretty good.", "author": "Boravy N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "Stood in line while the doorman made us wait for 20 minutes. We got in and the club was empty. Total snooze....don't waste your money.", "author": "Robbert Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Super gay dive bar where you can relax after a long day, dance, cruise, play pool or meet someone new. It's not fancy but it's VERY glamorous and sassy. They often times have live music or events here, but this bar is so much like home, a little less pressure than some of the leather bars around.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-06", "description": "I have to detract two whole stars because of the terrible bar service and rude attitude of the employees. One bartendress actually grabbed my friend by the wrist after serving him a watered down cocktail. She refused to let go until he gave her a tip. What in the what is that? Terrible.\n\nStill, the vibe is really creepy and cool. I like that this is unlike many gay bars where you can expect an uppitty clientele. Instead, you get the characters who are really out there and don't care what other people think about them. Very refreshing. \n\nThe creepy nature of the performers is awesome, unique and totally fun. I really enjoy the people watching, the variety of music, and the dark atmosphere of this place. It's not the run-of-the-mill scene so it's totally fun. There is a decent drink selection and drinks are fairly priced. \n\nThe Stud has a good location, lots of personality and really fun shows and DJs. I would come back to this spot just because of the sheer weirdness of the goings on.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-29", "description": "Smelled really gross when you walked in. Like a mixture of mold of urine. We had to walk out as the smell was nauseating!!!!!!!", "author": "des m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "This is an ok place, but after 2am, $4 for a coke is ridiculous.   Would be a decent place to sober up I'd not for the exorbitant prices on non alcoholic drinks.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Had a magnificent time enjoying my night at The Stud for \"Black Friday\". I had the best seat in the house - front row center of the loge and sat with one of the consortium owners of the club, Nate Albee up there in our special perch The show was hosted and emceed by consortium owner Honey Mahogany. The variety show featured comedy, lip sync, live singing, stripping/burlesque, gender bending and even a Michael Jackson impersonator (who offered candy to this boy child). The club has cabaret and late night permits so they have dancing to 4 A.M. with the booze stop being sold at the mandatory 2 A.M.. A great congenial place to enjoy yourself - alone and with others. I inadvertently left my cell phone at home so I could not live broadcast and glad I did so my eyes were having a great people show. I will come back again for this monthly special night show.", "author": "Tamara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "CASH ONLY, remember that.  It was gritty and fun.  Try the smoky margarita, very tasty.  We had so much fun.  The dive décor is delightful and the entertainment is definitely worth the price of admission.  Don't miss it", "author": "Grace G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "STÜD is a very elite Swedish craft beer bar in SF specializing in barrel-aged Quadruplebocks ales.", "author": "Alexander K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "$10 cover (whatever, welcome to San Francisco). But I have to say we had a blast- very eclectic crowd. Music was all 70s-& throwback. Wasn't too crowded, either.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "Don't judge, but I kind of dig The Stud.  Where else can you go see trashy-trannys mingle with semi-straight males dressed up in bunny suits while dancing on a stage?  The Castro perhaps, but we're in the middle of SOMA.  The Stud rocks and it rocks hard.\n\nBe sure to check out one of their themed nights to make sure you're going for the crowd you're in to.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "My leather jacket was stolen from there last night & they were less then helpful...it's black with a stripped lining...reward if returned no questions asked 619-675-5421", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "Great place... one of the few places if not the only place that still captures what sanfrancisco was like .. lots of fun and kook in people and don't forget drag... good mixed crowd with friendly people music on the night I went was eighties alternative which took me back to my youth but it was great to see younger people enjoying it as well... great place to take a mom or dad.", "author": "Tyrone I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Second, maybe third, best bar in the city.  It has a sorta punk vibe. My only wish is that it was a little more punk, but whatever.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-27", "description": "I had THE best time here on Pride weekend. \n\nThe pool table was covered up and turned into a makeshift jewelry assembly table, covered in beads, which we then all exchanged as friendship bracelets. \n\nDrinking + jewelry making = awesome.\n\nThe bartenders here are the fvcking shieet. Super funny and patient with my girl and I - when we couldn't decide on a drink, our bartender whipped up a peach-vodka concoction of deliciousness that kept us coming back to the bar the rest of the night. I got a kick out of the Miss Pac Man game and the red curtained off mini VIP booths. This bar has so much personality, I think I walked out with a little extra sass in my step.\n\nThere is a large room in the back with a stage where we cheered on all the amazing drag performers. \n\nWERK bitches.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "This place & I are FAMILY. \n\nI have lived in SF for 12 years now, and this place is one of 3 places I went to way back when I got here, and is STILL around. In a city where the new pushes much of the old aside, its nice to see a bar with timeless reputation stand the tide.\n\nI love the bar staff. All of them. The new bar back is cocky & handsome, so we'll let him stay, but he better watch it. Kristo & Bernie I heart you. Michael you better take care of these bitches. Coat check & door staff are always on it & need a tip from EVERYONE.\n\nThe bar decor is awesome. Marrakech meets Warhol at a SF antique roadshow. The booths are intimate and perfect for small groups. Shows are perfectly presented and each promoter shapes the experience here. Cabaret or discotheque, both mesh well. Home to some of the best drag review The City has to offer: SOMETHING, MeowMix & CHEAP...and if you can believe it, the birth place for Heklina's Trannyshack. THAT was the day...\n\nHomobiles picks up from here... so get home safe!", "author": "Kai N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "Some good friends have been inviting me to go the Stud with them for months now and things finally worked out last night so I could join them for the Some Thing show! The Stud is on a well-lit corner on ninth street right near the 101 onramp, so it's super easy to get to. There was plenty of street parking all over the place. The inside of the club is long and skinny with a bar along the length of the place, a pool table in the front half, and a dance floor and stage in the back half. Once the place starts filling up, it can get a little hectic to move around, but the crowd is super friendly and makes room.\n\nThe Some Thing show I watched was amazing and I'm kicking myself for not going before. It's a drag show with a mix of male and female performers either lip syncing or singing live to a variety of music styles. The first half of the evening was more ballads and older tunes while the second half of the evening kicked it up with more pumping tunes. ALL of the performers were fantastic and put on a great show!\n\nI'd definitely come back here again and I'm only knocking it down a star for the pee party trough in the mens bathroom which I'm not a fan of in any bar.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Catch the Meow Mix variety show for some seriously avant garde, fun drag! These entertainers are the real deal!", "author": "Joey Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "I have no words to describe or prepare you for the experience other than, \"Dude. Wednesday night karaoke.\"", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Every second Saturday of the month I attend Frolic, the furry event here. We PACK this place out! Super fun, and great costumes to look at.\n\nThe inside of this venue is very oddly shaped, but they DO let us use backstage as a changing room for fursuiters, and provide us with water jugs/cups which is nice.\n\nJust don't go into the alleyway unless you want to learn first hand what \"yiff\" means.", "author": "Veggie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-12", "description": "10 Nov 2013, 08:45p\n\nWe were in SF for Bear Pride weekend and Massive was taking place at the Stud.  This was my first visit ever and the bar was a pretty good-sized space.  Cover for the event was $5, which was reasonable and the bar was not totally packed when we arrived, which was good.\n\nThe one thing that turned me off was the fact that I ordered a vodka tonic and a club soda and was told it was $7, \"for now\".  Apparently the prices go up at 9p, which wasn't a problem.  I dropped a $10 and got $1 back in change.  Huh?  The last time I checked, 10-7 = 3, not 1.  I'm not sure if this is a common practice in SF bars, but they don't do this at the Lone Star or 440 or Midnight Sun or any other bar that I've been to, except the SF Eagle.  Not sure if the bartender was trying to pull a fast one or not, but that's all I ordered that night.\n\nI'd come back here just to see if this is a common practice because the space is nice and we were hanging with a bunch of friends.  Lone Star, 440 and Midnight Sun are still my preferred watering holes in SF.", "author": "SoCal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "Had a great time at the stud. Came on a whim on Thursday afternoon and was rewarded with karaoke!!! They probably wanted to kick me out but I don't care I'm the karaoke king lol! The bartender was nice and the DJ was great (love ya flora!!). I will definitely be coming back here on Thursdays!", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "Fun little bar! Came here for a Peaches Christ after party. I love the atmosphere, the private booths, very cool music. Cramped when it gets packed but it's good. The drinks were expensive and cash-only, however, and it sucked that the ATM was busted when we were there so we had to walk across the street to find cash at the gas station. (Not a super-great neighborhood at that hour, and we were a little tipsy and trying to cross a wide street of traffic)... they really need to upgrade and let people open tabs, we would've spent a lot more money. However, drinks were higher than I expected. This place seems to host a lot of fun events though, and they had a coat check which was nice that I didn't have to lug my stuff around everywhere.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "I drunkenly lost my passport at The Stud when I was there for Dark Room, and when I eventually figured out what happened, the staff could not have been more helpful and wonderful. It turns out they had it, and had been trying to reach me. When I went to get it the bartender, doorman and man who I think may be an owner/ manager were all sweet, charming and helpful. As a straight Irish girl who frequent's gay clubs/bars for fun, and is involved somewhat in the Drag Community in SF, I can say that it's not all that common to experience this level of service at a mostly male gay spot( this is not a criticism of other places, merely a personal experience based observation). \nI really appreciate your  true class, high level of communication, friendliness and stiff drinks Stud, keep up the good work!:)", "author": "Aoife D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "Congrats on having the weakest drinks in San Francisco coupled with the rudest bartenders I've ever dealt with. Three times that bastard served someone who walked up to the bar while I was next in line at the well. To top it off. $12 Long Island that was LESS THAN HALF alcohol. Screw this place, never coming back.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "The best queer cave in S.F.\n\nFun Events, Cool Crowd, and Minimal Attitude\n\nGreat Guys, Gals, In-Betweens, LadyBoys, and BoyFags alike\n\nBe sure to go to SOMETHING on Fridays!!", "author": "Benjamin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "I come here once a month with a group of friends and it is always a pleasure! The decor is a bit 'divebar' but that only adds to its charm for me. They often have special discounts on drinks, and the prices aren't bad as a whole. Everytime we attend an event a hotdog vendor parks himself right outside the front door. Booze and hotdogs? Yes please!", "author": "Hayden k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Fun for the family\nThe Dominatrix was nice\nMaybe not grandma...", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-24", "description": "I used to pass this bar all the time when driving into the city, and wondered what it looked like inside. Like Hole In The Wall, it was apart of my \"I'm going to visit every gay bar in the city, including the scary leather ones\" conquest.\n\nSo when Josh asked me to GoGo dance for their 90's night (now every Monday night--GO DAMMIT), I, of course, accepted. Gay bar or not, I like attention. \n\nI arrived at around 8pm on accident, and went inside to change into my outfit. Doing my makeup in the back, I put on massive amounts of blue eyeshadow and made up for lack of bright red lipstick for the maroon/purpleish eyeshadow with some lipgloss. Then I ratted my hair and for a moment I thought I was a tranny. Which would have been awesome, but I wasn't good looking enough. Plus that whole \"lack of an adam's apple\" thing, but who knows. When I went outside to have a smoke, I could tell there were a couple of people just *ITCHING* to ask how much I was. \n\n(500/half hour, I ain't cheap asshole)\n\nUnfortunately, I was tired as hell (long weekend) and kept yawning and falling off the bar stool (completely sober, how classy), talking to the most wonderful Joe C., who came out to support my dancing addiction and ended up having to listen to me bitch and moan about random things, and having learned that he was in a band in Seattle. Ladies, he's single. (Can I stop digging that hole from earlier now? kthx)\n\nANYWAYS, the bar is super snug and cozy, and there are things to dance on with a huge ass mirror you can stare at yourself doing the psuedo nasty with whomever your dancing with, etc etc. The bartender is really sweet, and there was a tranny with better looking shoes than me. I was TOTALLY jealous of her, especially since she could put on fake eyelashes better than me...and do her makeup better...and those fishnets were awesome...and she had amazing legs...\n\nUm, what was I talking about?", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-15", "description": "This review will be based on the one night of the month I attend The Stud.\n\nAny place is a wonderful place with friends, though being in a bar with great music and tasty drinks just makes it that much better!\n\nUpon entering The Stud, I was asked for a Cover.  I was aware of it, and the price seemed fair, so no complaints there.  The door-keep was even nice enough to allow me in and out of the club no problems!  (I wasn't that difficult to recognize, believe-you-me...)  The music of the night was very well mixed!  I'm not much of a dancer myself, but watching others made my night complete.\n\nThe Stud is not as large as I thought it was going to be.  It was surprising, to be honest.  Still, with 50 people wandering the bar, it still did take a little work to get from one side to the other...especially with all those paws grabbing at one's tail!  Hey...I'm not complaining...I'm a laid back kinda dawg. ^^  It's certainly an ice-breaker, eh?  The bar went along nearly the entire length of the bar, leaving the rest of the bar like a giant hallway to wander about.  I am curious on coming to The Stud on a non-event night to see how the space is used.\n\nIf I have one complaint, it is the drinks are a little pricy, but I suppose I should expect that being in the \"Big City\"!  The drinks were strong, so after a couple, I was quite the happy pup.\n\nI do plan on returning monthly if possible, and maybe in between if something catches my fancy!  The staff was friendly, the place was kept up decently, and it just worked out well for what our group's purpose was.", "author": "Tk C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "\"I can't see you cuz I have bangzzz\" *fluffs bangs and rearranges package* \n\nHad a freakin' blast here late one Friday night. It was hot and steamy. Kind of raunchy, but I liked it. The host(ess) had a great sense of humor and reminded me a lot of Andy Dick. I'll definitely be back. I recommend taking friends, cash($7 cover at the door), going on a Friday or Saturday night around 11, 11:30, and staying til close!\n\nAll in all a great first time experience, I left here wanting to be a cute gay boy in my next life.", "author": "Leigh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-06", "description": "My friend and I were trying to find a different club when we stumbled upon Stud.  Being 2 straight females, we were curious about it and inquired to the door man about what was going on.  He told us it was 'big bear night' and we decided to check it out (having no idea what that meant).  As we entered, we were greeted by tons of men...big men....big, hairy men to be exact.  99% of the guys here had just their tighty whities on and were big hairy guys!  It was great!  My friend and I were cracking up and although it was pretty funny, it looked like everyone was having a great time.\n\nWe started chatting up the bartender and he gave us free shots!  Yes!  Then we were approached by one of the guys in the club.  He told us we were totally cool for coming in and having an open mind...then he took us up on stage!  We danced up on stage to Kelly clarkston and remixed snow patrol songs and had a blast!  We didn't even go to whatever club we planned on going to because we stayed at STUD all night!  It was a blast!", "author": "Allyson R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-24", "description": "$5.50 for a vodka tonic is a bit much. But $5.50 for two vodka tonics is full of win. Go here for the 2-for-1 well drinks from 9pm to midnight, if nothing else. \n\nAlso, Charlie the bartender rules. Just sayin.", "author": "Natalye R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-04", "description": "Gross gay bar.  Smells like a urinal, scary part of town, no way!!!", "author": "Jon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-04", "description": "Really again with the cover charge!! Really there was no one in The place!! Sorry gays respect yourself more and don't put up with this!! You can go to the Castro and get twice the club for no cover or next to no cover.", "author": "Jason E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-11", "description": "A very cool gay bar where everyone is having fun.  Great for people watching.  Awesome staff, met the owner before and he is really cool.  Good drink prices.  Wide selection of beer and alcohol.  Bathrooms are usually nasty and that is the reason they get four stars and not five in my book.  \n\nMy favorite night is Tuesday when they have Trannyshack.  At midnight every Tuesday they have the drag show and it is always cutting edge and/or funny.  Great adult humor.\n\nThe Stud is a San Francisco treasure.  The Stud used to be at a different location but it has been at this location for quite awhile now.  No matter who you are you should go at least once.  The Stud is always 21+ with I.D.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-18", "description": "The place is pretty cool even if sketchy. The trouble with the old lady bartender, I think her is Bernie is that she is too friendly with her pal Tina. \nGet better bar staff and I\"ll be back.\nToo many other fun places to spend my money in this town.", "author": "paul i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "\"Something\" on Friday nights at the stud is a most delicious slice of queerness. You won't find drag art performances like this elsewhere friends. Something special is happening there.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "Charlie the bartender is a dear. Informative, wise, and never pedantic. It's a rare compendium of traits! Fabulous décor - a little bit of deco meets pop art meets that greasy kind of \"right off the Hwy 80 offramp\" aesthetic. A broken ATM last time I was there. But always a decent show, and always a drink.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-14", "description": "Hmm...where to start. I think I'd just say this place is just not for me. As a visitor to SF I've noticed the colourful array of people that make up this fine city, but if you wanted to witness the full spectrum go to this place. I went on a Friday night, when there was some kind of cabaret. To put it mildly, the $8 cover was a piss take only to watch a terrible drag queen (looked the part) mime completely out of synch after they played the birdie song - yes, the birdie song - in the intermission. I'd sum it up as woefully tragic, but guess if you like bizarre entertainment and to be surrounded by 'clowns' (literally walked past coco the clown in full make up), then worth a try. Just don't expect quality entertainment.", "author": "James G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-12", "description": "Ok, so im from the city that sobriety forgot, the big easy, New Orleans! I can handle my liquor very well... Not at this bar! I have never been refused service in all of my life after paying a 5$ cover, only to not be able to get a drink at a pretty dead bar... Back home that is unheard of! If I was sober enough to remember all of this to the exact detail of the beer pong game that was happening on the pool table (real responsible bartender there!) and even telling the ron jeremy bartender in a very polite, (as i am not a rude person, nor over dramatic) how i felt about the carelessness of bere pong as compared to a bourbon and coke... just saying Im beginning to wonder if the Gays in this city have any clue how to throw down with decadence!", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "we went for Dark Room. it was really fun. drinks were delicious and service was friendly. great entertainment!", "author": "VALERIE Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-20", "description": "Thank You Stud!\nThank you for hosting \"Baby-Brian\" Murphy's Memorial on May 20, 2012 and allowing to us to take it over with tears & memories...Thank you for all of the years of tranny Shack & thank you for letting us all be \"Retarded Whores\" at Jesus way back when before it was so cool to bleed in public! ;) Thank you! We love you!", "author": "taj w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "I got to go for my first time on my recent birthday.  I had a terrific time.  They were having a Belly Dance Extravaganza that evening with very famous Tribel Belly Dancers.  My friends and I got close to the stage and took fabu photos.  Drinks good!  Staff great!  Seats comfortable.  Extertainment awesome!  It was the perfect end to a great birthday!", "author": "Norah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-31", "description": "I have no negative things to say about the actual business. The cover on a Friday night was $10 which, for someone who is from NYC, is actually pretty good. There were lots of wonderful drag performances to fill this little straight girls hearts desire for men in makeup between RuPaul seasons. The only thing that bothered me (and unfortunately it bothered me so much that it drove me to write this review) was the bitter lesbian serving drinks in the back theater, Bernie. When I approached the \"drink station,\" which in most other states is the area where servers stop at the bar to order, she asked me to step out of the way of it. So I did.. Thinking it was because a server was going to be picking up drinks there soon. But, being a smart cookie, I quickly discovered it was just the space to order drinks at the bar. California is weird like that. Apparently you don't just order from anywhere along the bar, there are designated spaces for that. Anyway, soon after- a nice gay gentleman asked me what she said just as she was yelling at me again about standing in the way, and offered to order me the drink I wanted with his order. All I wanted was a fucking bottle of water. Of which, regardless of the cost, I would have tipped for. So fuck that angry dyke. She never stopped to ask me of I wanted to order anything. She just kept yelling about how I was in the way. It's enough of a reason to keep me from ever going back there again. It's a simple case of being present and reflecting the kind of respect you would ask of anyone else in return.", "author": "Hallie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "love me some stud!   best gay dive bar experience in the city", "author": "Cory B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "This bar has been one of my favorite venues since I first walked into it *ahem* years ago. The inside is decorated what I refer to as fabulous Victorian Dive Saloon. I particularly enjoy how the bar is split between the dance floor area and a separate area for sitting and drinking and playing pool. The staff is helpful and friendly, the drinks tasty and reasonable, and it's close to a few MUNI lines and walking distance to other SOMA clubs on 11th St and on 8th and Folsom. I go to a couple of nights here, and even throw one occasionally. Meow Mix show on Tuesdays, there has been karaoke after the comedy on Wednesdays, gothy night Dancing Ghosts once a month, and Cognitive Dissonance on 4th Sundays. And those are just the irregular nights.", "author": "Miss Kae O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-29", "description": "The Stud is really fun. The drinks are good, and all the guys are cute but you don't have to worry about them bothering you because they are all bothering each other.\n\nThere is no women's bathroom here. Charming! Use the men's. It has photos of naked men in it.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Pass by this place all the time. Thought I'd have a visit inside for once!! Loved it. Everyone was so friendly. I'm not the party type normally but I really enjoyed this little place.", "author": "Eslie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-23", "description": "Every time I enter The Stud I feel a welcome claustrophobia. It's tight and smelly, yet somehow it seems natural that I, an ass munching perv, should be in there.\n\nI used to be a semi-regular visitor for Trannyshack. Alas, those days are over now that I'm OLD (like over 21 OLD! HOLY SHIT! SHOOT ME NOW!!) and will soon be euthanized. But I returned this Saturday for Hot Mess post-DYGay, and it was like hooking up with a good friend from ages ago, and not in that awkward Let's-See-If-You-Still-Suck-In-Bed-Yup-You-Do way.\n\nGreat bartenders, $6 Jaeger Bombs, go-go dancers, friendly door staff, and some extremely HOT boys. Plus, every 2nd and 4th Friday at The Stud is \"Planet Big,\" a night for large men and their admirers. Which is a FUCKING AWESOME development if you ask me because BELIEVE IT OR NOT I hate the body fascism of the community too.\n\nNow LET ME SAY that as a tiny gaysian who slips through floor cracks and can't ride the goddamn roller-coaster, I've been called a lot of heinous, offensive, nasty shit before: invective the likes of which I can't transcribe in this review. That's why it really doesn't upset me when folks call me a fudgepacker or send me PMs cursing me with syphilis -- I've been called FAR WORSE in my life, and you'll seriously need to do a LOT BETTER if you want to offend me. \n\nSo, bitch, when you and your clone dick muncher friends with the monosyllabic vocabularies and buzz cuts and tasteless everything and all the personality of a fucking aborted homunculi fetus were throwing me shade and talking shit about the fact that I looked like a Japo KAREN FUCKING CARPENTER in black leggings and an eye patch, it really didn't upset me at all, it simply made me lament your sad fucking life of aping your oppressors.  Also, I want to crack you in the balls. And by \"I,\" I mean Robert P.\n\np.s., On a related note, my Anger Management Counselor says I'm making progress.", "author": "d s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-14", "description": "A great place to bring your homophobic boyfriend if you want a good laugh and you want to watch him cover his ass with the wall all night.\n\nThen dance with all the cute gay boys by yourself and only talk to boyfriend in order to get drinks, since he's probably the only male in the joint that will be dumb enough to fork over some cash for potential puntang later.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "Back in the day - yes back in the real 1990s (I've been legal drinking age for a long, long time . . .) I was brought to The Stud with my then fiance (she dumped me not long thereafter - her loss) and a couple of our mutual friends . . . let's just say, having been there then, I sympathize with Chrstina S.'s homophobic boyfriend.  Indeed - you didn't need to be a homophobe to want to keep your ass to the wall at all times . . . I've been scared of the place ever since . . . flash forward 15 years . . .\n\nJune 23, 2008, Monday at the Stud for 90s night . . . the beers are $4, the music consists entirely of songs I know, the light fixtures are amazing, the vinyl covered bed is disturbing, the bathrooms were safe, the crowd was light and entirely fabulous and fun, Jaime L. and I yacked on and on about this and that for ages (I now know things, and no, I am not telling, so don't even ask).  Good times were had by all.\n\nIn sum:  Tonight I overcame my fear of The Stud.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-12", "description": "Ok, so many of you might have read my review of the Stud before and thought, \"Man...this guy really hates this place.\" And I did. I honestly did. But my friend has a thing for the younger homos, and he likes going here. And so I go with him.\n\nSince my initial review, I've seen a significant change in the place. It's so much nicer, and the staff has their stuff together. \n\nThe DJ has some great music list, from Top 40's to awesome mash-ups. You can find some amazing stuff on here that you start out thinking, \"What the fuck?\" and end up saying \"Hell yeah!\"\n\nMy other favorite is that you don't want more than a minute for a drink. I wish to pay a big tribute to this to my favorite bartender, Lu. This woman rocks. Like, \"Holy f-ing shit and what the hell wow!\" kinda rocks. She was on top of my orders at all times, she was sweet and friendly. Even when there was a big ol group of gay boys thirsty for liquor, she held her cool, poured them drinks, and did it all without breaking a sweat. WOW! Plus, her drinks are actually something that you can sip on and enjoy, rather than other bartenders I know that you have to choke them down because they are so strong or mixed so badly. She knows what she's doing, she does it fast, and she does it with a smile. That's my kind of lady!\n\nDefinitely check this place out on a Saturday night. It doesn't start going until about 11:30, so if you're not big on crowds I'd recommend heading here around 10:45. Because once the flow of people start, it does not stop.", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-21", "description": "This was a far cry from the Trannyshack venue of yesteryear. Sure - it was the Saturday before Xmas. But, they charged us a cover and we got inside and all we saw were go-go dancers. The sign said $2 for college students - not \"$2 off\" or \"$2 discount\". They were super rude when I pointed it out saying \"what are they teaching you in college. I mean the place was dead!!!!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Great gay hang out in SF, pretty hard core crowd..no I am not gay..just have lots of gay friends who find this place amusing.", "author": "Wendy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-10", "description": "Tuesday night's are Trannyshack!\nI know this because I have a friend going through the change (and I AIN'T talkin' menopause honey) and I've gone out here with her to support in the past.\nIf you're thinking that you aren't going to be hit on here single ladies you would be wrong.\nI got hit on!\nBy a bisexual dude and his lesbian friend.\nThey wanted to make a Jill sammich.\nI wasn't really in the mood for a sammich since I was kinda opposed to the bread.\nSo I played duck and dodge all night with the odd couple and tried to focus on the entertainment.\nI'd advise you to do the same.  Unless you're in the mood for sammiches.  Then you're ALL good!", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "I'm not really sure if I should rate The Stud or not since I was in a \"mood\" of some sort while I was there.  I would give it three, but I'm compensating for my mood.  I went here last night (Saturday) for Hot Mess.\n\nThe decor is a little to be desired, but it was interesting to look at all the randomness decorating the walls: picture of Jesus, toki dolls, and other odd stuff.  \n\nThe place was completely packed, to the point where I was getting pissed off because people wouldn't get out of my way, but reflecting on that, they really couldn't move either.\n\nThe DJ was hit-and-miss for me.  I loved most of the music, but when he randomly he mixed in 80s hits I was saddened.  I wasn't really digging the crowd, but I can see people who would like it.  The guy I thought was the most attractive was the bartender.  Yum...\n\nThe bathroom is to be avoided at all costs.  It's completely disgusting.  A curtain divides the toilet from the sink, and the urinal is a trough.  The door to the bathroom is small saloon swing style.\n\nThe dancers were alright.  I wasn't necessarily digging them, but again some people would.  They did look better than the ones at Hunters in San Jose.  One of the dancers thought he was hot shit, but he definitely wasn't.  He actually was semi-slutty--if that's even possible.  \n\nBy all means, this wasn't my favorite bar, but I feel I'd have more fun when I go back in better spirits.  I'll definitely hit it up to see the bartender again.  \n\nThe parking was painless, so don't worry about that.  Just make sure you want to spend some time here since it is a $5 cover.\n\nUpdate:  I've started going here more on Saturdays.  I suppose the main reason is my friend's have decided this is the new de facto place for Saturday late nights, but I'm okay with that since I've been getting to know the bar tender.  :-)", "author": "Brent A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-26", "description": "Where else would a straight girl go clubbing at while out with a group of estrogen-driven gay boys? My bitches are the bomb! And so was SUGAR at The Stud.\n\nAhhh, I MISS SUGAR! I haven't been there since SUGAR, those were the days where you could shake it to really good underground house music (think Ellen Ferrato, David Harness, Mark Farina... you get it!) before ending-up at THE END-UP (know what I mean? - read between the lines, and don't forget to wipe your nose while you are at it, if you knose what I mean.)\n\nThough of course, good music can still be had elsewhere.\n\nDon't let a name like \"The Stud\" throw you into a corner out of fear for your homophobic life. Yes, you may very well find at least ONE tranny in there dancing with herself in the mirror while admiring her flawlessly fabulous fake tits and gorgeous pink feather boa. But for the most part it is boys who know how to have fun and a few straight girls who appreciate a \"girls night out\". Though I have to add, that there have been a few nights where I have observed a well balanced mix crowd, a little top-heavy on the femininity, but still mixed nonetheless. \n\nBut WHO CARES if it's a gay club!?! YOU'RE THERE TO DANCE!", "author": "NirvAnna M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-27", "description": "Thank you, Stud Bar, for one of my worst bar experiences ever.\n\nI came to see Trannyshack. I paid my $8 cover. I was happy to be there, had looked forward to it for weeks, came early so I could get a good place for the show. But waiting for it, packed like pigs in a slaughterhouse, every surface sticky (although I didn't mind for the moment), you turned the volume up to 11 and forgot about it. I had my fingers in my ears and they still rang afterwards. I kept my hopes up--even though assholes all around me were smashing glasses and pushing their way forward and picking fights and the music sucked and the stage was too small and too low and it started late and well, eventually my hopes started flagging I suppose. And then the show started, and the speakers still blared painfully, and I said to myself \"nope, I don't think this'll work.\" \n\nThanks for understanding. I didn't think I was gonna get my money back, but I asked about the sound anyways so that, you know, somebody might fix it. \"We don't have a 'sound guy,'\" said the Tranny at the door. Who does the sound then? \"We have a DJ or something. I don't know. You should ask the bartender.\" Oh yes, the bartender, who is trying to serve drinks to a crowd twice what the fire marshall says is a good idea. He'll know what to do. Well, I'm leaving because the event here isn't safe, isn't well-planned, isn't worth the money, most definately isn't in a good location, and doesn't have cheap drinks which might make up for all the other stuff. I want my money back. \n\nThanks for looking me up and down, giving me a derogatory look that probably meant \"strait, drunk, or stupid,\" so that I knew exactly what the game was. As soon as you did that I knew never to come back. And I decided to give the worst review for a bar ever.", "author": "Orin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-11", "description": "Christ on a cross.  Me + The Stud = Ridiculous.  I can only go here once or twice a year because I act such a fool everytime I go.\n\nMy first visit to the Stud....my 21st birthday.  My boyfriend and I had picked up a gay couple at Martuni's.  My boyfriend was with the older part of the other couple in a jeep.  I was with the young one....in a cab, doing scissor kicks out the window.  We get to the stud, and my gay is running about shrieking \"WE ARE GETTING DRUGGED!  WE ARE GETTING DRUGGED!\"  I've never heard anyone so excited about that possibility before.\n\nCome to think of it, I think I'm about due for a visit....", "author": "Coco D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-14", "description": "Bambi loves the Stud...\n\nback in the day when I was 12 (Big ASS LIE)and Monday nights were the happening thing I used to go here with my friend Ms Byrina until a big fight broke out one dark and stormy night  and Bambi had to call in to work to send in the troops... well that was back then...\n\nThe Stud has since gone thru different club themes and zip 2006 Trannyshack is rocking the house( I know they have been around awhile). So now Bambi has been doing this once a month DRAG/ROCK/Horror fix at The Stud and went here with the heffa and her roommate for our monthly Stud appearance on Tuesday. \n\nWell Let me tell you all.. the house was rocking,drinks were flowing and Bambi ran into Ms Moss(no not the real one) the really  skinny one that works at a store (am not telling which one) in union square. So one thing leads to another and before you know it Bambi is lip locking with The Moss and the boys are wondering ...\" what is it with Bambi and this business of making out with strangers?'\" well you know a bad habit is hard to break .. but a good one is even harder... and with that me and The Moss got our crew together and headed to a mini house party... \n\nThe real deal: some of the staff that worked here a while back (OK 10yrs ago) is still here which is a treat. The drinks are nothing special but well worth the price and the crowd at least on Tuesday night is Glam...\n\nP.S ... I hear the return of SUGAR  at the Stud is this coming Saturday.", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "During my visit to SF from SD for the Folsom Festival this place was thumping with GREAT deep house music. The crowd as not big, but I did not care as the music was great.\n\nSecond time I was here there was a bigger crowd with retro 80's music, but remixed. The crowd was eccentric and electric of course. A good place to go and relax without the extra effort to look secsi.", "author": "José C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-10", "description": "All this buzz about The Stud's Saturday night party \"Hot Mess\" being the new \"Boy Bar\" for Saturdays is entirely...true.\n\nA couple noticeable differences:\n\n-there's actually parking! I don't have to walk six blocks in rain/cold/darkness to go clubbing. It's located on 9th and Harrison (The Stud), so street parking within a block is no longer an urban myth.\n\n-It's got a better looking crowd. Not to mention that the demographic is mostly 22-28 yr old, white, male, and rather fit. Plus the \"I think that one is hot\" percentage is 35% instead of the 12% at Boy Bar!\n\n-The music quality is better. I'm a dancing snob (queen, whatever), and my ass was going like whoa the majority of the time I was there.\n\n-There's a VIP-ish area i.e. a leather \"bed\" with wrought-iron head/footboards and a sheer muslin curtain around the sides, shutting you out/in. It's also prime location for the...oil?...wrestling. Which leads to the next and final difference.\n\n-The gogo dancers actually take off their clothes (accidentally, of course) all in the name of wrestling. On the pool table is an actual pool, albeit a blow-up kiddie one. The gogo boys get in it, get greased by the MC who is squirting liquid(s) at them, and start wrestling. One second, I see two \"dancers\" go at it high school-style, and the next I see testicles and a naked bum. Accidental? Uh huh. Suuuure.... It's fine from afar, but I worried about getting too close to the pool and getting my clothes (and hair) splashed with oil. \n\nGod knows that there are stains that can't be washed out....\n\nGo. Just to get out of the Castro. Totally worth the $5 cover.", "author": "C. P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "Before I actually came here like 2 years ago I thought this place was super shady. Kinda in the middle of nowhere and I don't know, it looked all rundown and somewhat terrifying.\n\nWell whatever. It's great.\n\nOn my inaugural visit, bjork was apparently there and I don't even like bjork. It was crowded.. hot... sweaty... it was amazing (especially for a weeknight.) We didn't stay very long. In fact, it was so chaotic that we lost a friend/coworker there, it was quite worrysome cause he didn't turn up until 3:30PM the next day.\n\nThat was an incredibly interesting night.\n\nSooo, fast forward two years and let me just point out that Hot Mess on Saturday nights is fantastic (fun crowd, great music). There's an annoying $5 cover, but whatever, it's a million (or four) times less than what you'll pay at the Endup down the street. Mmm hmm that's right.\n\nYou can dance till 3:00 AM.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-16", "description": "This place is awesome and here's why.  I left my wallet in there last night and somebody actually turned it in.  They didnt even pinch any money out of it.  So aside from the fact that Trannyshack is great fun, the people who hang and work there are way cool. I spent the whole day freaking out and now i can rest easy tonight.  I'll probably end up drinking there again when i go to pick it up.....\n\nsigh", "author": "Kirsten S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "I like this place. The bathroom entrance has door beads. The bar extends from a cozy room with cute seating and lighting to a pretty dark dance floor with a stage. The bartenders are sweeties and serve great drinks. One star off because this is the only bar I've been to at night where I had no trouble holding a conversation over the sound system.", "author": "Ty X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "I saw the Meow Mix drag show here and it was wonderful! Very small cover and the performers were gorgeous.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-05", "description": "Trannyshack at the Stud is one of the best nights out you'll ever have. The ladies put on a wonderful show. I had the excellent fortune to be here for the \"Hedwig vs. Rocky Horror\" showdown night and a better show on Broadway I have not seen. \n\nPlus delicious drinks and as already stated by the other straight girls reviewing The Stud, a fun night out dancing without the icky random dude rubbing a boner against your leg factor.  Plus, the following scene made my entire night: \n\nMy friend (girl) who is pretty short can't see the stage, so she looks for a guy to use as a leaning post while she tiptoes. Upon finding a guy in front of us who is the perfect shoulder height for her to lean forward on and gently placing a steadying hand on his shoulder, she yells to me, \"He's just perfect for me\" upon which the man next to the leaning post guy turns around in a drunken rage and yells \"Uh uh honey, He's perfect for me so don't even think about it.\" When we explain the leaning post factor and that we have no intentions of stealing his man away, both gentlemen helpfully escort us through the crowd for a better view of the show and dance away with us!", "author": "Mindy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "I just started throwing a dance party at The Stud every first Monday. The Stud is great. Everyone that works there is friendly and attentive. The sound system is fantastic and I love dancing my ass off!!!", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-21", "description": "Stop #5 (final stop) on the Trial Run BART Crawl: Civic Center Station / The Stud\n\nI genuinely thought my work crew would never ever EVER consciously come to this place, but I put it at the tail end of the BART Crawl to see what a little alcohol could do to their strategic decision making capabilities.  And oh, that magic bottle worked wonders...\n\nThe Good: I have driven by this place about 40 times, and always wanted to see what was going on inside.  Studliness is a virtue for god's sake!  No disappointment in the decor: looks like a fantastic place to get your groove on.  Dark enough for nawwwtyness to ensue if you were inclined to get nawwwwty...  Also, gotta love PBR tallboys.  Served with style.\n\nThe Bad: Not the place to be at 1:30am on a Thursday night, apparently.  Just us, the bartender, some loud music, and a rather unimpressive cross dresser with huge conically stuffed boobs playing pool and smoking a cigar.  Or something like that.  I honestly was a bit hazed out by this point...\n\nThe Ugly: They kicked our asses out promptly at 2am.  I mean PROMPTLY.  We had to slam the rest of those PBR tallboys in fratalicious fashion...  Well, it's likely that we were the ugliest part of The Stud by that point.  Don't blame them...", "author": "Brett L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-08", "description": "Came here for the Pink Slip show on the 27th. It was dark. There weren't a ton of people there. Bud Light in a can was $3.50. Wasn't boding well. \n\nThank God for the Pink Slip show. \n\nAnd Katy Perry.\n\nVirginia Suicide rocked the house. Delicio Del Toro was friggin fabulouso as always. \n\nAnd then Katy Perry came in with her entourage. Totally chill Laid back. Actually came up to me and my partner and told us how cute we were. Then we bonded over cigarettes outside. \n\nBut for a gay dive bar, it's A-OK.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-21", "description": "Started coming here regularly for Sugar many years ago with my partner-in-crime Rhez. The night was very straight-friendly, and as the buzz surrounding Sugar picked up, everyone flocked and was welcome. Haven't been back for Sugar in a while, but I'm sure it still rocks.\n\nDropped by a few times for the outrageous and always entertaining Trannyshack, and a few other odd nights.\n\nRhez, when the hell are you coming back so we can relive old times?", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-11", "description": "Why I love the stud. In the order of which I experienced said love.\n\n* Parking right in front of the club at 1 am\n* $5 cover charge\n* STRONG CHEAP DRINKS\n* Good, loud (make that really loud) music that is a good mix of current and your 80s faves\n* A packed bar full of nothing but hot men wearing little more than their underwear dancing on the bars, cubes and any available surface\n* Lube wrestling on the pool table. I mean really, who does that?\n* Everyone was awesome and friendly and smiled when I passed and not a single person tried to grab my ass. Hey that rhymed.\n\n-1 because the bathrooms were so disgusting I threw up a little in my mouth.", "author": "Brenda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "Came Thursday: empty. They charged 7-10 dollar cover to support some anti-war cause, and no one was buying. I arrived with about 6 other people and we quickly voted not to bother.\n\nReturned Saturday night for Hot Mess about 1:20am. Overall, a fun time. The breakdown:\n\nSpace: One room had a covered pool table with an inflated miniature kiddie pool on it (pool was empty). There was also a bed. Dance floor was reasonable, except for the broken glass rolling about underfoot. The thick crowd made walking or dancing something of a squeeze, but the vibe was pumping and fun. Street vendor selling hot dogs outside.\n\nRestrooms: Not enough capacity. Some guy next to me leaned over, pointed out my manliness in the conveniently located mirror, and attempted to plant a kiss on my cheek as I stood there where the king, but not the club kid, goes alone.\n\nCrowd: Friendly, decent-looking, but few true hotties. A pretty good diverse mix. And there was that guy who spilled his drink on me.\n\nGo-gos: Some fully clothed, some with nothing but a pair of jeans around the ankles. Kind of cute, but could do better.\n\nMusic: A welcome relief from straight Top40 tunes, the dj spun a more eclectic mix, including elements of pop, light rock and random stuff without straying too far.", "author": "Teddy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-15", "description": "I've got one thing to say about the Stud..... Atmosphere.  Go for no other reason than to see the random gay crap on the walls, the chandeliers hanging over the bar and to pee in the troth while trannies ooogle your goodies.\n\nThis is an od space that has just the right amount of sleaze to make it fun without making you feel like a total whore (unless, of course, that's what you're going for).\n\nTranny Shack is the best night by far.", "author": "J. Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "Good looking men dancing in jock straps on platforms and good looking men in the crowd.  More then willing to get low with straight women.  \n\nA great experience.  I recommend going with other gay men.\n\nVEggie Friendly: Yes", "author": "ashley l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-07", "description": "I've always been partial to scenes where gayboys, gaygirls, trannies, and even heteros mix it up, and so far the Stud has served it up!\n\nMy favorite night is Juanita More's Playboy, held on two Saturdays per month (so check listings). One minute I'm singing along to David Bowie, the next I'm shakin it to Rob Base and EZ Rock. Had a drink called \"the Red Headed Slut.\" And then I'm talking a sexy artist from Madrid. Everyone is just wearing their individuality and having a good time.\n\nI'm inspired to break out my skinny rakish jacket and try some smokey eyeshadow next time.", "author": "Alberto V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-17", "description": "Last night was the first time I ever set foot in this place and boy was I pleasantly surprised. My initial impression just from passing by was that it was a divy, leather daddy bar but on a Saturday night it's a great alternative to the Castro. \n\nThe main reason for my 5 star review is purely for the music, I just didn't want to leave the dancefloor because it was one great song after the next. The DJ really knew how to get everyone to shake their asses.\n\nHands down the most fun I've had in a long time. I will definitely be going back since Hot Mess is ending at the end of the month. So sad.", "author": "Jeremy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-16", "description": "\"Bucky!\"\n..where's that coming from...\n\"Bucky!!\"\n...am I going crazy? Who's yelling my name...\n\"Bucky!!! Get up in the cage with me!!!\"\n....Oh. Hell. NO. Looking up, I see my friend who was next to me a few moments ago, dancing away in the cage. In the Stud Bar. Shirtless, hairless, and Asian, and up til a few seconds ago seemingly straight. A few potential suitors start to gravitate towards him. He is the Death Star and they are competing Millennium Falcons. A gentleman in a tux approaches my wife and myself, whose mouths are agape watching the scene unfold. \n\"Is he dating anyone?\" he asks.\n\"At this moment, I'm gonna have to say he is available for anything... I think\" was my reply.\nHe smiles and disappears into the crowd.\nHow did we get here?? I laughingly ask myself. I can tell you how. We had all started off at Bootie where we were dancing the night away when one our group starts to complain. \"We always go to the straight bars... Just once I wanna go to my bars!\" Bye bye Bootie. Hello Stud!!\nThe DJ at Stud is on point. She controls the packed wall-to-wall sweaty crowd easily. After a few minutes of acclimation we are back to dancing and having a great time. Looking back I wonder if my experience would have been different without my wife there. I'm not egotistical enough to think I would have been hit on all night, but would I have been more self-conscious about dancing in a sea of gay men?? Either way, I'm not worrying about that, because I am dancing with a pretty lady all night. The crowd, the staff, the music at Stud... all great. I would have no qualms about coming back and getting down. \n\nBut whatever happened to my friend in the cage?? Well, that's his story to tell you....", "author": "Bucky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-31", "description": "Like OMG this place totally wuz off da wall and hella shit!  I'm like at Hot Mess the other night and like their wuz some choice pickings and adorable eye candy.  The boyz are all itchin' to show off there hot Christina dance moves.  Dam!  Like theres this one boy and he's like all over me and dancing like Brittney in her new video.  He wuz like hawt in like baggies and backpack!  But then his BFF be-atch was cock-blocking me so I had to get all up in his face.  I had my foney ID so waz like ordering STRONG mixed drinks.  I wuz like gonna lube wrestle to!  Dam!  Hot Mess at the Stud is like da shit!", "author": "Jim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-03", "description": "I will always remember The Stud as being the first place where an mantourage of 10 gays escorted me out to my ride's car and interrogated him for 10 minutes before being convinced that I was safe to leave. I love dancing with those hot boys!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-16", "description": "trannyshack* alone would earn the stud 5 stars but everytime i have been here (more times than i can count on one hand okay two hands!) i am welcomed with open arms by some of the nicest bartenders and patrons this city has to offer and i don't even have a penis!  or do i?!?!\r\n\r\n*trannyshack in on tuesdays and they stamp your hand, \"tranny chaser\"  at the door.  i'm sorry...that alone is worth price of admission.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-28", "description": "Pre-partying by drinking two Tall Boy PBRS to work up the nerves to go The Stud  $4.50\r\n\r\nWife is bailing to go to dinner with girlfriends $60.00\r\n\r\nTaxi to The Stud $12.50\r\n\r\nSo called friends ditching you to go hit on cute boys $25.00 bar tab\r\n\r\nCute girls are playing for the other team $20.00 more on bar tab\r\n\r\nits 1:34 am, drunk and bar patron telling you I can be his tall nordic warrior later in the night: Priceless", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "I love The Stud. I DJ'd there for about two years, and still do from time to time. The staff has always been extremely friendly and accommodating, even when our club wasn't doing so hot. The drinks are strong and cheap , they have a varied mix of club nights (Lucky Pierre and Heat being personal favorites, it's always refreshing to go to an ostensibly gay bar and hear the likes of Le Tigre or Simian Mobile Disco instead of Britney) and the bartenders treat you like a friend.", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-30", "description": "What girl doesn't love getting all dressed up and going into a club that's playing bangin' beats, only to find herself being surrounded by a sea of good looking men?  Guys- no need to worry about your girlfriend going here because the wonderful thing about the Stud is that these men aren't sweatin' the ladies, they are too into each other! Ladies- if you go, be sure to pee ahead of time because the bathroom does not offer privacy! The Stud is a fun place to get your groove on!", "author": "Yvonne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "Came here Saturday night with a friend, good strong drinks, good music (R&B Vibe) and some cute go go boys...love those go go boys...nice mixed crowd...", "author": "Denny R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-08", "description": "The Stud is an A-OK bar that has struggled to come up with a regular event that stays consistently good.  The space itself is a winner and they add novel attributes to anything they put together, but sometimes it's empty and sad, you feel like saying, \"why don't they just reclassify as a 501(c)3 cause paying $7 at the door felt like a charitable contribution\"!", "author": "Luke M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-21", "description": "Sugar on Saturday nights is (er, was) definitely my favorite place to go dancing, especially if Ellen Ferrato's at the wheel.  The music and crowd is always FUN FUN FUN.  Trannyshack on Tuesdays is ALWAYS good times and they sure pack em in!  Both, quite the institution and worth the visit.  LOVE this place.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-28", "description": "being a mo from southern cali, i've been to my share of gay clubs. i don't really expect much. strong drinks, good music, cool crowd. we spent a weekend in s.f. a couple of weeks ago, and decided to stray from the usual castro neighborhood, and check out some bars/clubs in soma. our first stop was the eagle tavern. we went to the eagle with the intention of having a few drinks and checking out the stud for dancing. the eagle tavern rules! we ended up there for about 2 hours. fantastic.\n\nanyway, we stumble up the street to the stud at well after midnight. i'm thinking, it's gonna be popping because of the time and it's saturday night, and we're pretty buzzed, and ready to dance. \n\nthere's no line, and we're thinking, cool? or bad sign?\n\nbad sign! we pay 6 bucks to get in (no problem with that), and walk in. it's actually a cool looking place. it's got a lot of personality. you can kind of imagine the 70's sleaziness that was commonplace. unfortunately, the decor is the only part that had any personality. \n\nthere was no one there. i'm talking 10-15 other people tops. for a gay club on a saturday night? that's insane. there were 2 go go boys and a drag diva dancing. well, it was mostly the diva up on the platforms, while the boys kind of just wandered around and stood in the shadows talking to the dj. the dj was actually pretty good. he ran the gamut from new club to club classics, to some good house music. all of it was dance appropriate, and flowed really well together. \n\nthe \"crowd\" stood around and stared at each other like we were at a jr. high dance. imagine walking into a club after midnight, on a weekend, and seeing a couple of handfuls of guys just standing around. we would have turned on our heels if we hadn't just paid a cover. whatever, we got a drink (3 bucks more than the eagle tavern and not nearly as strong . i drank 7&7s all night ), and just dance our asses off. like i said, we were already buzzed, the music was pretty good, and we had the dancefloor to ourselves. \n\nlive and learn...", "author": "tony l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-02", "description": "This place just keeps getting better and better. Went to the new \"Hot Mess\" party last night, thrown by Gus, and it was truly one of the best parties I've been to in years. Great mixed crowd, go-go dancers everywhere, baby oil wrestling on the pool table in the front area, and really strong drinks which weren't too expensive. Plus, the music was outstanding, with lots of great re-mixes of old and new house, hip hop and dance grooves. By 2:00 a.m., it was time to go! I'll be back! Of course if you can't make it out on Saturday, there are always Tuesday nights for Trannyshack....", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-02", "description": "The boys at the Stud are always so welcoming. I can dance, dance, dance, to awesome music without being bothered. This place has been here since the beginning of time and it's always a treat to visit. One of my favorite spots in the city.", "author": "Xelyn x."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-06", "description": "I'm sorely disappointed at the Stud for ending one of the best drag cabarets in the Bay, its dilapidated exterior now reminds me of an accident on the highway that's been cleared for hours, but continues to attract lookey-lous, there is nothing to see here, people, keep moving....the drinks are watery anyway", "author": "d v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-22", "description": "It took some Floridians in from out of town for me to finally hit Stud.  We went from here to a bunch of other places and I would have predicted I'd hate it, but in fact it was my favorite part of the night.  Comfy, fun, convivial atmosphere where everybody's welcome, no matter what your scene is.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-10", "description": "Went here with my boyfriend, had been once before and had a lot of fun. Maybe I was drunk when I went then cause this time I could wait to leave...I totally didn't get it. I think the night was called Dirty and that was what people smelled like. We ended up getting the fuck up out f there. Maybe I will try it again, maybe i'll hold my breath if I do.", "author": "James J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-23", "description": "I can't believe I'm the first to write a review for the Stud! This place is a San Francisco clubland institution, and still manages to have parties that are wonderful. Trannyshack on Tuesdays is the best drag night in the city, with wonderful ironic performance by talented performers like Fauxnique, Suppositori Spelling and  the  Grande Dames of drag Heklina, Mr David & Juanita Moore among others..  On Saturdays the long running Sugar features Ellen Ferrato and is one of my favorite house nights. All the boys (and quite a few hot girls) make an appearance and the dancefloor goes til at least 4am.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-22", "description": "This place is great - I'm not sure why, but it just exudes personality. The stage is tiny - before I saw a performance, I didn't even know it was there. The drinks aren't too expensive, at least by San Francisco. If you haven't been yet, do yourself a favor and attend Trannyshack.", "author": "Dana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-25", "description": "Good times, strong drinks and an all around fun place.  Lots of fond memories and hopefully new ones to come!", "author": "Tom D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-14", "description": "It's a shame i discovered this place so late in my time in San Francisco. A really really great bar with a really really diverse and mixed clientele. Definitely more alternative than anything in the Castro but sleazy enough to not be a pretentiously hipster either. All ages, all styles welcome. \n\nTuesday seems to be their busy night. During Trannyshack. It's an awesome show, but expensive. Not for what you get, but just in general if you're a poor cheap student bastard like me living on Top Ramen.\n\nThey even have Ms Pacman! The bartender is also the friendliest bartender I've ever met. He has bought me drinks. The coat check people are nice...everyone is cool. It's easy to hook up. But it's also just as easy to make friends and have conversations with people.\n\nGreat great place.", "author": "B M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-28", "description": "I've driven by this bar many of times, but never had a reason to pop in for a drink until last week when I found out about Bjork playing records after Matthew Barney's opening at SFMOMA. I stopped in with a couple girlfriends around 9:00pm on a Wednesday (after the Yelp Hot Summer Nights event).  It wasn't that crowded and the space was pretty interesting. I could this being a fun bar.  However that being said, the bartenders weren't that anxious to wait on us and seemed a little annoyed the bar was about to get invaded with non regulars.  Overall I had a great night...not necessarily due to The Stud, but b/c of friends, the Extra Action Marching Band and Bjork.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "I was here the other night, wearing an Asian-inspired, baby blue, floor-length silk robe, twirling around like a geisha on crack.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-06", "description": "I used to party here every saturday when the party \"Hot Mess\" took place. All of the staff members are really cool and friendly and know how to pour a stiff drink. Had I been writing this review last July they would have gotten 5 stars, but in the most recent times I have been here the cover is pretty high for a not so poppin' party with a small crowd:-( I want the old Stud back!", "author": "Derek H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-26", "description": "so it's a few months ago.  i'm planning on moving to san francisco, in town with my mother who's staying at the marines memorial hotel for some anti-money-laundering conference she's speaking at.  wait, let me repeat that, staying at the marines memorial hotel.\n\nso a friend of my trannyfemme husband calls me up the first night we're iin the city and invites me to \"a drag show.\"\n\nso i drag it up, setting my genderqueer ass up in a skirt and a ruffled top with breasts and eye makeup and lipstick and a mustache.\n\nand i walk out of the hotel fearing that someone's going to attack me.\n\nbut i got to the stud alive.\n\ni'm used to very political drag, that's what we did back in olympia.  a lot of rollicking flag burning and the like.  so.  we get to the stud and trannyshack happens and it's precious and hot and wonderful and yay.  ten points for the trannyshack and the stud.", "author": "Puck F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-14", "description": "My Band played here recently.  They don't have the best sound system, but they promote their shows well and they are good to work with.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-22", "description": "I love you, Precious Moments!  I felt like we had a connection....and we share a birthday!", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-27", "description": "fiascos really rarely happen, honestly. for something to qualify as a real fiasco it has to be either that story i heard on this american life about a theatre project gone horribly wrong, or the key chasing/coworker chasing/birthdayblackout debacle i witnesses/experienced last night.\n\ndissolve to: the stud.\n\ngood times.", "author": "coffeecake j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-29", "description": "i love the stud.  the decor, the lighting.  it's all perfect.  the bartender is always very nice and it's fun once in awhile to play pinball there.  i used to go here a lot for death rock booty call, which was one of the best clubs ever, back in the early-mid 2000's (did i really just say that?)  and more lately for dancing ghosts tributes to different record labels (4ad, mute, etc.)  i always have a good time here- it's small but not too small and the dance floor is a nice size.  the drinks are generally strong and tasty and all in all it's a good time.  except for the bathrooms, which are some of the grossest i've seen.", "author": "Kate W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "came here for a coco wizard productions party last night, yeah it's a gay bar, but whatever, i'm not homophobic.  sharon, rocked on as usual with her damn good soul food, the rockers rocked and the soul sistas, sang.  but Kristo the bartender will get you hammered, a shot means a double to him, needless to say, i'm bleary eyed this morning.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-22", "description": "i've been the the Sugar parties more times than i would like to admit... one of my best friends is gay and he takes me with him to dance with all the hot young gay boys. its a small space and it gets sort of sweaty, but much fun...", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-16", "description": "Went on a Friday night...perhaps that was a poor choice? We seemed to be the youngest people there, by at least a decade. The music was god awful and the few who had the balls to dance were a sad sight to see. I requested a song by the faint, the dj looked at me like he had never heard  of them before and said \"we only play dance music here.\" If you are at all familiar with the faint, I'm sure you'll see the irony in this.", "author": "H.S. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-29", "description": "I don't know what it was about this place but it made me REALLY HAPPY!!! I made a lot of man friends here and it seemed like they were all bending over backwards to please me. I don't have much to say about the service because I never had to worry about getting a drink for myself, everyone there was doing it for me. I got hella free drinks and a whole lot of fun. I definitely recommend this place! Bring your dancing shoes!!!", "author": "Brendan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-25", "description": "Yay The Stud! I decided to check-out \"Junk,\" the new Thursday party at the stud. It's just another example of what's so cool about the stud: it's truly diverse offerings. The musis was great, the crowd was nice. It was mostly baby butch women and FTM. Not very many people, though. It would be cool to see more people there, and a few more gay men. My favorite is Trannyshack. Where else could you possibly find such a drag-show? Unique, fun, it's just hot.", "author": "Vernon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-18", "description": "They really need to change the bathrooms !!! I swear I have never seen that before. It's  totally disgusting in there !!! Gay guys like me are certainly afraid to come back after that !!!", "author": "cutiesam c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-08", "description": "generally fun times w. hot dancers and good bartenders. even get to hang with the trannies till 3am.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-26", "description": "the stud has many good nites for guys and girls such as trannyshack (tuesdays), club heat (fridays), all men are evil except my girlfriend (thursdays)... ive never been to any of them. i went to the stud for the opening nite of hot mess, which is every saturday nites, $5 cover. i think i was expecting a bigger place, although i guess it's not really that small. it's just that it was soo packed. the door people were nice, the bartender was a little rude. the drinks werent strong but they were cheap. hot mess was supposed to be messy, so they had people tp'ing the place, and the dancers were spraying silly string on everyone (no i dont like silly string in my hair...) and balloons popping.   it is cosponsored by gus presents and hothouse, so it has a porn theme, but you cant tell.  i was kinda surprised there werent many girls because the music reminded me of lots of lesbian clubs - hip hop/r&b, 80s, some weirdly mixed alternative/punk and even fresh prince of bel air theme song. i feel like more women will start going eventually, esp when it's not rebel girl nite like it was. im not so into that music, but if you are, and if you are on the younger side (its a more boy bar aged crowd) then do go here. it's open till 3am which is good and lots of people and drink specials. yay.  i will probably check out the stud at some point again for another nite, and even maybe this nite again depending on the dj or how bored i am staying in. lol.  oh but ps it was not gross like some of the other people said. it seemed like a normal dancing bar place.", "author": "Merredith L."}
