{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "This is absolutely DELICIOUS. This is an outdoor version of the one on Columbus. It was my first time here, dragged by my friends who were extremely excited. I have never heard of this place and I am honestly shocked I haven't. \n\nBaked bear is, as per the description in the title, is a custom ice cream sandwich place. It doesn't only have ice cream sandwiches, but plain ice cream and... it slips my mind now, but there's other things too. \n\nI had gotten a custom ice cream sandwich. I got a snickerdoodle cookie with mint ice cream and Oreo crumbles. It came in a tray and it was a little difficult to eat. But it was totally worth the messiness. It was delicious and tasted very very sweet. Now of course, if you don't like it super sweet (or want it sweeter), you can customize it. Don't want it sweeter? Choose a different ice cream or topper. Want it sweeter? Choose a sweeter ice cream or topper. It's wonderful! Instead of a cookie as the \"buns\", you could have a donut or brownie. \n\n(Longer description if you need it:)\nIt's completely outdoors and wonderful if it's sunny (like the day I went). On the left of the truck, there is a menu written in chalk. For a custom ice cream, it has each step written out perfectly. It starts with what you want as \"buns\". There is a list of cookies they have (and they have a monthly cookie which I think is peach cobbler this month), a donut, or a brownie you could choose. Next is a list of potential ice creams you could get. I highly recommend the bear one, I didn't get it but it sounds LOVELY. (Its blue cake batter, fudge, and brownie). Next is a list of toppings, which is placed on the side of the sandwich, stuck onto the ice cream. \n\nIn the middle(ish) is where you order. To order, I said, \"Hi! I would like a Snickerdoodle cookie with mint ice cream and Oreo crumbles.\" They take your order and you move to your right. On your right is the place where you get your order and pay. \n\nFor utensils and napkins, it's on the table slightly on your right when you pick up your sandwich. There is seating in front of the truck (and towards the back...?). \n\nOverall, completely love it. :)) ALTHOUGH.... I'm not sure if it's worth $7. My friend thought it was super similar to Creme. Don't recommend going out of your way for this place but stop by if your in the area.", "author": "Naomi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "I came here with a friend on Saturday afternoon at around 3pm. Wasn't busy at all! It's around some other cute food trucks around Fisherman's Wharf. \n\nI got got the espresso bean ice cream with a peanut butter cookie and cinnamon oatmeal cookie and oreo cookie topping ($6.95 + 0.50 per topping= $7.45). I felt like the cookies were pretty undercooked. I wished the peanut butter cookie had peanut chunks or something to bring out the peanut flavor more. The cinnamon oatmeal cookie had a good balance of cinnamon, but I wish it wasn't so undercooked. The espresso bean ice cream was creamy and smooth, though the espresso flavor was not strong at all and I prefer chocolate chips or something mixed in with my coffee flavor (though I guess that's how they get you to buy more toppings). There also wasn't not enough oreo crumbs in my opinion. \n\nMy friend got the cinnamon oatmeal cookie and an M&M cookie with cookies and cream ice cream and M&M toppings and whipped cream. She also thought the oatmeal cookie was undercooked, but she felt the M&M cookie was overcooked. She also felt while the ice cream was good, there was not enough cookies in her cookies and cream and it was just overly sugary. \n\nWe forgot to get our cookies pressed, which probably would have elevated it. Wished the server would have asked us, but still on us for forgetting! If I was in the area, I would possibly give it another try.", "author": "April L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Walked by this place while I was exploring fisherman's wharf! This place is a truck-like place with outdoor seating. \n\nI just want to give a shout out to the lady who was handling the store all by herself the day I went. There were a big group of kids in front of me who were learning how to save and spend money i'm guessing, since they all paid in coins and only could order what they could afford. The lady was so patient with them!\n\nMy boyfriend and I ordered a funfetti cookie with a white chocolate macadamia ice cream sandwich. The ice cream we got was Bear batter! It was a bright blue! I think the funfetti went well with the bear batter ice cream. We also got our sandwich hot pressed. The cookie was soft, warm and chewy and the ice cream paired well with the cookies.\n\nI love this place and would deff come back!", "author": "Flora L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Went at the very end of the night! Super delicious and great service!! I had the cookies and cream\nCookies with cookies and cream ice cream! (Obviously my favorite flavor!)", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "9PM and we were looking for parking so we could eat dinner at the local In N Out, but then I saw The Baked Bear. I recognized it from an Insider video I saw a few years ago, and I even put it on my list of places to try out, on the off chance I would be in San Francisco. We spoke to the owner and he said he's going to close up the shop but if we order something now, he would stay open for us. Throwing all caution to the wind, we had dessert before dinner and split a brownie ice cream sandwich with the blue cake batter ice cream sandwich, drizzled with caramel. \n\nMan this sandwich was like my sweet tooth dream come true, but then on steroids. This sandwich was MASSIVE. I could see why we had to pay $7/$8 for it. The cake batter ice cream was creamy and subtly sweet (compared to the brownie), making it pair well with the brownie. The brownie had some crispy edges, but was ooey gooey on the inside. Just like how I like my brownies. He gave us lots of caramel syrup, which we appreciated. \n\nIf we had not been so full from the sweets we ate from our earlier trip to MOIC, I probably could have pushed through so with the help of my boyfriend, we would have finished it. Sadly we were defeated and didn't even finish half of it. I would love to come back to The Baked Bear if I have the chance!", "author": "Liselle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-18", "description": "Good.  Cookies need to be softer to keep the ice cream from squeezing out.  Great dessert!", "author": "Jeni A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "Choose your cookie or brownie, add your ice cream, topping, and press it if you want it warm. Great idea in a heavy tourist area. Staff was extremely polite and accommodating. \nMy chocolate cookie was soft and mushy, salted caramel ice cream was standard fare, nothing special. \nAll for a whopping 7 dollars!", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "San Francisco rain and cold ain't gonna stop me from my love for ice cream!  The kiddo fell asleep in his stroller and it was my chance to break free and indulge in sweets without having to hide and sneak bites when he's not looking. Woohoo~  Excited was an understatement!\n\nIt was raining and so of course I was the only crazy person there.  I think the worker was surprised anyone even came 'cause I had to ask if they were even still open, lol.  I got to sample a few different flavors and the worker explained I could split 2 flavors if I couldn't decide.  There were so many choices which as a first timer can be overwhelming.  I like picking from a set of tried and true mixes, but that's just me!\n\nThe cookie I wanted only had 1 cookie left so I went with the cookies & cream and paired them with with the brownie dough swirl and salted caramel fudge ice cream.   My order was rung up right away which made me forget that I could & wanted to pick a topping.  It was also really dark so I didn't know I could get my sandwich hot pressed and missed it on the menu.  Oh well! \n\nThe worker was really apologetic that the salted caramel ice cream was on the soft side, almost melted.  Kinda wish he told me that beforehand and I would've picked something else.  He ended up not charging me for splitting the flavors (didn't know that was an extra charge) and gave me 2 free cookies on the house.  Awesome!!  That was a really nice surprise and I always appreciate free food :)\n\nI ran back to my hotel just 1 block away thinking that it would rain harder.  I tried to sneak a bite on my way there but the cookie was hard and the ice cream gushed out.  Once I got to my room the salted caramel already started melting into a pool of goop.  Nonetheless, it was really good!  I loved how the cookie still had a bit of that raw cookie dough taste and was still a bit chewy.  It would have been even better if I got my cookies hot pressed to soften it up (it doesn't melt the ice cream) and if the salted caramel fudge wasn't so soft.  This is definitely THE place to indulge in custom ice cream sandwich goodness.  \n\nI'll be making this a regular stop every time I'm in the Fisherman's Wharf area from now on!", "author": "Maria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "5 stars and more for this Amazing ice cream place I tried today. All the flavors we tried were yum!! The music was amazing, the service was very nice and warm. The lady suggested us an amazing combination of cookie and baked bear ice cream, with Oreo cookies toppings and we loved it", "author": "Amar P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Hello!!!! Did someone say Build a Bear? No! It's Baked Bear, where you build an ice cream sandwich of your dreams!\n\nImagine you wanted two donuts with a brownie in the middle of it with two ice cream flavors like mint chocolate chip and vanilla. Well you can stop imagining and make it become a reality here.\n\nIf you can't decide on a creation, I'd recommend going on their instagram profile for ideas. Or you can just wing it because you can't go wrong with any sort of selection you choose to make.", "author": "Jacky C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Ahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh... yeah! \nBaked Bear is legit... \n\nI had only known  CREAM, until the day I learned about baked bear...\n\nSorry cream, we're through", "author": "Cal J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "What a magical delicious place this was. I mean c'mon you create your own ice cream sandwich. 10/10 would have again, and again, and again, and...", "author": "Abel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "This place is sooo good! Donut with birthday cake ice cream and sprinkles! I def don't recommended eating this stuff often but omg it's yummy! They warm the donut up which makes it way better! My daughter likes the cookies and my son enjoys the brownies. \nI do think it's overpriced for what it is but good for a once in a while treat!", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "If I lived in San Francisco, I would come here at least once a week! Their ice cream cookie sandwiches are unreal, and they have long lines to prove it! \n\nI ordered cookies and cream cookies with cookie dough ice cream with fruity pebble toppings! It was so delicious! The cookies were the thin kind and moist. This was a great combination! I'm salivating while composing this review! \n\nYou can choose between a variety of cookies, ice cream flavors and toppings to customize to your liking. You can even choose 2 different cookies for your sandwich. They also have doughnut and brownie sandwiches available. It's locally sourced ingredients and everything is freshly made on premises. My only regret was only visiting this store only once while visiting.  I can still recall the smell of freshly baked cookies! !  Yum!", "author": "Samson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "This is the cutest ice cream shop ever. They have the best flavors, and I got Bear Batter with two snickerdoodle cookies. The outdoor atmosphere is great, too.", "author": "Gabrielle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Was on the way to china Town and happened to find The Baked Bear- best ice cream shop I've been to in a long time. I got a brownie bowl with ice team and it AMAZING. Their ice cream sandwiches are to die for and you customize everything to what you want! Perfect snack for walking around San Fran!", "author": "Madeline P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-21", "description": "The ice cream is delicious and the service is friendly. But let's face it, almost all ice cream in this part of town is delicious. The cookies are very bland. I guess if you are going to use the cookie to make an ice cream sandwich, it doesn't have to be very tasty. But we bought ice cream and cookies separately, and we couldn't even finish the cookies! Any of them! They were really tasteless.\n\nThey are also kind of mushy almost like the cookies are undercooked a little bit. I think they need to revamp the recipe. Try some baking powder!\n\nSorry, friendly service and good ice cream are a dime a dozen in this town. That's why I'm only giving it two stars.", "author": "Jim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "I completely adore the Baked Bear's Ice Cream Sandwiches, and if you're in the need of a sweet treat, you HAVE to come here and give them a shot. A definite hidden gem by the end of the North Beach pier and a complete recommend! \n\nI almost missed their location twice around it- It's kind of a hidden gem I would say! It's tucked behind the touristy pier on North Beach. Their location is basically out of a food truck, but there's 2 large tables in the front for maybe medium sized groups. They also have a small sign that reads The Baked Bear out front, but their location is kinda nondescript.\n\nConceptually in the Bay if you're familiar with C.R.E.A.M or Cookiebar, it's the same concept, only I appreciate the Baked Bear more bc for the charged set price (for me around $6 for their cookie ice cream sandwich) you can choose as many additional toppings as you like without getting charged more. I really appreciate how it's kept at a fixed price, so load on the toppings! I think I actually would put this on par with Cookiebar, and it might actually be one of my new favorite places to get an ice cream sandwich! They also have donut ice cream sandwiches here, which I'll have to get next time.\n\nI ordered the custom ice cream sandwich, so I asked for 2 Red Velvet Cookies (ask for them to be warmed, it makes a difference, trust me!) with their infamous Bear Batter with Sprinkles and Fruity Pebbles on the side. \n\nThe Red Velvet cookies honestly looked more like a chocolate cookie (it was more of a darkish brown than a red) but it was still soft and very chewy. Probably not my favorite red velvet cookies ever- But still pretty good cookies, soft and slightly chewy. I'd also ask to have them warm, as it really makes a difference and softens the cookie a lot. I'D RECOMMEND ASKING FOR YOUR COOKIES TO BE WARMED, TRUST ME! \n\nTheir Bear Batter also really blew me away. Bear batter- Or their Cake Batter ice cream mixed with chocolate fudge chunks really impressed me- and especially since I'm normally not a fan of chocolate. The Bear Batter was sweet without being overwhelmed in their chocolate fudge chunks, and I'd definitely recommend that ice cream flavor.\n\nI also appreciate how if you order their custom ice cream sandwiches or donut ice cream sandwiches, for the set price you're paying for you also get unlimited topping options included! I ordered the Fruity Pebbles and Sprinkles together and I was a happy camper.\n\nThe girl who was working was also very sweet and was really fast making the sandwiches, as the line was getting a little long (even though I came at around 9pm at night & it was chilly from the cold). Props to her.\n\nI'd have to put the Baked Bear at 5 Stars. A total gem, if you're definitely near the Pier or even if you're in the mood for a bomb ice cream sandwich, you NEED to come by and try it here. I'd highly recommend and it definitely ranks near the top in terms of my favorite Ice Cream Sandwich spots in the Bay. Definitely worth coming here & checking it out!", "author": "Allison O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Mouthwatering cookies. Dynamite ice cream. Pressed ice cream sandwich was mind blowing. So delicious. Worth every dime and all the wait. Absolutely returning!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "One of my favorite spots in fishermans wharf. And each time I go I make a new creation! You can tell that the cookies are made fresh daily. Next time I'm going to try a sandwich with a brownie instead of a cookie! I've had the cookies and cream cookies and the chocolate chip. Both are delicious. I'm not sure if they make their own ice cream, but it's delicious and sure tastes like they do! They have a variety of toppings. This past time I did rocky road ice cream with mini m&ms. My boyfriend did chocolate chip cookies with vanilla ice cream and fruity pebbles. We will definitely be coming back!\n\nAlso-they need to sell water bottles! I like cold water with my ice cream as most people do, but they only sold juice and soda, which i think is sometimes too sweet to have with sweet ice cream! Other than that this place is great and friendly service.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Really good ice cream and fresh cookies. You get to make your own ice cream sandwich and can select any combination of two cookies and ice cream flavor. What a great treat!", "author": "Allan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "First time trying The Baked Bear! I'm an ice cream person so I looked up great ice cream places that I could visit during my trip to SF. This place is top choice and for a very good reason! The service was great, the guys were super funny and really friendly. I went with the funfetti cookie, bear batter ice cream and caramel drizzle and my was it delicious. Their signature flavor, bear batter, is a blue colored ice cream and tastes like cake batter. I absolutely love this family owned business and definitely recommend both locations. If you're in the SF area, this is a MUST try!", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "While in SF I came across this place on yelp! It's within walking distance from the Pier...they had great choices of ice cream and pastries for your ice cream...donut was really soft and moist and ice cream wasn't overly sweet. It was amazing! I only wish they had a fruity ice cream flavor ...maybe like a berry, orange, or a nice sherbet, that's my only downfall...other than that...I loved it & would be back", "author": "Elley E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Custom ice cream sandwiches!\n\nThis past weekend I had a chance to try one of their delicious custom ice cream sandwiches during a Chocolate Walking Tour that I participated in. \n\nActually, I didn't choose to get an ice cream sandwich, I went for other creations instead and had the Bear Bowl. I wanted a warm chocolate chip cookie with my ice cream but they only had brownie bowls at the time. It comes with one scoop of any flavor ice cream. I chose cookies & cream with almonds for topping. It was refreshing against the warm afternoon weather in San Francisco. Delicious! \n\nSo here's how you do it. Your custom ice cream sandwich can either be a cookie, brownie, donut or a combo sandwich (cookie + brownie)... this is the first step is deciding your top and bottom LoL! (you can mix and match any cookie, brownie or donut). Then you choose your ice cream! Easy, right? Wrong! because there's many yummy flavors! Choices! choices! Once you finish making your ice cream selection then choose your toppings! Now that you learned how to order your custom ice cream sandwich what are you waiting for... ready set go!  \n\nThis Baked Bear is located in Fisherman's Wharf between Jefferson and Beach Streets.  It runs off of a food truck and has picnic bench seating as well as bistro seats.\n\nReview #0753", "author": "May A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "It's been a hot minute since I sat down for long enough to craft another Yelp review. Between work and moving, there's been little time to enjoy my life, but at least I enjoyed some tasty ice cream!\n\nThe Baked Bear is located in tourist central in San Francisco; it's a hop, skip, and jump away from Pier 39 and the mobs thinking that SF is somehow cooler (in both temperature and attitude) than wherever they're from. They're wrong. The day I was here, it was a toasty 75 degrees out, and I had my nose out for delicious, sweet ice cream. If you're anything like me, you like your ice cream to have a fun spin to it, so getting a cookie, donut, or sundae to go with a plain Jane scoop is the way to go. My significant other didn't see the donut option when we opted to split our ice cream, but he did at least see the hot fudge sundae option when I let him choose.\n\nStrawberry ice cream paired with a fudgy brownie is delicious, let me tell ya that. $6 isn't too bad for a hot fudge sundae of any kind, so to see it at a reasonable price near the Wharf was really cool. I'm sure the donut ice cream sandwiches are earth-shattering, because they're certainly aesthetically appealing. If the sugar content or the warmth of the sandwiches doesn't appeal to you, though, I'd spring for a plain scoop or sundae. The menu is incredibly extensive and customizable, and everything comes out quickly, so you should have no problem getting your fix.\n\nAll the seating is outdoor, which really sucks on the approximate 10 days out of the year SF is hot. However, rest assured your ice cream will not melt otherwise.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Very very very tasty!! I am glad i stooped in for a treat. Choose the red velvet cookie (yum) vanilla ice cream with sprinkles and had it pressed. I ate in silence, savored every min of the delicious dessert. Staff was friendly!", "author": "Tia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Very good ice cream. We got scoops which cost $4.50 and added a brownie to the coffee ice cream. Very good combo-by the way. \nWe sat on the benches they provide. It was nice. Walking distance from our hotel. In the heart of Fishermans Warf.", "author": "Dominica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "CREAM at UC Berkeley and Diddy Riese at UCLA have a similar concept: selling ice cream sandwiched in freshly made cookies. I feel that the offerings here at Baked Bear are slightly better, however, because the cookies somehow taste fresher and home-baked, as does the ice cream, which is served more generously and feels home-made as opposed to ice-block cold.\n\nHere, they can take the ice cream sandwich up a few notches with any number of toppings, glazes, or amped-up varieties like a brownie or donut sandwich. Ice cream on its own is also a good choice: again, lots of it at reasonable prices. \n\nThis is a mere stand in an otherwise super-touristy area, but once in a while you can find a diamond in the rough where you least expect it.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "What a cute little find! We knew we had to stop and experience this sugary delight and it was worth it! It's in the food truck area, next to the yummy Codmothers and the pizza truck. I wish I took pictures of what we ordered but it was inhaled quicker than I could say \"The Baked Bear!\" \nWe ordered two of the one scoop ice cream cones that were massive and we had to try the chocolate chip cookie, coffee ice cream sandwich which was an absolute delight! With bigger ice cream companies in town, we wanted to experience and support these smaller businesses.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "DROOL. Today's special was the cinnamon roll cookie. I chose a cookie sandwich with cinnamon roll cookie, white chocolate macadamia cookie, birthday cake ice cream, and caramel drizzle. I loved the cinnamon roll with the birthday cake ice cream. The only downside was the ice cream froze my white chocolate chips a bit. I would suggest a cookie without chocolate chips unless you enjoy the crunch!", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Cant wait to return!  So DELISH.  The fresh baked cookies are. Hit alone but then add the creamy goodness of the ice cream and I was in hog heaven!!", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "Get the bear bowl.  Tin foil pan with a cookie baked in the bottom and a scoop of ice cream on top.  How could no one ever have thought of this before?", "author": "Jinx N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I LOVE ice cream & this place definitely did it for me!\n\nEvery time im in the Fishersman Warf area i stop by! One time at night they were out of donuts for the donut ice cream sandwiches, so dont go too late! Its a HOT SPOT! :)", "author": "Aaris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-12", "description": "It was fun creating custom ice cream sandwiches here, but I thought the ingredients were just ok. I tried the coffee ice cream (good but not great), bear batter ice cream (too sweet for me), chocolate chip cookie (just ok), and brownie (pretty good). I had them heat up my ice cream sandwich, but it wasn't quite warm enough.", "author": "Janet M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "If you're ready to get cracked out on sugar this is your place! We got a bear bowl with brownie, birthday cake ice cream, and hot fudge! It was as delicious as it sounds. My boyfriend also got a cookie, because we really needed something more *insert eye roll here* the cookie wasn't overly sweet and at that point it was appreciated. For all your sweet tooth needs, I recommend this place. The girl  behind the counter was very sweet and gave us change out of her own purse for our dollar so we could pay for parking!", "author": "Ashley V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Fabulous place with great ice cream/ cookie combos. I had a red velvet cookie and a cinnamon swirl cookie with mint chip ice cream rolled in Oreos. I would definitely recommend this place.", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Filling enough to be a meal replacement.  In the Fisherman's Wharf area, but not overly touristy nor overpriced.  Open late, even when the wind picks up making the al fresco dining quite chilly.\n\nDonut Sandwich w/ Birthday Cake Ice Cream & Fruity Pebbles: Love the donut sandwich, it's softer than cookies and sweeter than regular bread.  Also, the fact that they warm it up in a press then drizzle donut glaze on top is just great.  The birthday cake ice cream tasted like birthday cake batter.  It was decent by itself, but the combination with everything else is what makes it.  Speaking of, the fruity pebbles added a nice bit of color and crunch to the whole package.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "Great find around Fisherman's Wharf! I ordered the Donut Sandwich with birthday Cake Ice Cream, and Fruity Pebbles for my topping. Pretty sure that will always be my order when I visit (I am often in San Francisco for food).\n\nIt was so good! Great combination of sweets and flavors together. I tried to eat it like a sandwich/burger (obviously a terrible mistake) and my front teeth suffered the consequences. \n\nIt's a little messy to eat, but a great dessert find in an area with plenty of lunch and brunch places you can visit beforehand.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "We found this place after eating on fisherman's wharf and it was the absolute best part of our anniversary. I had a doughnut ice cream sandwich and my husband had a cookie sandwich and they were so freaking good. Worth a trip to San Francisco just to grab these!", "author": "Cady B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "I was here on a work training and was in mood for something sweet so I decided to try this place because I absolutely love Afters Ice cream from So Cal.\n\nAnywayssss, I might just have to say that this place is better than afters.\n\nI had the doughnut with bear batter and fruity pebbles.\nIt was to die for! All around delicious.\nDefinitely recommend it if you're in the SF area.", "author": "Monica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Another item I found in my scrap book that I forgot to review during my trip a few years ago. We walked by here while on the Warf and noticed these home made ice cream sandwiches. Of course it was busy with tourists. Perfect formula for families. It's a grab and go situation. The ice cream melts fast, therefore, this will get messy really fast. Staff were super friendly 'cause they know that it is a high tourist area. I had the chocolate chip with chocolate ice cream and sprinkles. Price was $$$ but it's the area.", "author": "Shila B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Very good icecream sandwiches! You can ask to warm the cookies so it's melt in your mouth! Got white Chocolate macadamia and red velvet cookie with the blue Bear icecream and fruity pebbles. Diabetic heaven. Very sweet but oh so delicious! Near fisherman's wharf so perfect dessert after you have some clam chowder!", "author": "Joyce K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "Enjoy the ice cream here. Large selection of homemade ice cream's.  Try the homemade ice cream with a cookie.", "author": "Jorge A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "What's there to say . They freaking out my ice cream sandwich on a donut yummy...mint chip on glazed donut", "author": "Curtis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Great fun little gem right in the city. I was so excited to try a cookie ice cream sandwich! But when it was called the Baked bear with carnival lights I HAD to go right away. I pulled my husband across the street so fast lol . The strawberry ice cream was amazing!!!!!! I added the sprinkle cookie, a little to sweet for me but the taste was there. I would go back.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-13", "description": "Think of Baked Bear like a more expensive version of \"Cream\" ice cream sandwiches.\n\nThey have basically the add your ice cream on your own cookie menu here.\n\nThe cookies didn't taste very fresh and one would think chocolate chip is a popular flavor.\n\nThe ice cream tasted like Breyers nothing to write home about.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "We were \n honesty. \nAbout half way home I noticed I had lost my wallet. The baked bear was the last place I had it. I called in the morning and the manager Zana said she would ask the staff when they arrived and call me back. She called me back promptly and said it wasn't found. Bummer!  So time to cancel the cards and start replacing everything. \nThe next morning she called me back. It WAS found. An employee found it and gave it to the GM, Emma. She was keeping it safe at their other location in North beach where she works. I arrived to retrieve it. Everything was intact! I tried to give her $20 to give to the employee that found it and she said 'No. This is our job to help and protect our customers.\" I argued with her awhile then asked her if I could at least give her a h7ug. She accepted and we shared a nice hug. Thank u Zana (sorry if I spelled it wrong)Emma, and your awesime crew. U really made my day!", "author": "Shelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Custom cookie sandwiches???!\n\nWhat?\n\n\nNow its not like this doesn't exist elsewhere but it's nice to see a place like this parked near a tourist place and do well.   Super tiny seating but it seems fairly busy during the nicer weather time.\n\nWhat really caught my eye though were the lights and the sign.  Totally stands out amidst the hustle and bustle of restaurant row.\n\nTotally delicious!", "author": "Ben H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "I'm a fan of the end result!   Our custom ice cream sandwiches were lucious, creamy and just a perfect sweet end to the day.  Each one of us got something different but my son's was the winner:   cookies and cream cookies, cookies and cream ice cream.   Yum. Simple but goood. :)\n\nThat said...\n...getting to it, trying to find parking, wading through the crowds....yuuuuuck.  It's in a very convenient location if you're going to spend the day at Fisherman's Wharf but not so much if you had it as a destination. (Guess I didn't research too much so I was caught off guard.)\n\nSince it was the only place we were going to visit, I dropped off hubby and son and then drove around the block a couple times.  I wish there was a quick place to park - like a \"15 minute zone\" - but the closest parking was $8 for 1/2 an hour.", "author": "Heidi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "While exploring SF for the first time, I stumbled upon The Baked Bear! Though my initial reaction was something inappropriate...I walked closer and realized it was for ice cream sandwiches!  As cold as it was that day, I had to get one because there were so many good reviews!  And it helps that it smelled really good when you walk up to it!\n\nI ordered Red Velvet cookies with Vanilla ice cream and fruity pebbles.  Besides it being picture perfect, the sandwich was delicious!  The cookie was thick and even slightly warm when I got it!  It was chewy and tasted very fresh.  They didn't skimp on the ice-cream either.  There was so much ice-cream in the end that I couldn't even finish it.  There are other items that they sell there, but the main event is an ice-cream sandwich. \n\nThe service was fantastic as well.  There was only one lady doing everything...taking orders, making the order, and handling money...so it obviously took a little longer than expected, especially on a Saturday afternoon.  But overall, it was delicious and I couldn't ask for a better dessert spot to have stumbled upon!  So if you're in the Fisherman's Wharf area and want something to satisfy your sweet tooth, take a super short walk to The Baked Bear!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Cookie ice cream sandwiches!!!!!! My coworkers and I stopped by for dessert after walking around Fisherman's Wharf. Since it was almost closing time, they were out of a few cookie varieties. Luckily, they still had their Cookies n' Cream cookies available, and we ended up getting the Cookies n' Cream trifecta ice cream sandwich: Cookies n' Cream cookies, ice cream, AND topping ($5.95, https://www.yelp.com/user_local_photos?select=MYK0N__PKM6Tn2gitkXxZA&userid=76vIFZcC7owykCBjMfGVXg). This was DELICIOUS (the cookies were nice and chewy), especially if you are a cookies n' cream lover like me! The desserts are on the pricier side here, but it's about what you'd expect for a place around the Wharf area. I will definitely be back to try out additional desserts from here, and get more ice cream sandwiches! Parking was easy to find on a weekday night, but it's super crowded on the weekends!", "author": "Amy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "A friend told me about this place who makes donut ice cream sandwiches! This ice cream shop is off a side street on fisherman's wharf. You can make any custom ice cream sandwich with cookies and/or donuts. I tried the combo (one cookie and one donut). The donut didn't taste as fresh as the cookie. I overheard with the customer before me that they ran out of the Oreo toppings. It was about midday on a weekday. \n\nIt's kind of pricey but the size of the sandwiches are big so you can easily share with someone else. Definitely come here on a hot day. They have a few picnic tables for you to eat on. The line is long but they take your order pretty quickly. You just have to wait for them to make it. They should pass out numbers because some sandwiches take longer to make than others. Hence it's confusing when a customers behind you are receiving their sandwiches before you while you wait.", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "We had them cater a work event and they were awesome! They were incredibly nice , professional, and extremely accommodating. Two wonderful ladies came out and set up an ice cream sandwich station at my business and the goodies they brought were delicious. I highly recommend them and will use them again in the future. They serve all around the Bay Area, and the experience couldn't have been any easier!", "author": "Marie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "This place was amazing!\n\nDoes it get any better?!  Custom made ice cream sandwiches!  The cookies were crispy and chewy at the same time. Ice cream was soft and very creamy.  Soooo many options. Cookies, brownies, lots of ice cream flavors, lots of toppings... and you can even get it warmed! \n\nThe staff was polite and very quick. They have lots of places to sit and enjoy your snack. \n\nWe highly recommend checking this place out for a sweet snack.", "author": "A T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "Stopped in after all the great reviews... It was good, but too much hype!  Don't go out of your way for cookies and ice cream... I thing the ones at Ghirardelli are better.", "author": "Kelly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "The perfect dessert! The brownies here are chocolatey and chewy. Paired with some strawberry ice cream and it's delicious! This is like the diddy riese of NorCal but a bit pricier. People working here are very nice!", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "It's good! The cookie gets warmed which is amazing. You can add a second scoop of ice cream for just 50 cents more! Def. do a sandwich, it's one of the best deals there. A bit overpriced in the end if you're thinking about it but it's def worth the price. Way better than Cream!!!", "author": "Nerissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Excellent ice cream place, food truck ice cream was awesome. The whole family enjoyed, possibly the best ice cream sandwich I've ever consumed! Would definitely go back next time  in San Francisco.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Line out door must mean it's good. I enjoyed just a scoop and my cookies on the side for later but my wife and kids Allred enjoyed the cookie sandwich. Found parking right in front luckily. Near china town. Had some Chinese's playing instruments on the street and it sounded incredible. Great city ambiance.", "author": "Curtis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "A must stop for cookie and ice cream lovers like me! I am so glad I spotted this while wandering around Fisherman's Wharf on the way back from Pier 39! Just off the main drag and around 3:30, there was no line so I could easily take in the amazing menu. I got the M&M cookie with their special Bear Batter ice cream. The cookie was fresh and soft and the ice cream was delicious (and thankfully didn't turn my tongue blue!) I only topped it with sprinkles for ease of eating like a sandwich. My husband had snickerdoodle cookies with cookies and cream ice cream and no topping. For $5.95 it was everything I ever wanted from an ice cream sandwich! \n\nI am a big donut fan but didn't want something as substantial as the donut ice cream sandwich. However, a big thumbs up for that being an option!", "author": "Christina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "WOW! Stumbled upon this place, but glad we did. Choices, choices, and choices. We ordered one for each of us. Could have shared one, but on vacation, so what the heck. Wish I would have had them warm the cookies (pressed), but still a great desert.\n\nDefinitely needs to be a stop when in San Fran.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I got a bear bowl! This could not have been a more perfect dessert! The brownie on the bottom was warm and gooey. The ice cream on top was delicious and went perfectly with the brownie. We also got hot fudge. The staff was friendly and the outside seating area was cute and not too full.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Kudos on the fun concept and excellent execution. Basically, it's a \"choose your own adventure\" ice cream sandwich stand. The cookies taste very fresh, and the ice cream is rich and delicious. Choose your toppings wisely! Points for incorporating Fruity Pebbles into anything, but you honestly can't really go wrong with anything here. \n\nThe seating area can get a bit crowded with post-ice cream loiterers, but there's enough room to find a spot if you're patient.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "This place is amazing. Definitely the best Custom Ice Cream Sandwiches in San Francisco. Sam was super friendly and recommended the Mint Chip and the Rocky Road as his favorite, and boy was he right about it.", "author": "Boban V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Cute little ice cream truck right behind The Codmother fish and chips. Service was quick, And it's a cute idea to pick your cookie, pick your ice cream (all the basics) and basic toppings like sprinkles nuts whip cream etc. fun place!", "author": "Leesh P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Stumbled upon this after deciding to take my friends from out of town to Fisherman's Wharf.\n\nNot going to lie, their music playlist alone probably deserves 5 stars but alas, I got to review based off food and service. \n\nSo an ice cream cookie sandwich will run you around $5, which is the standard going price of such a treat in SF. What I love about this place VS Cream is that \n\n1. the people who run this truck are very friendly/lovely people\n2. you get a free topping, yeeee\n3. if you love cake batter ice cream, they have an awesome bear batter flavor for ya\n4. good selection of ice cream/cookies", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "This place was delicious, owner was friendly and helpful.\n\nBear Brownie Bowl with Bear Batter Ice Cream....Enough said...\n\nCards accepted", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Really cool ice cream sandwiches here. You can have a waffle sandwich, cookie sandwich, donut sandwich, or combo. I ordered a cookie donut combo with a fun fetti cookie, Bear batter ice cream, and donut. The bear batter ice cream was blue! It sure looked good but my sandwich was probably the sweetest tasting dessert I've ever had in my life.. way too much sweet for me so I would definitely order something different next time.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "A fun spot near Fisherman's Wharf to get some cute, photogenic ice cream on a hot day that's super customizable and  not outrageously priced at ~$6 per sandwich.\n\nMy friend and I shared a birthday cake cookie with bear batter ice cream and rainbow sprinkles, and it was yummy!\n\nThe place is a food truck so we grabbed some to keep us busy while waiting for the street car across the street.", "author": "Tammy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Great custom ice cream sandwiches!\nCame here because of the great reviews and was not disappointed!\nThe birthday cake ice cream with frutti pebbles was the best!", "author": "Mayra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "I love ice cream, I love cookies, yet I've always hated ice cream sandwiches. All the places I've tried them at never seem to get it right. But...The Baked Bear has made a believer out of me. \n\nWe ordered two sandwiches, one with chocolate chip cookies and one with funfetti cookies. The cookies here are absolutely fantastic. Crunchy in the right spots around the edges, soft and chewy on the inside. They weren't super sweet and the flavors were spot on. They also don't get soggy or fall apart even though they are packed with lots of ice cream.\n\nThe bear batter ice cream is my favorite. I wish I could buy it in stores. They didn't have all the toppings available the day I went, but the clerk suggested fruity pebbles and it was actually a great combo. Props for knowing your product well!", "author": "Jocelyn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-30", "description": "Everything looked amazing (the hubby got cookies and cream cookies, cookies and cream ice cream and Oreos), but the price is pretty steep... $7 for an ice cream sandwich is too rich for my blood.", "author": "Carlee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "In my opinion, this is the best ice cream I ever had in the bay area. I ordered a cookie sandwich with ice cream. I got the red velvet cookies with baked bear ice cream. The cookie was okay, it was topped with white icing and was not really the best cookie I tasted. However, I did like the texture of the cookie. The cookie's texture was very soft. The ice cream however, was absolutely delicious. It was the best ice cream I ever had in the bay area. I got the baked bear ice cream. It is made out of birthday cake ice cream mixed with blue food coloring and brownie bits. The ice cream wasn't too overly sweet and had a unique ( I cannot find this type of flavor around San Jose) and delicious flavor. I topped the ice cream with fruity pebbles and the fruity pebbles went well with baked bear flavor and really helped make the flavor more flavorful. My only complaint was that I was disappointed with the coloring of the red velvet cookie. It was almost as dark a chocolate coloring. It didn't look anywhere near red like the some old pictures posted here. Overall, I definitely will be back but only for the ice cream.", "author": "Criesiu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "What can I say?  Fresh baked cookies, brownies, and donuts.  Homemade ice cream, all the toppings...", "author": "Justin Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Had the chocolate chip cookie with cookie dough ice cream. All together it was hella good.", "author": "Douglas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "OMGGGGGGGG!!!! Cookies and ice cream til the death of me! Baked bear let's you pick any 2 cookies to make your very own custom ice cream sandwich. I got red velvet and birthday cake cookies with funfetti ice cream and fruity pebbles and sprinkles toppings. So freakin good!", "author": "Amar P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Get the Bear Batter.  That's the only tip you need.\n\nBear Batter is cake batter w/ Oreo's and fudge.  It is sweet, smooth, and creamy.  I'm a total chocolate person so I was basically in heaven after every bite.  Gavin  wanted chocolate and Tess wanted vanilla.  This was our last stop before heading back to our hotel.  \n\n+ accepts cards \n+ fast service\n+ limited menu but w/ unlimited possibilities \n+ brownies and cookies available for ice cream sandwiches\n+ reasonable prices \n\nIf you like sweets then this place is for you.  What diet?", "author": "Tram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Seriously ice cream! I had a cone and the crew all go different ice cream sandwiches. Delicious flavors & tons of options.", "author": "Annie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "I found this place on Instagram, it was located right off Fishermans warf.  Unfortunately they were out of bear batter, I sampled it and it was delicious! I got two chocolate chip cookies with cookie dough ice cream. My extra topping was Oreo. The cookies were soft and fresh. You can also get your cookies warmed upon request! I thought this place had a good variety of cookies, ice cream and toppings. You can mix and match everything. You can also make your sandwich out of brownies! I really liked this place and would highly recommend it if you have a major sweet tooth!", "author": "Kelly O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Their ice cream sandwiches are so delicious! If you have a craving for dessert, it will be more than satisfied here. Their cookies are moist and chewy, and ice cream has lots of cool flavors. It will be a sugar explosion in your mouth. Love this place!", "author": "Julia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Awesome ice cream and fun custom orders! I could go to this place every day, it's super good! The service is friendly and for the amount of items on the menu-everything is great! I loved the brownies and for ice cream I'd go for Bear Batter and Salted Caramel Fudge. You can go for any combination of of top, bottom, ice cream and toppings and will not be disappointed! Defiantly stop by the Baked Bear if you are in the area.", "author": "Ece K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Delicious!! A must try while in San Francisco! The brownie with the Bear Batter ice cream is a must! So good! Everything is fresh and different.", "author": "S M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "Came here with my cousins and decided to be adventurous with my taste buds. They have a variety of dessert combinations to choose from. I ended up going for their famous baked bear batter ice cream smashed between two glazed donuts. \nTell me that isn't adventurous. My cousins got their ice cream on top of a cookie. It was a cool experience & recommend that you make a stop. One time for the one time!", "author": "Krisgen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "This place had one of the best donut ice cream sandwhiches I have ever had! I really enjoyed their cookie monster ice cream! Their cookie ice cream sandwhiches are really good too! I dont think you can go wrong with any combinations", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "We just missed the chance to order late-night delivery after we discovered this place and so made a special trip on our last day in San Francisco. It was so worth it! We arrived as they were opening but they had every flavor of cookie and ice cream ready to go.\nIn addition to the novelty of getting to combine everything you're craving into one sandwich or sundae, this is seriously some great ice cream! My choice was the salted caramel fudge ice cream in a sandwich with a cookie top and brownie bottom. Two friends got sandwiches with the Bear Batter ice cream and really liked theirs as well.\nService was quick and the owner was so kind, a really sweet lady. I would definitely take the chance to go back again, or order that delivery when an ice cream craving strikes.", "author": "Maya L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "A lot of choices and friendly staff. They were out of a few cookies when I was there but they made good suggestions for what was available. Arrive hungry!", "author": "Monica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "The fact that this place lets you customize your own ice cream cookie sandwich is why I'm giving them 5 stars.\n\nI got the chocolate chip cookie, cookies & cream ice cream, and fruity pebbles topping and it was delicious. I would definitely recommend this to anyone looking for a sweet treat.\n\nPros:\n- customizable\n- not overpriced\n- quick\n\nCons:\n- melts fast\n- big portion (this can also be a pro)\n- too many options to choose from (note the sarcasm)", "author": "Gloria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "This place is a SUGAR HEAVEN! \nThe cookie of the month was cinnamon bun. So we got that cookie with their bear batter ice cream (blue cake batter fudge and brownie) topped with sprinkles, fruity pebbles and Oreo crumbs! Needless to say it was amazing, yes it was overly sweet but we do you expect with an ice cream cookie sandwich?! Go sugar overload or go home!\n$5.95 + 50 cents per topping\n\nMuch love,\nCanadian tourist that really loves sweets", "author": "Sally W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Great ice cream. The hot chocolate and the sundaes were delicious. I would recommend this to anyone who loves ice cream, brownies, cookies, or other sweets.", "author": "TropicalNights .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "The coffee ice cream was top notch!  The cookies were good, but they were on the small and thin side.  Toppings are 50 cents each.  Ice cream sandwich is 5.95.  Seems pricey to me.\n\nThis place is reminiscent of Cream and Didi Reese in LA.  I feel like both of those place are significantly less expensive.\n\nIf you want to treat yourself or your sweetie, this is not a bad place to stop, especially if you are doing the tourist thing in the area.\n\nI would suggest they have larger cookies if they want to try to justify this price.  The alternative is drop the price to something more reasonable.  Maybe there are different prices for different locations and this one was just up there b/c it is right in the middle of tourist town.", "author": "Ty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Don't get me wrong, Baked Bear is super sweet and not good to eat all the time, but HOLY CRAP, when you want to treat yourself, go treat yoself!! \n\nBaked Bear is a great play off your regular cookie sandwhich, you can get a brownie bowl or a donut ice cream sandwhich. HOMAIGHADDD....  I highly suggest the cookie ice cream sandwich, no..the bear bowl, wait no no the freaking donut stuffed with their bear batter ice cream (cake batter with chocolate chip pieces). So many options to your sweet tooth's desire. Who needs a gym membership when you can buy happiness for about $3.50-5??? \n\nBut in all reality, Baked Bear is great every once in a while and pretty awesome for pictures, but there was nothing very special about it. For about 5 dollars for the equivalent of a sugar heart attack, it is just alright. If you haven't tried it, it is worth trying though! There is also another location in North Beach which is less touristy and is indoor, but the quality at this one is so much better and the staff is nicer.", "author": "Eric Joseph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "While wandering San Francisco for a few hours, I decided to indulge in a chocolate chip cookie with salted caramel fudge ice cream and mini chocolate chips. It was delicious! The staff was very friendly and the seating area was clean and had areas to sit in the shade. Would return!", "author": "Monica Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Loved it! You can't go wrong with custom ice cream sandwiches! If you are in the area, stop by and give them a try...super yummy!", "author": "Felicia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Sooooooooo goood! Bear batter ice cream, with chocolate chip cookie/funfetti cookie and vanilla ice cream.", "author": "Brady C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "We stopped by randomly and I was super impressed.  I had a bear bowl w/brownie and my husband had one as well. It was so good we demolished it before a picture could even be taken.", "author": "Tianna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Stopped by because my daughter found this place on yelp. When I walked up to it, I was caught off guard because it was a food truck.  I didn't think treats were fresh but boy was I wrong. The food truck has ovens and their baked goods are absolutely fresh. I ordered a brownie that was so soft and yummy. My daughter ordered their ice cream stuffed doughnut.  You won't be disappointed that's all I can say!", "author": "Monica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "Really yummy and it's super customizable. It's both yummy and affordable, definitely a place I'd come back to more than once if I lived in SF.", "author": "Denisa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "The BEST Custom Ice Cream sandwich you can get near Fisherman's Wharf!\n\nMy girlfriend found this awesome place on yelp and wanted to treat me for my 25th Birthday. It's a small shop that has the biggest heart! Not only do they have cookie ice cream sandwiches, they also have brownie sandwiches, and donut sandwiches! Say whaaaaat!?!?! They even have bowls in case you don't want it to be so messy.\n\nWhen they say custom, they mean it. They have lots of different freshly baked cookies to choose from like red velvet, smores, choc chip, bday cake, etc. Then you choose your ice cream center. We both got the bear batter (cake batter with brownies and fudge?) which she loaded with like 2-3 scoops! Then you can cover it with a wide variety of toppings. I got half of mine covered with fruity pebbles and then oreo bits. Not only was the taste surprisingly amazing, it made for awesome snaps and IG pics haha!\n\nEmma was so fantastic and sweet (like her desserts hehe!) She was so kind as to treat and greet me on my birthday! The price is pretty good considering how stacked it is when you get it. If you're ever near the pier craving something adventurously sweet, I'd highly recommend the Baked Bear. It's pretty cool!", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "This place was great. They have an excellent cookie to ice cream ratio. If you like to mix things up, they give you the option to pick a different top and bottom cookie. You can also also warm up the cookies, which I recommend. Try the white macadamia nut cookies with strawberry!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-20", "description": "I will give them 3.5 stars but since they don't have half stars 3 it is. I so badly wanted to be in love with this place but I wasn't completely wowed. I came across The Baked Bear on Utrip and researched them. Once looking them up I just had to try their ice cream sandwiches because they totally looked amazing!! Well as they say looks can be deceiving. \n\nMy husband and I got here and walked up to the window to order. Once I got to the window I noticed a whole lot of under baked cookies in the window. We all like a \"slightly\" under baked cookie every now and then. However, one that the entire center is undone and looks greasy except a thin line around the edge is a bit weird. I looked at the Red Velvet one because that was what I was going to get that it looked ok. The Red Velvet cookie had a glaze drizzled over the top. I ordered the Red Velvet Cookie paired with Cookies & Cream Ice Cream. My husband ordered a Brownie Sandwich paired with plain Vanilla Ice Cream. \n\nLet's start with my husband's because his was the better of the two. His was actually the bomb dot comb. Well the brownie was. The brownies were cooked perfectly and had chocolate chips in them to add he perfect crunch. One of the best brownies I have had. The ice cream they serve is not anything special by any means. It tasted like they went to the store and bought carton ice cream. The vanilla ice cream was just nice to have with the brownie but it didn't taste like anything to rave about. Now for my ice cream sandwich. The Red Velvet didn't taste like anything. It almost tasted like the brownie in the sense of chocolate flavor but it did not taste like Red Velvet. It tasted like a chocolate cookie. Not what I was looking for. It also was a tad under baked which wasn't the worse thing but was like meh..ok. My Cookies & Cream Ice Cream too tasted like store bought ice cream. You couldn't even hardly taste any Oreo chunks. Like where's the crunch? Come on! So I didn't even eat mine. I took a few small bits and ate some of the ice cream. I just helped my husband finish his. : p\n\nOverall, maybe this was a bad day or I went to a location that just doesn't produce as well. I think I simply give them 3.5 stars for the brownie ALONE. Everything else was nothing to talk about including the ice cream. Considering they aren't a brownie spot is why they aren't getting more stars because I have to rate them based off of what they are selling as a whole. I'm sorry, but as a whole I just wasn't super impressed. Maybe whoever is reading this will have better luck or just order the brownie.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "I personally don't like cookies and ice cream together, but today I decided to give it a try. I went for the super blue ice cream(it was too pretty to skip out). Bear batter is cake batter flavored ice cream with fudge pieces. The cookie I got for the sandwich was snickerdoodle, also not a fan of. The total came out to be $6.45 which isn't bad for the size of the sandwich. Gave it a try and it was definitely not my cup of tea. It's way too sweet and I couldn't really taste the fruity pebbles bc of how sweet the ice cream was. You can also get it with a donut bun or brownie as well as heating it up. They have tables too so you don't have to stand while eating your sandwich. This place is a great alternative to LA's Afters Ice Cream where they're famous for their donut ice cream buns.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "I have no words for this place. Everything is amazing. It's done so well, isn't messy, taste is on point... just go. Please go. You'll see what I mean. I came here on my birthday and I got a birthday cake ice cream (obv) donut sandwich with sprinkles. It was everything I had hoped it would be and I didn't even miss having actual birthday cake (this says a lot considering I go insane for cake). I will 100% come back here to try more amazing flavor combinations (bear batter on chocolate chip cookies, I'm looking at you). Do yourself a favor and go try it. You won't regret it!", "author": "Pooja C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Oh MAN! The Baked Bear is a little ice cream food truck located at the Fisherman's Wharf in SF - a cold location to eat your cold ice cream :) There is some outdoor seating so passerby's can see you scarf down the deliciousness, but just remember to bring a sweater! \n\nI took my boyfriend here for his birthday for some dessert. We came here on a Sunday night around 6:30 PM. The line didn't look too ridiculous, but it actually turned out to be very slow because there was only one person working. That was okay with us! We waited patiently, which allowed us ample time to think about our creations. \n\nThe Baked Bear has 4 types of ice cream sandwiches: \n1) cookie, \n2) brownie, \n3) cookie AND brownie, \n4) DONUT. \nThey also offer Bear Bowls (cookie in a bowl with ice cream on top). You can choose from a variety of ice creams, but they have a unique flavor named \"Bear Batter\" which is blue birthday cake, fudge, and brownie bits!!!! YES!! \n\nWe waited in line for a while and when it was finally our turn, I learned why. Emma, the sole worker providing us with ice cream deliciousness, was treating each and every person with great customer service. She thanked us for waiting, listened attentively while my boyfriend said what he wanted, and she repeated it back to us. Even when my bf had a special request, she said \"Sure, of course we can do it! Why not?!\" It was then that I said it was his birthday, and she said his ice cream was going to be on the house! Emma, thank you for being so genuine and kind while there was a nonstop line outside for ice cream. You're the best! \n\nI ordered a funfetti cookie ice cream sandwich with bear batter ice cream and sprinkles. The cookie stays soft, the brownie and fudge in the ice cream were on point... Honestly it's all I've been thinking about for the past couple of days. I can't wait to go back and get that bear batter!", "author": "Lena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Leave room for a Baked Bear sandwich when opting to eat in Fisherman's Wharf; you won't be sorry unless you're on some fitness challenge. Though we had to wait for about 10 minutes, our sandwiches were swiftly prepared and worth the wait.  I opted for a high-calorie sugar rush courtesy of the following combo: Cookies and Cream cookies, Birthday Cake batter, dipped in Fruity Pebbles.  My cookies were thin but Oreo yummy.  My daughter chose Oatmeal Cinnamon(she found them too spicy) with Vanilla covered in sprinkles.  She abandoned the cookies and finished all of her ice cream.  Thanks Yelp fam for steering my mom-daughter Labor Day outing to foodie heaven!\nReview#550!", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "I've been wanting to try The Baked Bear for a while. We ordered a donut sandwich with the baked bear ice cream, rolled in rainbow sprinkles. YUM! The donut was super soft. Poor girl was by herself, so it did take a while to get our order in. But she was pretty quick to make it. \nI asked if the donut is glazed and she said yes. Apparently the donut is plain and once she prepares the ice cream inside, rolls it in sprinkles, she glazed it herself by drizzling the glaze on top. I would've preferred to start off with a full glazed donut all around but It was still very good. I would definitely come back for an ice cream cookie sandwich next time I'm in the neighborhood!", "author": "Nari M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "I was craving donuts and ice cream and luckily my boyfriend found this place! \n\nCame here on a Saturday night around 9pm and it was pretty much empty. I got a donut cookies and cream ice cream sandwich topped with Oreo and the bf got a donut birthday cake topped with fruity pebbles. \n\nThey have a wide selection of cookies also and all their ice cream flavors sound bomb! Will definitely be back.", "author": "Shana N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Sooo goood! Everything was perfect! Flavorful and fast! Love the birthday cake batter!", "author": "GiGi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "Perfect little ice cream spot near fisherman's wharf with great ice creams and toppings, but also ice cream sandwiches and really yummy cookie and brownie bowls. Had a brownie bowl with chocolate and was so decadent.\n\nThe owner is super nice and opened up in a row where a bunch of food trucks / BBQ places generally are, but seems to be doing really well.\n\nNice patio seating. Definitely stop by.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "The Baked Bear is my new personal favorite ice cream spot in the fisherman's wharf area. The customization makes it fun and their ice cream and cookies are high quality.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Now we're talking. Folks I've had countless memorable ice cream experiences around the world, but just about every time I I find some ice cream that I really love I find myself wishing I could enjoy it stuffed between two quality cookies. The Baked Bear has capitalized on that concept and upped it even further with excellent results. \n\nStar 1: How were the service and atmosphere?\n\nLike the other spots in the area, The Baked Bear is a stationary food truck, but they've added seating and have built up a charming atmosphere by way of signage and friendly folks behind the counter. Star Granted. \n\nStar 2: How were the portions relative to the cost?\n\nGiven that with an ice cream sandwich you're really getting two completely separate items combined I understand the price premium that's in play; and I wasn't devastated by the $5.50 price tag on my doughnut ice cream sandwich, which is one of the most expensive items on the menu. Star Granted. \n\nStars 3 and 4: How was the food?\n\nI mean what can you say really? The degree of customization, rotating flavors of ice cream and cookies alike all brought together by the fact that it's all homemade is an unbelievable combination, and if you don't like what you ordered it's likely your own fault.\n\nWas this the best donut I've had in my life or the best vanilla ice cream? It wasn't, but the fact that I had countless options with which to construct my favorite dessert combination was in and of itself rewarding. Single Star Granted. \n\nStar 5: Would you eat here every day if you could?\n\nThe Baked Bear has finally come together and capitalized on the best dessert trend in the game, and their degree of customization is something that would bring me back daily. Star Granted.", "author": "Paul V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Perfect place to satisfy your sweet cravings! We got the donut sandwich with their signature bear batter ice cream topped with fruity pebbles and Oreo crumbs and it was sooo good. Our treat came out to almost being $6-$7 which is pretty pricey but definitely worth it.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "A must stop if your nearby.  Parking sucks but that's city life!  Kiddos were extremely happy!!  I mean what kiddo doesn't like fruity pebbles.  Lol. Everything looks really tempting and owners were friendly.  Sugar Overload!!  We will be back", "author": "Lissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "Thanks to the Cream franchise, ice cream sandwiches are currently the avant-garde snack. \n\nThe Baked Bear Company has opened and replaced the Codmother fish and chips, which moved around the corner and replaced another food site. \n\nWhen I stepped up to the truck, I was greeted by the friendly people. Looking at the menu and for my ice cream sandwich, I get to choose between six different cookies, twelve choices of ice cream and an optional topping(s). \n\nBut I decided to bypass all those steps, I decided to get the ice cream sandwich of the month posted on the menu, which is the Salted Caramel sandwich. For $4.50, I get a scoop of salted caramel ice cream sandwiched in a pair of warm and gooey salted caramel cookie. Initially I thought this was another one of my abnormal eats. But the ice cream had a great caramel taste and gooey caramel sauce was strong enough to bond against the wrapping paper. The price is slightly higher than Cream's. But in return, we get friendlier and refined service here. \n\nAs some of you have read from my \"Quick Tip\", if you live in North Beach, you get 10% off your bill. A little helps. \n\nThe Baked Bear Company has only been opened for a few months and is ready for the tourists in the summertime. I would definitely be committed to be a regular here too.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "This ice cream sandwich and cookie shop appeared conveniently after I had my dinner of clam chowder and lobster roll on Fisherman's Dwarf. I was looking around and craved for something sweet and noticed this shop. It's a great concept and very indulging. My visit to San Francisco during this time was during July 4 and it was pretty cold. I didn't care though since I'm a huge fan of ice cream and warm cookies combo. I liked how they let you customize your own instead of just offering set premade options. \nYou start with a choice of your favorite cookie/donut, ice cream ,toppings and the option to warm the cookies. There is a choice to mix and match your cookie for the top/bottom. I went with 2 white macadamia cookies warmed and rocky road ice cream with no toppings. I loved every bite although I had to share since it was getting too sweet for me to finish the whole ice cream sandwich. The prices are fair, expect to spend about $6 average for the cookie sandwiches and $4.50 starting for scoops. You can also order just the cookies which is a nice option to have as well. I'll definitely be back during my next trip to San Francisco.", "author": "Tran N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "This place does custom ice cream sandwiches - much like Cream, but taken to the next level. The premise: Why should ice cream sandwiches be limited to cookies, when there are so many delicious baked goods in the world? That's just discrimination. \n\nAt the Baked Bear, you can have your ice cream sandwich with COOKIES (tonight's selection: chocolate chip, funfetti, red velvet, and white chocolate macadamia), BROWNIES, freshly-glazed DONUTS, OR ANY COMBINATION THEREOF. Whaaaaaaattttt?! Amazing. \n\nThey have a bunch of different flavors of ice cream, as well as \"toppings\" (side-ings?) that they'll roll your sandwich in. Or you can get it as a sundae, in a brownie bowl. Good luck deciding.\n\nI got a combo sandwich, with salted caramel fudge ice cream between a brownie and a donut, rolled in fruity pebbles. Let me repeat that: tonight, I ate a thing that was part brownie, part ice cream, part donut, and part cartoon-inspired dry cereal. Using my hands. I love America.\n\nAnd the thing was super well-constructed. I was pleasantly surprised; I was sure it would be a mess and fall apart/drip everywhere, but it stayed all together!\n\nHowever, there were some service-related hiccups. First of all, I'm pretty sure they put the wrong ice cream in my sandwich. It was nonetheless delicious, so I ate it anyway, but still. Also, the lady who took my friend's order just disappeared and never made his sandwich, so after waiting around for a while and then realizing she had straight up disappeared, he had to butt back into line and order again. If it weren't for that, then this place would be 5 stars for sure.\n\nI'm sure I'll be back!", "author": "Liz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "I like this place better then cream. The cookies were fresh and soft. The ice cream was great as well. I had the cookie monster ice cream.", "author": "Casey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Definitely get a cookie sandwich here or your missing out! Their cookies are fresh, warm and soft- so good. They have a wide variety of cookie flavors to choose from and tasty ice cream flavors. I recommend the blue baked bear ice cream which is cake batter, brownies and fudge. Baked Bear ice cream sandwiches are the best I've had compared to similar places in the bay.", "author": "Jenine G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "Such a cute place. Cookies were not soft like I expected, they had a little crunch to them which I liked. Great cookie options. I've cream was delicious. Quite a messy snack but worth it.", "author": "Cerise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "I was ecstatic to come across this ice cream truck in SF a day after Nique F. posted her mouthwatering bear bowl confections! Located off Beach and Jones streets, it's right next to Carmel's Pizza, which I also had the pleasure of trying. \n\nMy cousin and her friends had a difficult time choosing what to order, myself included! The workers were super nice and patient, offering us cookie samples of flavor of the month: strawberry cheesecake. So good!! It's pink, has a light dusting of pink sugar sprinkles, and tastes like the cream cheese batter is in the cookie itself. I almost thought it would have CC chunks. What sets their cookies apart from franchised competitors like CREAM is how soft and chewy they are. I had one the following day and it still melted in my mouth. Ahhh. Eventually settling for a brownie bear bowl with a humongous scoop of mint chip ice cream, I opted for hot fudge topping, fifty cents extra. The brownie got too indulgent for my taste, so much ganache at the end. \n\nYou can ask for two ice cream flavors in the bowl or in a sandwich. They put the latter in a paper tray and you can use a fork to eat it instead of resulting in sticky fingers. Cookie/brownie/doughnuts can be mix and matched for sandwiches. One in our group ordered the doughnut sandwich with icing drizzled on top, when I looked back it was gone! Must've been that good, and it was shared between two people ;-)\n\nThey accept card! Ample amount of seating for at least ten. Go get your ice cream & cookies-- what are you waiting for?!", "author": "Kristine F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-02", "description": "Icecream alone was okay. I got rockyroad and mint. Feel like the flavor lacked. I'll have to try the cookies next time. My friend got the cookies and said it was good. It's a cute place and enjoyed getting the chance to sit down and relax while eating.", "author": "Cathy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Every part of my Baked Bear experience was great. The lady in the truck was so nice. The ordering was comprehensive. The ice cream was unique and tasty. The cookies were cooked to perfection.  \n\nWhile I did get basic chocolate chip cookies, they were just the right amount of soft. I went out on a limb to get the bear batter blue cake batter ice cream. It was the right choice and truly a flavor that I have never had before.", "author": "Joey T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "Tried The Baked Bear in Fishermen's Wharf area next to Carmel Pizza on Jones St.  I went on the Grand Opening Day and it was FREE, regular price for a ice cream sandwich is $3.95!\n\nI had to wait maybe 20-30 minutes in the hot sun, guy gave us some samples of their cookies. When I finally got to the window I picked strawberry shortcake cookie, coffee ice cream, and a chocolate chip cookie.  It tasted a tiny bit better than CREAM which is similar.  Cookies are a little better, ice cream average.\n\nGood for the tourist that visit the area.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "This place is fantastic! Lots of cookie and ice cream flavors to choose from and the service was fast and friendly. I had chocolate ice cream with chocolate chip cookies and it was almost more than I can handle. My daughter could not finish her dessert. If you're looking for a way to satisfy your sweet tooth, this is a must-do!", "author": "Chip A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "A 21 year old, 13 year old and 8 year old give this the max stars!  Two bear bowls with freshly baked warm and delicious brownie on the bottom topped with a generous scoop of ice cream.  Blue bear batter ice cream was surprisingly delicious!", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Really great place! Great customer service, patient, & not overly sweet! i finished my double double ice cream sandwich and still wanted more.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Overall, a pretty good ice cream sandwich place. I mean, the cookies were fresh and the ice cream was creamy and had the perfect consistency. I would recommend this place if you're in the area", "author": "Jade L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "I would give this place 76 stars if I could!! My siblings and I all got different ice cream sandwiches and they were all devoured rapidly. I posted some of the pictures so you can check them out. The baked bear is open late and is so much fun for mild san fran nights by the pacific! I highly recommend this place!  If you are lactose intolerant, then I don't suggest it but just know that you are missing out .", "author": "Brendan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-17", "description": "I'm a sucker for desserts so when I saw that this was opening I had to stop by and see how it was. I think I'm between a 3-3.5 for this place. \n\nI customized my own cookie ice cream sandwich and ended up choosing red velvet cookies with birthday cake ice cream . The combination was YUMMY highly due to the ice cream more so than the cookie. The red velvet cookie was not really that great and I would not recommend it nor get it again. It did not really taste like red velvet and I did not enjoy the white frosting? like part that was on top of the cookie. The birthday cake ice cream on the other hand was AMAZING. The cookie I would give a 1.5-2/5 and ice cream a 5/5. \n\nI also tried out a few of the other cookie flavors. Overall the cookies are all incredibly soft which is just how I like my cookies and they are not overly sweet which is great.\n\nSnickerdoodle - 3/5 It tasted a little more sugar-y than cinnamon and I like my snickerdoodles to have more of a cinnamon taste.\n\nFunfetti- 4/5 This was pretty good and what I expected from a funfetti cookie. I think this would taste amazing with the birthday cake ice cream and would love to try the combination together.\n\nCookies and Cream - 4/5 My favorite of the 4 cookies! It is not much of a strong cookies and cream taste but I really enjoyed the cookies and cream cookie the most! You cannot go wrong with oreos and cookies.\n\nOverall, this is a pretty good dessert area around the wharf but I think some of the items are hit and misses. I love the idea and I love how you can customize your own sandwiches by choosing your own cookie, ice cream and toppings but I was not really wow-ed by any of the items other than the ice cream.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "The most original ice cream store I've ever been to. The bowl with the brownie and coffee ice cream. Pure heaven!!", "author": "Sandra B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-18", "description": "Nothing beats consuming one thousand calories of creamy, sugary goodness after burning a hundred calories walking around the wharf. \n\nExcept...\n\nConsuming an additional thousand calories from the fantastic fish and chips stand around the corner ;)", "author": "Ben G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-21", "description": "My fiance liked the taste of his ice cream sandwich, but it was falling apart as he ate it and he had to eat each part seperately. The price and distance from the Pier was ok.", "author": "Lani M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "The old lady was unpleasant. Lol\nIce cream place should be a happy place to be but she was completely mean and unhappy.", "author": "Pussiekunt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "The cookie sandwiches were delicious and the lady serving the sandwiches was super nice so it was a win win. It is a small outdoor seating venue but overall It was clean and they were playing good music. \n\nThe lady even gave us some free cookies for the road as we left. If I am back in San Francisco I will definitely be back!", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Cool place to stop while you're in the warf best cookies best ice cream and it's fresh unlike other places that will serve you freezer burned ice cream yuck!!! Everything is fresh the cookies especially I usually get either or both cookies or cookies and ice cream it's worth the trip from the other side of town for these fresh tasty cookies and ice cream cookie sandwiches!!!", "author": "Rolin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Hit this place up yesterday in North Beach... A M A Z I N G!!! The owner was so sweet and helpful. She served us and seemed to have such a joy for her work and business. Was refreshing to see. \nI had the coffee Ice Cream with the oatmeal cookie and choc chip... was soooo good. The owner mentioned her fav combo... and that she eats it every other day for lunch:) Will def be going back for more.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-11", "description": "I had really high hopes for this place but was disappointed last night. The cookies were hard and the ice cream was good at best. We asked for It to be heated up and it was not. Good concept bad execution.", "author": "Billy Alyssa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Emma is an absolute sweetheart. I would give her 10 stars!!! Everyone should come here for the delicious and unique, customizable ice cream creations. The bear batter (blue cake batter + brownies + fudge is highly recommended and amazing. Show Emma some love! She will give you 110% hospitality and nothing less. \n\nIt was an unforgettable experience and will draw me back every time I'm in SF. A true gem!\n\nThanks for putting a smile on our faces!!!", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "I had the soy chocolate chip on a chocolate chip and macadamia cookie with sliced almonds. Just your average ice cream sandwich. Customer service is not the best. Was not greeted nor saw any smiles from employees.", "author": "Érica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "My kids LOVED this place. Our first desert in America! All my kids could say os why isnt this in Australia. Great deserts and good value.", "author": "Adam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Simply awesome. And incredibly nice staff! We had crazy kids with crazy orders and they never got agitated and consistently served us with a smile. Great place!", "author": "Neetu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "I got the donut sandwich with strawberry cheesecake as my ice cream and caramel as my topping. It was very good. The donut was so moist and soft and the ice cream was absolutely delicious. Overall the donut sandwich was pleasing to not only my taste buds, but also to my eyes.\n\nI came here on a Saturday and it was very difficult to look for parking. There are plenty of stores and restaurants in the neighborhood so there are always people taking up parking spots. I recommend going to parking garage nearby. Look closely at the price because each parking garage has its own price.", "author": "Kristie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "So yummy!! If you're in the area you should definitely check it out. There are a ton of choices for toppings, cookie flavor, ice cream flavor.", "author": "Madisyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "OMG this place for being so small was so good.They have home made cookies .I had a hot fudge Sunday and my husband had cookie ice cream sandwich. MMM", "author": "Laura G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Omg I don't even know where to begin...this place puts CREAM to shame. Sorry but cream went way downhill with their quality which opted me to try this place out. Baked Bear has their own fresh cookies, donuts, ice cream, that all melts in your mouth! Favorite ice cream is the bear batter... you have to get it! Also, the donuts are always so soft with the ice cream they don't freeze or harden. Wish I could eat their ice cream as much as I think about it :/ definitely a sweet treat I must indulge in every few months :)", "author": "Carissa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Don't be deterred by the line! This place is totally worth the wait. The donut sandwich is life changing. ALWAYS get the blue glaze on anything you get. Went two days in a row and am thankful I don't live near one or else I would come everyday. If you are in San Francisco, definitely stop here for some amazing dessert.", "author": "Lucy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "When I saw the wonderful reviews at this place, I totally wanted to love it. I love ice cream sandwiches, but I think I've been spoiled by being able to make my own ice cream, cookies, and brownies. Since the boy and I were sharing, I decided we would go with the combo - cookie, brownie and ice cream. I decided on the s'more cookie and the cookies and cream ice cream. Since there was an option to get it hot pressed, we decided to go with that as well. \n\nWhen I was finally able to order, after waiting for a while (a lot longer than expected with the number of people in line), it was beautifully presented to us. I thought the brownie and the cookie would be nicely warm with slightly melted ice cream to make it into a somewhat sundae type dessert...and that's definitely not what I got. The brownie and cookies were lukewarm at best. The ice cream was super hard as well so it made the entire thing kind of hard to eat. \n\nOverall, it was an a-ok experience and not something as amazing as I thought it was going to be. \n\nProtip: definitely go with the combo. Best of both brownie and cookie worlds.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Baked Bear is a hidden gem in North Beach. My sisters and mom came to visit me in SF and searched high and low for the ultimate sweet creation. Ema (the owner) is a peach. She was so patient and kind while we designed our creations. There are so many options! She smiled the whole time while giggle and mixed and matched cookies, brownies, and ice creams. Any sandwhich can also be pressed and warmed for maximum ooey gooey yumminess. My mom and Ema chatted for a while and she even sent us home with some delicious cookies. She really is such a sweetheart. Happy to support a local business like this. Everyone should stop in!", "author": "Alexandria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "While the name of this awesome place sounds like someone from the Castro went to the Haight and had a good time, this place in its entirety is no joke!\n\nFrom the freshness, selection, and different combinations of their ice creams, cookies, and toppings they all offer here, you'll be overwhelmed contemplating what you'll want to get when you first approach their menu panel!\n\nJust off to the side of crowded Jefferson St. in the Wharf, we were on the hunt to finally find this place on a beautiful sunny afternoon, and luckily it wasn't crowded at all! When we got there, there were plenty of outdoor seating and families just having a fun time admiring how massive their sandwiches were! \n\nI ended up wanting their Salted Caramel Fuge ice cream with their Red Velvet Cookie while my friend wanted their Bear Batter on a brownie. They were both out of those flavors however, so we settled on Birthday Cake, which was kind of a bummer, but understandable since we came late and they're pretty popular. Lesson learned!\n\nOverall, their service was great and the affordable sandwiches take no time to make, but be prepared to grab some napkins and utensils if you have to! Perfect for strolling through the Wharf with, or just hanging around in their outdoor seating! :)", "author": "Kyrie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "I took my kids here on our last night in the city.   These were so yummy!!!!   Definitely a must for your sweet tooth!", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "OMG... Becky, look at that ice cream.  It's so big.  It looks like killer ice cream with baked good....\n\nLol- just go.", "author": "Deano G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Heard about this through a friend and I was more than tempted to go because of the pretty foods. Walked in on a Monday afternoon with a friend, and it wasn't packed. Score! After looking at all the combinations of ice cream sandwich (doughnut^2, doughnut + cookie, cookie + brownie...) I settled (okay it was a really hard choice) on a doughnut sandwich with birthday cake flavored ice cream, and fruity pebbles. It was definitely a cheat day but sooooo worth it. The doughnut was doughy and gooey and the ice cream was perfect. I had to eat it with a spoon because of how big it was. Overall, a fantastic experience and a perfect afternoon treat.", "author": "Rutuja R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Brownie \n+ cookie \n+ ice cream \n+ San Francisco \n+ Heath bar \n+ hot fudge \n+ ample outdoor seating \n+ affordable \n_______________________________\nMary is in heaven \n\nSeriously, get over there and try this shiz. Unlike any concept I've ever seen! But I am a Midwest gal, so all you west coasters probably are just on to something..", "author": "Mary G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Loved the ice cream over the warm chocolate chip cookie base. Fantastic concept and well executed. This is great if you're craving something sweet as a snack or dessert!", "author": "Sana H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "Not entirely sure what all the hype is about.. the line was long and slow, the ice cream was extremely sweet and the cookies weren't even served warm after they were \"heated\". Tried to get the bear bowl with cookies and they said they don't have any.. but cookies were everywhere. They said I could do half brownie and half cookie which made it some other combo they had. If I had the ingredients I sure wouldn't tell a customer no especially after waiting in the cold in a long line. Those are the customers that keep you in business. Would I go back? Probably if the line wasn't long and I was craving cheap sweets, but I wouldn't go out of my way especially if I passed a Crepe place along the way.", "author": "Marco R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Truly amazing dessert spot!  Loved the donut, loved the ice cream, loved the cookies.  I sampled a few flavors before committing (ice cream is like dating lol), but the owner didn't mind at all.  To the contrary, she encouraged me to try more.  I'm usually all about chocolate, but the birthday cake ice cream was extraordinary.  Like, omg ridiculously delicious.  Coffee ice cream gets honorable mention.  Overall, everything was fantastic!  Hope they expand into LA.  :)", "author": "Jesstine G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "I know many people would look over my review however, this place can get too sweet. I love their ice cream, it was really worth it. But being paired with the ice cream makes it really unbearable. My boyfriend who has the biggest sweet tooth is completely in love with this place but I really don't care much for the donut ice cream. I wish the donut was softer and less sweet, it was compliment the ice cream a little more. Maybe even different donut would work with their ice cream. Hopefully, a salted caramel donut with sea salt vanilla ice cream with chocolate chips would be made. Or a strange combo of some sort can be made for people who like a little salty and sweet in their dessert. Overall, it's good. Not my taste in ice cream but well worth it.", "author": "Ann N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "I needed to get a dessert and this happened to be walking distance from my hotel. Yay. This is a truck that opens pretty late. I had the donut ice cream sandwich with mint and oreo. Ive had a donut sandwich before at another place so I was reluctant to try this one but it was actually pretty good. I also got the funfetti cookie and cookies and cream. Why do I do this to myself...It is ok...it was my birthday and I can get fat if I want to haha", "author": "Amy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Way better than C.R.E.A.M! (South Bay peeps) Also, there was only one person running both cashier, payments, and creation. And she kept that line non-existent!", "author": "Romy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "I got a pressed donut ice cream and strawberry cheesecake ice cream it tasted phenomenal:)", "author": "Trang N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "My daughter said \"Delicious Ice Cream! Delicious Cookie\" \n\nHusband said \"I must come back for another one\" \n\nI didn't try it, but just the fact that they loved it I will give it a 5star. Father and daughter, both are big ice cream people, and they will try and enjoy anything with ice cream on it. They had the the bear bowl and the doughnut sandwich. Just by the looks of it, it was Delicious!", "author": "Julie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "This place was incredible!!! After taking in the sites of the city, stopped by for a quick dessert based off reviews and me and my husband were WOWED! The warm moist cookie with the delish ice cream was AMAZEBALLS!!! I had the white chocolate macadamia cookie with the caramel ice cream and am drooling over it as type!", "author": "Nhu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Unbelievable!!! A must eat! The cookies were soft and warm and the ice cream was amazing!", "author": "Kat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Sweet little thing! I love brownie , I love ice cream , prefect match, especially they warm  up my brownie ice cream sandwich ! Simple five star  for me !!!", "author": "Yan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Fatty's Paradise. I mean, I still see this place in my dreams. I still taste the sweet heavenly goodness on my tongue. I still feel the fat on my ass. I don't even care, either. \n\nThe woman running this little (permanent??) food truck is a gem. She was so sweet and did me up a right diabetic-coma-inducing delicacy. \n\nWhat I like most about this place is that you can choose your gluttony off a list of all the things that are good in this life: fresh baked cookies, premium ice cream, and endless sugary toppings. \n\nI picked Funfetti cookies, cake batter ice cream, and rainbow sprinkles, because I'm a really immature 12-year-old stuck inside the body of an obese woman. #thestruggle\n\nFor real though, if you're at Fishermen's Wharf and tired of fish, check the Baked Bear out. You will not regret your decision. That is, unless you care about buttoning your pants.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "I saw a picture of this amazing donut ice cream sandwich w/ fruity pebbles on it. Once I got to SF I had to find it. There are 2 Baked Bear locations, but this one is close to the water so you can walk along the water and/or check out Fisherman's Wharf. I got exactly what I wanted. I got there right when they first opened so there was a small wait. Warm donut cut in half, w/ vanilla ice cream & fruity pebbles for the win. If you're not a diabetic you may be after having one of these. \nIf you're not a fan of my selection they have tons of other options. There is only outside seating. It's a small walk up shop. Imagine going up to a food truck basically. If you're sweet tooth comes a calling, answer the call!", "author": "Kevin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Five stars is well deserved! In addition to the great tasting ice cream and baked goods, the owner was very nice and grateful we visited. I let her know that I found her place on Yelp. The only reason I visited because the pictures on Yelp and the reviews. I ordered the Bear Bowl Brownie with Birthday Cake ice cream and it was awesome. The brownie was moist and had a fudge filled center. It was like butter in that it melted in my mouth. The birthday cake brownie complimented it well. My girl got the chocolate chip cookie sandwich filled with the blue bear ice cream. It was good, too.", "author": "Juan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Baked Bear... where have you been all my life?!\n\nA place where you can customize your own ice cream sandwich!  Heaven!\n\nSo many options... you can make a sandwich using cookies, brownies, donuts, or a combination of these.  There are 10+ types of cookies to choose from (chocolate chip, funfetti, snickerdoodles).  There are 10+ types of ice cream to choose from (chocolate, coffee, cookie dough).  There are 10+ toppings to choose from (fruity pebbles, oreo crumbs, caramel).  Check out the menu to get an idea of just how many possibilities there are!\n\nOverwhelmed by the choices, I ended up with a \"Bear Bowl\".  Essentially, I had a chocolate chip cookie bowl fresh out of the oven with melty chocolate paired with a scoop of cookies-and-cream ice cream topped with hot caramel and whipped cream.  O  M  G.  Sinfully good.  \n\nThe woman working the walk-up window was very nice and very helpful.  She complimented every choice I made and really talked up just how good my creation was going to be.  What was delivered did not disappoint by any means.  \n\nOpen late!  Check it out if you have an extreme sweet tooth like me!!  Some seating near the business or take it to go.  Decent prices as well!", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-08", "description": "This place has such great reviews that I thought I would love this place. Not sure if I went here at the wrong time or not (around 4 pm on a weekday), but my experience here was terrible. The cookies on my ice cream sandwich tasted old and stale. Even the cookie dough ice cream and the Heath bar toppings didn't taste great. Everything tastes old. I was very disappointed by this place.", "author": "Raheel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "I was on vacation in San Francisco for a few days. Walking around Fisherman's Wharf making me and my boyfriend crave for some desert. We found this place on yelp so we decided to give it a try. I tried their unique flavor called \"bear batter\". It taste like vanilla mix with cookies with brownie bites. Personally it's too sweet for me but if you love sweet this will be perfect for you.", "author": "Ani N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "This is such a cute shop! The woman manning the place is so so friendly. She was very patient while I decided on what I wanted.\n\nI ordered a donut sandwich with birthday cake ice cream and fruity pebbles toppings. It cost around $4-5 which isn't bad for a gourmet donut ice cream sandwich.\n\nLet me tell you, she knows how to make an instagram-able donut ice cream sandwich! I've been to other places that are messy or careless when putting together the sandwich but she made sure this one was pretty. She drizzled some icing on top in a checkered pattern and made the fruit pebbles coat the ice cream perfectly. \n\nThe donut was somewhat warm and the combination was delicious! One other gripe I have about these places is sometimes they use stale cereal but not The Baked Bear! The fruity pebbles added a great crunchy texture to the ice cream. \n\nI would come back here often if I lived in SF", "author": "Jillian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Very hard to go wrong with ice cream sandwiches, but Baked Bear really goes above and beyond. With so many options - (pick brownies, doughnuts, or cookies to sandwich your ice cream!) - there are endless combinations to try. I also really appreciate that cookie samples are offered to help you decide! Also that you can put toppings on the sides of the ice cream, I'm literally drooling thinking about it right now.", "author": "Christine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "You NEED to try this place out! It is awesome!! If you love cookies and ice cream, this is the place is for you. We had chocolate chip cookies with sea salt caramel fudge with brownie bits topping. They even warm up the cookies for you. Yummmm!!! \n\nThe place is small and is located in the Fisherman Wharf, across from the Walgreens by the Holiday Inns. It's easy to miss, but, you can't beat this! It is just sinfully good.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Cute outdoor food truck type stand in the wharf. You can select which cookies you'd like to sandwich your preference of ice cream flavor between. Toppings are at an additional charge. Around $5 each if you don't overdo the toppings. I had a sweet combo w/ birthday cake ice cream paired w/ funfetti and cookies & cream cookies that I added fruity pebbles to. The cereal gave it a nice crunch and it was fresh, not stale like some specialty donut places. \n\nIncredibly friendly staff. The lady who made our order was very nice and sweet.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "YUMMMMMM! Love the variety of options they have to make your own ice cream sandwich! We decided to not get too creative so we had what we've named the \"Breakfast Sandwich\" - Oatmeal Cinnamon Cookie with Coffee Ice Cream Sandwich. It was delicious!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "Nothing homemade ice cream or cookie wise. You could literally go to walmart and buy the premade cookie dough and great value ice cream and make what they did. Cost nearly 8 dollars for a tiny not homemade cookie and regular ice cream in a foil bowl. Tasted exactly like it too. Nothing special unfortunately. The lady running the shop was friendly and quick which was one of the redeeming things about this place. The fact you have plenty of options is also nice but like I previously stated it isn't anything special or homemade.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Overall:  4.4/5\n------------\n\nFOOD:  4.5/5\n1) Chocolate Chip Cookie Sandwich (vanilla ice cream)\nNote: What makes this place different from other places is that the cookies are freshly made and warmed to go with the ice cream sandwich. The vanilla ice cream is likewise outstanding on its own. Must try buy messy to eat, next time i will get a scoop with a warm cookie on the side\n\nSERVICE:  4/5\n\nCLEANLINESS:  3.5/5\n\nLOCATION:  5/5\n\nEXPERIENCE:  5/5\n\n-------------------\nWait time: 0 mins (weekend, afternoon)", "author": "John V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Very good ice-cream sandwiches ! \n\nI did not expected such a heavy \"sandwich\", the toppings are numerous and the people really welcoming.\n\nMaybe a bit expensive but the quality is definitely present !", "author": "Michele B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Wow. True to the reviews. This place was amazing. And it's so hot today that it was doubly awesome. We really enjoyed the salted caramel ice cream and snickerdoodle cookies. My mom got a root beer float which was basic but exactly what she wanted. And shout out to the Caramel Pizza Company next door for letting us drink a beer while the kids ate their ice cream. Such a perfect way to end our day at the air show.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Walking around the SF Wharf getting you tired and ready for a cool sweet treat?  Head on over to the Baked Bear for yummy custom ice cream sandwiches!  I got a \"combo\" (chocolate chip cookie and a brownie)...and got vanilla ice cream and rainbow sprinkles!  It was yummy!  Both the cookie and the brownie were moist & chewy but strong enough to hold up to the thick ice cream. Make sure to get napkins, though.", "author": "Mitzi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "I went on the 2nd Day of Opening and I got the Bear Batter ice cream with White Chocolate Macademia and Cookies and Cream Cookies with Chocolate Chips! It was by far one of my favorite Ice Cream Sandwiches ever.\n\nStaff was friendly, attentive, and it was 4.29 for the whole thing! Amazing experience here!", "author": "Matt D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Only thing to really say about this is it was so so good! That's sort of all you need to know.  Just go there, try it, indulge!  I did a lot of walking on my trip to SF and this was a well deserved treat!", "author": "Dawn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Home made ice cream and fresh baked cookies to customize into ice cream cookies. Very delicious and I wished I had the belly space to eat more!!", "author": "Jenni Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "A must go! The cookies were warm and soft but still held their shape, as all good cookies in an ice cream sandwich should. The ice cream was rich and creamy and had lots of cookie chunks (I had cookies and cream inside the sandwich). It was so good, I wanted to get another one and was bummed that I didn't have any room left in my stomach.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "One of my all time favourite places to go on a cheat day!! Their ice cream creations are incredible. So much selection! Highly recommend the Bear Batter ice cream (blue colour), their cookies are fantastic. I also got a brownie but i think it would have been better if they warmed it up. So if you do get a brownie sandwich ask for it to be warmed up! So delicious, will definitely be back again soon!", "author": "Ghazal S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "As my trip to San Francisco was one of my first real vacations, I did a few things wrong: I booked through a third party travel company and ended up with a middle seat away from my girlfriend on the plane; I booked a motel room on the first floor near the street; my biggest regret on this trip, however, was splitting a baked bear ice cream sandwich with my girlfriend. It was so incredibly delicious and gone way too fast.\n \nWe opted for the \"combo sandwich\" (a brownie on the bottom and a chocolate chip cookie on top; $4.25) and cookie dough ice cream with hot fudge on top. It blew me away with how delicious it was. I would, however, suggest saving 50 cents and not adding the hot fudge to your sandwich as the hot fudge was actually just chocolate syrup and didn't add much to the dish.\n\nAs well as having amazing ice cream, I also really liked Baked Bear because of the amazingly kind staff. When I later (slightly embarrassingly) returned to get the second half of the ice cream sandwich that I desired so badly (one cookies n cream ice cream scoop and one cookies n cream cookie), she only charged for the scoop of ice cream. \n\nI highly recommend going to Baked Bear if you are in the San Fran area!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Came here today right at 2pm for their grand opening, and found myself about 20th in line. Within 15-20 minutes we were up next, and service was prompt, friendly, and courteous. I thought they did a great job at running things as efficiently as possible during this busy Saturday afternoon grand opening. It got pretty crowded pretty fast, as the line grew to almost a block long. Line still moved quickly, and their famous bear came out to keep the kids entertained. From what I could see, everyone was having a great time. \n\nI ordered the strawberry cheesecake cookie with chocolate chip cookie, coffee ice cream, and fruity pebbles. I definitely wasn't disappointed! I kinda wanted to stand in line again! Can't wait to go back. My only wish is for more creative flavors and variety of cookies and ice cream. \n\nFYI I thought prices weren't too bad. Serving size is decent. I imagine this would be a great place to take the family and kids for ice cream and enjoy a nice sunny day at Fisherman's Warf.", "author": "Lizzie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "OMG - if you go to San Francisco do yourself a huge favor and eat at this place!  I got funfetti cookies, birthday cake ice cream and sprinkles.  PERFECT.  The sweet lady behind the counter was wonderful.  The cookies and ice cream were to die for.  Soooooooooo good!  She gave us a free cookie on the way out too.  Great place!!!!", "author": "Susan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "The ice cream and the cookies are ok. It may be that they were all out of most of their flavors by the end of the day when I visited.", "author": "Sonia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Good stuff!!!\nOwner was very nice and gave us multiple cookie samples prior to ordering.  Cookies were fresh and tasty. Ice cream portion was generous and tasteful.  Nice to be able to customize so many options to your own desire. Great little diamond in a rough near fishermans wharf.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "This place is out of control. So many options to make your perfect dessert. I had to go with brownie on bottom, mint chip ice cream, chocolate chip cookie in too and topped it with fudge. Definitely a spot to check out when you're looking for the ultimate sugar fix. There was a line out the door but it went quick!", "author": "Kathryn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Cookie and brownie tag team cookie's and cream ice cream. Enough said, it was delicious.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Such great Ice Cream, I wanted to come here mainly because there was a Vegan option for my girlfriend. Although it really is just ONE option, she did enjoy it a lot and that's all that mattered. I had the regular ol Cookies n Cream, and she got the Soy Chocolate Chip. Totally Recommend!", "author": "Manuel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "The cookie icecream is definitely photogenic - esp the blue color cookie dough one. Definitely recommend the red velvet cookie! Service was great too!", "author": "Abigail S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Loved the ice cream and toppings. I wish the donuts were warm though.  I'll order again from here!", "author": "Andrea V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "My wife found this place and we tried it and it was delicious.  The Lady Was So Nice And Gave US Samples and helped us decided on what to order", "author": "Jesus A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "$8 for a cookie sandwich but darn good. Flavors are unique and on point. The toppings to put around the sandwich are the cherry on top.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "The cookies and cream ice cream is my favorite. Not too sweet. The caramel fudge ice cream is sweeter but also very good. \n\nChocolate chip cookies are great.", "author": "Sam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "super yummy! I love that you can customize your own sandwich. They have really fun flavors and toppings! You can also cater through them which they do a fantastic job with!", "author": "Makenzi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "The concept of this ice cream shop is unique. It's good that you get to customize your ice cream sandwich. You may choose brownies, cookies or donuts. You may also add toppings. But in my opinion, the ice cream is too sweet.", "author": "Leanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Great outdoor environment. Ice cream sandwiches are made to order with fresh cakes cookies. Bear batter ice was really good.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "The Baked Bear is such a cute little place! We stopped here while on vacation and thought it was a really unique idea. Basically, any combination of cookies, brownies, or donuts with ice cream is possible here. The owner is also so sweet and made me a combination topping of caramel and chocolate when I couldn't decide which one I wanted. :) \n\nDefinitely a great place to curb your sweet tooth!", "author": "Sara N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "So good.  Found it hard to eat the big cookie sandwich but who cares? It's ice cream!", "author": "Steve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Very cool set up! Friendly vibe with an easy to read menu. The staff was helpful and patient with us for our first time. The dessert itself was top of the line. I ordered a cookie dough ice cream donut sandwich topped with fruity pebbles. TIP: ORDER A COOKIE AND INSERT IT INSIDE YOUR SANDWICH. Thank me later !", "author": "Zach S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "All I can say is that I will definitely be coming back! There are so many options and combinations to choose from, which will satisfy craving. It's sweet treat to end your day or during a hot summer day. I opted for the chocolate chip cookies with birthday cake ice cream and sprinkles. \nNot only was my cookie sandwich amazing, the service was exceptional as well.", "author": "Haley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "I've heard great things about Baked Bear but sadly, my expectations fell short. I got a donut sandwich with bear batter ice cream and fruity pebbles topping. The donut was a bit dry and tasted like something you could get at Safeway. The ice cream itself was good, but a bit too sweet. Paired together with an icing drizzle, the dessert was unBEARably sweet (ba dum tss).", "author": "Sharon I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "Pretty tasty! Super fresh funfetti cookies and creamy salted caramel ice cream drizzled with plenty of hot fudge made for a perfect evening stop in North Beach. I was a tiny bit disappointed by the brownie chunks which were kind of hard and not as fudge brownie-ish as I was anticipating. Other than that, I have no complaints. And you can't beat the price!", "author": "Laurel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Best ice cream.  Beats bi rite on taste.  Maybe the selection is not as extensive,  but the taste is definitely worth a visit.", "author": "Evelyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "A cookie-ice cream sandwich is one of those things that makes you think, \"Why didn't I think of that?\" Because it's delicious and that's exactly what the Baked Bear dishes up. The featured s'mores cookie, hot pressed, with mocha ice cream in the middle was golden. \nBring your culinary creativity and create some combinations. You won't be disappointed.", "author": "Karl C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "These ice cream desserts are delicious! Similar to \"Cream\", but in my opinion, better. Bring bottled water to drink if you're the type that needs a drink to wash down the sweetness. The prices start around $5.95 I believe. $0.50 for each topping. Pricey but affordable. It's not a shop, but an ice cream truck. They have a small seating section. It gets busy, and the workers aren't fast, but it's worth the wait. Cash and cards accepted.", "author": "Cici Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Found this new spot on Yelp, and so lucky we did. Simple menu (build your own ice cream sandwich) and great service. The baked goods are fantastic (cookies, brownies and donuts) and they're paired nicely with a perfect sized serving of ice cream. Can also get a waffle cone or a sundae...basically same ingredients served your favorite way. \n\nIt's a food bodega/truck with an outside seating area (about 10 seats), but this yumminess is also good for walking and a stroll of the Wharf area. \n\nGot a chance to meet the owner (Emma) who's busy in the kitchen and tending to customers. Clear to see that she takes pride in her business and making her customers happy. We will be back!", "author": "Shannon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "I ordered the chocolate chips cookies with Vanilla ice cream sandwich.  The cookie was soft, moist, and delicious. The ice cream was good and creamy.  It is definitely a great spot and good location", "author": "Jess T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Best place ever!\n\nI've been wanting to go to this place ever since I discovered it on Yelp, and I finally got a chance to go yesterday. I ordered a donut sandwich with a scoop of birthday cake ice cream, rolled in fruity pebbles.\n\nIt was amazing. The birthday cake ice cream had the perfect texture and the donut was warmed. It was a little messy to eat, but it was worth the sticky fingers.\n\nService is wonderful, the owner lady was very sweet and accommodating. Happy smiles all around.\n\nOkay now I want another one now. :(", "author": "Lea L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Ice cream is very delicious, we love the place, it is very nice.", "author": "Mega Team R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "So so good! You can create whatever kind of ice cream sandwich. One was big enough for both of us to share. Decent pricing", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-12", "description": "The area is really adorable and cute to go with friends. However, I believe it is overrated and it was not really what I expected. It is basically like CREAM however, there are more toppings, cookie choices and dessert choices to choose from. Although, I do like how you can substitute the cookie with a Donut or Brownie. I like how the ice cream flavors are not just the basic vanilla or chocolate but there is for example, the Baked Bear flavor where it is blue and has brownie bits.Other unique flavors are the salted caramel, birthday cake, those were the 2 that caught my eye. I was hoping that when they heated up the cookie, it was gonna be warm but it was not. Everything else was decent as far as seating, price, and choices to choose from.", "author": "Stacey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "there are so many customizations here that it's a perfect place to statisfy your sweet tooth!", "author": "Sarina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "This place is amazing! Not only is the ice cream delicious, the customer service is top notch. I once received the wrong topping on my customized ice cream sandwich, and an employee immediately offered to fix it to my preference and gave us a 10% discount. I'd definitely go again and recommend to a friend.", "author": "Abrefi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Super yummy took my daughter here for her first baked bear she loved it made especially for her the staff is awesome n friendly love this place", "author": "Dean D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Poor girl was working her tail off and they were out of a lot of cookies,  but since it was just before  closing it was understandable.  The flavors were full,  and we loved having so many options.  The ice cream was yummy too.", "author": "Maxine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "A very cool place in the busy fisherman's wharf. I would give them a five star if they weren't sold out of the gluten free cookies. But the ice cream was super tasty and the fact that they usually do have gluten free cookies cheered me up! :)\nAnd also the price is so affordable and realistic!", "author": "Shelly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "This is like Diddy Riese in L.A., it was so good!  I was visiting town and I saw this place by the pier. The cookies are so fresh and delicious! The ice cream is also so good.  Perfect combo, priced fair. Emma (or maybe Eva) was very nice and warm. I would definitely recommend, love this place. - Olivia", "author": "Jillian V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "The best ice cream, best donuts, best toppings, and best owner!! Everything is made with love. This place is a gem!!!", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "My boyfriend and I came here a while ago after dinner (I don't remember what we got) and I believe the owner helped us out and was so kind, I couldn't help but smile because everything was just perfect. The service, the ice cream sandwich was omg good, and there are so many different options you can choose from it's hard to pick one. \nThis is definitely an amazing place everyone should try at least once.", "author": "Bridget O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "This place is heaven! The cookie bottom was great, the doughnut top was great and the vanilla ice cream center with sprinkles and fruity pebbles was amazing. Get an ice cream Sammie and you won't be disappointed. The only downside was the strawberry ice cream my wife got was not good. It had a fake strawberry taste. Would definitely try again!", "author": "Paul L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-10", "description": "Suuuuper long line on a Friday night, Pre-Valentine's Day celebration. One girl working totally alone. We Felt so bad for her. Desserts are great, but don't come unless you're prepared to spend 25+ mins in line.", "author": "Melinda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "This is heaven on Earth! No joke. This place is absolutely amazing. So many options for a build-your-own ice cream sandwich. You can mix and match whatever you want! ALSO, amazing customer service! The lady here is soooo nice. We couldn't decide which cookie/brownie combo we wanted so she let us try a bunch of fresh-baked cookies! I ended up going with her recommendation of snickerdoodle and brownie. I got birthday cake ice cream and sprinkles on the outside. Absolutely amazing. All around awesome experience. Great dessert, great customer service, great price.", "author": "Julia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "The woman who served our order was very kind, great service. My kids loved that they got to customize their ice cream sandwiches! And the music was lovely. Great that you are able to mix and match all the cookies", "author": "A J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Ermahgerrrrrrd, these ice cream sandwiches are amazing!  And lucky for my husband, who had never tasted an ice cream sandwich before (silly Brits - he was literally picturing spreading ice cream on bread), and this was his first ever example of the treat.  Or is he unlucky since he'll never have such a great ice cream sandwich again?\n\nThis location has a few outdoor tables by Fisherman's Wharf, it's basically a food truck.  They have a great mix-n-match menu where you can create a custom ice cream sandwich that will top anything you can buy wrapped in plastic somewhere!  We went with one cookie of the month (it was full of things like little m+ms and other candies) and one white chocolate macadamia cookie, and cookie dough ice cream, and the ice cream was topped with mini M+Ms.  We got it slightly warmed, which was actually amazing because somehow the ice cream didn't melt everywhere (maybe because we ate it so fast?) but the cookies were softer and just had a hint of warmth about them.\n\nIt was so delicious.  Just so good.  The cookies absolutely had a homemade, fresh-baked quality about them.  The sandwich didn't fall apart at all, somehow, and it was only about $4 for a crazy-awesome dessert that we split between two of us since we were stuffed from pizza, but normal people should get one each because sharing something this yummy will make you sad.  It's cold here in England and yet if I had one of these in front of me right now I would devour it in a second!", "author": "Meredith A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Amazing dessert. Fresh cookies topped with delicious ice-cream. We had the Bear Bowl version as it was less messy to eat. The salted caramel fudge ice cream was delicious.", "author": "Dejan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "I LOVED IT !! I got the cookie bear bowl and my friend got the cookie sandwich. I got half salted Carmel fudge with fudge drizzle. And it was so good ! The lady at the counter was SO helpful and nice literally made my experience great. It's a great place if you want to treat you're self with some ice cream and in the mood for something sweet. Hospitality was A1 !!!", "author": "Cynthia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Im a visitor from Chicago and my sister was raving about this place so we went and were not disappointed. The owner is such a sweetheart and was very welcoming and was so nice to us. \n\nI got the cookie sandwich with red velvet cookies, birthday cake ice cream rolled in Heath bar bits. So deliciously sweet and satisfying. Your kids will love it, you will love it, definitely a spot if you have a sweet tooth. You can customize your cookie sandwich which is awesome for picky kids, or those who like variety. \n\nCheck this place out!", "author": "Dan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "I'm such a sweet tooth, I knew I had to check this place out while on vacation. The location is just a small trailer along the sidewalk with a couple of tables set up. The service was a little slow for only having one couple in line ahead of us, but it looked like there was just one gal working taking both the orders and then making the sandwiches. I had the cookie sandwich with a funfetti cookie and a lemon bar cookie (which was a seasonal flavor) with just vanilla ice cream and sprinkles and whipped cream. The funfetti cookie was soft and chewy, but the lemon bar cookie was hard so it made the sandwich hard to eat in any way. I kind of have regrets about not trying to donut sandwich instead, but on another visit it will have to happen!", "author": "jessica c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Thanks to Instagram I found this gem! I had the glazed donut ice cream sandwich with cookie dough ice cream and Oreo crumbles. Also it was topped with warm glaze. I also got it hot pressed which is highly recommended! Not giving it 5 stars because each part by itself was not 5 stars worthy (not the best donut or ice cream I've had) just great in combination!", "author": "Katherine A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-19", "description": "I wasn't a fan of the cookies here. The taste of them were not that great and had a very doughy taste that I can't really describe. The ice cream flavors were pretty standard for the foodie world today.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "Loved this place! A delicious twist to the ice cream sandwich with the donut option. I went on a Saturday and there was plenty people enjoying themselves here, and taking pictures of their ice cream! I got cookies and cream on a donut, It was amazing, I wish I had one right now! My boyfriend got a brownie ice cream sandwich, looked good too! Definitely worth trying!", "author": "Evelyn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "This place is definitely a must when visiting San Francisco.  Ordered a donut sandwich with cookies and cream ice cream.  Not big on ice cream but it was creamy and delicious. The combination with a donut was genius! We were craving another one by the end of the night. Thumbs up!", "author": "Carolyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "I found heaven!  Doughnut ice cream sandwich? Yes please!!! The glazed doughnut with strawberry ice cream is the perfect balance. The doughtnut is not so doughy. Perfect ratio of ice cream to dough.  Melts in your mouth!", "author": "D D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "I stumbled upon this great little dessert food truck during my trip to San Francisco. I had a hard time picking a combination of cookie and ice cream because I wanted them all. After much contemplating, I decided to go with the brownie sandwich. Let me tell you, it was the best decision I've ever made in my life!! It was warm and gooey... so delicious with the ice cream!! Must try if you ever get the chance!", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Little bit of a wait but absolutely worth it. I enjoy trying new things and since we were on vacation this place was worth a shot. We all enjoyed it!", "author": "Tina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Taste great. On the expensive side but definitely the best ice cream sandwich I had. Cookies and brownies are soft and chewy. Ice cream is fresh and not sugary sweet.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "The chocolate chip cookie itself was bomb. The vanilla ice cream was creamy and sweet and delicious. The almonds gave it anextra crunch. Simple sandwich but crazy good. Total $5.45", "author": "Denise U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "This place is heaven on earth! Where have they been all my life? From the fresh cookies to the flavorful ice cream to the friendly staff, this place is incredible. Create your own ice cream sandwich...yes please! Made a brownie ice cream sandwich with mint chocolate chip ice cream and hot fudge drizzled on top! It was ridiculously yummy! The manager is also the nicest, sweetest lady! Loves her customers; you can tell!", "author": "Jason T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "This place is AMAZING! I have had it in San Diego and so happy it has made its way up to the Bay! Its even better than I remembered, i got funfetti cookies with birthday cake ice cream and it was so delicious, my husband loved his too! Emma helped us and she was so sweet and kind! A perfect treat while your out at Fishermans Wharf!", "author": "JoAnna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "I've walked past this place a few times and finally got to experience the sweet wonders that Emma (owner) had given us. \nWe were greeted as soon as we walked in and stared in awe at the menu. A donut ice cream sandwich? Brownies? Cookies? And you can mix and match? Sold to the woman who has a sweet tooth. Though there aren't a lot of choices (compared to some places), I still found myself unable to choose. Emma quickly offered samples. Not a big deal, right?\nThat is until we were given the sample of the strawberry cheesecake cookie. It was a whole cookie that she split in half for my boyfriend and I to try. Those cookies aren't too small either! \nAfter choosing (donut with coffee ice cream and fruity pebbles) we were able to talk to Emma more and her daughter-in-law. Both were sweet and pleasant with amazing hospitality. It was like talking to old friends while indulging in delicious treats. I can go on about the smoothness of the ice cream, how the donut held the ice cream beautifully and the array of toppings, but my tummy is filled with the yummy goodness.\nI highly recommend this place.", "author": "Baillie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "Here I am thinking about how I'm going to get back in shape after I'm done with school until I find out that there's a Baked Bear in SF!!  First had their ice cream sandwich in SD and came back to SF trying to find an equal with no luck!  Cream..gross!  Over the moon..meh!  Not sure why it took me 4 months to find out Baked Bear opened up here, but so so happy I finally did!  Like I probably said in my review for their store in SD, their ice cream and cookies can stand alone, which is awesome!  There are plenty of different ice cream, cookie, and topping options.  You can even get brownies and doughnuts!\n\nPS: go after 7pm when metered parking is free in the area and layer up bc the seating is outside, but so worth it!!", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "I went there late last night. It was not crowded. I had a custom ice cream sandwich. It  was beautiful,tasty, not expensive and quick. The only downside to the baked bear  is that parking can be difficult. This is a very good place for late night ice cream.", "author": "Bruce K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Get  1/2 cookie and  1/2 brownie combo and your favorite flavor  super friendly staff.", "author": "Tara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Owner was so sweet and so was the delicious cookie sandwich she made us! Cute little place near the water!", "author": "Jaclyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "This place is amazing. The cookies and brownies are so good. I got the combo sandwich with one brownie and one chocolate chip cookie with vanilla ice cream and sprinkles. It was sooooo yummy.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Feast your eyes on my warm donut with birthday cake ice cream and fruity pebbles from The Baked Bear! Tonight I had the pleasure of treating myself to this concoction! OMG! This is absolutely a must try if you're in the area visiting and need a sweet treat.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "I have been reading so many reviews to check this place out since it suppose to be the best but maybe it just me who was a bit disappointed by how great ice cream donut sandwich would taste. I ordered mint ice cream and plain donut but I didn't think these two mixed well. I felt like it was too sweet for me and wished I had ordered just the mint ice cream. The donut was over kill.", "author": "Brenda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Ate here on 10/18.\n\nWalked by this place on the way to dinner and decided this was a must try for dessert.\n\nI had the perfect dessert breakfast, a Glazed Donut Coffee ice cream sanwich.  \n\nThe only problem with this place is that there are almost too many combinations.  A definite must stop the next time I am back San Francisco.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "This place was SO adorable! I expected it to be a building but it's actually a truck with a little seating area outside of it. The menu is awesome, you can get different kinds of cookie with different toppings & flavors of ice cream. I think our sandwhich was 5 bucks & it was seriously delicious. Just what we wanted after a late dinner, also cute place for an Instagram pic ;)", "author": "Cara N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "This was the best ice cream place I've ever been to! The idea of ice cream sandwiches with various cookies and brownies and donuts is so cute and delicious. I had a chocolate chip cookie with brownie with chocolate chip cookie dough ice cream in the middle. I loved it!!! I would come back every day if I could!", "author": "Madeleine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "Totally in love with this place! I just went today for the first time and I was served quickly and kindly. Also, the cookie sandwich was AMAZING. I got a white chocolate macadamia and funfetti cookie, cookie dough ice cream, and sprinkles. I am stuffed.", "author": "Casey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Coming from a dessertaholic like myself it was great! Definitely better than CREAM but would still rather go to Ghirardelli!", "author": "Andrea E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Super original idea and super great dessert! You have a choice of a variety of cookies, brownies, or doughnuts for the sandwich. Then you have about 6 or 7 flavors of ice cream to choose from and then several toppings. You make a custom ice cream sandwich! Great for when it's hot in San Fran (when is it not?) and dessert!", "author": "Cara T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "My custom cookie sandwich was made with: Peanut Butter Cookies, Salted Caramel Fudge Ice-cream, Heath Toffee Bits & Hot Caramel. The food itself was already fulfilling and indulging but what really made the dish for me was the presentation. And when complimented the woman who made it was genuinely appreciative.", "author": "Mason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "This is the best dessert place I have ever been to. I got chocolate chip cookies with cake batter ice cream with sprinkles and it was scrumptious! My friend got snickerdoodle cookie on one side and cookie of the month of the other with caramel ice cream cream in the middle and he loved it! The cookies were fresh and chewy. You HAVE to come here at least once while you're in San Francisco! The prices are reasonable and the ladies working there are super sweet and were very patient when I asked them a multitude of questions. \n*get your ice cream sandwich warmed up!", "author": "Emma W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Brownie bear bowl and chocolate chip bear bowl is everything.  Sooo good!  The customer service was amazing.  When I come back I'm definitely going to stop here.  They have a wide selection of fun flavors and toppings.", "author": "Lauri P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Great location, quick service, cookies were amazing and unique ice cream! Deliciousness!", "author": "Caitlin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-18", "description": "Generous considering they were out of all but one type of cookie, brownies, and spoons. Clearly needs better management.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "Ultimate place for those with a sweet tooth!! At first I ordered the donut sandwich with cookies and cream ice cream, unfortunately should've tried the ice cream first because it didn't have too much flavor and the donut combination didn't help (only reason I gave it a 4).  Went back up and got another one, this time with a funfetti cookie and a red velvet cookie with salted caramel fudge ice cream and it was soooo much better. Great place to have an ice cream sandwich, or even just a cookie or ice cream on its own!", "author": "Yarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "We had the combo sandwich with a root-beer float as well. Incredible!! The ladies working inside were so kind and friendly. Only a few tables are available for sitting outside. The menu is extensive and everything looks wonderful. I highly recommend the Baked Bear!!", "author": "Shelby J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Lord have mercy. Pretty close to too good to be true... I may never look at another ice cream sandwich the same way. The cookies were fresh and delicious the ice cream was perfect and the fruity pebbles!! Why did I never think of that?! Delicious! And so so many options!! If I hadn't had a full lunch I would have gotten the doughnut ice cream sandwich but I opted for the funfetti cookie and the m&m cookie (love that you can mix and match) cake batter icecream and again.. FRUITY PEBBLES.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "This place is great! It's a food truck but for ice cream. They have freshly baked brownies and cookies and let me tell you, it's good!! The employees are super nice, the young gentleman that was working on Saturday evening was really talkative and friendly, it was nice! If we are ever in San Fran again we will DEFINITELY be coming back!!", "author": "Dee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Soft cookies, yummy ice cream, insta-worthy toppings. This place is a winner :)", "author": "Harmeet K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "This place is absolutely delicious!! Fresh baked cookies and homemade ice cream. What more can you ask for? Its really affordable given they're located in the tourist part of town. If you're down at fisherman's wharf I suggest you give this place a try. The red velvet cookie and fun fetti are super yummy.", "author": "Marchelli H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "Amazing ice cream sandwiches. You can customize your sandwich and add a topping. The owner is very nice and excellent customer service. She even put our ice cream in to go containers. I would recommend to everyone!", "author": "Eva P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Ohhh my gosh! This place is awesome. The owner is the sweetiest and most friendly person ever. She made my day just by being sweet and all smiles. The cookies were sooo good. The hot chocolate float was off the hook!! The ice cream must be good as my husband hasn't paused eating it to asnwer me. We left that place with a few extra pounds but a little happier!!", "author": "Renata L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Heavenly  Came here twice during my SF weekend visit. Ordered a brownie bear bowl with day 1-cookie n' cream and day 2-cookie dough topped with hot fudge and fruity pebbles. It was the perfect sized dessert to share with my bf after lunch. Reasonably priced and Instagram worthy! Seating can be sparse during peak hours tho", "author": "Jane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "I tried the chocolate chip bear bowl with mint chip and butter pecan ice cream. Loved it. The cookie was warm and soft and the ice cream was very rich and creamy. Definitely home made.\n\nCustomer service was great!", "author": "Adam F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Saw this ice cream spot while walking by fishermans wharf and HAD TO TRY...amazing ! My husband and I made our own ice cream sandwiches -- he had 2 chocolate chip cookies with cookies and cream ice cream and brownie crumbles on the outside heated up! I had one red velvet cookie and one cinnamon oatmeal cookie with coffee ice cream. Topped with sprinkles and hot caramel sauce ! MUST go!!", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Had the snicker doodle cookie with salted Carmel fudge ice cream.  Excellent service was terrific and very friendly.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-09", "description": "This place was surreal. We walked by on our way home from chinese food and ice cream sounded good. There was a line with about 8 people so we were on the fence about waiting and decided we would. The wait with 8 people was about 45 minutes. My best guess is that the entire staff was stoned? It seemed like most people were just milling about not doing anything. One worker just kept taking her gloves off and putting them back on. When it came to my turn the girl kind of stared at me blankly when I ordered but finally managed to follow directions by me pointing to what I wanted. The blank stare got worse when she had to enter the order in the computer and I thought making change might just have made her head pop off!", "author": "Leah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Emma was awesome! Such good customer service, so kind and friendly! This time we only bought some cookies but they were so good! My fave today was the cookie of the month, a combo of cookies n cream, fingertips and m&m's! Delish!! Her cookies have a little crunch on the edges but more moist in the middle! We will be back!", "author": "Toni Marie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Decided to treat ourselves to this place. It was good. We had a brownie ice cream sandwich it was good very overwhelming for one person good idea to share. It was about 6pm and they were sold out of several things mostly cookie choices but we lucked out brownie was still available. Price is reasonable for what you get. Our sandwich was about $6.", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "This hidden gem is right across from the Walgreens off Jones street. The owner is a doll and such a  pleasure. She offers samples of the cookies to try with a smile. There is a menu with just about every cookie and brownie combo you can think of. Don't miss this spot! Everything was yummy!", "author": "S B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Delicious and I loved how many different ways you could completely customize your creation. The cookies tasted a little like a cheap Otis Spunkmeyer, but all in all, a yummy treat.", "author": "Jenna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "I give this place 5 stars no doubt. If you are looking for a great dessert this is the place to go! Also, they have gluten free cookies available which was a must for me! Amazing experience and will go back!", "author": "Becky A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "We went to the one that is in Fisherman's Wharf it was a hard decision since we had a few good choices, but it was very good and filling.", "author": "Ivonne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "This place is amazing! I love the creations that this place can make! From donut sandwiches with mint chip ice cream and whipped cream, to a classics chocolate chip cookie sandwich with vanilla ice cream rolled in M&Ms, this place has so many combinations! The service is fast, but I'm assuming there can be a long line sometimes. There are two picnic-style tables to sit at, so the only small downside about this place is that there might not be enough seating sometimes.", "author": "R T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Really awesome place! I am a cookie monster & love their product! Looking forward to come back soon =D Thanks Emma for your smile & your kindness!", "author": "Myriam J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "OH MY GOD! What a brilliant idea! This place was literally so good!! But the reason for 3 stars is that we waited line for 20 MINUTES! There was only one person behind the counter (who was super nice) but it took so long we were about to give up!! If you have loads of time, try this place out!!", "author": "Lohren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Great find after a long day touring and dinner out. Cookies and Ice Cream were yummy for the whole family. It is a food truck that is parked, and had to wait for awhile as there was one person in the truck. Worth the wait!", "author": "Gene T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "This ice cream \"bar\" is something I will suggest to anybody. The ice cream on the inside of my sandwich was amazing as well as the the cookies on the outside. The only reason it doesn't get 5 stars is because I don't cry thinking of how amazing it is.", "author": "Fisher J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "The service is amazing and the product is even more amazing, we got a warmed up brownie Ana funfetti cookie with coffee ice cream and mini chocolate chips!! SO good!!! And fun atmosphere!!", "author": "Sharon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "great ice cream and cookies. I recommend the cookies and cream cookies. They are really good. The vanilla ice cream is very smooth and tasty", "author": "Marina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Ice cream sandwich shop....Yes! Fresh baked cookies was the key to success. With so many cookie/ice cream options my mind was blown. We will be back soon.", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Best customer services I have ever had in my life! Worker by the name of Emma has taken good care of me and my gf  as soon as the store opened up. Short handed as she was,she still was able to take good care of us and made us feel comfortable. Emma was generous and kind! Thanks to Emma she had made my day!", "author": "Julius R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "This place has 5 stars for a reason. It is WHOA. When I first discovered it, I ended up coming back 3 times that week. Every cookie I tried was incredible. The oatmeal were my favorite, I think. Cookie of the month was cinnamon roll and it was incredible. It was pretty similar to the snickerdoodle, so don't feel bad if you missed out. The ice cream is also delicious. I tried nearly every flavor except coffee - they were out every time I went. You can't go wrong with this place. It's so good.", "author": "Anne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Everything I love sugar, soft cookies, and ice cream. Creating your own ice cream sandwich is trouble of the best kind! Extremely liberal scoops. If you have a sweet tooth go here!", "author": "Joey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I can count on one hand the number of times I have been to Fishermans Wharf. I happened to be near the Baked Bear when some friends and I were in North Beach and searching for something sweet. The cookies and ice cream were ok but really why I like this place is the super nice lady there. She gave us samples of everything and some good recommendations. On top of that she had a facetime chat with us and her nephew?! I didn't get her name but thanks for making our day better!", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Great ice cream sandwiches with super friendly service!  The fresh baked cookies are excellent!  Highly recommend if you are looking for a tasty treat!", "author": "Paul B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-07", "description": "So I've always wanted to try a donut ice cream sandwich in my life and I heard that Baked Bear served them! But I was pretty disappointed when I bit into my donut sandwich- the \"donut\" seemed to be somewhat like fried hamburger buns with toaster strudel icing on top. Disappointed that I didn't just get a cookie ice cream sandwich.", "author": "Mauna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "This is one of my favorite dessert places in all of San Francisco! You have the choice of cookies and ice cream to make a cookie sandwich. The cookies are baked to perfection and an amazing mix with all the flavors of ice cream.\n\nThe prices are extremely reasonable for all that you get. They have an amazing menu and unique product. \n\nEmma, the owner, is seriously the nicest lady on the face of the Earth! I highly recommend stopping by while walking the wharf.", "author": "Tyler P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Delicious.  I'm not much of a sweet tooth, but this place was fantastic.  It was fun creating your own ice cream sandwich, and the staff was more than helpful, friendly, and had a great personality.   This is a must-stop for anyone with a craving for sweets.", "author": "Ben F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Delicious!!! Cookies are perfect, soft and chewy! The ice cream is amazing and is frozen harder than normal so it doesn't melt while you're eating it! Can't wait to go back!", "author": "Sarah N Anthony U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Was a great bang for the buck I must say, I got a brownie ice cream sandwich combo with a cookie and topped it off with mini m&ms n fudge, the selections are simple so it's easy to make up your mind", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "6 stars if it were possible!! Customer service is amazing and the owner Emma is the one of the sweetest women I have ever met! Almost as sweet as the funfetti snicker doodle ice cream sandwich! Some of the softest cookies I have ever had. Ice cream is amazing. Get the warm press on the brownie or cookie sandwich!! Mmmmmmm good! Definitely going back!", "author": "Mitch C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "This place is fantastic! There is a good selection of ice cream, cookies or brownies, and toppings to choose from. The owner, Emma, is as sweet as her ice cream treats and was so kind and generous to my family. The cookie sandwiches are big! But they'll split the sandwiches in half for you if you'd like to share one. I recommend having your cookie sandwich warmed up because then it's easier to bite into the sandwich. I had a hard time with my first sandwich when I didn't get it warmed up, but it was still delicious, just harder to eat! This ice cream place is well worth your patronage and will leave your ice cream and cookie cravings thoroughly satisfied!", "author": "Leanna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "So good! Tried the bear bowl with a chocolate chip cookie and the salted caramel fudge and hot caramel topping.", "author": "Louisa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "awsome build-your-own cookie sandwich experience. If your in for a desert or icecream, this is the place. If you just had your meal in one of the nearby food trucks, be sure to make this your next stop.", "author": "Dvir A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "There are other custom shops, but this was our favorite. A great stop if you are near the Wharf. Fresh cookies and delish ice cream. Leave the diet at the door...", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Love this place!!!! My boyfriend and I came here 30 mins after it opened. The lady that helped us her name is Emma. Emma is the most sweetest and genuine person I have ever met! Her service was amazing even though she was the only one working she did such an amazing job. We mentioned to Emma that her service was amazing and she responded \"her motto is that she treats people the way she would want to be treated\". Emma we will definitely return here for your amazing desserts and service!", "author": "Erica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Great spot! The ice cream sandwich was delicious!!! The woman working there does it all, takes orders, prepares treats, manages when cookies are done baking and gives customers their treats so expect to wait on line but it's worth it!", "author": "amy t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "So good. Quick and tasty dessert- a lot of options and combinations. Great price and a lot of place to sit.", "author": "Dror M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Took a walk after breakfast before heading home. Luckily we did because we stumbled upon this wonderful place! Layout was nice. Selection great. Customer service excellent. Cookies we got were so delicious. Well priced. I def will be a returning customer. The owner was the sweetest woman ever. Beautiful soul....next time I'm trying a brownie and a donut ice cream sandwhich for the hubby!", "author": "Gigi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Great music playing from their speakers, some chill Future Bass. Greeted us with a smile and even gave me an extra topping on inquiry. Ordered the Bear Bowl with Salted Caramel Fudge, and I could see the amount of detail they put into presentation (hot caramel lattice, topping arrangement) which is always appreciated. One of our orders came a bit late, but the owner didn't hesitate to come to our table to give us some free cookies and a sincere apology for our trouble. Overall great experience and bomb ice cream", "author": "Angelo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "SOOOO yummy! The cookies and brownies were soft and chewy and the ice cream was to die for. All 10 in our party left extremely satisfied... will definitely be back!", "author": "Keri P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "I am super impressed with this amazing new food truck in Fisherman's Wharf! My teenage twin boys have gone 4+ times in the past 3 days. You're going to have to roll us back onto the airplane to go back to Phoenix. The woman working this location is an absolute doll! I see that ownership is responding to these reviews, please tell her we said hello! She'll know exactly who we are! You can tell how dedicated she is to her business. It's been pouring rain the entire time we've been on vacation and she's all smiles and even recognizes us when we stroll on up for more. Try the donut ice cream sandwich! I love how you get to pick all the different aspects of your dessert. This is such a cool concept and I know The Baked Bear is going to do SO well as the weather warms up and tourists come in flocking in. Only $5!", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Oh man. This place is great. It's just a little stand with some outdoor seating, but the ice cream sandwiches are SO GOOD. You can get them customized to however you like and you can really tell the owners care about the customers.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Delicious!! The cookies were fun flavors such as birthday cake. The owner/ cashier was super friendly and inviting. The customer service and the ice cream would keep me coming back for more!", "author": "Aldrey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "By far one of the best dessert eateries I've found. I'm from Miami and nothing comes close to the baked bear. I tried the white chocolate macadamia and cookies and cream cookie with rocky road ice cream. AMAZING! The service is like no other.", "author": "Orlando M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "The lady who made my cookie ice cream sandwich was really nice and the desert was delicious. Would definitely go back", "author": "Jay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Great hidden gem in fishermans wharf. We got a half brownie, half cookie sandwich with salted caramel ice cream. All of the baked goods are very good and the ice cream was very good. She was willing to cut it in half and offered us samples too. Very impressed.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "We came here late one night this summer while vacationing in the city, as it was just down the block from our hotel. Oh my...YUM! Fresh baked hot cookies, and a cookie ice cream sundae...really hit the spot for the nighttime sweet tooth cravings! Super friendly staff and there are places to sit outside and enjoy the views while enjoying your treats!", "author": "Sylvia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "This place was bomb diggity! You can get a cookie, brownie, donut, or a combination of those for your ice cream sandwich. I chose to get funfetti cookies with birthday cake ice cream and sprinkles as my topping. It was honestly soooo good. The cookies were super soft and delicious. You can also get a hot fudge sundae, bear bowl (warm cookie or brownie in bowl with a scoop of ice cream), or a root beer float. This place was definitely worth stopping at. They should bring their business to Outside lands! :)", "author": "Kaitlyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Awesome idea for a fun dessert. And the location is ideal for those spending some time in the city. Great concept!", "author": "mike k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "I thought the ice cream sandwich was good but not the best I've had. To me the cookie were not that good, they almost tasted old/stale. But the sandwich was ok. The ice cream was pretty good. I would come back probably and try something besides the cookie sandwich.", "author": "Jeremy .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "by far the best ice cream sandwich place I've ever been too! I've gone twice and each time I've met the owner who is the sweetest woman ever; she gave me free cookies both times!  plus the cookies and ice cream taste absolutely amazing... the Spanish hot Chocolate cookie for May is life changing. GO GO GO!!!", "author": "Colleen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Super cool idea to make your own ice cream sandwich. Interesting choices available and large portions. Def a fun experience !", "author": "Hana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "This place puts Cream to shame. I love everything about the Baked Bear, and will choose it over Ghiradelli any day. So far the brownie bear bowl with salted caramel fudge ice cream is my favorite, but I haven't tried a doughnut yet. Maybe next time!", "author": "Marie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Everyone: Go here if you are having a bad day, the Baked Bear lady will turn your frown around. Go here even if you are having a good day, these delicious treats and her infectious kindness will make your day even better. The variety here is overwhelming in a good way, this is truly a dream come true if you have a sweet tooth. Each treat is very rich so your sweet tooth will definitely be satisfied! I got a cookie sandwich with one end being a white chocolate macadamia cookie and the other side being a funfetti cookie, with salted caramel fudge ice cream in between YUM. You can tell the ice cream is high quality and the cookies are warm and soft, just the way I like them. This place warms my heart and belly!", "author": "Anna J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Amazing! The line can get long but well worth the wait. The donut sandwich is mouth watering.", "author": "Erin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Super delicious!!!!! Cookies and brownies are warmed with a gooey center. The salted caramel cookie(limited time offering)  is a bomb! The lady there is also super nice and often give out samples of each kind of cookie they sell that day. 5/5 would go again!!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Brownie sandwich with coffee ice cream is a MUST!", "author": "Shay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "So lucky to have found this little treasure.. Cookies stayed soft even with the cold ice cream. The sweet lady who helped us tonight made the cookie/ice cream experience that much more amazing", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "This place has amazing cookies and Brownies.  The brownie sandwich warmed up is the way to go.   The staff was friendly and allowed you to sample cookies and ice cream.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I ordered Brownie with cookie dough ice cream.. It's soooooo gooooood!!! But for me, I think it's too big to have myself, it's big enough for 2 persons. \n\nAnd I'm not sure if she is an owner or just cashier. Anyway, she's really nice to me! Friendly and sincerely. I very appreciated! \n\nBefore I left, I went there again to have mint chip with waffle cone! \n\nI personally love mint chip ice cream! And this mint chip is freaking tasty!! Again I love it!", "author": "Salisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "I ALMOST wish I hadn't found this place because it is so damn naughty but so damn GOOD. We grew up in the UK sans ice cream sandwiches - poor poor British kids. This place takes this fantastic idea and vamps it up. We had salted caramel ice cream on white chocolate & macadamia nut cookies with mini m&ms around the sides. It was insanely good. You can also have them heated but we don't know what it means & we didn't want to ice cream to melt. Maybe we'll try it next time. There will DEFO be a next time.", "author": "Fi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Best ice cream sandwich ever! Coffee ice cream with Macadamia Nut cookies topped with whipped cream and chocolate chips! I will be back! A+", "author": "Greg D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Hands down the best ice cream dessert I've ever had. All of my favorites in one: Fruity Pebbles, chocolate chip cookie and red velvet cookie, and strawberry ice cream. It exceeded my expectations and I was expecting 5 stars.", "author": "R T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "The people are so friendly here! Such great service, unfortunately not nearly as good a some other ice cream places in the area. Over the moon seems to be better quality, and has really fresh/warm cookies. Cookies here don't seem as fresh, although the portion size is bigger.", "author": "Therese M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Both my husband and I were happy with our treats! I got the chocolate chip cookie with macadamia nut cookie and cookie dough ice cream. It hit the spot!! My husband got the chocolate chip cookie in the pan with rocky road ice cream and whipped cream. We will definitely be going back again soon!!", "author": "Autumn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "The cookies are amazing and there are so many choices! We're 5 girls from Florida eating ice cream on a cold, rainy day on the bay and loved all of our choices. This place is going to be crazy busy in warmer months! Not to mention that it has the sweetest owner!", "author": "Jenn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Freshly made cookies!!! Bomb ice cream!! Really sweet lady, she's the best! Nice place to take a rest on the wharf and enjoy some delicious ice cream sandwiches.", "author": "Ricardo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Salted caramel fudge ice cream is incredible. Pairs perfectly with the brownie sandwich.", "author": "Stanley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "This place was amazing! Definitely my money's worth! The little lady that runs the spot is so nice and humble, which I appreciated! I was in San Fran for 4 days and out of all the places I went to during my trip, she definitely gave me then eat service! Not only was she nice, but she also gave us samples and welcomed us in as first time customers! I definitely recommend this spot. You won't regret it! Definitely better supporting the baked bear over Haagan Daz all over the city. Take my advice! ;)", "author": "Kerry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "Went to this place with my girl friend after a few days of walking past it and finally craving an ice cream sandwich and this place did not disappoint. I got the chocolate chip cookie sandwich with cookies and cream ice cream and it was so good. The cookie was delicious and was not over baked, but nice and soft and had a great flavor and so did the ice cream. I thought the pricing was good for such a scrumptious cookie sandwich. I'm originally from LA and will miss this spot once I go home, but is now a go to once I'm in SF.", "author": "Gustavo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Came here with my friends on New Years Eve for some late night ice cream. We were greeted by a lovely lady with such a great attitude. Having just had horrible service at a nearby restaurant a change in service was refreshing. She also gave us samples of the cookies. She let me try the pecan & pretzel one AMAZING!!! it was soft in the middle crunchy on the outside. So good! Overall I would come back just for EMMA!!! she is the owner of this cute little spot & her customer service & friendliness makes me wanna come here with more friends it's a good place to chill & enjoy some good ice cream. They even sell coffee !!! Thanks EMMA & her team for the experience !!!", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-18", "description": "Did not enjoy my ice cream sandwich at all! Donut was stale, ice cream was bad... didn't even eat more than a couple bites.", "author": "K. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "The moment we got there she gave us a complimentary cookie to try before ordering and she was extremely generous. Most importantly, the icecream was DELICIOUS! Too bad I don't live here otherwise I would definitely come back :) 5/5 love it\n\nPs. Try the brownie and ask for the fudge on top!", "author": "Tarek K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "I work at the Fisherman's Wharf Marriott so me and my co-workers are unfortunately there on a regular day to day basis. :) The owner EMMA is SOOOO AMAZING! She really makes the place shine & have personality. She is always asking people to taste, try, and sample different things. By now she knows I get two scoops of coffee with health bar. I'm not as adventurous as my co-workers, but they get the works with the cookie or donuts with topping and they all rave about the place, but more importantly Emma. It's not what do you want, here it is, and bye, she is the most personable owner I've met in a long time, everyone around here adores her. As the weather is getting nicer, the lines are getting longer, and with so many options to choose from can be a little frustrating for someone trying to sneak a break to ice cream, but it's always worth the wait... You won't be disappointed, and don't forget to Tip Emma :)", "author": "Mikaela J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "This is one of the most delicious & great place to go in SF ! We came here at 9PM & the owner was the only lady working & she attended us in the most nicest way ever ! Great customer service ! She even gave us cookies for free ! Will come again completely recommend !!!", "author": "Nina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "A must go to in San Francisco! So good we went twice during our stay. The weather was cloudy but couldn't resist! You won't be disappointed. The owner is extremely sweet and helpful!", "author": "Myleena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "this place was so good!!! the lady working was so nice!!! glad my friend and I stopped by and found it.  the bear batter was delicious and it went well with the donut. her red velvet cookie was so good too.", "author": "April G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "We loved Baked Bear!! I don't know what was better - the delicious custom ice cream sandwiches or the kind hospitality of the owner. Highly recommended!", "author": "Stacey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "The ice cream was amazing. I think that is definitely the selling point. The cookies were perfect for an ice cream sandwich, very firm. The staff was super friendly. I'll go back for sure.", "author": "Raeanne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Such a fun little place with the most pleasant lady, the owner no less running the window and making and baking the cookies. I ordered the oatmeal snicker noodle cookie, vanilla ice cream coated with slivered almonds. The price was outstanding and my ice cream sandwich was huge. Loved!", "author": "Jonni M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Definitely worth trying. I like that we can customize and make our own ice cream sandwiches. I ended up choosing combinations that were too sweet together for my taste. The staff were great too!", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Soooooo gooooood!!! We saw this place on the way to get dinner and couldn't resist. What a great decision! These sandwiches were amazing. We got the chocolate chip cookies and those would have been good enough on there own. Then we added the Bear Batter and fruity pebbles. Friendly staff and chill music makes this a can't miss. Can't wait to go again!!", "author": "Dan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Amazing gluten free cookies and ice cream!  Great afternoon treat after walking around Fishermans Wharf. I highly recommend funfetti cookie with birthday cake ice cream (although this isn't gluten free).", "author": "Dan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "I am a health nut, and this is the first time in a year that I've finished my dessert. The sandwich was amazing, and the value for money was great. The atmosphere they created was really happy and welcoming too. There is a long line, because they dedicate their attention to one creation at a time, and it's very much worth the wait. I got chatting with the owner, and, in the midst of our conversation, she accidentally mixed up the ice cream flavours. When I pointed that out, she fixed it, and surprised me with a complimentary cookie. Service and attitude was above and beyond.", "author": "Ani V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "What a cool concept.  Loved the create your own custom ice cream sandwich.  Cookies were fresh and tasty.  Ice cream was really good as well.", "author": "Joel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "How can you not want to eat here??!!  Amazing!  Customize your own ice cream sandwhich, donut sandwhich, etc!!!  Owner is super sweet:)", "author": "Abby N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "The baked bear is the best dessert I have had in the last couple years of my life. If you are in fishermans wharf I would 100 percent go there.", "author": "Ethan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Amazing !!!! The coffee ice cream with the salted Carmel cookie was like nothing I have ever had. The employee was so kind and let me try everything before I made my personal ice cream sandwich. Would definitely go back and recommend it to anyone.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "BEST ICE CREAM SANDWICH EVER!!! Unlike similar places who uses factory made cookie dough, this place makes it's baked goods and ice cream from scratch...yummmmy!! Super friendly staff especially the owner who makes you feel so welcome and makes a picture perfect sandwich! To put a cherry on top (no pun intended), they cater!! Who wouldn't want ice cream sandwiches at their next party!! Sign me up please!! If you are in the area, you MUST stop by.  You will leave with sweet tooth satisfied and a smile on your face from the great service you receive!!", "author": "Bashar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "This place was amazing! Very friendly staff! Delicious soft freshly baked cookies and yummy ice cream!", "author": "Stefanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Very generous lady. Me and my gf visited and got an ice cream sandwich and the bear bowl. They where both delicious so I tipped her 5 dollars. In return, she gave us 6 different free cookies!!!", "author": "Frank R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Amazing! I'm a cookie snob and only eat homemade. I tried a sample and it was so good we bought a dozen to take home. The wonderful woman that runs the shop only makes the cookie experience better!", "author": "Kristi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Stopped by today at the Baked Bear...one of the best things in San Francisco!  Owner was so nice and offer lots of samples.  Highly recommend!", "author": "Lori H."}
