{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "What a gem of a restaurant, an intimate space great for first dates. the owner was so nice to accommodate a party I organized back In February and everything turned out perfectly. Thank you! \n\nService was quick and the food was outstandingly rich in flavor, great presentation too!", "author": "Inna E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-11", "description": "Despite being packed in like sardines and higher-than-average prices, I would have given this place five stars back in the early '90s.  Then I had a meal that seemed like nobody cared anymore. I've been a few times to see if things had improved but, sadly, the thrill is still gone.  At least they solved their crowding problems.", "author": "Rob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "There's only one thing I crave when it's cold out and that's the Tom Kha Gai soup at Thep Phanom. It's the best in the city, it's so comforting and delicious. Some other favorites are the Crying Tiger Salad, Green Curry, the Dancing Lady, and the Thep Thong. The staff is so friendly and welcoming. They also make good cocktails, like the lychee mojito. It's a great low-key spot to have good convo, listen to great covers, and enjoy delicious Thai food.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "First things first: Groupons no longer accepted, restaurant.com certificates no longer accepted, that being said they do accept the yelp check in discount \n\nAtmosphere: very cute and comfortable, good for a first date or other romantic event\n\nServers: attentive, professional and speedy \n\nDa Food: Portions on the smaller end considering that prices aren't that low and entrees don't come with rice. That is a huge pet peeve of mine. Rice is cheap.....it should come with your entree. Just saying. We had the Three's Company (prawns, scallops and squid in a coconut milk sauce) the flavor was interesting like coconut milk meets fish sauce meets lemongrass. We also had the honey duck which was alright. It felt like duck from a Chinese butcher shop on a bed of spinach and broccoli. The sauce I think I could have made at home using vinegar, soy sauce and honey. All in all in not super wowed. In total we spent $40 and left partially full and partially satisfied.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Tasty food, attractively presented, and reasonably priced. Highly recommend.", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "I've lived in the neighborhood for 12 years and this place is a great comfort food spot. Food is always solid, clean, fresh ingredients. Today I ordered the duck curry, wasn't greasy or too oily. Husband ordered a prawn dish. Prawns were cooked well, not over cooked like you'd get in many other places.  Always great here!", "author": "I love t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Oh my, this isn't the first time I've been here, not by a long shot. It actually may be the first Thai restaurant I had been to after I moved away from my parents' house for the final time. It was back in 1987, and I was a cherubic bean counter for a bank. A college friend of mine had told me his favorite restaurant was this place, so I went and have been coming back on an infrequent basis ever since. Obviously I hadn't been since 2006 because I never Yelped it before, which amazes me because I feel I know this converted Victorian spot so well. The staff is still as friendly as ever, so I took Jamie W. for his first time there. Sadly, it was as still as a tomb when we were there on a rainy Saturday afternoon.\n\nBossa nova-style covers of Michael Jackson's hits were wafting from the muzak. Some worked like \"Human Nature, others didn't like \"Beat It\". We went for three hearty dishes. First up was the $15 Sam Kasatr, one of my favorite of their specialty dishes, a combination plate of sauteed chicken, beef and pork with sliced bamboo shoots and seasoned with Thai spices (photo: http://bit.ly/28NEYPy). It went really well with their $16 Pineapple Fried Rice, quite a delectable sweet-and-savory treat served in a grilled half-pineapple with fried rice blended with yellow curry and mixed with shrimp, chicken, cashew nuts, raisin, onion and fried egg (photo: http://bit.ly/28Rmjpp).\n\nI've had variations at other Southeast Asian restaurants, and this one was up there. Our last dish was the $12 Pad Se Ew with Chicken, a Thai classic with pan-fried noodles with fried egg and broccoli in a thick soy sauce (photo: http://bit.ly/28ONY9O). All the food reminded me that Thep Phanom is like my late mom. Yeah, I'd forget to call her. Sure, I didn't come home when I told her I would so she could do my laundry. But she would make me some nice dinner anyway, even though she hated to cook beyond heating up the Toshiba rice cooker. I guess I should come back here more often, Mom. But you should work on your health score. I mean 76, c'mon. No, Mom, I'm not being critical. Love ya...\n\nFOOD - 4 stars...familiar Thai dishes better than I remembered\nAMBIANCE - 3.5 stars...an old Victorian done up with some semi-kitschy Siamese decor\nSERVICE - 4.5 stars...still friendly as ever\nTOTAL - 4 stars...sorry Mom...I mean Thep Phanom...I'll call more often", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "They are open on weekend morning/afternoons, but as a pop up thai noodle bar. Very nice people working here. Got the salmon noodle dish with a choice of type of noodle.", "author": "Phoenix F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-06", "description": "I used to love this place and used to come here all the time. When a Groupon for them came up I excitedly bought it but didn't have enough time to use it before it expired.\n\nThe Groupon said I could always still use the value I bought the Groupon for though so I went in there to spend my $30 original dollars. No dice though, they refused to accept it even though I showed them the Groupon and the terms and conditions- they just pretended they had never seen it nor had ever offered that deal. Even though I showed them the picture on my phone. \"No! Never- maybe last year.\" (It expired in February.) \n\nPretty ridiculous. Food is pretty good but slightly worse than Osha.", "author": "Lai-Nin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Food was good. Higher quality than many other Thai places in the area. Had the pad Thai, vegi spring rolls and Cashew chicken. All tasty! Loved the cilantro on the cashew chicken. The food was not greasy or over sugary (problems I have found at nearly Thai places). I'd eat here again!", "author": "Rachael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "It's been awhile since I have been to Thep Phanom but I remembered I enjoyed the restaurant and the food with a couple of my siblings. This past weekend I suggested this restaurant to a couple of friends who wanted to get together.  My gal friend loves Thai cuisine. Once we arrived she liked the intimacy and the decor of the place. When our other guy friend showed up we then ordered our food and the Frog Leap Sauvignon Blanc. Everyone very much enjoyed the dishes we shared: Basil Salmon, Pad Thai with Tofu and Thaitanic Beef spicy.  The food was delicious and the service was very pleasant.  It's a little off the beaten path in Lower Haight but worth the visit and most importantly my gal friend was happy I suggested to go here for dinner.  They do accept phone reservations.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Always very good.  been coming here for years.  Very Fun to bring out of town guests because their decor is beautiful and cozy and charming.   Definitely a long time favorite in this ever changing neighborhood.   I recommend the pineapple fried rice!   And any curry.   Also, try their fun non-alcoholic drinks.  Thanks Thep!!!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-30", "description": "This was a main draw restaurant in this neighborhood when I first moved here 25 years ago. The menu was extensive, creative, and the service was exceptional.  BUT, things change.\n\nWent last night for a birthday dinner about 7-8PM. Only a few tables occupied. Appetizer menu was now heavy on deep fried stuff, and much of the wide variety of other dishes was reduced. \nService was OK but not as friendly as prior visits. \nWe were served an appetizer we did not order, and a main dish we DID order did not come. Soft drinks were big on ice; little on fluids.\n\nI did bring up the switched items with the bill, and we got an apology and a $5 credit (only good for 1 month!!), but the impression was already cast. \n\nThere are lots of Thai places in SF. Look for a good one!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "I love this place!!! So many unique thai dishes and absolutely delicious. We had the deep fried pumpkin (great presentation), fried pork, thep thong, pad thai shrimp, and tamarind fish. Everything was great but if I had to pick a favorite, definitely the tamarind fish...and the fried pumpkin...and the thep thong...nevermind I can't pick a favorite! \nAnd then the dessert! We had both the Kahlua creme brulee and the FBI (fried banana ice cream.) The Kahlua creme brulee is nice and light and the perfect amount of sweetness. The FBI was perfectly crispy on the outside and soft on the inside with fresh fruit and ice cream to balance with fried banana. \nIf you haven't been here yet, give it a try. You won't be disappointed!!", "author": "Taryn J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Love the look of this place, good food and great service! Try the dancing lady and Tom yum!", "author": "Karissa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Really liked this small corner restaurant! The free Chang beer with check-in is like.. the highlight and made us order more food to go with the beer :D\n\nCrying Tiger: 2-3 stars (small plate, $7)\nNot authentically tasting.. Good quality beef but they're missing the actual dipping sauce and roasted rice powder! \n\nSouth Sea (stir-fry seafood with eggplant): 4.5 stars (regular size, $14ish) \nTotally worth it! Hot stir-fry with lots of seafood, and really good seasoning! Tasted a bit Chinese rather than Thai though. Sprinkle lots of dried chili powder with it. Yumz\n\nPapaya Salad: 3-4 stars (small plate, $6) \nAgain, delicious, but missing the authenticity (needed a loooooot more spice and some crushed peanuts on top)\n\nSpicy Prawn: 2-4 stars (small plate, $7)\nThis literally came with ONE prawn. :-( However, it was a really tasty prawn. Sauce was good too. Again, not spicy enough.\n\nYou might be a little confused by my ratings here. Here's what I think.. This place serves awesome food, it's just not 'real' Thai food. But their service and everything made a really pleasant date night. I would still come back and hangout or try a couple more of their taps-sized dishes, which not a lot of restaurants do nowadays. And I encourage you to come try some dishes out and add a looooot of chili flakes on everything ^_^", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "Sawadee kha!\n\nI came here a couple nights ago and I was super impressed. After living in Chiang Mai for 5 months, I got accustomed to the quality and authentic flavors of the cuisine. I've only had Thai food 4 times since being back for over a year for the fear of being let down and disappointed. But that didn't happen here! \n\nWe order the spicy calamari (not something I'd usually order at a Thai restaurant)- but it was cooked and seasoned to perfection. The sauce was tangy and spicy with hints of garlic. Just terrific.\n\nThe Thaitanic beef was amazing as well. Little hint of yellow curry? \n\nLast but not least- the pad kee mao was kicking off with so many flavors, especially after adding some more spice to it. Pro tip: ask for \"prik nam pla\" it's the fresh chilis cut up mixed with fish sauce. Goes great on everything.", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "What a great place in Deboce Triangle.  Food is well made not over breaded and fried.  Good ingredients and friendly people.  Good wine choices.  Recommend for a good night with friends or a date", "author": "Paul L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "I have been here a couple times and always thought the food was good.  I saw a Groupon and decided to come back after many years.  My Groupon expired November 10 so I went on November 9 since I thought they would be busy.  They posted a sign saying no Groupons after October 31 and would not accept it.  As a small business owner myself this is just bad business.  We did nothing wrong and we're penalized because they did not meet their terms or have any flexibility.  The owners should be ashamed as I wasted time/money going there via uber. There are too many good Thai restaurants in the city and believe me I will tell all my friends to never go there.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-27", "description": "ordered take out, which was on time and warm.  However the food was not spiced well for our tastes and portions were small.   Soup was the only dish that seemed flavorful enough.  we had not eaten here in a couple yeas but it has gone downhill since its hey days.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "What an amazing place to have across the street from our apartment!! The staff was so, so friendly and welcoming and really made our dinner experience as memorable as possible. Tan is such a sweet lady and Patrick is a very nice waiter. We shared all our dishes with brown and white rice on the side and had Chang beer to wash it down. Tan was so incredibly nice to bring us a complimentary mango sorbet with a raspberry and mint leaves on top, just because we are neighbors!! Such a great Thai dinner, we can't wait to go back! Would recommend every time!", "author": "Andy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-08", "description": "Itsa solid 3 star joint, its A-ok, nothing GREAT but fortunately nothing truly BAD. I guess if I lived across the street from this joint, it would be a great place to grab dinner, as a destination Thai dinner place, me thinks not. 4 for dinner:\n\nFOOD : \n\nCrispy Tofu: $9 - good rendition, the accompanying cucumber salad wasa nice complement \n\nCrispy Cresent Moon $9 (deep fried pumpkin) \"A\" for creatively served in a wine glass w/ sauce \n\n\"3's Company\" - $15 scallops/calimari/shrimp: the shrimp were prawn sized, the scallops were the tough and tiny bay version (I think maybe 2 were present) calamari (squid) was the most populous item. The coconut sauce was thin, as in like water. Despite the clever name, it was disappointing. \n\nThe \"Som Tum\" $10 - spicy green papaya salad, good\n\nTom Yum Goong $11 spicy & sour prawn soup - good\n\nBasil prawns $ 15 - nicely spiced, but the \"prawns\" were more like \"shrimps\" - size does matter. \n\nRice - 3 X $5 served in a clever traditional Thai tube \n\nDeserts / drinks / fried bananas / etc (Thai Coffee, Tea) $ ? x 6 - ok - nothin great\n\nSERVICE: nice waitresses... (lookin a little stressed)\n\n$120 for dinner for 4 - itsa ok price for the joint... but since I like to tip big that skews the price", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-12", "description": "We ordered two pad sew ew with beef. The flavor is almost non existent. It is mild and has mild flavors that are overwhelmed by the plain flavor of the beef. \n\nOh and the service. The capacity was maybe 50% at best full however we sat for a good ten minutes before we had to ask for water. We did however have our cups prior!!! \n\n$12 of disappointment", "author": "Nathan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "This is one of our favorites when we visit SF!  Well worth the Uber to that part of town.", "author": "Jason P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "Tonight my Panang chicken came with an extra treat...a 12\" long straight, black hair wrapped around a piece of broccoli. So, that was my last order from TP. I'm actually a very forgiving, understanding guy. That's why I gave them a second chance after the exact same situation about 6 months ago. It took 6 months or so for me to be able to think about eating Thai food again. Tonight might have been the last time EVER for me.\n\nPOSTSCRIPT: when I made the management aware of the situation, they offered to give me a gift certificate for that entree. But just that one entree. Even though it was the start of the meal, and my companions were nauseated by the thought of eating THEIR Panang chicken. In the end, it wasn't worth the communication struggle and we just went elsewhere.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "The food here is terrific! Consistently super tasty, perfectly spiced in my opinion, oh and the staff are super nice and wear cool outfits! :) I recommend the green curry, and the titanic beef! Also, they have Chang beer which I love - goes nicely with spicy food!", "author": "Kristin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Excellent service . Aries was great and take care of mind . I will be back . Food is delicious. Clean and good environment ^^", "author": "Zen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "This is my go to Thai spot in my neighborhood when I have some extra cash. It can get a little pricy if you are a big eater and drinker. If you are going out for a good dinner with a significant other this would be a good casual place. \n\nThere stuffed chicken wings are amazing, and their grilled shrimp stuffed with crab meat is my favorite. Can't go wrong with Pineapple fried rice and pad thai. The drinks are strong and the food is good.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "The new weekend breakfast menu is wonderful! I just had fantastic Eggs Benedict and I will be back again.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "The food here is a notch above most other Thai restaurants in town. I used to call it \"Thep Phanomenal\" because it was so good. However, last time I was in I was disappointed in the service. We ordered soup, salad, and a main dish--and they all came at once. By the time we finished the soup and salad the main dish was cold. That seems pretty basic, especially when there were very few customers at the restaurant. Second, our plates from the soup and salad just piled up in the middle of the table without anyone checking to remove them. That kind of thing just makes me tense while I'm dining, like when are they going to remove the dirty dishes already? So, longtime fave for food, appreciate the generous pours of the wine, but more attentive service would make this a place I would want to return to more frequently...otherwise, I'll just get their takeout!", "author": "Laura F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-11", "description": "I wish this place was good but is just simply is not. The people who work here are nice. That's it. The food is not good. Tasteless. And 1 order of veggie red curry + rice = $18 for take out!?", "author": "Gernaut A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "I liked the environment at thep-phanom. We tried their weeping lady dish which was similar to spicy chicken basil; ordered it moderately spicy which was definitely spicy, but tasty. Their rice options include the typical white and brown, but they also have a sticky rice option served in a small straw container. Pretty nice and varied wine selection. If I'm around the haight area more often, would definitely repeat.", "author": "Will H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "This place was awesome. My fiancé and I are vegan and they had so many delicious options. The vegetable coconut soup was the perfect thing for a chilly SF evening. I had the Thaitanic Tofu and it was so flavorful and delicious. Will definitely verbs know.", "author": "Hannah Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "Zero stars. After an hour late, restaurant indicates *another* hour before delivery because they \"have to cook the food\"- I could've cooked dinner in that time. Completely unintelligible and unapologetic as I explain that I need to feed my children on a school night at 8:30pm. Ridiculous. We will never know whether the food is deserving of any rating, but the restaurant is worthy of nothing. I'm shocked that they  remain in business.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Dear Thep Phanom,\n\nI only tasted one item, the Pad Thai with tofu.  Those five stars are for this dish.\n\nWhen it arrived it looked a touch pale, a touch slimy, and not particularly impressive.\n\n\"Meh\" I thought to myself \"I suppose I just have so much incredible Thai in Hawaii that I cannot expect everywhere else to live up to my standards of excellence\".\n\nI begrudgingly placed a chopstick full in my mouth and....\n\nIt was the BEST Pad Thai I had ever eaten in my entire existence. The best.  So good I think about it, I fantasize about it, I want to to go to you right this moment.\n\nAnd I am angry with you as I am now ruined.  RUINED.  All Pad Thai since you has been such a disappointment I think I will stop ordering it completely.  I can't suck anyone else's noodle into my mouth, only your glistening noodles can slide down my throat and grant me complete and utter ecstasy.\n\nAhhhh.\n\nAhem.  \n\nSo anyhow, your Pad Thai is wonderful and someday I will be back and order every single vegetarian dish you offer to see if they are equally orgasmic.  I mean, delicious.\n\nLove,\nAngela", "author": "Angela M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "Cancelled all promotions just in time for us to make the trek over. Zero customer service.", "author": "Eugene C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-29", "description": "The noodle and broccoli in their pad se ew are good, but the beef could be better.", "author": "Yuchen Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-01", "description": "Came in with a group of people for dinner. Got seated, ordered food, and had to wait over 30 mins for the food to arrive. Food wasn't that great either. It taste really bland and there weren't any taste to the chicken at all. Seemed like they just threw a pinch salt and started stir-fry. Two of my friends ordered the same plate (pad see ew) and by comparing the portion mine looked smaller than theirs. Service was okay. Also, false advertisement. On Yelp it says 10% off for dine-in costumers. They even have it on display outside of the door. My friend asked about it and a worker said \"we cant do it.\" The worst part is that when we split the check among 6 of us. He charged me extra. I only ordered pad see ew and Thai tea and the total is 16$ and with sales tax it's 17.40$. And I just noticed they charged me 20.53$ in my card without tips.", "author": "Sandra Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-11", "description": "$12 for dry pad see ew. Need more sauce, noodles shouldn't be stuck together. \n\nThey also charge .10 cents for the paper bag for my pick up. \n\nI personally try to stay away from establishments that nickel & dime and pass all cost to customers on top of the price.", "author": "Gloria T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-24", "description": "Taste: 3 or less\nPresentation: above 3\nService: just under 3\nMusic: at least 4\nOverall: 3 or 3 1/2\nIn a word: \"quirky\"\n\nDON'T BOTHER turning 21 for the mixed drinks. Despite all 3 servers standing before me to confirm that my \"Muay Thai Mojito\" was not the virgin version... puh-lease. They need to stop associating one of my favorite sports with this non-kickin', non-punchin' drink.\n\nOnly about the first third of my time was spent consuming my dish x beverage. I didn't want to leave the music, so I slowed way down and got into the salad (which I'd previously cast aside) and rice. The salad eventually vaporized, so I ordered a second dish x beverage and kept groovin' to covers of all-time hits till ~15 min before closing.\n\nFuture plan (if there is a future): Sit at the bar. Get one entree or two smaller dishes. Any beverages except cocktails. Limitless time to jam to the elevator music.\n\nNotable decor:\nEvery waiter's \"I Heart Thep Phanom\" or \"Waller x Fillmore\" t-shirt.\nHen stuffed animal behind the bar.\nMedieval Times curtains.\nHuge wall painting.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "food was actually grrreat, flavors were amazing. i give 4 stars because i asked for extra spicy, and i didn't get it. very disappointed for that. i didn't want to offend by asking for chili flakes, but c'mon that doesn't even make up for the layers of true thai spiciness. very sad. another downer was that our server forgot about us, after we asked for the bill. like for 10 minutes.  :( oh well.", "author": "Kit U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "I live close by and this has become my go-to spot for Thai food. The staff is really friendly and welcoming, and the ambiance is exactly what you want in a friendly neighborhood restaurant. I have tried a few dishes here and all were great. I strongly recommend the Tom Yum soup. It's pretty incredible. The salt and pepper beef appetizer is also definitely worth partaking in. All in all, this place is fantastic. Hands down a better choice than their competitors on Haight.", "author": "Hannah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "Great Curry and service!  The order online app is easy and always ready quickly.", "author": "Allie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "Why does this place only have 3.5 stars?!?! I honestly don't understand. \n\nThep Phanom is an amazing thai restaurant with very tasty thai food.  The ambiance is warm and intimate.  The service is very good, too! Great for a date night or dinner out with friends.\n\nTheir thaitanic beef is a must try!  Spacy and delicious!!!\n\nI would come back here every week if I didn't have a care about weight gain!", "author": "Suzanna F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-31", "description": "Had the chicken pad thai and the papaya salad.  The chicken pad thai was mediocre.  Not bad, jist nothing to rave about. no heat at all, and more tofu than chicken.  the Papaya salad was very fresh and delicious. My frind got the curry chicken and it was just ok. Definitely a watered down american-ized version of thai cuisine. Ben thai is much better in my opinion but in a different part of town.", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "Great restaurant that my SF friends always take me to. Lots of fluffy rice, big portions and great service. One of the best Thai places I've eaten. I always get the Pepper steak. Nice and spicy too!", "author": "Anne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-01", "description": "THAI-THENTIC!\n\nThai food served by waiters decked out in royal blue and gold Thai formal wear in a small palace-like setting with rich golds and burgundys, surrounded by Buddha shrines and paintings; you can't get any more authentic than Thep Phanom. \n\nOn Wednesday, 6.29.11, my friend and I went to Thep Phanom for dinner at 6 PM. As a full-disclosure, we know the owner's daughter at Thep Phanom. \n\nM E N U\nThe menu is extensive with many items you will not find at your typical King of Thai or OSHA Restaurants. HH Specials (Mon-Fri 5:30 PM-7:30 PM): $5 appetizers and $2 off all beer, wine and cocktails. All the food is made without MSG which is a HUGE plus in my book because I'm very sensitive to MSG. They also serve brown rice for the health-conscious. \n \nF O O D \nWhen it comes to ethnic cuisine, I prefer the most authentic and exotic dishes possible, so we asked the owner's daughter to order for us.  \n\n*THEP THONG: Deep Fried Chicken & Corn Balls (HH Special-$5, Regularly $8.95)\nhttp://www.yelp.com/biz_photos/mNBVE3uYArH0xwW3FM5gLA?select=du0cRl7x3drCaOzqu5Di_A\nHot and crispy, the deep fried bags were filled with savory pieces of ground chicken and sweet tender corn. The Thai chili sauce added a nice sweet heat to the golden bags. \n\n*KOO GUT: Crispy Fried Yam & Taro w/ Peanut Sauce ($8.95)\nhttp://www.yelp.com/biz_photos/mNBVE3uYArH0xwW3FM5gLA?select=kIZA0XE_AWNcFf7qsXSLiQ\nThick slices of the yam and taro were fried to crunchy crisp. I have a taro obsession, but I preferred the yam because it had a soft, tender texture with sweetness that went well with the savory, nutty peanut sauce. \n\n*CRYING TIGER: Spicy Grilled Beef Salad ($14.95)\nhttp://www.yelp.com/biz_photos/mNBVE3uYArH0xwW3FM5gLA?select=dla3wZb7OTh-V0WntXw5bw\nThe grilled beef was wonderfully seasoned with prominent hints of garlic and ginger. The char from the grill added a nice smokiness and the vinaigrette gave a nice acidic punch to help balance everything out. \n\n*THE DANCING LADY: Grilled Jumbo Prawns Stuffed w/ Crab & Serves w/ Spicy Sauce ($14.95)\nhttp://www.yelp.com/biz_photos/mNBVE3uYArH0xwW3FM5gLA?select=cx7YHZWrFMGTcnuL4wsDeQ\nHuge, succulent prawns generously stuffed with tender, sweet crabmeat. It was a simple dish, but the creative presentation, the seafood duo combo, along with the tangy, spicy sauce made for an exotic dish jam-packed with flavor. \n\n*TAMARIND FISH: Tilapia in Tamarind Sauce ($16.95)\nhttp://www.yelp.com/biz_photos/mNBVE3uYArH0xwW3FM5gLA?select=LWR6aQZOrkfduyKdOCx-xw\nThe tilapia was crisp on the outside and tender, flakey on the inside. It was coated with a sticky tamarind sauce which gave a subtle sweet and sour flavor that didn't overpower the delicateness of the fish. \n\n*PED TOD: Boneless Duck w/ Plum Sauce ($14.95)\nhttp://www.yelp.com/biz_photos/mNBVE3uYArH0xwW3FM5gLA?select=7WuTdRtg1RPxpV6YZvdOug\nSimilar to a Chinese roast duck, the skin was ultra crispy; however, it was deep-fried which crisped the duck pieces all around the edges while still maintaining a tenderness inside. The duck was salty and savory with a hint of sweetness. The plum sauce added just the right amount of sweetness with an acidic layer to help cut through some of the richness. \n\n*BIRDS OF PARADISE: Chef's Famous Quail ($14.95)\nhttp://www.yelp.com/biz_photos/mNBVE3uYArH0xwW3FM5gLA?select=AXddd23Uk9qIS87-D2vpfw\nPerfectly crispy on the outside, the quail still maintained a juicy, tenderness in the inside. I love that the wing was fried to a golden crunchiness which allowed me to devour the wing in it's entirety--crunchy goodness!\n\n*Homemade Cream & Espresso Creme Brulee\nhttp://www.yelp.com/biz_photos/mNBVE3uYArH0xwW3FM5gLA?select=2ppCU4rbOe5eh6gJiuWlZQ\nThe homemade vanilla ice cream was rich and creamy with a delicate sweetness. The silky smooth espresso crème brulee gave my taste buds a nice jolt with a sweet bitterness which was balanced with a crisp caramelized sugar crust.\n\nS E R V I C E\nFriendly and attentive but in a reserved manner.  Food came out relatively quickly and there wasn't much wait time between dishes. Each table was given a water bottle so you can refill your own water glasses which I prefer. \n\nA M B I A NC E / D É CO R \nClassy, exotic, and quaint; Thep Phanom is perfect for date or a small group dinner. The customary formal Thai clothing the wait staff wears and the ambiance's royal elegance makes for a unique dining experience compared to other Thai restaurants. \n\nP A R K I N G\nStreet parking which is more easily found up the block on Fillmore Street. \n\nLooking for a place to tickle your taste buds? If so, Thep Phanom will provide you with that exotic, sensuous gustatory relief.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "The best Thai tapas in the city with the most gracious and wonderful chef/host Tann.  Open Saturday and Sunday 12:15 both days.  Yelp is wrong! Come in and enjoy the deliciousness.", "author": "shawn p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "Thep Phanom surprisingly rose to the high expectations often set by a warm childhood memory. The food was a delicious adventure, as was the ambiance. The friendly and prompt service complimented the meal to make for a great dining experience. The only thing that would make it better would be if they still handed out chocolate mints with the check at the end of the meal - specifically the flat little rectangles dressed in green foil. Nevertheless, if you're looking for a great neighborhood Thai experience, I highly recommend Thep Phanom!\n\nWe ordered:\n\nTom Kha Gai (chicken in coconut soup): Warm, milky, with lemon flavor. Great appetizer & big enough serving for 2 hungry people.\n\nPed Sawan (marinated boneless duck in honey sauce): Sweet, hearty, delicious! Came with rice with the CUTEST presentation - see pic. The handle sticking out the top of the rice belongs to a oar-like paddle, for you to ladle out the tiny carb packets onto your plate. Had leftovers for a yummy lunch the next day!\n\nKaeng Karee Gai (yellow curry chicken with onion and potato): This dish made us laugh because they really didn't skimp on the potatoes! The potato in this curry came in halves or quarters, not tiny little slices. \n\ntl;dr - Friendly Service | Gorgeous Ambiance | Interesting Food with Generous Portions", "author": "Chelsea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "One of the more delicious Thai Spots in San Francisco and a good value too.", "author": "Yelp Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Best Happy Hour in San francisco.head chef Yann is the best Real BANGKOK CHEF in town. We live close and come every weekend. Top favorites are Sam KASATR, salad J,Tom kha gai,Birds of Paradise, Crispy Duo,Salt and Pepper Beef Strips,Latb Gai,Crispy Crescent Moon.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "My wife and I went for the prix fixe menu on a Friday night.  For appetizers we had the golden crescents (Fried pumpkin), tom yum soup, grilled shrimp, and papaya salad.  For appetizers she had the tofu and portabella sautte and I had the coconut seafood trio.\n\nAll in all it was very good food; I think the appetizers and the tofu/portabella were the best parts.  My seafood trio was a bit too sweet but that might be just my personal prefernce, I'm not a fan of particularly sweet entrees.\n\nThe service was attentive and when we got there around 8 it was not too crowded but that changed by 9.   This is a place to which I'd go back.", "author": "Alan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Excellent excellent traditional thai restaurant in the haight and possibly in SF. The service is great and the food is fantastic. They do all the classics right - pad thai, chicken satay, Panama curry, green curry etc. You can definitely taste the fresh ingredients in the fire. Highly highly recommend this place! Excellent find!", "author": "Kabir S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "This place has great good and excellent service! I enjoyed the dancing lady and the fries duck very much! The drinks were great. But the kind service and easy-going waiters made me very happy. I enjoyed the experience very much. It's an intimate unassuming place with kind people. Try it!", "author": "Kat L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "The food was amazing, excellent customer service. I had a great experience here. Everything was delicious. Make sure to order the appetizer Thep Thong.", "author": "Linh L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-11", "description": "not the great fresh tastes I was hoping for in a Thai restaurant. Maybe it was a poor menu choice...but my nose warned me when we walked in this might not be the best choice..... When the plate arrived the smell actually reminded me of my dog after a long walk in the rain, except I love my dog even when he smells like a wet dog.\nSkip this place\nsorry- get some fresh herbs and things will get better", "author": "Shirley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Everything we had tasted great & the decor was lots of fun. \nRecommend the Fred pumpkin, quail, panang chicken & thaitanic beef", "author": "Cindi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "First time ordering here from door dash amazing delievery from them. Me and my husband wanted thai food I yelp this.place got.some.good reviews decided to.order her. We got.the the big prawns, pad thai, vegetables, tamarind fish. All the dishes were very flavorful and tastefully.i would order her again and try their other dishes", "author": "Hoa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-02", "description": "Order the salmon basil and lemon grass chicken.\nBoth dishes were lacking flavor and very plain.\nIt was $15/per dish.\nThe best item was a complimentary appetizer.\nThe service was good.\nWould I come back? Probably not.", "author": "Xavier L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Loved it!  Great food and awesome staff!!!!    Beer specials did not influence this review at all... Promise!", "author": "G M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "It's very cozy here and I like the ambiance -- much warmer than most of the Thai places in the city. Food wise, it gets a 3-4 depending on what dishes you get. The pad thai isn't great, but the chef specials and seafood dishes are very tasty. They are just very nice as well, even when things get busy. And place is clean. \n\nNote to G.T. review -- all places are legally required to charge you $.10 for a bag. If they do it, they get to keep the money, if they don't do it, they risk being fined.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "I am no Thai expert, but I really enjoy dining here.\nThe ambience is fun, the staff is nice and the food is tasty.\nI recommend anything with pumpkins, and the vegetable fried rolls.\nIt's also a good place where to go in groups and maybe order multiple dishes to share.", "author": "Amira T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "Ordered take out (pad se ew, siamese rolls and the tokfu makur.) All sub-par dishes. The pad se ew was very dry and tofu makur was bland. The people working were very nice though.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "Enjoyed the food during our semi Xmas (yes review long over due), board and employee gathering for our nonprofit. We had fun, at this place near the heart of Haight. Service was great too. Liked the little sticky rice containers too.", "author": "Johnson H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "I have been coming to this place since it opened. Lovely setting, fabulous owners and wonderful service. Oh, the food? Fresh and delicious. From classics like Pad Thai, Chicken Satay, fresh spring rolls,  to house specials -- the preparation and spices make for a great meal. Very consistent over the years. This restaurant is not as young as the latest places in the lower haight, none, however, are better.", "author": "Harris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-24", "description": "This used to be a really amazing restaurant - with a nice intimate cozy vibe.   But it wasn't as good as I remembered this last time.  We ordered some happy hour appetizers - the deep fried corn and taro cake was pretty good, the cucumber salad was refreshing, but the larb gai salad and the shrimp salad were salty.  As for the entrees, we ordered the Weeping Willow (minced chicken with eggplant and basil), the prawn and pumpkin curry, and the fried tofu with mixed vegetables.  Everything was okay, but not great, and far too salty.  Given the number of good Thai restaurants to choose from in the city (and the bad parking situation nearby), this is not the first place I'd go back to.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-03", "description": "Another yelper called this pad thai \"the best pad thai in existence\" or something alone those lines, but they must have not eaten much pad thai because ew. Not only was it incredibly bland, but there were no shrimp which is listed in the description. \n\nEven worse, I got delivery, and yes I live on a busy street, but the delivery driver had the nerve to gripe to me about parking in my neighborhood and the possibility of a ticket AFTER I handed him a 25% tip in cash. Put Fell Street on your list of excommunicated streets if you don't want to deliver to me. \n\nTo sum things up:\nWhat do you expect delivery guy? It's San Francisco.\nAnd what do I expect? Nothing ever again.", "author": "Natalie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Love this place!! Menu is extensive and suitable for vegetarians and vegans. Food is fresh and delicious. Service is prompt and friendly. Family owned and operated place. Prices are super reasonable for quality!!! Definitely worth a try - one of my favorite Thai places!!!", "author": "Maria R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "I get that you can't deliver to the whole city, but don't say you're on your way and then cancel at the same time you're supposed to be pulling up. Bad form! Won't be giving my biz to you any longer!", "author": "Paul T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Was taken here on a date. \n\nWe arrived about 30 min before it was to close. We where reminded of this but other than that we did not feel rushed. The food was great and the atmosphere was really nice. Very nice traditional decor with american 50's (?) music playing. It was a great mix with out being cheesy. \n\nWanted to take  my mom here but they are not open for lunch.", "author": "Miray V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-22", "description": "a few of us came here after doing the friendshare event nearby.\nimmediately upon entering, i smelled a sour smell. staff opened up some windows. i wanted to leave, but we were all hungry so hunkered down. \n\nwe ordered pad kee mao, pad thai, fried rice, beef & veggies... to name a few. every item tasted bad.the pad kee mao was super salty, pad thai was really mushy, and fried rice was a runny due to the pineapple. nothing tasted right. very disappointed. \n\nthey have all these awards up in their walls and bathroom... noticed that they stopped earning any after 2009. did their main chef leave?", "author": "Mimi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "The special thing of this place is they have some Thai ice cream/sorbet that is so tasty and not too sweet. Make sure you order their Thai Iced Tea gelato , Roasted Coconut gelato and passion fruit sorbet. They are all natural made. We love having a dinner party there.", "author": "Funn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "This restaurant has the best Thai food in the Bay Area and has many years of awards to prove it. I live across the city and drive here to get take out because the food is so exceptional. I highly recommend the green curry, chefs famous basil mushroom and salad J, but everything is delicious. Definitely worth it if you can find parking.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "I have ordered from this restaurant on a few other occasions always seemed to some issues . Tonight ensured I will never again. I placed a delivery order and received a email confirmation of the order and my credit card was charged for the full amount. 30 mins after the estimated delivery time I call the restaurant to see what is the status of my order. After speaking to several incompetent staff members who can't seem to understand I am trying to find where my order  is , who keep asking me if I want to place a order I find out they charged me but did not process my order.  If I wanted my food I would have to wait at least another hour to receive it. Had to call the ordering service to get my refund as they refused to. Plenty of other thai restaurants in the city that are not out to con their customers.", "author": "Marie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Delicious!! Amongst the top Thai food I have ever had.  And well priced!\nPineapple fried rice!! \nThanks thep!!!", "author": "Jerry S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-23", "description": "Went out to dinner here with my roommate on a Thursday night. I thought the service was very good, atmosphere was very nice, and the wine list is surprisingly good. \n\nI ordered the beef munamun (probably mispelled that) curry and my roommate got his usual grilled beef (the dish has a name, I'm just blanking). \n\nI don't recommend the curry I ordered, I thought the sauce was off in flavor and too thick, but I'm fairly certain I just ordered the wrong thing. Everything else coming to the tables around us looked amazing. Mine just looked...blah. The sticky rice was great though!\n\nAs I'm typing this I realize that I probably should make another visit and try something else.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Great thai food....have not been here in 20 years. Place was packed and parking is pure hell...but the food is fresh, fragrant and flavorful.\n\nNice tofu pad thai, fried calamari(crispy and spicy), nice spicy shrimp dish. And the folks that work here are really great. Glad I came back.\n\nthank you!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "So great to come back after a few years. As good as ever! #yum #classic #thai \nTo expand- I've been coming here for 15+ years. I've never had them as take out, always dining in. I've had numerous phenomenal meals.. Quality meat- when I don't go veggie, excellent spices and favors- the hottest Thai I've had, when I asked for \"spicy\". Consistently good service and food. Plan for arriving early or expect a wait; it's an intimate space. Five stars!", "author": "Ronda I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "I've been here too many times to list.  The food is consistently good and fresh.  They have remodeled and the new dining room is not as crowded and provides a nice, romantic ambiance.\n\nWe discovered they have a great Happy Hour menu with significantly lower prices on many items.", "author": "S E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-18", "description": "Delicious food and attentive service.  The food is presented beautifully, too.  I tried this place for the first time with friends last week, and was very happy with everything we ordered.", "author": "Eden H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "My coworkers brought me here for a nice farewell dinner and the service and food did not disappoint! Located between Duboce triangle and Haight my coworkers and I arrived during the restaurant's happy hour. We noticed that the happy hour appetizer portions were smaller but perfect for those who just want to nibble on something with their drinks. The waiters were friendly and attentive and the drinks were HUGE! I had a Mai Tai and one of my coworker's ordered a Singha.\n\nWe ordered the following items family style:\n\nSpicy Green Papaya Salad \nChicken & Shrimp Pad Thai\nYellow Curry Chicken & Potatoes\nBasil Chicken\nSticky Rice\n \nAll the dishes were delicious, except the Yellow Curry Chicken was a bit too salty for my taste, and the portions served were large enough that I was able to take a doggy bag home.\n\nThep Phanom has been around for almost 30 years now. I definitely recommend this place if you are looking for some good thai food and a real SF dining experience.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-15", "description": "I think it must be different chefs with different skills that work here - if you look at the reviews, they are either a 1 or 4/5 stars (binodal distribution).  last time, the food was really good.  this time, the pad thai was undercooked, dry, flavorless, and the shrimp looked wrong.  the chicken coconut soup was inedible and now rests in the disposal. (it was take out)\n\nCAN SOMEONE FROM THE RESTAURANT PLEASE PAY ATTENTION AND FIRE THE  BAD CHEF AND HIRE A GOOD ONE?", "author": "reza n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-18", "description": "I was determined to have some Thai food tonight, but wasn't going to venture too far out.  It seemed that this spot may be one of the better restaurants in the area, but I was very mistaken.\n\nThe siamese rolls were burnt, oily, and the filling was remarkably bland.  The sauce it comes with is intensely syrupy sweet and had a strange aftertaste.  Very underwhelming.\n\nThe tom yum soup with shrimp had a nice broth, but had some glaring flaws.  The prawns were absolutely butchered, sliced way too far open to remove the vein, and random bits and pieces hanging on for dear life.  My wife commented that the prawns looked like they had elephantiasis.  The prawns were also rubbery (massively overcooked).  There were raw pieces of galangal in the soup, which are inedible and should not be served, and then raw bell pepper and white onion.  I know some people like raw bell peppers, but the completely uncooked onion in the soup didn't make any sense and just overpowers. \n\nThe pad thai suffered the same prawn issue, being mutilated and overcooked (but not as bad).  The noodles were overcooked and all stuck together in a big lump.  Barely any tofu, peanuts or bean sprouts, and the whole dish was just one note and very salty.  \n\nBased on what I ate, the food here is not good or well executed.  I do not recommend eating here.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "We got takeout and the pumpkin curry was fantastic. I will definitely try it again.", "author": "Darren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "I really love this place. It has taken me a little while to find my favorite Thai delivery and Thep Phanom is it! I can't say enough about the green curry - super yummy!", "author": "Emily P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "This place is phenomenal. From start to finish. Service et food. Had a restaurant.com coupon otherwise i would never have heard of this place! Will definitely return as a regular. Thank you for a great meal! Also child-friendly! :)", "author": "s t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "A good place to go when you are sick and tired of the usual below $10/person Thai Restaurants.  The quality of vegetables and meat used here is noticeably better than those cheaper alternatives.  Expect to pay 20-30% more; however, don't mistaken this place as an upscale restaurant at $15-$20/person price point.  While they have table cloth, it is covered by a glass tabletop.  Interior is interesting, but not plush.  Tables are close together and it could get laud.  Staff was Thai, so perhaps food is really authentic as they claim on the sign outside.  Note that I've been to Thailand multiple times, but I cannot judge authenticity of Thai food.  All I know is that the food here was very good.     \n\nOnly problem with this place is that I can never remember the restaurant's name.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "The food I got was good (I believe I got the Titanic Beef because what a great name), but make sure if you're ordering takeout, you order rice too! My dish didn't come with rice as a default which I only figured out after I had gone home. Sort of a bummer. I'd go back, though, to try more things!", "author": "M.E. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "This Thai Restaurant is the best in the SF and maybe even in the Bay area bar none!. They have every day specials that they recommend base on what you are craving. I would recommend start off with the beef salad and pair it with white wine. I also love the Pad Thai, Shrimp Fried rice, and the crispy beef (its an appetizer). Try it and guarantee that you will not walk away disappointed from your dining experience!!!", "author": "Armand B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Titanic Beef, Basil Basil Shrimp - it's all good, all fresh. Awesome Thai food, lovely staff.  Used to be more crowded, much easier to get in now.", "author": "Tom D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-21", "description": "BLAND.  There are a lot of good Thai places in SF, this in not one of them.  The food is downright lousy and lacks flavor of any kind,  I've eaten there a  hand ful of times, and will not return.", "author": "Samuel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "We had an awesome Thai meal that was Michelin recommended for less then fifty bucks. The lemon grass chicken salad was phenomenal. Fantastic happy hour fro 5:30 to 7:00. I've been to Thailand a few times this place beats anywhere I ate over there.", "author": "Kristopher U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "I live around the corner from here, and this has become my go-to Thai place.  For the price (~$10/dish, cheaper appetizers during happy hour), I think the food is very good.  As a vegetarian, I like the range of options, particularly the Thaitanic tofu and the Pad See Ew.  The atmosphere is really laid-back and the decorations are nice.  Would definitely recommend this place!", "author": "Sophie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "Over the weekend, I had a really special experience at a restaurant new to us.  It's called Thep Phanom (http://thepphanom.com/Thepphanom/Home.html).  Wow!!!  Was it ever excellent.  Easily the best Thai cuisine in years.  We had their stuffed chicken wings for an appetizer.  Spectacular.  Then we had their Yum Nua (or beef salad).  Spectacular.  I had the red curry duck---best I have ever had plus the fact that the portion was huge. A friend had the lemon grass chicken with veggies...large portion.  Spectacular.  Our hosts had sautéed minced chicken and eggplant and sautéed chicken with Thai basil.  \n\nIt turns out I thought I knew all the really great Thai restaurants in San Francisco.  Maybe now I do.  It turns out that Thep Phanom has actually been around for years.  No idea why I hadn't heard about it.  It's address is 400 Waller Street at the corner of Waller and Fillmore.  Enjoy!!!", "author": "Gary R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "Thep Phanom is a very solid 3 star Thai restaurant in my book.  For an appetizer, I tried the Thep Thong.  This dish was completely awesome, and I highly recommend it.  It's chicken and corn made into a pouch-like form and deep fried like a spring roll and served with dipping sauces.  For dinner I had the pad thai which was not bad at all.  It came with 3 large sized prawns, egg, & tofu.  It was a little bit dry for my taste, but it did hit the spot for my pad thai craving.  For drinks, I'd definitely recommend the lychee mojito if you're a fan of lychee.  It's very sweet, but very tasty.", "author": "Zach S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-05", "description": "Ordered delivery.  Several ingredients were missing from what the menu described upon delivery.  There was a billing error, which I was disputing with the delivery service and was being resolved by the delivery service.  The restaurant called me over 26 times in the course of 4 hours leaving harassing voicemails - they went so far as to have the delivery guy follow a neighbor in to my secured building so he could pound on my door the next night.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "I recently visited here with a girlfriend because there was an hour and a half wait at our usual spot.  I looked it up on yelp and saw 3.5 stars and we were about to turn around, but there was no way I was waiting an hour and a half when I was this starving.\n\nWe were seated right away (party of 2) and the restaurant was full, but not packed.  The decor set a good atmosphere, and the settings made the place feel upscale. I liked that the rice came in the little baskets, but also appreciated the plastic lining (I would get nervous that the basket wouldn't really ever be clean without it). Much better than bringing it in a regular bowl like every other place. The service was great - checking in enough, but not too much.  It was that seamless \"I'm there when you need me, but not disrupting your evening\" kind of manner. One star for nice ambience and one star for service.\n\nI have a food allergy, and the staff was very knowledgeable about it and was able to recommend dishes or alterations to dishes to accommodate me.  That, I love.  I get so nervous when the staff has no clue and you can tell they are guessing. When our server wasn't sure, he double-checked with the chef and was happy to do so. One star alone for just setting me at ease.\n\nThen to the food... We tried four dishes: Tofu Sate, Fresh spring rolls, Salad (I am blanking on which one, but it also had tofu) and the tofu/pumpkin curry. The spring rolls were great and had a nice twist with added mushrooms.  I didn't get to try my friends salad (it had soy sauce, part of my allergy) but she said it was good.  The curry was really tasty, and it's hard to go wrong with pumpkin.  The presentation really was great and added to the upscale feel. However, the dishes really weren't pricey (so no upscale bill!). I think our total came to ~$50.  That's a good meal - $25 per person, with so much food.  No complaints with the food - so one more star. \n\nI'm glad we took a chance even though it was only 3.5 stars on yelp, because this place is really 4 stars.  We had a very pleasant experience, good service, good food - this may be a new addition into our \"regular\" rotation.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Past Friday I again stopped  to eat here. Just a fab place for thai. Kind staff, great food.\nTry prawns with fried portabello mushrooms.\nFifth  time visit", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-02", "description": "The food was fine. I've given this place two tries and have been let down both times. We're pretty reasonable and forgiving but when BOTH experiences fail...it's time to rethink where we get our thai food. \n\nTo name a few of the disappointments. \n\n1) We were told our food would be to our doorstep in 30 minutes. It took a little over 1 hour and we live a block away. To be fair, the weather hasn't been great, but still...a block away? I could walk there in 5 minutes, walking slowly... \n\n2) We asked for super spicy food (thai hot) and we got mild. I could hardly see any thai chili peppers in my dish. I'm not sure they tried. \n\n3) We got the +$2 prawn addition to one of our dishes. We got 2 small shrimp thrown into the dish...2...I might have been happy with 3.\n\nThat's the last time we'll be ordering from this place.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "My favorite Thai in the city! Great pre-fix and great staff. Best tom ka gai I've ever had, makes me so happy on a cold foggy night. It's also a great date spot. Go eat and leave happy and satisfied. It is a lil pricey compared to other Thai food, the pre-fix is a great deal though, and they have a happy hour! Grab a cocktail and some great dishes! It'll be worth it! I recommend the dancing lady, any of the curries, the bikini shrimp salad, and titanic tofu.", "author": "Meesh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "*10 buck ton of noodles and so much more*\n#greatportions\n#padseeawesome\n\nAfter a late afternoon of beer tasting we ventured over to this gem in lower Haight. First thing we noticed was the dress code. These servers had awesome pants on that I think they should sell. Big fluffy Aladdin like pants in bright Ted and purples. That along was star worthy\n\nA fun, international beer selection, cozy environment, and soft yellow ambient lighting made it quite a fun spot. The crowd was coming in shortly after we arrived\n\nThey have a drink called the Bangkatini... Amazing, was like emptying a juice box and adding booze...a super high class juice box\n\nWe were plain and decided to order pad Thais and pad see ew as I was craving noodles.\n\nMy goodness, a fat heaping portion of noodles and fresh vegetables amazed me. The noodles were not laden with grease but had amazing flavor in each bite. I didn't even need chili sauce to compliment it it was so good.\n\nWe threw the leftovers in a doggy box but I am sure to come back to try some more", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "Waiters in authentic Thai dress are the real deal at this unassuming Haight restaurant.  We experienced a slight language barrier on first contact.  But, any discomfort from that, and the tightly packed tables, disappeared when the food arrived.\n\nI opted for the $19.95 prix fixe menu.  While all the food was solidly good, the star of the meal was the appetizer -- long, curved, thick strips of fried pumpkin served with peanut sauce that elicted oohs and aahs from the table.  The texture and taste make this great comfort food.  The tom kom gai soup, with chicken and lemongrass, was tasty but pretty standard.  My entree of tamarind pork was tender and accompanied by a sweet tamarind sauce that was too sweet for my taste.  The freshness of ingredients was noticeable in all the food.\n\nThep Phanom provided great value in a city where that can be hard to find, especially if you're not a local.", "author": "Will T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "Im not sure why the reviews are just so-so.  I enjoyed my meal quite a bit.  this was our return to the US dinner with my family and we had a few drinks (alcoholic and non alcoholic to start).  Beers, which I was told were great and thai hot tea, which was delicious and continally refilled.  We started with the tom yum soup, that was not so great.  We ordered the \na) Basil chicken\nb) Red curry with chicken\nc) Pad Thai\nd) brown rice, which I LOVED\nAll the dishes were tasty and flavorful\n\nDessert- flaming banana with caramel goodness.  ooh the memory!  and there were other fruits on it as well!\nService was sometimes spotty but when we asked for something we got it right away.\n\nNext time in the Lower haight, I will be back!", "author": "Namita A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-28", "description": "Right down the street from my sister's apartment. Real neighborhood gem! All of what we ordered (see photos) were delicious and our party of 4 demolished every last bite.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "Great thai food! I placed a large delivery order for an event at my home. They were very professional; called to confirm the order (which I made using Eat24, here on Yelp). Very accommodating for special requirements/requests and the order was right on time. The food was great! Looking forward to going to the actual restaurant in the future!", "author": "Tanya S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-26", "description": "Always wondered about this dark Thai restaurant on the corner.  We finally tried it and had decent but totally overpriced Thai food.  If I'm going to pay over $10 for a Thai plate it better be amazing. \n\nThe yellow curry was good.  I do recommend if you decided to enter the place.\n\nService was fine, environment is nice and romantic.  Food needs to be cheaper.", "author": "Chad S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-25", "description": "Sooo sad to report the steep deline in quality.  Even with the 2 course menu including rice for $20/person, we won't return.  There was a long gap, over 30 mins between courses AND they forgot 1 person's (out of 4) meal.  The lag was also lame bc 3 (out of 4) ordered the same main dish (I know that's generally lame but it was the only choice that appealed to us).  The food was ok but not worth the price, wait & parking challenge.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-16", "description": "It's a cute place with a nice vibe, much better looking than your regular neighborhood Thai joint. I wanted more authentic flavors to come through, but all our dishes (duck larb, pumpkin tofu curry, pad see ew, and \"Thaitanic\" beef) mainly tasted of salt. Worse, the saltiness tasted like it came from either the granular salt or soy sauce, rather than a good fish sauce and/or shrimp paste.\n\nPoints for offering sticky rice, minus for sticking it in a plastic bag inside the woven rice container. If cleaning the weave is a pain, just put the sticky rice in a bowl -- the plastic is tacky and detracts from the experience.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "I really enjoy eating here. The food is delicious, the service is warm and welcoming, and the ambiance is intimate.  I always order the Tom Kha Gai - it bursts with layers of flavor!  I don't live in this neighborhood, so it's definitely a destination place for me.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "I love going here, the atmosphere inside is cozy and the decorations are nice. Good pad see ew and I love the pineapple fried rice. They have a good menu for vegetarians, i eat meat but a lot of my friends are vegetarians, so it's a good place for both.", "author": "Kalani M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-24", "description": "This place was great 20 years ago.  Now it's mediocre.  My papaya salad was bland.  My eggplant and tofu dish was just okay.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-21", "description": "1 hour 45 minute delivery time. My order came only half full in the container. WTF. So hungry by now I'm eating the napkins they delivered.", "author": "Roy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-25", "description": "Food was terribly greasy and chicken tasted horrible. Threw it out.", "author": "Tim O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-20", "description": "Had dinner here with 3 friends late Saturday night. The waitstaff was quick and accommodating to get us a table as it was packed from the regular dinner hour. That was about the high point of the service we received. \n\nThe food was bland and trendy presentation was clearly the focus over flavor. We asked the waiter for recommendations and he offered nothing more than quickly directing us to the two most expensive items on the menu. \n\nAppetizer offering was all fried and the soups do not offer individual portions. They also charge $2 for a bowl of rice to eat with meals that are made to be eaten with rice. How generous. \n\nAlso, I've never been to a restaurant where 18% gratuity is automatically added to a party of 4 followed by the sales tax being added last. Essentially we were charged 3% more on tip and then taxed on the full amount so the restaurant is pocketing extra tax money.  \n\nAnd never have I been charged a fee to have the bill split evenly four ways on credit card. Maybe it's a west coast thing (this is my first time in Cali)?\n\nThey get two stars for being clean, the brief moment of accommodation, and restaurant ambiance.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-18", "description": "Came here with a friend tonight and although the food is good, I am still partial to my other favorite Thai restaurant in the Tenderloin.    \n\nSome things that I liked:\n-Duck Larb\n-Dessert selection - much broader than most Thai restaurants\n-Hot drink selection - included COFFEE and HOT TEA\n-It was CLEAN (The inspection score=100%)\n-The service was pleasant.\n-The menu had a lot of options.\n\nI also ordered the Tom Kha Gai, which was ok.\n\nNothing extraordinary, but a good experience.  Yet, the cost is what surprised me.\n\n1 order of soup, 1 order of fried taro/yam (4 sticks), 1 order of duck larb, 1 order of bbq pork, 2 orders of rice (small portions), 3 orders of non-alcoholic drinks (1 coke, 1 small thai ice tea, 1 hot tea)  and the bill w/tax (w/o tip)=$67.  \n\nEEK.  \n\nThe portion sizes are smaller than some other restaurants.  It isn't such a big deal for me, as I tend to eat smaller meals anyways.  The bowl of soup was large and there was leftovers (which I think that I left at the restaurant *oops*)", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-13", "description": "Uninspired. I think that about sums it up. If you're looking for food, it's certainly that. Just don't be expecting that other special element: taste. Oh, taste--how I missed you! We ordered the lemon grass chicken and the pad Thai, and neither mustered taste. How can you make tasteless pad Thai? It's almost an accomplishment. Almost. Expect slow service, and some exotic music while you wait.", "author": "Stuart S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-06", "description": "I ate here a while back, but the food here was quite good and their happy hour deals are pretty great. We got a variety of dishes, none of which disappointed. I also enjoyed their cocktails, though they are very sweet and girly. Sadly, I had to knock a star off for a bug on one of our dishes. They brought us a new one, but definitely kinda killed the appetite.", "author": "Aleyna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "One of thee best Thai restaurants in SF by far.  If you have ever been to Thailand you would know that this place is as close to authentic you can get in the bay.  Try the pineapple fried rice and eggplant beef!!", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-17", "description": "After a long day of traveling I called in an order for delivery.   They told me no problem it would be there in 30 minutes.   It never showed, no call or anything.  I tried to call them and their line was busy every time I tried for the next hour.  Screw these losers!", "author": "King O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-09", "description": "I'd heard how amazing this place is from a number of people.\n\nBut.\n\nI was not bowled over.\n\nNot knocked off my feet.\n\nIn fact I was more knocked over by the big bill at the end of an OK meal.\n\nI'd stopped in here, after a long day. \n\nI called my friend to meet me.\n\nReluctantly he met me, claiming he had already eaten.\n\nSo we split a simple fried tofu appetizer, and I ordered the basil fried portabella mushroom entree with rice.\n\nHe sampled some of the entree, but barely touched it. I found it tasty, and enjoyed the crispy portabella, but have had had better thai food elsewhere.\n\nI was the only one who really ate and the total came to 26 dollars.\n\nI'm sure the rest of the menu is probably pretty good, but I don't think Thep Phanom's food is worth their prices.\n\nI can buy a whole week's worth of amazing Love N Haight sandwiches for about 26 dollars. \n\nOr enjoy a dinner for two for that price - at Thai Place.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-12", "description": "We loved the venue and the food... but the service was VERY slow. We'll give them one more shot...", "author": "Sean B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-16", "description": "Formerly my favorite Thai restaurant.\r\n\r\nThen I discovered Marnee Thai and just like that, things were over for me and Thep Phanom. But I can't say it was only Marnee that did it. The increasing prices, combined with the decreasing quality is what lead me to stray in the first place. I'm loyal, but when I feel done wrong, I'm not the type to just lie there and take it, ya know?\r\n\r\nNow, though Thep Phanom is just blocks from me, I take the N-Judah  to my new favorite Thai restaurant where I get a consistently better meal at just over half the cost of what dinner at Thep Phanom would set me back.\r\n\r\nThep Phanom, if you want me back, get your act together. There are too many Thai restaurants in this town for you to be charging those prices for that food. Ya heard?\r\n\r\nUPDATE:\r\nI returned to Thep to see if my harsh words had had any effect. I was pleased with my meal. Not pleased enough to change from three stars to four, just yet, but I will return again to see if that might be warranted.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "I've tried a few other places for Thai delivery and this is by far the best. Thom Kha  soup was spicy and tangy, perfectly seasoned.  My son loved the chicken satay and the panang was well received by the husband. They will be my go to!", "author": "J H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-02", "description": "This is pretty good Thai, but the taste of the food is far from earth shattering. Dan raved about this place, but warned us that the old timers have complained this place has gone downhill. \n\nWe started with the Papaya Salad. It was gorgeously presented, but it was just shredded papaya. The Tom Yum Soup followed and came family sized, and each of us ended up with roughly 2 bowls. The taste was a bit bland. \n\nFor the main dish, we had the Titanic Beef, which was by far the best tasting, but most plain looking dish of the night. Then came the Tamarind Fish, which was quite good, but not particularly noteworthy. All in all, the food is barely hanging on to their 3 stars, but they get a little firmer footing for the gorgeous presentation and wonderful ambiance.\n\nIt's a fun place to go, but not sure I'd make it a destination.", "author": "Charlie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-18", "description": "Pretty good Thai food in a cute converted Victorian in the Lower Haight. Good enough to warrant it being written up as Michael Bauer's favorite Thai restaurant in the Bay Area for 5 years? I think not.\n\nStill, really good food and some inventive dishes.", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-26", "description": "got there early with a friend on a saturday night at around 5pm.  In all honesty, we just wanted to get out of the rain.  despite the torrential downpour, they insisted we should come back in 30 minutes when the restaurant officially opened, so we went up the street to the nearest walgreens to read magazines while we waited.  came back 30 minutes later and they sat us right next to the window to watch the lighting from inside.  \n\nthe interior was quite spacious and dimly lit, perfect for a date.  we shared the pad thai, yellow curry, thai ice teas, and two servings of rice.  It was the perfect amount for two average sized girls, even though initially, it didn't look like much.  \n\neverything was delicious.  they put crushed iced in the thai iced teas, which made them infinitely better for some reason.  And the food was not spicy at all.  Strangest part of the whole dining experience was the music they were playing: acoustic jazzy/lounge-y versions of old indie rock hits. just imagine a pink martini cover of Creep by Radiohead...uh alright.  lol", "author": "Tracy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "I've eaten here twice now. It's a block away from my apartment in the Lower Haight and I love having it in the neighborhood. From the outside it doesn't look like much, but it's one of the best Thai restaurants I've been to. \n\nHere are the must haves:\n-Punmpkin and shrip red curry (FANTASTIC!)\n-The fried fish with taro and tamarind reduction (they debone it too)\n-Thai iced tea (if you like it, it's great here)\n\nIf you have some non-adventerous dinners that like the basics. The pad see eww is moist and not to sweet. \n\nThe tom kai goong (lemon grass soup with shrip) isn't spicy enough. You might need to add some of your own chili. But some Thai friends said the intensity of the lemon grass flavor is right on. \n\nNice automsphere and delicous thai food at the right price.", "author": "Philip H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "What a disappointment! \n\nWe hadn't eaten here in years, but it was always one of our favorites. We went Saturday night. The service was fine, the atmosphere OK (except for the canned muzak), but the food was mediocre at best. We had about 8 dishes all told ( a large party) so were able to sample the offerings. The pad Thai was fine, but the steak dish was way overdone -- charred, actually, the chicken dish lacked any flavor at all; some of the noodle dishes were greasy.  A pork dish was actually the only really flavorful dish. Thankfully, there are many other Thai places in the city.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-22", "description": "I've found my SF Thai place. =) I'd go back any time. Amazing. Best Thai I've had.\n\nBeautiful service, food and interior ambiance. This place definitely has it all.\n\nI had the yellow curry which came with chicken and the standard onion/potato combo and I opted for brown rice (Which they have, yay). Also had a fish appetizer, unsure of name and one of the noodle dishes, unsure of name. Obviously I can only remember yellow curry but the other two were amazing. \n\nThe fish came out as a whole fish (kinda cool to see) with the interior cut out into bit sized pieces, there were also peanuts and mangos adorning the plate. Yummmmm.\n\nThe noodle dish had thick cut noodles, vegetables, and chicken. It was full of garlic tastiness. \n\nGo here now.", "author": "Kendra S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-29", "description": "The food here is just like the service. Novice and ignorant. It should be good, it's got all the right parts, but it fails at life. \n\nQuick review: bland, overpriced, bad service. If ur boss reccomends this place, kick him the the balls because he just fucked you.", "author": "Lawrence S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-24", "description": "This is Thai food for white people, which is to say it sucks. Thailand cuisine is known for being spicy, and spicy in the best way. Thep Phanom's cuisine lacks that in its entirety.\n\nThe ambiance is very nice--cloth napkins, decent low-key music, decent lighting--but it's *really* expensive for not having good food or the most amazing menu selections. If you didn't want a fried appetizer that's not meat on a stick, btw, you can't get it four days out of the week. Friday through Sunday are when you can get the fresh wraps.\n\nThey either need to cook their food properly or lower their price, both to get five stars.\n\nSave your money for one of the hundreds of other Thai restaurants in San Francisco and avoid this place.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "Value - 3.6\nFood - 3.6\nService - 3.75\nAmbience - 3.5\nOverall -", "author": "aaron h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "Most delicious Thai food I've ever had, and I've had a lot.\n\nAlso, great outfits on the waitstaff.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-11", "description": "I have frequented this place a few times over the years. Typically it is decent and once and awhile its really good. Last night it really sucked!\n\nWe ordered 2 appetizers ( fried yam and chicken wings) and 2 dinners ( Yellow Curry Chicken and Pad Thai)\n\nThe fried yam was ok. The chicken wings were incredibly greasy and exceptionally small. The Pad Thai was salty and the Yellow Curry Chicken was just ok. The best part was the brown rice.\n\nThe food lacked the spice I would hope to find in a quality Thai place. The total bill including two non-alcoholic drinks came out to about $50. I felt kind of ripped off and wished we stayed in.\n\nThe service and ambiance was nice.", "author": "Meia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "I love this place; nice ambiance, and the food is great.\n\nThe Crispy Tofu was really amazing (very flavorful and crispy!), and even though I'm not a vegetarian I'm definitely tempted to order this in the future. Pad Thai was also great. The Red Shrimp curry was excellent (one of my favorite dishes here).  Lemon Grass chicken could have had a bit more pizazz.\n\nCons: I think they've raised their prices, which I find disappointing because you really can find great Thai here for a reasonable price (for example, Manora Thai is excellent and cheap). Also, the rice servings were very small (and way smaller than it's been in the past), so overall, I guess I'm disappointing that you'll find less value here than you have in the past.  \n\nAnother con: for their anniversary, they are serving one free glass of wine or soju with your meal this month. Well, the wine and soju is, as one would expect, probably the cheapest possible. The soju tasted more like Gilby's vodka. When booze is that bad (crappy booze at a frat party is one thing, quite another with your dinner), I'd rather just not have it at all because it in no way enhances the food (it's bad when you're eating the food just to wash down the taste of gross booze).", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-12", "description": "3.5 stars rounded down.\n\nNot the greatest Thai place I've been to, but at 3 blocks away from our new apt at 9pm, we were hungry and it served its purpose.\n\nWe both ordered off the prix fixe menu, which is a very good deal if you have a \"nice meal\" in mind.  As in, nice presentation, interesting flavors, and small portions.  Interesting flavors I welcome any time, but the other two characteristics I wouldn't associate with my go-to neighborhood Thai joint.\n\nThe food itself was tasty.  I've been going back and forth (in the course of this review) trying to decide between rounding Thep Phanom up or down from 3.5 stars.  So I present you with the facts:\n1. The food tasted very good\n2. I was expecting less fancy, more filling dishes\n3. My thai iced tea came in a small aluminum cup (adorable) filled with crushed ice (ripoff) with just a few sips of beverage\n\nService was iffy.  There were three waitstaff to serve about 5-7 occupied tables.  It took us til the third guy to actually get some water.  With the second course.  It became almost a joke...how funny would it be if we asked every single waiter and went through all three courses without ever getting any water?  Almost a joke...that wouldn't be funny.\n\nAnd it looks like we're ending up rounding down.", "author": "Cathy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-21", "description": "The appetizers were my favorite part... fried pumpkin, spring rolls, and chicken satay.  I really liked the wine we ordered... it was red but i don't know what it was called.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "A very handsome boy brought me here several weeks ago and while it wasn't a Blow-You-Socks-Off experience (the meal, I meant), I can see how some people have a penchant for this establishment. It's cute, has that neighborhood-gem feel and the food isn't bad (albeit a bit on a pricier side, IMO). \n\nHe ordered the Pad See Yew noodles (did I spell that correctly?) and the waitress informed us shortly after taking our order that they were out of the specific type of noodle for that dish so we substituted the carbs using some shorter variant. He had a better experience with this dish the last time he visited this haunt so this didn't quite live up to expectations, I suspect. \n\nI ordered some 3 course meal with Bangkok chicken wings (something was unexpected about this appetizer but I can't recall what was 'off'), Tom Yum Goong soup and Red Curry w/ Pumpkin & Prawns. The soup was tasty but lukewarm and my curry didn't arrive for the first ~25+mins of our meal. We inquired about it at some point and it turns out the staff had completely forgotten about it :(. \n\nHad the soup been hotter, the noodles the right type, our dishes arriving on time, and had the boy not shown me the next day how easy was to make penang curry by whipping us up a batch, I might be compelled to give this place 4 stars.", "author": "Ida C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "You know it's good when the pineapple fried rice is served in an actual friggin' pineapple. I had the Thaitanic beef dish which was out of this world. Pumpkin and tofu with peanut sauce apps were great too. The only disappointment was the tapioca pudding, which was served warm and with lots of corn in it (?).", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "We've had so many nice meals here and I'm constantly surprised by the creativity of their dishes.  We plan on going back many times!\n-g", "author": "Greg B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-07", "description": "So here's an update. I guess I got my wish and they read my review, because I got a private message and this is what it said;\n\n\"YEAH. I read your message... and i think it's rediculous! THEY have many african american friends. For you to say stuff like that it's very FUCKING RETARDED. The other people who got seats in front of you guys probably made reservations! THEY do not treat their customers like that. Grow the fuck up. Maybe your the one who's racist to begin with LOL. DUMB IDIOT.\" \n\nAuthor of the quote above: Ms. Bartender G\n\nYea, how bout not being petty Thep Phanom Thai, and just have better service that does not prioritized by skin color.", "author": "arlene r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-18", "description": "Only 2 noodle dishes? I was disappointed. But then my boyfriend ordered the Pad Thai and it was great. I love that they serve it with metal tongs so you don't have to awkwardly scoop it off your plate with a fork. Very efficient, me likey! \n\nI ordered the tilapia with green curry sauce and coconut milk (Pra-In Long Srong). It was huge! For $15 you get a bunch of very tasty fillets that are lightly breaded and fried. It also came served on the whole fish that had been scraped out - awesome plating.\n\nOverall, this place is a yummy and not too expensive (but not \"cheap thai food\"). On a Wednesday night at 7:45pm, it was fairly crowded, which I take to be a good sign. I just wish they had more noodle choices.\n\nP.S. A+ brown rice.", "author": "Hannah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-25", "description": "I don't know why people make such a fuss over this restaurant. First of all, it's Thai food for white people. Second, they put way too much sugar in the food trying to compensate for ingredients that they can't get here. Third, the service is mediocre. \n\nI have been here throughout the years and recently went again because it was 9pm and they were open. The restaurant was half empty because of the late hour but we still had to wait over a half hour to get two dishes. What? Where am I? This isn't' Michael Minna. It's Thai food. When it finally arrives, I'm happy because I'm hungry but after digging in, I'm disappointed because this isn't my Thailand's Thai food. It's some watered down version for white people (which I am). Having been numerous times to Thailand, I want authentic Thai food. For that you need Ozone or Be my Guest.", "author": "Fiona F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "Pretty amazing, we lived next door for 6 years and miss it all of the time!  Many folks that visited us in SF were introduced to this place and still talk about it years later.  Definately worth a visit.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "This was the go to Thai restaurant for years ( in the 90's)  with our crowd,along with  Khan Toke Thai House for authentic first rate traditional Thai. They hit their high marks then when cuisine was not at the level of today. Not a lot has changed here, the quality is still high despite some of the reviews I saw below , but it's not as fresh or exciting as i remember. \nThey have  great deal going  from 5:30 - 7 weekdays with $ 5 appetizers. The wait staff still dresses in snazzy blue and gold and are very attentive and friendly if a bit shy.\nApps; Fried fish cakes, calamari, and vegetarian rolls not completely traditional but very good with a Singha, Thai  beer. \nChicken in spicy soup is killer with lemon grass and coconut  milk or the sour and spicy version. Weeping Lady : minced chicken with eggplant  was mushy in the mouth , not real appetizing. We had  the green curry chicken and red curry duck all good and flavorful. Pad Thai, of course, they do a real respectable version of this essential dish.\nWe also had  Param beef which I love with the peanut sauce. \nFinished off the meal with a deep fried banana and ice cream mmm. \n\nThe room is nicely appointed and ambiance fairly nice, all except the TV behind the bar which the staff seems to watch ,( yeah guys lose the TV)  and I would suggest they change the muzak in the place,  versions of familiar hit songs sung by very unfamiliar , wannabe singers. This starts out humorous then becomes annoying ,and after a few beers is funny again...", "author": "Aaron Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "This is one of my favorite Thai Restaurant in the city just for the very fact that they have all you can drink Thai Iced Tea.\n\nI'm a creature of comfort when it comes to eating so I tend to go for what I know especially when it's a new restaurant for me.  When I went here for the 1st time, I couldn't resist the urge to try The Dancing Lady...boy I wasn't disappointed.  Very tasty it's just too bad they only give you 4.\n\nThe prices aren't bad although I tend to eat Thai food a lot so going here is an extra treat because it is a bit more expensive than other Thai restaurants I frequent.\n\nI love the way they present the food and the ambiance is a big bonus.", "author": "Lyra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-17", "description": "I'm on the fence about this one.  I had one really good dish and one okay dish.  But even the okay dish was a big step above Osha Thai.  My best advice is to stick with the specialities and do not order the curries.  The curries are good but not outstanding (plus it's good to get out of that chicken green curry rut).  Their other non-curry dishes though are excellent .  I love the spiciness and depth of flavor.  \n\nStuffed chicken wings - stuffed with glass noodles then deep fried.  And without any bones in it.  How do they do it?\n\nWeeping Lady (love the cheesy names) - minced chicken with eggplant and fried basil.  Fried basil was done really well.  Crispy and flavorful and a real part of the dish instead of just an herb thrown in that you have to spit out because it's too overpowering.\n\nPrices for dishes are between $10-$15.  The two of us ordered a starter and two dishes and it was waaay too much food.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-03", "description": "Love Thep long, long time.  Hate the elevator music.  I would much prefer traditional Thai music or Thai opera.  Those I heart Thep Phemon T-shirts make me feel like I am Chucky Cheese. Go back to the old way of doing business and the customers will come back.  Tan & Pat are a great duo and put out some of the best Thai food in the world, and I have been to Thailand!", "author": "Kurt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-16", "description": "It's a small restaurant with a nicer decor than most Thai restaurants.  The food and the service are also above average.  Of course, it's also slightly more expensive with entrees in the $10-16 range.  \n\nWe had Calamari salad, the Dancing Ladies (Stuffed Prawns on skewers) and beef with string beans.  The presentation is much nicer than most Thai restaurant and everything was flavorful.  The food is spicier and more authentic at Lers Ros and Tawan.  However, if I have friends in town that want good Thai food, presentation and ambience, this would be my choice.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "Really yummy, cute, dimly lit ambiance, on a precious corner in SF. Great first date place.", "author": "p.c. m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "The charming staff is helful and easy to communicate with.\nThe atmosphere is good for a casual dinner or even a date night.\n\nThe price is slightly higher per dish than the place around the corner but I find it to be worth the extra dollar or two.\n\nWhen I last visited I had the fried portabello mushroom entree.  Amazeballs.\n\nThe only thing I would say left to be desired are a few appetizers in 4-6$ range, most of them are 8 or 9.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-13", "description": "The food is simply mediocre. I tasted the pad thai, the pad kee mao, and one of the currys. None of them really impressed me. There food lacked any spice what so ever.\n\nWhere this restaurant really fails is the service. We asked 3 times for more water but never received it.", "author": "Bill N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "I enjoy the food and the company. Very cozy but the parking in the area can be challenging so get out a little early.", "author": "Billy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "I do like a good Thai and this place serves up some of the best I've tasted.\n\nThe range of foods is really superb and there'll be something for all palates. Special kudos to the coconut rice, which was almost good enough to eat by itself, and the tamarind sauce - which frolics across the tongue like a heard of happy unicorns.\n\nAfter a couple of meals here I've yet to find anything bad. Portion sizes are good and, while the prices are highish, you get what you pay for. Food quality is good and the cooking superb and that comes at a cost. If you're hungry enough the set menu is very good value however.\n\nThe one downside is the music. Thai versions of pop songs might be all well and good in the privacy of a (well soundproofed) home but having to listen to it while you're eating isn't fun unless you're really into that sort of thing. A little less sugar in some of the dishes would be nice too.", "author": "Iain T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-24", "description": "In 2007 or 2008 this restaurant got strong reviews on a talk show on public TV, and so my partner wanted to try it.  The food was good, the servers were excellent, and the restaurant was comfortable.  We ate there several times.  About a year ago the whole thing began to fall apart.  They raised their prices significantly, the dining room became too crowded because their popularity had grown, and the staff weren't as attentive.\n\nThe final blow was when they put an extremely hot pepper (wasabi?) in my partner's dinner and I accidentally ate it.  It hurt so badly that I started crying.  To compound the situation, the server had an attitude about it.  She thought it was something mild like a bell pepper, and that I was overreacting.  \n\nWe don't go there anymore.  The hot pepper contributed to it, but the real reason is because they charge too much money for a casual venue.", "author": "Camille B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "Quality Thai food, good service, nice ambiance.  Prices are high so will only be able to go here once in a while.  But it was good.", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "I love, love, love Thep Phanom. It's a little pricier than the average my-refrigerator-is-empty-so-I-guess-I'm-going-out restaurant, so I really only save it for special occasions or for when friends are visiting from out of town.\n\nI've just never had Thai food that is so well cooked. They also have great vegetarian options. I recommend the crispy fried portobello mushroom served with crispy tofu and braised eggplant in basil sauce. It's both delicious and filling. Also, their pad thai is better than any pad thai I've ever had, and I've had lots.\n\nThe service is friendly, and sometimes they wear ridiculous poofy white pants or Hawaiian shirts, which just makes the experience all the more enjoyable. \n\nIt gets busy on weekend nights, so it's a good idea to call ahead to get a reservation.", "author": "Beth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "Food presentation is fantastic but basso nova renditions of Michael Jackson's Thriller album playing while you eat a sweet dish of Tamarind Fish (Tilapia to be exact) may kill the dining experience. It will definitely slaughter a dating experience if you and your date aren't enjoying great conversation! \n\nSo, if you can get past the music, the food is excellent! Flavorful and fresh and just the right amount to fill your belly. As others have already stated, the atmosphere is delightful, the food presentation is creative and it is very clean. Again, I can only speak for the food I had, which was the Tamarind fish but it was wonderful, for sure. I'll definitely return to try their specials!!! Definitely a great Thai restaurant!!", "author": "Dorothy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-26", "description": "I love Thai Food and have been unimpressed by the Bay Area's selection of good Thai restaurants until I discovered Thep Phanom. \n\nWe arrived with a party of 11 and they didn't even blink an eye, they set up the tables quickly, brought drinks and shortly thereafter they took our order.\n\nThe food came and was impeccably displayed. We split some appetizers, had a few dishes and finished out the night with a couple of deserts. \n\nThey were attentive, the food display was creative and well presented and the food was delicious. I would go back in a heartbeat. \n\nIf you are thinking of going here, don't delay, the decor could use a little sprucing up (it is very clean though), and the food is amazing.", "author": "Heidi S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-18", "description": "The poor to mediocre reviews are correct, in my opinion. Despite good service and a nice setting, the food is not that great. The prices are average, but who cares if the food's not good! There are definitely better Thai places in the city. We will not be returning here.  p.s. The muzak is funny for a few minutes, then gets weird and annoying.", "author": "Lisa E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "First, I consider myself a Thai food snob.  After 5 foodie trips to Thailand and trying at least 12 different Thai restaurants in San Francisco I have a pretty good reference. We went to Thep Phanom to try one of the only Thai restaurants in the city of any notariety that we had not experienced and found it to be really good.\n\nWe ordered the Prix Fixe for $20 which was a good deal.  Without the Prix Fixe, I would say that it was a little too expensive which is why I don't give it 5 stars.  For the quality of food, I think it compares similarly with my favorite Sai Jai (just a little more expensive).\n\nThe atmosphere was nice which would make it a nicer than average Thai place to take someone who doesn't appreciate the typical hole in the wall.", "author": "foodiewithadrawl S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "The food here is pretty fantastic but you pay a premium for it. After crunching the numbers and salivating over a number of dishes, I came to the conclusion that the 3-course prix fixe dinner was the way to go. I chose the minced chicken rolls, veggie coconut soup, siamese steak. I also nibbled off my friend's fried tofu and pad thai. I found portion sizes to be average, minus the giant heaping plate of fried tofu. Soup, steak and pad thai were particularly tasty. \n\nFor a 3.5 average restaurant, people seem to know this place has bomb food. It was a packed house late on a Thursday evening, which created a fair amount of noise but what can you do. Props for being superior to the chain gang of King of Thai and Osha (sorry, Bryan B.!).", "author": "Susan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-10", "description": "Parking is an absolute nightmare here.  Then again it's the city. I expected it.  \nThis small joint is located at the corner of Waller and Fillmore.  It was around 8 PM and the place was packed.  The tables are very close together and you're forced to clearly hear the loud table next to you at their increased decibels of whatever malarkey that they're talking about.\n\nThere's a small bar and one television hanging on the wall.  We ordered the chicken wrapped appetizer that had a great sauce, a salad that was a bit overkill with the lemongrass, the pad thai which was amazing and some shrimp dish that wasn't hitting the spot for me. The servers were friendly and they all worked together.  Each time someone came to our table it was a different person.  They were kind of eyeing to see if we had paid the check yet. The evening was dying down and there were other open tables now so I don't think the hovering was necessary.  The food was definitely good though.  I took the rest of the pad thai home with me and had it for lunch the next day.  I love pad thai.", "author": "Bernadette M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "In general speaking, the Thai food is good. But the price is little bit high than it should be. Environment is good for couples, friends hang out. I recommend the fried rice( with beef).", "author": "Sophie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-19", "description": "I ate here for the first time recently and I was disappointed.  The service was fine, but the food was only so-so.  I ordered from their fixed price menu, which is a good deal at $20 for three courses. The first course, two deep-fried packets of corn and chicken, was okay, but a challenge to eat.  The second course, tom kha gai, the ubiquitous coconut soup I usually love, was sort of pedestrian.  It was so full of inedible flavoring ingredients that I had to fish out large, tough pieces of lemon grass, galangal, etc. with every bite--ironic, considering the lack of complexity in the flavor.  Folks, strain your soup.  A piece or two I don't mind, but this was much too much.  The folks at the adjoining table were having the same experience with their soup.  The pumpkin/shrimp red curry entree had four chunks of pumpkin and two prawns, and the curry was sort of an unimaginative one-note flavor.  Hot, but just not...good.\n\nHere in San Francisco it's easy to become jaded with the number of really good Thai restaurants (three excellent ones within about five blocks of my house, for example) that a mediocre one stands out more than it might elsewhere.  Maybe the un-price-fixed menu features more imaginatively-prepared food.  I really wanted to love this place, but I just couldn't.", "author": "Earline A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-25", "description": "I don't know how this place scored such a good Zagat review, which is why we tried it, but it was below average and overpriced.  A massaman beef, spring rolls, and Tom Yum soup was $34, and all of it was pretty bad.  The beef especially was tough and had been stewing all day.  You've been warned!", "author": "Gibson V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-14", "description": "This was one of the places that I really missed when I left the city.  I am glad I got to come back and enjoy it.\n\nThey have some of the more flavorful and creative Thai dishes that I have had anywhere.\n\nThey are currently having a 23 year anniversary special menu, and it was a delicious meal, and definitely great value.", "author": "Adam O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "Without a doubt the BEST Thai restaurant in the City if not the Bay Area.  My family and I have been going here for over 12 years, and the food and service have been consistently great from day one for us.  \n\nBesides the consistently professional and attentive service and excellent authentic Thai food, Thep Phanom does not use MSG - huge plus!\n\nWe enjoy their Happy Hour during which tapas are $5 and drinks are $1 OFF.  \n\nThep is our go-to restaurant for both ordinary days and special days like birthdays or there's-something-to-celebrate days.  Dependable, consistent, excellent food and service!", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-24", "description": "Food was great, but seriously we paid $30 (two $15 main dishes) and they didn't even provide rice! Rice is NOT included. Unreal.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "I am avery happy to have eaten here.  Last night, all 12 of us were there to experience the great Thai cuisine they offer and of course, multiple bottles of wine! =)\n\nGood service. Very tasty food, I would not mind coming here again .\nWhat did we have?.. hmm..cant remember the names but we had tofu with green beans, fried eggplant dish, another different tofu w/ eggplant, jumbo shrimp on a big slice of grilled pineapple, shrimp curry, spicy chicken dish, fried fish, chicken wings~ stuffed w/ pansit noodles, eggrolls, fried banana desert served w. ice cream, coffee mousse like desert and coffee flavoured creme brulee.  whew.. obviously we ate a lot! =)\nALL dishes were superb! You have to go there and experience it for yourself!\n\nIt is a cute little, neighborhood Thai restaurant , on the small side but very authentic. I also thought waiters' outfits were 'cute'..heuheuheu..\nI really enjoyed this place and the good crowd that we had. Bliss.=)", "author": "C A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "Heck, I've been eating from this place almost everyday since I can remember *wink*. Still not sick of it. 5 stars!", "author": "Tip S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "One of the best Thai dinners I have ever experienced. The sticky rice was exceptional, the green curry was the perfect mix of spicy, creamy and tangy. Must go back!", "author": "Serena Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "I've lived in the Lower Haight for 7 years now and I've never actually walked the 3 or 4 blocks it takes to come and try this place out until this past Friday.  I've heard a lot about it so I was really curious to give it a go.\n\nI still think that these corner restaurants that sit below apartments are always kind of strange.  I mean, would you really want to live above a restaurant and have the savory smell of grease and oil drafting up towards your living quarters all the time?  I wouldn't, but since I don't live above this place I don't really care.\n\nThe place was nice and cozy and my friend and I ended up sitting at a table that was literally 6 inches away from the couple next to us.  This is always a weird situation because then you can overhear every word that they are saying and vice-versa.  So we started off with the chicken with spicy coconut soup.  This was some good stuff too.  I'm not a big fan of coconut flavored stuff but this had just the right hint of coconut milk and cilantro.  \n\nOur main courses were the pad-see-ew and prawn, scallops, and calamari with string beans and basil.  Both were pretty tasty but I have to say, for some reason the pad-see-ew was just off tha heez for me.  I don't know what it was exactly, but something about that dish was just really doing it for me.   The only complaint I have about the seafood dish was that I think there was only about one scallop in the entire dish.  The shrimp were nice sized though so I guess that makes up for it.\n\nOverall this is a nice little spot.  Give it a try sometime.", "author": "D L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "I love thai food, and Thep Phanom delivers! The atmosphere is great, the service is excellent and when I was there the speed and quality were superb. The menu has a TON of items, which can make it difficult to try and pick just one. The price isn't exactly the best, but the overall experience makes up for it, and its a small cozy place right off of haight. Check it out if you like Thai!", "author": "Dylan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Wonderful!    I've never had Thai dishes with pumpkin and I tried two different ones here.     I went with two friends and we ordered from the 3 course 19.95 pre fix menu which was such a great deal.    Some of the tasty things we tried and loved were the Crispy Crescent Moon (amazing fried pumpkin) Crying Tiger (incredibly flavorful spicy grilled beef salad) and the Shrimp and pumpkin curry.   \n\nService was very good and the food came out quicky but with enough time between courses to enjoy.   I would definitely go back!", "author": "Karen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "Get the crying tiger beef salad. I have no idea if it is at all authentic, but it's absolutely delicious. The rest of the food I had was pretty good, but when I return, I will get a giant plate of crying tiger beef salad. \n\nThe ambiance was surprisingly pretty. They have large drapes that obscure it from the outside world as well as a cheap, generic open sign (which I have a proclivity to judge since I'm a graphic designer). I've avoided by judging the outside for some time. The inside is actually quite beautiful and modern.", "author": "Ryen A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-15", "description": "We were sat for 20 minutes before we went and asked to have a waiter...bad way to start. Food was okay. Nothing exceptional.", "author": "Cody H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-06", "description": "The food was good. I recommend the chicken satay, there's just a touch of coconut milk to keep it oh so moist. Ingredients such as calamari, lean pork, eggplant, and green beans are fresh.\n\nBut, what's up with the plastic bag liner in each bamboo rice container? My friend and I each had to pull the liner out to dump the remaining third of our rice. The bag is a bit tacky, maybe even unsanitary? Do they think we can use it afterwards to pick up after our dogs?\n\nMy friend informed our server the liners were quite odd and the place should bring back the intricate rice bowls they use to have, sans the plastic liner...she said she'd give our feedback to the manager..we'll see.", "author": "Jonny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "Very good food and pleasant ambience!  After months and months of Osha, Jitlada and Neecha, it was time to try a different Thai restaurant.  It was very good and I'll be going back for sure. \n\nHere's what we ordered:\nPrix fixe of three items for $20 (great deal!) -- I ordered the minced chicken dumplings, the coconut soup with chicken, and the prawn/pumpkin red curry with basil.  My husband ordered kee mao noodles with tofu, and for an appetizer her ordered the \"crispy duo\" of corn and taro fritters with cucumber salad. \n\nEverything was very good.  The soup was a bit too creamy and thick for my taste, but everything else was solid.  The crispy duo was very tasty, as was my curry dish.  The items in the prix fixe were on the smaller side, but it was a nice way to taste more items.\n\nWe went on a Thursday night around 8pm.  It was lively, with a few large groups, and several people waiting to be seated.  The place is covered with Zagat ratings and other awards. \n\nI'll be adding this into my Thai food rotation for sure!", "author": "Molly P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "Moved to the lower haight pretty recently and am in love with this restaurant. The food is fragrant, flavorful and delicious and you can definitely taste the \"wok hai\" in their dishes. I love their Chao Phraya salmon, and their Tofu Makur. The South Sea Noodle is a bit on the oilier side but sooo good with the calamari and fish mixed in (I get it without the shrimp cause I'm allergic, and I've never had to send it back because that wasn't communicated by the server, unlike some other restaurants). \n\nMy only complaints are that the food can take a bit to arrive and it's a teensy bit pricier than I'm used to for Thai food (only reason they didn't get 5 stars), but worth it. They also have a three-course prix fixe menu on some nights that lets you choose from a wide selection of the menu, as well as happy hour every day!", "author": "Lyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-28", "description": "Truly delicious. I don't know if I've had better Tom Ka Gai soup...although it is always good isn't it? I love it when other people order the whole fried fish. Scares me, but cool to see...from afar.", "author": "jori m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "I had a great dinner with a friend of mine here tonight. We both ordered off the Prix Fixe. The thep thong (minced chicken rolls) were excellent, with a wonderful presentation, good texture and a tasty dipping sauce. The ambiance, food presentation and service were all good. My friend got the pumpkin appetizer. He wasn't amazed, but I appreciated the texture.\n\nThe chicken coconut soup was delicious, and the basil salmon (though slightly overcooked) was also good and altogether the meal portions were just right. My friend's tofu dish was a cut above decent, but he's prone to understatement.\n\nI will definitely be back, and not only because I live just a short walk away.", "author": "N M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-27", "description": "We were in 5 people and the staff was friendly, but the service sucked.\n\nThey brought each person's order with a 15 mins interval, which means that when the last of us got his food, we had all about finished eating.\n\nFood was OK, nothing special. The wait to get the food basically ruined our experience.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-25", "description": "Of the 70-some odd Thai places I've been to, only one other restaurant in the city, Suriya Thai on Valencia, has entrees priced at at least $10.  (Expect to pay as much for the appetizers.).  It's just not supposed to be that expensive!  I'm all willing to pay more for good food, but this was too bland to be it.  As much as I was craving dessert, I didn't even bother.  It's easier to accept mediocrity at a cheap restaurant compared to one that's pricier.\n\nI did appreciate the traditional garb on the waitstaff, and the atmosphere is suitable for a date.  But if I want ambiance, I can also head to just about any of the Thai joints in the Marina.  And while I'm there, I can get better food for less money.  Nice try, Thep.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-21", "description": "I tried. I swear I tried. I tired to have a mellow night in while all of my alcoholic Yelp friends partook in another DYL, complete with karaoke, hump trains and lots of alcohol. \n\nI walked in the front door at 7:30 and what did I find? A freakin 420 party in my living room, courtesy of my roomie and his homage to a certain recreational activity he enjoys! Damn, shit, I really wanted to sit on the couch and stare at the TV for hours. \n\nWell, if you can't beat em, join em....thats my motto, so a few recreational rounds later and smack dab in the middle of the funniest, slowest game of Trivial Pursuit I had ever played in my life, I realized I was hungry....and I mean really hungry!! It must have been all of the laughing that took it out of me, but I was ready to eat the pie pieces off the damn game board!\n\nAnd then it sunk in....I am a vegan for a month! What was I thinking?? I want a burger, I want a pulled pork sandwich, I want cheese fries and pizza and all of the stuff I can't have!! What am I going to do? What have I done? Why do people celebrate 420 anyhow?? Crap, why can't I have jalapeno poppers and a carne asada burrito? Would anyone know or care if I fell off the wagon (again)??\n\nWell, thank God that Barbara was here, and thank God she brought us all dinner from this Thai restaurant, and thank goodness she is also off the meat and brought things I can eat. It was good. In fact the tofu green curry was the best I have ever had!! Well, it is the only vegan green curry I have ever had, but let me tell ya, it sure tasted good.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-26", "description": "I bought these beautiful bamboo wind chimes when I was in Thailand three years back. Ok, to be honest, they're just average looking and everyone and their mom, even my mom, has one hanging in their yard. I prefer to hang mine indoors. Why, you ask? Because the sounds of those bitches clinking together is like nails on a freaking chalkboard or the continuous sound of the tape gun in the returns department at my work, which my office just so happens to be conveniently located next to.\n\nWhatever, the point is I find the charming touristy chimes to be obscenely annoying.\n\nBoyfriend and I decided to go out for Thai in my new hood and being the lazy, haven't-walked-more-than-two-blocks-in-a-year couple that we are, we chose Thep Phanom because it was two blocks from my new digs.\n\nRight away I fell in love with the place. No, it wasn't the shiny Sinbad pants the waiters were obviously forced to wear, it wasn't the constant water refills, it wasn't the overall decor, it was the papier mache elephants that greet you when you walk in the door. I LOVE ELEPHANTS! They're my thing. I know it's rather elementary to be obsessed with an animal. For example, I was always totally freaked out by \"horse girls\" back in sixth grade. Dood! Get a life and stop braiding that Breyer Horse's tail!\n\nBut for real, elephants...did you ever know that you're my hero?\n\nBack to the wind chime reference....the ambiance of the place was set by the sounds of what seemed to be a CD of a band who plays chimes as their instruments. It was clinky, weird and not very pretty at all. \n\nWe were pretty ravenous coming into the place and were really let down by our crispy tofu with peanut sauce appetizer. The tofu was completely bland, as tofu is. But it needed more umph! And though the peanut sauce was good, it was a bit watery and needed more peanut flavor.\n\nThe Tom Kha Gai was delicious, but the servers seemed really intent on serving our food in courses. And I like my rice doused with a healthy serving of Tom Kha Gai. So we ate a bit of our soup and waited for our final dish and the rice to come. But they kept coming by and asking if we were done with the soup, or if we wanted it wrapped up. Or they would just come over and stare into our obviously unfinished bowls. I finally told them that we wanted our soup with the rest of the food.\n\nThe shrimp with chili paste and green beans was good, but nothing spectacular. \n\nI'll come back because it's ridiculously close to my apartment, but I've got to admit I wasn't overly impressed by the food. I did appreciate them being on top of the water, checking in to see that everything was ok, and promptly bringing us our bill. But the place isn't cheap and the food didn't knock my socks off.\n\nAn extra half star for the papier mache elephants!", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-25", "description": "It's seriously too cold to be typing up a LONG review. My fingers are turning purple/blue while typing so I just have to keep it really short. I might update when I my fingers get back to normal color.\n\nI wanted to try this place for a while now. Ever since I saw it on Check Please Bay Area. Finally got to try it not long ago and it was great, not the best but great. \n\nCalamari salad was divine, ANGEL WINGS, yummy! It's fried chicken wings stuffed with glass noodles!! Seww gewdd!! (Sorry for my Chinese accent! =P ) That was my favorite dish. The pad Thai, quail on lettuce with the peanut sauce was also great. LOVE the Thai Ice Tea.. I'm like addicted to those suckers!\n\nService was great and prices were reasonable!", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-28", "description": "I've been here a few times before but on my last visit I ordered the pumkin curry with prawns.  This is my favorite thai dish and is hard to find in the city, and finding a place that does it well is even harder.  This was the best pumpkin curry I've had.   \n\nThe food here is always very good and I count on this place for reliable Thai.  I could do without the cheesy decorations, but it's definitely part of the experience.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-26", "description": "All of this time, I thought I had somebody down for Whitney.  But it turns out, you were making a fooooool out of MEEEEEE-HEEEEEEEEEEE!!!!!\r\n\r\nThe wise words of Miss Houston perfectly describe my relationship with Thep Phanom.  They swept me off my feet back in 2001 and dropped me on my fat ass in 2005.  It used to be so delicious and so special that I dealt with the fact that they were cheating on me with thousands of others but enough is enough!  the food is just not good enough anymore to excuse the hour long waits and ridiculous closeness of the seats.\r\n\r\nI still give them three stars because change is hard and i am weak. it's hard for me to leave a boyfriend. i still think he'll change back to the man i fell in love with and the abuse will stop. oh this black eye? no, no...i fell. i'm clumsy. it's my fault.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-23", "description": "So sad.\r\n\r\nThep Phanom used to be one of our favorites when we lived in the lower Haight. Even once we moved to another part of town, we kept coming back because the food was head and shoulders above the ordinary. \r\n\r\nA few years ago, they started sliding. It seemed that the drop in quality coincided with the removal of the specials boards from above the windows. Although it paled in comparison, the food was still very good, and we kept coming back, kept recommending it as our favorite Thai place, kept ugring people to go...\r\n\r\nSo you can imagine our sadness after eating there twice in the last 6 weeks, and having two mediocre experiences. In December, we ordered a pair of our old favorites -- tom yum goong and crispy basil chicken -- plus salt-and-pepper beef, a new one for us. The soup was bland and unbalanced; the chicken, formerly blessed with a wispy crispy coating, now had a blatant battering; and the beef was interesting but not terribly Thai-flavored, and unpleasantly chewy. We chalked it up to a bad night, and didn't give it much thought.\r\n\r\nLast weekend, we went back with a couple of friends. We shared everything, so I had a chance to grasp the breadth of the problem:\r\n\r\nSom tam -- green papaya salad -- is typically blazingly hot and pungently tart. Thep Phanom's version was neither. The rather small portion was served in a cocktail glass.\r\n\r\nTom yum goong was dished out tableside into flat soup plates, rather than bowls. The broth was almost clear, not even a hint of redness from steeped shrimp shells or chiles. It tasted almost as bland as it looked: no hot, barely any sour, a paltry 4 shrimp for 4 people. \r\n\r\nLarb ped featured tasty grilled, chopped duck meat, but the rest of the dish was bizarre. There were hardly any greens --typically you eat larb by rolling up the meat and seasonings in leaves of lettuce or other leafy veggies -- and, again, the spice was almost non-existant. Larb is supposed to be HOT!\r\n\r\nBasil chicken with crispy basil (gai kprow tod) suffered from the same problems as we noted on our last visit. Very sad... this dish used to be a true standout, a modern riff on a beloved thai classic. Now it wouldn't be out of place at a cheap chinese takeout joint.\r\n\r\nPanaeng beef curry was unspicy, badly balanced (sweet flavors completely overwhelmed the salty, spicy tastes) and oversauced.\r\n\r\nThep Phanom is still OK, but it's no longer great. It may not even be better than average.", "author": "anita c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-24", "description": "This was a decent Thai restaurant in the Lower Haight area. It had a nice clean, quiet ambiance with attentive staff. The food was good but not that flavorful. Actually, it was down right bland as far as Thai food is concerned. This might be a good place to introduce someone to Thai food because their senses won't be over whelmed with interesting flavors. \n\nI've tried a few Thai places in SF but I haven't found a really great one yet. I will probably try Thep Phanom again just to see if I find something on the menu that is exciting and different and FLAVORFUL.", "author": "Rex D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-20", "description": "It was my second time here last week, after visiting our friend in the hospital. So I think a review is in order. \n\nThe red curry I ordered was alright. I kinda like my curry with a bit more body, a bit thicker, kinda like Mariah Carrey a couple years back. (Don't you think she's a little on the thin side now??!?) This curry was kinda thin and watery. But tasted decent. The pad thai was pretty good too. My husband and our friend enjoyed the duck curry. \n\nThe soju cocktails are definitely worth a try. I've had the lychee cocktail each time and for 6 bucks! You can't beat that! A slight buzz with your meal is always appreciated. \n\nService is fast and friendly. Prices are decent. $65 was our total tab last time: 3 entrees and 2 drinks. They also have brown rice.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-11", "description": "I fall into this trap whenever I am in a thai restaurant.\n\nThe Pad See Ew trap.  \n\nI've passed Thep Phanom on many a walk home from The Mint, but never thought about going in. Looking for food in the Lower Haight, a friend and I decided this was the place to go as the other 2 thai options on Haight just didn't cut it.  (I only order Chili Cha Cha for delivery)\n\nIt was crowded but we were promptly seated in the back and I proceeded to have an extremely pleasan dining experience.\n\nThe ambiance inside is nicer then most little thai places.  The bar in the back is cute and the place was alive with chatter and good lighting.\n\nI scanned the menu and could not decide.  This was one of those thai places that didn't have pad see ew on the menu.  Finally free of my pad see ew shackles, I was free to try something new!  Who would have thought that I could partake in a new thai delicacy!  Freedom!  \n\nThey were offering a fixed price 3 course menu for their anniversary and it seemed the smartest thing to do to get an appetizer, a soup and an entree for $17.95.\n\nMy meal started with an awesome little plate of crispy wantons filled with minced chicken and corn.  There were only 2 of them and i was grateful for that, because the diet doesn't really call for anything fried. They weren't greasy in the slightest.\n\nThis was followed by the Thom Kha Gai which was a good balance, all lime and cocunut milk (The diet doesn't call for cocunut milk either so I took it easy and left most of the broth behind).\n\nMy entree was the spicy basil salmon, which totally delivered in spicy, not too much, but just enough.  The portion, again, not gigantic, but enough.  I liked their sizes as this ensured you could have a 3 course meal without feeling like a manatee afterwards. \n\nI love that they offer brown rice.  The brown rice was fluffy and good and not crunchy and sad like when I try and make it.\n\nThe staff was great and they let my friend and I loiter at our table for 2 hours after we finished eating.  \n\nI cannot wait to go back!", "author": "Jen I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-23", "description": "At someone's highest recommendation, we went here on a Saturday night. Letdown. Then I saw that Yelpers had collectively given this place a 4-star rating. Even more letdown, for it's the first time I've really doubted the usefulness of Yelp's future recommendations. At what point does the lack of information about each wildly diverse user, plus the distortions caused by individuals with special interests, begin to flood the system with nonhelpful ratings? I would hate to see Yelp turn into Amazon.com reviews or eBay ratings, where overall numbers cease to mean much and you have to read every single rating of something to (manually) extract any sort of value.  I thought Yelp was special. I thought Yelp was different. Don't be like the others who broke my heart, Yelp.\n\nSo, back to Thep Phanom. I can't understand why anyone would put this in their \"Best Thai\" list. A list of grievances:\n\n0. Not a hole-in-the-wall. How can you expect good Asian food that's presented in such a whiteified interior and proud of its ZAGAT ratings? Nothing says \"I am a boring snob who isn't a real foodie but has money to spend and therefore like to think I am cultured, because I rely religiously on this book that all the other boring rich losers read\" more than the owning a Zagat guide. Nonetheless, this is not a dealbreaker, merely a warning sign. \n\n1. Waiters in \"The King & I\" type, bright purple genie pants. This isn't some exotic Asian show. It's a restaurant. It looks horribly demeaning. But look at the all the reviewers who think the outfits are soooo cool! Geez. Go back to Oklahoma.\n\n2. Red curry was bland. Not spicy enough, and I couldn't really taste any of the spices. The only thing carrying the curry was the coconut milk, but that's like saying, I went to French Laundry and thought the prepackaged mints I ate while waiting to be seated were tasty. \n\n3. Ginger chicken was bad. Seriously, not even good. Way too salty, especially the black mushroom fungus that accompanied it. Not spicy at all. Not much flavor. \n\n4. They didn't even bother asking what level of spiciness we wanted on anything. Do you ever go to a steakhouse and they don't ask you how you want your steak done? \n\nIt's depressing just thinking about how not good this place was, how Yelp failed as a trusty resource, and how many tastebud-less, unadventurous (how hard is it to find good thai in SF?!), un-foodies there are ruining these ratings. \n\nI need a drink. Someone mentioned there was a bar across the street...", "author": "Gloria L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-02", "description": "My brother Daniel took me out to dinner tonight.  He's my favorite brother.  'Daniel you're a star. . .' (sing Elton John)\r\n\r\nWe went to Thep Phanom.\r\n\r\nI love elephants so thai food restaurants are always a fun time for me.  Thep Phanom has great elephants and a cozy interior.  I like the corner location which must translate well from a feng shui perspective because the place has nice energy.  \r\n\r\nWe ordered the siamese rolls, the tofu and veggies in lemongrass sauce, and the large prawns with lime in coconut sauce.  The rolls were perfectly crisp with the right amount of vegetables inside, and lovely sauce.   The tofu was breaded, and the veggies were fresh and crisp.  The shrimp was extremely fresh but the coconut sauce with the lime wedges was AMAZING.  I was using a spoon to finish the sauce it was so good.  \r\n\r\nThe service was sweet.  The people are all so polite and attentive.  I love their cute outfits which make the whole dining-in experience a nice change from all the other hip and trendy new restaurants.\r\n\r\nI look forward to trying out more of the menu and will now consider take-away since it's right around the corner.  \r\n\r\nYeah elephants, yeah thai food, yeah thep phanom!", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "The people who give this place 1 or 2 stars seem very adamant about its suckitude, but I've always enjoyed the food here.  Maybe I don't know what good thai food is or something.  Maybe \"inconsistent\" is a quality that Thep Phanom possesses.\n\nIn any case, I can only review based on my personal experience and expectations.  I REALLY like the food here--the \"Weeping Lady\" dish with chicken, eggplant and crispy basil is wonderful, and the Pad Thai is in the upper quadrant of good Pad Thai's I've had.\n\nYes, the ambiance is a little over-the-top fancy, and yes, the prices are not that of an hole-in-the-wall Thai stop.  I didn't even notice any puffy \"King and I\" pants--maybe they've changed their servers' dress code.  But the service itself was fine.  \n\nAre there cheaper Thai places in the city?  Surely.\nAre there better Thai places in the city?  I have yet to find a place I like more, but then I haven't scoured all the outer Richmond and Tenderloin hole-in-the-walls.\n\nWithin its neighborhood radius, Thep Phanom is probably the best bet for a quality Thai meal.  If you are a hardcore Thai connoisseur and think that fancy Thai served on white tablecloths can't be good Thai, then don't go here.\n\nIf you are in the area and on a date, or up to drop a little extra on a very fine meal, then by all means, give Thep Phanom a try.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-26", "description": "Uh... really expensive? \n\nThai food is never that expensive... especially for the mini sized portions. \n\nWhat? 2 hard earned bucks for a scoop of rice? Are you nuts? I guess it pays for those nice clothes they wear in there. \n\nIono... I could get the same food cheaper, maybe not the service... .but that just means less tip. Win- win in my opinion.", "author": "Eugenia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-29", "description": "Pretty good, pretty good!  I did not see pad see ew on the menu, so I couldn't order my \"usual\" for comparison purposes.  I was, however, delighted to find pumpkin and prawn curry as one of the specials.  The curry was very tasty albeit a bit too sweet for my taste.  \n\nThe restaurant is more cozy and traditional than modern and trendy, which is a nice change of atmosphere from Osha (although I do love Osha).", "author": "Grace W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-25", "description": "Update: downgraded from 2 stars to 1, after I eating really good Thai for less elsewhere. I didn't realize how crappy and how much of a ripoff this meal was. \n\nTerrible place for vegetarians - you have been warned! The veg section on the menu is extremely small and oddly, almost every item is deep fried. We settled on the corn cakes (average and better at Marnee) and the fried mushroom and eggplant. The latter didn't have any sauce and was extremely tasteless. I stopped eating after a couple of bites bc it wasn't worth the calories.\n\nAfter everything I had heard about this place, it definitely did not live up to the hype. I suspect that TP and Ploy II both used to be great places in their own right, but now they have passed the torch onto places that want to work for their good name, rather than just rest on it.", "author": "Shal J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Absolutely the best thai food in sf! My husband and i haven't been in many years and it is still so solid!! Delicious thaitanic beef, poached salmon in curry sauce. Excellent service! So worth the trip across town!! Just delicious!!", "author": "Simone H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-29", "description": "Lonely Planet wrote, \"Possibly the best Thai restaurant in San Francisco.\"  Yelp, of the 40 reviews, averages it to 4-stars, and to top it off, one reviewer stated, \"When a restaurant is always busy, there is usually a good reason.\"  I figured all of the above are enough reasons to check it out.  \r\n\r\nI walked in excited and eager, and I walked out feeling disappointed and slightly misled.  Could it be that the reason why it was so busy was due to the other people following the 4-star yelp review?  Or were they also guidebook readers, seeking the ultimate Thai experience that Thep-Phanom is famed for?  \r\n\r\nPerhaps, in some distant past, they did have a claim to such title.  However as of today, the crown belongs to someone else, and the search is on.", "author": "Sha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-19", "description": "I walked by this place on a recent Sunday afternoon on my way from a massage to the mint to meet our housemate John for some Karaoke. I looked at the menu and decided we should have dinner there. And we did. I was really impressed. The service was great and the food was excellent. The flavors were really authentic. Definitely a come back to place.", "author": "Nobbi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-18", "description": "A lot of dining is wrapped up in expectation, so diner be warned: This is not your dorm-room Thai food. This is the real deal!\n\nGo in with the knowledge that you'll pay more, but you'll walk away with a belly full of memorable dining experience. Be prepared to step outside your usual Pad Thai routine and you'll be rewarded with true Thai flavor and spice.\n\nFinally, go with several people so you can order more and sample everything family-style. Must-haves for us are always the Taro Root+Sweet Potato appetizer with peanut sauce, and the Crying Tiger Beef Salad to start, followed by the Crispy Portobello Mushrooms and Eggplant with tofu and some kind of heavenly curry. If they're offering the Red Curry with Winter Squash and Prawns, jump on it! Chase the spice with a Singha of course.\n\nKhorb koon kaa!", "author": "Teresa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-24", "description": "Although I don't consider the food at Thep Phanom to be the apex of flavor, every dish I have had there has been mighty tasty.  Six of us went family-style this past Friday and even though the joint was packed, we had a fun, intimate meal.  We left with bulging bellies and no leftovers.\n\nWhether dining alone, with another, or in a large group, the prices never come close to breaking the bank.  Best of all, the packed house on weekends creates a festive meal and when the wait for a table is long the hostess takes your phone number to call you when your reservation is ready.\n\nThe prix fixe menu is a delicious bargain at $18.95.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-05", "description": "Once the best Thai restaurant in all the land, resting on their laurels and slow staff have made this landmark into a black mark on my places to go.\n\nFirst of all the prices are completely out of hand.  \nThey have increased at a rate that outpaces inflation and is double that of any thai restaurant in the 'hood.  Yes, yes, the food is much better but their Thai Ice Tea has always sucked and they look at you like you have 6 heads for asking for brown rice.  \n\nWhat's worse is, they have let the \"always packed\" idea go to their head.  Yes, the food is good, the portions generous and well presented but the service gets worse and worse each time I go that I have decided to go no more.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-26", "description": "I liked the food here - I really did - but I left feeling a little confused. First, you need to make resos here for a Sunday night. Sign of a good restaurant, but in turn, loses that dive Thai restaurant feel that I was expecting, especially when visiting the lower haight on a casual Sunday evening. \n\nIt has nice decor, great waitstaff (and outfits), but a white tablecloth Thai restaurant in the lower haight?  The prices were reasonable, though a tad higher than my usual go-to spot, and don't get me wrong, the food is good, but not good enough to lure me away from my local Thai. If you're in the neighborhood or live in the lower haight, sure, but otherwise, it's not worth the trek.  Just my opinion.\n\nI'll keep Thep Phanom in my pocket as a safe standby when I'm in the neighborhood.", "author": "Defne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-26", "description": "I've sometimes wondered if thai restaurants photocopy their menus from other thai restaurants.  This isn't necessary a terrible thing - sometimes all you need is a red/green/yellow/panang curry, stir-fry with choice of chicken, beef or pork, or pad thai/drunken noodle/pad see ew noodle dish.\n\nI have, however, been pleasantly surprised by Thep Phenom's decision to break the mold and come up with some creative plates.  The thaitanic beef (please ignore the silly name), weeping lady, ped sawan (duck breast in a honey sauce over spinach) and basil salmon are all good choices.  And don't worry - the standards are all there as well.\n\nThe portions aren't huge so you might end up spending more money than you would at most thai restaurants; but the food is good and beats most cookie-cutter thai joints in the city.", "author": "Jamie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "Great Thai restaurant a block off from Haight. Nicer end of casual (tablecloths) and attentive staff. Good heat in the food, though I'm sure they could give you more if you asked. Papaya salad and ground chicken salad for $22, both best I've had in a while!", "author": "Aki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-19", "description": "I love Thep Phanom, I wish it was on my block.\n\nI've had a number of dishes there and I cannot figure out which one is my favorite, they're all good!\n\nHere's whats impressive:\n- The Food, they have a Pineapple Fried Rice that tastes like heaven and is served beautifully in a carved out Pineapple.\n- The Atmosphere. It's a charming Thai Style place with perfect lighting and a comfortable vibe.\n- They have awesome health code ratings, I think they scored a perfect score the last time they were reviewed by the Health Department (It's posted in their restroom)\n- The Service. The girls are super polite and genuine.\n\nIt feels like a treat every time I get to eat something here.", "author": "Gilbert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "One of my favs for years and they are still bringing it... food is fantastic, cozy neighborhood atmosphere, and great service.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-14", "description": "You've got to give at least a 3-star rating to a restaurant with hot waitstaff, right? And at least 4 stars to a place with hot waitstaff AND take-out patrons who ask you (a fellow customer) for their order because you apparently look like a waitress. Ego boost...NOT!\n\nOk, so I wouldn't say that Thep Phanom has a particularly good looking waitstaff, but I do like to stroke my ego once in while (while I am not stuffing my face at yummy thai places like this one). My first experience at this Lower Haight thai spot, though, did leave me with that lasting memory of being approached by a certain customer - likely 'cause of my good looks...errrr, or dark hair and slanted eyes. [Side note/rant/\"OMG, I still can't believe it!\" outburst: The waitresses were all wearing head to toe traditional thai outfits....and I was in my typical jeans, tank top and ponytail...?!]\n\nAnyway, funny experience aside, dinner here at this neighborhood dining spot, was quite delightful. All the dishes have catchy, yet strange names like \"Weeping Lady\" - name aside, that dish, although supposedly delicious, did not appeal to me. We did have a yummy tofu, eggplant, squash basil stir fry and a fried spicy prawn dish. I wouldn't get the prawns again - and but the tofu dish is a repeat. Other mouth watering dishes that I spocked and will likely try next time include the special quail dish.\n\nPrices - 3 stars: Ave. - pricey for thai \nAmbiance - 4 stars: Comfortable, clean with a flatscreen playing the Olympics (yeah, I almost choked up the prawn at the beautiful site of Phelp's Speedo clad body)\nService - 5 stars: Attentive, friendly and HOT ;)\nFood - 4 stars: Fresh, tasty but slightly too \"Americanized\" (I know, who am I to say...)\n\nOn a date, casual dinner with friends or early night spot before drinks in the 'hood - check out my friends at Thep Phanom - just don't ask ME for your take out order. ;)", "author": "Deann M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-07", "description": "This place is the thepest Phanom in the city.  \n\nI don't eat here as much as I used to but still a great place to bring out of towners who want a reasonably priced yet delicious thai meal, only a few doors down from my home.  I recommend the braised pork, although they only seem to have this on the specials sometimes.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "We were immediately seated at around 8:30 p.m. on a Saturday night, which was nice. I really liked the ambiance here. We ordered the Kaeng Pumpkin with fried tofu and the Chef's Famous Basil Mushroom. Both dishes were balanced, flavorful, and had a dose of \"funk\" in the best way possible. \nHowever, neither dish was particularly spicy. We asked for hot sauce and they gave us a really tasty and spicy (housemade?) chili garlic sauce/paste. It really livened up both dishes.\nThe rice is served in really cute individual woven baskets. In fact, the general ambiance is very nice at Thep Phanom.\n\nI would love to give this place 5 stars but they gave us the wrong sake (they do have an impressive selection) and the service was spotty (it was pretty busy, though). I shall return.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-06", "description": "I think the food here is great and deserves 4.5 stars. However, I ordered delivery from here the other night and was told it would take 45min.  I had to contact the restaurant twice and finally got my order in an hour and a half. The restaurant claimed their driver had gotten in a fender bender, but my food arrived piping hot, which I assume wouldn't have been the case had it been made when it should have been. I had pre-tipped delivery through eat 24 and asked for some sort of discount, and they offered none. Definitely a dine-in recommendation only, as their delivery system is never accurate.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-03", "description": "Very mediocre on my visit - there is better Thai to be had in the city for comparable or cheaper prices - a few that come to mind are Be My Guest, Thai Stick on Filmore or even Osha Thai.\n\nGreen Papaya Salad - I love green papaya salad but I did not care for this version - overly vinegary and salty; no embellishments like crushed peanuts, dried shrimp or dry roasted garlic slices as I'm used to having it served. Appearance resembled sauerkraut, which didn't help.\n\nStir-fried catfish - special of the day; the fish itself was salty and the dish didn't come with enough sauce, so it felt a little dry.\n\nRed curry with shrimp - this was okay; a generous portion & came with a good amount of vegetables, but the shrimp was a bit tough and the curry was nothing special.\n\nThe dessert was actually the saving grace of the meal; they had a fair amount of choices and the bananas foster we got was pretty excellent - large portion of bananas, berries & ice cream atop some kind of cakelike brownie.\n\nMaybe it was an off-night, but  I don't think I'll be going back - like I said, there are too many other options for better Thai.", "author": "Kathy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "Great place for yummy Thai food! I would definitely recommend reservations but they were also extremely accomodating when our party size doubled at the last minute. They also turned on the TV so the lone male of the group could catch his basketball game. \n\nCool decorations, fun atmosphere, and most importantly, great food. Be warned  - although you should always expect Thai food to be spicy, even the dishes not described as such were incredibly spicy! Try any of the Chef's specials/favorite dishes - with the exception of one, everyone loved the dish they ordered.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-25", "description": "If I can't complain about a single thing, then I have to give it 5 stars, right?  Wait a second, that sounds like I didn't enjoy it. I loved Thep Phanom.  \n\nWe showed up on a Saturday night. Five of us. \nThe hostess asks, \"Do you have reservations?\" \nGulp. \n\"No\" \nShe returns and tells us \"twenty minutes?\" \n\"Of course!!!\", we reply.\n\nWe saw something on the menu while we were waiting, prawns with fried portabellos, but it was a Sunday, Monday, Tuesday special.  What were we to do? Good thing my friend Rachelle doesn't embarrass easily. She asked if it could be made, and they gladly accommodated us!  (Anthony was glad she asked, but still embarrassed!)\n\nThe whole meal was delicious! Fresh Veggie Rolls, Eggplant Basil and Green Beans, Yellow Curry with Fried Tofu and Veggies, Spicy Fried Prawns with Crispy Basil (WOW), Pad Thai, and the special that wasn't on the menu.\n\nOne of my friends can't eat spicy food, and although most dishes one the menu are spicy, we managed to find 4 that weren't at all spicy so she could eat them and they were enjoyed by all of us!\n\nGood beer, and my friends enjoyed their thai iced tea.\n\nall I can say is that I'm glad I live so close by, and that they do takeout.  \n\nwhy had I not been here before?!?!!?", "author": "Markell M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-14", "description": "I live right around the corner and after about a million visits, I'm finally ready to review Thep.  Get ready, this is gonna be long one...\n\nDefinitely lacking on the noodle front -- both the pad thai and the silver noodles are eh; not enough spice, sauce, veggies or tofu (might be better suited for a meat eater though).  They do NOT serve pad see ew which saddens me to no end but c'est la vie! because the fried portobellos make up tenfold for the noodles.  \n\nBig, crispy fried portobellos, gooey eggplant, and perfectly cooked cubes of tofu with basil leaves and just a tiny bit of sauce.  Best combined with sticky brown rice.\n\nAso love the papaya salad with fresh grape tomatoes thrown in, which is uber refreshing in that sweet and sour kind of way.  \n\nThe thaitanic tofu is tangy and a bit spicy -- it's crispy tofu with cucumbers and basil but the menu gives us no clue as to what the spices are saying only \"It's the sauce that's Thaitanic!\" \n\nAll of the curries are super creamy and not too spicy which is right up my alley.  I know that they can up the spice anty  though if requested.  My only complaint on the curries is that the green is a little lacking on veggies -- might wanna ask for extra.\n\nThey have recently added Stag's Leap and Opus One to their wine list, which is a huge step in the right direction (old wine list used to be a who's who of the bottom shelf of Safeway's wine isle).  They've also added soju cocktails and a kinda makeshift bar/bartender in hopes of getting some of the yuppie business from RNM and Nickie's on Haight St. \n\nOverall: bad noodles, awesome everything else, fun decor, good service, and improving wine list.", "author": "Abby M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-21", "description": "Yes, Thep Phanom is as good as it gets, truly.  We've been eating here for about ten years now, but since moving to Los Angeles haven't been there in a while.  We decided to take my in-laws there for an early dinner, and I'm so glad we did.\n\nWe had moo prig king, pad thai, a sea food dish in a coconut sauce, and crab stuffed prawns.  Everything was simply outstanding.  Pad thai prepared to perfection; moo prig king spicy and succulent.  The sea food dish had prawns, calamari, and scallops--all excellent.  The crab stuffed prawns were glazed and served with roasted pine apple.  Generous portions.\n\nIn my ten years of eating here I've never so much as had an overcooked prawn or calamari.  The floor plan is a little crowded, and if you go during prime hours you'll likely wait a bit for a table.  But trust me, this place is very much worth the wait.\n\nOh, and price?  Good lord, they could increase their prices by 50% across the board and it would STILL be a bargain.  No complaints.  Only praise.  You must eat here.", "author": "Jaime B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-18", "description": "I went to this place Saturday night with three friends.  We waited a half hour, but went across the street to Cafe Soleil to have a beer in the meantime.  There's not really a good space for waiting there.\n\nWe split the spicy papaya salad and vegetarian spring rolls.  I had pork and string beans in peanut sauce, my boyfriend had spicy pork and string beans, friend A had red curry and friend M had some vegetarian thing i don't think I tried.\n\nAll of the food was great -- I would def. say one of the better thai places in the city.  The service was also really good and I loved the vibe.", "author": "Anne O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-07", "description": "Thep Phanom is absolutely my favorite (nice) restaurant. We went last night for my mom's birthday and it was the perfect meal. Naturally, I stuffed myself. My favorites were the beef and potato curry (massaman?) and the special of fried portobello mushrooms and prawns in chili sauce. I love, love, love when the food still tastes good all mixed together at the end of the meal and these dishes did not disappoint. Scooping up yet another serving of rice, I finished up far to many of the dishes. I usually don't care about service, because I like places like Tu Lan where you have to wait outside on 6th street before being served, but the service at Thep Phanom is exceptional. The waitstaff is super sweet and because there's about a 1 to 2 ratio of waiters to customers, food is served PIPING hot and fast. They literally swarm the table refilling waters, taking orders, and delivering plates. \n\nBasically, I love Thep Phanom.", "author": "Mairead J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-22", "description": "This was our favorite take out since our first date about 7 1/2 years ago, but tonight was probably the last.   This has always been a treat for us but over the last 3-4 years things have really taken a turn for the worse.  There is only one dish we order EVERY time: the crispy chicken with crispy basil.  Unintentionally, this has become our gauge.  Sad to say the consistency has always been a problem.  The portions varied drastically, and the amount of the delicious sauce fluctuated from swimming in it to merely a mist, like those annoying fragrance models at the mall are dishing it up!   The only thing that has been consistent has been the upwardly mobile prices.\n\nTonight we ordered the Crispy Chicken, Eggplant with tofu, and rice.  It came to $26, that's borderline overpriced, but when we finally got home and broke out the food, there was hardly enough to have a meal...and the chicken was almost sauceless!  \n\nIt is so sad when any business becomes arrogant and out of touch with their client base.  I'll tell them about the problems because they should have the opportunity to remedy them before they get the boot and, let's be honest, I'm selfish, I don't want to have to find another restaurant to replace this one.  \n\nPlease, I'm begging, Thep-phanom get your act together and bring back the quality and value that's been missing for the past few years and rightfully earn the Best Thai title.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "The best Thai food I've ever had outside of Thailand. Perfect for a nice dinner out. Delicious and not pricey. The waiters have goofy outfits. My favorite neighborhood restaurant.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "Everyday I crave their chicken sate. It is incredibly tasty and has a cream-like substance that covers the chicken. So delicious.\n\nThe Siamese rolls are also to die for.\n\nThe pad thai has a unique flavor that I never tasted in pad thai before = but I love it. There are a few big juicy shrimp in it too.\n\nMy only complaint is the amount of ice they put in the beverages.\n\nThe restaurant is decorated nicely and has a traditional thai vibe to it. The servers are friendly and attentive.\n\nI highly recommend Thep Phanom for anyone looking for a nice dinner out.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-21", "description": "Great spot for authentic Thai food.at reasonable prices", "author": "jeff s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "We visited the restaurant, and I just read the reviews.  Most are very accurate.  The interior is nice and cozy, the service was very good, but the food was not so great.  They do a very nice job with presentation but quality is very lacking.  We chose from the prix fix menu and were dissappointed.  Would have rather had some good yellow curry and satay.  \n\nWhat we had was nothing we have experienced at other very good Thai restaurants.  As we approached the restaurant the cooks, I guess, were sitting outside on the sidewalk smoking cigerattes . .not nice.  The Steak dishes were a disappointmnent.  Sliced pe\\ieces of steak, thrown over some tough veggies, covered with a somewhat burnt peanut sauce.  Salmon dish was mushy, frozen salmon for sure.  Chef Ramsey would have a ball with this place.\n\nReal nice people and a pretty place.", "author": "Dave J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-05", "description": "The food here is really really good. The plates are nicely made up, not just thrown together. There is some presentation. But it costs too much. $11.95 for curried chicken? Too much. \r\n\r\nDo you know how many chickens you can buy for $12????\r\n\r\nIts a really small restaurant and feels very crowded even when its not crowded. Its very prettily decorated. The wait staff is very nice.\r\n\r\nI'd like to eat here more than I do, but I just can't justify spending that much money on food I can cook myself. Or find made closely as well someplace else.", "author": "Marz W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-09", "description": "The quality of the food is high; the presentation is wonderful; the space comfortable; but the flavor disappoints.  The ingredients used were excellent, but I found all entrees I've tried to be on the bland side with little punch.  I felt as if the cooks were holding back.  I sense this could be a phenomenal restaurant with real curries -- thick and bold rather than frail and hurried.  But it seems they've dumbed it down.  Everything is top-notch except the taste -- which is a real disappointment because most of the Thai restaurants in the area are bigger on flavor but short on quality ingredients (and so many of them use MSG.  I suspect Thep Phanom does not -- though I don't know that for a fact).  It's a shame when less masterful restaurants are able to produce more excitement.  The quality is certainly here; the flavor is not.\n\nI am frustrated with this review because a 3-star review of Thep Phanom doesn't fairly represent the quality and potential of this restaurant.  It would be like giving the movie Shrek four-stars and giving the movie Gandhi four-stars.  Can you really compare Shrek to Gandhi?  Can one honestly say that because their rating is the same that they are equally as good?  The countless other 3-star Thai restaurants in the Bay Area don't hold a candle to the mastery that was expressed in quality, attention to detail, and presentation.   But, once again, there was little dimension in the flavor.  Hence the depressed rating.  I sense that the brilliance is dormant -- much like a smart student who never studies.  She still gets good marks, but not the kinds of marks that she could get.  Whereas other Thai restaurants work for their 3-star ratings, Thep Phanom earns its rating in its sleep.\n\nI emphasize my qualification of this review simply because I've eaten at so many mediocre Thai restaurants in the area.  To equalize Thep Phanom to the majority of Thai establishments seems unfair.  At the same time, it really needs to step up its game.  Despite its lack, I would return.  The disappointment from Thep Phanom is that it doesn't live up to its potential.  The disappointment from the other Thai restaurants is that they are just not good.  Flavor aside, the quality produced from this apparently unconscious kitchen is higher than any other I've experienced in the Bay Area in the past year.", "author": "SalsaBoy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-07", "description": "Not a very good thai place.  The food wasn't that great, and it wasn't that cheap either.", "author": "Elena L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-18", "description": "I've heard great and wondrous things about this place, but haven't managed to taste them.  I've been twice and both times I've been underwhelmed.\n\nThe bad (i.e., entrees): Panang beef was not at all spicy, and although the beef was perfectly tender, the sauce's sugary sweetness overpowered the other flavors.  Crispy basil chicken with eggplant had about six times as much soggy eggplant as anything else.  Birds of paradise (fried quails) were flavorful and crispy, but extremely dry.  Nothing was absolutely terrible, but nothing was good, either.  I get the feeling that some things they have might be great, but I've been unlucky enough never to order them after two trips.\n\nThe good (i.e., everything but the entrees): Spring rolls and fried shrimp rolls were great appetizers, and their peanut sauce is absolutely delicious.  Last time I went, my girlfriend and I were sitting next to the chef's pastry school certificate hanging on the wall, so we decided to order dessert.  We got fried bananas a la mode, and it was very good.  It was a banana deep fried, and served in a caramel sauce like bananas foster.  They gave us tons of fruit with it as well.  Service was perfect, and our waters were constantly refilled.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "Super cute little restaurant - we went on a pretty packed night - was a good thing we decided to make reservations.\n\nEverything we ordered was delicious from the shrimp rolls and veggie rolls for appetizers - to the pad thai, curry with shrimp and ginger chicken for dinner. I am quite picky when it comes to pad thai and this is one of the best - if not the best - I have had in the city. \n\nNow for dessert - kahlua creme brulee with sliced strawberries and blueberries on the side topped with a sprinkle of powdered sugar - I think I am in love.", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-05", "description": "Service is great.  Parking can be a pain.  Food range from ok to wonderful.  \n\nMy favorite\ncrying tiger\ntheir silver noodle (it has chicken and veggie in it)", "author": "L C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-23", "description": "Thep Phanom came very highly recommended...that's probably why I'm a bit disappointed. Had I just stumbled in, I might be singing a different tune. I've been twice now, and while both experiences were pleasant, I was told to expect the food to be outstanding.\n\nThe Tom Yum soup didn't have the flare I was hoping for, and I remember thinking last year that the satay we tried was the same as everywhere else. Each of the entrees I've tasted [family style is definitely a good way to hedge your bets and share the reading responsibility when choosing from a menu with 76 items] has been pretty good...none as good as the crispy tofu [I'm not usually high on vegetarian dishes, but this was worth it]. The King and I [a specialty dish] left me thinking that I should have ordered a Thai staple instead of making things interesting. My friends really liked the curries. Maybe this is the sort of Thai restaurant that does the simple dishes best. I'll keep that in mind next time...when craving Thai, go with the staples.\n\nThe atmosphere and service happen to be perfect, though...cozy, comfortable, cheerful. I recommend giving Thep Phanom a try with reasonable expectations, especially if you live in the Haight or Hayes Valley and it could become your neighborhood spot for Thai.", "author": "Jon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "I've always loved this place, especially when it was steps from my last apartment. However, I was really disappointed to discover that my favorite dish Pad See Ew was completely flavorless and almost sticky and mushy in texture. I was happy to see the addition of this dish to their daily specials menu because they had never carried it before, but they should've left it off. I was considering taking 2 stars off for this, but I love all of their items too much. Everything else is consistently tasty and the presentation is nice for a small local thai place.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-12", "description": "Thep Phanom.  This place was ph'a'nominal.  Okay, had to get that out of my system.\n\nAnyway, this place is so fucking good it's forced me to re-evaluate the other Thai restaurants I've reviewed on this site and bring them down a notch.  Really.  It's that good.  I mean, even their Thai iced tea is more spectacular than the Thai iced tea available at other restaurants.  And this is just Thai iced tea, folks.  It's not that complicated.  Tea, milk, sugar.  But it's better!  Here!  Here, it's better!\n\nTheir only problem - and it's not enough for me to bring it down a star - is the wait.  I've found that most Thai restaurants in the city tend to be able to seat you pretty close to imediately.  Not so with this place.\n\nBut there's a reason for that.  See how that works?\n\nAlso, their menu is huge, and occassionally has crazy names on it like \"Three's Company\" and the \"Pad Thai.\"  Crazy, huh?  Pad Thai... where do they come up with it?", "author": "Igor N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-20", "description": "Ok, so like many other reviewers, I was told that this was THE place for excellent Thai food in the city. The food was pretty excellent, but that is mostly where the good stuff ends for me. \n\nBesides having to sit so close to the couple next to me that I had to endure some idiot telling his date all about his infected toenail problem during my entree, the staff kept coming by every 30 seconds (i kid you not - I timed it) to fill my water glass. If I didn't drink any, they still filled it, until there was that bizarre water tension effect where the water was actually higher than the rim of my glass, but not spilling out yet. \n\nThe crazy sequined wraps of the waitstaff was quiant, but kind of weird too - all in all, a mediocre customer service experience. Add to that the fact that the restaurant was like 200 degrees from all the food and people and, well, you know.....", "author": "Nick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "The BEST Thai Restaurant in the city for creativity, service and the taste. This restaurant is owned by my friend but that's not the reason I'm giving it 5 Stars. I Love their unique way of presenting their food and the taste is just amazing. Parking is a little difficult so come before 630pm or take transportation. I would recommend making reservations to guarantee a seat because it does get crowded.", "author": "Deb C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "My 2005 visit was sad compared to my 1997 visit, the food just didn't compare.  I was blown away my first visit.\n\nThere was a special appetizer when my friend Tanya and I went.  It sounded like a tasty seafood dish.  When it arrived, it was a whole fish body fried into the shape of a bowl, with bits of its flesh mixed with melon inside.\n\nWe're from Texas.  That fish arrived and was just staring us both in the face with it's little fried-out eyeballs, and we couldn't stop laughing for 10 minutes.\n\nYou never recover from that.", "author": "Jay R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "I never had a meal at Thep Phanom that I didn't enjoy.  Not a veg restaurant, but they do have several veg options.  The Thaitanic Tofu is amazing.  Spicy and delicious.  The eggplant is perfectly cooked.  Most places tend to either over or under cook it, but it's perfectly tender at Thep Phanom.  The basil mushrooms are excellent.  The mushrooms melt in your mouth and the fried basil adds flavor and texture.  This is my favorite dish.   The fresh rolls are always incredibly fresh.  They have a really good peanut sauce.  The fried tofu appetizer with peanut sauce is also really tasty.", "author": "Dana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-09", "description": "This is the best Thai restaurant, in my opinion, that I have tried in SF! I am a Pad Thai snob and haven't had any great Pad Thai since we moved to the West Coast. I think the Thai food depends on which region they are from in Thailand, but whichever region Thep Phanom is from - I love it. The food reminded me of the Thai food back home.  Thep Phanom was absolutely delicious! I was having a huge pregnancy craving for Pad Thai and Thep Phanom totally exceeded my expectations! We were just driving by and ended up stumbling on the best Thai food I've had in a long time! I got take out, but would definitely eat there in the future. The decor is beautiful and the staff was very nice. Check it out!\n\n9/15/08\nI've eaten here several times since and the food is even better at the restaurant. I actually can't do take-out anymore, it just isn't as good. The pumpkin curry and tom kha gai are also very good too. My husband has experimented more with the menu and hasn't been disappointed. Yummy.", "author": "Keely G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "I'm new to the bay area and heard of this place from a friend and LOVED it.  Great neighborhood and the food was fantastic!  Loved the ginger chicken, basil chicken and lemongrass chicken.  We shared all the plates as a group so we got to eat family style.  The ambiance is nice without being too fancy or too casual.  We were also able to get a very affordable bottle of wine with our dinner too.  Can't wait to go back!", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-26", "description": "When a restaurant is always busy, there is usually a good reason. In this case, it's because Thep serves intricate, delicious, eminently reliable Thai food. Because this is a thai _restaurant_, not just thai food, many things are unfamiliar, and you may have to try a few dishes before you find something you're insane about. \n\nMy favorites: The Weeping Lady, Three's Company, Crispy Tofu (only have it at the restaurant, though), Tom Kha Gai (soup)", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-20", "description": "It's great to find a restaurant that tries to stand apart through its food and not its prices.  We were really impressed with the original variations on the usual thai fare.  There's no reason that a chef shouldn't experiment with standard dishes.  Many people have an ethnic food hang-up, and expect their foods to act in just one way.\n\nWe ordered the fried yams and taro in peanut sauce, the Thaitanic Tofu, and the Panang Tofu.  We were really, really impressed by the more intricate flavors that each dish had.  We will always notice when thai food isn't spicy, and were shocked when looking back, after reading a few yelp reviews, to realize that it wasn't at all.  And we scare people with how spicy we like our food.\n\nThe yams and taro were fried perfectly, with an amazing sauce and were served standing up in two aperitif glasses, rimmed with peanuts, making them envied by the next table.  Damn good.\n\nThe panang was a particularly smooth and rich curry...  with fresh pineapple instead of the usual canned, and was not too salty.  There was tons of crispy fried basil and cherry tomatoes, which was a fantastic addition.\n\nThe Thaitanic tofu was delicious with a very pronounced kaffir lime flavour.  There was something very subtly heart-wrenching about it.  Or at least it made one of us consider licking the plate...\n\nOn a previous visit:  The crispy basil chicken was the best I've had in the city.  Tons of crispy basil and amazing fried chicken instead of the usual stir-fry.  The prawns in the red curry were HUGE, and well not that huge, but they were large and damn fine quality.  You get the idea.  As all the ingredients here seem to be.  Oh yeah, and the curry had a refreshingly strong lemon grass aroma.\n\nAnd any place that would give out a free glass of wine for their anniversary is just cool.  The waiters and waitresses were really nice, and move really quickly, even when they were dealing with the one downside of our meal, the huge and rude birthday party of people who were so bad that no other patrons even chimed in to sing to the birthday boy.\n\nAnyway, we still cant wait to go back and save some room for the desserts because they looked awesome at the other tables.  We found that it was a really good deal for such excellent food, with such original tastes, oh, and very pleasant decor.", "author": "Nicole and Kayvon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-30", "description": "Got dinner here the other night. \nIf we didn't order the Stuffed Chicken Wing, it would have been worthless. \nThe red curry with pork - eh, not too bad. salty\nThe pad thai- came with a lemon wedge, taste was non-existent \n\nBut the chicken wing is amazingggg\nTry the stuffed chicken wing", "author": "john q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "Awesome Pretty Balls, Shrimp Rolls, and Crying Tiger... :-)", "author": "Michael A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "Love the presentation of the food, it made getting every dish exciting.  All of the food tasted great too.  Had a $5 app for happy hour and it was one of the best fried spring rolls I have ever had.  Definitely reminiscent of the egg rolls from back east.  \nHad a few veggie dishes and am excited to go back to try some meat dishes next time.  The staff was also very friendly and helpful.", "author": "nicole k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-05", "description": "The 2 of us ordered the Prix Fixe for $20 which was a good deal.  We had the thai beef salad, tom yung soup, chicken wings, chicken rolls for our starters.  All were well done and yummy, esp. the thai beef salad and chicken rolls.  The soup was ok, not sure what it was missing, it was lemony but maybe needed more of a kick.  For entrees, we had the BBQ ribs and shrimp/pumpkin curry.   Tjhe servings were a bit small, but what can you expect.  The curry shrimp was deelish, although you only get 2 jumbo shrimp.  The ribs were overcooked and a bit dry, but came with a nice sweet and sour sauce.  We also ordered the pad thai, and it was flavorful and nicely done.\n\nThe atmosphere was nice, the service was excellent.  Would go back!", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-16", "description": "I thought this place was excellent. The panang beef was chock full of crispy basil leaves, and the beef was tender, and the sauce great. It knocked my socks off.  All the food my neighbors ordered looked excellent as well -- and more unique. It was a tad expensive and they took a long time to take our order. My rating is subject to change to 5 based on a few tweaky contingencies.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "Cute little place with some good Thai food.  \n\nWe made reservations ahead of time for once and skipped waiting in the tiny little corner room, looking on as everyone else dined.  \n\nThe chicken satay was a little overcooked but the chicken was still flavorful.  As I recall, there's a lot of crying and weeping involved in the menu: Weeping ladies, crying tigers. We ordered one of the spicy salads, which was good but it not spicy at all. And they didn't make our curries hot enough to taste spicy, let alone make us/ladies/tigers weep, even though we asked for it. Begged really.  Oh well, the food was still good, the perfectly cooked rice was served in cute little baskets, my mimosa delicious, and the service attentive.  Not sure if I will come back though as the place at dinnertime was noisier than a dim sum joint at noon on a Sunday.", "author": "Violalalalalalalalalalalalalala T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-18", "description": "Eating here you know where youre money's gone - white table cloths, nice curtains and very attentive wait staff - Because the food, its just Thai food.  Its just plain ol' Thai food with ambiguous pieces of meat... Now don't get me wrong Im a huge fan of thai food... It sustained me as a student up in Seattle (some of the best thai I've ever had) and in Thailand itself.  I know what goes into a Green Curry or a Phad whatever.  I know this very well, so when it is priced at 12 or 14 dollars (twice what it would cost at a place like Thai Tom!) And its mediocre, I know that my money has gone to other places, like tricking the customers that this food is something else - something you eat at a fancy shmancy restaurant.\n\nIt reminded me of the Indian place up the street.. really typical asian food dressed up as something else.\n\nSo Im still in search of some really honest thai cuisine in San Francisco, suggestions?", "author": "Zachary K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-24", "description": "We've only been to our neighborhood Thai place once, but we were happy campers when we did. The atmosphere is nice -- not too casual, not too fancy -- and the service was friendly.\n\nThey have lots of vegetarian options, but I just saw Nicci S.'s review below and now I'm worried that my tofu dish had fish sauce in it. The food was really tasty though, fish sauce or not. We'll definitely go back.", "author": "Tamara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-13", "description": "I have been to this place three times and have been consistently disappointed. Maybe it's the quality-to-price ratio but nothing tastes as good as it sounds on the menu. A lot of the dishes taste like some key ingredient is missing. It lacks the comfort food element that makes Thai food such a big take-out staple. They also managed to mess up lemongrass tofu on our last order. It makes me terse and angry.\n\nTheir Kahlua creme brulee and tom kha gai are to-die-for good though.", "author": "Nupur L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "My favorite Thai restaurant!  The prix fixe is an exceptional value and a great way to sample some awesome dishes.  Some of my favorites-the dancing lady, Thai-tanic anything, the Tom ka gai soup, crispy mushrooms, spicy prawn salad, the crying tiger salad, I could go on forever.   Fresh ingredients and creative cooking style make this a place that I will be in love with forever", "author": "the c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "Surely some of the best Thai food to be found in SF and in a great atmosphere. It's a little on the pricey side, but it doesn't get much better.", "author": "James B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-14", "description": "Hm.... I'm a bit worried.  I just moved to San Francisco and am concerned if this is the best Thai that SF has to offer.  \n\nDon't get me wrong.  The food here was good and tasty, the presentation excellent, and the space adequate.  But, compared to Thai restaurants in Los Angeles and Washington DC (the other cities where I've spent enough time to be able to compare), Thep Phanom's food was only average.  \n\nFor one thing, it was rather on the bland side.  I'll have to go back and try something from the \"spicy\" section of the menu to see if that fares better.  But we had a red curry with shrimp which would have been at least a little but spicy at almost any other Thai restaurant and here it was rather weak and milky.\n\nAlso, the service was rather poor by SF standards.  We had to ask for the check three times, and they got one dish wrong on our order (we ate it anyway).  \n\nI'd really like to like this place, so I'll be back ... and hopefully will be able to add a star next time....", "author": "Steve O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-08", "description": "\"Time/Date: Friday 7:30 pm\n\nType/Quality: High Quality Thai Food; can't touch this.\n\nPrice/Quanity: Around $55 gets you a dinner for two with some leftovers. Our meal included: a thai iced tea, an appetizer of fried tofu, you should get this, a pot of rice, an entree of curried duck, a special of bass in banana leaf, and all the water you can drink.\n\nService/Accesibility: The food takes a while and so does seating w/out reservations(*A trick to get seated faster is to request a meal at the waiting bar if its open.). However, the service is friendly and they watch your water like hawks. Parking looks okay but be prepared to park a few blocks away; Hayes Valley is a good place to stroll. \n\nStructure/Ambience: The venue has a warm bustle, authentic thai decor, close seating, filled tables, and high ceilings .The plates can crowd the table so if you eat family style be comfortable with your company. The service is fully dressed in what appears to be traditional Thai clothing, i.e. neon Hammer pants.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-16", "description": "I'd just returned from Thailand and I was craving Thai food.  I'd always remembered Thep Phanom to be one of the best Thai places in SF, so I was eager to test out my new found expertise and satisfy my need to capsaicin.\n\nThe green papaya salad, the spicy seafood salad, and the larb all disappointed.  They were not spicy at all!  I asked for chilis and instead of the fresh ones I grew accustomed to in Thailand I got dried powder and some strange sauce, neither of which did the trick.\n\nThe crispy duck was good though duck is not my thing.  The vegetable curry disappointed.\n\nBoo :(.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-23", "description": "Whence the 3 stars, people?  This is the only Thai place I've found in the city at which, with a Singha and a plate of their amazing green curry, I feel like I'm back in Thailand.  I was easy to impress with Thai food before I visited the place where it's from; now, I'm not so easily won.   And this place has my vote.\n\nI'm drooling just thinking about their green curry.", "author": "Nori H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "Thep Phanom is a contender for my favorite Thai in SF--it's certainly the most consistent, and has an extensive and very creative menu that goes way beyond the basics.  Service is always impeccable, and the kitchen will make things genuinely spicy (as opposed to some of the overly sweet flavors some reviews complained of) if you ask.  It's on the expensive side, and it definitely has a lot of competition, but personally, I don't think it's gone downhill.", "author": "Ty D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-11", "description": "Phuk this place.\n\nSeriously.  It wasn't bad but it wasn't anything I consider above par.  I went to a Thai place in Maine that was better.\n\nIt costs a lot, and you're not necessarily going to get your money's worth.\n\nThe food + ambiance would give it a 3, but the service was pretty damn shitty-- you gotta earn your 20%.", "author": "L J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-10", "description": "Always great food. Prices ain't outta control, and portions are perfect, in my opinion.\n\nGreat service with a smile, and the decor is rich with stuff to look at. It's a little cramped, but doesn't seem to bother me. \n\nI suggest the duck curry.", "author": "Marty K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-03", "description": "To those of you who have not tried Thep Phanom, go enjoy. The food is downright royal. If you want a noodle shop, go elsewhere. If you want Thai Cuisine, come here. \n\nMany reviewers seem to bemoan that the food is different now than the way they remember it years ago. Being a recent transplant with no basis for comparison, Thep Phanom is easily one of  the best Thai restuarants I've ever been to. The absolute best is the Blue Elephant in Paris. Thep Phanom is close, half the price, and isn't halfway around the world.\n\nI've eaten here twice. Once for a very early weekday dinner when the restaurant was empty, and once with a large group on a busy weekend night. The food was much better when the place was empty, so I'd strongly recommend going during off-hours. \n\nIt seems the kitchen is easily overwhelmed by too many orders, but this is forgivable. Food of this caliber at this price is hard to come by.", "author": "G Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-05", "description": "Definitely the best  of the three Thai places in the Lower Haight. BUT...\n\nPoor dining experience. Long wait in a very cramped space, then slow service at very small tables that are really, really close together. Prices aren't expensive, but not cheap other compared to Chili Cha Cha or Visit Thai around the corner.\n\nAlso, this place is totally overrated. It's good, but nothing to email home about. Not sure what all the hype is about. Two blocks from my house for the last three years and I've eaten here maybe three times.\n\nOn the plus side, though, the waiters wear crazy pantaloons!", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "In SF this week for work and was at a buddy's house with his 3 year old twins.  Needed some food that we could get delivered (or at least to go).  Thep Phanom is closeby and I wasn't thrilled about Thai since I've had so much crappy Thai recently.\n\nWhat a pleasant surprise.  We had a chicken, beef, and prawn dish.  All were stupendous.  Not greasy, not heavy (even the peanut sauce), but super flavor and textures.  The prawns were obviously fresh (not frozen), and the beef was beefy and not crappy strips from the nether regions of a cow.\n\nAside - I'm writing this on the plane and the dude behind me literally hasn't shut up for 60 minutes about his Blackberry.  NEWS FLASH: I had a blackberry in 99 - it ISNT COOL ANYMORE.  I'm delighted you can 'message' people anytime as the rest of us have been doing for nearly a decade - shut the hell up so I can type in peace or get a new gadget that someone might care about.\n\nBack to Thai - good food for takeout - would recommend it if you're near Castro in SF....", "author": "Stefan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-01", "description": "Food was pretty good but didn't seem to match the slightly steep prices.  We tried the Grilled Octopus (which was really grilled squid), MassaMun beef, the Pad \"J\" (eggplant and string beans), and Pad Thai.\n\nMaybe we were paying for the atmosphere.  The restaurant itself has a very romantic air.  It is dim but not dark, it has close but not too tight tables, and all around us couples were speaking in hushed tones.  P and I played along and had a really nice time.", "author": "Pelle Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-30", "description": "It's the Thep Phenomenon.\n\nThese bastads have mastered the art of tofu-cooking. Lady fingers, or pretty lady, whichever dish has prawns on a stick - delicious. Their thom kha is also very good. \n\nYou might have to wait forever for a table because it's always packed. The traffic volume might be an indicator that you won't regret the wait.", "author": "C P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-06", "description": "This is my boyfriend's FAVORITE Thai place and he finally took me there Wednesday night.  Honestly, I was not impressed, or at least it didn't meet my high expectations.  The place itself was cute and very neighborhood-y so that was nice. Service was okay - nothing to write home about.  \n\nThe cucumber salad was pretty dry, not the best. \n\nThe Chicken Satay appetizer however, was really fantastic and is the only reason why I liked this place at all.  The peanut sauce was different than the usual and really tangy, and the chicken skewers were incredibly moist. Well done dish for sure. \n\nThe Pad Thai was also very dry and subpar in my opinion, since this is the dish that every Thai restaurant should be getting right. Not a lot of sauce, no real peanut flavor, only 3 pieces of shrimp in the whole dish and it was very dry.  \n\nMy guy ordered the Tilapia with Green Curry & Coconut milk (which appears to be the same dish the girl below ordered). The curry and coconut milk combo was delicious but the fish was awful. It was a project for him to eat as it arrived on this big wooden boat thing, full fish head with scales, brown and crispy, the fish was curled up and it was impossible to get to the meat beneath the scales. He spent the entire dinner trying to get to the fish and it was just not pretty.  \n\nMai Thai was okay, and be sure to try the Phuket beer.  \n\nAlso, not very cheap for a neighborhoody place. $75 with tax and tip for  1 dish, 1 1/2 appetizers, 1 noodle dish, some rice and 3 drinks.", "author": "Christine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-04", "description": "I ate here Sunday night on a recent trip to SF.  I like Thai food, just not so much the food served at so called Thai Restaurants.  Honestly, I've had better Thai food at the airport in Bangkok than most places in the US.  Almost always, the menu's have the usual suspects and no one place makes it less greasier or less generic than another.  But the food at Thep Phanom was pretty good, if only for the fact that their menu was more interesting and varied.  \n\nWe started with the Crispy Tofu (love the peanut sauce...I couldn't stop eating it).  I had the Thaitanic Beef & though not extremly spicy & I LOVE spicy, it was a nice change of pace.  My dining companion had the Panang Nuer which he said was okay.  But then again, Mr. Fancy Pants actually took a cooking course in Thailand.  \n\nThe prices can seem a bit high if you're used to spending $4.99 for the Pad Thai lunch special w/the authentic \"Thai egg roll\", but it's hardly outrageous.  \n\nThe decor...well, it's a neighborhood restaurant...it's colorful & cute...and awfully cozy (aka tiny).  But hardly anything to get worked up over.  I knew I was eating at a slightly nicer neighborhood Thai restaurant & it delivered on my expectations.", "author": "Soo H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "A must do!  I went to this restaurant for the first time with 5 friends, and we had the best time.  The food was delicious and we received so much of it for only $25 each.  We were all full after wards.  \n\nSome of the stands outs for me were the Crying Tiger salad, pad thai, panang beef curry, and fried tofu with string beans.  The only disappointment was the crispy duck - it was a little too crispy for me.  I really love Thai food, and this restaurant  delivered.  Some of the tastes weren't that authentic, but they were executed well enough.\n\nThe restaurant is small, and it seems cramped when you first walk in, but we didn't even notice the surrounding tables once we started.  The service was good, but our server could have been a bit friendlier.  With great food and great company, it didn't really matter!  (The padlocked closet in the men's bathroom kinda creeped me out.  Haha!)", "author": "Vicente G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-08", "description": "Thep Phanom is hands-down the best Thai food in the Bay Area, but I have to leave off a star, because of their service.\n\nGenerally speaking, their service is friendly, but the thing that drives me *crazy* is that they don't honor reservations -- there's no point in even making them!! No matter the time you make reservations for, they'll fill their tables to capacity and you'll inevitably have to wait a good 20-30 minutes or more to get seated, especially if you're with more than 2 people. Their space is small, so you're left with having to wait at their extremely cramped bar where you'll be standing directly in the way of bathroom traffic (this is in no way exaggerated).\n\nWith that said, the food's great and well-priced. For appetizer, get their fried calamari -- it's unlike anything else I've had at a Thai restaurant. I've never been unhappy with any of their dishes, so experiment!", "author": "Joyce S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-13", "description": "I sampled a variety of food from here that we ordered to go.  I loved it! \n\nThe steak salad, green curry, egg rolls and everything were amazing. \n\nNo clue how much it cost since I wasn't paying, but the food was great.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "Great. (better review soon)\n\nhj,\n\nthais don't use chopsticks in most part of the country.\nit makes that place more authentic.", "author": "Jon F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-03", "description": "I agree with the others than it is not cheap, for Thai.  On the other hand, I got the Lemon Grass Tofu and it was delicious.  To top it off with yummy 6.00 martinis, I can see this as a great reoccurring place for a nice dinner with friends.\n\nI did not have any of the negative dishes mention, and neither did my friends, but everyone seemed to enjoy there meal and the service was good.\n\nI say check it out and make your own conclusions.", "author": "Becky T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "Why is it that only the mediocore Thai restaurants do delivery? Thep is one of the nicer Thai places in the city... Err, at least in my part of the city.\n\nAnd sadly they do not deliver. But hey carry out works fine! They always have my meal ready in 15-20 minutes. Solid Thai food, and not too too pricey.\n\nSomeone should really open a killer Thai places that actually delivers...", "author": "Trey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-09", "description": "When I first walked in I was delightfully surprised by the atmosphere and overall mood of the restaurant. The staff was very helpful and bustling about even though it was only the beginning of dinner service.\n\nThe menu was a prix fixe Chef Special commemorating the 25h anniversary of the place, and it was perfectly priced. I ordered the shredded chicken rolls as an appetizer, the Chicken Coconut Soup (which was infused wonderfully with lemon grass), and was apprehensive about the Siamese Beef in the Curry Sauce, but was pleasantly surprised when I tasted the first lick of my fork dipped in the thick coconut curry. The beef was thinly sliced accordingly and the bed of vegetables beneath the sauce and beef was cooked \"French\" which was nice.\n\nThe Thai Iced tea was fragrant and traditional, like it ought to be. No boxed Thai Tea flavor like I've commonly tasted.", "author": "Trevor A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-05", "description": "Food was good but not amazing (props to the nice vegetarian selection though). The music playing in the background was fantastic - cheesy covers of old pop songs like Shout (Tears for Fears) and Material Girl. The mood was mellow. The staff was alright. We were rushed out of the restaurant at 11pm on Saturday when plenty of others were still there, which made for a less than pleasant ending of the night. I have no problem with being rushed out if a restaurant is closing/staff needs to get on with their night, but the restaurant was still full, and instead of explaining to us that they were closing (which they probably weren't), the waiter came back to our table a minute (or less) after giving us the bill and feigned surprise that we hadn't paid yet - he even picked up the bill (a lone piece of paper on the table - no envelope) as if he thought there must have been money/credit cards hiding under it, when obviously there wasn't.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "I live 2 blocks away from this place, why did it take me almost a year to try this place.  very tasty.  \nthey had a pumpkin prawn curry special tonight that was AMAZING!! i wish i had ordered this in triplicate as i now crave it.  may have to go back and get more.  also the thaitanic tofu was terrific.", "author": "Andrew r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-18", "description": "Yum!  This place is excellent.\n\nPossibly my favorite Thai food in San Francisco?", "author": "Joshua E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-22", "description": "I went there last weekend with a few friends and my girlfriend. It was Saturday, so the wait was expected. Unfortunately, there is no good waiting area and we ended up grabbing drinks across the street. After this tiny disappointment, everything else was just groovy. \n\nThe wait time we got quoted was right on the spot. The service was great, the staff was attentive and efficient. The food was delicious and very reasonably priced. The portions were generous and nicely presented. Timing was great as well. \n\nThe atmosphere was great as well. The staff is wearing interesting outfits (I say interesting, because my friends who happen to both be in Thailand said they haven't seen outfits like that over there). The decor was nice for an eye, comfortable and warm. \n\nIt is truly one of San Francisco's best! If you like Thai food, this one is a must.", "author": "Arek O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "It's all about the Crying Tiger salad and the taro fries!  This place is super yummy with good service... wish it was closer to my house!", "author": "Jen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "I hesitated between 3 stars and 4 and I decided to go for 4 stars. Thep Phanom was my first Thai food experience 7 years ago and I have spent so many incredible dinners in this place that it deserves well its 4 stars.\n\nThe location is nice (a nightmare to park your car though) and the waiters can be really fun (especially when you stay later on a Saturday) and friendly.\n\nThe food was amazing 7 years ago, and made me love thai food. I fill that it went a little bit downhill recently and deserves more a 3 and a half star. Still, larb is good, tom yum soup as well and the red curries or the fried tofu tastes the way they should (and do it Thailand).\n\nA safe bet, where you'll spend a good moment in a cool neighborhood.", "author": "Pascal L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-24", "description": "Visited this place on my short vacation to SF. At first, the food was ok. I have had much better Thai. But then my friend and I got food poisoning within 1 hour of eating there. BIG NO NO.", "author": "Marlen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-18", "description": "This place rocks! The Three's company is amazing and the pumpkin curry is simply divine! The wait staff is friendly, food presentation is excellent, and the restaurant is beautiful. What is not to like? They even play 80's classics arranged as jazz ballads...classy.", "author": "Uma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-21", "description": "I think this is my favorite Thai place in the city. I've found tha the specials tends to be much better than the standard menu.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "Loved the clay pot chicken...crowded but found all the dishes to be superb.", "author": "James V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-11", "description": "Thep Phanom is where I go when I'm bored of the usual Thai food. Being on the West Coast makes finding decent Thai food pretty easy, but everyone pretty much does the same menu, the same way. Not so with Thep Phanom.\n\nThe chef had western culinary training, and this definitely shows in both the menu and cooking. This is not your \"traditional\" Thai fare, and if I wanted Thai food that reminded me of what I grew up with, then I'd go elsewhere. I'm not so much of a foodie that I can name the spices from a single spoonful, but all the dishes I've had here had such complex flavours, which made everything so much more interesting to me. I'm not normally a big fan of Tom Yum (too one note: hot), but theirs was light with tasty afternotes of sour, citrus, and grassy. The Titanic Beef (one of their signature dishes) is wonderfully tender and I always think that there's something French about it, in a good way. And I love it that I can choose creme brulee for dessert.\n\nThe eclectic influences seem to manifest in the decor as well: traditionally garbed staff amidst a cozy homely interior that is flanked by a small bar. It is always packed, so reservations are recommended or try to get in right when they open.", "author": "Alberto V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-07", "description": "This is our regular Thai place whenever we think about Thai food in bay area. So felt no excitement to write the review.  But it's so good and there is a need to share it with other people.\n\nThe place is neat and full of a lot of Thai decorations even in the restroom.\nTheir iced tea is our drink every time.  We especially like its aluminum cup.  We tried their Tom Yum Goong and Tom Kha Pak.  I got caught once by the little green pepper in the soup and my mouth was on fire!!!  The soup would be our choice again but I just need to remember not to touch the green pepper.  We also tried their curry chicken.  It's mild and tasteful.  Pad Thai is our choice all the time since it's the best we have ever had.  The dancing lady would be a choice if you liked prawn.  The must choice is the Crispy Fried Portobello Mushroom.  And you wouldn't find it in other places.\n\nBasically everything there is good and you won't go wrong with any dish.  The only difference is spicy level.  Every time we stick with some dishes we like and experience 1 or 2 new thing.  Never get bored with their menu.\n\nWe love this place and it becomes our most favorite Thai restaurant since the first visit.", "author": "Ile F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "We ducked in here to escape the rain and eat something warm and got a very good meal.  We had one of the soups (not sure which, I didn't order it) and the vegetarian pumpkin curry.  I'm a sucker for pumpkin curry in general, but this was memorable.  The atmosphere is cozy and the service is very friendly and attentive.  Altogether a very good experience.", "author": "Ethan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-15", "description": "Feels like a more authentic Thai experience than most in the city.  The veggie fresh spring rolls are great, but only served on Friday and Saturday nights, disappointingly.\n\nBetter to go with a small group where you can share many options.  The Thaitanic Tofu is pretty good.  Servers very polite.  Do not order the Tamarind fish unless you're prepared for the full fish, head and all, to arrive on a plate!  The few times we have been there both seem semi-overpriced for what you get.\n\nA decent Thai option, but nothing remarkable about this place.  And parking sucks.", "author": "Tamra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-18", "description": "A long-time favorite of mine, really great and extensive menu, lots of  specials make it a great place to try lots of new things. I've always found the food to be great. One drawback is that, over the years, it seems the prices have crept upward. It's no longer the cheap and great Thai restaurant, now it's a bit spendy, I think due to its continuing popularity. To my annoyance, that popularity also means the wait can be long, when back in the day you could come here on a weekday and get seated. Now be prepared for a slog.", "author": "Art K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-14", "description": "I've been going here since they first opened, and I still think it's some of the best Thai food in the Bay Area. The yellow chicken curry is my favorite, and the spicy fish (which you can get either whole or fillet) is also absolutely good. We're blessed with a lot of Thai Restaurants around here, but Thep Phanom continues to set the standard for me.", "author": "Bret W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "I think the somewhat mediocre reviews are a knee-jerk reaction to the reputation this place has built up.\n\nThey've won numerous awards, which they proudly display on the walls.\n\nAs a vegetarian, I am always in heaven.", "author": "Soma L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-14", "description": "I love this place... I have never had a bad dish... and I have eaten here at least 100 times... I bring all my outta town friends here and everyone seems to enjoy it... has been my standard that I hold all others to... the price has gone up over the years but I do not care... good portions and great service... and the food is well... 5 stars", "author": "joshua b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-22", "description": "Someone in Thep Phanom's management has decided to save money for real.\n\nThey have raised the prices, reduced the rice portions,  the staff is constantly pushing you to order more and the heater has been shut down no matter how cold it is outside.    \n\nThat's too bad because the food is decent, but until they come back to being the cheap and friendly neighborhood restaurant they once were, I won't be coming back.", "author": "Tommy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "I love the fact that people give this place 1 or 2 stars, because that means I'll never have to wait for a table...and it won't be as crowded (it is pretty small).  I can spend that time looking for parking...ugh.\n\nYes, this place is more expensive than other Thai places...but this isn't fast-food Thai, people.  I've been to that other Thai place that's supposed to be good where you take your shoes off and the portions are minuscule.  I've been to the other thai place around the corner from Thep Phanom, I've been to 2 Osha restaurants (talk about overpriced), and I've tried at least 5 others in the city.  This is the best one by far, and their service is great.  How many restaurants nowadays actually change out your silverware after your appetizers...?\n\nMy favorites are appetizer #1 (forget the name) these fried corn and chicken dumplings...the pumpkin prawn curry...the crispy duck (warning-must like duck fat)...and last night I had the whole fish with the spicy ginger and garlic sauce.  It was cooked perfectly.\n\nAnd...I LOVE the fact that this place has DESSERT.  Ok, they may not be Thai, but I don't care.  The Kahlua Creme Brule is amazing...I get it every time.  My boyfriend had the Bananas Foster, which was still good, but not as good as my creme brulee.\n\nSo you people that want the \"McDonald's\" of Thai food--keep giving this place low ratings so there's more room for the rest of us.", "author": "fi l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-22", "description": "This place rocks. Not your usual Thai place, so when you are here try something new! The larb ped and beef strips are the best!", "author": "Q L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-11", "description": "This is my favorite Thai restaurant in town. Yummy !! Crying Lady Rocks!!\nI have friends that work here, so my food/service is always great.....so I feel bad for those who didn't like it.", "author": "Meagen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-08", "description": "I tried this place for delivery recently. My usual Thai restaurant was not delivering so I decided to try something new.  I really, really regret ordering from here. The Pad See Ew was DISGUSTING. The moment I took it out of the bag I could smell the burnt noodles, and it tasted charred as well.  We ended up throwing out both of our FULL noodle dishes (for $11 each) and going hungry- that means it had to be really bad, as we were starving by the time it was delivered. The chicken wings were good- but plain, no sauce comes with them.  I would stay away from this place- even Chili Cha Cha is better (and I don't love that place).  Thailand Restaurant in the Castro is 5 times better than this place, so I would recommend going there instead.", "author": "M H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "You get really attentive service and really delicious food here.  The tom kha goong (spicy & sour coconut soup) is soooo good, I could eat it by the gallon.  I've been here several times now and I really love everything I've had.  It's a tiny bit more spendy than some Thai places but worth it.  Go there.  Take a friend.  Have some tea and sit and gossip for hours.  :)", "author": "Emily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "Okay, I *CRAVE* this place.  Whenever I come back to SF, this is the first place I go.  Their crispy basil with tofu is is to die for and the coconut soup is nummy nummy.  I wish their vegetarian selection was a little better-- even their peanut sauce has fish sauce in it so I can't eat it.  If you're vegetarian, make sure you tell them that so they can let you know exactly what you're eating.  All I can say is that if I could eat here on a weekly basis, I totally would.", "author": "Nicci S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "My friend picked Thep Phanom for dinner last Saturday and it did not disappoint! Bold flavors and fresh ingredients!  I had the \"wailing lady\", which has eggplant with chicken in equal parts.  Chicken is minced and spiced to perfection!  My husband's curry was also outstanding.  The portions are just right - not too big and not too small.  This place is not very big and it was crowded.  Luckily my friend made a reservation. We shared a bottle of wine, since they only serve beer and wine.  Overall a great dinner!", "author": "Lidiya B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-16", "description": "Not as good as it probably once was. Would avoid. Chicken was overcooked, mushrooms were undercooked. Good service, good price, but the food leave much to be desired.", "author": "Guy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "this place has been operating since 1986. \n\nlots of unique dishes. i love the duck salad and the jumbo prawns in a special curry sauce with broccoli and cauliflower. \n\nthe interior decor is awesome and the service is good. \n\nmore pricey than most thai places.", "author": "Yevi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "I'd give this place a 5 star if it wasn't so damn expensive.  Ok its not super expensive but its a little much for what you get.  The food is amazing though.  Once something like that hits your taste buds you never forget it.  I've tried so many dishes here and have taken so many people here its not even funny.  I've tried the pad thai, weeping lady, many soups, and tons of chicken dishes.  Everything is AMAZING!!  I went to thailand a month ago and this food was better than what I got out there.  That probably means its more fattening and maybe not as authentic as \"real\" thai food but I'm sorry,  it tastes damn good.  The service is as great as the food.  These ladies wear real thai outfits.  Now that has to be a bitch.  Seriously...If I wore a long tight skirt like that I'd trip all over myself.  Check out the food though :)  You won't regret it!", "author": "karla k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-30", "description": "Every Thai restaurant basically has the same stuff. Which isn't necessarily a bad thing. Panang never really sucks. \n\nBut this place has stuff you won't find elsewhere. \n\nThe Titantic chicken that everyone writes about is worth the trip. There was a pretty good salt and pepper beef special that wasn't all that salty or pepper, but was still tasty.\n\nOne ding is that I'd read that this place was spicy, but it ain't. If you want something spicy ask for it. \n\nIt's not cheap either, but the portions are big. You can easily get away with 3 entrees for a party of 4. \n\nThere's more than enough cheap, good Thai in the city. It's cool to have something a little better.", "author": "hart l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-10", "description": "The food is definitely delicious here, but I think you can get better Thai for your money in SF (dishes are probably about $2 more here than my fave over in my hood, Silver Spoon Thai, or Marnee Thai, also very well known like Thep Phenom but cheaper). That said, they have a prix fix and free glass of wine going for their anniversary right now.", "author": "Shoshana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-04", "description": "For long-time fans, there's no denying they sadly seem to be on a downward spiral . . . with the passing of time, prices have increased, portions have gotten smaller, and the once consistently above-average quality has become merely so-so.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "great food, been around for years, when i used hang around the haight this was my food of choice", "author": "DJ Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-05", "description": "I would give this place one star, but the food did seem fresh and clean and the service was pretty good. this is not the thai place to go to if you are vegetarian- I believe the amazing reviews for it are about its seafood- don't expect to get anything but mundane pad thai or veggie dishes.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-08", "description": "Once again, Thai food that's over $7 a dish doesn't compute. The food is actually quite tasty, but the portions are small for the price you're paying. The nature of Thai food (at least the dishes I prefer to dine on) is cheap, fast and often very greasy. That's just the way I like it. Classing it up is just unnecessary.", "author": "Viv C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-19", "description": "Hands down THE BEST Thai restaurant in the city. Other places PALE IN COMPARISON. The food is awesome. The service is warm and inviting. I like that the rice is served in a traditional serving bowl and dished out for you at the table. I also appreciate any restaurant that uses linen tablecloth settings on their tables. Eating here is always a memorable experience, and it's so close to where I live - lucky me!", "author": "NirvAnna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-02", "description": "This place serves really great americanized, overpriced Thai food. Sorry to break it to you, but real Thai food tastes better and spicier.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-17", "description": "Eh. I had heard so many great and wonderful things about this place but sadly it didn't seem to live up to the hype at least in my experiences dining there. The portions are tiny and the price is a bit high. It's almost like they're trying too hard to be somewhat upscale. There are plenty of other better Thai places in the city in my opinion.", "author": "Kimi W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-07", "description": "I've had SO much better Thai for SO much less that I have to give this place only two stars.  The spicy basil chicken I had there recently was tough and bland - it tasted like deep fried chicken skin, not the actual meat.  \n\nWhen you charge almost twice what other Thai restaurants charge, you'd better be a hell of a lot better...and certainly not worse! I may give this place another try if they lower their prices but otherwise, forget it.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-10", "description": "It was ok.  My dish of sauteed chicken was fresh and the jasmin rice good.  It was expensive, though, for what we got.  The service was very friendly.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "Thep Phanom is a definite winner- despite reports of it not being as good as it once was.  To me it seems they have struck a solid balance b/w fine authentic taste, good ingredients and a cozy yet refined atmosphere.  The curries and seafood combos are delicious and the Thep specials will not disappoint you, i suggest the 'Crying Lady'- Jumbo prawns and the Thaitanic beef.  Fried whole tilapia and the fillet with spicy sauce are great. Amongst the appetizers the boneless stuffed wings and Tod Mun are amongst my favs.  Anytime the chef has made efforts to de-bone chicken wings and re-stuff them with glass noodles and black mushrooms you know you are in for a treat. The soups are family size portions so come with a group of 4.  They also have beer, wine and some uninspired desserts.", "author": "Akash D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-12", "description": "Considered to be \"Royal Thai\", and not the casual fare served in the Tenderloin. Very elaborate menu and a huge selection of daily specials. Extra care is taken in providing this food goes beyond the take-out level. And it does. Dont miss their chicken satay, yellow curry chicken or even their pad thai washed down with one of their Thai beers or Thai iced tea. Beautifully decorated in authentic Thai regalia.  Always crowded, and a bit small, so make sure reservations are made if there are four or more.", "author": "Mick F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "We love this place! The food is phenomenal and the staff is incredibly friendly. The pumpkin fried moons are to die for, the curry chicken so delicious. The restaurant is always nicely decorated. My husband and I like it so much we had our wedding reception there after our City Hall wedding.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-09", "description": "When we lived in Hayes Valley, we ate here at least every other week.  Great Thai food. Consistently good, too.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-18", "description": "The best Thai I've found in SF so far. The curry, fried rice and noodle dishes are all solid and exceptionally fresh tasting. Pad See Ew with duck is to die for.", "author": "Emanuel K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-15", "description": "I feel like I might be reviewing the wrong place based on the other reviews but it was on Waller.  Anyway, I thought the menu looked impressive but the food itself was underwhelming.  The atmosphere was nice and the staff was friendly but that didn't make up for the fact that my curry was bland.  Plus I ordered the yellow curry with ONIONS and potatoes and there was one piece of onion in the whole thing.  Finally the wine tasted just wrong which as anyone knows from reading my reviews can make or break a place for me.", "author": "Lindsay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-15", "description": "This is a good place to go if you like to wait to get in and wait to get your food, or if you don't mind ordering to go and waiting an hour to pick it up. Basically this is a Thai place for patient people who aren't terribly hungry. If you've just had a snack it's probably a perfect place for dinner!\nDon't get me wrong, the portions are fairly good, especially since the prices are a bit on the steep side. It's a classy place though and the service seems pretty good and friendly.\nWe had a mourning event and ordered a bit of everything, the steak salad, the glass noodles w/chicken, spicy pork with green beans, larb (dontcha just love saying that word? larb...) and an intimidatingly large 'jumbo shrimp' stuffed with crab and served atop a grilled pineapple -fun on a stick! The rest of the crew raved about the glass noodles, but I just found it ok. I've been here a handful of times over the years and it's fine, but they should work on the 'turn and burn' idea so people can get in and out at a better pace.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-25", "description": "Last nite, I had dinner at this place. Someone said it was the best Thai in SF. I have lived in the neighborhood since 2004 and I knew there was a reason, I never went here. Serves me right for listening to people who probably have never been to Asia, or had really really good Thai food. The food was ok but definitely not the best Thai in SF.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "Probably the best Thai place in lower Haight.  Nice presentation, ambiance, service, and decent food.  The prix fixe menu that they have (had?) was a great deal.  They have brown rice and the appetizers are pretty delicious (and nicely presented.)", "author": "Neil G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-03", "description": "I found the food to be way to pricey for what it was, plus if you are a vegetarian this is the most vegetarian-unfriendly Thai place I have been to. I think you need to like seafood to know why this place gets a high rating.", "author": "Jerry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-06", "description": "Excellent... I came here when I was under the weather, and their hot veggie coconut milk soup hit the spot perfectly.", "author": ".V X V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-05", "description": "Standard fare thai food, but a small service complaint -- they rushed us out of the restaurant because it was late on a Saturday night.  First they asked us to pay our bill already; that's fine, we understand the wait staff have somewhere to be.  But then literally a minute later a waiter came by and asked us if we have paid yet just as we were getting our wallets out.  That annoyed us.", "author": "Jesse C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-14", "description": "Thep Phanom is fairly good, but it isn't authentic. Mind you, the crowds who line up to eat here don't seem to care.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-22", "description": "Let's first rewind to 2000 when I ate there last. \nI had reunited with my half brother & half sister for the first time in YEARS just a few months prior.  My Brother had frequented this place in the late 80's when it was 1/3 its current size (yes, it was THAT small).  THe place had grown to be one of most prized Thai place in the City.  My brothers, sister & I decided to come out here for dinner  one evening in 2000.   I was fortunate to have been able to witness the fine cuisine I was told about so much.  \n\n  Fast forward to tonight.  Although many of their dishes are unique and delicious (and the standards are good as well) it just wasn't the same eye-popping tongue-dancing experience I remembered in 2000.  I know the owners are still the same, because the owners know my brother very well.  We were given a very friendly welcome into the restaurant and the owners even gave us a few appetizers on the house!  The ambience is the same beautiful authentically decored mini palace as it was 7 years ago.  Their beef with basil was scrumtious and I also enjoyed the duck!  However, having the expectation I had from remembering my 2000 experience took one star from my rating Thep Phanom.  I would expect a reputable establishment like this to continue serving their food consistently over time.  But being that Thep Phanom holds a special place in my heart for the occassions I've been there with my brothers & sister should definately earn them two of the four stars.  The Thai food is authentic and delicious, but don't expect to be overly blown over, unless they come back to their original recipes.\n\nDishes we were served tonight:\n\n- Lemon Grass Salad - Chicken & Shrimp with cashew nuts, lemon grass, & spicy lemon dressing. ***\n- \"The Crying Tiger\" - Grilled Beef Salad with Spicy Garlic Dressing *****\n- Panang Chicken - ****\n- Nan Kruan (\" The Weeping Lady\") - Chicken with grilled eggplant garlic, chili, and basil. ***\n- Salt & Pepper Crispy Beef Strips - with cashews and crispy basil *****\n- Ped Sawan - Boneless duck in honey sauce over spinach. *****\n\n(the \"*'s\" were my star ratings for each dish).", "author": "Gio G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-28", "description": "I love good food.  Especially Thai food.  After being introduced to this little corner restaurant, it might be on of my favorite Thai joints around.  Beautiful dishes, very delicious.  We got the green papaya dish, no hint of shrimpiness....points there, a Talapia dish, and if I can remember correctly an eggplant  dish.  Well attended to, food great, company great, wine great. How many times was that great?  Ever dish that I saw being served looked superb, and the other reviews here only confirm my taste buds and impression", "author": "ERICA E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-13", "description": "the food here hit the spot after a long day at work.  my co-workers and i shared some chicken coconut soup, spicy prawn salad, beef and spinach in peanut sauce, and prawn, scallops & calamari in coconut sauce... \nour order came out pretty fast and the flavors were great.  it was filling too so we had no room for dessert.\nprices are super reasonable and the service was attentive and friendly.  they kept coming to the table to refill our waters... and asking if we wanted more drinks or food/desserts etc...\nit's also a cozy dining room with various thai decorations.  the waitstaff wears a thai inspired uniform as well...\nwe were lucky and got rockstar parking for our 6pm dinner too~ :)", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "Not the cheapest Thai place, but the vegetarian entrees are delicious.  Veggies: skip the appetizers!  The entrees such as the thaitanic tofu and the breaded portabella mushrooms and eggplant are DELICIOUS.  The service is just as good as the food.   Weekends and prime dinner times equal long waits!!!", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-11", "description": "i hadn't been here in a zillion years until friday night when i returned to find that they are still living up to the standards they set when they were \"THE\" thai place in sf.\nwe had the titanium beef which was delic and the spicy chicken w. basil which was a little dry but still tasty.  they also served real brown rice, as opposed to the brown colored white rice that i've found in other thai restaurants.\nthe wines by the glass were decent.\nthe staff was friendly and they wore really cool traditional thai dresses. \ndinner was followed by drinks in the lower haight and we were surprised to find that most of the bars are beer and wine only.  i have lived in the hood for over a year and i had no idea.  shows how much time i spend in bars.\noverall- great experience.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "Really liked the food here...\n\nDishes I enjoyed:  Vegetarian spring rolls, lemongrass tofu with jasmine rise, creme brule, jasmine tea\n\nDish I didn't enjoy: fillet of fish with green curry...served on a whole fish with its tail sticking up, the fish was dry and somewhat tasteless\n\nOverall a great experience here", "author": "Michele Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "Great salmon curry dish and nice atmosphere.", "author": "Petko M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-14", "description": "A friend and I tried Thep Phanom on a Tuesday night and we were seated very promptly after we arrived.  The atmosphere in the restaurant is very cozy and the two of us felt immediately comfortable. The wait staff was attentive and our order arrived very quickly. For an appetizer we ordered the Tod Mun Plah (fried fish cake) which was good, and the cucumber salad garnish went very well with it. I'm not sure if I would order it again, though.\nOur first entree was \"The Weeping Lady\" (Sauted minced chicken with grilled eggplant , garlic , chili and basil ) and it was amazing.  The dish is extremely spicy, so caution to those who can't take a little heat.  The minced chicken and grilled eggplant go very well together, the textures complimenting eachother perfectly.\nWe also ordered the Panang Nuer.  It's pretty difficult to screw up a panang curry dish, and Thep Phanom's dish was definitely up to par, but didn't really offer anything that I haven't seen at other thai restaurants as far as this dish goes.  That's not to say it was bad - panang curry is one of my favorites and this dish certainly satisfied.\nAll in all, our dinner here was a very enjoyable experience.", "author": "Gerald V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-23", "description": "It's not the most consistent place but a reliable standby. I wish it were a touch cheaper but it's a safe bet.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-11", "description": "For a while this place was raved about as the best Thai in San Francisco.  Naturally, I had to come here.  They have tried to cater to an American crowd but they will also make authentic food.  Every time I come I ask them to make the whole fried fish and serve it whole, as they typically fillet it for customers.  It was incredible.  They prepare it with some unique spices that are different from the traditional preparation and it tastes great!    Do not try to recreate this in your home wok unless you are very experienced.", "author": "apple r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-04-29", "description": "I think it's all atmosphere. Seriously, cute place but the Thai food wasn't all that impressive. I'd take Osha Thai, atmosphere-free, any day.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-15", "description": "Delicious thai food. Pretty expensive. Really nice wait staff. The lemon grass chicken is awesome. I have gotten some really bland dishes here too.", "author": "kristen l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-08-18", "description": "After hearing from multiple people that this is the best Thai in the city, I was completely underwhelmed.  The food just wasn't very good.", "author": "Cully W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-05", "description": "Overpriced food that was mediocre at best! \nService was lame and neither friendly nor unfriendly.\nMy food came 10 minutes before my friends food and i was luke warm.\nWe spent $ 75 for two persons- that included 2 appetizers, 2 entrees and one glass of wine! Totally overpriced! I so do regret having spent the money! \nWill never go back there!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-05", "description": "i have passed this place a number of times on my trek from Toronado to Zeitgiest.  i always point it out and say a little too loudly, \"ooooo i want to try that plaaaace.\"  so, when my mom came into the city to hang out, i jumped on the opportunity to try it.\n\ni was very surprised when i walked in. first of all, i always thought it was just another hole in the wall... but it was.. kinda fancy.  (i was not prepared for this and rather underdressed.) it was sleek and the service was almost too attentive.\n\neverything on the menu sounded pretty good and it took a really long time to finally decide to start with the grilled octopus and then we split the grilled quail and red curry duck. \n\ni would not suggest getting the thai iced tea, it's way too small a serving.  i would suggest the phuket beer, which has a totally sweet label. \n\neverything was very strongly flavored which i loved.  the grilled octopus was spicy, acidic and tender.  and the red curry with duck was perfect.  not overly spicy, just a little heat with incredibly tender duck and warm cherry tomatoes that would burst into deliciousness with the red curry.  the grilled quail was superb, with tender little birds with crispy basil, onions and mushrooms.  \n\ni don't know how authentic it is.  but honestly, i could give a rat's ass about authentic.  delicious food is delicious.  and this food is definitely delicious. \n\ni will definitely be back there, but it's not a hole-in-the-wall cheap thai eats.  it's a little more upscale in ambiance and in price.  but well worth it.", "author": "Ge O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-26", "description": "I tried the green curry, Beef Thaitanic, and mango/sticky rice dessert.  The green curry was ok but nothing to write home about (but then again, when is it ever?).  As a side note, the a la carte sticky rice portions are pretty small.  The Beef Thaitanic was disappointing and tasted like something I'd get at a Chinese restaurant, not a Thai one.  I don't know why I ordered the Thaitanic and only ordered it based on the waitress's recommendation.  The mango/sticky rice was way overpriced, the portion was TINY (the amount that fits in a hollowed mango half), was overly sweet, and doused in a sweet coconut liquid.  The meal came out to about $25 a person and in my opinion, was a bit too much.  Worth a visit, but expect to pay more than you normally do.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-29", "description": "\"What's your budget?\" our friend asked, as we were in the area and wanted dinner fast - \"$50, including drinks - for both of us\".\r\n\r\nThep was the recommendation - and it was good Thai food. Not great, but solidly good. We had the Thep salad (very fresh), Tom Kha Gai soup (not spicy enough), and some kind of fish in banana leaves.\r\n\r\nThe space is festive - they're celebrating their 20th anniversary and balloons and plastic leis served as additional decoration. Pretty paper tie-dyed place mats too...we took ours home. Free art!\r\n\r\nIncluding two drinks, bill (including tip) came to $49.37.", "author": "Allie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "After wandering around Lower Haight for 30 minutes one lazy Sunday and vetoing various cuisines one by one, my friend and I settled upon Thai and came across Thep Phanom. It was fantastic. Their coconut vegetable soup may well be laced with Ecstacy, it was that good. This is a great place to go when you've already been to Osha ten times and want something new and different, and don't feel like getting peed on by a homeless person on the way to your dinner.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-24", "description": "I really like this place. All the veggies are very fresh, and the curries are good. I usually get the green curry with basil and zucchini and I love it. I also really like their Tom Yum. The vegetarian one is packed full of veggies and they will make it without fish sauce, so it feels very healthy and clean. Cute place, good service.", "author": "Amanda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-24", "description": "Simply my favorite Thai restaurant in San Francisco.", "author": "Steph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-23", "description": "Fantastic Presentations, and Killer Flavors from all the dishes offered and tasted.  Service is warm and friendly, the wine list is not to shabby for a thai restauant truth be told, and i only live a block away.  It is a win win for everyone.", "author": "brian m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-26", "description": "Used to be great, but lately the quality and portion size seems  to have gone down.  The food si still pleasant, but not fantastic.  And the atmosphere is crowded and noisy.", "author": "Gisela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-07", "description": "Small, crowded, difficult neighborhood parking and truly delicious food. \"Thep Phenomenal\" is among my favorites. I just wish they would open for lunch. Try it. You'll love it.", "author": "Hale J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-13", "description": "Phenomenal Thai food in a living room setting, which is always crowded and a little cramped. Arrive early, or have reservations, or both, and hope your parking karma is good, since it's in the Lower Haight. Have been here a few times, most recently Jan 2006. I like the lab ped (minced duck meat), the tom yum gai (spicy and sour chicken soup), the massee weepayoke (broiled catfish), the kaeng moo (sliced pork in red curry paste), the sam kasatr (sauteed beef, chicken, and pork with bamboo shoots), the pork with green curry (just ask for it and they'll make it!), ped sawan (marinated boneless duck), the moo prig pao (sauteed pork), and the choo-chee plah (catfish filet). Authentic Thai since 1986.", "author": "Hao L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-05", "description": "Every dish I end up having there is full of different, unique flavors.  Pricier than your typical Thai place but definitely worth it.", "author": "Tanger T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-04", "description": "This is my favorite Thai restaurant in san francisco. Almost everything on the menu is amazing except for their pad thai. My favorite is the south sea (eggplant seafood dish). The basil salmon and their curries are also wonderful. \nthe ambiance is great as well. It's very tastefully decorated with a lot of attention to detail. I highly recommend it!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-06", "description": "Thep Phanom certainly feels like a place where you would take a date, but I probably wouldn't go out with the dude again if he took me here because it would telegraph to me, \"I don't know good Thai food!\"  My roommate and I agreed it was time to check out this restaurant in our hood, and we found all three dishes we tried (Tom Kha Goong, The Crying Lady, and Veggie Pad Thai) to be on the sweet side, none too bold or memorable.  The Crying Lady was crab-stuffed shrimp that was impossible to eat without making a mess, so do avoid if you're trying to impress someone.  Overpriced and underspiced.", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "I've liked what I've ordered here.  If anything needs a little more 'oomf' for me, I'll add some more pepper, fish sauce, sugar, and lime juice if the dish calls for it.  If dishes start out decent, they can be better by adding those little things.  It is a pretty small place, but I never had a problem with waiting long for table.", "author": "Pamela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-23", "description": "Best thai in SF.  It was way cuter before the remodel when it felt like you were in someone's home or place of worship.  OIt looks too modern now, but the food is still fantastic and so ids the service.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-05", "description": "Really tasty and spicy Thai cuisine. Don't be a wuss and turn the menu over and get the spicy entrees. It is so worth it. Their portions are pretty big, too, so if you're not too hungry just split one menu item. It's more than enough, and man it's so good. The decor is pretty cool as well, in a nice cozy setting.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-13", "description": "I guess SF didn't have a lot of Thai restaurants for a long time, which must be why for years after I moved here from LA  this place seemed to be regarded as \"Best Thai in SF.\"  (LA, on the other hand, was already full of hole-in-the-wall Thai places with good food).  After giving it numerous opportunities, time to write a review.\n\nOverpowering smell of fish sauce as you enter is not a good sign.  Food is so-so, seating cramped.  All of this, I suppose, added an air of the unusual or exotic to it.  \n\nIf you don't know any better, you might like this place.  But it's not very good.", "author": "Ritch G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-04-06", "description": "The food is always amazing. Go on a Wednesday or Thursday for their special \"Siamese Twins\" It is a geat seafood combination in a beautiful handmade banana leaf basket thingee. The Dancing Lady plate is shrimp stuffed with crab. Yum.", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-09", "description": "Thep Phanom is quite possibly the best Thai restaurant in SF. Every meal that I have had there has been memorable, delicious and well presented. The decor is nice, very elegant for the price range. For about $60, we got an appetizer (calamari), yellow curry chicken, salmon, and a few beers. The calamari was chewy but not at all tough, and the chicken and salmon perfectly prepared. Everything was tasty, and we had plenty of food for two people (possibly enough for three).", "author": "Dana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-09", "description": "We've eaten here many times and had absolutely delicious meals most times. In particular they do very flavorful sauces. Gracious staff. Love it. Worth a few extra bucks. Watch out for the $3 iced teas though, they are tiny and tasty.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-05", "description": "This is my neighborhood Thai place and my favorite in the city... go early 'cause it gets a little crowded.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-25", "description": "Tasty Thai food, with an awesome atmosphere.  Try their curries!", "author": "Corey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-03", "description": "I'm surprised I haven't written about Thep Phanom already.  This is absolutely one of my favorite restaurants.  I've always had delicious meals and rarely order the same thing.  I like to come with at least two others so that we get a variety of dishes.  Thep Phanom is one of the most important stops in my visits to San Francisco and one of the places I'm most looking forward to being near when I move back.  (Crispy tofu: yum)", "author": "Susannah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "Thep Phanom has a somewhat elegant atmosphere, good service and good food.  The best part of the restaurant is the beautiful presentation of the food.  From the appetizers to the main dishes, everything looks picture perfect.  I went with a large group of people, so I was able to sample a lot of different dishes.  My favorite dishes were two red curry based dishes (a chicken & eggplant red curry and a pumpkin and shrimp red curry).  The vegetable and tofu in the peanut sauce was pretty good, but not a stand out.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-05", "description": "I have been dining at Thep Phanom for years and it rarely disappoints. While not as experimental as some of the newer hip Thai places that have been springing up. it is eons better than most of your neighborhood Thai restaurants. Whenever I want take out, this is my go to, even though I have two Thai restaurants within 3 blocks of my house. I would rather make the trek or order delivery from Thep Phanom.", "author": "Katherine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "I've only have been here once but it was really good and I think how traditional Thai food tastes, like for example, the fried quail, which was really interesting tasting but had no real meat on it. Meh, quails are small. But wow, were the curries and appetizers tasty! I will go back when I'm not broke! Oh and the presentation of the food is really artistic!", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-28", "description": "Although it's a bit pricey, I have never been disappointed.  This is definitely my favorite Thai food in San Francisco.", "author": "Melaina E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-15", "description": "We are so lucky to have Axum, Indian Oven and Thep Phanom in our 'hood.  Even though sometimes you have to put on a bullet proof vest to get there, it's well worth it!  Thep Phanom is great for dining in or take out.  I love the Goong Siam (prawns with curry and roasted veggies) or lemon grass tofu and my husband really digs the Kaeng Karee Gai (chicken in mild yellow curry paste with onions and potatoes) or the very authentic \"crispy beef sticks.\"  I say if you can't have beef on a stick, why bother?", "author": "Julie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-19", "description": "Sad what success has done to this place.  The food is not what it used to be.  Maybe one star is a bit harsh, but I'm very disappointed in their fall from grace and resting on laurels.", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-15", "description": "I love there roasted crispy duck!!! I have an infatuation with duck!  The silver noodles was okay.  I think I just like there duck dish the most.  Tucked in between Fillmore and Waller street this restaurant is a neighborhoodie restaurant in the Haight district!", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-24", "description": "a friend of mine raved about this place. and by raved, I mean, she said,\n\n'oh yeah this place is Hella good...'\n\nnow by her using the word, 'hella' this should've been indication that she was being far too generous. and yet, she was.\n\nI'm no genuis when it comes to the cuisines but my tongue knows what it likes and knows what it doesn't like and this place was hit or miss on too many occasions.\n\nwe did a family style by ordering multiple dishes and just eating off each other plate. which was better bc my choice and I won't say it by name, was not very thrilling nor did it really get my heart going,\n\nbut its not all bad. good presentation, good service. so I wouldn't mind going back. not all of the dishes were bad. the soup was amazing, I'll admit. so there is room for improvement in my review upon another visit. I believe its good.", "author": "Derek Alistair J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "they dont have chopsticks!!#!@#!!\n\n3\ni'd say average thai food.\nthe green curry is pretty good. creamy.\n\nthe tom yum gai was not as flavorful as id like.  \nthe prigking tofu was ok.  the string beans were too raw. \nthe crying lady- prawns fried and in sauce w veggies was the least favorite.\nthe pad thai was average also.\n\nthe thai ice coffee did not have enough milk. \nthe price is kinda high for the quality. but maybe that's just sf.", "author": "Heejin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-09", "description": "I'm a big Thai food fan.  The food at Thep Phanom was good - not exceptional, but certainly tasty enough.  The prices, however, far exceeded the value of the product.  The service was decent, though also not fantastic.  I was incredibly put off when I asked for chopsticks and received a disdainful, condescending look and the response that \"we do not serve with chopsticks.\"  The wait-staff, in general, was brusque and not particularly friendly.  All together, the high price, the lack of friendliness, and the non-exceptional food combined to create an experience that made me miss other Thai places in the city.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-25", "description": "I remember having really great memories of Thep Phanom, but I've been back a couple times recently and just haven't been that impressed.  The food is just ok and it's a little on the pricey side compared to your average Thai place.  I think the ingredients are good, but the seasoning/sauce just leaves me wanting.  Was there with a couple friends recently and only 1 in 4 of us really liked our meal.  The good one was a veggie dish, tofu and green beans I think.  The biggest disappointment was the crab-stuffed shrimp.  It sounds great in theory, but the crab just wasn't that good and it lacked flavor.  I didn't think the sauce it came with for dipping really fit the dish well either.  There's defintiely better Thai food to be had.", "author": "Zach J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-03", "description": "My lemongrass tofu was good, and I was glad they had fresh rolls on the special menu.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-08", "description": "Disappointing and more expensive than most Thai places we've been to. Thai is my favorite food but while they do some interesting and creative work on presentation, the food was really just not very flavorful.  The pad Thai was and papaya salad were the worst I've ever had and $100 for three of us. Staff were very pleasant. Dining room was pretty packed.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-16", "description": "One of the best Thai restaurants in the city.  The food took a little while to order, but I love the broccoli.  Yum!", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-19", "description": "My latest visit to this place left me less awed than past visits, say 5-6 years ago.  Now is the food worse, or is it just that I now eat Thai all the time and my standards have changed?  Who can say.\nThe thing is I had remembered it being phenomenal, mouth watering yummy and it is good, yes it is very good, but this time I was not so blown away.  \nThe Dancing Ladies, one of their specialties, was great and the grilled pineapple it comes with was a succulent added bonus, but I found the Siamese rolls and our curry dish to be rather ordinary.  Now that being said, the presentation of all of the above was beautiful and this is one thing about Thep Phanom that has always held them a step above most other Thai places for me.\nI think I've become a Thai food snob.  See what happens when you live here.  Not that I'm complaining, I had Thai food in Detroit a few weeks ago (at a place that is supposed to be one of the best in town no less) and it paled in comparison to what we get here at your average place.", "author": "Gucci M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-20", "description": "I know everyone loves this place. but having only been here once- a first impression is everything. I thought the service was a little aggressive and bizarre. Also for me, the food was blah. I love that the wait staff wears funky outfits though. that's all i got", "author": "angela g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-21", "description": "Good food, I like their duck salad and crispy squid. I'm from LA, I'm not used to the 45 minute search for a parking spot. Price is a bit on the expensive side. But overall I enjoy dining here", "author": "Danny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-07", "description": "3.5 Stars, actually - pretty good, but not fantastic. Had a shrimp spring roll for an appetizer, was OK, but the shrimp in my first one tasted a bit old. Then shared crispy duck, which was good, and prawn and pumpkin red curry, which was very good and well spiced and by far the better of the two entrees. Great Thai Ice Tea, but then again I'm a sucker for just about all Thai Ice Tea. Prices were reasonable, but not a bargain - $50 + tip for two people without drinks. I would go again for the curry, but am definitely in the market for a GREAT Thai place.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-21", "description": "I must have tried Thep Phanom on an \"off\" night for service.  Every step of the way our service (2 of us) was terrible.  A simple meal took 2.5 hours.  I'm all for taking my time and enjoying my dining experience, but it was a long wait for everything.  \n\nA long wait and 3 waitstaff later, we finally placed our order after the 4 tables around us that arrived 5-10 minutes after us placed theirs.  This after flagging down 2 of the different wait staff.  Drinks were not refilled.  No one checked in with us after placing our order.  My friend's entree was brought out, mine was brought out 15 minutes later.   It made for an awkward dining experience.  He was partway done when mine arrived.  I am politely assertive, too, and spoke to every waitperson in the place, and it was terrible service through and through.  They did have a large party at the restaurant, but geez!\n\nThe food was good, but the poor service greatly took away from Thep Phanom.  I was relieved to finally pay the bill and leave.", "author": "K V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-24", "description": "I don't want to give out too many 5-star ratings but honestly, if you're looking for Thai, this is definitely the best in the city. When I didn't live in this neighborhood I used to come across town to this place. Very casual but the food is exceptional. If you go on Fri or Sat, the fresh spring rolls are compulsory. And if it was socially acceptable, I would bathe in their peanut sauce. All their crazy special dishes (beef thaitanic, the crying lady, etc.) are very good...but the standard Thai dishes like gai karprow (spicy basil chicken) are exceptional.", "author": "Bill R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-20", "description": "My favorite Thai Restaurant in San Francisco!  Everything on the menu is cooked to perfection and delicious, and their specials are always interesting. They have many things to order that you will not find on a typical thai menu--- I suggest the crying tiger beef salad, salmon thaitanic curry (chef special), and the dancing lady (large prawns stuffed with crab meat). Oh--- and the crispy basil beef is one of my favorites too.", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "The way Thai food should be-- the soups spicy and hot with the fresh flavor of lemongrass, cilantro and chili, the meats in sauce creamy and rich, the beer cold and the establishment, intimate, just like someone's home.  Fresh, simple ingredients with depth of flavor . . . Absolutely the best Thai food I have had in the city!", "author": "regina k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-14", "description": "Pretty darn good Thai food, not the best I've ever had, but it's always packed so people must really like it.  They've got some tasty spring rolls!", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-12", "description": "Tube socks rule!! Seriously this place has it all - fantastic food combined with a great atmosphere. Its a staple location to take out of towners.", "author": "Inome C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "Thai spices in all the right places for my palate, starting from the appetizers, soups and entrees. You have to go a few times to try all of your soon to become faVorites.", "author": "Angela R K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "I not a big fan of Thai, but each time I dine here I come away a satisfied customer. I tend to stick to the prawns, but it is a solid place to eat in Hayes Valley. It is a bit spendy, but the food is delicious.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-14", "description": "Um...hummm... I do agree that there is less expensive Thai food in this city. Not nearly as convent for me, but cheaper and dare say better. I do not have a car. Sometimes you are on your way home from work and want a great heart warming bowl of soup. Thep Phanom filled my belly with hot, spicy coconut milk broth soup and saw me off (with wine) for under $20. If you want to stuff your face, I think there are much more economically friendly places to go. I like this joint. Will come back, probably by myself.... but return none of the less.", "author": "Charise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-20", "description": "I definitely recommend this place. Every dish we ordered was flavorful and done just right. Their curry is one of the best I've had. It get's busy at night so probably best to go early.", "author": "Norton W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-20", "description": "Go here at least 1/month. Friend recommended it and said it was the best in the city so I tried it. Not cheapest thai (chili cha cha is cheap, good, around the corner) but great presentation and solid job on food. Now one of my favorite thai restaurants in the city, too. Highly recommend it.", "author": "jey o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "Thep Phanom used to be our  favorite culinary stop in SF. The decorative remodel is lovely and only 3 months old but the food quality seems downgraded. We ordered a fish filet, they brought the whole fish out which was bland. The curry was decent but the meat in it a bit chewy. We also ate the crispy duck- it was incredibly dry and the plum sauce too mild. We had to order extra rice and the staff did not even offer dessert choices.  Overall- too expensive for what is given, the two person per table row left us a little too cozy with the strangers to our left and right, and lastly, in a Thai-Asian food restaurant, they don't even carry chopsticks!!!!", "author": "Eve V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-26", "description": "Like Thai? Eat here.  Dishes are deep with flavor.  The chicken yellow curry is rich and the king of comfort food.  Moo Prig Khing is my favorite Thai dish.  I plan on ordering it the next time I visit TP as I'm sure it will be shake a tail feather good!", "author": "Christina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-16", "description": "Love-Love-Love this place. I'm always pleased when we stop in. My favorite is the lemon grass-coconut shrimp with tomatoes and cabbage.  This is very difficult dish for me to share with the other guests at my table.  So I always order two-- one for the family style sharing thing and one for me!", "author": "Princess P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-28", "description": "To my astonishment, this place has gotten rave reviews from the Chronicle for years and years, before Yelp even existed. I wonder if Michael Bauer has ever eaten here, or eaten here sind 1995? We went here based on the reviews, despite already having a number of affordable Thai faves. I was served the worst inedible rancid red curry dish here and I am scared to return. I sent it back and was treated as if the dish was fine and I didn't know any better. Sheesh, I've been eating Thai food since the 80's. I give two stars for the crispy and better-than-most fried tofu with peanut sauce, but a person cannot live on that dish alone.", "author": "Paris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "The first thing I thought when I walked in was, \"Oh, great. They put some white tablecloths out, lit some candles, and redecorated within the past decade unlike most Thai restaurants. I'm sure they're going to jack up the prices for these charming touches.\" SO not true. \n\nThe service was great, the food was plentiful and spiced just right and even had some flair in the presentation. Not every day you get that at a Thai place. I highly recommend the prawns stuffed with crab meat. The Pad Thai is good but generic. Kind of hard to put much of your own spin on it, I guess. Thep Phanom is a little out of my way geographically but I will definitely make my way back there as soon as possible.", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "Soooo goood. My favorite thai place. The food is amazing and not to mention beautiful. On the menu it says that they consider making food to be an art, this really shows in the preparation. Thaitanic chicken is a must try.", "author": "Raj M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "wow. ate here last night and was so impressed. \nthe food was stunning and spicy. my boyfriend and i agreed \nthat we need to bring friends there - especially because it means\nwe'll get to eat there again. really excellent. \nonly bummer was that it took a little while to order and get the\ncheck, but it was pretty busy especially for a monday. \nwe had fried shrimp rolls w. plum sauce as an appetizer, which was delicious but the entree was really what did it: fried & spicy portabello mushrooms and giant prawns with green beans and cherry tomato. soooo good. \nanyhow, very tasty, bit pricey, crowded, good vegetarian options.", "author": "Amber B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-26", "description": "I've lived in San Francisco for over 20 years. I've been going to Thep Phanom off and on for years... well, I ate there tonight for the first time in a while and sorry to say, it's my last time.\nThe service and environment are fine, no complaints.\nBut it's all about the food with me.\nAnd the food tonight just didn't cut it. In the past, I really thought their food was fresh and so tasty and creative.\nI was extremely disappointed. Nothing really tasted fresh. It just wasn't good.  I am so sorry that I wasted any money there tonight.\nThey are riding on their past reputation.  They need a new chef or something. But the food was just totally off for me and my companion.\nI recommend going somewhere else for Thai.", "author": "jayne a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-01", "description": "we walked over for dinner from a friend's place on a sunday night. cozy restaurant with friendly and efficient staff.  after mulling over the menu, we each decided on the prix fixe 3 course menu and shared the appetizers and the entrees - very good value. normally we would eat everything family style and you can still do that with the prix fixe\nappetizers:\nfried shrimp rolls, fried corn/taro cakes (the bed of cut cucumbers served as good contrast to all the fried-ness), fried minced chicken - all came with a sweet sauce and were good. \nsalad or soup:\ncrying tiger (sliced beef salad) - good but not great. vegetable coconut soup and chicken coconut soup came in individual small soup bowls and were delicious and soothing - but how can you go wrong with coconut milk in soup?\nentrees: you have a choice between white and brown rice (we all got brown)\npumpkin and tofu curry, tamarind chicken (which seemed a bit like sweet and sour chicken) and thaiyeki? steak all came with tasty sauces. my husband got the steak and thought it was particularly tender and cooked just right.", "author": "Annie c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-12", "description": "Thep Phanom has the best Thai food in the city! I brought my friend who is from Chang Mai there & he loved it. The staff is super friendly & really efficient. The best dishes are the spring rolls, Thaitanic Tofu & green curry. Very vegetarian friendly.  Plus, they will make any dish that has chicken or seafood with tofu if you ask!", "author": "Owl B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-18", "description": "Really sub-par service, authenticity and vibe.  Be warned, even early seating at 5:30  - you will feel rushed by staff who hover and twice lifted  plates off my table while still eating.  Last, a request for a side of veggies to add to a pretty blah dish was served but yikes -- a $5.00 charge????  You have far many better thai options in town.", "author": "t h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-15", "description": "though it is not like it used to be, thep phanom is still one of my favorite thai places in the city. the basil basil prawns are so incredibly flavorful, i have not found anywhere else that makes them like this. the crispyness of the prawns paired with the sweet and spicy sauce tantilizes the mouth -- still, a favorite of mine.", "author": "Hilary H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-09", "description": "To quote the movie Juno \"What the blog?\" What is up with this place?? This has got to be the most over-hyped restaurant. I've had much better food in many other places in the city - Marnee Thai, Thai Basil, Thai Time. This is the second time I've been here (not sure why I went back after I didn't think it was great, but that was over a year ago). Went there last night and had the prix fixe menu. Eggrolls barely warm, salmon - totally gross - sort of slimey and the soup was average. Not a memorable meal. Will not be going back anytime soon.", "author": "M B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-05", "description": "My new favorite thai place, Thep phanom makes a mean green curry! Their food is delish and their presentation is simply over the top. Never would I have thought a fish carcass could be turned into an elegant garnish. It's a bit pricier than other Castro/Haight Thai restaurants, but it blows the others out of the water.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-15", "description": "well the rating quite explains how I feel about this place.  over priced and they serve rice in plastic bags, how tacky...", "author": "kate h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-23", "description": "Hands down the best thai food in the city, i love going to this place.  Its always packed and its small and quaint, great for a date.  the dancing lady appetizer is the shiznit.  This place is definately a must go if you are a lover of thai food.", "author": "matt j."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-14", "description": "I've never actually taken a bite from any of the dishes offered by this establishment, so you're probably wondering how I could be justified in giving such a low rating. My boyfriend and I had heard rave reviews about this joint, so we thought we'd give it a go. So we walk in, only to be given the stink eye by everyone in the place - staff and customers alike. Already a strike against the place. Then we sat in the corner and waited. And waited. No water. No service. Just a judgmental look out of the corner of the server's eye. So we thought, well, let's look at the menu. The prices were enough to let us know that we were the wrong restaurant. Sure, I like to splurge, but nothing even seemed worthy of paying that much. I felt that the vegetarian menu was pretty half-ass. Maybe I'm wrong. Maybe I should try the food first. But it's more than just taste - it's also about the atmosphere, and I definitely did not feel welcome from the second I walked in.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "The first time I went here I thought it was the best Thai I have ever had.  The second time, perhaps not,  The third time was a tad dissapointing.  Yes, this is certainly among the best and it is DEFINITELY worth going to again and again, but I am holding out on giving it 5 stars.  Maybe it deserved 4 and a half.  Definitely don't hesitate to go for I will be back many more times.", "author": "Debbie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-05", "description": "We have wanted to go here for a while but never had the chance but did so due to the many previous reviews. We had high expectations especially from having vacationed to Thailand and know what good Thai food is like. We were very disappointed the food was very Americanized Thai food and was not very special at all. We ordered two appetizers and three entrees to get a flavor and only one out of three were good. The fried Talapia was over cooked not moist inside, the stuffed chicken wings were not that crispy and the chicken tasted like an old hen & was a bit greasy, the food was not that great. It lacked a lot of flavors and just so so. I do not know if they had a bad night but I heard others nearby complain that the food has lost some of its quality. I even asked the waiter what place he would recommend and he told me he thought Sai Jai Tai was a lot better if I wanted more authentic Thai. The photos' looked great but the food was a big disappointment.", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-11", "description": "their menu is like a fantastic book - good selection, good wine and friendly staff, cute festive atmosphere, great place to take a date or someone from out of town. one of the few Thai places i actually recommend going to", "author": "Jordan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "This is my local Thai. Usually awesome food (especially pumpkin and prawn curry, salt & pepper beef). Easy to get a table, or takeout only takes 15 minutes and you can wait at the bar and have a beer. A couple of times I've had takeout the quality has been patchy (rubbery beef, anise flavor too strong) but 90% of the time an awesome thai place.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-27", "description": "We went last night on Memorial Day (a Monday) and the place was packed. We had a 10 min wait, which wasn't too bad since we were adequately warned. In general, the food was tasty, but not spectacular. Our \"lemongrass tofu\" didn't taste like lemongrass at all and left us wondering if they ran out of the proper ingredients for this dish. We ordered our food spicy but it turned out to be mild. The service was pretty bad too. They forgot our order, which wasn't complex at all (1 appetizer, 2 entrees, no special requests except for the spicing), and the head waitress had to ask what we wanted again. It took a very long time to get our dishes, including the appetizer. People seated after us got their food before we did and by the time our entrees came, I wasn't really hungry anymore. It's also a bit pricer than your average thai restaurant. Some things we liked were the thai iced teas (not super sweet, which was refreshing), the restaurant decor, and the food presentation. It was definitely a little more classy than most thai restaurants, but you pay the extra $$$ for it.  \n\nNot sure we'll be back since I've had better food and service at other places.", "author": "Rekha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-04", "description": "rather expensive, the ambience made me feel like I was on the set of 'The King & I', the food was alright (nothing special but solid good food).  The bill came to $50 for 2 persons, I certainly think the food and entire experience wasnt worth that much.", "author": "Teresa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "This is my favorite Thai restaurant in the city. The price is a bit higher than other restaurants, but the quality of the taste is very high. I don't usually order Pad Thai, but this restaurant is an exception. Their noodle is tasty. The staff is super friendly and the ambiance is nice, too. Parking? That's another story.", "author": "Charlie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-07", "description": "I've also noticed the recent downturn in quality and upturn in prices.  My last visit was this past Tuesday night.  I thought the pork smelled funny, but figured it was the sauce.  Famous last words.  My stomach immediately hurt, but I chalked it up to a bad mixture of food.  But then I got confirmation from my friends who went with me.  It's one thing to skimp on portions (the $15 salmon dish was microscopic), but when you start serving bad meat, that's downright wrong!  Too bad.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-15", "description": "Echoing some of the other reviewers, I have heard rave reviews about Thep Phanom. However, their pad thai is really uninspiring -- if you want to be a good Thai restaurant, you got to be able to make good Pad Thai. I've gotten a couple other dishes, which were similarly uninspiring. In addition, the prices are slightly higher than most Thai places in the city. Yet they always seem packed for dinner. It boggles the mind. Anyway, I think there are plenty of better or comparable Thai places that are cheaper.", "author": "Luke F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-18", "description": "thep phanom is my go-to restaurant for insanely good take-out. the crowds are a little intimidating, and i find the layout a little uncomfortable, so most nights i'll call in my order and send my sweetie to pick it up. the salt and pepper beef is AMAZING - don't leave that off your list. and the tom ka gai is creamy and delicious. highly highly recommended.", "author": "oona m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-15", "description": "good thai food. always packed. definitely make a reservation if you can or get there really early.", "author": "Dean E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-28", "description": "Hands down the best thai food I've ever had. I take out of town visitors here and people love this place!  Presentation is beautiful, food tastes amazing. Desserts are great, especially sticky rice with mango or ice cream.  The lemongrass salad (with minced shrimp and chicken) is a big hit. Really unique/special entrees, different/better than other thai places.  My 2nd favorite thai place is Suriya on Valencia in the mission.", "author": "Mic L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-02", "description": "The best thai food I've had in SF, hands down.  It seems like there are thai places on every corner and the majority are bland and indistinguishable from one another (yet seem to have 4 star yelp recommendations??!).  I heard this place was good and went being sure not to get my hopes up and I can happily say that my search is over :).  They have brown rice too!  Bonus points!", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-08", "description": "wow, this place is amazing. my friend's new boytoy was out to win some points by letting me tag along with them to a nice dinner, and impress he did. \n\nthe food just kept coming with stuffed chicken wings, fried quail, spicy chicken and basil, a whole tamarind fish and some other stuff that i can't really remember. it was a giant feast- everything was fantastic, the service was impeccable and the decor is cozy. i have nothing to complain about- would recommend it as a good place to go on a nice date.", "author": "Mary Beth D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "This was my 2nd time eating here. Actually the 1st time we had takeout and this was the 1st time inside the restaurant. We were seated within a few minutes of arriving. For a Monday night the place was packed. The service was really great and everyone was very friendly and patient with our group of 4 trying to decide what to have. We all had a bunch of different appz. and main entrees sharing everything. They even had several special dishes and we chose one. Everything was super good, served hot and timed well. They also had a very nice wine list. We had 3 bottles (lushes...all of us) of Chardonnay all very tasty and reasonable in price $32.00-$36.00. Most of the plates ran between $10-$14 and were a sizeable portion.  Don't go here if your looking for a quiet evening...the place is somewhat short on space and everyone is packed in (I guess you could say \"cozy\")so it can get loud in there. All in all a great place to eat delicious Thai food. Don't Pass This One Up!", "author": "J G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-22", "description": "damn good thai food - delicately flavored  and a great place to bring out of towners.  but make a reservation so you are not standing in the cold entryway.", "author": "M B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-17", "description": "pretty good, but not one of my favorite thai places in the city.  actually each time i go i like it a little bit less.  not sure why that is exactly....\n\nthaitanic beef and thaitanic chicken are pretty good.\n\ni think i find it a bit blander than some other places.", "author": "n. h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "i would have to they they are the best thai restaurant in sf. i eat of lot of thai, i also happen to live right across the street. lucky me!\n\nthey know my name and know what i order. i don't even have to speak half the time. the owner is super sweet and she hooks it up with tea and desserts. \n\nthe thai iced tea is better than sex. i would know, i have a lot of that, too. i love that the brown rice is wild grain. not enough restaurants have that!\n\nyou need to go at least to just look at their uniforms!", "author": "parker t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-11", "description": "I've always liked their pad thai. And the crispy basil chicken. Service is always good. But like others my feeling is that the place isn't what it used to be, and the prices are steep. Still my favorite but I'm hoping to find better.", "author": "The M."}
