{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "i love this bar! it's too overly trendy to where you constantly need to roll your eyes and the people (both patrons and staff) are friendly and respectful! \n\nI've been here twice -- once randomly on their 2 year anniversary party which was lit and last weekend just to grab a drink. The first time they had a love DJ and drink specials all night for the momentous occasion, it gave me a great first impression of the bar which lead me to return during a business as usual evening. The music was still great sans the live DJ. This time instead of getting cocktails i opted for the beer, shot and jerky combo -- for a whomping $10 this is a steal! \n\nThis is a great bar for a date, to solo treat yourself and for a close group of friends!", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "I went to this place on a Tuesday right around 3:00 with some coworkers. It was a quick drink and didn't spend too much time here. However, the 30 mins or so I spent here gave me a good vibe of the place. \n\nIt has a nice interior with with lots of seating at the bar. You also have some tables to sit with group of friends. My Coworker had 2 rounds of a beer, shot & beef jerky I think he paid around $24(not 10% sure). I ordered a sculpin IPA and I paid $6.\n\nThe bartender was friendly when we got there and served as quick as we were almost the only people there. I will come back a bit later during the day to see what type of crowd goes here.", "author": "Andre M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "I came here to get a drink with a friend I had not seen in seven years and was also new to San Francisco. This meant I needed a place that was original and impressive, but not too popular to the point where we would not be able to converse. I read online that this bar does receive customers, but not to the point where you must wait for a seat and are shoving people around to reach the bartender.\n\nThird Rail addressed these needs of mine perfectly. I arrived at 8:30pm on a Friday night, and there was abundant seating, and maybe around three or four small parties already there.  We were handed a menu by the bartender, and decided to order the $10 deal, which is a choice of beer, a shot, and a bite of beef jerky. The drinks were good, and my shot of tequila went down easy. The only problem with the beef jerky was that there was not enough of it! It was tender and juicy, not at all like a supermarket jerky. \n\nI will come here again to grab a drink with a friend. It's the perfect ambience for catching up in a lively enough environment.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "I don't know why it took me so long to come here! I love what's on their menu: Shots, beer and jerky.  Great combo.  You literally should try all the jerky.  My favorite was the Cajun, nice kick to it.  Cool lounge to hang out with some friends on a weekday and the bartenders are nice and attentive. Check it out!", "author": "KB B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "I went to Third Rail with a friend on a Saturday afternoon and I was really impressed. The space itself is a cute bar area with tables around the space for bigger parties or if you don't want to sit at the bar. \n\nBoth of us started with the Rail Shot which is your choice of a beer, a shot (bourbon, tequila, mezcal, or fernet), and then a pick of a jerky for only $10. Such a great deal! After trying the jerky we decided to order a few more drinks and split the large jerky sampler. All of the jerky flavors were really really good but of course we had our favorites. My personal favorite was the Mighty and the Sriracha but all of them are a must try. \n\nThe bartenders were very attentive and really very nice. The atmosphere of the bar was great, it wasn't too loud and was very easy to have a conversation. The cocktail list is great and they have an awesome selection of whiskey and the bartenders are very knowledgeable. This would make a great date spot. I will definitely be back!", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "If you are looking to go out for drinking but you still want to enjoy something tasty, Third Rail is your place! Their snacks selection is pretty original and thanks to their accessible prices you will be able to have fun trying many of them!\n\nCajun (3/5): If you like sweet, this could be your choice. Otherwise, go for the others options.\n\nMighty Meat (4/5): Their most solid option. It is fatty and spicy enough but not too much. A true mighty meat!\n\nSriracha Jerky (4/5): If you cannot handle spicy, this is not for you. Probably my favorite!\n\nSonoma Smoke (3.5/5): This was the favorite snack of my table. However, personally, I think the spicy ones have that something more which this one is missing.\n\nOverall Rating (3.5/5):\nVery nice pub with surprisingly tasty snacks, can't wait to try more of them! Their \"Wall of Jerky\" totally deserves the 4 stars!", "author": "Manuel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "This block contains one of my favorite bar trifectas: Triple Voodoo, Sea Star, and Third Rail. I've been wanting to come to Third Rail for awhile, but it never crossed my mind since it's on a side street I never walk by. One of Dogpatch's hidden gems, you could say?\n\nMy friend and I came here in the late afternoon for a few drinks. It wasn't too busy, but the best menu item (the Third Rail Shot) takes awhile to prepare. For $10, you get a half shot, half beer, and piece of jerky. Great deal! My favorite combo was the IPA, bourbon, and mighty jerky. Just remember to tip the bartender well.\n\nWe had a great conversation with the bartender. I think her name is Shannon? Anyways, she made us feel like regulars, which we just might become. Good variety of cocktails, fresh bar snacks, and beers on tap. There's a variety of seating around the room, perfect for groups or solo adventure-seekers.\n\nBest of all, it's next to the Muni T line, which I take from where I live. It's not too busy in this neighborhood. And that whole bar trifecta I mentioned earlier is dog-friendly! Since there's no kitchen in any of the restaurants, pets are allowed, so I'm definitely bringing mine next time.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Amazing place in dogpatch to relax and get a drink. Really gets busy but wasn't uncomfortably crowded. Made it to happy hour on Friday which ends at 6pm. Happy hour is now $6 beer on tap and $10 cocktail of the week which changes.  Got a few cocktails and the third rail shot. Everything was great. The third rail shot deal is a great deal, especially the jerky. The jerky is legit here. Got the Sonoma and it had a great flavor. Can't wait to try the others.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "I have been meaning to try Third Rail for a while. I finally did and was very happy for identifying good cocktail bar in the Southern part of the city. \n\nI did spend quite some time on a Sunday afternoon and I was able to try a good number of cocktails. I highly recommend each one I tried: Diplomat with Maedira fortified wine (putting cardamoms on the orange peel was a cool touch), the lemony Third Rail, Lochness with cinnamon and apple, and a perfectly executed Manhattan. In addition to cocktails, I sampled a number of their beef jerky. Sriracha flavored beef jerky was my favorite. I have never had beef jerky accompanying cocktail drinking (instead of nuts for instance) before and enjoyed it a lot. They also let you being your food, too!\n\nThe ambience was also cool. You can sit at the bar, or on some comfortable sofas and tables for you. \n\nHighly recommended.", "author": "Doruk B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "A fantastic neighborhood bar.  At the moment it serves tiki drinks, as well as its signature jerky.  There's a few outdoor seats, then a handful of tables inside.  \n\nThere's a good balance of spirit-forward drinks and more light drinks, especially now that it's tiki season.  I was quite happy with the evil twin mezcal, grapefruit, lemon, aperol, habanero tincture, and celery bitters drink, and my friends were pretty happy with their leviathan and other bourbon-based drinks.  \n\nFriendly service, definitely worth returning.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Craft beer?  Check\n\nWhiskey?  Check\n\nTasty gourmet jerky?  Check\n\nSolid bartenders?  Check\n\nLap dogs eyeing you and your jerky smelling hands with wanton desire?  Check\n\nI think the sriracha was my favorite.  And the King Charles Spaniel.  The jerky and the dog to be exact.", "author": "Jim W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Great cocktails and awesome.ambience to have a drink with a friend. Bartender was courteous to explain all his drinks to us and recommended drinks based on our likings. One of the best picks in dogpatch.", "author": "Prerna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Great spot for Whiskey, Scotches, Gins , Vodkas, beers, and beef jerky. Great Bartenders and relaxed atmosphere.", "author": "Miguel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "Bartendar knowingly made fun of someone with Asperger's. 'Nuff said.\n\nFuck this place and the people who run it.", "author": "George M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Easy to miss, hard to forget ;) Super cute little bar that's tucked away down a side street. Great happy hour, delicious and refreshing cocktails, plus they have VEGAN JERKY!! I did haven't tried it yet but I love having the option!", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "This is one of my favorite spots in SF for catching up with friends. The drinks are consistently tasty, the bartenders are chill and there is just enough space. It's usually pretty busy on the weekends, but on weekdays you're pretty much guaranteed to find a seat. \n\nMy go-to drinks are the Third Rail (lemon-y and refreshing), the Diplomat (which to me tastes like a classy old chesterfield couch and success), and the Mt Tam with which makes me feel like I'm on a hike while getting drunk (awesome!). \n\nI tried the Jigglypuff and 12 Angry Men this weekend because.. well, I liked the names. Both were good but not enough to replace my usual favorites.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Really liked this place! The drinks and specials are overall pretty great. They have a shot, beer and jerky combo for $10, which is amazing (you choose one of each from 4 options, so you can customize to what you want!). They have a good beer selection and well-made cocktails as well, all at reasonable prices. \n\nBeyond the alcohol on offer, this place captures a lot of what I like in a bar. It's bustling but not crowded, there's lots of seating, it's quiet enough to have a conversation, the bartenders are friendly, and the music selection is on point if you like alternative/indie type stuff. \n\nIt also has a laid back, cozy, \"saloon\" sort of vibe that make it a nice place to pass the time. It's a good place for a casual date, or would be a good spot to catch up with a friend, or to bring a larger group. I'm a fan!", "author": "Christine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I love this place. I had an Scotch, smokeyyyy - Laphroaig! Even my penis said: let's do this sh&$#@!", "author": "Mike T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-02", "description": "Sat at bar with friend, one other person in Bar at 6:30pm on a Friday night. Asked bartendress for a side glass of water with my martini rocks and she told me to get up and get the water from the water station. I watched the other bartender pour water for other guests 1/2 hour later, now maybe 8 people in the bar. Interesting. Spent over $100 in about 1.5hrs, left generous tip but will never return. We work in hospitality in Dogpatch a few blocks away, such a disappointment to watch a person lean with nothing to do, no guests to serve, pretentious hospitality.", "author": "Rowena P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "Gorgeous Dogpatch venue just off Third Street and the T line that has a bit of a speakeasy feel to it, and a bit of a hipsterish feel to it, without being pretentious or annoying. \n\nThe best part is the service - the bartenders are super friendly, helpful, and engaging. They're happy to recommend different drinks based on your mood or preferences, and despite the fact that everything looks a bit spendy on the surface, all the drinks are quite well-crafted. \n\nThere's also a good amount of space to spread out, whether at the lively bar or throughout the establishment. A good neighborhood option to have.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Dogpatch during the day is bustling, but at night is dead. So dead there aren't even crickets chirping in the background.\n\nI'm so glad my friend found this place, since it's close to home! Hidden right behind Dogpatch Cafe lies Third Rail, a 1920's themed bar that serves innovative cocktails, similar to Alchemist or Local Edition, but smaller in size.\n\nMy first order consisted of the Rail Shot for $10, in which you get to choose a beer, a shot, and  a jerky. A great deal if you ask me. However, do note that the beers are smaller than your average glass of 16-20 ounces. The beer was for the bf and the shot for me. I got a shot of the Mezcal in which I enjoyed before gulping it down to the hoorahs of a birthday celebration. It has a strong similarity to tequila with a smokiness to it. I would definitely order this shot again. I got the Mighty Jerky which was very tasty. They sell their jerky separately too.\n\nFor my second order, I ordered the Jigglypuff consisting of gin, sherry, orgeat, lemon, egg white, and nutmeg. How could I resist a drink named after a Pokemon? So befitting of me. The drink was delicious, more on the sweet side. The only thing I could complain about was that the egg white foam was a bit too much.\n\nService was great. It didn't take long for a bartender to notice me then shortly after took my order. They take credit cards too, for those who never carry cash such as I.\n\nThere's plenty of street parking. The only downside to this bar is that the noise level is quite high. I could barely hold a conversation without sticking my ear in my friends' faces just to hear what they were saying.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "I am not the biggest fan of jerky, but Third Rails jerky combos made me go yahoooo crazy. Affordable prices, great combos, and bartenders that love talking about whiskey and drink pairings -- I am in love! \n\nFirst things first, if you want to get crazy and have a long night ahead of you, please do the beer shot jerky combo - rail shot with quality beer. If you want to spend a little more $$, then the jerky plus whisky combo compliment each other well. \n\nCompared to other bars in SF, Third Rail is a classy and chill joint and I highly suggest coming here to celebrate any occasion!", "author": "Eric Joseph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Fantastic cocktails. Tried 4 between 2 of us. Third Rail was my favorite. Beautiful and cozy space. Bartender was engaging, professional and knowledgeable. \nI will go back.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Shot, beer, and jerky! Yes!\n\nFun idea and get's the job done! I came here with a couple friends so we got to try the three types of jerky and different beers. Fun place. And apparently you can bring food in because a birthday party group of people wandered in with pizza.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Best across the board:\n1. Ambience: Beautiful & cozy neighborhood gem with speakeasy feel and not super loud (as opposed to other spots)\n2. Service: F^2 - Freaking fantastic - they have a great memory :)\n3. Selection: Great selection, the scotch & jerky combo is second to none (they even have vegetarian mushroom jerky)\n\nThis venue hosts private events as well. My boyfriend and I actually booked them out for his birthday and they are just fantastic. $500 minimum + gratuity + taxes (and ZERO cake cutting fees FYI - many venues charge $5 per person or just gut you with an obscene all-in fee) and the guys even put up a custom sign for our event. Having planned multiple 40-100 person events for my company and personally, this is definitely one of the best experiences I've had working with a venue and the guys just feel like they're your neighbor :)\n\nAs mentioned, Third Rail is just 2nd to none, especially after a workout or climb at Dogpatch Boulders. Great for a date, a happy hour, or to host for a private event. Cheers to the staff for making it such a great venue.", "author": "Marlene J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Favorite bar in Dogpatch right now. But to be fair, I order jerky fresh from Bishop, CA and have whiskey, scotch and rum mail ordered. So this is kind of like my Disneyland of bar/lounges. \n\nVery chill vibe, lively but still intimate, sadly/not-so-sadly (depending on who you ask), no kids, even in strollers.\n\nThe bartenders are top notch and the menu affords them opportunities to \"wow\" you with a custom drink creation paired with some jerky.\n\nI hate when people say \"the food was excellent\" (without going into detail). I mean, did you literally eat one of EVERYTHING?!?!?\n\nWell I did. at least for the jerky. and they are all exceptional. Top three:\n\n1. Spicy Beef Candy  (beef) - brown sugar, sea salt, chilies (def. on the sweet side and moist AF)\n\n2. Sriracha Jerky\n\n3. Sonoma Smoke (ginger, brown sugar, onion, soy sauce)", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Their jerky is very good, but their drinks are better. My personal favorite is the Riding Hood (vodka, strawberry, rhubarb, lemon, vanilla, served up), which tastes just like summer and you can have 3 or 4 in a row without even thinking about it. My bar of choice for catching up with people!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "A little bar in the dogpatch that isn't the trendiest but does the job well. There are quite a few seats for you to hang out at, and if you are hungry they also have jerky pairings. \n\nI only got a few cocktails here, and they were average (nothing special, decent balance) , probably worth 3 stars. However, the price is very reasonable, so it's a good place to linger and have more than a few.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Third Rail is a really cool bar in the Dogpatch area.  I went here to gather with a brunch of friends to meet up for after-dinner drinks.  We went during the middle of the week so it wasn't too busy and parking was relatively easy around the area during that time.  It's not a huge bar but there's plenty of standing room and tables along the walls to place your drinks as well as few chairs near the front entrance.\n\nMy drink of choice for the night was the Sloe Ride -- (http://bit.ly/1HKfocZ) with sloe gin, lemon, cappelletti bitter, pineapple, prosecco (served on the rocks ).  It was listed under one of their Lighter Side drinks so it wasn't too strong but more on the fruity side.  It's a refreshing drink and was good with to wash down their selection of Jerky and 4505 Chicharones, which if you haven't had before, I highly recommend you try.\n\nOverall, nice bar to go to for some well crafted drinks if you're in the Dogpatch.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Delicious cocktails. Beer was good and some local ones. I only had rail shots all night. Great deal of getting some beer, a shot, and jerky. Favorite was the smoked one by far. The sriracha was also tasty. Tried the mighty meat as well but seemed almost too dry. The candy was a perfect amount of sweetness in the jerky. Service was probably average for any bar in the city. Atmosphere was nice and recommend stopping in!", "author": "Emily F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Beer + Liquor + Jerky = Boomtime.\n\nMet some friends here to catch up over drinks, and we were pleasantly surprised to discover the Rail Shot - \"A little beer, a little shot, and a little jerky.\" All for $10, $8 during happy hour. Yes please, sign us up! You have 4 choices of each to mix and match to your heart's content. I went with a glass of Red Barn, a shot of Tequila, and the Red Eye jerky. There were 4 of us altogether, so we just ended up ordering each type of jerky and shared. For a couple rounds. Haha.\n\nVery cool and hip ambiance. We came here on a Monday night, and there weren't too many people, as to be expected. We found seats towards the back easily. The lighting was dim, as reflected in my photo, but it added a nice intimate feeling. Bar keeps were friendly and helpful.\n\nAll in all, a cool place to grab drinks and hang out with friends, and nom on some tasty jerky. I would definitely come back!\n\nProtip: They only serve jerky here as far as food, so I eventually asked one of bartenders if it was ok to bring in our own, to which he replied yes! We went to Long Bridge Pizza Company, about a block away, got 2 large 'zas, shared some slices with the good folks at Third Rail, and feasted with our drinks. Sweet!\n\nProtip #2: Staying for a while? Really thirsty? Order a double Rail Shot, aka a Stinky Hobo, for $19!", "author": "Roderick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Don't spend too much time in the dogpatch but I came here last night and loved every minute of it! I tried two drinks:\n\n1. Bone Machine - bourbon, oloroso sherry, amaro & bitters (basically an old fashioned but one of the best I've had)\n2. Fresh Nog (Holiday Drink) - bourbon, allspice dram, vanilla, sherry, whole egg \n\nBoth drinks were incredibly delicious and I would highly recommend them. I am also interested in trying their beef jerky everyone raves about - I'll just have to try it next time!", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "The folks behind Third Rail followed a simple math formula and succeeded:\n\nJerky + whiskey = genius \n\nHow often do we crave for salty little snacks when drinking booze? It's a no brainer! Price ranges from $11-$17 when you get the whiskey of your choice (Eagle Rare, Templeton, Laphroiag 10) plus 1 ounce of house made jerky. \n\nI came from a whiskey tasting prior to Third Rail so I wanted a different cocktail: the Evil Twin with Mezcal, aperol, lemon & grapefruit juices and habanero bitters hit the spot.\n\nI like the train station inspired decor here. And aside from the memorable cocktail menu, the kettle cooked 4505 chicharonnes will change your life.\n\nAt Third Rail, there's so much win but so little time!", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-02", "description": "Great bar with amazing cocktails and service. Love everything about this place. I'm afraid to write too much because I don't want the bar to get too crowded.\n\nUPDATE: I changed my rating from five stars because there is one bartender who consistently makes bad drinks. When you watch him making the drinks, you can tell he puts a lot of effort and care into it, and it looks impressive and you get excited because you think it's gonna be the best drink ever, but then you taste it and it's almost undrinkable. I once asked for a different bartender and got attitude for it, like, \"No, we all make our drinks identically,\" but sure enough, the drinks were way better made by a different bartender. The last time I got stuck with the bad drink-maker, I decided to stop coming to this bar.", "author": "Young J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "(08/27/16) We were on our way to Triple Voodoo when we noticed this spot, so we decided to check it out after for a proper cocktail. The place is modern, small, and a had a nice lively crowd when we arrived.\n\nOrdering was easy despite it being pretty crowded. I ordered 2 Whiskey Sours with Bulleit Bourbon and hold the egg whites ($11 each). I didn't bother to ask what their well whiskey was. The whiskey sour here was awesome! The sour mix was near perfect. I would have preferred it just a bit more sour but I'm in no way complaining. Maybe it's just the city bc I get good ones in the valley, but not as good as out here.\n\nA friend of ours ordered a sample platter of their beef jerky. The candy jerky and smoked jerky were killer. I could have ate those the whole night.\n\nThis place was a nice find and I will definitely have it added to my places for a legit whiskey sour. The Burritt Room + Tavern so far has my favorite whiskey sour. I'll definitely make it back here.", "author": "D B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Incredibly well-made cocktails. The 'Third Rail' is great, as is the 'Poolside.' Both drinks were balanced and fruity but not cloying. Mmmm. Nice vibe, good jerkies. The 'Grandma Frances' was tasty, mildly sweet and savory. I want to go back and try their vegetarian jerky offerings. \n\nA great date spot, assuming your date might find it endearing as you masticate for an extended period of time à la cow.", "author": "Orr R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "I've recently admitted to having a Mezcal obsession. I really like the smokey texture and the after taste.  I'd thought I'd give this low key, hidden gem place a try. \n\nThird Rail has incredible selections of well made drinks, from cocktails to beers to tasty whiskey and jerky pairings. COUNT ME IN!!!\n\nA glass of Racer 5 beer, a shot of Mezcal, and mighty meat jerky, why not?!?!\n\nCan't forget my Fireside Sour cocktails (which of course, had Mezcal too!). \n\nAs good as it gets, $10 for cocktails. Reasonably priced. \n\nI hope you give this place a whirl. Great service and great vibe. Cheers! \n\nThe simple things in life.", "author": "Owie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "After attending a birthday party nearby, Peter L and I decided to continue the festivities. Or get a nightcap as he likes to call it. We arrived around 11:45pm on Saturday, April 11th. The bar was busy, but not so much that we couldn't find a couple of seats at the bar. Seeing the jerky pairings, I just had to try one! We ordered:\n\n*Mosswood +Red eye ($12)\n*Belvenie 14 +Jerk jerky ($17)\n\nI got the Belvenie and Jerk jerky. The jerky had a nice fattiness to it, which went well with the 14 year. I tried Peter's pairing, but his jerky was leaner, so I found it tough after eating my jerky.\n\nWe ordered more cocktails and snacks which I vaguely remember. I guess that's what happens when you're having too much fun?\n\n*Third rail: bourbon, lillet, honey, lemon, orange bitters ($11)\n*Bone machine: bourbon, oloroso sherry, amaro, bitters ($11)\n*Chicharrones ($4 per bag)\n*Sticks ($3.50 each)\n\nI'd come back for the whisky and jerky pairings as they were delicious! How can I say no to quenching my thirst while satisfying my hunger?!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Beer/shot/jerky? Why not! An awesome little dog-friendly bar with a laid-back vibe. Bring some tacos from Glena's next door. Try the Tally Ho!  Great find!", "author": "Lisa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "This place is similar to my favorite drinking spots (lounges and speakeasies) but without the excessive noise and crowds. Sometimes you want to drink and not have to yell? Another difference is the variety of beef jerky they have with drink-pairings. Not used to it but it works!\n\nThey serve good, strong cocktails (recommend the Bone Crusher or any bourbon-based cocktails). There are mostly brown-color liquors if you prefer it straight (looks like they carry good top-shelf bourbon and whiskies too). However, their menu also covers the lighter or sweeter cocktails and beers.\n\nAll the above against a background music mix (from the '60s to '00s) and you can't go wrong starting or ending the night here. Yes, the place is now in my rotation.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "This is a fantastic bar. It is well worth your time to come here. The owner/bartender was very friendly. The ambiance was great. The drinks are made with care by hand and were amazing. I had the Tally Ho and it was fantastic. We will be going back.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Got the jiggly puff + jerky pairing during happy hour and it was bomb.  Jiggly puff is gin...13 dollars but 2 dollars off during happy hour which ends at 6pm.\n\nThere's no food here....just good alcohol and beef jerry! Best combo!! \n\nThere is happy hour from 4 to 6pm, which is 2 dollars off on everything on the first 3 pages!", "author": "Caitlin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "One Friday, December 1st, 2017 a friend and I just on a fluke decided to stop in and try out Third Rail. Now at first entering the establishment its a very dark saloon type atmosphere with a new updated design. The Bartenders are great! Pleasant personalities with great conversation. The drink suggestions from the Bartenders were good and refreshing. My friend and I had such a delightful time that we will definitely be coming back. We are both a native of San Francisco, CA and the Third Rail is right in our backyards!!!See ya soon Third Rail and thx again for the fun time after a long week of work. Jill and Reggie", "author": "Jill H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "My favorite post-Giants game spot for a quality cocktail and delicious jerky.  Seriously, the 3rd Rail jerky is no joke!\n\nAfter the game, take a brisk walk down 3rd into the Dogpatch.  A few years ago this was a desolate walk but now hipster gentrification and UCSF has turned Mission Bay into a thriving neighborhood.  Have a drink or 3 at 3rd Rail then jump into an Uber or the 23rd Street Caltrain to find your way home.\n\n3rd Rail makes seriously good craft cocktails, I take my friends here for an after work / pre dinner cocktail from time to time and it's always a hit.  If you just want a beer, pass up 3rd Rail and hit up the Dogpatch Saloon just a few blocks away.", "author": "Lance W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "I spent a night in the Dogpatch recently while visiting San Francisco. It was my first time in the neighborhood, and I got the sense that this bar was perfect for me and probably terrible news for somebody's rent. (I just googled it and one of the first hits is \"The Scoop on Dogpatch: San Francisco's New Indie Neighborhood,\" from 2013.) God am I a sucker for good $13 cocktails with big fancy ice cubes.\n\nI came here with my husband and our friend Mike W. for early drinks before a late dinner nearby. I loved the place immediately--cozy, dim, and quiet, with \"oh, this? we just slapped this together out of reclaimed woods\" decor. It was very relaxed at 7:30 on a Thursday, and we nabbed a table along with ease. Service at the bar was quick and polite.\n\nThe drinks were excellent, though two months later, I can't remember every one we got in our two rounds (a real thorn in my Yelp OCD). The ones I do remember are the Bone Machine, the Rhinoceros, the Aftermath, and the Diplomat, all outstanding. The first two were both strong, smooth whiskey cocktails: the Bone Machine made with bourbon, oloroso sherry, amaro, and bitters; the Rhinoceros with rye, ginger liqueur, bonal, and bitters. I tend to like these boozy brown liquor drinks when they're made with that golden balance. The Aftermath and the Diplomat were made with rum, but they also fit into this category. The Aftermath mixed rhum agricole with burnt honey, vermouth, and bitters, and was probably my favorite drink of the night, bold and warming, with a lot of depth. The Diplomat wasn't on the menu that night, but Mike knew to order it. Another winner, a rounded combination of rum, madeira, walnut, and bitters.\n\nIf we weren't going to dinner, I would've been into the beef jerky pairings, though that seems like a random gimmick for a cocktail bar. I hope to sample them in the future. I'd like to come back to Third Rail whenever I get the chance.", "author": "Steph C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "So I've been eating jerky for a week straight as I recently went to Seattle for a wedding and bought an obscene amount of jerky. Anyways, heard this place throws down on the cocktails and jerky and couldn't resist. Hands down coolest bar I've been to in a long while! They even have Old Forester 1920! Definitely coming back soon!!!", "author": "Rodney D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "My fav spot to grab a drink in Dogpatch. Great selection of cocktails. The team is friendly, knowledgeable, and willing to make what you want on or off the menu.", "author": "leslie m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Great Cocktails! Third Rail cocktail is named after the bar for a reason - very easy to drink and refreshing. Kyle was a great bartender!", "author": "Candace S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Described as some of my friends' favorite bar in the city. Though it's not my favorite, it's pretty great. Located in the Dogpatch near some great restaurants, this bar has a homely feel with good drinks and jerky (try the vegan jerky it's pretty great). I highly recommend the Jigglypuff, Stone's Throw, and Tally Ho (in that order). Will definitely be back!!", "author": "Vineet J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "Stopped by on a Friday night for a drink before going home and we were stoked to check this place out, especially since it's right down the road.  We grabbed a seat by the door and my bf got the drinks.  The wait took a little bit and he ordered his beer and got me a dirty martini, I also noticed that they also served beef jerky which I convinced him to get some.  \n\nWhen he came back he seemed pretty peeved.  He said that the bartender was very short and rude with him.  Wasn't friendly at all, which was a disappointment.  I did observe the bar a bit and notice that the same guy that served my bf didn't look very friendly this other couple at be bar.\n\nThis place looks really cool so I'll be back to give it another try.  \n\nBeef jerky was alright, a bit expensive for the three pieces you get though.", "author": "Nyla K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "As one of many stops on a barhopping adventure through dogpatch recently, we ended the night at Third Rail to grab some drinks before calling it a night. The various bars in the area are really starting to grow on me with each having its own theme and appeal. \n\nThird rail's gimmick is that it pairs all of its drinks with various types of beef jerky. I believe they even have a special combo in which you can choose one type of beer, one type of shot and one type of jerky all for $10. Each jerky comes with a very detailed description of its flavors and from this you can gather what it would pair best with.\n\nOverall, I really enjoyed this place and I would definitely come back because it is just so unique. I don't even know of anyone else that does something like this so I'm going to go ahead and say that if you're craving jerky and drinks together, this is \"as good as it gets.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "I like the beer/shot/jerky combo for $10, but the jerky I got tasted like old pepperoni - I don't remember what it was called though, so you're going to have to just try them all and see what you think.  Not a fan of the seating arrangement in here, though.  There was no way for our group of 5 to sit in a way where we could all chat - the only options require you to sit in a line and there is no standing room - the place is tiny.  I wouldn't trek out to the Dog Patch just to go here, but if I were in the area, I'd probably swing by again.", "author": "Emma H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Jerky & whiskey? Heck yeah. \nBest combination ever! Very intimate, quiet, bar that offers jerky. \n\nMedium sampler:\nSbc: 4\nMighty:5\nJerk:4\nSmoke:5\nRed eye:4 \nService:4\n\n\nOur drinks were extremely refreshing and perfect amount in each one. \n\nGlad we stopped by. Must try, this place is rather quiet so be respectful on neighbors and get your jerky on.", "author": "Vianka A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "The Good:\n+ Stealthy, speakeasy vibe.\n+ Jerky so good I got some to-go.\n+ They have chicharrones.\n+ Can carry conversation in here without screaming.\n\nThe Not So Good:\n- Two bartenders on duty means service can get slow if it gets crowded.\n\nBottom Line:  Great unique atmosphere.  Who doesn't love beef jerky?  \n\nPROTIP:  Mighty Jerky was my favorite.  You can get a beer, shot, and jerky combo for $10.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "There is something to be said about the Dogpatch neighborhood, but I almost don't want to say it because I want to keep the Dogpatch the way it is, low key and not too crowded.  There are some real gems out here, and Third Rail is one of them. \n\nHidden a bit off 3rd street, you could almost miss it if you didn't know the address, but once you walk in you are greeted by very clean, yet rustic looking bar.  The big draw for me was the Whiskey and Jerkey pairings.  Why hasn't this been done before!?! Genius!!!\n\nI love Eagle Rare bourbon and it is one of the parking options. At $11 for a pour and an oz of Jerkey, Sweet Meat, I felt it was a great deal!  My friend got the Mosswood and Red Eye pairing. Really with the whiskey and jerky there is no wrong pairing!\n\nThey also have Jerky by the ounce and you can load up.  The Salami stick is delicious, tasting like dry Chinese sausage, you really can't go wrong! \n\nThey had drink/shot/jerkey convo for about $10 as well. Didn't try it but it sounds like a great deal. They also have Happy Hour Specials.  \n\nI hear it can be crowded but it being the weekend of the Burning Man Exodus, the bar was fairly empty! LOVED IT!\n\nSo far can't find anything wrong with it to not give it 5 stars! Oh yeah, they also have menus from some of the surrounding eateries and you could order food to eat there!", "author": "Veasna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "A little bit out in the middle of nowhere land, which is slowly filling up with some great spots. Third Rail happens to be one of these great finds!\n\nafter filling up on meat and booze at Smokestack, we came to Third Rail for what? MORE MEAT AND BOOZE! \n\nThe cocktail selection covers a great variety. I feel like there's a little bit of something for everyone.  Third Rail's shtick is jerky. While their jerky is their popular gimmick, I actually didn't care much for it (and we had a decent variety, believe me). I did however, LOVE the meat sticks. Yo, artisan Slim Jims and crafty cocktails? DUHH.\n\nThe meat styx are so good.\n\n Skinny Rizo - Pork, Red Wine, Bay Leaf a bit sweet, but this made for a delicious morning breakfast on MUNI whilst reading \"Attempting Normal\" by Marc Maron Yea, I wake up with sticks of meat in my purse sometimes, ok?\n\nSalami Styx - Pork, Garlic, Fennel Seed LOVED THIS ONE. Savory, salty, garlicky mmmmmm plus the fennel seed wasn't overwhelming. Salami in a stick. Perfect handheld meat.\n\nAll cocktails are $10. best bang for your buck is the happy hour \"Rail Shot\" for $8 you get 8oz of beer (choice of Scrimshaw, Racer 5, Old Brick or Red Barn), a shot (tequila, bourbon, rum , or fernet) and 1/2 oz of jerky (choice of the mighty meat, red eye, jerk jerky or veg) \n\nMy kinda place.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "Bone crusher - GET IT!\n\nI love the idea of whiskey and jerky pairings, so genius! I generally like my jerky less dry, but my favorite part about their jerky selection was their unique flavors. The espresso flavored jerky and salami were incredible.\n\nWe didn't have much else except the bone crusher so I can't speak to the other cocktails. The staff could have been friendlier but I was just happy that the bar was mostly empty (maybe because Burning Man people were out of town?).", "author": "Jess C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "This is one of the most unwelcoming establishments I've been too. Bartenders are total assholes. The beef jerky is good.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Amazing cocktails, friendly bartenders, shot, beer and beef jerky special. Have I not sold you yet? It's one of my favorite bars in Dogpatch. This dive bar also has great vibes, and if you're hungry for more than jerky you can get take-out tacos from next-door and bring them in. This is the perfect spot to chat with friends and relax. Highly recommend!", "author": "Kara R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-07", "description": "Get decor trendy. Came on a random night and quiet... that's fine, however, bartender was unapproachable as fuck and uninterested in interaction. Ok. No tip for you... next!", "author": "TJ S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "If you want a fine cocktail and jerky, this is definitely the place to go.   Nothing wrong with it at all!  I had the green arrow cocktail. Very refreshing and balanced.  My favorite jerky was the sriracha.", "author": "Darel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-07", "description": "According to Reuters, as of 1.1.14, there are 54 million single people in the US (http://www.statisticbrain.com/online-dating-statistics/). Of those, 41 million have dabbled with online dating; I'm pretty sure the number is higher as some people are too embarrass to admit it. Ain't nothing wrong with online dating and if I were single, you best believe I would have a subscription to every one of those sites. Ok, maybe not Farmers Only. Hmm but a bull r-i-d-i-n-g cowboy does sound hawt. \n\nWith so much competition, you need a profile that stands out. And, I'm not talking about posting slutty selfies with your whoohaa showing.\n\nThat's how I feel with businesses these days. With a new bar popping up almost every month in SF serving \"artisan\" cocktails, something needs to stand out from the rest; whether it be the concept, the product, or the amazing service.\n\nSorry, but the only thing that stood out about Third Rail was the ridiculously easy, free street parking. \n\nThe staff at Third Rail weren't very friendly. The cocktail menu was nothing out of the ordinary but they do sell jerky for $2.50-$3 an ounce. The cocktail menu is split up to four sections: aperitif, seasonal, citrus, and spirituous. All cocktails are $10. CC's accepted.\n\nMy first cocktail (601) was horrible and tasted like star anise which wasn't listed on the menu description. I've never sent a drink back before but my friend insisted after he took a sip of it and thought it was awful. I got a replacement drink (Tally Ho) which then tasted like drinking straight lime juice. Very poorly balanced cocktails. *le sigh* Nothing worse than wasting booze right?\n\nWe ended up leaving to go to Holy Water in Bernal Heights (http://bit.ly/1cNl53q) where the staff and drinks are equally awesome. \n\nTwo stars for Third Rail overall but throwing in an extra star since they just opened last month. \n\nMmm speaking of those bull r-i-d-i-n-g cowboys. Yeeee hawwwww....", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "Unpretentious/knowledgeable/friendly bartenders, wide selection of creative/delicious/unique cocktails, and a whole menu page dedicated to 10+ types of homemade jerky. \n\nWhat more could you ask for? Hand carved ice display show by hunky staff? Beer+shot+jerky specials? Being able to bring your (well-behaved) pooch inside? Absolutely. If I lived in the neighborhood I'd come here every night!", "author": "emma l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "*UPDATE*\n\nWhat a way to end a weekend... Eating JERKY and drinking amazing cocktails.\n\nSometimes girlfriends have to ditch the men and have a girls-day-out and binge drink. Drunk day out drinking, eating, and enjoying ourselves... We find ourselves HERE at 3pm on a sunny Sunday afternoon. Perfect way to end our 6hr drinking session. I love my girlfriends and I'm happy to finally find a balance in between LOVE and FRIENDSHIP. \n\nHEFER STATS. \n\nJERKY JERKY ($2.50/ounce) - beef, scotch bonnet peppers, Clove, all spices, and thyme. this tasted like typical jerky with a sliver taste of thyme. I liked it. If you are the traditional jerky lover, this is for you. \n\nRED EYE JERKY ($2.50) - see my first review.\n\nCOWBOY JERKY ($2.50/ounce) - beef, pineapple juice, onion, and jalapeño. this was my favorite. It was a little tender when compared with the other jerky, good hint if heat, and flavorful. Hmmm yum! \n\nENVY ($10) - see my first review. \n\nZAPATISTA ($10) - very strong. Sippy sip kind of drink. \n\nSWEET THANG ($10) - vodka, pomegranate, thyme, white pepper, and lemon. Aagghh so refreshing!!! Bright pink, sweet, but not overly sweet. \n\nWill I be back? Of course.. It's becoming my favorite bar/cocktail bar!!!\n\nJABA APPROVED. Until the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Went here w/ bae... bae is a little picky when it comes to bars... \nWe agreed that Third Rail strikes a tricky balance between divey and hipster-bougie-divey.  All in All - i did not mine paying $11 for this cocktail and as a SF (former NYC) resident I certainly can not say that for the avg cocktail. \n\n bartender was a tad snobby to bae though - half a star reduction. Bartender later redeems this half a star bc the cocktails were so bomb I can't even hate on it - crafted with precision and oh-so-smooth\n\nI had the weekly special: walking spanish -tequila, fino sherry, maraschino, lime, bitters\n*so so good* - not margarita sweet, but but super smooth. I was craving tequila after we got tacos @ Glena's next door.\n\nBae had the bar namesake - mm so so good - like a manhattan but a bit sweeter. \nthird rail-   bourbon, lillet, honey, lemon, orange bitters (served up )\n\nWe will certainly be back. Jerky also excellent / ingenious concept", "author": "Clare W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Great laid-back neighborhood bar with very well crafted cocktails. The tally ho is excellent!", "author": "Doug V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Just starting to explore cocktail bars in SF, but this place may be my go-to!\n\nCame here on a friday night around 11pm and it was pretty full and loud, but still some seating available.  Didn't take much time to get a seat at the bar and the attention of our bartender.  \n\nWell-made drinks and a good selection.  Loved that they split the menu into tastes/flavor.  I zoomed in on the citrus and chose the Tally Ho. Nice and crisp with a smooth sweetness, that wasn't syrupy.  \n\nCrowd started to thin out around 12 as people started giddily running out, when their lyfts arrived.  Or when they had lost their voices from yelling and could no longer communicate.\n\nWe didn't get to try the jerky this time, but will definitely be back to try more of the drinks and jerky!", "author": "Janel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "I live right upstairs from Third Rail and have watched as they've transformed this place from the old dive bar, Retox, to this new cocktail lounge. Tonight my roommates and I went to the soft opening. The owners, including Jeff, are super nice - he talked to us for quite a bit and, obviously, knew the menu really well.\nJeff at the bar: http://www.yelp.com/biz_photos/third-rail-san-francisco?select=W9FGEus1myp76_WpFahZ0g#grX3ULa0XV4qCiPJfWeO_Q\n\nThere's a good mix of drinks (and they only had half of the full menu available) and you're extremely likely to find something you'll like.\n\nWe got: \n\nAPERITIF:\n* 601 - 3 stars\n(Sutton cellars vermouth, prosecco, ginger, honey, lemon)\nAll my roommates really liked the ginger, which comes through at the end of a sip. However, and maybe I'm more sensitive to the dry flavor of the prosecco, I mostly just tasted the prosecco. It was also a pretty light drink, but to be fair, I asked Jeff for a ginger drink that was not too boozy (the Tally Ho is the other ginger one) and he said the Aperitifs are the lighter drinks).\n\nSEASONAL:\n* Sweet Thang - 4.5 stars\n(Tito's Vodka, pomegranate, thyme, white pepper, lemon)\nLove the sprig of thyme sticking out of this drink. It has the unique effect of allowing you to smell it every time you take a sip, which adds to the flavor in a totally unique and wonderful way compared to if it were mixed in. The pomegranate was the strongest flavor, and it was boozy but didn't taste so much so.\n\n* Harvest Moon - 3.5 stars\n(Pueblo viejo blanco tequila, Asian pear, kubler absinthe, lime)\nThe tequila definitely stood out in the flavor here - not as sharp in flavor as the Sweet Thang, more mild, more mellow, but also well balanced if you love tequilas. \n\nPhoto of these drinks: http://www.yelp.com/biz_photos/third-rail-san-francisco?select=W9FGEus1myp76_WpFahZ0g#Yp9G8I6RA77xG9R69DN9vA\n\nCITRUS:\n* Third Rail - 4.5 stars\n(Buffalo Trace bourbon, lillet, honey, lemon, orange bitters)\nDidn't get to try it but all my roommates were raving about this. Of course - it's their namesake, it's gotta be good! I'll be sure to order this next time.\n\nCocktail menu: http://www.yelp.com/biz_photos/third-rail-san-francisco?select=W9FGEus1myp76_WpFahZ0g#hm8wqQBiVepoLRzc4EVhCw\nJerky menu: http://www.yelp.com/biz_photos/third-rail-san-francisco?select=W9FGEus1myp76_WpFahZ0g#W9FGEus1myp76_WpFahZ0g", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Beer, Shot, Jerky combo for a steal of $10. Does it really get any better than that?! \nI was extremely excited to check this place out. Arrived around midnight on a Friday and was thrilled to find that it wasn't crowded at all. My cousin, sister, and I were able to snag seats at the bar with no issue. It's in a bit of a secluded area. \n\nIf you go for the $10 deal, which you should...\nYou get to choose from 4 beer options, shot options, and jerky options. You get a good size portion of beer and jerky (shot is standard shot glass). Between me & my sister, we got to try all jerky options and each one was really great! Good flavor & texture with my favorite being the Mighty Meat. \n\nBartenders were all friendly and helpful. This would definitely be a regular spot for me if I was from the area!", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "Came here to ring in my birthday this year, and Phil and Jeff were awesome at helping me set up! The environment is chill, which is awesome because you can bring the party! My group was about 15-20 people deep at any given time, and we were about 1/3 of the place. Because I made a reservation, they saved the front area (couches and stools) for my party. And I was able to tell oblivious people (seriously signs saying \"reserved\" were like confetti, and dudes still walked over to sit?!). that it was reserved. BOOM! \n\nThey have a full bar, and hella jerky. The carrot jerky became a point of amusement for me. Get it if you're vegetarian. Otherwise. It's odd. Sweet from the carrot and super spiced. But you have to just try it once! Get a piece with your other jerky. \n\nDrinks-wise, everything is pretty solid. There's a few specialty stuff, but they can clearly make regular stuff too. My friends kept getting me this strawberry thing that was good...but super sweet. I'd get that for other people who don't like booze as much. Me...that made my tooth hurt after the 3rd one...\n\nIf you want to watch the game (any game) they have a TV here. But they also have this awesome barn door to slide over the TV to make it less pub-feel at night. And..probably protect the TV.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "The Third Rail is an excellent cocktail bar in the funky cool Dogpatch neighborhood.  Although a bit small, it's quiet and never overly crowded.  It's almost as if this place is a well kept secret; it should be crammed with hipsters.  Perhaps that's the charm of Dogpatch working it's magic.\n\nThe drinks are well made, strong and priced within reason (all cocktails are $10.)  There's also a good beer selection available if that's your thing.  \n\nThe only food option available is the selection of housemade, artistinal jerky.  The jerky is also part of a pairing in which you pick a beer, shot and jerky.  It's a fun, cheap way to get some booze and a snack.  If you need more than a small bite, the fine folks here will let you order in pies from nearby Long Bridge Pizza.\n\nThe best part for is that I can walk there...and stumble back!  I'm a fan!", "author": "Bryce B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Tasty drinks and a great beer, shot, jerky combo. Cocktails may taste a little light depending on your tastes and a bit overpriced. Still a nice spot.", "author": "Abad M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-08", "description": "Dark, quiet and delicious - what more do you need from a neighborhood watering hole? Oh yeah, $10 cocktails. By far the most affordable (quality) drink you'll find in town. \n\nAnd I can walk there.\n\nSo many great businesses up and down 3rd Street in the Dogpatch: urban wineries, art galleries, coffee shops... and now Third Rail. Putting a mark on this otherwise unknown 'hood for sure. \n\nMy favorite is the signature cocktail made with lemon, boubon, Lillet and honey. Just the right amount of boozy and tartness. \n\nOr go for a shot and homemade beef jerky. Whatever floats your boat!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Sweet little neighborhood bar! Nice beers on tap, good selection of fine spirits, and cozy environment. No food options beyond spiced nuts and an impressive selection of jerkies, but they allow and encourage you to bring food from the yummy Mexican restaurant next door. I look forward to going there again!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-04", "description": "Skip it. We were out for a birthday party and saw that it was highly rated so we went. We were literally the only 12 people in the bar at 2pm on Saturday (which we actually thought was great). The bartender told us to make a reservation next time. When we asked for recommendations on the many kinds of jerky he said, \"they're all fine, just pick one.\" I wanted to like this place but will never be back", "author": "Tyler B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "I had a great Manhattan and some Mushroom Jerky - Yep, Mushroom!  It was awesome - seriously why can't I get this everywhere!", "author": "Jenn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "The first time I went here, I loved the aura of the place. Now it being my 3rd time, I noticed the menu changed! Not many bars change their drink specials, and that is one of the things I like about Third Rail!\nThere is always something new! \nThe bartenders are great!", "author": "Kim V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "Really really sweet spot that combines two of my favorite things: whiskey and jerky. Needless to say, I felt pretty manly ordering a couple fingers of whiskey neat and some dried up meat to munch on. Too bad I'm not much of a straight whiskey drinker, so ordering (choking it down) was mostly for show to impress my girlfriend. But really though, nobody in the commercials ever has it with rocks! Maybe not so manly after all...\n\nBesides their huge assortment of whiskeys, the rest of their cocktail selection is really good too. Of course, you have to try their namesake, The Third Rail. It's a very solid cocktail that I recommend everyone get their first go 'round. The Tally Ho is also a winner in my books. Definitely get those two. \n\nThey also have a great  seasonal cocktail selection, but I won't waste my time writing too much about it. When they seasonal, they mean seasonal. They're always keeping it fresh and updating the menu, so prepare yourself for disappointment if you come back half a year later and it's no longer there.\n\nTheir regular menu does a great job of sorting out their cocktails into different categories, so it's easier to figure out what you want to drink based on the kind of flavor/feel you want to have. While this may not seem like a big deal, but it's nice to have be able to be a little organized right before you get smashed (tastefully, might I add). \n\nThe drinks are all reasonably priced (~$10) and pretty strong, so that definitely earns a thumbs up. One tip I'll give you is to sit up at the bar for at least one round while the bartender is making your drink. The drinks take a little bit of time to come out, but that's cuz the bartenders are seriously working magic. I've never seen anybody put so much care into crafting a cocktail. Seriously cool stuff.\n\nDefinitely has a bit of a hipster vibe to it. It's a pretty small place and probably can't fit more than 35 people in it without posing a serious fire hazard, but I like it. Feels a little like Austin, TX, which I definitely dig. Makes it feel like home.", "author": "Zi-on C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Good to see that Dogpatch is starting to grow and places like Third Rail can pop up. Off the quiet segment of 20th, it's a small space but with lots of great spirits. Hit up the bar one late night and had a chat with the team. Amaro, Bourbon and Orange liquers make for a tasty libation. What's this meat and whiskey = delicious? I like that they have jerky pairings. Too bad I just ate. Next time it's a must do...", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Beer AND meat! Beef jerky to be exact. This bar is hidden in dog patch near dog patch boulders. \n\nThey do beer and jerky tastings. But best of all, they have a $10 deal for a shot, beer and jerky!\n\nTip: Try the candy jerky! Its deceivingly  spicy", "author": "Vicky H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "Very chill neighborhood bar serving stiff,tasty drinks. Pair your drink of choice with their delicious jerky and you are in major business. MUST TRY COCKTAIL: \n12 angry men", "author": "aj s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Nice place to have a strong drink.  The bartenders are knowledgable and not as snooty as the usual hipsters (mixologists).  They have yummy jerky that can accompany all their drinks.  This place isn't looking to pull in the average sunday funday goer.  Our group got some pretty annoyed looks, but we managed to stay for a good four hours.  This place is often dead until the night, so it's a nice place to go if you are looking for a seat, solace, and a stiff one.\n\nMy favorite thing: These bartenders do not cut people off, then continue you to pour drinks, but omit the alcohol.  I guess it is there way of sticking it to over the top drunks.  My friend had at least two $15 drinks he loudly raved about that were made up of flower essence and kiddy punch.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "I'm a fan of meat\nMeat is sweet and oh, so neat\nBooze and meat complete\n\nReminds me of that School House Rock song \"Beans n' Rice... is nice\". \n\nBooze somewhat fulfilled my friend, and the sweet meat candy made me giddy. \nHow cool is it, that this bar has a nice selection of jerky? And, they even have some vegetarian jerky for those heathens who waste perfectly good animal bits. \nI had some fancy-schmancy cola (I think it turned me into a hipster - so good), and about 5 of their meaty treats. I'm in love with the Spicy Beef Candy, Cowboy, and the Landjager. As much of a fan as I am of coffee, the Red Eye was probably my least favorite... I still ate most of it, though. I'm not a Heathen.", "author": "Kara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "Cute space, really nice folks behind the bar, and did I mention really tasty beef jerky and bourbon? BEEF JERKY and BOURBON - together at last!\n\nHappy hour is until 6pm and for $8, you get to select one each from the list of beers, shots, and beef jerky tastings (see my picture). Just lovely.\n\nI haven't tried any of the mixed cocktails yet, but will revise my review once I do!", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Quickly becoming my favorite cocktail bar in the city. Cozy atmosphere, trendy vibe, friendly staff. We've been here a few times and loved every drink. I prefer lighter tasting drinks (gin/vodka), so the Pin Up, Sloe Ride, Tally Ho, Harvest Moon, and Tiki Torch were perfect. My boyfriend likes whisky/bourbon based drinks, so he's had the American Gothic, Loch Ness, and Third Rail. We tried their jerky once and it was really tasty. What a great combination!", "author": "Alysha V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "Last month a gal pal suggested \"Let's try something new!\" so I turned to Yelp and decided we ought to head over to Dogpatch for drinks and dinner. When I hopped out on 20th and made my way into the Third Rail I was pleasantly surprised. First, there was a chair waiting for me. Second, the bartenders were kind. Finally, the other patrons were neighborly.\n\nAnd what's more, my cocktail - the fireside sour (mezcal, blood orange, lemon, agave, egg white, orange bitters) - was quite quaffable. We didn't sample anything from the jerky menu (and instead headed for dinner at nearby Serpentine) but I'm pretty curious about the skinny rizo and the cowboy jerky.\n\nThird Rail is the kind of bar at which I'd like to be a regular.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-20", "description": "This place is always bumpin'. Quirky cocktail menu that really packs a punch...definitely worth trying! Nice addition to the Dogpatch nightlife scene.\nSuper dark with a laid back ambiance -- go for the couch area in the front for some seclusion from the bar.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "I hear Third Rail is a newer establishment and I'm glad I was lucky enough to experience it before things get crazy - because I am sure people will discover it soon enough!\n\nI came here with a group for a birthday celebration, and the bar was fairly empty early in the evening. The Double Date was an incredibly pleasant drink to sip on, with a subtle sweetness from dates that balanced out the bitterness from the rye. It was so smooth I wanted a second date with it... :) At $10 per drink, I almost did.\n\nHope Third Rail keeps the incredible concoctions coming!", "author": "Clarice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "Came here tonight and couldn't wait to write my review!  A friend and I tried the following:\n\nDouble date: date infused rye, whiskey, sweet vermouth, amaro, cinnamon bitters.  My type of drink - stiff and served on a large rock.  The date flavor was noticeable and the cinnamon bitters came through in the finish.  It was actually very drinkable for being a stiff drink, which could potentially be dangerous ;)\n\nMt. Tam: My favorite drink of the evening!  Gin, sweet vermouth, Gran classico, kina l'avion, served up.  I learned that kina l'avion is an aperitif that tastes halfway between white wine and bitters.  The friendly bartender offered us a taste neat.  He described this drink as a play on a negroni... in my opinion it was a thousand times better than a negroni because Campari can be so overpowering.  The Mt. Tam was perfectly balanced, herbal, and hands down one of the best drinks I've had in the city.\n\nZapatista: tequila, sherry, benedictine, and chocolate bitters, served up.  I found this drink to be heavy on the sherry and therefore too sweet.  The flavor of cocoa was very subtle in the finish - I wouldn't have known it was there if I wasn't looking for it.  They did do a good job masking the flavor of tequila though, if you're into that due to a bad experience in college.\n\nHarvest Moon: tequila, pear, absinthe, lime, served on the rocks.  A \"yummy\" very drinkable cocktail, though you must like absinthe.  Too sweet and too absinthe-y for my taste, though my friend was quite pleased.\n\nRed eye jerky: coffee, chile, mustard, and cumin.  Had a nice kick to it and I loved the coffee - never had that flavor profile in jerky before!  Most of their jerky is $2.50/oz.  \n\nAll cocktails are $10, and all prices include tax which scores major points in my book - it makes the math so much easier at the end of the night!  Bottom line?  Damn good cocktails with good service, sophisticated but chill ambiance, and close to my place.  To the guys running the show: Please keep this up, because I want to bring a special out of town guest in January!!", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "You know, I used to dig Retox quite a bit, so I was a little apprehensive when I heard this space was getting renovated. Usually that means that it's going to get a lot more expensive and will look too modern/neo-loungy on the inside. I'm glad to say that this upgrade works, as it's not too cold and unfriendly, but is still quite stylish. That, and the cocktail menu is well chosen. I recommend the namesake Third Rail, it's pretty tasty. Speaking of tasty, the jerky menu is a nice touch, too. Always good to have a munchie option.\n\nOne thing I would like to see (for selfish reasons), is some happy hour specials or something, like a buck or two off for a beer and a piece of jerky together. That'd make me come back, for sure. UPDATE: looks like they do have jerky happy hour specials! I stand corrected.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "As good as it gets. Not pretentious, not trying too hard, not a dive bar, but a little bit of everything. Simple decor, yet it has it's own character. \n\nLove their variety of cocktails and the jerky was a nice touch to the menu. I was a fan of the Rail Shot special where you get to choose your beer, shot, and jerky. It's perfect for me who has a low tolerance. \n\nFor sure coming back when I'm in the neighborhood.", "author": "Meshell C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "This place is too awesome! It's a small dim bar with a speakeasy feel. I ordered the Rail Shot where you pick a beer, shot, and jerky for $10. I got the Scrimshaw, Mezcal, and Mighty Meat. Fantastic, and you can't beat that price! My favorite part of it all? Of course the jerky! I later ordered a mushroom jerky as well. It was interesting, but delicious. I was headed to a concert so I only wish I had more time here. I'll definitely try to come back next time I'm back in town.", "author": "Melissa U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "This is my new favorite local bar.  Very laid back, and nice atmosphere.  It's a great way to catch up with friends in the early evening before dinner or hitting the town.  I almost always go for the beer/shot/jerky combination.  My favorite combination is the Old Brick Bitter, Bourbon, Jerky Jerky.  One serving is enough to make my evening.\n\nKind concerned about this place getting too popular and losing its character.  But so far so good.", "author": "Jj S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "Amazing beers, well crafted mixed drinks and beef jerky that will blow your mind! The people who work here are super friendly and know their stuff. This is a bar that is really trying to make you happy.\n\nI'd recommend the rail shot: choose a beer, choose a shot and choose your jerky for $10 ($8 during happy hour). Can't go wrong.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Perhaps I'm a bit biased, having lived in semi-barren Dogpatch long enough now to feel the rare downside of not being able to stumble home after a few quality cocktails. So, color me excited when my buddy Jean Y told me about this new addition to the neighborhood!\n\nWe showed up a week ago, where I ordered one of their Ol' 55s, and an Envy. And, well, the bartenders know their stuff, as far as naming and suggestions go, at least. As the \"spiritous\" category would suggest, the Ol' 55 was indeed a much stronger cocktail, with some slight medicinal notes. When asking for something a little more refreshing for my second, my bartender's suggestion of the Envy was spot on.\n\nNow, while they're not quite at the level of favorites such as Martuni's, Rickhouse, or Zero Zero, I did like their cocktails more than say, Bar Agricole or Azucar. And at $10 a pop, and within walking distance of my home, you can be certain I'll be dropping by here more in the future, simply for the balance of quality, value, and convenience.\n\n***Accessibility Info***\n\nVenue - While the space isn't huge, they're new enough that there isn't such a crowd as to make the place feel cramped and hard to navigate through. In fact, the day we went, there were less than 10 other customers inside with us. The bar counter, however, is the usual bar counter height (a.k.a. too high for us in chairs). However, with the limited patrons, it wasn't hard at all getting the bartender's attention.\n\nBathroom - Didn't check it out.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "Lives up to its reputation in both cocktails and jerky. Went with a couple friends on a weeknight, and it was all-around great.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "An archetypal SF speakeasy. The bonus? Doesn't occupy more than a couple hundred square feet so crowding isn't an issue, at least it wasn't when we were there. Makes for easy sipping and relaxing. Oh yes, the $10 craft cocktails don't hurt either. \n\nAn interesting line-up of high and low balls, wine, and liquors. And...jerky. Yep! We didn't go for it, but our cocktails were delicious. They did take a while but upon first sip of my Orchid, I concluded the wait was well worth it. \n\nSo many great spots on 3rd street, but don't pass up Third Rail when in the area!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "$10 gets you an 8 oz beer, a shot, and some delicious jerky! All three are of your choosing from the 4 options listed for this wonderful combo. \n\nIf you don't want that, well... You crazy! .....JK (: Cocktails look good here and are about $12 each. There's some reasonably priced beer as well. \n\nGot the Evil Twin (and to avoid confusion, it's a citrus mezcal cocktail, NOT the beer. I thought it was a beer at first glance too) and it looks very pretty, but boy, it can totally sneak up on you. It tastes pleasant and ends with just a hint of mezcal. I can drink this all night and be a happy gal! \n\nChill space too. Will definitely come back whenever I'm in that neighborhood.", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "Nice update to the old, stinky Retox.  Yes, they have scrubbed that old space clean, put up a whole new interior, and it is very nice now.\n\nCocktails were inspired and tasty.  Homemade beef jerky is a nice treat to go with your cocktail.\n\nOn par with the new Dogpatch Saloon, but a bit more intimate and cozy.\n\nWelcome to the neighborhood.\n\nWith Magnolia opening Jan 15th, and rumors about the Goat being updated, the Dogpatch will become crowded with nice bars. But hopefully all will survive.", "author": "Troy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-11", "description": "Good cocktails, not awesome. Took points for a few of not so friendly bartenders (experience from several visits). With so many other watering holes nearby, I've been avoiding this snooty pretentious place.", "author": "Rina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Third rail is a wonderful bar. I dont know what to say cuz everything was just amazing, the people, drinks and atmosphere. Well, i'll be here any free time i have.", "author": "Mikki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "We had drinks here before our last dinner club at Long Bridge and loved the spot.  The decor is really cool and where else can you get some good drinks along with beef jerky?  Our bartender wasn't the friendliest but the drink she made was good.  I got the Third Rail (can't go wrong with a drink the bar is named after). Everyone else ordered different drinks and we enjoyed all of them.  I also got the Cowboy jerky and thought it was really good.\n\nGreat little hip spot in the Dogpatch.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "Their Whiskey + Beer + jerky combo is deadly.... in a good way! The combo is about $10-15 depending on what you choose, and gets you drunk fast! What I normally do is just keep drinking, while saving the jerky, and then eat all of it at once when I'm drunk. But! To each their own method. The jerky is actually surprisingly great! I expected to get the generic thin jerky you see at gas stations, but their jerky is thick cut and stored in these massive jars on the wall. The jerky is moist, and wont rip out your teeth when trying to eat it. \n\nThe place is a tad small, so get there early if you want to seat a large group. Small groups are definitely manageable at any time during the prime times.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "this is a good place for drinks & hanging out with a group of friends.  \nit was so many people, that we need speaks louder", "author": "Steven M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Brought a friend to try the jerky since we've done a few happy hours after work here. It was not as busy on Saturday night as it is on a weekday so I'm glad.. Was not in the mood for that anyway. We got the Robin Hood and the small jerky sampler which was adequate. We had a good time. Would like to come back to try some more of their drinks.", "author": "Louisa D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-17", "description": "Love that they have live music from talented folks with new endeavors, great beers, cash only.", "author": "Lisa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "This is slowly becoming my new favorite bar. If I'm feeling lazy on a Friday night and just want to go out for a drink or two, I usually make my way down to Third Rail. Parking is super easy. All their cocktails are $10. It's never crowded and I'm always able to find a seat. AND they have beef jerky.", "author": "Cindy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "LOVED This place-- drinks and beef jerkyy whats not to love. The doggy thats there is the cutest tooooo", "author": "Girl J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-19", "description": "Came here yesterday. Nice little small spot. Drinks were fine and so was service. Nothing spectacular. I appreciate how clean it was especially the bathrooms. All in all, good experience, but nothing that sets it apart from other normal bars in SOMA or dog patch area", "author": "Lucky N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Great place to get your bourbon and rye fix. The cocktail glassware may look dainty, but boy do they pack a punch.  In transportation parlance, the third rail is the electrified strip next to the tracks.  Beware when you tread around this place!", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "My new fav spot in SF! Yummy jerky and amazing cocktails. So many places try to be this kind of spot and fail. These guys have laser like focus and don't try to please everyone. That will make sense after you visit. I LOVE the Loch Ness cocktail! Our barman was busy but still friendly and all of our drinks were complex and balanced. Didn't think I was a jerky person until I had some at this place. Ill back very soon.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Love this place!!! The atmosphere is very laid back and the bartenders are really nice! I always get their rail shot and have never been disappointed! I'm not a huge jerky person, but I'd never say no to the jerky at third rail!!", "author": "Manogi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "This place is literally hidden from the outside. They have good cocktails, chill atmosphere. great service.", "author": "Pam Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Great drinks and the jerky is great. The bartenders know what there doing. Jeff is one to educate you on the menu if you need any help or he is willing to make a drink of any kind you would like", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "I consider myself a bit of a beverage snob.  Yes, I will throw down Jameson or Bourbon by the bottle full from time to time, but really when I go to a bar I want a high quality cocktail, with great ingredients that makes me savor every sip.  Most bars I love have anywhere from one to three A++ cocktails that meet this criteria.  Some friends and I had somewhere between 8-12 cocktails amongst us here, and every single one I tried, I would consider an A++ cocktail.\n\nAlso, the beef jerky was top notch.  One would not think that high end cocktails and beef jerky could be paired together, but that person would dead wrong.  If you're in SF and enjoy the art of making great drinks, come here with friends and explore their menu.  \n\nI asked for \"bespoke\" but the bartender stuck to the menu items--and we were not disappointed.", "author": "anthony b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "The best jerky and Chichurron. :) Came here for the BF's uncles' birthday and got to try all the jerky's through one of the specials. The mighty meat was my favorite. The price wasn't bad either. Will go back to try more of the jerky's.  Haha I know this is a bar but I don't know much about beer.. They all taste the same to me.  Maybe one days I'll try the different beer with the corresponding jerky.", "author": "Fanny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "I just love this cocktail bar.  It's got a beautiful design, feels like a good old Chicago or NYC speakeasy, and offers reasonably priced cocktails and a nice selection of delicious Beef Jerky made on premise including a vegetarian variety.  \n\nII prefer going off menu, but the hand picked cocktails by the owner, who also mixes on a regular basis, are quite nice.", "author": "Anand A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "If im in the dog patch, and looking for beers/drinks and possibly best part - jerky; this is the place.", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "One of the best Old Fashions in the city.  Combine that with some jerky and a nice dimly lit decor and it's a recipe that has me wanting to come back.  Tucked back  off of the main 3rd street in Dogpatch, this is a gem on this end of town!", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "Had my birthday party here. Place is small, but if you call ahead you can reserve an area. I was confused when they said I had to put down a credit card, but they don't actually charge anything to the card. They will only charge to the card if your group doesn't show up. Place is kind of in the middle of no where, but the drinks are good here. The jerky is interesting. All my friends seemed to enjoy the place. Good mix of cocktails and beers. Would come here again if I was in the area.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "$10 Dolla Holla.\n\nAwesome cocktails ($10) - really layered drinks and awesome price!\n\nI like the feel inside this place. It's dark, intimate but towards the front, there is a good area for standing room/mingling. \n\nThe place is clean and put together. I kind of like how this place is out by Dogpatch. It's not as hectic! But, at the same time it can get loud and busy in here. Really depends on the crowd :)\n\nBone Machine + Tally Ho + Casio Tone = all of these were awesome. \n\nBone Machine - a gentleman's fave ;)\n\nTally Ho - my fave as I love Gin!\n\nCasio Tone - very well balanced.\n\n** really love how the drink menu is sorted out. \n\nCan't wait to be back to try the seasonal drinks + jerky!! Really excited I discovered this spot :)", "author": "Selina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "The bartenders in this place make really tasty cocktails!  Interesting combos, fresh ingredients, good booze.  The service was fast too, even as it got later and they grew busier.  I love the vibe of this place, it's cool, and fun, but mellow.  Thanks to some early arriving friends we scored a little place at the front corner of the bar, so we had plenty of space to stand and spots to set drinks.  Score!\n\nThe only thing that knocks this place down to a four is the unfortunate interaction I had with one of the bartenders.  We asked for a round of waters (between our third and fourth round of cocktails) and the guy looked right at me, rolled his eyes and said something like \"wow, a bunch of party animals, huh?\"  He didn't say it in a joking manner and I really felt like it was unnecessarily rude.  I'll go again, but I'll definitely avoid that guy.", "author": "Renae H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "The bartenders are some of the best in the city!! If you want good strong drink made perfectly, come here.", "author": "Parker S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "Fantastic cocktails, really well crafted. Loved the mezcal/egg white cocktail, really lovely. The spicy tequila/habanero was delicious as well\n\nAnd the jerky. I mean, free star for having a jerky menu for starters. Their jerk jerky was classic, and spicy candy quite good (and goes well w spicy cocktail)\n\nGreat space as well. Wish it was a little closer to anything but worth the trek!", "author": "Aki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "They have simple and delicious cocktails with top shelf spirits at pedestrian prices.", "author": "Billy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "Whiskey and jerky pairings? Wow, who knew you needed them together, but excellent!  Manhattans were sublime.  Bartenders had zero personality but made some mean drinks.  No tvs, no art but great music selection. Sidled right up to the bar on a Saturday night around 8. Small and quiet. Great for conversation. Had some couches too.  Crowd was a mix of people in sweatshirts and jeans and those fresh from the shower with cologne ready to get their party on.  \nWarning on the Caribbean Jerk jerky.. holy hot tamales!!! The Sonoma was EXCELLENT.", "author": "Kat L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "Nice place to have a drink Staff is really nice and allowed us to bring in a full burrito bar from outside!", "author": "Rahul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "One of my favs. Excellent drinks. Easy parking.  Friendly bartendar and shes a kick ass motorcycle rider. Best mushroom jerky! !", "author": "Food L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-05", "description": "I mosey in on a weeknight and see a familiar face behind the bar. It's one of the bartenders from Serpentine (which previously was the only place for a good cocktail in the hood), so I have high hopes. And it didn't disappoint.\n\nIt was a 3 cocktail evening and all were good. \nCloven Hoof was great. Highly recommended for those wanting a serious cocktail.\nThe Third Rail was good\nThe Tally Ho was a-ok. Though would have been nice to know before ordering that it's almost snow cone in a glass. A bit simple. Just not my style.\n\nJerky wasn't bad either.  A very solid drinking establishment and a welcome edition to neighborhood. (You might just be able to get a sampler if you ask)\n\nMy only concern is that I sorta love the sleepiness of Dog Patch. It has a few great places that you can more or less just walk in to without reserving a spot 3 weeks in advance or waiting 30 minutes for a seat. But this place is pretty slick and I hope it doesn't get too much of a buzz to attract every Tom, Dick, and Harry. Yeah, I want to keep this place for myself (as I advertise it over the interwebs)", "author": "Zack S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Great spot in the dogpatch. Loved the fresh eggnog around the holidays. All the other cocktails looked delicious. Didn't get to try the jerky, but I plan on coming back soon to do just that!", "author": "Delos E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "I spent a few hours here catching up with friends on evening. It's a cool little spot that has some nice cocktails for everyone's taste. I would suggest arriving a little early if you have any interest in grabbing a seat, but the crowd was cool and I'd definitely return.", "author": "Candace R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "Good for you DogPatch!  You have a bar that you can be proud about.  I was a bartender for a long time and I can tell you that these drinks are all unique and great.  I forgot the name of our guy, but wow; he can make a cocktail!\n\nThey have some great jerky too... my fave is the Beef Candy... but do yourself a favor and grab a few to sample!", "author": "Brett B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "Wow, friday night in dog patch and three of us got seats and a table, outstanding! Had a sour citrus drink with mezcal, nice smoky flavor and foamed egg white atop. Delicious, expertly crafted. Friend enjoyed her third rail.\nLove the atmosphere, roomy inside despite being a shotgun space. Kudos for the built in banquette and small, beautiful wood tables. Nice alternative to sitting at the bar. Couches and chairs fill the window up front.\nIt seemed the customers all purchased the homemade jerkey. I would prefer another snack option.\nParking is easy and free, do not leave anything visible or i guarantee you will be sorry. Or take the t line, just steps outside the front door.\nGlad to see an upscale, less crowded alternative to the dog patch saloon.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "Really delicious and well priced cocktails. Got the Mt. Tam and the American Gothic for ten bucks a pop. The beef jerky was also highly delicious - my fave was the coffee one. Will be back for happy hour. \n\nOne downside: there isn't a ton to do in the area.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "YES! YES! & YES! This has become my favorite bar in SF. Now that's a huge compliment since I've been bartending over a decade and know how to make a damn good drink. The decor is pleasant, lovely Danish chairs. The liquor selection is above par and the cocktail menu is superb. Like beef jerky? Third Rail makes their own, and yes, it's Deliscious (sorry vegans). If you are a fan of Trick Dog, Contogna, TheEuropean, or any other amazing cocktail-laborious-mixology bars, this is your place. Located in the Dogpatch, up and coming location, right off the muni station at Third street there is no need to drive but ample parking just in case.", "author": "TVAT T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-30", "description": "I came here since 7x7 featured Third Rail's Mt. Tam. Personally, not for me though I enjoyed our little show from our Bartender. She slapped a bay leaf above the drink to bring out its juices or just for a cool effect and to wow us haha :).\n\nWhat I did like were the Tally Ho's and the rhubarb drink (tasted like rhubarb pie). Drinks are good and strong and reasonably priced ($10). Would definitely go back!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Put this place on your list. The atmosphere is old school San Francisco. It may be a bit hipster but the drinks are engaging and creative. \n\nThe bartenders are great!", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Third Rail is one of the better cocktail bars in the Dogpatch, there are others like it, but this one is mine. If you're in the mood for some post-work Jerky, or after-work cocktails; hit up the Third Rail! Order off the menu, it's worth it if you know what you want.\n\nIt gets a little hot and crowded, but luckily, they open the windows if you ask.", "author": "Trace D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "New favorite bar. As a beef jerky junkie, I'm sincerely upset I didn't come up with the idea for this place myself. \n\nAll cocktails cost $10. For the amount of alcohol in each drink, they are a steal. Our favorites were the '12 Angry Men' and the 'Bone Machine' (both whiskey-driven). The bartenders were all very friendly and can make you something off the menu if you ask.\n\nThey have several varieties of jerky available and my friends and I tried all of them, apart from the \"vegetable jerky\" (which is an affront to jerky in my carnivorous lifestyle, but maybe that's your bag). The clear favorite in our group was the \"spicy beef candy\" which was sweet, spicy, sticky, and delicious. We also really enjoyed the \"cowboy\" and \"red eye\" as well as all three jerky sticks which have interesting and varying flavors and textures. Jerky is ~$2.50/oz and I'd get at least 2oz per person to start.\n\nWe never intended for our dinner to be in jerky and liquid form that night, but after three rounds that's exactly what happened. I'll definitely be back, especially if it's too late in the day to hit up The Ramp.", "author": "Thomas U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "Cozy spot to meet friends for a drink in the 3rd St/Dogpatch area. Their cocktails are well-prepared and the jerky is made in the owner's restaurant. Definitely worth a return visit!", "author": "Sandy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-21", "description": "Been here a couple times now. I believe all the cocktails on the menu are $10, and all the ones I've tried so far have not disappointed. I think my favorites are the Tally Ho and Envy.\n\nService is good, but mainly because I haven't gone here when it has been too crazy crowded, and we have always gotten seats for our group. I'm enjoying the casual vibe and tasty cocktails while this place is still a bit low-key.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Mind blown by the bartenders in this intimate paradise. By far the best Old Fashioned in San Francisco. It seems that the secret has gotten out but it doesn't take much to fill this place so I like to get there early. One block away from my office and I cannot make it there often enough.", "author": "Valerie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Great addition to this neighborhood.  It is not a bar that you should travel across town for, but for its casual setting and above average cocktails.  This is the bar to be shall you find yourself in dog patch.  \n\nMost cocktail are bourbon based. The Third Rail and Double Date are my favorite. \n\nAs with all the new bars and restaurants in this town, the acoustic is terrible. If your group is larger than 3, prepare to lose your voice.\n\nThe beef jerky is a the only snack available and sold by the oz. Four kind made in house. Best one is Red Eye. Bought some to take home with me. A real treat.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "These bartenders are snobby. First they went out of their way to correct my friend when she said \"Jame-o,\" stating, \"that's so collegy,\" then they spilled drinks all over my friends and I, given it's an accident and they knocked our bill down to $11, they definitely gave us attitude when they rang us up. Rude and unprofessional.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Arrived a little after 5 on a Friday and the place was busy but not crazy. Bartenders were friendly, attentive, and mosti importantly skilled. \n\nCocktail menu is awesome because it's organized by type of drink you'd be in the mood for. Among the group, we had 6 different drinks and they were all fantastic - some dangerously so, others potently so. \n\nGreat use of fresh ingredients, good vibe (not douche-y). Would buy again.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "Great whiskey cocktails. The Third Rail cocktail was delicious. Clean and classy neighborhood bar! Jeff was so much fun!", "author": "Lily Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-19", "description": "Uhmmmmm Errrrrrr well Ok... \nI live a mere two blocks away....so Ive been waiting for evah to see how me old fave Retox has been upgraded to chic to meet our ever growing & demanding & desired & deserving Dogpatch destinations for a libation and hangout...\n\nThe unique fancy bourgeois Third Rail is an \"okay\" for now...\n\nIf you read my reviews you will see Im easy.....Im real easy after a libation if you really want to know... So they have some good cocktails...cool menu... Of course I dont know how much anything costs yet... And I did order a drink that requires Ginger Ale.... Ooooops. Go figure. They dont have it...oh and OH No.\n\nYou tell me...I do live steps away & perhaps being a local... Im happy to say there are other choices nearby...\n\nChoices where the Staff and Service and extraordinary... Now Im not knocking service here just yet.... But first thought and experience is I really should.  (Sigh) there is about 1 bartender for 3 customers... Maybe great attentive friendly Service is something you would automatically expect.... I will cross my fingers - perhaps next time... ( read between the lines ) this time Service was a disappointment. \n\nInteriors - Awesome\nMusic - Awesome\nJerky - Awesome\nAmbiance - Awesome\nCleanliness - Awesome\n\nService - Heavy Sigh \n\nPrices - Fair\n\nMaybe next time....we have some great places a couple blocks away - in one direction you get views of the city... in the other direction you can sit next to the water...", "author": "Bryan G. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Always a great drink and service, with a great atmosphere.  Try a rail shot, it's a beer, shot, and jerkey for only $10.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "Must return again for the following:\n\nMt. Tam\nTally-Ho \nDouble Date\nEnvy \n\n(Not necessarily in that order--and not all in one visit)", "author": "R H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Amazing cocktails, yummy jerky snacks, good background music. The cocktails take a while to be made - inherent in the recipes - which can be a bit of a drag.", "author": "Antonia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "Great \"hole in the wall\" bar in Dogpatch...a definite up and coming area for good food and libations.  Unlike the Mission, you can even find parking nearby.  Quiet (depending on crowd!) and divey kind of place that serves great artisan drinks, a plethora of whiskies and a fine selection of beers.  Appears they have an interesting selection of jerkins as well, but I didn't try them.  Perfect spot for a late afternoon quiet business discussion.  I can see it might be overwhelming if there is a large crowd.", "author": "Howard B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Attentive bartender. Good mix of drinks. Reasonably priced.  Cool concept with large square ice cubes.  Relaxed quiet lounge-y atmosphere - not a hopping loud trendy spot but not a dive bar.  Thumbs up :)", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "Love this spot. Jeff is a great bartender and makes an awesome old fashioned. Friendly people and not crowded.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "This is what a bar is supposed to be. Well poured, exceptional mixed drinks and who the hell ever knew beef / pork jerky could be this good? Not Me.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "Excellent bar! I've always had fantastic drinks and friendly service here. They really care about quality and having happy customers. Good, varied menu, and they're adept at creating anything else that your whimsical self may be in the mood for. Plus, I don't like my drinks with ice (it just gets in the way of the booze!), and they've always been gracious about adapting their drinks to suit my \"up\" requests.\n\nPlus, gotta love the jerky. But... consider whether you're with someone who you're happy gnawing along with. First date gnawfest? Your call.\n\nAlso, love the space -- very clean and comfortable with various seating options.", "author": "Nina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Visited Dog Patch for the first time for a birthday at Third Rail.  Drinks were great for only $10 a pop!!  PLUS you can pair with delicious in homemade beef jerky?  I must say, the Dog Patch area was sort of a wasteland of cold empty upscale condo's with not much else to offer in sight.  But I'm glad there are a few places like the Third Rail, that made my awkward walk all the way from the Embacadero worth it.", "author": "Devin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "Drinks were expensive....but, like anything handcrafted and made with love, it was worth it.  There are numerous drink choices to be crafted before you, but I went with whiskey-based drinks.  I don't remember the names of the beverages I ordered, but they were deliciously intoxicating.  I'd recommend this place to anyone that has an affinity for handcrafted cocktails.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "Phil and Justin made sure that my girlfriend's birthday went off without a hitch. The reservation process was simple, although I made it probably more complicated by asking a lot of questions (all of this was handled via e-mail and one call)...but simply put, all you have to do is drop a credit card to hold your place, give them a general head count a few days out, and they'll have some tables set up for you. The card isn't charged; you just have to give 48 hours advance notice if you cancel or you get some type of drink credit if you don't show up and/or less than 48 hours notice. But as long as you show up on your scheduled day/time...you're money. We had the tables near the back, so we had easy access to the bartenders the entire night. The place got pretty packed throughout the evening, so I was glad we set up some tables. Justin introduced himself to me when I arrived just to give me the general lay of the land and let me know how everything would work. The drinks were flowing (Third Rail was my favorite), the jerky was eaten, and all seemed to be happy. It gets kind of hot in here if there's a lot of people, since the only real ventilation is the front door, so make sure to keep yourself cool. Sweet cocktail place in the vast terrain known as the Dogpatch.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "This is my favorite cocktail bar in the city.  I've spent many, many hours at home trying to reverse-engineer their drinks (with some luck, actually!) and you have to appreciate the inventiveness and quality of all their combinations.  \n\nThe Third Rail (bourbon, honey, lillet blanc, and lemon) is practically universally popular, even for those who typically are scared off by whiskey; sightly more aggressive is the evil twin, with mezal, grapefruit, and chile bitters (smoky and spicy!); and on the complex and spirit-forward end of the spectrum, the 12 Angry Men has rye, charteuse and gran classico for a slightly bitter and full-bodied experience.\n\nIt's all of the nuance and deliciousness of a top-quality cocktail bar, but with hardly any of the pretension.  If I weren't such a fan, I wouldn't rate, if only to keep it a local secret.", "author": "Jesse O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Great cocktail menu.  Lots of people on a Friday night, but what isn't busy in San Francisco?  I had a drinked called the Bone Machine.  Really good.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Fantastic fresh food from the garden, great wine and great service. Definitely coming back!", "author": "Aditya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "Swanky in the right way.  Outstanding cocktails.  They really did a make-over of this place if you remember what it used to look like as Retox.  I'm hoping they figure out someway to get the basement area going again.  I had lots of fun times down there.", "author": "Jan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Excellent hipster cocktail bar. Best aviation I have ever had.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "New hot spot in Dogpatch!  They have an extensive list of specialty cocktails (15 if memory serves me correctly) and they serve an assortment of beef jerky (yes, beef jerky).  It's a compact spot with a modernist flare.  Love the signage -- quite beautiful and makes me wish more shops took signage seriously.  Service is friendly but you have to work your way up to the bar.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "Very cool bar - nice layout, great drinks, friendly service and sweet location. The drinks were well crafted, strong and tasted fresh. They have lots of jerky that was popular but I didn't try it. Really great spot!", "author": "Julia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "Best bar in SF I'm super picky and am never satisfied or happy with my drinks... I loved everything they served me. I will be back.", "author": "Melinda I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Super cute, low-key bar in Dogpatch. Nice place away from the bustle of SOMA. All the cocktails we had were delish, esp the Third Rail.", "author": "Laurie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "This place is smaller than most bars but so much better. Great seating and interesting drinks. Always go for their rail shot combo (beer, shot, and beef jerkey) for $10. Can't go wrong. It does get packed at night though so I'd get here earlier than the regular crowd.", "author": "Ana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "Sad my time there was short, but I thoroughly enjoyed my rail shot (beer, whiskey shot and jerky combo). Friendly bartenders and patrons. Good times. I'll be back.", "author": "Eli J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Best margarita I ever had at a bar. The bartenders are nice and actually talk to the customers. Great friendly place will definitely come here again.", "author": "mary d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Strong drinks, good music, not pretentious, good jerky, not bro-tastic, not douchey = AWESOME. Stop in & give them some traffic. Bartenders & owners are knowledgeable & fun to chat with.", "author": "Anne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "My partner and I went here because we wanted to try the jerky. Trust we were not disappointed! The jerky was great and the mixed drinks were nice and strong! The atmosphere has a great vibe and the bartender is really cool. I would recommend it if you wanted to come and have chill place to try some jerky and sip on your cocktail. We will be coming back and bringing our friends!", "author": "Scott T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "Great place to get jerky at night. That's right. Jerky. Try the candy jerky.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "L-E-G-I-T. This place is superstar concept amd awesome service woth higly skilled mixologists.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "Happy hour until 6.  The jerkey is out of control good.  We didn't have any cocktails to can't rate them, but ambiance is nice (limited seating) and the staff is very friendly.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Beef Jerky and Whisky pairings? I've never heard of a better idea! This place is amazing. Absolutely worth it.", "author": "Austin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "BEST new bar in the area and maybe the city!!!!  The craft cocktails are absolutely amazing and the bartenders are knowledgeable and friendly.  The atmosphere is modern/rustic and is a perfect spot to grab a drink with a friend or go on a date :)  They also have a \"jerky menu\" featuring all kinds of beef, pork, and veggie jerky to accompany your cocktail.  The veggie jerky they featured recently was mushroom and I could not get enough -- SO SO good!!!  Hidden gem but I'm certain that it won't be for long!", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "nice place, I know it from my friend, good service , nice food, will introduce it to my friend and come here again. Hope you can come here too.", "author": "Rocky J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "I almost hesitate to write a review as I fear it will become too popular/too crowded to get in. The atmosphere is great, relaxed and really comfortable. The bartenders make killer drinks and their bourbon menu is pretty extensive. Bourbon paired with their jerky tastings...I HIGHLY recommend.", "author": "Rob F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "Welcome to Dogpatch! Thank you for offering great cocktails in a fun vibe with friendly service.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "Great classic drinks! Huge liquor selection! Great Vibe! Try the Harvest Moon and any of Beef Jerkies! Will come back for sure.", "author": "BobDigi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-14", "description": "Was so excited to come here bc of all the good reviews. Well, don't believe them. The bartender is a total dick, so rude. With service like that, they should be put out of business so a place with nicer people can be there", "author": "Angela Z."}
