{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "When eating out of the ordinary my tummy enjoys Indian food. Not sure how many people like Indian food but my taste bud was calling for Indian food to recall great memories while traveling through Pakistan and India some sunsets ago! #india #hindu #food #enjoy #pakistan #enjoyinglife #turechai #chai #memories \n\nThis little Indian/Pakistani restauran has good food. They were very attentive and friendly. They created small plates for my small budget and everything was tasteful! Muy come to this place again!", "author": "Mari L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "A bare bones restaurant that serves delicious  Indian food next to UCSF. You don't go here for the ambience, you go here for the food and friendly faces.\n\nI have eaten there several times and can attest for the naan, veg tikka masala and chicken tikka kebab. Looks like it is family run and they seem to know a lot of their customers.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Freshest meat and ingredients, perfect balance of spices, and most authentic flavor in town. \n\nMy fav go-to is Lamb Saag and whole wheat Tandoori RoTi. \n\nAlso, one of the cleanest kitchens and restrooms of all the Indian/Pakistani restaurants in the area.", "author": "Rawi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-26", "description": "It's always closed when I want food.  I don't eat my first food (coffee doesn't count) until around 4pm and that's when I'm hungry but this place is closed.  I'm not about to go back out in an hour just to pick up food after I get home, I'd rather not eat at all if I can't pick up food on my way home.  You know, not everyone eats at the prescribed hours, some of us still possess independent thoughts and actions.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "Thanks for:  \n\n1) The dozen bone fragments in my chicken vindaloo. I'm sure my dentist is quite happy about the future work I will have. \n\n2) The absurdly diluted mango lassi. How much water do you guys use to cut your yogurt drinks? This has to be at least a 1:2 dilution. \n\n3) Your dry and boring roti with an essence of basil and garlic. You'll be hearing from La Croix shortly. \n\n\n\nThank you! Come again!", "author": "Aren A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Total paid was $20.08\n\nI walked in to see a white mom and her two kids sitting right by the door. A couple were on a tired date at the table closest to the kitchen and had bountiful feast laying before them. An elder gentleman greeted me and helped me maneuver through the menu to an order of Chicken Tikka Masala, Garlic Sesame Naan, Mango Lassi, and Milk Tea.\n\nOverall rating 9/10:\nAtmosphere (lighting, scents): 10/10 Quite on Mon-Thu evenings. No scents. Faint ethnic music\nTransparency: 10/10 Kitchen was in full view of patrons (Image 01).\nAttitude: 10/10\nCrowd: Medical professionals from UC system through lunch hour on weekdays.\nParking: Go-'round-the-block. (I found a spot immediately across the street on a Monday evening).\n\nFood:\nChicken Tikka Masala $9.50 (Main Dish):\nFaithfulness to stereotype: 9/10\nCleanliness (Furniture, Silverware): 9/10\nRight Temperature: 9/10\nTaste (Texture & Consistency factored in): 9/10\nTimeliness: 10/10\n\n\nGarlic Balsamic Sesame Naan ($2.50 without Sesame. $3:49 with) \nTraditional South Asian Bread Variety. Other variety available as Rooti):\nFaithfulness to stereotype: 9/10\nCleanliness: 9/10\nRight Temperature: 9/10\nTaste: 9/10\nTimeliness: 10/10\n\nMargo Lassi $3 (Yogurt based mango-pulps beaten to a shake)\nFaithfulness to stereotype: 8/10 (Lassi was warmly recommended at this place by others. So it's possible my experience is just an odd one)\nCleanliness: 9/10\nRight Temperature: 9/10\nTaste: 9/10 (not too sweet and with adequate thiccness)\nTimeliness: 10/10\n\nMilk Tea (free!)\nFaithfulness to stereotype: 9/10\nCleanliness: 9/10\nRight Temperature: 9/10\nTaste: 9/10 (Creamy and light. White sugar only)\nTimeliness: NA (self-help)\n\nInterruptions or complaints?\nNone\n\nVisit & review took place on:\n8:00pm, Feb 19 2018.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "Amazing flavors. Have to go. Lamb biriyani with the chutney sauce to die for. Alo ghobi  is tasty and chutney sauce!!", "author": "June P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "Reliable food, it's a solid 3.5/4 Stars.  It's quick, no frills, consistent and the price is right.  The chicken Tikka Masala and okra are great!", "author": "VM B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-21", "description": "Rude!!! Avoid! Order a garlic naan, potato naan and chicken tandoori Togo. They provided me just one chutney and one plum sauce. I asked for another green sauce and the old man said \"No. only 2\". I said there's only 1 green sauce. The man continued to say \"No only 2\". The younger man came and starting saying only one each. Why would a restaurant make a big fuss about a teaspoon of sauce?! \n\nAside from the service, the naans were bad. Hardly tasted any garlic and the potato at all. On the other hand, that tiny chicken tandoori was decent but tasted like Lt was reheated.", "author": "K C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "I love this place so much! This food is authentic and delicious. I eat here all the time and I have very discerning tastes and they never disappoint.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "Located close to the UCSF Medical Center campus, Tikka Masala provides a wide selection of Indian and Pakistani dishes.  It's a moderately sized restaurant, but when my friend and I went for a lunchtime meal, we were able to find an open table easily.  The service was friendly but somewhat impersonal; it also took a few reminders to get my friend's beverage request.\n\nIn terms of the food, I thought our entrees were average.  We tried the chicken korma and the saag paneer, and I found both to be lacking in flavor.  Granted, there were not the spiciest dishes on the menu, but both items were more on the bland side.  I did enjoy the sesame naan, which was warm and nicely fluffy.  Tikka Masala would not be on my list of favorite Indian/Pakistani restaurants in San Francisco, but I would consider going back if I was nearby.", "author": "Keith H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "This is one of the only mom n pop restaurants left in San Francisco.  The food is great!  Order at the register, and you will be served.  The tandoori is especially good, as are the tikka masala dishes, and the spinach is freshly made with no added cream.  I love all the daal and chickpea dishes too.  Free chai is available at all times and comes from the pot unsweetened so you can have it without sugar or just add the amount you want.  They are nice people.  Highly recommended!", "author": "Devon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "I went here for a quick dinner, and their service was quick. I ordered a chicken tikka masala with naan and it was good. Standard portion for Indian food with self-served milk tea. \n\nI wish the chicken tikka masala was spicier, because it seemed a little plain compared to the other ones I have tried. Naan is good, not too thick (texture), but on the small side. I believed it was a combination of me being hungry and the dishes on the smaller side that I was able to finish everything very quickly. \n\nClean, quiet and efficient, not a bad place to grab a quick lunch or dinner if you are in the area!", "author": "Karen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "I don't normally come here for lunch, but today, I had no choice since most of the restaurants nearby are closed for the 4th of July. \nI ordered vegetable biryani and believe me I tried biryani so many time at different restaurants. This biryani I got today was not that good -- sorry, but just being honest. I love Indian food but if you really want a good one, try elsewhere. Come here ONLY when you're in the area and you don't have any other options. Otherwise, go somewhere else. \nToo bad, I would have come again if the food is good since it's only a couple blocks from my office. But, unfortunately, this is not the case.", "author": "Jasmijn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Good food, typical Indo-Pakistani, a little it on the spicy side so I saw to make my order mild.  Always clean facilities and friendly service.", "author": "Kon N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Best food best service n reasonable price. Any time go there always welcome by the staff all smiling faces I wish they can open more hours n Sunday morning", "author": "Arshad M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "I walk into the joint, am acknowledged & then ignored as the staff proceeds to wait on others who came in after me. WTF !!! Needless to say I got up and walked out the door. AVOID.", "author": "Henry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "Great place for chicken tikka masala, good naan and good rice.  The owner is super friendly and awesome guy.\n\nIf you love Tikka Masala and you're around the Golden Gate Park area, this is a great place for lunch.", "author": "Ahmad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This place is above average. If you want flavor go with the vindaloo or korma dishes. The daal is the real deal.  The Judah and 6th location is the best the neighorhood has to offer. It kicks Naan-n-Curry's butt. Ditto for Tasty Curry, which was back in the day. I implore Yelpers to find a better Pakistani and Indian spot in the neighborhood.", "author": "John G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "I order Indian food a lot-- it's my favorite and I've tried many different places in the city. Ordered this for delivery through Grubhub because I wanted to try a new Indian spot. Oh my goodness, do I regret it. This was the worst Indian food I've ever had. I ordered chicken tikka masala and I don't even know of what I got would be considered Tikka masala... it was so bad. The sauce was yellowish and thick and not good. It's supposed to be red/orange. The rice was like regular white rice with no flavor and no spices. This is not real Indian food... and not even fake Indian. It's something else, but not Indian food. Do not try this place.", "author": "Jessie A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-13", "description": "Came here for dinner when desperately craving Indian food, and I thought anything would've done. And yet, despite the voracious appetite, the food was just alright to me. Chicken tikka masala honestly tasted like it had a splash of Campbell's Soup or too much artificial tomato puree in it -- harsh, but it's how I perceived it. Samosa was good. Garlic naan tasted like regular naan. I will likely be trying a different Indian place in the hood next time.", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "This place is a little gem!  Although I am guilty of always ordering the same thing, I really enjoy their chicken tikka masala!  The place is a little on the cozy side, but it is always clean, and the staff are friendly whenever I come in.  Definitely worth checking out when you get tired of the same old thing for lunch!", "author": "Marisa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "I come here all the time.  Excellent prices, friendly service, and my food is always ready when they say it will be.  I usually order the chicken Tikka Masala and its better here than other places in the neighborhood and much more affordable.  What's not to like?", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "Great little blue-collar Indian food restaurant. The chicken tikka-masala was simple and tasty. The rice included spices and some color, and had great flavor and texture. The naan was light and fluffy.  Water and chai were self-serve and free. Service was prompt and friendly, if not warm.   Good food, quaint charm, under $20! I'm glad I dropped in for lunch!", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "Nothing special. Food is OK but on the bland side and too heavy. I ordered the tikka masala and specifically requested it \"medium spicy\" which may have been partially to blame for the lack of flavor. We didn't order the menus items we were suggested, I think we should have done that to get better dishes. I might come back for that if the Indian craving comes over me.\n\nThe service is friendly and attentive, but no ambiance to speak of. So I'd give it a \"meh\" which Yelp thinks is two stars, but I think 3 is appropriate... for now.", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-16", "description": "I love chicken Tiki Masla. I had an opportunity to spend my lunch here and ordered it. I politely asked if you can add extra chicken and he \"the waiter\" said ok. Waited for my food to come out to find there's hardly any chicken that I ask for. I call him out and ask and his answer was yes, it was included. I asked him, how much do you guys put in? And he replies \"I don't know\" causing a huge scene.\n\nThey got amongst themselves and started talking, I'd bet money they were talking hella sh!t behind my back. I don't ever plan to come here again. I don't mind paying the extra surcharge for meat, but needless to say I expect what I pay for! \n\n1. They were rude as hell\n2. They offer bad customer service\n3. If you are looking to fufil your na'an and curry desires, I suggest you look somewhere else.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "Friends, there is a reason why I oftentimes preplan the meals during our foodie adventures. Yes, I can be very \"particular,\" and yes, I used a euphemism.\n\nSee, tonight, my friend and I had a really difficult time choosing among their meat curry dishes. And that uncomfortable feeling of ambiguity and uncertainty is something I never want to impart on my dining companions.\n\nFriends, my \"particularity\" is just a way of showing how much I care about you.\n\nAnyhoo, onto the review. We took Mark Y.'s recommendation to get the $6.99 LAMB WRAP, which is a flour tortilla surrounding pulled lamb, lettuce, tomatoes, and cucumber, accompanied by mint&jalapeño chutney and sweet tamarind sauces (http://www.yelp.com/biz_photos/tikka-masala-san-francisco-2?select=-I1hCo5xaZDdhcIzvHCxRA#8luLLKW3VNGEeo8WklNYog). The wrap wasn't overflowing with ingredients but was still filling. The tortilla was toasted for a nice crunchiness, and the lamb was juicy and surprisingly subtle, in a good way. The sauces definitely added an appreciated dimension of flavor, which could explain the toned-down flavor of the lamb meat.\n\nAs for the conundrum of our second dish, we took a page out of another reviewer's book and ordered according to the restaurant name: CHICKEN TIKKA MASALA, $8.49 (http://www.yelp.com/biz_photos/tikka-masala-san-francisco-2?select=-I1hCo5xaZDdhcIzvHCxRA#6ZPatkIRY-ALrGLzE9tCwQ). To hear the restaurant describe it, the dish had \"tender morsels of boneless chicken breast marinated in a blend of freshly ground herbs, baked over charcoal, then cooked in the chef's special masala sauce.\" A classic dish that didn't stand out above other chicken tikka masalas I've had at other Indian places. The chicken was neither moist nor strongly seasoned, but the chunks were large, and the sauce was comforting and not too acidic. The $1 NAAN, which is made with wheat, was a tad bit crispier than other places I've been to, but it was doughy enough for adequate sauce-mopping.\n\nAlso, it should be noted that for dine-in, you place your order at the cash register, and they bring you the check at the end of your meal. And, while you're up there, turn to your right and grab a cup of free chai tea.\n\nIt's not fine dining, but the dining is fine nonetheless. Especially with me ;)\n\nHAHAHA.", "author": "Adele F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Food was OK.  The price is quite reasonable.  But other than that I would say this is a good place to have a quick late night after having a couple too many beers... We ordered several dishes but unfortunately everything sort of started to taste the same.  Portions are small but there is a lot of sauce...  Though as I said, prices are reasonable...  \nAnd no, we weren't making a post bar stop, I had granny and the kids with me.  Definitely better than the place on Irving between 7 and 8...  \nI would give three stars but the people working were quite nice, so four.", "author": "Keeping It Real K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "We ordered delivery for 20 people last weekend and had a top notch experience with this neighborhood restaurant. The food was great (our guests devoured every morsel), Faisal was amazing (helped us select the menu, helped us set up, and made everything easy, and the price was reasonable. Highly recommended.", "author": "Molly G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-13", "description": "I'd recommend to avoid this place, In fact I would not recommend this restaurant to anyone. I experienced waves of racist etiquette from the cashier coupled with remedial service. Modern social standards should be a part of the current restaurants experience but this place lacks almost everything and makes you feel dirty.", "author": "Denise T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Great food. One of the things we ordered was the chicken tikka masala and buttermilk chicken and it was delicious. But there was a lot of sauce and not to much chicken. Overall I rate it 4/5", "author": "Angela F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "I went in asking for a side of rice to go (the grocery store was out, and I was heading home to make lunch and that was the only item I needed). The employee at the register asked if I had cash and I said yes. Then another employee came up and said \"no rice only, this is not a cafeteria\". I'm not sure if they understand that today's \"rice only\" customer (a very simple request, and is an item on their menu with no disclaimer saying it must be purchased with anything else) becomes tomorrow's lunch or dinner customer, but because of the horribly rude service I received I will never return.", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "The service was amazing. Delivery came really quick! If you want a quick delivery and great Indian food, Tikka Masala is hands down the best in the Sunset.\n\nThe other ratings are so wrong. Go once and you'll see why.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "The food is good but it's lacking flavor.. it could be better with small adjustments. I liked the complimentary milk tea though", "author": "Khaled A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "I went to this place three weeks ago and had chicken briyani and tandoori. All recipes were half cooked and chicken briyani smelt like raw chicken in it. Chicken and potato pieces were too big, looked like the cook did not have time to cut them. I could not eat briyani so I called the waiter and told him about it. He took the briyani back and cut the pieces to small and brought it back. I told chicken is half cooked and smells bad. He did not listen to me and told harshly \"Everything is cooked properly eat it\" :(. He was standing near the billing counter, next to my table, as you know this place is too small and started to stare at me as if I am trying to create trouble. I left the briyani as it was on the table, paid for it and left. The waiter, I think the owner, was happy as he got his money. I would never go back to this place.", "author": "Devan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "I've been wanting to go to this place for a while. It's a little off the beaten path so I figured this had to be a diamond in the rough. It sits near the UCSF Hospital so I'm assuming it must get pretty busy during the week around lunch time so that might not be the best time to come here because the place isn't large. It has a nice small cafe feel to to. There's roughly 6-8 tables closely arranged. The menus are easy to read and the aroma inside is mouth watering. When we stepped in we couldn't wait to get our food. \n\nWe orders one order of samosas, lamb, chicken tikka masala, two orders of garlic nann, two orders of rice. I have to say, everything was to my standard. I wish it was a bit more spicy that's all. the sauce on the tikka masala was just delicious. The lamb was nicely done and tasted wonderful. The garlic nann was amazing. This place is highly recommended. $35+tip for two people wasn't a bad deal. I'll definitely make another stop in again sometime soon.", "author": "Krishna V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-21", "description": "I wish I could say I was writing a review on the food, but I never got the chance.\n\nI planned to meet a friend for lunch here. Arriving early, I stepped into the bathroom. When I emerged, I found a text on my phone from my friend confirming that we'd be meeting here. I looked up and saw him standing outside the restaurant, so I went to beckon him inside. The waiter saw this and was convinced, apparently, that I'd just come in to use the bathroom and leave...so started yelling at me to just get out. I tried to explain, but to no avail. He just became more insistent and more rude.\n\nNeedless to say, we chose to eat our lunch elsewhere...and I can't see coming back here to try again. There are too many options to put up with rude service.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-05", "description": "I came at 9:30, pulled the door to walk in... It was locked. One of the people behind the register looked at me through the glass, then said something to his peer who gave no indication of having seen me...and they carried on with their business. I knocked on the glass, no response. There was a couple eating inside. I checked the posted business hours... Close at 10pm. Checked Google maps, 10pm. Yelp 10pm. \n\nI'm sure they had a good reason for closing early, (Super bowl weekend), but they could've at least waved me on or come out to say they were closed rather than ignore me after making eye contact, as of I would simply disappear into thin air.\n\nThe previous times I was here the food was decent, if not a bit overpriced for the amount of meat. However after this, I won't be returning.", "author": "L E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "I went here because the sandwich place down the street didn't have a restroom to wash my kids hands. When we went in the restroom was for customers only so that is way I bought something. It was clean but small and good but pricey", "author": "Princess V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "I've been here a couple of times and the food is pretty good. 3.5 stars for this smallish casual Indian restaurant. My go tos are the: chicken tikka masala (curry chicken), this could use a little more sweetness. chicken boti (tandoori chicken chunks) could use a little more salt, but is otherwise quite nice and tender. mixed vegetables, good flavor. The regular naan and garlic basil naan is perfect, and just the right amount of fluffiness and not burnt like some other places. Their rice is nice and fluffy. Chai is free like most casual Indian joints and is good. All in all, I'll be back for more...", "author": "Ali F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "Tasty naan, underwhelming rice, been coming here for ages, blah blah blah.\n\nBUT OI - if you think I haven't noticed that you've decreased meat & paneer portions in curries to a laughable 2-3 quarter-sized pieces, you're wrong. I noticed. I'm watching you. You get one more chance, and then I'm out.", "author": "Nika M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-27", "description": "Bad experience!\nWhat is it with Indian restaurants forgetting to deliver the beverage???\nSo, besides that, the food was not good! i threw out half my food! what i did eat were the rice and naan. both main dishes - chicken vindaloo and chicken tandoori were just really bad!\nthe vindaloo was sour like if i was eating yogurt combined with vinegar! Not balanced!\nThe chicken leg tandoori was so awful i actually spit out the first bite. How bad of a cook to you need to be to mess up a grilled chicken leg?! It wasn't enough time in my mouth to actually know what's wrong with it. \nI am a chef, and maybe i have higher expectations but this was just pure bad food. my dish washer can cook better than that.\nA waste of a good $25.", "author": "Eli E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Ok maybe hygiene is awful but it's the only Indian/Pakistani place open until 2 am. So Late night diners can't be choosers.\nThe place is in the part of the TL  neighborhood where, if late enough, you have to walk over drunk and crazy people. (Sorry, not PC.) but we were desperate for this cuisine.\nSo we were surprised by the ambience: cleaner appearing than Shalimar. Fresh paint, newer tables and chairs, spacious. And what's playing on the large screen TV? Not Bollywood. It was \"Oklahoma\" courtesy of PBS. \nWe ordered the tikka masala with cheese and the fish masala, garlic basil naan, rice, mango lassi. Fish was prepared just right and cheese had nice texture. The Naan needed more garlic.\nYou have to set your own table and fetch your own water. Chai is complimentary.\nPrices are very reasonable and they accept credit cards.\nIf you're looking for late night South Asian, try this place. You might get Sound of Music while enjoying masala.", "author": "Liana T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "Two stars seems too low, but the food here was only OK -- I wouldn't recommend.\n\nI ordered the chana masala (spicy), vegetable biryani (medium), samosa, and the garlic/basil naan. The masala was medium spicy at best, so if you eat here order a level spicier than you normally would. The chickpeas were also undercooked, and the sauce was bland. The dish lacked that slow-cooked depth of flavor that most people are looking for in good Indian food. The biryani was really heavy on carrots, which are not a personal favorite. Also very mild and pretty bland, I was not generally enthused about the quality of the dish. Of everything I tried, the samosa was the most balanced flavor and the best-cooked. The outside was golden and crisp, the inside was soft and well seasoned. The mint chutney that came with it was delicious, and oddly one of the spicier things on my plate. The naan here is also quite good, but I found it odd that for a takeout order they didn't even wrap it in foil - it's just dumped into a paper bag.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Best service I ever experienced at a non-fancy Indian restaurant.  Extremely courteous staff, eager to make sure every dish was to our liking.  The place itself is small but great for couples.\n\nThe garlic naan was so-so but appropriately priced, so no complaints here.  Besides, the primary reason why you'll want to come here is for the curry.  Beware, they don't compromise on the spice unless you explicitly ask for them to do so.  If you're anything like me, it might be a good idea to order a mango lassi or something with yogurt.  I got the lamb vindaloo and it was so delicious that I couldn't stop eating it, but I was already in tears by the third bite.  What can I say, the pain was worth it!\n\nWhile I'm not sure I'd go out of my way (i.e., drive more than 30 minutes) to come here since SF is not utterly lacking in good Indian food, but it's a fantastic choice if you're nearby and/or want to order take-out.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "We had some standards: chicken tikka masala, saag paneer, rice, and naan. All were exactly as you would expect:  tasty, nothing amazing, but nothing objectionable, either, exactly what you might want after a long work day. The naan tasted particularly fresh. The staff are friendly, the place was clean, and the prices are reasonable by SF standards. I will go back. If you're looking for a simple, tasty, comfortable meal, consider Tikka Masala.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "Seriously delicious food - FAST. The gentleman at the register gave me advice and recommendations and was so helpful. I'm now in a happy food coma thanks to this wonderful place!\n\nI ordered the chicken tikka masala, onion naan and a side of rice. It took about 10 minutes if not even less, and I just had an incredibly fresh and delicious dinner.\n\nI will definitely be back!!!", "author": "Lorri R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Stopped in here to introduce my brother to this delicious cuisine.  It did not disappoint!  We had lamb tikka masala, saag gosht, rice, and naan.  It was all scrumptious!  Now he's hooked.  The free chai wasn't the best I've ever had (thanks to a co-worker who brings it in from home), but it's FREE.  How cool is that?\nThe staff was super nice, and stopped by the table to check on us and chat.\nThis is a counter service place, and not fancy at all. Hopefully I'm never back at UCSF for broken family members again, but if I ever find myself in the area again, I'll be sure to stop in.", "author": "Daphne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "We are boring and order the same thing a couple times a month: Chicken Tikka Masala, Aloo Gobi, Rice, and Garlic Basil Naan.  Everything else I've had has been really good here too, but the regulars are SOOOO good that I'm sad when I don't eat them.", "author": "Marci D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-25", "description": "I came here with my girlfriend for dinner on a Friday evening with fairly high hopes, as the restaurant is in a good setting and has a cozy atmosphere inside. What is more is that it hasn't been shut down by the health inspector, which is pretty good for this area. Unfortunately the service and the food were disappointing.\n\nThe employees weren't actually rude or unpleasant, but they weren't exactly paying much attention. We both decided to order the restaurant's signature Tikka Masala. When it arrived it was lukewarm, and there were just five tiny pieces of chicken in each portion! The sauce was acceptable, but neither of us left there feeling satisfied. We were much more satisfied with the bag of kettle chips that we bought afterwards to fill our still empty stomachs.\n\nConsidering that I paid over $23 (with rice charged separately), I'd expect a lot more in terms of quality and quantity. I wouldn't come back.", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "We have been going to this restaurant for many years, always great service, the tandoori chicken and nan bread are to die for.\nHighly recommended .", "author": "Martin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Best Indian food by taste and price in the area and great service. The ambiance isn't  much but it's cozy on a cold SF night :)", "author": "Lindsay Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "My biggest annoyance is their hours. They need to open at 430 not 5. Why? Most people who they serve UCSF get off at 5. I can't tell you how many times I call at 5 and I get told 25 minutes for my food. That means I have to wait until 530 to get my food. \n\nIf they opened at 430, took orders then SO much more business for them. \n\nThe food is good, often you get decent amount of chicken, in a tikka masal for instance. SOme times you get 4 BIG pieces and I just break it up, other times its more even and more plentiful. The amount of meat you get varies. \n\nThe Nan can be very hard at times. Often in the middle burnt and rock solid pieces are there. Inconsistant. \n\nOver all when you get a good soft nan, not over cooked rice and the right portion of chicken its all good and some one the best quality:cost ratio in the IS. \n\nBut more than often you get 1 bad element to the dish and the hours starting at 5 for dinner is a mistake imo. They are open later than normal so that is a nice perk.", "author": "Benjamin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "My girlfriend and I come here a lot now...  It's a good deal and is pretty decent.\n\nReading some reviews made me realize that they don't really understand the place.  It is a order up at the front kind of joint but I think they should be a little more accomodating to people who think it is a normal restaurant.\n\nFish biryani is really tasty and a good deal.\n\nSometimes the food is better than others which either makes me want to give 3 or 4 stars but the staff has always been really nice to us so I just went with 4 because of that.\n\nIt is definitely not as bad as the other Indian spots in the area...  which can be a total nightmare.", "author": "William G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "The place and first doesn't lokk so good. But I was surprised how good is the food. I orderdeprwns with coconut sauce, and was delicious!", "author": "Flávia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "When they say spices in there dishes, man, is it spicy! But I loved it! The vegetarian dishes are fresh and cooked to perfection. The meat curries, from tandoori to saag, are well balanced with spices and vegetables and the naan bread is soft and fresh. I have been here a couple times with my friends and it never disappoints. The curry sauces are sooooo rich and delicious and the meat and vegetables are cooked with flavor!!! The place is pretty small, but that doesn't stop us from going inside and consuming all the food we order!!! \n\nI need to come back and try the lamb and goat dishes. It's a great place to take that special lady friend to try new food and have a great time with friends. Not a great place to take 20 people, but, you get my picture.\n\nOverall: Food was delicious and fantastic, price was right, and service was great.", "author": "Nestor G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "I've been ordering delivery from this restaurant for more than 10 years! I live up the street, but tonight they refused to deliver to me and were very rude. They claimed they cannot park easily which is not true as we have parking under the building. I even told him and he refused. The last few times the owner was more abrasive than normal but this time he went over the line. You have great food but I'm shocked at your terrible customer service especially for a long time customer who refers people to you often. Not anymore.", "author": "Crystal H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-08", "description": "I'm not what you would call a Pakistani nationalist. I'm not ignorant of my region's history and culture - I'm just not that crazy about it. \n\nHowever, I am, and have always been, a culinary jingoist. If you mess around with the food of my people I WILL END YOU. \n\nThere are tons of Pakistani/Indian restaurants that are MEH. Truly, honestly enhhhh. There's probably a hundred between Berkeley and San Francisco alone. I feel nothing towards these places, and eating there is a function of staying alive rather than enjoying my meal. And that's totally fine. \n\nBut Tikka Masala goes full retard in several ways that irritate me and shift it to being actively bad rather than neutrally nothing. \n\n1) The Food\nThe most obvious point I have to make is this: the food is BLERGH. It's not meh, it's not maybe ok, it's not misunderstood - it's mediocre. I ordered a naan, saag paneer, and  korma and I ended up being able to eat absolutely none of it. I have eaten at a lot of sub-par Desi restaurants, but Tikka Masala set an impressive new low. You know how delightfully racist TV shows and movies depict our food as gurgling, greasy, graying primordial ooze that will tear yo ass up? That's the shit right here. I understand that kids are starving in Africa so I try not to be an entitled prick who wastes food, but when I can't tell if the meat in my dish is lamb or reconstituted jelly meat substitute then i will toss that shit out, burn it with blue flame, and sprinkle holy water over the ashes as I sweep it into the toxic medical waste bin. \n\n2) Location, Location, LOCATION\nTikka Masala is located just a few minutes walk from the main campus and hospital of the University of California, San Francisco. If you know anything about medical schools/hospitals, ESPECIALLY in the Bay Area, you know that there are A LOT of hungry, hardworking Indian/Pakistani densely packed into that location. There was an opportunity here to do something great and they choked like the fat boy who would play far outfield in kickball and trip over his own feet trying to catch the ONE ball that would come his way (... some wounds never heal). \n\n3) Service\nI'll be real and fair here, my anger at this place is weirdly intimate and personal. I think it all started with this point - I waited 40 minutes to pick up food that I was told would be ready in 10 minutes. I know that Pakistanis/Indians are all about that IST (Indian Standard Time) but that shit does not apply in the food service industry! \n\nBut then again, maybe I shouldn't complain about that last point. Because every minute they made me wait was another minute I WASN'T eating their food. What a glorious 40 minutes that was....", "author": "Salman Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "(See pics)\n\nReview #1023.\n\nSunny corner for a bright lunch. Fairly flavorful chicken and paneer dishes. Biryani was also quite good. and the naan was good. \n\nWe saw quite a few Indians eat here so we believed it must be a popular authentic joint.", "author": "T L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-25", "description": "Ordered lamb biryani here. The chef needs to be fired, for sure he doesn't know how to cook a biryani. It had potatoes that were raw, excessive salt made the dish unbeatable. I threw it in the trash. Way Over priced. You can get better quality at naan curry for a better price", "author": "Kishor K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-26", "description": "Food was pretty good. I had the lamb tikka masala and the meat was really tender. The sauce was a little bit spicy but not too much.The naans were not the best but they were decent.\nThe atmosphere was definitely not great, but it seemed clean and we wanted something simple so it was ok.\nPrices were definitely cheap. Almost everything under $10!\nOverall I think it's a good deal.", "author": "Virginie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "This is a bread and butter Indian restaurant with great food at low prices. The menu is broad and the food is delightful. Not the prettiest place but it's definitely great for a quick lunch.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-04", "description": "I use to love this place, however I've been extremely ill and to sick to walk the few blocks. I finally feel well enough to eat, I call for delivery at 9pm on a Thursday. \n  Guy on the other tells me my total is only $23.76 so I have to spend another $1.24 for them to walk 2-3 blocks. Yeah right with 3 Indian restaurants with a 3 block radius I'll pass.\n Times are hard but to nickel and dime your regular customers is disgusting.", "author": "Kelenia O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-16", "description": "My friend and I went there for lunch this past Saturday. The reason we chose to go in there was because its door was wide open and we were lured by the wonderful smell of spice. We were seated in the back where there was no window to look out and a TV had Bollywood on nonstop. We ordered butter chicken and tandoori lamb. We were so hungry that we couldn't wait to have their wonderful smelling food!!  Well, unfortunately we were less than impressed. The lamb, instead of tender, was extremely dry and hard to chew. The presentation was pretty unappetizing also - several chunks of charred meat scattered on the plate...  The butter chicken was better but there was hardly any chicken in the sauce.  \n\nThere was a bug flying around and wouldn't leave us alone - guess it came in from the open entrance. Eventually it landed on the naan and we decided not to eat the naan. We left feeling very unsatisfied. We will not go back for sure.", "author": "Florrie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-13", "description": "Boyfriend and I went here tonight, got seated with no words from the host?, looked at the menu, figured out what we wanted and put the menus down. 15-20 minutes go by and no on checks up on us. We are hungry and want to order but despite our stares they never came by. In fact, I took notice that they didn't really check up on any of their tables.. all the tables had a pitcher of water and one person had to physically get up and ask the guy(s) behind the counter for a box and check. This same guy that gave the box my bf made eye contact with three times. You can read a lot on my bf's face and yet the only host/waiter is just chatting it up the whole time with another worker.\n\nYet never have I gone to a restaurant where they take your order and just... never get my order taken. This had to be a really bad omen of what was rest to come, their yelp page is outdated and everything has gone up in price about double. Realizing this place is two $ signs instead of one like the yelp page says it is we decide to just leave. Not over paying for bad service. \n\nWhen we left though the guy who my bf kept making eye contact with just waved. My man said \"you should maybe take your customer's orders after you seat them at some point?\" The guy just smirked and said ok. He really got heated at that and wanted to say more but I was already out the building. We never left a restaurant before, it was pretty bad, we almost thought it was because we were gay or something... such random rudeness we got there!\n\nEDIT::\nAfter reading other's reviews, especially the one by \"Little Miss Picky\" I am so glad we did the right thing and just left! I was getting the same problems so many other reviewers did, glad I didn't stay for the bad food and more bad service! Hahaha!", "author": "Tim V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "So before I came to this restaurant I did not like Indian food AT ALL! I came here cause j went to lunch with some co workers and they said I just have to try this place and I'll love it. So fine I did. And it was absolutely AMAZING! I have come here about 4 times after and loved it every time. \nThe Chicken Tikka Masala: super tender chicken, very flavorful but not overwhelming sauce that goes perfectly with rice or for dipping the naan into. \nBeef Kabob: perfectly cooked, super tender, and not dry at all. Also has lots of flavor and even goes well with dipping into the tikka masala sauce.\nGarlic naan and regular naan: really good and not really dough. It's perfectly fluffy and goes well with all the sauces. \nI have also tried a few of the other dishes but don't remember their names. But they are all delicious!!! The dishes are kind of small so for 4 people lets say we order about 3 chicken tikka masala a, 1 rice  and 3 naans.", "author": "G O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-12", "description": "Looks like we are not the only ones who found stuff in their food that does not belong there. I discovered a piece of metal in my channa-saag. When we reported it, the waiter casually shrugged his shoulders and said:\n\"Oh yes, this is a piece of the cleaning scrub we use to clean the utensils. It shouldn't be harmful. However I can give you another plate for you to feel safe\" \nRidiculous! Not one word of apology though!! Ofcors, I wouldn't ask for another plate of that same curry to 'feel safe'.  \n\nThe food was very average. Chicken Kadahi was nothing but plain Chicken curry. There are countless Indian restaurants in the city that has food that taste way better and in the same price range. Free tea isn't unique to this place either. Needless to say, we are never returning here.", "author": "Jayeeta K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-30", "description": "Got the paneer tikka masala, which is a serviceable tikka masala, if thin, and gently-spiced even for the species. Super nice guy running the place on a Saturday afternoon though, so points for service and atmosphere.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-14", "description": "I have been coming here for a couple years now. I work at UCSF and usually  come here for lunch. The first time I came a couple years ago I was having difficulty deciding between paneer tikka masala and vegetable tikka masala. The person working the register said they can mix the vegetable and paneer into one dish. It was delicious, and that has been my go to order when I eat here. Today I decided to treat myself to some Indian food to go for dinner. When I called to order over the phone I explained I wanted the paneer tikka masala and vegetable tikka masala mixed into one portion. The person on the phone was having a difficult time understanding and said that is not a dish on the menu. I explained I had ordered it before, and he said okay he would make it that way since I have had it before. When I arrived to pick up my food there was a paneer tikka masala and mixed vegetable tikka masala with paneer. I explained I did not order the paneer tikka masala and the older man behind the register was very aggressive and rude saying I had ordered wrong over the phone, and next time to say mixed vegetable masala paneer. I understand mistakes can happen if the order is something not directly off the menu, but the way he spoke to me showed poor customer service. The other man working behind the counter perfectly understood what I wanted and quickly fixed it for me. The two star rating comes from the lack of customer service displayed by the older man working the register. If you have difficulty understanding orders over the phone, please let the man working behind the counter take the orders instead.", "author": "Aniek V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-25", "description": "Oh what would I do if there were no tikka masala!!\n\nthe indian community at UC introduced me to tikka when i had just moved here from the old country.\nfor 1.5 years now, tikka has been my destination for Indian food in SF.\n\nthe food is good, free chai is great! the staff are friendly and the owner, Faisal, always has time to catch up and chat. if u r a regular, u r made to feel like a friend. \n\nIve had them cater to parties at short notice, and they always come thru - with great food.\n\nI always recommend tikka as the goto place for Indian cuisine in the inner sunset. try the paneer tikka masala,their signature dish with naan or rice. the daal-saag is amazing too, but you have to check for seasonal availability. \n\np.s: this review is biased because tikka reminds me of home, but this place has great food and service none-the-less.", "author": "Prashant P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-08", "description": "Visited Tikka Masala with friends on a Sunday evening.\n\nService: For a Small restaurant ; Service is like you would expect it - quick and attentive. I do have a gripe though; for a small restaurant ( 20 covers) you have to go to the cash register to place ur order. Considering that the staff was getting food to my table I don't quite understand why can't they take my order at the table too??? MYSTERY \n\nFood : Had \n- Chicken Boti : Dry & worst dish of the night\n- Chicken Seekh Kabab : Best Dish of the night. Perfectly cooked and spiced.\n- Lamb Chops : At 15$ for 3 Tiny no-meat and all Bone pieces .. it is a ripoff.. Whatever meat I got to taste  ( Party of 5 ) was good. You can skip this considering the price-point and the quantity on offer.\n- Chicken Kadhai : Well made \n- Saag Paneer: Well made\n- Naans : Aloo , Paneer, Onion, Keema , Basil-Garlic . Keema is the best \n- Chicken Biryani: A-OK  .. I have had better Pakistani Biryanis in-around SF. Had to ask for the Raita. I think this was a genuine oversight though\n- Mango Lassi - Recommend you to skip this .. Have had better\n- Chai :  Free - so go for it\n\nAll put together : For someone who used to live off on Naan-N-Curry food during my college days in SFo; Tikka Masala is no better if not different. Don't think I will come back as it does nothing different for me to stand out v/s Naan-N-Curry..", "author": "Abhishek R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "A few days ago, I got out of work early, which is rare.  I was supposed to be working on something from home, but was craving Indian food, and as is my M.O., I figured it wouldn't hurt anyone to procrastinate a bit.  Yeah, that wasn't the smartest move.  But Tikka Masala was!\n\nI was looking for something close to home, and checked out my fellow Yelper's reviews, which totally steered me right!  (Thanks, guys!)  This is why I was impressed...the menu is varied, prices are fair and reasonable, food is fresh, cooked to order, and comes out piping hot.  \n\nHere's what was delish that we ordered:  Sag Paneer - FRESH spinach, wonderful level of spice, generous portions of paneer\nChicken Tikka Masala - not at all oily or greasy.  Basically, I wanted to lick the plate.\nRaita - Balanced - nice cut up carrots and cucumbers.  Not too thick or gloppy - great consistency.\nTandoori Chicken - On the bone, but SO flavorful!  Was awesome to cut up and add to the tikka masala - made the sauce go even further.\n\nHere's what was good, but not great:\nSamosas - eh.  Kinda dry.  Just eh.\nNaan - fine, but not super fluffy or flavorful.\n\nThe restaurant itself is no frills, but the servers are attentive and kind.  Free bottomless Chai is always a plus in my book!  Tikka Masala ...as Arnold says...\"I'll be back!\"", "author": "Brooke N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "Wow. \n\n(1) The Lamb wraps. The muddafckin lamb wraps! Thumbs all the way up to the ceiling! So much flavor and it doesn't have that \"musty\" taste that is very common with lamb meat. I can tell that it is very well-marinated! The meat complements well with the fresh vegetables that comes with wrap. \n\n(2) FREE CHAI TEA. so delish. I had 4 cups. I couldn't get enough of it. If you like it sweetened, there is sugar on the side. I'm a sweet tooth so I dab that sugar to make everything nice :)\n\n(3) GREAT SERVICE. I got mah agua after a split sec and the waiters are really kind.", "author": "Mark Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Went here randomly after an appt. It was pleasant inside lots of light and food was  great! The saag paneer was outstanding extremely fresh clearly fresh spinach had been used and the cheese is house made. The naan was interesting and delish kind of like wood fired thin crust pizza crust not super doughy. The tikka masala was totally good. And you can add that sauce for $1 to anything next time I will try w the okra. Everything was great! I will come here again even if I am not parked in front.", "author": "Precita M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-07", "description": "Tikka masala and green peas tofu dish were enjoyable with rice.  It was a great mix of sweet with spicy, chicken and veggie.   Excellent, excellent service.\n\n  I did not find anything in my food, but I'm not sure I would come back after reading the other reviews.  It'd be great if management would respond to the other complaints about finding extraneous items in the food.", "author": "Cherry F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Their tikka masala is so good! Definitely beats Some of the places on Irving. It's not crowded either, but good and quick service. Free chai too!", "author": "Kevin X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "My first experience with Tikka Masala was like, 'Meh, Naan N Curry does it way better.'\n\nMy 2nd experience with Tikka Masala (3 years later) was like, 'DANG Naan N Curry who?!'\n\nEverything from their garlic and basil naan, eggplant curry (must try!), mini veggie samosas, and even their rice is amazing. Nice to know they are just down the street from UCSF so I can pop in for a quick lunch!", "author": "Liana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-12", "description": "Tikka masala and garlic naan were good, but chicken korma was not as good. Rice is a bit dry but overall a decent place.", "author": "Geil M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "We ordered chicken tikka masala, lamb tikka masala, rice, and naan for takeout.  I was surprised that my food was already packaged when I arrived less than 10 minutes after I called.  Cost was $26.  The chicken tikka masala was good.  The chicken appeared to have been roasted, but had been sitting in the sauce a bit longer than optimal.  The lamb had been in the sauce far too long and there was no charbroil or roasted flavor at all.  It was starting to fall apart like meat that had been boiled too long.  \n\nThe entrees were like something I might expect from fast food (like an indian version of panda express), but subpar for entrees that were supposed to be cooked to order.  The rice was ok, but a bit overcooked (like it had been left in a pot for a long time).  The naan was thick and very doughly.   It was not crisp at all as I would expect with fresh naan.    The portion sizes for the entrees were moderate while the portions for the naan and rice were generous.", "author": "Tennyson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "I have a love/hate relationships with Indian food. I do love the curry flavors, the strong flavoring of CUMin (yes, i went there), the CHAI, the nan, and the spiciness. BUT... what I don't enjoy is the possibillity of explosive diarrhea and a burning asshole. \n\nThat being said, tikka masala has proved to give me all the things i love about indian food and leave the diarrhea to rest. (this can't be said for my experience at the nan n' curry down the street on irving. YIKES). \n\nI consistently order the chicken tikka masala and it is delicious. the sauce is creamy and i love sopping it up with their naan and the basmati rice. I am also a fan of the dal (lentils) and several of the lamb dishes. \n\nThis is a nice spot of lunch (esp if you are at UC), service is fast and efficient, the chai and water are self serve. chai is a must!", "author": "Tim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "I was erroneously told this place was BYOB so I BY-ed my own B.  The staff graciously ignored my drinking my own beer while I ate (I didn't realized until after I left)  so kudos for an understanding wait staff\n\nWarning: I am not picky when it comes to Indian food.  I can't tell the difference between good and mediocre.  That being said I'd call this place a REALLY good bargain.  Indian food gets expensive when you want to try a bunch of dishes but this place has prices that make it doable.  \n\nLarge chunks of chicken in the Tikka Masala.  Good garlic naan, not too spicy lamb lamb korma\n\nMostly the 4 stars represent the awesome what you get:what you pay for ratio  It's not that the food is so fantastic it's just a cheap way to get your Palak Paneer fix", "author": "Meg M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-04", "description": "Had the Chicken Tikka Masala, Mixed Veg., naan, and rice.\n\nChicken Tikka Masala was good.  Usual Indian restaurant pricing.  Naan is non-traditional, still tasty but closer to a flat bread or thin crust pizza dough.", "author": "Gyasi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "I love this place!\n\nVery close to where I studied. Love the food and the people.\n\nAlthough everything is really good, chicken biryani and chicken korma are a must-try!\n\nFood gets a little oily at times, hence the -1 star.\n\nIf not for this place, I would have died of hunger. Can't wait to go back to SF and eat here again!", "author": "Shreyas O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-03", "description": "Okay, I hate that I have to write this review and give this place one star, but this is unacceptable.\n\nThis is the place we've been ordering from since Tasty Curry closed. It's probably the best-tasting Indian food in our area for the price, and out of the dozen or so times we've ordered from here, we've never had a problem... That is, until now.\n\nI read one of the reviews for this place talking about finding shit in the food that didn't belong there; a used band-aid in the rice, a toenail in someone's curry, and I really didn't want to believe it... Now it seems I've experienced it.\n\nWhat I found might not be as unusual or disgusting as the aforementioned things were, but as a vegan, I was pretty grossed out to find a piece of animal bone in my mouth after taking a bite of baigan bharta, which is a (supposedly) vegetarian curry consisting of eggplant.\n\nI understand that mistakes happen, but with this place's track record, it almost seems like there's no regard for what gets scooped into the food here, and quite frankly that is disgusting.\n\nI guess we won't be ordering from this place anymore. Sorry.", "author": "P A U L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-01", "description": "The good:\nLamb Tikka Masala:  Not bad\nLamb/Beef Shish Kabob:  Good flavor\n\nThe bad:\nNaan:  Too doughy.\n\nThe owner:  Nice but I do not appreciate him coming in to the restaurant while fighting a cold at the same time.", "author": "SF F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-08", "description": "Being a Pakistani myself, I always say that no one on this planet can cook better than my mom until I met Tikka Masala. \n\nSo whenever I'm in the city and missing my mom I always make a pit stop here. The owner has to be the sweetest let alone the cutest Pakistani/Indian man! \nThe food here is delicious. From the lamb briyani to the fresh naans everything is yummy.\n\nThey have a variety of indian beers that puts me in such a great mood!\nOh, and don't forget to get a hot cup of COMPLIMENTARY chai! Delish!", "author": "Amara S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-22", "description": "I don't usually like writing negative reviews, but I feel like I need to warn others about this place. I saw the yelp reviews about people finding weird things in their food, but decided to give this place a chance anyway. BAD idea. My tikka masala was okay, nothing special. The to-go container was tiny though. It was barely enough for one meal but cost over $8. I didn't really mind though. The reason for the one star is the spoiled rice that they gave me. It had that smell that rice get after it's been left in the rice cooker for too long. I was hungry though and didn't want to go all the way back to complain.. so i ate it. My stomach was upset the whole night and I felt sick. I really wish I could like this place because it's at such a convenient location. Too bad.", "author": "Mc N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "This place has some of the best Saag ever.  It's not that sloppy, smushy yuck that you usually get at any fast food Indian place.  No, this Saag has Character!  It is full and wholesome with actual leaves of spinach swirled together with a hodgepodge of delicious, aromatic spices.\n\nI usually never order Saag but this place has changed my mind.  Actually.. all their food is rather good here, especially their delicious, fluffy naan.  (But to be honest, I've had better Tikka Masala!)", "author": "Kimiko Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "I love this place!! Five Stars!!\n\nFood is great...service is great!!\n\nThis is my 2nd time trying Indian food & I love it. First time was at Naan & Curry. However Tikka Masala taste better & is cleaner.\n\nNaan, Garlic & Basil Naan, Chicken Tikka Masala & Mango Chutney\nhttp://static.px.yelp.com/bphoto/jli7cv-_5gljE7StZL65wA/l\n\nChicken Tandoori (Leg)\nhttp://static.px.yelp.com/bphoto/xZ-EDRF_Nqu_ktF8H341aw/l\n\n(Monday, January 19, 2009)", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "My friend recommended this place to me. She brought me there a couple of times and in the beginning since I am not really into Indian food, was a bit skeptical at first. As I came back to this place I really do enjoy it. \n\nFood and drinks\n\nNaan - Fresh and Soft\nChicken Tikka Masala - Great when dipped with Naan\nTandoori Chicken (Drumstick) - Tender and delicious\nChai Tea - Free and tasty\n\nService\nOrder at register and they bring you the food.\n\nAmbiance: \nSimple, they have tables and chairs.\n\nPrice:\nIt is pretty cheap for what you get.", "author": "Irene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "Went here about 1 month ago to meet some people for dinner but I didn't get anything cause I already ate before hand and this dinner was late notice. Even though I already ate,  I got hungry again once they brought the food out. Definitely going back when I have an empty stomach!", "author": "Dang T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "Chicken Tikka Masala, Daal Muhkni, Paneer Pakora... yes please. Good place for delivery, they are quick and reliable.", "author": "Howie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "I don't know what all the haters are talking about. I ordered delivery from this place today and it was perfect. First they are quick with the delivery which is always nice. Most important, THE FOOD WAS DELICIOUS. Saag paneer with tons of decadent paneer; chicken tikka masala was great; naan was maybe not as soft as I'd hoped but I was happy with it; and the samosas were tasty. The only dish I didn't like was the tandoori chicken, just wasn't feeling it so much. \n\nPortions were pretty big; the food is going to last me for like 3 meals. And definitely not too expensive.", "author": "Latte Queen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "Very good food. We ordered some authentic dishes and they didn't disappoint. The service was great until the end when they made us box up our own leftovers. We thought that was a bit tacky. Overall- if craving some Indian- great place !", "author": "Caitlin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-15", "description": "Meh meh meh meh. Sure it was cheap, but I really only found one plate worth eating at the lunch buffet. The chai tea was horrible and the pans for the buffet were not even warm. I was confused, I guess, because I assumed there would be more vegan options.", "author": "Shanna D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-28", "description": "Pathetic chicken biryani. No spices, poor quality rice and bland chicken. Not at all worth $10.90", "author": "Deepak C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-04", "description": "WARNING: Matt is exceptionally inebriated when typing this review.\n\nAfter having one too many \"Sex on the Beach\", Matt decided to eat here to absorb the alcohol in his system.\n\nSomehow, someway, and being a little under the influence of one too many drinks, Matt drove to this Indian restaurant and somehow and miraculously ate here.\n\nHe had a Tandoori Chicken Breast with side of Jasmine Rice and a side of Garlic Naan. The $3.00 spicy Indian-spiced chicken-breast was very spicy and was the perfect cure to absorb the alcohol from Matt's system. After the tasty spicy Indian cuisine meal, Matt slowly regained his severity and once again able to be clear-headed once again\n\nMatt don't do get smashed often, but eating just about anything including a spicy Indian cuisine is the perfect cure.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "Food is yummy and comes out fairly quickly.   Chicken tikka masala is delicious and chicken biryani has a generous portion. Free chai is a definite plus and one of the things that keeps me coming back. Recommend giving them a try!", "author": "M B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-20", "description": "This is a simple, fresh Indian cafe.  Nothing fancy, but not greasy and very cheap.", "author": "Christine R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-08", "description": "i went to this place with my friends reading the good reviews. first of all the place is too congested. we had chicken biryani, chicken tikka masala and tandoori chicken. liked their chicken tikka masala but chicken biryani was really bad! i prefer to pay little more if necessary than paying average and getting too low in the plate. not happy! i dont think i would go back there ever!", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-13", "description": "Just before our wonderful date at the A.C.T. watching A Christmas Carol, we came here because 1 - it's up the street, 2 - I wanted to compare it to my favorite Indian restaurants in Berkeley. \n\nFood:\nChicken Tikka Masala - It had nice flavor and nice color to it. It was definitely a good sized portion and I was full off of the whole thing, but that's because I didn't have lunch on that day. I often forget to eat if I'm busy with other things aka studying. \n\nService: Everything here is self-serviced for those who didn't realize. The water you must get yourself. The cups are by the tea, and the water in the fridge area. The tea is also self serviced, and it is definitely not as good as the chai tea that I'm used to. Just go up to the front and order. The food comes within 10 minutes which isn't bad, but it was just weird to be the ONLY people sitting in the restaurant. \n\nOverall, it wasn't a horrible experience, but it was just weird. To most of the Indian restaurants I go to, I'm not the only couple sitting there eating. The tikka masala wasn't bad, but it's just not as good as my comfort food in Berkeley.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "Food here is good (way better than some of the ones in the same area), but not great. Maybe it is just my preference, but the tikka masala was too watered down for me. It wasn't the creamy consistency that I like and the flavors were not all there. The chicken vindaloo was better than other places that I have tried. \nI like the free chai tea and the naan was pretty good. \nReally small place with tiny tables for two that barely fit the 4 dishes we ordered. \nAnd there service...barely there, dropped of food and that was it. No smiles, no asking how was the food. Not the welcoming attitude that I was used to at Tasty Curry. I was a dedicated \"Tasty Curry\" fan, but since that place closed down I am looking for a replacement. Still searching.....=(", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-18", "description": "Wha?\n\nI think Tikka Masala deserves at least 1/2 star rating higher than Naan-N-Curry if not for the price alone. $4-6 a dish is fine by me. When the price starts creeping up to $8 like at Naan-N-Curry, I have to say, \"Na ah.\"\n\nI've always gotten take-out at Tikka Masala since I live nearby, but I would like to eat in sometime since patrons get free tea. Dishes are simple and have never disappointed, serving sizes are fairly generous, and the workers seem to be in a much better mood than the workers at Naan-N-Curry.\n\n(NOTE: Sorry for all the Naan-N-Curry complaints...Probably just should have written a review for them, but I'd rather praise the better restaurant.)", "author": "Kym M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "Pretty low on ambience BUT priced so you can enjoy Indian food the way you should. Too many places charge entree prices for Sag Aloo, Bombay Aloo or all those other tasty veggie side dishes that go great with curry. Tikka Masala allows you to order lots of side dishes because theirs cheap and a few curries. The Naan are good but no Keema Naan unfortunately was not on the list. The chicken Korma was bereft of coconut milk but still tasty. The Vindaloo was calmed down for our appetite which was nice.\nFree chai tea when you dine in which was a nice touch. We were there for lunch and it was not busy but definitely inexpensive.\nI would go again for sure", "author": "Adam O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "Wow this food is good.  Get off your high horse and serve yourself your Free chai and water cause not everything in every restaurant is the same.  The food is as good as its going to get.  Parking is alright, but then again where is it great in SF?\n\nPlain Naan- good to soak up the curries.  Good naan\nChicken Kofta - I recommend, its savory with 3 meatballs of tasty goodness and the sauce is just wow.  Time to spoon some over rice.\nChicken Vindaloo- Spicy sauce and the chicken was juicy and tender, but you might want to eat this toward the end as it kinda blasts your taste buds.\nLamb Biriyani - So yeah I like lamb and this won't hurt your feelings or anything if you eat it.  Its just throat swallowing good.\n\nIt's a little confusing when you enter but go to the counter when you enter to order your food.  Get your water or free chai; have some stimulating conversation while waiting for your food to arrive.\n\nDecor: 4\nFood:4\nService: 3 (Not full service mostly for your expectations, but the hostess is nice and friendly)\n\nWould I go back? You bet your pastrami I would!", "author": "Kelson H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "So, I finally got takeout here recently a couple of times, and I was pleasantly surprised.  \n\nFirst, the baigan bharta was delicious--it was creamy and flavorful and really tasty--one of the best I've ever had (I'm  from being an expert in Indian food).\n\nSecond, the chicken tikka masala was tasty also.  While others say that there's not much chicken (this is true), the flavor of the chicken and sauce are both good--the chicken has a nice smoked flavor and the sauce itself has a nice, subtle heat to it.  \n\nThird, the guy who does takeout during the day is incredibly pleasant and nice.   \n\nAnyway, I actually think the baigan bharta and chicken tikka masala are better than those of masala restaurant on 9th.  \n\nanyway, i have no idea if I've ordred wrong in the past or whether there has been a major change, but let's just say that I'm glad that the food has been solid in my recent experience.", "author": "Howard T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-14", "description": "Pretty solid food. Tikka Masala is one of my usual go-to spots in the Inner Sunset if I'm in the mood for some saag paneer or tikka masala. The food isn't mind-blowingly good, but it does the trick!", "author": "Abby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Delicious food, great service, good prices. I love indian food and have been to a fair amount of indian food places in sf. This is one of the best. Their vegetable tikka masala is one of the best dishes I have tasted. This place is a MUST TRY!", "author": "David W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-20", "description": "I'm embarrassed to admit I ate here. It was open, they deliver, it's Indian food - how bad could it be? It could be bad. Make that: BAD.  And, to risk sounding like a Woody Allen joke--and the portions are SO small.  My friend and I ordered Saag Paneer, Chicken Korma and Lamb Korma. I had the Chicken Korma and some Saag Paneer. The Saag Paneer was ok, but there was almost no cheese in it. The Chicken Korma was 2---two---pieces of chicken, and I have no idea where they even got chicken like this---it was ALL bone and gristle. I'm serious: bone and gristle. AND it wasn't even Chicken Korma! I have had Chicken Korma for 20 years. This was red watery greasy sauce on some bony blobs of chicken. My friend's Lamb Korma also was red watery greasy sauce---not Lamb Korma. More like LAME Korma. There were exactly 3 pieces of meat in his dinner. Most disappointing Indian food I've ever had.", "author": "Swiss C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "My wife and I attempted to hit Pomelo on a Saturday for lunch.  Clearly we should have checked the hours first.\n\nThe olfactory senses pointed us to this place, and we were not disappointed at all!  We recommend this place:\n+ GREAT naan!  Eat it while it's hot - the garlic and basil one is especially good.\n+ Curries and vegetarian dishes are really good.  (Sadly, I don't remember the name, but we had one with chickpeas that was particularly good.)\n+ Really good prices", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "I used to live just up the street from Tikka Masala.  It became my second dining room - either I would saunter down on a Saturday morning, or stop by on my way home from a long bike commute from work.\n\nNow I live farther out in the avenues, and they deliver dinner - nothing like the arrival of warm naan and the aromas of saag, chicken tikka masala, keema aloo, and samosas to make my evening.\n\nI highly recommend the above items, as well as the aloo naan.  The free chai is also nice if you are dining in.  I would like a little more tangyness in the mango lassis, but on the balance this is easily one of my all-time favorite Indian/Pakastani places.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "Their Chicken Tikka has amazing flavor! I dip my naan into it! Num!! Our Indian friend said the naan is thicker than he is used to, but we still liked it a lot! Great prices too!", "author": "Kari E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "I like this place. The owner is really nice and I believe its a family business. I have a soft spot for family businesses because my parents used to run one. Their food is good - if you know what to order - and I haven't seen any nasty things in my food as others have claimed here, but their hours are a little strange. They open morning, close mid-day for a while, then re-open until ten. Try not to come during closed periods. I don't know their names here but the man (and his wife?) are extremely friendly, out-going, and patient with the customers. ENJOY!", "author": "Apple F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "Now that I'm not in Berkeley anymore, I get crazy cravings for Middle Eastern food.  When I was in SF this weekend and we couldn't decide where to eat, I immediately suggested Indian food and I'm soo glad I did.\n\nWe walk in and the place looks tiny and a bit shabby.  I ordered the chicken tikka masala (it is the name of the restaurant, after all), but I also try my friends' baigan bharta (roasted mashed eggplant with onions.....so flavorful ) and chicken korma.  Everything was delicioussssss, it definitely reminded me of homemade Indian food. It wasn't swimming in oil like the food at most places, and it was pretty cheap (naan and entree came to about $8 before tip).  There is also free chai tea!  The naan is cut into pieces for you (like how they cut up pita for you at a Mediterranean place) which was good because we had 5 people sitting at a table for 4...no room for huge pieces of naan.  It was coooked perfectly for the most part, but there was some burnt parts that were hard to chew.  \n\nThe service isn't great, but it isn't terrible.  The workers weren't very friendly but they got us our food in a prompt manner and didn't kick us out when we overstayed our visit.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "Best indian food in the city. great prices, friendly owners. Go on Monday, which is when they have their spice delivery and the food is extra delicious. Although it's great any day of the week. When I lived in the inner sunset I was here 1-3 times a week.", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-08", "description": "Their food is ok, but the service is bad.  Their website is also sloppy.  It's hard to find critical information such as their phone number. Also, their website doesn't state anything about a minimum amount for delivery.  I understand places requiring a minimum amount for delivery, but $25 is too much and it limits your customer base.   \n\nI called to place an order for myself tonight, expecting to have it delivered.  When all was done, the bill would have been $23 before tax. The guy on the phone said it must be a minimum of $25 for delivery.  Stupid is all I have to say! I'm three to four blocks away, and they can't deliver because the bill before tax is $23. Oh yeah, the dude told me I could come in and get the food....defeats the whole purpose of delivery.  \n\nThis restaurant is just another typical San Francisco inconvenience.  As I told the guy on the phone, it's his loss, not mine.  I will order else where and won't be returning.  It's not worth it.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Self-service. Meaning, get your own menu, order at the counter, grab your drink in the fridge behind you and choose a seat. \n\nThe pros: the food was delicious! We ordered the garlic & basil naan (served in 4 pieces)--$1.99, Chicken Vindaloo--$6.99 and Aloo Gobi--$5.99. The portions were a little small in my opinion, but it was super tasty, I wasn't that hungry so I ended up leaving full.", "author": "Caryl C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-16", "description": "Solid Indian restaurant.  Generous portions of naan and free chai tea plus the usual dishes.  Helpful servers as well.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Good food, great service, hospitable staff, chai always available, creamy sauce, delicious meat, specials worth trying, etc, and so on. What's not to like?", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "This is my new go-to Indian delivery place.  I have ordered a couple times now.  The food is reasonably priced and tastes really fresh.  The saag actually tasted like fresh spinach and was some of the best I have ever had anywhere.  They deliver in a very timely manner and everything is piping hot upon arrival, packaged very well and delicious!!!\n\nIt doesn't hurt that the delivery guy is adorable and as friendly as you can get!  For Indian delivery in the sunset this place ROCKS!", "author": "Robert P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "I think I ordered the two best dishes here: CTM (namesake) and chana masala. Along with the free chai (which was much improved from 2006), everything was flavorful, affordable, served fast, and good. Impressed.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "I think this place is great. Whether take out or eating in the restaurant, the food is great. The people who work there are incredibly friendly and very helpful. \n\nOnce we actually went there just to pick up rice and naan as someone at home was cooking. Out of curiosity, we asked the guy there (maybe the owner?) about some obscure spice that we didn't get because it was SUPER expensive at Safeway. He told us that they bought it in bulk and it was way cheaper that way, so he just gave us a bunch of it. (I can't remember for the life of me what the spice was). We offered to pay for it, but he refused. \n\nThe food is always good and I've never had a complaint about any of the variety of dishes I've tried.\n\nFor friendly service and good food, Tikka Masala is great place to go.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "No matter how many places we go, how much money we spend, what new things we try - no Indian restaurant in the Bay Area has unseated Tikka Masala's chicken tikka masala and naan as the best cheap meal in our book. Not one.\n\nIt's not flashy, it's not sexy, it's not trendy. It's just good. And it's cheap, to boot.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "I have eaten here before, just had another run at Tikka Masala with take out instead of eat in.  The food was excellent and the quality of the meal was preserved even with the transport time home.\n\nThe naan, an integral part of any meal, was well grilled.  The dough was even without undercooked or burnt areas.  It was durable for picking up pieces of succulent meats and dipping in savory sauces.\n\nThe chicken tikka masala was tender and flavorful in a savory sauce.   This was one of my favorite dishes from Tikka Masala.  I figured the name of the restaurant implied that this was likely a signature dish for them and it was well worth it.  The sauce is rich and multi-dimensional.\n\nThe lamb korma was also excellent.  The lamb was kept moist and tender with no \"gamey\" taste.  The sauce was thick and succulent and paired nicely with the naan and lamb.\n\nOther dishes we got were the chicken tikka, daal, saag aloo, and saag paneer.  I enjoyed the creamy spinach in the saag dishes but found I preferred the saag aloo (potato) to the saag paneer (cheese) as the potato spinach dish had a cleaner more vibrant taste to the spinach and helped to cut through the other dishes.  While the paneer was a bit too creamy and rich for my taste (still good though).\n\nThe daal lentils were also very well done as well as the chicken tikka, but the star was the lamb korma and the chicken tikka masala.  Great restaurant and a keeper on the short list of places to go for dinner.", "author": "Jason N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "not fancy but very honest indian food. I have tried a few Indian places in SF and so far, this is the only place that comes close to my Indian food experience from London. Well done!", "author": "Joe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "I came here and didn't have any problems.\n\nI ordered a mango lassi, chicken tikka masala, basmati rice, aloo naan, and  vegetables samosas. The chicken tikka masala was nice and creamy, the naan was soft and flavorful, and the samosas has just the right amount spices. \n\nMy food tasted great, the server checked up on us,  prices were fairly reasonable!", "author": "rue s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-27", "description": "I come here fo the food. The have some of the best Indian. Everything I tried here I liked so far. I love their chicken tikka masala- my favorite dish here. Also their samosas are good.\n\nSome of the things I don't like are that the drinks are self serve, and the service in general. It's just not very friendly or welcoming, it seems like Management couldn't care any less. Only reason I come here is because of the food. This is one of those hole in the wall type of places. The prices are also really good. I would suggest getting takeout.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "This is my favorite Indian food in the city! \n\nThe Naan is always cooked perfectly and every dish I've ever ordered here was great! \n\nIt isn't the place for table service but you order and sit down and they bring you delicious plates of food! Great date place and in one of my favorite neighborhoods! Plus, you can get a great dinner for $11 (including tax and tip).\n\nOrder the Chicken Tikka Masala, because it is always so delicious, and then branch out and try something new!\n\nAlso, the staff is super nice and very helpful.\n\nUnlimited Chai...can't go wrong, really.", "author": "Chelsea H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "I live in the neighborhood and eat here more than anywhere else. A humble environment with delicious food. Go here for good Indian with out the fluff!", "author": "Basil C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "So delicious! Love the chicken tikka masala and garlic naan. Definately recommend.", "author": "Cat H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-08", "description": "Nobody puts curry in a corner.\n\nWhat I mean is, this light-n-airy cafe-esque corner location just doesn't work for Indian food.  Indian food should be served in a dark, claustrophobic den suffocating under the smoke and heat of a roaring Tandoori furnace.\n\nFood-wise, I've sampled enough of TM's dishes to say that it's perfectly ordinary Indian food, which in these parts puts it solidly behind New Ganges, N&C, and Tasty Curry.  Nothing has stood out and the sauces don't seem to vary much across dishes.  The one unique item is the quail masala, and while the meat flavor works well for curry, the extreme boniness makes it hard to shovel into your mouth at a satisfactory rate.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-03", "description": "My parents came here for lunch one day during their visit to SF. I think the food was fine, and it all tasted pretty good. However, my mom found a hair under her pile of food, and politely brought it up to the waiter. Although he tried to remedy the situation, he kept saying things like \"No one in here has hair that long.\" ... as if he was blaming my mom (who has short hair). Furthermore, the hair was found UNDER her food, instead of on top, which means it was probably on the bottom of the plate to begin with. If there's hair in your food, then whatever. It's probably not going to kill you, but it's just bad practice. But the right thing to do is to take responsibility for it and not blame your customers for your careless service or anything else that goes wrong in your business.", "author": "Rhea K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "Service- Good\n\nFood - Great (Chicken Tikka Masala, Garlic Naan, Seekh Kabob and Saag Paneer all reminded me of home cooking)\n\n\nHappiness with everything (including the $ spent)- Couldn't be better. \n\nTrust me, Tikka Masala serves Pakistani/Indian food and I am 3/4 Pakistani.", "author": "Ayub M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "This is actually one of my favorite Indian restaurants. Although the portions are smaller than Naan 'n Curry, I think the food is less fattening and more fresh. \n\nAlso, service is great. The main cashier guy is very genuine and patient. No complaints there.\n\nThe only reason why I knock off one star is because I think the portions can be a little larger. Other than that, I love this place!", "author": "Marvin R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-05", "description": "Last night a friend and I made some Indian food. This was the first time either of us had EVER tried cooking Indian food.\n\nGuess what?\n\nIt was drastically better than Tikka Masala.\n\nIF you gave this place more than two stars, you are a fool.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-15", "description": "Great selection of food, delicious. Surprised it wasn't busy! Friendly staff, clean restroom.", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-22", "description": "Class ends around 9:30pm at the UCSF Campus.. As I walk out with my friend in the foggy atmosphere, all i can think of is how my stomach is growling like no other and insanely cold SF can be compared to San Jose.. cafeteria food is closed across the street and we are all the way up on a hill.. As we drove down Judah street, my friend looked closely with his hawked eyes for a bright OPEN sign on the door of the restaurant...and IT WAS! we looked at each other and i turned abrupty to find parking right on the street.. That was how hungry we were.. but at the same time, we talked about our indian food craving throughout lecture... talk about focusing in class?\n\nWe walked right in with 10 minutes to spare.  I felt bad because that meant they had to stay longer but the workers didn't mind since they apparently ate their late night dinner also.  The guy told us \"You have one hour!\" when our food was served.. but hey! we wanted to head back home also so we finished in like 20 mins ha! Quick and friendly service.. music provided in the background. Chai tea free also!\n\nThis is a small fast food joint for a campus restaurant.  Convenient and fast. Plenty of chairs and tables.  Nothing too fancy but who needs fancy on campus?  Very cheap prices from $5 to $10 a plate.  I was very surprised!  Affordable for students.  I give them 3 stars according to the quality of the food compared to other Indian restaurants.  We ordered the Chicken Tikka Marsala and Chicken Aag. I preferred the Tikka Marsala since i love saucey curry. Perfect for dipping with our Garlic Naan.  They used chicken breast for the meat which was healthy!  The other dish was made with spinach.  There was no sauce to it since it was just covered in spinach.  There wasn't much chicken pieces in there though. I was fooled! I thought they were just buried in the massive green mush my friend chose to order!  The naan was alright.. a bit too crispy at some pieces.. I felt like i was just eating crunch pieces and no bread.. I didn't really taste the garlic itself so that was a bit of a downer.. Overall, it did satisfy my quick indian craving for the night though!\n\nTotal: $17 for the night  Cheap or what?", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "Wow, I can't believe some people are tearing this place up so badly in their reviews. I think this food is great. I have never eaten there, just ordered for pick up and had it delivered. I can see that sitting at the restaurant could be a rather different , maybe even somewhat uncomfortable experience but I can't say that this place has done me wrong ever. It is very well priced considering the amount of food you get per entree. The chicken tikka masala is very tasty as is the lamb tikka. It all tastes delicious to me.\nAs far as the people that say they had bland food, they must be life long smokers or something  because this restaurant does not have bland food. Everything I have tasted was flavorful and yummy. HOpefully they don't raise their prices because then it won't be a five star place, but just four stars. \n\nTry it someday, it is good food.\n\n-----------------------------\nThey raised their prices and have a minimum $25 order for free delivery. I have to downgrade to four stars now- sorry Tikka Masala, you did it to yourself.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "Only been here once. I enjoyed it. my dining partner didn't.\n\nAmbiance: Cute hole in the wall. We're still not sure if you're supposed to order at the table or walk up to the host stand. Clean and comfy.\n\nChai: Delish! The perfect flavor, unlike the chalky stuff over at Curry Village. Oh, and it's unlimited and free! I managed to empty the supply, and was sad. In no time they prepared a fresh batch that was ready before my cup was empty :)\n\nNaan: The onion and garlic naan was amazing. Right textures and flavors. The Aloo naan is not very good here - save that one for Naan N Curry.\n\nMeals: No buffet here. Hubby got the Chicken Biryani. He said although it was spicy, it was completely flavorless. I got the Vegetarian version of Tikka Masala. It was good, although confusing. I kept wondering if the curry was cream based. I do think if I had ordered a lest Westernized dish I would have enjoyed the meal even more. They didn't have my favorite desert - Kheer/ Indian rice pudding.\n\nPrice: $25 for two! I thought it was worth it.\n\nOk, so, I eat Indian food all the time. This is one of the first times the food gave me an upset stomach :(", "author": "Zee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Delicious and consistent across the board. I have tried a lot of Indian restaurants in the bay area and this is definitely a top contender. Chicken tikka and goat karahi was full of flavor. Keep up the good work.", "author": "D M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-09", "description": "Not impressed. One star for it being close to school and one star for having homemade, tender paneer but that's as far as I can go. \n\nThe dishes were okay. Nothing to write home about and in keeping with the two-star rating on Yelp, I've definitely had better. The lamb korma was greasy and it separated in the dish. The spinach and paneer was the better of the two dishes we ate but it was only redeemed by their good cheese. \n\nI was excited to sample their free chai but was sadly disappointed. It tasted like scalded milk and lacked the spicy chai taste that I love. Gross.\n\nI live around the corner from Indian Oven and have been spoiled. If you gave this place 5-stars, you need to check out a real, tasty Indian dinner that will blow your mind. Hustle down to Lower Haight and have some good Indian food that's not going to break the bank.\n\nMy friend bought dinner and I'm grateful for the meal but I don't think I'll return.", "author": "Corey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "I tried the chicken vindaloo with paneer naan the other day, and it was so, so, so delicious! The meat was moist and the spices were perfect. Just the right amount of heat.\n\nI've yet to be disappointed with Tikka. Keep up the good work, boys!", "author": "Chelsea H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-02", "description": "Meh.\n\nOn one hand:\n- It's cheap for Indian\n- There aren't too many other Indian places in the Inner Sunset, let alone good ones (I'm sorry, but I've never understood the appeal of Naan N Curry other than it's a good late-night place to go after you've had a couple, and Tasty Curry is anything but)\n- It's clean and bright with decent amount of seating\n\nOn the other hand:\n- The food is just at mediocre.  As other reviewers have said the oil has separated in most of the dishes by the time you get them.  I *know* Indian food uses a lot of oil, but this is the first time I've actually had to see all of it.  Although it's handy for portion control--I ate way less than I usually do.\n- The main guy handling the front of house was a little pushy and we had to tell him twice that we weren't ready to order yet.  There was no one else in there, so it wasn't like we were holding them up.\n- I had to go up and ask for the bill.  Maybe he was trying to make up for jumping the gun at the beginning?\n\nI'd go again if I was dying for Indian food and not able/willing to wait for delivery from some place else, but it's nothing special.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "I love the Palak Paneer with extra Paneer, and everything is pretty tasty here.  Verrrry good for the price.", "author": "M P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "It is a pretty typical indian food restaurant that I can't really complain about other than the price. It is a little pricier than some other Indian restaurants I have been to.  The chicken tikka masala was nice and sweet with a little kick to it with the spices and the naan was soft and fresh.  The chicken was not as soft and tender as I would have liked.  Overall, it is a decent place to go to and the service is friendly and fast.", "author": "Lawrence E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "The Paneer Tikka Masala had a decently creamy orange-red sauce, with a good cheese to sauce ratio.\n\nBut my dining companion complained that his chicken tikka was much too dry. (At least there was lots of it).", "author": "angela n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "I like this place, its a little laid back curry spot, not pricey but good!\n\ni usually get their spinach curry with cheeze, chicken tikka masala, chicken biryani, garlic and aloo naan. \n\nIts awesome on the nights when you are tired and not wanting to cook but want something different. You go in, order your food at the register, sit down and drink some free chai which is pretty good as well, and wait for your food. Good spot.", "author": "chihiro i."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-04", "description": "When I was eating here, I couldn't stop missing Chicken Makhani from Punjabi Tandoori in San Diego. Maybe if I never had good Indian food I would've thought this place was okay. The lamb was dry and salty. Other things were so-so. I couldn't remember what else we ordered because my mind was preoccupied with thoughts of Chicken Makhani from Punjabi. \n\nFree chai though, and it was decent.", "author": "Xiaoyin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-29", "description": "i better write this review while i still smell like lunch before i stoop into a fat induced coma...\n\ntook my staff here lunch and got the chicken tikka masala, lamb boti, veggie biryani, channa masala, aloo naan, garlic naan, and mango lassi.  man i sound like a fatty.  anyway, the food was...meh.  everything was very watered down tasting and i guess maybe it was?  the sauces, even the mint and tamarind chutneys were not viscous at all.  the mango lassi tasted and looked watered down.  (sad face)\n\nthe dude who worked there was nice, but unless i'm dying for indian food and this place was the only one opened, i'm pretty sure i won't be back.\n\nbtw, came out to about 50 bucks.  i love paying for meh food.", "author": "Sally T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "I usually get cravings to eat Indian cuisine maybe twice a year but now that we've tried Tikka Masala, we're going to be eating it a lot more!  We had it delivered per the timeframe that was mentioned when we ordered and the gal that dropped it off was super friendly and polite! Thank you for the wonderful service! We had the Aloo gobi, Chicken saag, Lamb Biryani, Nan and white rice - all delicious.  The flavors of the dishes retained the integrity of the produce used yet was intensely 'Indian', everything was very fresh and just delicious.", "author": "Charlotte C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-26", "description": "Blech.  First off, when we went here, they had newspaper all over the floor to mop up some sort of flood that was almost coating the entire floor.  So, there were chunks of sopping newspaper under the tables, and under our feet.\nThe food lacked flavor and there was some sort of unidentified object in my boyfriend's curry.  He was convinced it was a cockroach at first and, although he was wrong, we both lost our appetites, as it definitely looked like it a bug initially.  My curry was watery and we never got our naan order.  They also seemed irritated to be asked for water, which bugs the hell out of me.  \nSkip this place, you'd be better off just walking down to the 9th and Irving area for more options.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-06", "description": "They got the job done..I walked in, wanted some daal to go, told the guy so and he made it happen for 5 bucks. \n\nNo complaints, but nothing special either.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-05", "description": "I think this is the best Indian food in the Inner Sunset (a neighborhood know for great sushi - not good Indian food).  Tasty Curry certainly isn't bad either, but Tikka Masala just nudges it out.  \n\nThe food is slightly above average, the restaurant is clean (a problem for several of the other Indian restuarants in the neighborhood), and the staff is very friendly (a serious problem at the Naan-n-Curry in the Inner Sunset).  I was tempted to give them an extra star because of the autographed photo of the actor who played the Skipper on Gilligan's Island - but I restrained myself.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-17", "description": "Better than some in the sunset but still not good.  Indian food can be better than this people.", "author": "Zack S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-17", "description": "This food was VERY GOOD, and to all you haters out there i went with a woman who was BORN AND RAISED IN INDIA AND COOKS AMAZING INDIAN FOOD HERSELF!!!\n \nWe ordered so much food that I honestly don't even remember everything we ordered besides the chicken tikka masala (yum!)  and the naan. The naan stands out mostly because we ordered the garlic naan, but I think they may have given us plain by accident (this is the only reason I don't give it fve stars). The service was extremely friendly, I think it helps that the woman I went with knows the owner personaly and he served us, and fast. We also got this mango yogurt drink which I would highly recommend, it was tasty and it was cool because they gave it to you in a to-go style cup so if you didn't finish you could take it with you. \n\nAnother good thing was the free chai tea. This was authentic chai tea which was awesome after years of drinking \"westernized\" chai. The difference in taste is huge but the tea was still very good. I plan to return soon!", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-03", "description": "This is terrible restaurant.  Service is terrible.  Not offered a glass and ice for soda, only the can.  No water provided.  You have to get up and get your own water.  Portions are small, but so are the prices; however, you only get four pieces of meat per order so I don't think it a value.   The chicken tikka masala and lamb vindaloo were ok.  One order of rice is only good for one person and the waitress never came back until she delivered the check and then asked if we wanted more rice.  Lots of men sitting around but only the woman waitress was working.  Never asked if we needed water or additional soda.  People came in for take out and then more to dine in.  The waitress was busy with take out orders so the diners i had to get up and order their food from her at the cash registers, all while the men sat around doing nothing.  Bottom line: the place is a dump and should close.  Don't waste your time or money.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-09", "description": "Utensils are clean!!!!  The chicken tikka masala is very good... spicier than NnC.  I LOVE the Chana Masala here (chickpeas).  Their palaak paneer is wonderful!  Get the mango chutney to balance the spicy flavors of the other dishes.  They opened a 2nd location in the Haight.  The prices are more reasonable too!  \n\n(did I mention they have clean utensils/plates/glasses?)", "author": "Grace M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-25", "description": "OK.  I have called here twice for delivery only to be told, \"we aren't doing delivery tonight.\"  It is Friday night at 6:30.  Seriously.  I mean the first time I thought maybe they had a situation, but the 2nd time.  Terrible.  She even asked for my address anyway...what is the purpose of asking my address I asked to which she replied, \"oh no it is not close enough.\"  Were they going to have someone run over?  I am confused.  Anyhow, one star for the we can't deliver speech...just get rid of delivery.", "author": "Bonnie Marie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "So soo soooo good. Incredibly hard to put down, and I couldn't help but to keep grubbing! I am a new lover to Indian food, and I would highly recommend this spot. Great flavor, and a good amount of food for under $25. I'd say we were more than pleased, and I believe that I will be seeing them again very soon. The only thing I would suggest to NOT order..the pickles. Way too salty for my taste, but who knows, to each their own.\" Enjoy SF, Tikka Masala has my vote!", "author": "Kelly Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-02", "description": "The food is still edible, it's just not good. What happened? I used to like this place.\n\nChicken Tikka Masala: watery, tastes like tomato sauce\nBaigan Bharta: watery and tangy\n\nI think the place was out of butter and cream or something ... I'm bummed b/c it's so close to UCSF, but I won't be going back.", "author": "Anvy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "if you want great indian food then come here. portions are good but not big like some other indian places. \nprices are good and you MUST have their chai tea ( comes free with your meal)", "author": "Diana s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-05", "description": "Honestly, I'm stunned that people are giving this place such high scores.  This was easily the worst indian food in the city of San Francisco. I'm a big indian food eater - at least once a week. My boyfriend and I ordered the chicken tikka masala and the lamb korma and both were bland, bland bland. \n\nIndian food when done well is a mini explosion of flavor in your mouth - both our dishes were watery and about as flavorful as a can of Campbell's soup. I'll never go back there again.", "author": "N J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Okay, so the food isn't amazing or anything.  It's a bit heavy on the cream, lightly spiced, and the portions are about average sized.  However, there's something about the place that makes me give it a 4.  My wife and I know the owners so that doesn't hurt.  It's conveniently located near UCSF so that doesn't hurt either.  More than anything, it's like a warm, beacon of light on a cold, foggy evening in the Sunset which is making me give this place a higher rating.  Judah can be a pretty desolate street in some places and it's nice to not have to go out of your way (I know I know, Irving is only a block away) to grab a decent meal on your way home.", "author": "AZ A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-16", "description": "Small, fast, fairly inexpensive, and very tasty Indian cuisine. \n\nThis place is perfect for a low key meal. The service is generally friendly and the food is always tasty and fresh.\n\nI give this place a 4.5 because parking is no fun (not their fault but still) and they forgot an order of rice we paid for and once we requested it they tried to charge us again. \n\nDefinitely not a place to take anyone you want to impress but for some good Indian food I highly recommend this place. \n\nP.S. If you're standing in line at Naan n' Curry right down the street, you might as well walk the extra block and save your time and money..", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "Simple and delicious.  I had the vegetable masala with a side of rice and had not problem eating the whole thing :)   And free chai is a huge plus.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "Cheap and cheerful, wins in my book. We always get the Chicken Tikka Masala and plain naan. Best $20 dinner for 2. Free chai, too, done and done.", "author": "Sital P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-12", "description": "My opinion of the place has greatly changed. It has gone from a place that is convenient and close by to a place I would drive 30 minutes just to get to. \nFirst thing. The staff. Can you say Amazing!! Always helpful. Always friendly. Always get your orders correct. \nSecond thing. The Food. Always on time. Always hot. Always PERFECT!\nThird.... This place is fast. I call in my order, walk 3 blocks and its ready. \n\nI eat here about once a week. It is something I look forward to. I have even been ordering it on nights where my friends come over instead of going out or cooking. Its just that good.", "author": "Wes P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "I have yet to actually eat a meal AT Tikka Masala, but when I want a tasty take-out dinner, this is always my go-to spot. The staff has always been friendly and my order is usually ready in about 10 minutes.\n\nI noticed that a couple of dishes that I've enjoyed in other Indian restaurants are missing from Tikka Masala's menu, but this has given me a chance to try new ones. I highly recommend the chana masala but be warned as it is very spicy! The prices are very reasonable so you can add naan and samosas to your meal.\n\nI wish this restaurant offered more seating and a better atmosphere for sit down dinners, but for take out in Inner Sunset, it can't be beat.", "author": "Kay K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-11", "description": "Great Indian/Pakistani food.\nPortion size is ok, sometimes even shareable. Good amount of spiciness just as requested. Meat could be a bit chewy at times, depends on what you order but not too much bones in it. Overall not a bad place for a lunch or an occasional dinner.\nDo they deliver? I never saw any fliers from them on my door or mailbox, probably would be nice to promote business to locals.\nKeep up with what you're doing.\nFavorite dishes: Tikka Massala, Lamb okra (bhindi goshdt?)", "author": "Andy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-30", "description": "The chicken vindaloo was way too oily. There was about 1/4 of oil above the curry (in the to-go-box) and the chicken was difficult to get off the bone. More bone than chicken. Nonetheless, it tasted okay. \n\nI give them an extra star for being generous with the garlic naan - they gave me 2 more than I ordered without charging extra.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-07", "description": "I am regretful that I wasted my money at this Indian/Pakistani pit stop in the Haight. The interior looked awkward, but the chef's special Fish Masala seemed like a great choice. I added garlic naan to my order. \n\nUpon paying $12 (for what?), the clerk at the register didn't have enough change and mentioned he'll come back with my $5 bill. As I waited at the table, I started wondering about my money, and whether it was wise to trust him. Meanwhile, a very dry salad came out with no dressing and no silverware. By this time my opinion of the place totally went South, and I declared that it was a $12 loss for the evening. I kept waiting and waiting for my missing $5, even after the clerk returned to the front. I finally had to go up and ask him about my $5 he still owed me. He gave me a blank face for a second, then said \"Oh oh, here you go.\" \n\nWhat. Theee. Fuck. \n\nThe silverware came out finally, followed by the \"special\" fish masala. While the sauce and naan were quite tasty together, the fish sported some dark and bony spots-- a sign of a bad fillet job. I kept biting and gnawing into the dense coriander, which certainly doesn't taste good in full force. I also kept finding fragments of bone and bay leaves in the sauce, as well as a few fibrous strands of something or other. It's easy to pull out entire leaves, but not when they're fragmented throughout the sauce. I then noticed that half of the naan was over-cooked, but by that time I had lost my appetite. \n\nUnimpressive and regrettable. Plenty of other fine Indian sit-downs in the city will easily send this Masala shack to its fate. Oh what's that? \"Don't base your rating on just one visit,\" you say? Well I might as well, since I won't be coming back!", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-05", "description": "I needed to satisfy an Indian Food craving I've had for weeks.\n\nI needed a Tikka Masala Fix.\n\nThis past Friday, Cheryl D. said she was up for Indian food, too, but I told her I didn't care what restaurant as long is was cheap.  We decided on Naan n' Curry.\n\nGot to Irving Street and there was no freakin' parking. So I suggested Tikka Masala up on Judah and we found parking near there.\n\nWalked in and thought it seemed way cleaner than Naan n' Curry.\n\nI was anxious for my Chicken Tikka Masala so I ordered it. \n\nBut it didn't fulfill my Tikka Masala craving.  There wasn't enough yogurt or whatever it is that makes it creamy. The naan was delicious. But I didn't care for the Tikka Masala. I was bummed.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-01", "description": "Great Indian food at very reasonable prices. The Chicken Tikki Misala and Naan are must gets!", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-07", "description": "this place is just not that great, the taste of the food is hardly authentic.. but as others said it's cheap (and you get what you pay for)\n\nyoure far better off going to star india on the other side of the park..", "author": "Alison T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-06", "description": "Better than Naan and Curry, and also better than Tasty Curry  (all in the immediate neighborhood), I love this little hole in the wall.  Place is clean and well lit.  Note the CLEAN mention.  They got a 99 score from the board of health.  It's hanging right by the cash register.\r\n\r\n The chef Ash used to make curry in Hollywood, which is why he has all those signed pics of Farrah Fawcett and stuff around.  Ash worked at Shalimar briefly, and the other chef worked at Shalimar for a while.  Good friendly management and staff.  One thing you'll note for all the dishes is that you'll find whole herbs/spices everywhere.  And I think it makes everything taste more fresh.\r\n\r\nTheir chicken tikka masala is very tasty--a unique spice combination I think--a lot different from other places, with a perfect balance of cream and tomato, unlike most places that are just too creamy. \r\n\r\nI also like their Quails tikka masala that is even less creamy than the chicken tikka masala.  great balance for the stronger quail flavor.  Tandoori chicken leg is only like $3 per LEG.  \r\n\r\nLots of specials you don't see elsewhere.  including a chicken jerrafy (?) and beef jerrafy (not sure if I wrote that right).  Very spicy hot dish with bell peppers and hot peppers.  Perfect thing to warm you up on a cold foggy sunset evening.\r\n\r\nCan't remember which other dishes I usually get, but Ash has some talent with this balance of spices.  Good all around, fast, and not too expensive.  The lamb chop is kinda the exception--it's good, but not as good as shalimar, and you only get 2 pieces.\r\n\r\nAnyways, with this place so close to my apt, I usually don't need to go to the Tenderloin for my indian curry fix.\r\n\r\nTHIS PLACE RULEZ", "author": "Fong L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "They had a big selection of food which is always a good thing :). Getting water/chai tea/ordering/seating is all self serve. The restaurant is pretty small and it was cold inside which is not cool during the winter time. I wanted to just take the food togo but I was eating with family. The food was good but it took about 20 min for the food to come out when we were the only customers in there...They gave 5 pieces of nan, which was good and tasty :). I give it four stars because the food took a long time, my food was cold, and it was cold inside evvn with the doors closed..", "author": "Sophia I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-08", "description": "Better than, Nan and Curry any given day.\r\nOk now that I've given my 2 cent, lets get rolling with the real review.\r\n\r\nThey have excellent Chicken biriyani, (with potatoes!!!!) oh what I wont to do for potatoes.  And surprisingly (unlike most indian restaurants) they also do a great rendition of vegetable biriyani.\r\n\r\nI like their chicken Tikka Masala (name sake dish), which has a great sauce, but chicken can occasionally be on the dry side.\r\n\r\nOccasionally they also have black-eyed-peas dish called \"lobia\", which is excellent, if you grew up in US, with eating the southern style baked/black-eyed-peas than you will be in for a pleasent surprise. Its darn good, although I would recommend calling the retaurant to confirm before you show up expecting it. They only do it occasionally.\r\nWhich is a shame, I have taken it upon my self to educate the ignorant masses on the goodness of indian style black-eyed peas, so that restaurant can be more frequent in cooking it. The chef/owner told me that if I call a day in advance they will make it for me.\r\n\r\nlast but not least, their aloo naan (naan bread stuffed with spicy potato filling) is excellent. Their aloo naan rivals that of Shalimar, there I said it, I'm not claiming one is better than the other, but they both are right up there.\r\n\r\nprices are excellent, and I would recommend stopping by the liquor store across the street and picking up a bottle of wine/6-pk beer and say hello to the chatty Lady from Turkey. if you have been nice, then she might even reward you with little sweet nibbly.", "author": "An u."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-08", "description": "I've had a lot of tikka masala in my life, and I've had a lot of BAD tikka masala. This place is horrible. Their signature dish is the Chicken Tikka Masala, which is really acidic and tastes like tomato sauce. Their naan is ok, but other than that its not really worth it. \n\nTheir lamb vindaloo tastes a bit better, but still the food here is very tomato-y and not at all spicy.\n\nEverything is self serve, but the waiter was nice enough.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-07", "description": "This place used to be the best deal in town until they opened a new franchise in the Haight and jacked their prices up 30% overnight!!!  Are you kidding me?!?  I walk in the other day for a CTM with rice and pull $7.05 out of my pocket and the cashier says \"$9.\"  Come again?  It looks like Tasty Curry just took back the Inner Sunset indian food crown.  At least they had the decency to go up by 25 and 50 cent increments over the span of years.\nPS  Not to mention that my friend recently found a screw in his palak paneer and all they could say was \"sorry,\"...this place is going downhill fast.", "author": "Kelan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-30", "description": "This place is horrible.  If you like Naan-Curry and Shalimar, you will be disappointed here because I was DISAPPOINTED. \n\nChicken Karahi - it is not spicy enough. It does not have much taste compared to the other Chicken Karahi I have had at Shalimar which is oily but still very flavorful.  \n\nBindi - Okra - It is so mushy and acidic! Very tomatoey and it doesnt even taste good!!\n\nAloo Naan- Thick and horrible.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-17", "description": "This place is awful!\nI can't believe people are giving this place 4 and 5 stars.\nThe food here is terrible! Sure it is cheap, but there are plenty of other good Indian restaurants in SF that are just as inexpensive. \nI ordered delivery for 15-20 people. The delivery men met me in front of my building 15 minutes late (they were driving a Lexus...nicest delivery car I've ever seen), and wouldn't even help me up the stairs to my little cart. They were really jerks.\nAlso, their palak paneer squeaks when you chew on it. Yuck.", "author": "Debbie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-04", "description": "Have been here a number of times since I live in the neighborhood. For the most part, the food is good, and sometimes great - I think it depends on who is cooking, how busy they are, and time of day. \n\nThe  chicken tandoori is a great deal - and I have not been disappointed. The saag paneer and chana masala are also quite good, and their garlic/basil naan is excellent. On the other hand, I am not impressed by the samosas.  Service is responsive, and the manager on duty is friendly.\n\nOverall, it rates up there with Naan N' Curry in the Inner Sunset for Indian food. But the smaller (quieter) environment is a plus.", "author": "MandS R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "Ordered Tikka Masala and Garlic Nan bread. Both were very tasty! Not the best Tikka Masala I ever had, but a little over average I would say. Good prices :) Will definitely go back!", "author": "Kirsti N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-10", "description": "Lived in the area when this place opened...\n\nThis place gets two out of its four stars for the quail masala.  Where else in the inner sunset can you get that? Honestly, though - if I want something else I go to Tasty Curry.", "author": "Audrey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "Faisal has become a good friend, so it's hard for me to be completely impartial, but Curry Village moved in nearby and has really raised the bar.  That said, Tikka Masala is still my general go-to place for Indian in the neighborhood, and for the value it can't be beat!", "author": "Ari M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-06", "description": "I wandered in here on a Monday afternoon just after the lunch rush at about 1:30 pm.  Nobody was in there eating.  I was just going to have a bit of Chappati and/or Naan to go, but then decided let's give this place a try so I sat down and ordered Vegetable Biryani, plus the Naan and Chappati.  \n\nFirst off, the cashier/manager didn't offer me any water.  Even though nobody else was in the place, he seemed preoccupied with a phone call. \n\nNevertheless, I sat down and waited for the food. It arrived quickly. The Chappati and Naan were fresh from the oven hot.  A bit burnt and on the thin side but okay.   The Briyani was not too spicy but the portion was small considering the $6.99 price for one order.\n\nIn fact, most of the prices seemed high on the menu for their dishes.  Especially, considering I could have gone to the Star India place on Geary @ 2nd Ave. and gotten a full all-you-can eat buffet special for $7.97.\n\nSuffice to say service wasn't great but food tasted good.  Granted when you're hungry just about anything you eat tastes good!", "author": "Ed M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-22", "description": "We've ordered from this place 3 times now,and will tell you that tonight was our last time. The first time we ordered a couple of months ago,the food was \"nice\" and it was tasty. Because we don't like our Indian to be too hot,one this one occasion it was mild and edible.\n\nThe last time we ordered - the food was far too spicy for what they said was \"mild.\" We had ordered a few extra  items and after they delivered, we didn't get them.Very disappointing.\n\nTonight - it was,quite literally the shits.\n\nOur \"mild\" food was soo hot,we could barely eat it (in between pounding down liters of water and adding yogurt and sour cream to try to take the spiciness out of our curry) I'm talking tears...our 4 year old daughter had to miss out too,so I was sifting through the pantry to see what was left for her.I'm pissed.\n\nThe papadums were stale and half burnt, the extra order of rice we had ordered did not arrive (again) and the food was extremely average.\n\nMy husband called the manager at one of the other stores who said he \"bagged\" our order and came across as rude,ignorant and not the kind of person who was trying to help the customer. \n\nI'm so pissed I can't tell you - paying money for food that was inedible - the order that was wrong (again) and an incompetent manger on duty.\n\nThis place sucks and we will now be telling all our friends not to order here after our 3 miserable attempts. \n\n(Oh,the one star was for our driver who was polite - this place,in our experiences isn't worth one)", "author": "Monique H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "may not meet fancy people's needs, but the food is consistent and very very good.  we always would go when we were dating (now go for our wedding anniversary) when we lived nearby.  the owners have been the nicest coolest guys for years.  \nthe prices are low, the food is excellently flavored and the portions are great.  if you are there to enjoy amazing food with company you care for, you will be more than happy.", "author": "ed h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "Very impressed with this place! The prices  were super reasonable. Chicken Tikka Masala was about $7.50. I shared it with my wife along with rice for lunch and we were both satisfied. Naan was good. They gave us chai tea for free. The restaurant was clean enough. I will definitely go back. Great for lunch!", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "My husband and I went there for the first time last night.  Being from England, he's very picky about his Indian food.  The food was great, mild for me, spicy for him.  It's small, and not fancy, but who cares when the food is this good!", "author": "Tess H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-15", "description": "This place is definitely more useful as a take out option than dine in.  I went here with my GF to satisfy an overwhelming urge to choke down some naan & lentils and we opted to eat in the establishment.  They were busier than usual and seemed ill prepared for it, there wasn't even glasses of water for us but the owners were nice people and the wife brought out our food fast.  As I mentioned i wanted lentils and it was a nice addition to the spicy vegi rice.  It was a bit awkward when I asked for the check and they gave us milk tea as a parting gift but eh, it was OK.  They wanted to make sure we left happy and that is what matters in this heartless world.  They give you enough good food to make a meal out of it the next day so I would recommend anyone interested to come here for good take out.\n\nCONCLUSION: What the fuck is wrong with me?  The financial world decays your soul.", "author": "ray M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-26", "description": "Cheap food. Love the naan especially the cheese ones. Always love the chicken tikka Marsala. Small joint though so sometimes hard to get a table. One thing I do like is the free chai tea.", "author": "Darren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-17", "description": "I could have given a 5, but needs a little more cleanliness. Food is great for a very reasonable price. \n\nTikka masala, naan are great.  Free Tea.", "author": "Shadow L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "Good. Almost forgot my kabob but offered rice or nan to accompany it since we'd finished everything else. Will come back for sure.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-18", "description": "This is a gem in San Francisco. Cheap and Yummy Indian food with the best naan I have found around. The sizes are on the smaller size but perfect for one person or order a few dishes for more people.", "author": "Melinda Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-06", "description": "99 out of 100 rating from the Board of Health. That's worth something in an indian place.\n\nOK everything i've had here has been REALLY good- but it hasn't knocked my socks off. for that and the high health rating, i give it 4 stars.", "author": "Rich V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-29", "description": "i thought the food was pretty decent here. i would say its a tiny step up from naan n curry down the street. \n\nnow im not an indian cuisines expert, i wouldnt know curry hill from murray hill, or wait, are those the same thing? i digress....\n\nyeah the garlic naan was, well,  garlicy, nice crispy and fluffy garlicy goodness......... i loved their  *WARNING VERY HOT* sauce. just a dab of it and it made all the other sauce have a nice, FLAVORFUL, kick.\n\ni was really surprised with the FLYING HORSE indian beer. very good. id say a mix of korean water (hite) and a lager with actual flavor. \n\nBUT WTF, the water tasted like the funk. STAY AWAY FROM THE WATER..... \n\njust drink the flying horse beer and things will be alright.", "author": "Euge L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-28", "description": "When it's a Tikka Night, it usually means one thing and one thing only: Big test tomorrow.  Yes the classmates and I have had many \"last meals\" here because 1) it's just 3 blocks from the library and 2) chai tea is just the perfect pick-me-up for a long night of studying all things physical therapy, and you get all you want there.  Other than that I don't really see why I'd come here over Naan N Curry.", "author": "William S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "lamb shank (not on menu)\nground beef dish (not on menu)\npotato naan\ncoolest owner ever\nall the cab drivers in the city eat here for a reason\n\n1 star cuz you're too cheap to hit the $25 delivery minimum? thats why you cant trust yelp sometimes", "author": "Wats C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-19", "description": "We happened to stumble upon this place after originally planning to go to Lavash on Irving, but it just so happened to be closed on Mondays. I've been in an Indian/Pakistani kind of mood ever since trying Punjabi Tandoor in SD, so we wanted some good masala. Compared to the other masala I had, the one at this place is just okay. The curry is actually pretty good and reminds me of tomato bisque, but they are pretty stingy with the chicken pieces (I only got like five pieces). And on top of that, the chicken was really really dry. But I did enjoy the samosas, which had two sauces: one was a sweet cranberry like sauce and the other was a mint sauce. The garlic and basil naan didn't have that much extra flavor than the regular naan. The sizes were also a lot smaller than the ones I'm used to. They had free chai tea, but it tasted pretty watered down. If I wanted this quality food for the price I was paying, I probably would have gone to Naan N' Curry a few blocks away. But at least the daal is semi-decent and tasted healthy with the roti.", "author": "Bailey Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-23", "description": "Ordered takeout and the food was horrible. The garlic naan was like white bread with garlic powder sprinkled on top. The samosas were undercooked. The chutney, watery and lacked flavor. The okra was undercooked and chewy. The chicken jalfraze was mediocre but at least edible. Avoid this place if you like actual Indian food, not something worse than a Tasty Bite packet.\n\nThe only saving grace: They were friendly on the phone when we ordered.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "This is for the Judah location - the downtown (Ellis) place is a disgrace. I think I like this place because it seems to be completely disorganized - diners rooting around for silverware, the chai never put out on time, servers have no idea where the orders go. All of it adds up to a kind of endearing chaos. I have always gotten a first-rate meal here.", "author": "George S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-04", "description": "Really all that needs to be said about this place is lack of flavor....", "author": "Srinivas R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-13", "description": "Naan n Curry has nothing on this hole in the wall, its small, cheap, good, fast, and self serve", "author": "Doug D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-19", "description": "mixed results tonight. quail tandoori had great flavor. daal was very bland and very disappointing. I ordered the signature dish chicken tiki masala and it never came. the chicken biyrani was average and the chicken tasted like wood.  still curious about the tikki masala though. let's see what happens on the return visit.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-28", "description": "i can't believe i had to go here again. i don't think i have ever had worse indian food. i'm not even picky, but even naan n' curry was better. i wanted to avoid the chunks of bone and cartilage in the chicken saag so i got chicken tikka masala. almost no meat, floating in oily flavorless sauce. i decided to add rice to soak up some of the watery sauce, but even with a little added texture it was still super bland. and the meat was dry. there are so many good restaurants in inner sunset, never go here.", "author": "Alexa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-15", "description": "Love it! Total hole in the wall which equals super yummy! Love their samosas the most and of course great chicken tikka masala!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-10", "description": "The naan tastes like cardboard.  Last time I ate their I am pretty sure I ate freezer naan from Costco.  Most of the dishes have very little spice.  This place used to be ok, but since they opened up their second location, the food has gone way down hill.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-15", "description": "This place is alright. It's kinda a hole in the wall, near UCSF and isolated from the 9th Ave drag. They have free chai, which is good. The dishes aren't that expensive. I ordered the potato naan. lamb saag and chicken tikka masala. The lamb saag was good - lots of spinach. The chicken was good, but slightly dry and I felt that there was a lot of sauce compared to the amount of chicken. The service is pretty quick and usually it's not that crowded. Will go back.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-29", "description": "From my two experiences eating food from this restaurant, I'd have to say it is pretty mediocre to sub-par for Indian food. The tikka masala sauce is not thick enough so it is like chicken in hot rust colored water. The okra was really mushy and not fresh, even mushier than typical cooked-to-death-but-still-good Indian vegetables. A vindaloo dish lacked...spice. Hello? The servers are friendly though and if you are ever hospitalized at UCSF for two weeks you can get people to smuggle in something for you.", "author": "Jackie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-13", "description": "I enjoyed my meal here. The owner/staff are very friendly and the atmosphere is quiet and unassuming.", "author": "Kathryn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-04", "description": "just had lunch here after a year and was not disappointed.  the chicken vindaloo was well made and the naan was pretty good as well.  the rice was a little off, tho, but with all the spice...i couldn't tell after a couple of bites. \ngreat for a quick lunch in the sunset. \none problem is the people traffic inside. they make u order at the back counter and then sit and eat.  this wouldn't be a problem if the place was bigger than my bedroom, which it isn't.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-18", "description": "This place is no Shalimar, but I don't care what anyone says. When I was interning at UCSF this place would always satisfy me. More than I could say about some boyfriends. Hah!", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-27", "description": "Last night was the first time I've been back to this place after a couple of years. \n\nThe first impression was not good. I ordered a mango lassi. I took a taste and it was both watery without the proper  flavor. I brought it right back to the cashier who brought it out to me and I asked him whether it had been watered down. He told me that they make it with mango juice and milk. I told him that a Lassi is supposed to have yogurt and gave it right back to him. (When this kind of thing happens in an \"ethnic\" restaurant in the U.S., it almost makes me wonder whether aside from the obvious skimping, whether there is a sense of contempt for the diner who they think won't really know the difference.)\n\nI also had the Saag Paneer (Spinach with Cheese Cubes) which was prepared quite well, a very nice balance of flavors. Additionally I had the Garlic & Basil Naan. The dough seemed to be REALLY light....any lighter and it would have floated into the upper atmosphere. Frankly, I prefer some body to it. There was some garlic and the basil used was dried basil.\n\nGiven what they did with the Lassi and the Naan, it makes me wonder if these are economy moves..which I think ultimately will turn out to be false economy.\n\nI think that I would return here if I saw a banner that said \"Under New Management.\"", "author": "Martin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "I love this place - fast, cheap, good food, and good service. The guy at the register usually asks how I am and makes some jokes with me. This place scores sooooo much more over Naan & Curry on Irving - I can't take the line and that grumpy guy at the register anymore.", "author": "Bridget W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-23", "description": "This place rocks.  Try the Bangin Bharta, sp?  It's bangin...", "author": "Meghan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-22", "description": "How this place has gotten so many high scores is beyond me.  The entrees were watery and flavorless.", "author": "Max F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-03", "description": "Indian food delivered tonight was looking bleak.  The three that kept popping up in my hood got bad reviews- consistently bad- but then I found this page.  Decent enough reviews for a try so I ordered.  \n\nThis will be my go-to Indian delivery from now on.  Unfortunately the guy didn't give me a menu- I ordered off their online menu (love those).  He also didn't know the exact total of everything.  But whatevs- the food:  I ordered chicken tikka masala, palak paneer, lamb vindaloo, raita, rice and naan.  I had to order $25 worth- gotta take the good (mostly everything) with the bad (this kind of shit) when living solo.  The chicken was good but the sauce not as creamy as I like.  I think the sauce will be perfect for the prawn masala, which I will order next time.  The paneer was excellent- homemade and it tastes like they fire it in the tandoor.  The palak part was okay.  It was more like chopped greens than the mush I usually like.  Much better tho than the greens water they serve you in India.  The lamb was very tasty.  It could have been hotter- I even asked him to make sure it was spicy, to which he replied, \"Lamb vindaloo is always spicy.\"  I said, \"I know but please make it spicy.\"  The rest was all good as well.  \n\nIt didn't blow my mind but it was SO much better than the Indian I had delivered when I first moved here- I think it was Great India.  Pllooo.\n\nAfter I put my leftovers in the fridge, I saw that I had Kingfisher beer in my fridge.  Totally forgot about it after leaving town for a week.  Awesome.  I feel so whole.", "author": "Staci M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-12", "description": "Not a bad experience, forgot what I had but remember it was tasty!", "author": "Toonces The Driving Cat K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-10", "description": "What the hell happened???? This used to me a decent dive for your Indian/Pakistani cravings, but ever since they got a fancy menu, opened up in the Haight and started delivering it is crap. They used to use quality fish in the Masala, now its crappy cheap fishy tasting tuna. I used to frequent this place every now and again, but I am done. Good Bye Forever Tikka Masala!!!!!!", "author": "Nikki P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "Great food served by very friendly staff. Relaxed environment where you never get rushed to hurry up and eat your food and get out. Generous and very tasty portions at excellent value for dollar.  My family has eaten here many times over the years and we have always been made to feel welcome with our kids. And, they are cool with tweaking the spiciness of the dishes as requested to suit personal preference.  Excellent naan as others have noted, especially good is the onion naan. Some of our favorite dishes are the saag paneer, aloo gobhi, baigan bharta, and their namesake dish, tikka masala.  Personally, I really like the chai because it is good basic brew always hot and plentiful.  As for cleanliness, a paramount concern, we have had no issues over the years.  Hey, the bathrooms are clean too.  So, bottom line, we give it a 2 thumbs up!", "author": "P L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "I don't get why people are hating on this place. It's a nice, little (very clean) hole in the wall restaurant with very good food. The staff is very friendly. They have a 99 health safety rating, so that has to count of something, right? The prices are completely reasonable too.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-17", "description": "Brought an out of town colleague here for lunch after we were done at UCSF. Service was friendly, food was good, convenient hole in the wall to stop in at. I cannot remember the names of the dishes we ordered since we ordered several but the lamb was great.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-10", "description": "Their signiture dish, Chicken Tikka masala was okay, the chicken was dry but the sauce was good. The aloo gobi was better. Naan  could of been a little more favorful. Price was helpful in getting a decent rating.", "author": "Henry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-08", "description": "I walk by this place all the time on my way back from the gym and it's always packed.  Tried it tonight for the first time.  The service sucked horribly (mostly due to one clueless kid) but the food was great and the prices were reasonable.  I'm Indian and am pretty picky but the palak paneer was cooked to perfection and the naan was fresh and yummy.", "author": "Sat Kriya K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "probably one of the most cost-effective reasturants out there. I have not been able to find another cheap indian resturant with their taste of chicken tikka masala. fast, cheap, tasty.", "author": "carmil a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "Love this place.  Soo close to UCSF and the food is both relatively inexpensive and tasty.  The food is fresh and of good quality.  And after my friend told me a really terrible story about Naan n Curry involving yep you guessed it cockroaches, I make this my must pit stop for indian/pakistani food.   The chicken tikka masala is also my favorite, but I haven't been disappointed with any of their dishes.  The atmosphere is extremely casual and pretty clean.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-06", "description": "If you want great Indian food in the Inner Sunset go to Masala at 9th and Irving. If you want cheap and good Indian food come here. If you want cheap, dirty and inedible go to Naan N Curry.", "author": "tess s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-30", "description": "mmm. cozy little hole in the wall. the waiters and who i'm assuming is the owner/cashier.. were all quite funny characters confusing each other if the dishes had been served or not.  lol. serve it yourself with water and utensils.  the tikka masala, basil naan, and a lamb dish i had was deelish! i agree with everyone else - clean and cheap! the downside being it gets a bit crowded.. as i got stuck sitting next to this snooty couple who didn't want to share a table and made faces and started complaining when they had little choice.  .. prompting me and my homegirl to be even more obnoxious and loud and make faces back. haha. it's a small place.. lighten up and enjoy the food!", "author": "ally o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-28", "description": "My favorite Indian restaurant in the city and probably one of the best kept secrets. The chicken tikka masala is very good. The naan is crisp in a way I don't see at most Indian places. You can tell the owners are devoted to making good food. The only reason this place isn't as successful as other Indian joints is because it's located away from the main restaurant drag in the Sunset. It's definitely better than Naan and Curry on Irving Street or any place in the Mission.", "author": "Hmmm W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-06", "description": "Even if the food were not stellar, at least they could have gone for the value market. But for low prices, you get small portions, overcooked chicken, stiff naan, and saag that has been sitting out forever. You get what you pay for.", "author": "A. T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-30", "description": "i came here with my sisters and they heard that the food was good and cheap. but they obviously lied or have not had much Indian food. i cannot say it was entirely bad. the shrimp biryani was delicious and not too spicy. but that was it. the naan (garlic and plain) was horrible! the plain had a doughy texture to it. the garlic and basil only tasted like garlic (maybe i've been spoiled but i prefer the naan with actual garlic and basil bits on them.) i always get the chicken masala at any Pakistani/Indian restaurant and i have never been so disappointed. it was bland and warm. the lamb vindaloo was never a favorite of mine anywhere. so i don't have much a review for that. if i were to try this place again it would only be for the shrimp biryani but i doubt i will be returning to this restaurant in the future.", "author": "Jen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-13", "description": "i came here when they first opened.  service was slow and the guy kept getting orders mixed up etc.  i guess it's understandable since they just opened and couldn't get all the stuff right.  it was decent.  not the greatest.  i think i would walk 3 more blocks to go Naan n Curry where i can sit more comfortably.  this place is SMALL.  i haven't been back for 2 years now... i guess that tells you something.", "author": "Kapo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-16", "description": "i liked this place more than its new owners. completely based on food and prices. the prices have now gone up (something no one likes) and the food is different. when i order my favorite eggplant dish, it is now mostly thick slices of onions!!! i miss it the old way :( i still come here occasionally but not as much as before.", "author": "Raye T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "This is my favorite Indian place in SF.  The spices are really good and the price is decent. My favorite dish here is the lamb anything and the spinach paneer. The bread (especially the garlic one) is tasty.", "author": "sam c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-31", "description": "not a hole in the wall but cozy and open til 10pm on a weeknight - in SF - YEA.  free chai and decent prices.  occasional shady characters", "author": "Emm C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "The Chicken Tikka Masala is the best in the neighborhood, the guy that works the register is about as friendly as you can get (w/o being creepy) at an Indian restaurant.  It's a small place and sometimes you have to ask them for extra cups, etc... but overall, the food is consistently good, the service is consistently friendly, and the location is consistently convenient for those that work at UCSF.  I'm a frequenter of South Asian restaurants since I'm a brown kid that can't really cook, and this food is definitely the best South Asian food in the inner sunset.", "author": "goph s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-29", "description": "The food was great and impossible to beat for the price, however something else dragged it down.  I love eating Indian food and after eating here, I felt like I had near food poisoning for 36 hours.  Bring your pepto bismal, you get what you pay for!", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-18", "description": "I really love this place. We have gone several times and I think the flavors and freshness of the food is better than most other places we have tried in the city. My only complaint is that it is sometimes a little too spicy. My fiance and I are huge fans of spicy foods, but there have been a couple of  times that we were both crying while eating out dinner!!! Once we asked them to make it mild and it came out even spicier...must not have liked our request. Despite, I still love this place and will continue to eat here.", "author": "Lauren D."}
