{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "BEST INDIAN IN SF. \n\nDeconstructed samosas, butter chicken, chicken tiki masala - All to die for!!\n\nWill be back asap.", "author": "Lori N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "This place was amazing!!! We got\n\n- deconstructed samosas\n- butter chicken - incredible \n- saag paneer\n- chana masala\n- bread basket\n- masala lamb racks - cooked perfectly \n- saffron rice\n- chicken biryani\n\nIt was a ton of food for four of us and it was only about $100 with tip!", "author": "Shabnam E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "It was not what I expected after reading reviews. Please note that this review is for appetizers only. \n\nDahi Sev Poori: 2/5 there was minimal chutney and dahi was so thick that I felt I was having curd/yogurt. I know some of you might question that it's DAHI sev poori but I know food when it comes to North Indian.\nPaani poori: 1/5 absolutely no taste in 'paani'\n\nI would not recommend this place for Appetizers!", "author": "Khushdeep M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Amazing Indian food at affordable prices in San Francisco is such a rarity! We ordered he deconstructed samosa, chana bhatura and butter chicken - all 3 were outstanding. \n\nIf you like reasonably spicy food - then go for spicy - it's not indian level spicy - very delicious with the right amount of kick. Not to mention that we had a bottle of wine called elements which was only $20. \n\nAmazing service as well. Sam was very friendly and great with recommendations. Such a great find.", "author": "Eshita S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "I used Grubhub to order take-out from here since it's a 5 minute walk from my house. For $20, I got the chicken tikka masala and 2 garlic naans. The tikka masala as good and the garlic naans were big but didn't blow me away. \n\nGrubhub said it would take 60-70 minutes to be ready for take out, but I called them, and they had it ready for me to pick up in, like, 10 minutes. For that, all the stars!", "author": "Thu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Wow! A friend recommended this place as one of the best Indian spots in SF, so I had to try it out.\n\nHonestly, he was right! The food was incredible, the portions were pretty big, and the prices were great. \n\nEven though I don't particularly enjoy spicy food, my friends got two appetizers and three entrees, all of which I really enjoyed. Because I couldn't help myself, I also ordered a mango lassi (delicious, of course). \n\nWill definitely return, this time with even more of an appetite.", "author": "Manuela R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-27", "description": "Fair enough an ok spot where I can get my butter chicken on. Not the most remarkable place but a-ok. I kinda wanted richer spicier flavors but I guess it's adjusted to fit a bit. I should go back and ask for some more heat.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "While on a trip to San Francisco we were in the mood for a low key but flavorful meal. We found Tilak and were delighted. We came in on a Saturday night- the place was busy but we still got a table. We knew it must be good when we noticed a constant slew of pick up orders coming in and out. \n\nThe wine and beer selection is small but good- most bottles of wine are around $20. \n\nTo start we ordered the Sev Puri Chaat which was what every appetizer should be. They were small, well textured and on a nice and colorful bed of sauce. They even had little crunchy pieces above and below to create some good textures. \n\nFor entrees we had a mix of items- lamb vindaloo (great spicy flavor that kept your mouth tingling but not totally out of commission), lamb Bhuna which was savory and rich- and a green spinach curry that was great and mild as well. The garlic naan had a slightly charred taste that for us added to the flavor but others may not like. \n\nOverall service and food was fantastic and we hope to make a second visit next time we are in town.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "One of my favorite Indian restaurants in the city. \n\nGet Tilak's favorites: butter chicken, biryani, and saag paneer! You don't regret it.", "author": "Karen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Love love love Tilak! My boyfriend and I have been ordering takeout from them since they took over from Spicy Bite and it is definitely an upgrade. Our standard order is the chicken tikka masala, saffron rice, garlic naan, and either saag paneer or okra masala. We have never been disappointed with our order, it always gets delivered within the suggested time frame nice and hot. The only mishap that happens on occasion is that when I order samosas they sometimes forget to include the condiments. However, I don't let that stop me from eating them!", "author": "Cassandra P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "It's been awhile since I really good Indian food! The curries are on the pricier sides but definitely worth a try! \n\nFOOD: \nUpon ordering our food we were give free papadums (crunchy roti looking) with sauces like many other Indian places. We ordered the follow:  \n+ Chicken Biriyani  $13: this was alright. It taste liked Indian rice mixed with herbs and protein. Reminded me of fried rice, but Indian style. \n+ Butter Chicken $14: very smooth, creamy and full of flavor. The chicken was tender and juicy! \n+ Lamb Tikka Masala $14: as creamy and smooth as the butter chicken! Flavors were delicious and lamb were very tender! \n+ Plain Naan $2&Garlic Naan $3: very fluffly and warm! The garlic naan wasn't over powering with garlic.\n\nSERVICE: \nPretty attentive, although my hot water did take some time to come out. The food came out in a reasonable time and servers were friendly. \n\nAMBIANCE: \nThey have a decent amount of tabels that can accommadate large parties probably up to 20 people. Lighting is like many Indian restuarants - a little dim but suits the interior well. \n\nVerdict: I would come back to try their other currys!", "author": "Samantha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Tonight I did a takeout order of:\n\nPaneer Tikka Masala \nSaffron Rice \nPlain Naan \nSamosas \n\nI think that was some of the best paneer tikka masala I've had in SF so far.\n\nThe potato veggie samosa and both green and tamarind chutneys were excellent too. \n\n\nLovely meal, excited to try their other entrees next time.", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Went here last night and had a good experience. Upon entering, we were immediately greeted and seated. We got a cute table in the corner that in hindsight was slightly too small but we made it work.\n\nWe ordered:\n1) Papadums: these were somehow better than at other places, although I'm still not sure what it was that made them better.\n2) Tikka Paneer: This was okay. The sauce was a tad too sweet for me and was missing some of that tang.\n3) Saag Paneer: This was yummy. Rather big pieces of spinach, which is not for everyone.\n4) Garlic naan: Good, not too crispy, not too doughy, the right amount of garlic.\n\nService was really friendly, but as we were sitting in a corner, they did tend to overlook us which required some awkward arm gestures.", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Finally found the best Indian place in the city and one that I truly crave. I am making my way through the menu each visit. Current dish rankings:\n\n1. Butter Chicken\n2. Saag Paneer\n\nBoth are best in their class - the best I've ever had. I feel compelled to get them every time I go.\n\n3. Bengan Bharta\n4. Chicken Tikka Masala\n5. Okra Masala\n6. Fish Pakora\n7. Gobi Mussalam \n8. Mango Lassi\n\nAll of these are great and I would love to get them again.\n\n9. Lamb Bhuna\n10. Chicken Chettinad\n11. Chicken Vindaloo\n\nDidn't love these three. Both of the chicken dishes had too much cardamom for my taste (and I like cardamom).\n\nNotes:\n- The portion sizes are huge. Each dish is more than enough for one person. Last time I went with my boyfriend we got three dishes and ended up with 1.5 leftover meals each.\n- I like spicy food and get 'Extra Spicy' here. It's not too hot. However, 'Spicy' will be too much if you don't like spicy food.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "I was lucky enough to try Tilak's food before he opened his own restaurant. He has always made great food. \n\nThe new menu features some of Tilak's best stuff! If you're a fan of meat, you'll find some amazing things here!\n\nIf you're vegetarian, try the channa masala, it's good and doesn't taste over spiced. \n\nGo for dinner, it's often a little busy but the wait is only 5-10 minutes. \n\n\nTilak also catered for our wedding. There were two things people loved at the wedding, samosas and lamb kebabs! The chai was phenomenal as well, my favorite! It made a rainy wedding so much better!", "author": "Muhammad U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "My bf identifies as Indian and this is his fav spot in SF. The spice is right (you can order spicy or extra) and service is tight. Portions are generous. Not very busy yet but it will be soon.\n\nTikka, butter chicken and cauliflower dishes are great but anything you choose will be great.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "I come from a Canadian city called 'Brampton', which has amazing, authentic, affordable Indian cuisine at almost every corner. Unfortunately, Indian restaurants in SF are rarely amazing, authentic and affordable, all at the same time.\n\nThankfully, a friend took me to Tilak recently and I think it's the closest I've come to being satisfied across all 3 metrics for an Indian restaurant in the city. \n\nSeating:\nI came here during a typical weekend evening with 2 other friends and we were seated right away. That being said, I wouldn't come here with too large a group though because it is a pretty small joint.\n\nFood:\nWe got all 3 of their 'Chaat' starters and still had plenty of room for the main course, partly because the portion sizes weren't huge and partly because we were really hungry - each chaat was really, really good though. For the main course, we got the Vegetable Korma and the Butter Chicken, with garlic and plain naans. The korma was pretty meh but the butter chicken was probably the best in the city I've had so far and the naans were also pretty much perfect in texture and taste. \n\nTheir menu may not be as large as those of other Indian restaurants I've been to in SF, but the items on it seemed much more unique and varied compared to the other places, which always seem to have the same standard dishes. Quality over quantity, right?  :P\n\nPrice:\nFor the amount of food we got, the bill was quite reasonable, even by SF standards.\n\nBonus:\nMy friend had never seen a 'tandoor' before, (the traditional clay oven naans are made in), so I asked if we could get a glimpse and the staff were kind enough to escort us into the kitchen and give us a peek.  :)", "author": "Sahil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "This is high stakes but, my partner and I love everything about Tilak's food and think his restaurant is the best $$ Indian food we've had in the States, period. We come here with family, friends, and anyone who wants to eat really. \n\nEvery dish consistently tastes the same and most reminiscent of what I grew up with in India (so, the kind of food that makes you teary eyed and smile through every bite). The food is always out on time and he has a wide variety. \n\nWe always get the prawn biryani (it's spicy), dahi Chaat Puri, lassi, chai, and tandoori chicken. \n\nOn my partner's birthday (because of how much my partner loves this restaurant) I asked to meet the man behind the food. He obliged to take a photo with us. Such a down-to-earth and talented guy! I wish him great success and hope he gets to tell his story and grow his restaurant soon.", "author": "Esther D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "We came here early on a Saturday night and had a good meal.  Some dishes were better than others, the service was good, and the setting was pleasant.\n\nMy husband and I shared the following items (in full disclosure, this was enough food for about 6 people - we had plenty of leftovers we took home):\n\n1) Dahi papdi chaat - delicious, filling, and rich\n2) Chili chicken - average (would not get again)\n3) Daal tadka - simple and tasty\n4) Began bhartha - excellent \n5) Chicken chettinad - too rich for our tastes\n6) Tandoori roti - good\n\nThe food came out quickly, and they did a good job of staggering the items.  The staff was friendly and prompt.\n\nThe space is clean, modern, bright, and welcoming.\n\nOverall, this a great low-key spot for flavorful Indian food!  We are excited Tilak has opened in our neighborhood and look forward to returning.", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Excellent food. Much better than any other Indian places in the neighborhood (and there are many). I recommend the Chana Masala and the Saag Paneer.", "author": "scott K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "I'm giving Tilak 5 stars because this is the best Indian food I've ever had in a restaurant! In all fairness, I haven't been to many establishments for Indian food. We usually order it for delivery on Sunday evenings. But I wanted to get out and he wanted Indian so we ended up here.\n\nWe had the deep fried dumplings, butter chicken and chicken saag with garlic naan.\n\nThe dumpings were great! I forget what they're called, but they came with dipping sauces and were a wonderful way to start the meal.\n\nButter Chicken was amazing. It was our favorite thing on the menu. Super creamy and flavorful.\n\nChicken saag was too \"healthy\" for the bf. It wasn't that normal creamy, blended spinach sauce you normally get. It was sauteed whole leaf spinach instead. We liked it, but it was definitely different.  \n\nThe garlic naan was a more crispy version that we are used to. It wasn't that fluffy gooyness you usually get. I liked it, but it was a bit small and crisp for my taste.\n\nWe came here at 7:30 on a Friday and there was no wait. We will be back...probably often!", "author": "Avery H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "I've been here twice.  Last night, I got:\n\nsome chaat (aloo?) appetizer\nCTM (chicken tikka masala)\nChicken Biryani\nLamb (forget the name -- basically, roasted)\n\nEverything was delicious.  BUT.  BUT.  BUT.  The Chicken Biryani was the BEST I HAVE EVER HAD.  I MEAN WOW.\n\nok, enough with the all-caps.  I cannot recommend this place enough, if only for the biryani.  But heck, everything else was *delicious*.\n\nBut the biryani .......", "author": "Chet M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Great indian food and not very expensive. Ordered two chais, pani puri chaat, bread basket, chicken tikka masala and gobi all for $40ish bucks. We asked for the chicken and gobi spicy but didn't really come out that spicy but they were happy to remake it to our liking. They even bought out some rice with it. Naan was great and came out plentiful (garlic is prolly the best for me). The chaat was good but I felt I've had some better. The place is great, cheap and the service is awesome. Stop by and give them a shot!", "author": "Navdeep D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Just had an order delivered for dinner. Lamb vindaloo, chicken tikka masala, and butter chicken. The butter chicken was so creamy; and the lamb was tender and delicious.\n\nThe naan was still hot when it got to my door. \n\nAbsolute comfort food at its finest. \n\nThe order initially came to my door without the chicken tikka masala. I called the restaurant and within 20 minutes they made it right with another delivery. They actually went above and beyond making it right. \n\nIt is so refreshing to know there are still restaurants out there who really care about their guests. Did I mention the garlic naan? Soooooo gooood...", "author": "Zach P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "The food here is amazing and the owner is so kind to our family every time we come in. This is by far our favorite Indian restaurant for a few reasons. Firstly, you can actually order food as mild as you want -- even not spicy -- which makes it possible even for a child to eat if you so desire. Secondly the vegetarian options are plentiful and delicious, slightly unique takes on classic dishes. I highly recommend the mussalam gobi and any of the spinach dishes. They have a lot of rice selection including brown rice, which is rare at Indian restaurants. I like how healthy of a meal you can order though they could still use less oil in dishes like the okra (which I recommend as well anyway). The mango lassi is outstanding and made fresh. \n\nI wish they were open for lunch and delivered a bit farther away and we'd order even more!", "author": "B C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Excellent quality delivery Indian food. We ordered lamb korma--tender lamb in a sweet, well-spiced, rich sauce. In addition, we had the chicken tikka masala. The tikka masala had a dense sauce swimming with nigella seeds--it was great. The standard daal was tasty and perfect to sop up with the chewy, nicely charred naan. The delivery guy was friendly and courteous.\n\nWe are SO ordering from here again.", "author": "Christina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Heads down my favorite Indian restaurant in the city. Everything I've tried here is full with diverse flavors and  you taste quality with every bite. Usually I'm not a huge fan of fish or seafood in Indian cuisine, but Tilak has absolutely changed my opinion in that regard. If it's your first time here, try chicken korma, okra masala, garlic naan and fish pakoras.", "author": "Maria V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "I was worried when Spicy Bite changed hands, because it was my go-to for Indian food delivery, especially when hosting my book club or otherwise providing food for a bunch of people. So I'm pleased to report that Tilak still gets 5 stars from me! We've ordered from them twice since the ownership change and it's still the best Indian food in this part of San Francisco, with a ton of veggie options and on-time delivery (you can also order online during the day and specify the time of delivery later in the evening, which is great for events). I usually post photos with my reviews, but this food always gets devoured so quickly, I never get the chance!", "author": "Gaelen X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "This was delicious. Better than its predecessor. Flavors were reminiscent of Indian food in London.\n\nButter chicken, daal tadka, and brown rice (w lots of glorious ghee) were phenomenal. Great flavors, thick luxurious textures. Best Indian I've had in a long while! \n\nPS: with Zantes and the Himalayan place on the same block, it's almost like a little South Asia in that hood.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Got Tilak catered at the office for lunch. Best indian food I've ever had in my life. Their butter chicken/fish is so rich and creamy while not being overwhelming. Absolute perfection. 11/10.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "I absolutely loved this place, you should absolutely try their chaat dishes and chole bature. Hostess was good and helped us with the menu. I will surely visit this place again for few more dishes.", "author": "Pari B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Came by a couple weeks ago to check out the change in ownership/name at this neighborhood Indian spot.  The meal started off with a crispy, flavorful uttapam which was good. My husband and I then tried three dishes - a chicken curry dish, saag paneer and 2 kinds of naan.  The chicken curry dish was really flavorful and unique (I think maybe it was called Chili Chicken) and the chicken pieces were super moist.  The saag paneer was great - saag paneer is usually too oily for my taste, but this was super flavorful, yet not too oily and the right amount of slight hint of cream.  The naan was super fluffy and fresh.  The staff was very friendly and welcoming. Really looking forward to coming back here to try the Biryani and Goan seafood curries next time.\n\n2nd visit update:  Got the Bengan Bharta, Butter Chicken and the small plate - chickpeas and fried fluffy bread (name?).  All were amazing.  Butter chicken is maybe the best I've ever had.  He basically takes tandoori chicken thighs and then stews it in the sauce so the combo is super flavorful and juicy.", "author": "Olivia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Great food, friendly staff, best mango lassi outside India/Nepal. We are stoked it opened in our neighborhood!", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "Checked Tilak out for a weeknight meal, and it was great! Particularly loved the Veg Biryani and Paneer tikka masala. Sev puri was very good as well.\n\nThey had marked out Chole bhature as a star dish and I love that so I am def going back soon to try it.\n\nGreat taste, reasonable prices, friendly service!", "author": "Anju J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "Feeling compelled to write a review, the food here was so bad. First, let me say that this place was formerly known as Spicy Bite. Had we known that, we wouldn't have come (back). It's only when we got there that we realized we had been there a few years before, under the former name. Thinking it may be under new management, we decided to give it a (second) chance. \n\nThe rating here is just for the food, not the ambiance or service. They were fine. Food was horrible. Some of the food was undercooked, the chaats were too sweet, the bhatura was too thick, and the food was completely unauthentic. We know good Indian food, having grown up with various regional Indian cuisines. This place is a true disappointment, especially given all the positive reviews!", "author": "Manisha K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "Average Indian food.  Small place. No ambiance.\n\nHad the fish pakora and Veg kebab for starters.   Kebab are not kebabs but just roasted vegetables.\n\nDal, saag and shrimp for main course.\nNothing special on each of the dishes. \n\nQuick service.", "author": "Sanjay Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Really good Indian food\n\n1) Their chai is on point and cheaper than most places\n2) They give you free papad\n3) Their menu items include rice! FUCK YEAH. \n\nService is a bit slow sometimes but they're food is good and prices are delicious. \n\nThey also some legit Dhai Puri (though they use a different lentil that I would use)", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Ok! The search is over!!!!! By far the best Indian food I've had in the 20 years I've been searching here in San Francisco. I had take out!!!!!\n\nI was alone and rainy. I am searching for a soul food to emotional eat in front of my big screen tv. Ok, I'm a single mom and I never get these moments. \n\nI yelped and it's 5 minutes away. I figured it would be quick. It wasn't, it took exactly an hour. And....... it was piping hot!!!! First bite in the butter chicken, Oiy! Love at first bite, and I kept eating. Then I'm on my saag paneer, whoa!!! Hold back the Naan. Uh mazing. I'm dipping and dipping with my Naan. At this point I almost forgot I have this hollow, ball thing with crunchy and flowers. I'm kinda full at this point but hey, it's crunchy better get to it before it goes soggy. Nope! It's like the best thing that ever enters my mouth. With the 3 different sauces drizzle around it. Oh lord! It was till eye good!!!  I still have the lamb Bahraini but I can't do it. I'm sure it's good!!!  But let's end on a good note!!", "author": "germaine n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "I'm so glad I found this place. It's the only place (except Keeva) in the Bay Area that I've found authentic Indian food. The butter chicken is exactly like the butter chicken back home (Bombay). The chaat is also good. Their biryani is pretty good as well except I found it too have too much Whole spices. We've been going there or ordering in every week for about 2 months since we found the place and I'm so glad we did.", "author": "Akanksha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Really good quality Indian food with fast take out service (usually within 20 min). Favorite dishes include Goan shrimp curry, tandoori chicken, baigan bharta and saag paneer. They use real fresh spinach instead of mushed frozen ones you usually get!\n\nEverything seems fresh, and aromatic. Good spice level as well. I've never eaten in the restaurant, but it seems spacious and cozy enough.", "author": "Viv C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "We have been here when it was Spicy Bite, and it was good.  Came here after Chef Tilak took over and it went up several notches.  Now after many visits, we can't come here enough!!  Each dish is well balanced with flavors, and easily tailored to your desired level of spiciness!  \n\nWorking our way through the menu, and not a bad dish yet!  A great place to be a regular!  Only downside is everyone else is finding out!  Nearly didn't get a table on a Wednesday!  \n\nYum! Yum!! Yum!!!", "author": "Todd M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Absolutely love Tilak. By far the best Indian food I've tasted in this price range and we keep ordering over and over again. It beats any of the other established Mission joints. Personal favorites:\nDaal Tadka\nChicken Butter Masala\nChicken Chettinaad\nChicken Kadai\nChana Saag\nOkra Masala\nBhuna Lamb\nBiryani\nLemon Rice\n\nHighly recommend this place!!", "author": "Kris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "As a Biryani Connoisseur this spots ticks all the right boxes. \n\nTheir Takeout Chicken Biryani is reasonably priced, well spiced, Meat is juicy and not just a oil tanker. Great dish overall. Good Job Tilak!\n\nWe also got the Chicken Karahi and was okay. Not the greatest but will fill the tummy in a non reactive way. \n\nI'm glad I found this spot and will be coming back", "author": "Ashok R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "So much for losing a few pounds this year. After I discovered this spot it's gone into heavy rotation, especially during cold weather. \n\nHere is what I've had so far: \nButter chicken: 5 stars. They use tandoori chicken (you can see the grill marks/color) instead of plain chicken - genius. \nFish tikka masala: 5 stars. I think the fish is likely fried? Either way you won't be wishing it was chicken- the texture is light and a good match for the sauce. \nGoan Shrimp: 4 stars. Delicious sauce, lots of underlying shrimp flavor, a little lighter and more tomato-y than the masala sauce. Sadly, the shrimp was a little overcooked, but that was the only sad part. \nVeggie Korma: 3 stars. When I first tried this dish a year ago it was flavorful, creamy and delicious. The last couple of times I ordered it,though, it was like they totally forgot the curry/spices - when I got it for takeout, I literally dumped in some curry powder to fix it. \nSaag Paneer: 4 stars. Tasty but this also had tomato, and I usually prefer mine without. \nPaneer Tikka Masala: 4 stars. I like my paneer in smaller, softer cubes.. but that was my only complaint. Sauce was delicious.\n\nThe restaurant itself is clean and bright but not a destination, so I usually get delivery/takeout. Also, parking in the area is so-so -- it's far enough away from Pizza Hacker/ Iron and Gold part of Mission for there to be a *bit* more street parking, but like everywhere in Bernal, you might have to drive around a bit.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Probably the best Indian food I've had in San Francisco. \n\nThe butter chicken is remarkably creamy and rich. Though basic, it is definitely worth getting!", "author": "Cory D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "One of my new favorite Indian restaurants in sf. Food was clean and different from other similar restaurants in the city. I'll def be back to eat Mo food", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Try all of \"Tilaks favorites\"! The food is INCREDIBLE and reasonably priced! It's my favorite Indian spot in the city. Plus they do delivery (goodbye diet). My favorites are the Saag Paneer, Butter Chicken and samosas. Oh and the garlic naan. Always get the naan. You also have to get a drink (or two). Mango Laasi and Chai", "author": "Jamie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-11", "description": "We've been to Tilak twice and ordered take-out once. Although we love the aloo tikka chaat bites at Tilak, the other dishes lacked pizazz and spice. Also, the tadka dal was more like a grainy mush than anything resembling lentils. Overall, we prefer Pakwan. Pakwan's naan is also tastier. That said, the service is more friendly at Tilak than at Pakwan. And the overall restaurant experience at Tilak is more enjoyable than at Pakwan.", "author": "Jill H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "This is the best Indian I have had in a LONG time. The Chaat was amazing and the lamb biryani was so delicious. The lamb was tender, juicy, and had so much flavor. The service was great.", "author": "Kristin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Ordered take out. It was hot, fresh, and delicious! Even a couple nights later as leftover it was awesome. Definitely the best quality ingredients I've had doing delivery. Will definitely re-order. \n\nWe had:\n-veggie biryani - floral and delicious\n- butter chicken - rich flavorful and tender chicken \n- saag paneer - delicately cooked. Not just mush. Great cheese cubes.  \n- eggplant (forgot the name) - not heavy or oily just pure yum!\n\nHighly recommend", "author": "Shanee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "A really great neighborhood spot with attentive service and excellent food. I will be dreaming about the sev puri chaat until next time!", "author": "Ang T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Our go-to spot if we decide not to cook. Food tastes consistently good. You cant go bad with okra masala, naan, biryani. Parking around the place can be tricky at times if you are picking up food.", "author": "Hari N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Tilak's is one of the best kept secrets in SF! Hands down the best Indian food in town. Everything is great but if you're a first timer order the Butter Chicken!", "author": "Tymn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "I was very sad to see Spicy Bite had closed as it was my go-to delivery spot but it has been replaced by an even better Indian restaurant. I really like the new menu and the food is much fresher and less oily. I get the typical stuff (chicken tikka, aloo gobi) but the sauce is better than most places in the area and they also deliver. Although I can't speak about a dine-in experience, I definitely recommend the delivery.", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "I consider this one of the better Indian places I have eaten at in this price point.  The Sag paneer is hands down the best I have ever had with thick leaves of spinach and not a puree like so many other places.  Very nice service as well.", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Fantastic food, excellent service, authentic flavors. The dahi puri was brilliant; easily the best dahi puri I've eaten all my life! Five stars for delicious vegetarian options that are not just paneer and cream based. The gobi mussallam was bursting with flavors and was so well-made. The naan was soft and pillowy, and the vegetable pakoras, while a little low on salt, were crunchy and savory. Can't wait to come back and try their chole bature, biryani, and aloo tikki chaat.", "author": "Divya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Best butter chicken and bhattura. This is some of the best Indian food I've ever had, and I've had a lot of it. My friends all rave about this place and I'm so glad I got to try it. I'll be back over and over again!", "author": "Alias A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Best Paneer tikka masala I've had! Their fried wontons are delicious! And the butter chicken is equally amazing!!! Best find in SF!", "author": "Katheryne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "We loved it all really! We ordered the butter chicken, lamb rice, deconstructed samosa - all really amazing. I would likely recommend this place for some really good, clean food!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Food is so good! This is our new Friday night Indian food restaurant. Great value, good location, and the chef/owner Tilak is such a great person. Make sure to get his recommendations!", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "The service was friendly and professional amongst the busy Saturday night rush, with many takeout orders competing for space in the frying pan. The Mrs and I would highly recommend the chicken saag and the Tika chicken, and the daal which had a super rich flavor!! Water glasses were kept full. Spice was just right (you can specify desired spiciness). Only slight would be a touch long from order placement to food ready... but it was Saturday night at dinner time so I'm being picky... thanks for a great meal.", "author": "Patrick O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Friendly staff and great food! We had veggie vindaloo and saag paneer, and the food had a homemade quality to it, with all the ingredients really shining through. Paneer was very fresh as well.\n\nWill be coming back here often!", "author": "jacob l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Extremely good food! We tried the Sev Puri, Chole Bhatura and Veg. Biryani. The food was fresh and served piping hot. Given we have an Indian palette, we requested for the food to be Indian spicy and they nailed it. \n\nTilak is easily better than 95% of Indian restaurants in SF and we are sure most of the things served here will be pretty good. We weren't blown away by the ambience or anything else so saving the 5th star for the future.", "author": "Pushkar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I usually don't even put reviews but this place is really really nice!!!!\nI think the butter chicken is the best I tried in the city and everything in there starter menu is awesome\nI specially recommend all items in the chaat menu", "author": "Ganesh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Great food, even greater prices. Would definitely frequent this spot a lot more!! \n\nA must try: aloo tikka + Channa & Sev Puri!!!!", "author": "Harini V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Tilak is a world class chef with a heart of gold. You'll immediately feel welcomed once you walk in the door, and once you taste your food, you'll never want to leave. \n\nI'd love to recommend a favorite dish, but I've loved everything I've tried so it's a tough call. You pretty much can't go wrong!", "author": "Ken S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Delicious and friendly. Wonderful flavors. We got food to go and it was fantastic. Can't wait to do this again. Thank you!", "author": "M.E. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "A little out of the way but definitely worth the trip. The head chef and owner is extremely friendly and cooks up amazing Indian dishes. My friend and I ordered 1 appetizer, 2 entrees and a bread basket (a variety of naan). The dishes look small but don't let it fool you, it was more food than we thought we could have. My personal favorite was the Saag Paneer. There was ample amounts of paneer and very flavorful saag. The flavors were not overpowering or too strong. The other dishes were just as amazing (just got a soft spot for saag paneer). I would say this place is better than Pakwan especially at the price point Tilak serves them at. I would highly recommend commend this place to anyone wanting a delicious serving of authentic Indian food.", "author": "Davy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I had lunch there the other day with my friend and was utterly blown away by the awesome service, super fresh authentic food and clean environment.  Thank you!!!", "author": "C T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "The service is amazing. From the second we walked in to the very end. I am a very picky eater and can not handle spice very well. I love flavor though. The staff was so accomidating and I was able to eat every dish with no spiciness. It still tasted amazing!!! We had the 2 dishes as well as the samosas. The staff doubled checked on me to make sure I was ok and enjoying it. I love the place so much and will come back.", "author": "sara c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "The food is delicious and definitely not the typical offering menu you see from Indian places in SF.", "author": "Bernardette A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Really tasty! We had the butter chicken, saag paneer, and lamb rack. Each element was solid.", "author": "Matthew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "This really felt like as good as it can get! Being from India we are always looking for places which can match our Indian taste. This place certainly won our hearts. The food wasn't just Indian but felt quite authentic North Indian. I loved the Chole Bhature, Dahi Papadi Chat, Deconstructed Samosa. The curries were properly cooked unlike some restaurants. The service was pretty good and the people had a warm smile always. \nWould definitely go again!", "author": "Shashank D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "Not sure why Yelp took down my previous review, but I'll post a new one and keep it shorter this time around. \n\nTilak is absolutely my favorite Indian restaurant -- The butter chicken was flavorful and balanced, without the heavy slick of grease that so often plagues the dish elsewhere. The naan was a far cry from the flaccid stuff I'd encountered at other places: crisp on the outside, fluffy on the inside, and smothered with nubs of garlicky goodness. The biryani was perfect: great grain separation and studded with bits of flavor -- slivers of almond, fried shallots, bites of tender meat.\n\nThis is the quintessential neighborhood restaurant, the type of place that I'd go to every week if I lived in the area -- except I don't live anywhere near the area, and I'm still going almost every week.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Their Butter Chicken is the best I've ever had. My Indian friends agree, it's a dish you'll crave weeks later. Everything else is good too, fast service.", "author": "Tatyana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "The food is outstanding! Top notch Indian for the city ... The actual restaurant is very humble, and not inspired in any way ... Excellent choice for take-out or a casual meal with no expectations of amiance - just great food.", "author": "Alexandre P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "Was once known as Spicy Bite, it's okay. The food seems to depend on what you get here. I was not a fan of the saag/palak paneer... but the paneer tikka masala is not bad. The samosas are pretty good too.", "author": "Avani G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I can't accurately say Tilak makes the best Indian food in San Francisco, since I haven't eaten in every Indian restaurant in the city, but I can say it's the best Indian food I've had in San Francisco.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "Really great take-out!!! All our food was delicious and actually spicy when I asked for \"medium\" heat. Sometimes places will give you mild when you ask for medium spice. Would totally recommend!!", "author": "Malalay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "So - this place has some of the best Indian food I've had in a while in SF. It's a quite neighborly place and does not have the airs (or the price) of the fancy new Indian food restaurants in SF but has a ton going for it, starting from\nchef Tilka (who is there to check in on you). \n\nI had chole Bhature - the chole were just perfectly cooked and not too spicy, the bhature were fluffy, and with the fermented tang that makes them perfect. \n\nThe baigan bharta is hard to make well, and here too the kitchen did a pretty awesome job. \n\nI am looking forward to many more meals there!!", "author": "Akshay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Tilak felt like a happy accident: I'd been looking forward to a Peruvian restaurant that the BF changed his mind about at the last minute, so was dragged to Tilak grumpily and reluctantly, late on a Saturday night. (BF insists 99.9 percent of the time on dining out in Indian restaurants, so I wasn't exactly excited about visiting another one; they tend to be heavy on starches and cooked-into-oblivion veggies, and sadly short on bright, fresh, salad-y, non-gloppy dishes.) But upon arriving at Tilak nearly at closing time during the holidays, the staff could not have been nicer, more accommodating, or more efficient in preparing and serving our order; and the food was absolutely delicious, and beautifully presented. It seriously blew us away. \n\nWe ordered the wonderfully flavorful Himalayan-spiced ahi, which was seared lightly and plated over a delicate chickpea puree and a few perfectly grilled and seasoned veggies (in this case, tiny carrots, zucchini chunks, and mushrooms). The saag chicken (prepared with thigh meat, which we prefer) was also tender and delicious, and included spinach that was still recognizable as a leafy green. We loved the tomato-y okra as well, and BF said that both the naan and the basmati rice met his persnickety standards. (The only suggestion I might have would be to add one lively [if inauthentic] salad, or a sauteed-but-not-saucy-or-squishy veggie side dish to the menu, for the crunchy types among us.) Thank you for a lovely dinner, Tilack!", "author": "Lori L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "Tilak is great!  I've ordered from them two or three times now and am a huge fan of their Paneer Tikka Masala -- I'm a vegetarian obsessed with Tikka Masala sauce, and am often disappointed to find that an Indian restaurant only offers Tikka Masala with a meat.  I give this place four stars out of five solely because it's rather pricey when you order for delivery with Yelp.  That said, if you get naan and/or samosas, you'll have more than enough food to last you two meals.", "author": "Aisha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Best Indian restaurant I've had in Bernal! Their Chana saag is incredible. I do wish they had more appetizer options.", "author": "Jacqwi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Worth the journey to Bernal -- incredible indian food! I was with a big group and we ordered the saag paneer and butter chicken (Chef Tilak's signature) as well as the naan and biryani. Do your stomach a favor and come visit!! Thank you Chef Tilak for an AWESOME meal!!!!", "author": "Lee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "I'm usually skeptical of neon signs in the front window but I looked passed my petty nitpicks and we came in boy were we blown away- everything was so succulent and flavorful. We got the chili chicken app- very plentiful portion. For entrees we shared lamb bhuna which was curry based and the standard chicken tikka masala but both were cooked to perfection.  The accoutrements being naan and sapphire rice both hit the spot as well. Will absolutely be back. Highly recommend for anyone looking for awesome Indian food.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "Pretty good for an Indian place within city limits. If you don't want to leave SF and want good curry get it here, and if you're lucky enough to get delivery (I'm a couple miles out of range), definitely get it in a cold day.", "author": "Kartik S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Hands down the best Indian food food in town. I'm a regular and order the butter chicken, saag paneer, lentils, and garlic naan. All absolute perfection. It's truly an authentic place. The food comes out piping hot, in extremely generous portions, and quality everything -- from the tender, marinated chicken, to the generous amount of and perfectly cooked spinach in saag paneer, and the hearty and warm lentils. Not only is the food an A+ but the owner Tilak is a real legend (along with his staff). He is the most genuine and has an amazing story of cooking in various countries and owning restaurants. He knows his food and it shows. A MUST try. Thanks Tilak!!", "author": "Penny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Awesome Indian spot! Went here tonight w/ friends and can't say enough positive things about this place. The food was delicious (a special shout out for yummy samosas, butter chicken, and chickpeas w/ fried bread). The service was wonderful and efficient. We will be back!", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Everything we ate was absolutely delicious. Some of the best Indian food I've ever had. The chicken tikka masala was awesome and the chicken Chile appetizer was delicious. Lamb Bhuhar (definitely butchering the spelling but It was the 1st item under the Lamb section) was really great. Highly recommend if you're in the mood for Indian.", "author": "Evan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "Solid 4 stars with a future option to upgrade to 5.\n\nOrdered the daal soup and the tandoori salmon. They bring a complementary slice of pakora with a slightly spicy and a sweet dip; pretty standard.\n\nThey asked me how spicy I wanted my food and I said medium. This turned out to apply to the daal, which had a nice underburn. Satisfying and warming.\n\nThe standout dish was the tandoori salmon. Served skin-on with some attention to presentation, it was advertised to come with \"seasonal vegetables\" which turned out to just be some red onion. That said, it was excellent (including the onion, which tasted slightly sweet). The salmon was tender and cooked through, and there was a nice crisp to the skin. This is not your neon pink tandoori dish; the skin was natural.\n\nI would totally eat here again.\n\nService was pleasant; they gave me a couple options for seating, they refilled my water, they asked how I liked the food.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Tilak's restaurant serves amazing Indian food. Highly recommend the lamb and butter-chicken. This is definitely a restaurant which will be in my regular rotation. Highly recommended!", "author": "Bryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Best Indian food in SF. \n\nTilak hits it out of the park on the details: saffron rice has real saffron in it, saag uses fresh local spinach, garlic naan is aromatic.\n\nFor the super reasonable price, you can't do better than this place.", "author": "Rikav C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-01", "description": "I finally confirmed my Yelp account just to write this review. Do NOT go here if you have any food allergies or sensitivities. While the Saag Chicken was decent, I asked whether the Saag contained any dairy. I was told that it did not. Days later, my joints hurt (as they do when I consume dairy) and I decided I would call the restaurant to ask if it did contain dairy, just in case. Lo and behold, it did. Tilak, please make sure your servers are better informed as to what is contained in dishes. I like a good meal that leaves me thinking about it afterward, but not because I'm in physical pain. I would have returned again if the restaurant was more responsible with informing patrons about the ingredients used in the food.", "author": "Evelyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "The food is exceptional. Ordered the Himalayan ahi tuna, okra masala, and lemon rice. The ahi was seared to perfection, delicately flavored, and the lemon cilantro dressing was wonderfully creamy and added a touch of elegance to the dish. The okra masala was well balanced, delicious, and the okra was tender and not over cooked. Don't know where to start with the lemon rice you must simply try it, certain it would go well with just about every entree. Last but not least, the tamarind and mint chutneys are hands down the best in the city. The staff is great. There was a mix up and my order went though as pickup instead of delivery but they took mercy on me and sent someone over with my meal. Will definitely take a trip to Bernal to enjoy the food on site.", "author": "Rabiah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Tilak's place is awesome. The butter chicken and saang paneer were a cut above every other place I've tried. I wish this was closer to the city, but...given the prices (oddly affordable in a city that delights in raising the prices), I really can't complain.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "This is the best Indian food in the city! Such a great new place in the neighborhood.", "author": "Erik G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Best Indian food we have had in San Francisco. Recommend the deconstructed Samoosa, Butter chicken & Saag paneer. Reasonable prices, only $20 for a bottle of wine, and great service. We met the owner, Tilak, when we were there and it's clear that he cares about the quality of the produce, experience of his guests and his impact in the local community.", "author": "Kerry-Ann C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "my car has broke down. I used the time waiting for my insurance to reach out to this restaurant. Great food. Really had a nice North Indian food in USA after a long time", "author": "Prabu M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "This is my favorite Indian restaurant in San Francisco.  And possibly anywhere.  The food here is delicious. I will definitely be coming back.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-19", "description": "Meh...so-so. I'd read great reviews about take out and delivery but was disappointed. Food was not very spicey (even though that's what we requested.) Overall food was ok but not great.", "author": "Mary F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "One of my go to spots for Indian delivery or pickup. The Dal soup and Veggie Tikka Masala are my favorites! It's so good there is no need for Chicken. If you're looking for poultry the Chicken Tikka Masala and Tandoori Chicken Tikka are delicious too! We've eaten inside as well in an attempt to beat the long delivery wait and it was faster. Service inside could have been better, but the food keeps it at 5 stars. Every time has been easily delicious.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "They have chaat! Other dishes also delicious. Service was courteous and attentive. Daal soup had a great kick and rich texture.", "author": "Gary O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-19", "description": "Changed ownership and removed many items from online menu requiring a phone call to order these items...like papadum... but their phones are always busy so you cannot call to update an order.  They would make larger sales if they add those items back to the online menu,", "author": "thomas k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "This is by far the best Indian restaurant in the price range. The food is fresh and home style. Props for actually roasting and hand blending the Baingan Bharta. The okra masala was fresh and had a really nice flavor from the caramelized onions. The butter chicken was quite delicious as well. Nice chunks of chicken thigh meat. I love that they are being honest & true to the cuisine. They seem a bit overwhelmed by their popularity, but the wait for the food was easily worth it. Now I can only hope that it doesn't get overrun by hipsters.", "author": "N M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "This place is so yummy.  Got the lamb biriyani.  The rice was filled with yummy friend shallots which I love and the lamb was so tender.  Also highly recommend the butter chicken which had a tasty sauce but the chicken itself was also cooked well and had this nice roasted flavor.  Would definitely go back.", "author": "Vicki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "We order from this place at least once a week, they always deliver early and the food is always excellent", "author": "Andy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Had a very nice meal at Tilak tonight.  The food is really delicious - especially the Chaats, and it's a great value.  $42 for two people and we had enough to take home for another dinner.", "author": "Max J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Delicious food. Kept saying \"mm\" after each bite. Had the masala baingan bharta and tadka Dahl. Excellent. Arrived earlier than expected. Also wanted to add that I really appreciate that there is a make it vegan option for many dishes. Many other places don't offer that. Will definitely order again. Thank you", "author": "Shaum S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Our evening started with a very pleasant welcome from the hostess who offered us drinks and appetizers.  The Aloo Tikka Chole, our appetizer, was outstanding.  Next our waitress took our order. She was another very sweet woman.   The chef brought our entrees our and they were sensational.   It seems like it is all family that works there and they really care.   Yummy!!", "author": "Coraleah N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-31", "description": "Service needs to be improved. Took 40 mins for the food to come out. No apology for the wait. Food was cold. Took 10 mins to reheat. Some items were missing. No apology for this either.  Table water was warm. Wait staff spilled water on a fellow patron and did not apologize to them.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Great food, and Chef Tilak is super friendly.  Try his special Butter Chicken, or ask for his recommendation.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Checked this place out last night with my parents. Incredibly fresh dishes at a fantastic price - we highly recommend. Our favorite was the Sev Puri  chaat! The place also has lovely decor and is very bright and cheery inside. Will be back soon.", "author": "Megan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "This is my favorite Indian food in the city. Tilak (the chef) takes traditional favorites like samosas and butter chicken to a whole new level. I am also in love with the Biryani - I have literally never found anything else like it in the city. SO good!!!!", "author": "Jiaona Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Absolutely fantastic. The chef came out to our table and personally helped us order. The biryani was amazing and the curries were super flavorful. On top of that, the prices were reasonable as well. We'll definitely be back!", "author": "Anon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-08", "description": "Not great but certainly edible. I think there are better choices for Indian food in and around Bernal but not a terrible choice. I found the dishes to be a little too watery and not thick enough. The naan and various other breads were also a little chewy.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "SO GOOD! Highly recommended. I had the veggie tikka masala and it was incredible. I had it months ago and I still think about it.", "author": "Laurel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "Pleasantly surprised at how fresh and tasty the food was. Highly recommend the saag paneer.", "author": "Micah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Fabulous food and fast delivery!  Will be returning!", "author": "Emily K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "I live in the area and I was really looking forward to trying out this place. So, today, on a Monday, we went in.  There where around 7 tables open and the unfriendly waitress tried to stick in a small table next to the door.  We asked to move to another table that was away from the door and larger.  She was extremely not friendly and through an attitude that we wanted another table. After we said that we would just go across the street to the always good Zante's pizza she said that she could seat us at another table.  This one was next to another customer who was really close by the chairs that we would not be able to sit on one side of the table.  I think she did this on purpose to be difficult.  For a newly opened place, they have new ownership, this waitress had no concept of customer service.  She was rude, and seemed to resent us daring to ask for something that any other restaurant would do.  They lost a customer for life with this.  Zante's pizza, who serve some of the best Indian food is across the street, along with Little Nepal also across the street.  If they can't be kind to customers, then I also have to question how they would make their food.  For me, I will just go to the places nearby that are great with customers and have great food.   Very bummed we can't try the food but with such rude attitude we had no choice.  I would give it zero stars, if I could.", "author": "Carlos M."}
