{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "All the surrounding brunch places had long waits, so I came here instead. I was pleasantly surprised! Despite the poor reviews I saw on Yelp, this place was fast, efficient, and delicious!\n\nWe were seated right away, which was good because I was getting hangry. Ordered the godfather omelette. Out came a perfectly cooked egg, stuffed with Italian sausage, mushrooms, and peppers. Everything was flavorful and delicious (except the American cheese, which I would pass on next time). The hash browns were crispy on the outside, soft and warm on the inside. Went well with the hot sauce they provide. And of course, the meal wouldn't be complete without some sourdough toast -- which was served perfectly cooked, not burned. The staff was friendly and checked on us a few times, always offering to refill my coffee (which was surprisingly bold and flavorful! unusual for a diner type place).\n\nI would definitely come back here next time I'm in the area. Great food, good prices, and good service.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-29", "description": "I just paid $13.45 for a half Caesar salad with crispy chicken. The salad was so small,and the chicken was like chicken nuggets. RIDICULOUS waste of money. Also- there was a large puddle of water in the dining room next to our table the entire duration of our meal. Idiotic. DONT GO HERE.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "Toast is a great option for a short wait and affordable breakfast/brunch in Noe Valley.\n\nUsually when people say Noe Valley, I think yoga moms, bougie lifestyles, and eggshell/tan colors. We happened upon Toast by accident, since we originally planned on going to Griddle Fresh...but after eating realized it was Toast. How hilarious! Their signage says eat Toast, which is pretty cute and not as \"telltale\" of the name as I thought. All inside the space they have graffiti/street art by this famous SF artist and pieces of toast animated and pictured. The vibe is definitely family-friendly, and very cozy and low-key--exactly what we needed.\n\nBoo was hungover from the night before, and I was pretty hungry and was looking for some hearty grub. We decided to share the regular french toast (with added fruit) and the salmon scramble which was SO delicious and great in portion size. We got the scramble with english muffins, so we essentially made our own benny's with scrambled eggs which tasted really good. The hash browns could have been served in greater amount, but they are crispy and yummy. They also have brunch items like benny's, sandwiches, pancakes, and the like.\n\nToast is actually as it is. There's nothing extra remarkable about it or the food. Our server was a kind girl who seemed to have so many tables to keep track of. She got her job done, but we didn't get any homey treatment because they did seem understaffed. The only things that could be improved are the house coffee (said the boo) and perhaps providing heaters for outdoor seating. However, Toast is more like a diner than a SF breakfast place...which is a great option especially in Noe Valley.", "author": "Jodi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "Good burrito! But would not recommend coming after 2 (closes at 3), I did feel rushed out the door", "author": "Jose R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "We walked in 10 minutes before closing and welcomed us super friendly and loving ! Did not feel rushed and got excellent service!", "author": "Karen G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "This place is a joke. So expensive and lackluster food. I've eaten here a few years aand was disappointed, but thought I'd give it another try since it's been several years.  I ordered a burger with no bun for $13.95. It was about a centimeter thi pretty much impossible to cook to medium rare. Came without any of the condiments. Sent it back and excused myself. Will never be back. Can not believe they are still in business with all the great food options.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "I enjoyed the food here \nTheir breakfast combo was well made \nTheir coffee is okay \nSalads and sandwiches are good, while the sides are a little proxy for what you get \n\nThe service is very good", "author": "Jad A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "The food is average and they are super disorganized. Busy Sunday brunch time and they have a sign in list but without looking at the list they seat people off the street first (or let people just walking in sit down wherever they want and start serving them) as others who have been waiting awhile look on. Not worth it.", "author": "Urban C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "I absolutely love this place. I was in Noe Valley running errands and was looking for someplace to have breakfast. I walked in and was warmly greeted and encouraged to pick a seat anywhere, so I grabbed a table by the window so I could people watch as I ate. The coffee IS SOOOOOO GOOD I'm still thinking about it. My server was friendly and warm and took great care of me. My lox benedict was fantastic, the fruit bowl was obviously fresh and had blueberries, strawberries, banana, and melon. I got there right before a big rush of people, but I didn't feel rushed at all and tipped extra for the consideration. \n\nI will 100% be back. Great job, TOAST.", "author": "Cristina B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "Why someone would eat here and keep this place open is beyond me.. okay the staff is OK .. friendly sure but the food .. no.. no way.. zero flavor.. obviously everything is frozen and old stock..old oil used for hash brown.. I am writing this sitting at the restaurant.. $ 14.50 for the complete crap breakfast  burrito and $15 for the eggs Benedict .. horrible and the coffee is bad ..  I am never coming back but this review is for others who are coming to the area looking for a snack.. please don't do the mistake I did.. don't go here .. go anywhere else.. even 7-11 has better food", "author": "Arvind R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-02", "description": "Poor reviews of this place versus the other Toast location leads me to think that the owner does not visit this location as much as the other one.\n\nI only come here when my husband wants the croissant French toast. It's always such a guessing game on what to get. I got the wet burrito before - bland, lack of good flavor. I got the regular breakfast combo with French toast and hot links today. \n\nThe hasbrowns were stale, and my sausage was totally burnt. It's a good thing I flipped the sausage over to see how the other side was, or I would have had a nasty surprise. They were nice enough to give me a new sausage. I overheard the table behind me that the waiter brought out the wrong item for the gentleman, so they had to do that one over too.\n\nI'm not bashing on the people who work here, but more am wanting to bring to attention that this place really lacks consistency, and honestly, needs a good manager to be on site to help bring this place up to it's full potential.\n\nEven the music in the background was so confusing that I actually noticed how weird it was. I could hear the sound of the tv, and the music playing on the speakers. The weirdest part though was, that the kitchen was playing music that was totally different, and I thought it was inappropriate considering that all the customers could hear it. \n\nI've been to the other toast location - that one has way better customer service. I hope that Toast ups it's game - it'd be nice if Noe Valley had another solid breakfast stop.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "This was my fourth and last visit to Toast. I keep coming back thinking maybe they had a bad day, maybe the manager was out, maybe the server had a rough customer right before me...\n\nI had a salad, two eggs, and fruit. My partner had the 2 egg plate with toast and bacon and fruit instead of potatoes (which was included in the price on the menu). \n\nTotal: $43.00 \n\nWe looked at the check and saw that they had itemized everything, didn't utilize the combo option, added everything as a side - which inflated our bill probably $10 at least.\n\nWe asked one of the employees (busser? expo?) as our waitress was nowhere to be found. He was argumentative and rude but eventually agreed to take off the $2.95 toast.\n\nAdd this experience to mediocre, greasy food, forgetting items (a side of toast, asked for hot sauce, coffee or water refill) every time we go... this place needs a revamp. I think I gave it the ol' college try and I won't be back.", "author": "Tessa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "When I have omnivorous guests in town I always suggest Toast for breakfast because it's fast, easy, and has vegan options...bam!\n\nThe nice thing about Toast is that you can get any of the scrambles with tofu instead. However, I usually find that the tofu scrambles are quite bland and find myself dumping loads of hot sauce on my plate to compensate, though I'm still never completely happy with the scramble at the end. The scrambles come with delicious hash browns that are made with oil (not butter); however, these can be hit or miss as last time mine were overcooked and minuscule. You also get a large serving of toast, which tastes like any other toast. Basic.\n\nAt the end of the day, if you want fast, convenient, no-frills breakfast, this is your place. It's a solid option for breakfast and gets the job done.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Amazing service and amazing food. This will be another one of my weekly spots. I went at 8am and the place was almost empty. Very quiet, perfect place to get ready to start my day.", "author": "Patricia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "I would never come back to this place. Probably the worst service I have had in a restaurant in 10 years. The server brought our food or should I say dumped our food on the table and we didn't see it again for 25 minutes. No coffee refills. No water refills. He ignored us as if we were the plague.\nKnouff said. Except the food was average at best", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "Everything is good here except the toast. It's sometimes near raw (warm bread), sometimes burnt. Sometimes burnt one side, uncooked on the other. It's never more than lukewarm, which is bad when it's always served dry and the butter comes out of the freezer.\n\nThe service is also a bit spotty. Generally good, but sometimes abysmal.\n\nThe non-toast menu items are always delicious. I heartily recommend the Joe's scrambler, one of the better Joe's Special versions I've had.\n\nCome, enjoy it for a leisurely meal, but a good one - and hope you get good toast.", "author": "R H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "We stayed in Noe Valley for 4 nights and ate here for breakfast 3 mornings - like we were rolling down to a resort restaurant. Every time we went the food was great and so was the service. Each day we saw something on the menu we wanted to try the next day. Poached eggs were perfect. Pancakes were incredible. Our kids loved it and asked to go back every morning.", "author": "Thomas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "Quick friendly service and fresh food! I had the combo breakfast and pancakes eggs and bacon were fresh and tasty! But the hash browns were my favorite, they were jus right crispy on both sides and cooled all the way! Hard to get double sided crispy without the overly fried deep fat drenched in most places or cold on one side crispy on the other! Will return for lunch someday!", "author": "Paul D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "Toast Eatery has a town diner type of feel without the diner prices.\n\nI went on a Saturday morning and there was a decent wait of people. My friend and I put our names down and went to Starbucks to get some coffee. They moved pretty quickly and sat us by the time we got back, we still had our Starbucks with us. One suggestion I have to a lot of those breakfast/brunch places that have a lot of people waiting, you should consider having a coffee station outside or something to convince folks to wait because I'm sure they lose people along the way.\n\nI ordered the Croissant French Toast which is probably heavy in butter and calories but it was pretty good.  I guess some of those melds of breakfast items do work, I still haven't tried a cronut.\n\nI'd probably go again for the Croissant French Toast.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Not sure about these other reviews!  Pancakes were fluffy with a vanilla flavor and the fruit was fresh. Eggs blackstone was excellent. They poached my eggs to order (medium). Hollandaise had a nice lemon touch. Hash browns were crispy on the outside and yummy. Egg sandwich was well received as well. Waitress was nice and attentive.", "author": "Rory H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-09", "description": "Toast is a dependable bet for solid food for Breakfast or Lunch. Note that I sent solid and not extraordinary. Toast really reminds me of a traditional New England luncheonette but more modern and with more avocado. The menu has a large selection of omelettes and scrambles as well as traditional breakfast staples like pancakes. For lunch, there are a ton of sandwiches and burgers to choose from as well as a few salads.\n\nBoth times that I have come for breakfast, I have gotten omelettes. Both omelettes have been good. The potatoes served with them are fine. Toast is toast. The price is fair for what it is and the portions are big. But again, everything is fine. If you need breakfast and everywhere else has a wait, Toast is a suitable option. If you can get into Griddle Fresh or Chloe's though, you are definitely better off. I have yet to come for lunch so maybe that is their strong suit but who knows.\n\nI will say that they REALLY cram you in at this location. It is so tight that the waiters and waitresses can't get to you easily. We once sat in the back corner and our waitress literally had to pass our food and I never go refills on my coffee even though it was empty before we got our food. I understand this isn't her fault but I really think it would make everyone happier if one or two tables were removed.\n\nTLDR: This place is adequate but don't expect anything past that.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Recommendation: Thinking about going to Toast Eatery? Perhaps you will enjoy it. However, the costs, inconsistent food quality, long lines, unpleasant deep fryer oil flavor, and frequently feeling annoyed at the end of my meal will keep me from retuning or recommending that you eat at any of the Toast locations. I've been a Toast customer probably as long as they have been in San Francisco but I don't recall if there is one owner for all Toast restaurants and since there isn't one single Toast Yelp page, I chose the 24th Street Toast Yelp page to post my review because it is my least favorite Toast location.\n\nPros & Cons: On the surface, Toast is the kind of place you consider going to for breakfast or lunch because of the convenient locations scattered around the city and a menu that is varied enough for most tastes. But that's where the positive attributes end. The quality of the service and food is widely inconsistent even when I primarily went to the Church Street Toast location for many years. The frequent long wait times for a table (often 30 minutes or more on weekends) and mediocre food is extremely frustrating given the costs (especially the $3.50 ice tea!). Whatever oil they use in the deep fryer has an off-putting flavor that lingers in my mouth long after the meal. It is so bad that I finally stopped ordering fried food even though I loved their fried menu items like the curly fries.\n\nI tried the 24th Street location numerous times and in addition to the extremely loud and chaotic environment, every meal was incorrectly prepared. It is the one location that I have never enjoyed. The Polk Street location was simply unwelcoming. I often felt as though I was somehow imposing on the staff who did little more than mumble through our interactions. In contrast, the staff at the Church Street and West Portal locations are welcoming, kind, and try very hard to accommodate each guest. Both environments are much less chaotic with the exception of the parent patrons who often allow their children to fulfill every impulse like running around unsupervised or play with all of the table condiments, like jellies, throughout their meals without a care for other diners but that is not the fault of the Toast staff who try very hard to respectfully intervene.\n\nToast was initially a great find but years later, it's just a frustrating waste of money.", "author": "Thatwasme T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "Sunday morning breakfast and it was raining!  But we got in after a short wait.  This is a diner style restaurant with lots of comfort food.  Yet it is well prepared in that foods was cooked to correct doneness, not a lot of extra grease, and wide selection of for all palates.\nThe wait staff works very hard, so water glasses and coffee cups stayed filled, and normal times from ordering to receiving food.\nI had chicken and waffles, a special that day, and really loved it.  Held me over until dinner, but worth it!", "author": "Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "I'm surprised at the negative reviews here. I've never had a bad experience or bad meal. To me it's a no-frills diner with good food and reasonable prices.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "I've been here couple times before, and today is probably the worst experience ever. The three of us got in (2 adults, 1 kid), sat at a table for two. The server noticed we have three people, but she only brought us two glasses of water. And no extra set of fork and knife. The worst had yet to come. \n\nI ordered hamburger steak with eggs, and she brought me eggs/hash brown/toasts, no hamburger steak on the plate. We let our server know, and she took the plate back. Everyone at the table waited another 10 minutes with me for my correct order to arrive. The server informed us my hamburger steak will be taken out of the check. She was right. Only my hamburger steak ($5.50) was taken out of the check. She still charged us $8.25 for my eggs and hash brown that arrived late with my hamburger steak. \n\nServices at Toast has been alright for being a neighborhood brunch spot, but today's experience makes me never wanna go back again.", "author": "Yi-Jen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-18", "description": "After a long morning of doing errands in SF, my roommate and I decided to grab brunch in Noë Valley. We were famished and excited to eat! We ended up coming to Toast Eatery because it had the shortest wait (we were seated pretty much right away) in comparison to the other brunch joints in the area. \n\nWe both ordered egg scrambles. I got the veggie scramble which had assorted vegetables and avocado. It came with a side of hash browns and sourdough bread. \n\nFirst, I felt the food was overpriced. The quality and taste of our brunch definitely did not warrant the high cost of our meal. I get that most of the brunch places in the area - and I guess in SF in general - are going to be on the pricier side, but Toast Eatery needs to step up their game to stay competitive. My toast was a little burnt. My hash browns tasted really oily. My eggs were ok but a far cry from special. \n\nSecond, the service was disappointing. After seating us and taking our order, we were basically unattended for the rest of our meal. Additionally, my roommate wasn't provided any cutlery. She had to flag down the waiter and ask for utensils after her food was brought out. \n\nBecause there are a lot of other brunch places in the area, I probably won't be back.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-28", "description": "I usually judge breakfast spots by their eggs Benedict and coffee. They had a fair selection of your classic Benedicts, and espresso drinks. I went with the hash Benedict and a regular coffee. \nNot so good: The corned beef was a little too dry, and hollandaise very watery, and with a few onions and peppers thrown around, I'd hardly call it a hash. \nSomething good: those hash browns were probably the best I've ever had. \nThe portion was adequate but overall this plate was not worth $15. I feel the same way about the coffee, for $3.50 you'd expect something more than just decent.", "author": "Gabriela M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "Need breakfast at 7? This is your spot. \n\nThe coffee is good, service pretty prompt, and the food is ok ( except for the inedible bacon, but I know there are people who like their bacon over hard.)\n\nKinda pricey, but I knew it would be and was willing to pay for their 7 am opening time.\n\nNow I'm going back to bed.", "author": "El B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "I've never had an issue here! I come in sit at the bar, the staff is always very quick on their feet. My food always comes out hot! I love my coffee and ice tea, and it is consistently refilled. I would have giving 4 star because I don't understand the charge for syrup. But I'm not going to be petty! Because I still don't have to cook at home, and my food is alway good!!", "author": "Cory T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-09", "description": "Whenever I'm at Toast, the only thing I can order is the Hash Brown Hill (with a side of bacon). While chilaquiles is probably the closest comparable to breakfast nachos, the hash brown hill is pretty darn close. It's a hill of hash browns (duh) covered with cheese, avocado and sour cream. To add a bit of texture, I order bacon, cut it up and put it over the top - yum! \n\nService can be a bit slow. On a Sunday morning, it took a while to get a menu, our food and then our check - it seemed as though they were pretty understaffed. Generally, the wait is a lot shorter than other options on 24th St.\n\nAlso, there is a TV so you can keep up with football while you're brunching...", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "The \"Must Try\" Joe's Scramble is a thumbs down. Straight ground up pink beef with no spices, watery mushroom and spinach scramble. The Smuckers jelly on my toast was good though.", "author": "James O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-25", "description": "Just ate at Toast Eatery and it has gone down hill.  I now know why there are very few people in there these days, they are all at Griddle Fresh.  The coffee was burnt and tasted disgusting.\nI ordered corned beef hash, that was flavorless, with a poched egg, came hard boiled.  They should save themselves rent and close.", "author": "Sally Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-29", "description": "That was really an undesirable meal.   My coffee cup arrive with old food on the side of it. I got a wet vegetarian burrito and it really had no flavor- the inside was just beans, a little egg and a little cheese. The black beans had zero salt and no flavor. The Ranchero sauce was also very uninspiring. My son had some French toast which was quite tasty. Bacon also looked nice and crispy. it was very hard to get a glass of water and the service was not attentive. I for sure will not return.", "author": "Pauline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "This is the greatest breakfast place in the city. The cooks are over the top. The quality is crazy good. Amazing service. Every human being working here is a gem. I simply adore this restaurant. Jorge and Jessica just made my morning.", "author": "Lawrence C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Great simple breakfast spot, went there for brunch on a Saturday and it wasn't too crowded. Good portions for the price.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "The croissant French toast is a must. Go big or go home. Also, the Joe's scramble with turkey hit the spot. Def coming back here for breakfast. :)", "author": "Alex G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-25", "description": "What a nightmare of a place. Specifically ordered my omelette with double chicken sausage and no cheese. Guess what I got ? Very little sausage and smothered in cheese. lol it's not rocket science but obviously it's too much for them to handle. First and last time coming here. Try Sally's next time, at least they won't mess your order up.", "author": "Alvaro C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "I frequently visit in the neighborhood, and this is my go-to spot! They have great food, and the staff is very nice and friendly. Kamal treats his employees with a lot of respect, and he helped in creating such a positive environment. This place is mandatory to go to if you're around the area or if you're visiting from somewhere else.", "author": "J J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-06", "description": "It was okay...not the best brunch I had, but definitely not the worse either. The hashbrowns were my favorite part of the meal though - crispy on the outside and fluffy on the inside. Most places can't get it right, but I thought Toast did it well. \n\nAs for my breakfast burrito, it was a bit of a letdown. It certainly had a lot of stuff: sour cream, cheese, avocado, eggs, salsa, and your choice of meat (I went with chicken apple sausage), but it wasn't well mixed. It was very mushy on the side with the condiments and cold. Cheese wasn't melted and there also wasn't a lot of meat in my opinion. I did like that the burrito was lightly grilled though,\n\nAll in all, food was decent. However, presentation doesn't seem to be a huge thought. Each plate was served up on a GIANT plate, but it was hardly filled. It just made the dish seem skimpy. This was particularly evident for my mom's French Toast which looked like it was just flopped onto the plate. Dusted with powdered sugar, but no other garnish. Very different from the pictures we saw on yelp.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-20", "description": "Lousy diner, bad service, bitter coffee, underdone waffle. Pork sausage must have been cooked yesterday then warmed over. Pathetic diner on 24th Street. Had to remind waitress for my coffee. Only two customers in the place, how can you forget to bring one of three items?  I would give negative stars if I could.", "author": "Barry V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "This is our go-to place for take out breakfast. It's quick, local, fairly priced, and food meets our expectations of what we want from a diner. Quite frankly, I'm not sure what others leaving low reviews purely for the atmosphere are expecting when it's a diner. \n\nThe croissant french toast is always served with fresh berries and bananas (they don't skimp on these either) and the omelets are made well. Their sandwiches haven't been bad either. Our orders are usually packaged up nicely and condiments/utensils provided.\n\nWhenever we don't feel like cooking on the weekend w/out having to wait the typical SF brunch spot waits, we come here. We order via phone amd upon arrival the food is ready to go. And so far we have not been disappointed!", "author": "Esther A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-22", "description": "I was excited to return to this place almost 6 years after a magical experience the first time. Unfortunately, this was not as I remembered it....Sunday morning for brunch line wasn't bad at 10am so we were pretty stoked. We quickly realized why it wasn't that crowded-because they had about 3 people total out on the floor and nobody was paying attention to new diners. Getting coffee and water? Had to flag someone over. Take our order? Flag someone over. Silverware for our food? Splenda? Refills? You guessed it, had to flag someone down EVERY. TIME. Clearly could have used more people to provide better service but overall food was good not great, definitively not as good as I remembered. Another irritation -EVERRRYYYTHING is additional charges! Egg whites, real maple syrup, fruit instead of potatoes....all additional  $2.50+ which can add up if you don't pay attention. Overall meh.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "Absolutely loved this place !!! And to a huge surprise so did my man he usually hates eating out for breakfast cuz he says a lot of places make there food bland but toast eatery was far from bland.. It was BOMB! \n\nAnyways my moms first time to SF and she loved the little diner ! We all cleaned our plates!! I will recommend this to anyone it's so good !! Oh and it's small so it gets crowded fast but Totally worth the wait!!", "author": "Cam V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Probably my favorite neighborhood spot for a breakfast bagel. Good service and convenient location. Good size as well so if you're going with a group, not a bad option.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-20", "description": "Average at best but definitely pricey.  Very good Americano however.  Price versus serving size doesn't warrant a return.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "I've been the biggest corn and beef hash fan everywhere I go. This place absolutely nailed it, might want to get there early as this place gets packed real quick. definitely worth the wait!", "author": "Ian E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-11", "description": "I frequently come to toast with my family and generally receive very good service but today was an eye opener with the very negative service me and my group of 5 received. \n\nWhen they called our name the guy rudely asked where the rest of our group is at and they have to seat somebody else if they were not here right now. My cousin told him that the rest of our group was looking for parking and would be here in a few minutes which they did. So when we sat we immediately ordered 4 coffees, 2 orange juices and 5 waters and waited for the rest of our group to come patiently. When we finally ordered their was an impression that the waitress was upset was us so my cousin asked if they were upset with us. She immediately became defensive and said that she was not upset but that their was frustration because other tables couldn't get served because of our entire group not being there on the spot (even though it was only 5 minutes). That made us extremely uncomfortable and my cousin just said we understand to try and ease the tension. Mind you all 5 of us each ordered an entrée and the bill came out to 73 dollars. \n\nSo when our food finally came after 20 minutes and during that time we can overhear some of the cooks looking in our direction and talking about us. The waitress didn't really talk to us until we were paying the bill. So when we paid our 73 dollar bill she \"apologized\" about her attitude. the apology didn't really matter because it was too late and it seemed to us she was only apologizing just to try and get a tip. \n\nThe overall experience today was very bad. Their was negative energy, bad attitude and just a lack of professionalism in this establishment. We were very patient and polite so the service we were getting back was terrible. We gave a 25 dollar tip to send a message that despite the bad service, bad attitude and a clear attempt to get a tip we will still show politeness and professionalism when the servers can't do that.", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Croissant toast with vanilla/cinnamon really yummy!\nChicken pesto sandwich- really moist chicken!\nHeat Burger with brioche bun was really really good!\nDefinitely coming back when I'm in Noey Valley", "author": "Florita A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-12", "description": "I originally gave a 5 star review and this used to be the place I always took my friends for brunch. However the last few times I got food here, my food was super mediocre. I'd still eat here again if it was convenient, the food is still okay breakfast diner food. But I don't think I'd go out of my way to eat here when there are so many other great breakfast spots in the city. The meals aren't original and a lot of the veggies either taste close to the end of shelf life or canned - I'm not sure what it is really but they don't taste fresh.", "author": "Bryce B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-11", "description": "I wouldn't go back here for 2 reasons: \n\n1. The attitude from one of the waitresses sucked. I get that it's Sunday and they're busy but when you call us in from waiting outside for 20mins don't just walk away and carry on doing what you were doing before and make us guess that the empty table at the back is our seat. How hard is it to smile & show someone to their seats? The other waitress who actually served us though was really helpful though so I guess the older lady was having a bad day. \n2. The food was over cooked. I ordered the Hash Benedict. Eggs were over cooked so the yolks were not runny at all, the muffin was burnt and the hash brown was bland. The hash brown could definitely do with some seasoning.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "As luck would have it, Muni was running late, making me totally miss my yoga class. I should've been pissed but decided what the heck!  When life doesn't work out the way you want it to -- you don't spend the time getting mad -- you spend it stuffing your face instead. (I'm either optimistic or efficient with my time. You decide)\n\nI ordered the corned beef hash: stringy meat interspersed with soft potatoes and onions.  It came with crispy hash brown, over easy eggs and big slices of whole grain bread. I love the generous servings here and for less than $10, that's a good price for San Francisco.  My Earl grey tea was refilled with hot water without my having to ask. \n\nTry to grab a seat by the window for maximum people watching. You wouldn't wanna miss eyeing that cute single dad walking his dog on 24th st.  ;-)", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-30", "description": "Just got delivery through post mates. The French fries that came with my fish and chips were gross and soggy likely due to the fact they packed the fries and hot fish in with a I can only assume was cold salad vs. The wilted nasty pile in the corner of the box. The fish was the only decent thing in the box but the \"tater sauce was bland and mildly oily. So far the only redeeming factor has been the Mac and cheese.  \n      I strongly recommend the owner teach his staff how to properly box to go food a salad should never be put in the same container as hot fries or any hot food for that matter. And line checks cause the tarter sauce tastes like mildly chunky mayo bland.", "author": "Kristen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "On a cold and rainy and dreary day, I found myself exploring 24th Street in Noe Valley. I was not necessarily in search of lunch, but knew I'd need it eventually. So many options in this area, but with the help of Yelp's reviews, I chose Toast. (Plus the atmosphere looked inviting when I walked by the first time.) \n\nWas the omelette blow your mind spectacular? No. But seriously, you can't ask too much of an omelette or scramble in the first place. It's about the ingredients and the preparation and I am happy to say Toast hit the mark. I went with the Church Street omelette and it was literally bursting with the avocado, bacon, onions and spinach. Every cut I made of the omelette resulted in the piled-up ingredients falling out. I loved this. There was no skimping on the filling and it made for a delicious omelette. I opted for a salad instead of hash browns and this too was a plentiful portion.\n\nI sat at the counter and was taken care of efficiently but without any hovering. If in the neighborhood again, I'll happily stop in.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "Pretty damn good.  They have buckwheat pancakes which are seriously delicious and the omelets rock.  It is a cute environment and usually not too long of a wait.  I could do brunch here more often.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-10", "description": "Honestly, I love food. I rarely ask for anything on the side or any substitutions  (i.e. I'm easy). The 2 stars is for the OJ, the cute sign out front, and service.\n\nCame here with the kids and husband and ordered the eggs Benedict, a breakfast sandwich, and waffles. I can't tell you which was worse. I couldn't even eat any of it. Luckily, the kids will eat anything drenched in maple syrup. So at least the waffle were eaten. My husband did manage to eat most of the sandwich too.\n\nDisappointing start to our food tour of SF", "author": "CC P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "This place has gone way downhill. What is with established eateries that cannot maintain a level of consistency over time? Poor service (even when slow) and crap food. Cold hashbrowns, slimy hash,  burnt English muffins, cheap lunchmeat on a Cobb salad with wilted lettuce,  not to mention lip marks on 'fresh' glass. When management gets lazy and fails to keep up the standard anyone would come to expect when forking over cash for a meal one could make better at home, business will, inevitably, sour. Have some damn pride already!", "author": "Liz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "One of the better brunch places I've tried in the city. A less pretentious restaurant, this place is perfect for Saturday/ Sunday morning brunch without the ridiculous wait times  of most other brunch place in the city.\n\nSome quick tips,\n-Try the hash browns here, they are amazing. \n-The wait is shorter, but is still there.  However, there is a Starbucks next door so at least you can get your coffee fix in in the meanwhile.\n-this place needs higher reviews!", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "The service was amazing! The food?! Even better. Thank you Kelli for helping us out today and for being kind enough to make sure we were well taken care of. The most AMAZING mac & cheese.", "author": "Tamara R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "Our breakfast dishes were the quality of a Denny's with the prices of an upscale diner.  Our waffle was flat and chewy, the burgers had no seasoning, and the bacon was like a dry crunchy salt lick.  We went on a hot day and the door was propped open so flies were having a field day hovering over kitchen area.  Other eateries along the street have longer lines and its for good reason.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-14", "description": "My first time there this morning for breakfast and was unimpressed \nI ordered the salmon Benedict - the lox and the tomato were so cold they ruined the Benedict - I don't usually find my self overly sensitive to food temperature  but this was no good :(", "author": "Leda M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-06", "description": "If you're going to pay SF brunch prices you can at least go somewhere else where the food isn't utterly mediocre. That may even be generous. We had the Joe's scramble, chocolate chip pancakes, and corned beef hash. Somehow coffee is $3.25. I wish I had trusted the existing reviews.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-10", "description": "Hash brown hill is a must try! I got it with the avocado, sour cream and onions on the side with just the cheese on top. Delicious! \n\nCorn beef hash was tasty as was the croissant French toast. Price is right and maybe even cheaper for Noe Valley. The only reason for 3 stars is the service. They had many open tables but were extremely short staffed. That meant there were groups of people on the wait list, just hanging around outside. At one point, people just went in and grabbed their own seats. Two servers in the whole restaurant for a Saturday breakfast rush is just not enough. But I'd definitely come back and try again!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-10", "description": "I came here for lunch before swinging by a local bakery. \n\nI arrived around 1:15 right before another lunch rush. I only had to wait a few minutes to be seated. YAY! \n\nI ordered the grilled salmon sandwich. The salad wasn't bad. Considering it's a salad, I hope you don't screw that up. My salad was dressed in vinaigrette. My main entree salmon sandwich on ciabatta bread it was a bit on the bland side. And it was a bit oily on the bottom side. No, it is not because of the salad dressing, the bread is just greasy at the bottom. This sandwich does not live up to my favorite at Nordie's Cafe. \n\nI think the next time I come back, I am going to skip the sandwiches and head straight for some breakfast. I'll be back.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-22", "description": "Brunch was pretty blend, one of the \"poached\" egg was almost hardboiled, overall food was tasteless , the ham felt like spam, the hash brown was undercooked, so I guess it doesn't qualify as \"brown\" , orange juice was pretty good but for the price you might expect fresh pressed one. \nMaking a little effort of corrects seasoning and presentation would not hurt, maybe a few salad leaves with the eggs, it cost nothing, oh, wait, yes like 5 cents or something.. but I guess most people goes there when Savor or griddle fresh are packed...anyway, next time I'll go to Starbucks next door, at least I'll know what to expect!", "author": "Gregoire V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "Love!\n\nBeen here twice and never disappointed. Great at handling large groups, the service was on point and friendly, the food was hangover friendly and just delicious in general and the mimosas were perfect. Had the Benedict and the eggs were poached to perfection and the has browns were exactly how hash browns should be, a little greasy and anything but healthy. \n\nReasonable prices and cute decor. If you are looking a just a good basic brunch, nothing fancy or special then this is the place. \n\nWarning - beer and wine license only. I got excited to have a Bloody Mary until I read it was made with Soju. Just a minor set back so I opted for a mimosa.", "author": "Lindsey M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "The ratings are pretty accurate.  It's a typical diner with standard eggs and bacon.  Nothing special. Service was nice and they have mimosas.", "author": "Diana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Just finishing up my lox and English muffin, made by our boy Louis ! Damn this man makes the presentation look so good , you ALMOST don't want to eat it!! Kudos to you Louis , keep up the great work!! Speaking of great work, Irina our waitress was just a rockin' too!!", "author": "Curtis L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-08", "description": "Meh.  In short...\n\nLike:\n- I like the Sirron Norris art.  Vibe is easy and laid back.\n- Staff were nice.\n- Some of their foods are organic (?)\n\nNot jiving:\n- Burned coffee, runny egg scramble with mealy tomatoes, mushy mealy hash browns @~11 / plate.  I'm not a foodie, but even I was unimpressed.  Too expensive for a Denny's quality meal.  You have to be a little more competitive in SF's food industry.\n\nFor brunch, reroute to Savor down the street.", "author": "Elle T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-05", "description": "The quality of the food and service is terrible.  toast was cold eggs uncooked.  Don't ever go there way over priced", "author": "Kelli F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "Decent. \n\nThis place doesn't have long saturday and sunday morning lines. Thats good and bad - the food will not wow you, but you won't have to wait forever. Its a good option if you're looking to get things done. \n\nService and price are alright.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "Great brunch spot, ordered the challah French toast and the Nutella waffles. Very delicious, service was good. A little right in the seating, but a definite spot to try while in Noe Valley!", "author": "Tiffany G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "Incredible how bad the service is.\n\nWaitress sat a couple and then asked them to move.  Worst part is she ... gets in a loud argument with the couple.\n\nShe then goes over to her colleague behind the counter (another waitress) and makes comments ... they both then begin laughing.\n\nReally?  This is how to welcome customers.  Wow!\n\nI'm sitting at the counter feeling bad for the couple.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "Nice place! Wanted to get brunch in The City, and passed by this restaurant and thought we'd give it a try. Once you walk in, you feel a calm ambiance. It's a feel you get where you would think, \"Hey, this is a perfect place to cure my hangover\". The menu has a plethora of option and there's something for everyone. Their prices were average and their portions were a good size. \n\nDecor: Nice view, and Diner-style feel (well it is a diner so duh), Very bright inside, very relaxing.\n\nService: When we walked in, the hostess said we could choose anywhere we would like to sit, which was a major plus. Menus were placed at every table so there was no need to wait for them. Very friendly service and our food only took about 10-15 minutes to come out, and we were STARVING so that was good.\n\nFood: My Girlfriend ordered the California Burger, medium rare with bacon and garlic fries. I ordered the French Dip with a side of Garlic fries as well.\nCali Burger: Cooked to perfection! It actually doesn't come with bacon, but if you add bacon it's the perfect combo. It's still delicious without it, but for you bacon lovers, it's great. The patty was tender and juicy and the cheese was soft and chewy. The avocados were super fresh and if blended nicely with the burger. The garlic fries were OK, she wasn't too impressed with them and neither was I, so I would personally opt for the regular fries (They were also a dollar extra).\nThe French Dip: Very heavy, but enjoyable. The sauce was a bit too salty for my liking, but the roast beef was pretty good, as was the bread (it was very chewy). Cheese was not melted all the way which sucked, but once dipped in the sauce, I forgot about that.\n\nWould definitely come back if in the area, but wouldn't go out of my way to go there.\n\nTip: Garlic fries will leave you with garlic breath the ENTIRE day so beware and prepare!!!", "author": "Brian Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "I walked by this place and was attracted to its cute name and cute toast related decorations. There were cute cartoons drawn on huge toast looking pieces of artwork. They were so cute and whimsicaI. There was also a sense of neighborhood warmness because the artwork incoorporated many iconic noe valley images. I really enjoyed the fun artwork at this place. \n\nHowever, the food was ok. \n\nI ordered an eggs benedict breakfast. The hash was thin and super oily and too salty. The poached egg was great, but the hollandise sauce was bland. The whole eggs benedict was pretty bland except for the canadian bacon.\n\nThe place was cute, but the food was only ok. I would recommend their chocolate milk shake. It was light and airy. And had a malt flavor to it. It was different from other heavy shakes and worth trying if you so happen to be in the neighborhood.", "author": "Janice T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "Bad experience today. The staff kept opening the door even after I closed it. So not only was it cold outside, it was also cold inside. Formerly one of my favorite places. We got our coffee with our food as tables around us who sat down after us already had theirs. The coffee was disgusting it was so strong. We poured water into our cups to drink it. They were quick to give us our bill though. They need to improve the quality of their staff.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "I love waking up a little late and venturing out in search of a very satisfying brunch. It takes a special kind of place to tempt me out of my sleep, into my clothes and out the door, only to wait on the cold sidewalk for almost 20-30 minutes to have some brunch. \n\nOh Toast, you are that special kind of place. Part of me loves you because your art pays homage to the former \"Herb's Fine Foods\" that used to stand in your place. My grandpa would bring me here for strawberry waffles and as much coffee as I could get away with drinking before someone said something about a kid drinking coffee.\n\nI brought the *crush* here recently. I'm always trying to introduce him to new places that have great food. He ordered the Breakfast Sandwich and I ordered the very impressive Eggs Florentine (Spinach, Tomato and Avocado) and added bacon to it. It's a nice thick cut hearty bacon, yummy. \n\nIt was obvious that I picked the winner, so I decided to share my breakfast with him, which worked out perfectly. I hope he realizes how lucky he is, I don't just share my food with everyone. Hahaha!", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-17", "description": "TOAST is a no go. Miss Herbs, at least you paid dinner prices for their food. Toast has single handedly killed quality in Noe Valley. Granted, since Joe's left, there is a void for decent breakfast food, but for my buck I would go to Savor.\nFood: awful- gotten frozen hash browns multiple times. I've given them multiple chances, but just can't do it. Beef cheesesteak is ok, but good luck getting it... Waiter has brought me the chicken cheesesteak twice. Leading to...\nService: bad, but not because they're bad people. Everyone is nice, no mean spirited people here. Just get orders wrong, forget to come back, questionable cooking anyone????\nI will not be going back.", "author": "zach B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-15", "description": "I am a fan of the Toast on Church St, but today, instead, I went to the Toast on 24th. Worst Pancakes Ever.  They were raw in the middle.  I almost never send food back, but I sent these pancakes back. The 2nd batch were cooked through, but had absolutely no cake-ness.  The were solid and rubbery, like super-thick crepes.  Chefs make mistakes.  But when a customer sends food back, there is no excuse for replacing it with food that is still obviously not right.", "author": "Paul F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "3.25 dollars for a cup of coffee? I mean I'm no cheap stake but there is a Starbucks next door. If I wanted overpriced coffee I would have gone there. Also.. Not a fan of the cheese slices they use to top the scramblers. It makes your dishes look cheap and it's not pleasant to look at. The only good thing about my experience here was the service. For a neighborhood like Noe Valley this restaurant is definitely not up to standard.", "author": "Mauricio M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "What a rip offf.  This place just charged $28 for an omelette with two extra eggs.  I've eaten here a few times but this crazy.   There are better alternatives in the area. And the staff acknowledged the over charge but wouldn't change it", "author": "Rob E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-06", "description": "I'm a big fan of the Toast Eatery on Church. This one, not so much... And not for lack of trying. They have the same menu but the food is not consistent. It tastes completely different than the church location and the items I order regularly are never cooked the same way. That may be an issue of different cooks but still.\n\nI got the salmon Benedict with corned beef hash tonight. The eggs were hard boiled.. Poached but hard boiled.. And there was an eggshell in my food. The corned beef hash was tasty but really overcooked and chewy..\n\nThese are small details that can be easily fixed but it feels like the cook doesn't care or like their job. Shame.", "author": "Roxane F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Love this place! I have always had good service, even on the busy weekends. During the week its pretty quiet in here and a nice place for a relaxing breakfast. On the weekends expect it to be pretty packed and there to probably be a wait for a table. But for a simple tasty American style breakfast at a reasonable cost I don't think this place can be beat.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-11", "description": "I come to Toast maybe 2-3 times a month and  great experiences but today was a bit different in terms of service. We had a group of 5 and one of the guys that works there told my cousin we need the whole group here I then walked up to him and told him the group is on their way we sat down ordered 4 coffees 2 orange juice and it took awhile for for the rest to come due to lack of parking in Noe Valley District. We sat uncomfortably but did not complain so when we were all seated waitress came to me with a bit of an attitude I saw that right away and told her if she was upset she would NOT look at my direction was immediately defensive about not being upset spite her facial expression towards my table. Of course I was polite but I told her i understood and went about it. It ruined our morning breakfast knowing there was an issue and the guy was complaining about us to his friends and waitress did not seem to care about us even though we spent $74.00  plus a $25.00 tip. I understand getting a table at Toast is very frustrating at time but when there is 4 tables that is vacant there should be no problem sitting the rest of the group that have been waiting patiently outside. She then came to apologize afterwards about her attitude towards our table i found it highly rude she would wait till we left!!!! We have a family business store so we understand customer service is main priority at the end of it we had NO customer service at all!!!! JUST SAD!!", "author": "Ahmad O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "What an amazing brunch spot! \n\nMy girlfriend that was visiting from NYC and I randomly found this place on Saturday, as we were strolling down 24th street. We looked at the menu and it has many different options, from breakfast to lunch. \n\nWe were seated immediately and from the very second that we sat down, till the second we left, the service was simply amazing. The waiters were extremely attentive and nice. What really made me like this place is that the owner of the restaurant was there the entire time, and ran around doing pretty much everything! He was absolutely great and you can tell that he takes so much pride in his establishment. \n\nI ordered the salmon Benedict (asked for capers on the side) and my friend has their burger with fries. Everything was SO GOOD and tasty! \n\nI will definitely be back! Keep up the great work, guys!", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "A solid Noe Valley diner. I've had nothing but good experiences here, with the only caveat being the price. It is expensive for a diner but then again it is in the heart of Noe Valley and is appropriate for the neighborhood and clientele.\n\nI occasionally enjoy eating at the counter when dining alone and the service is always fast and friendly. The coffee is good, and they are fast on refills.\n\nMy favorite breakfast item is the Chicken Fried Steak with White Gravy and Fried Eggs. It is quite a large meal and I typically eat half and take the rest with me. I've had the same dish at Alice's restaurant and it was way better here.\n\nTheir menu is extensive and has both breakfast lunch and dinner items. If you need a solid breakfast in Noe valley, it's generic but it's decent. If you're only 2 people the wait has never been more than 10-15 minutes.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-23", "description": "Diner food in Noe Valley...FINALLY!!  Well, I grew up there and don't remember any place serving diner food, so it was a pleasant surprise to find Toast Eatery on 24th Street the other day.  The place, I believe, is fairly new...maybe only a year or two old.  I could be wrong.  Either way, it still looks pretty clean inside.  They have some cool artwork hanging on the walls and I appreciated that they had a TV as well. (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=kPG7GQi1OdpQ7Ehgge9EoA)\n\nEven though it was lunchtime, I'm a sucker for breakfast food and was craving some eggs.  So I went with the \"24th street\" omelet.  (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=pYJIIa2lU_6NuxK7N5KFUw)  It was made with chicken apple sausage, spinach, sun dried tomato, and feta.  It was pretty good.  All the ingredients had a distinct taste but still went well with each other.  The omelet also came with some pretty decent hash browns and my choice of bread.  (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=y9d8n_ZcRMpab4heJv9-pw)\n\nPricing is average, about $10 a pop.  Service was attentive and the food came out fast.  The menu is extensive enough that you can come back several times and still have plenty of options.  They serve eggs, pancakes, french toast, waffles, salads, burgers, and sandwiches.  I definitely plan on coming back to try other items.  Yay for more diverse selections on 24th Street!!!", "author": "Joe M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-14", "description": "Stopped off for lunch today late in the afternoon the food took over 20 minutes to come out and the service was awful ... I had to ask every time I wanted a refill on a cup of coffee ... I've been to the toast on portola a totally different experience ... My advise stay away from the one on 24 th street toast if you want your meal on time and good service", "author": "Joey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-25", "description": "I love toast. So any place called Toast Eatery is going to eventually get me in for a visit!!!\n\nTrue to their word, I got a lot of toast with my scramble. Four slices, in fact. I could only manage one slice but took home the rest. My Noe Valley scramble was good, but the real star of the show was the hash browns. They were incredible! Perfectly flavored and cooked. I'd have been delighted with a whole meal that was just a huge vat of those hash browns.\n\nI'd have given Toast Eatery four stars, but I give it three because our service was a little slow and inattentive. I was trying to order a dessert, but the server didn't notice or ask and just gave us a bill. I ended up having to pay twice... a little annoying. I'd still come back and just get a huge order of hash browns and coffee on some greasy, indulgent morning!", "author": "Denise B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-25", "description": "The wait staff is nice.\nThe food is good. \nThe hash browns are really good (which is a miracle because I hate hash browns)\nThe only down side is that my delicious apple sausage, bacon, mushroom and egg scramble came with the saddest pieces of toast ever. \nThe bread was good quality but it wasnt TOASTED correctly!\nI don't know about you but I like my breakfast without irony.\nOverall it was a good meal but they really need to work on their toasting skills:)", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "TURKEY BOCA BURGER - trust me\n(4 stars)\n\nWho stuffs their face like that?!?!?!?! I'm not a \"burger\" type of person AT ALL... but damn....\n\n- Food, good but depends what you get\n- Prices, fair\n- Service, on-point\n- Ambiance, modern diner style\n\nDinner plans failed and plan B was in affect. Hate it when friends bug you to leave you busy work life to have dinner. For 4 days checking in everyday to make sure I am still able to make dinner plans. And then 1hr before meet-up, FLAKES. Supressed my hunger all day hoping to have a FAT night with a friend and have homegirl talks. Whatever, so decided to go to Noe Valley and check out the live reindeers. Saw Toast  Eatry was open and always wanted to have breakfast here and said WHAT THE HELL, GO STUFF YOUR FACE. I need comfort food.\n\nHEFFER-STYLE STATUS.\n\nTURKEY BOCA BURGER california style ($10.80) - forget the breakfast items why not go off the walls and try something unexpected. I barely ever eat burgers, so said what the hell do it. Thank you friend for flaking on our dinner plans because THIS WAS THE BEST TURKEY BOCA i've ever put in my hugry mouth. My Turkey Burger was california style so it had avocado and swiss cheese. The patty was SO juicy and tender. This item just suprised my palate, it was THAT good. I scarfed that sucka down like there aint no tomorrow. Screw my strict eatings, cardio, and my daily 100 sit-ups tonight. All worth it!\n\nWill I be back? For breakfast one day... but definately for that Turkey Boca Burger.\n\nUntil the next review....", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "yummy little bfast spot - quiet too so you can have a conversation with people", "author": "Mark K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-04", "description": "Worst tofu scramble ever. Completely bland, unseasoned, barely cooked, enormous squares of tofu hardly constitutes a \"scramble\". Paired with flavorless veggies, it was barely edible. Great hash browns though, and the toast would have been fine if there had been a vegan option to put on it (came with pats of butter, even though we'd asked specifically about making everything vegan). Ok Bloody Mary, but nothing special. Everything was basically flavorless.", "author": "Erica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-03", "description": "Upgrading my rating to 3 and would love to make it a 4-star review if the recent improvements are permanent. There is new staff in the kitchen and new servers, and things have gotten much much better both in terms of consistency of the food and service quality. \n\nPrior outdated review is below:\n\nThere are three other much better breakfast locations in Noe, but unfortunately Toast opens an hour earlier so has a monopoly on the 7-8am crowd.\n\nTheir new server (guy there since last summer when Meagan left) makes errors in our order almost every single week; he just doesn't listen.  God forbid you order tea - you can absolutely forget about anyone offering you more hot water for the duration of your breakfast. For that matter, you have to flag down the staff for just about everything you need, including the check.\n\nThe style of food prep varies occasionally, which isn't a big deal unless you - like me - draw the line at what actual ingredients end up on your plate.  Maybe they thought it was 'bonus flavor' to cook my breakfast on bacon grease one day, but since I haven't eaten meat in 20 years, I really can't digest it anymore and was left with stomach cramps and nausea for about 3 hours.  Try at least wiping off the griddle between customers?  Definitely NOT recommended for anyone with food allergies!!\n\nIf only Savor, LeZinc or Griddle Fresh opened earlier..", "author": "Lester N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "This review for the Toast French Toast (haha). Pretty tasty, I must say. I was a meh fan of the location on Polk Street near my hood, but liked the diner feel of this location a bit better. The challah french toast in particular was really good--worth the trip alone and under $8, pretty reasonable.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "Had a great brunch here this morning. This place is pretty small but they were VERY accomdating for our rather large party (8 people). Had the veggie scramble and added bacon. The order somehow got served to me wrong but they fixed the problem pretty quickly. Scramble was on point and full of yummy veggies. Wish there had been more avocado and less mushrooms though! LOVED the hash browns too. Crispy, greasy, and left me satisfied.\n\nOverall this place is no frills, simple but good food. Their mimosas were generous with the champagne as well! If you are in the Noe area and hungover on a Sunday there is no better place I can think of to go to !", "author": "Brandon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "...Excellent breakfast for 2 = $40...Noe Valley Yuppie Town's best breakfast...", "author": "jim b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Very nice place, efficient and sweet waitress. Perfect menu for breakfast or brunch. And the order come fast at your table. Highly recommended.\n\nTry the hashbrowns.", "author": "Jean Louis B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-25", "description": "The staff here is super friendly and its a nice and rather average diner.  But really, I can scramble my own eggs and make my own toast most days of the week.  The food is always decent, but doesn't really excite me.  This is the problem of trying to make a 'nice diner'.  \n\nYou see, its way too clean in here to be a divy place to get eggs and coffee.  And the prices are way to high for them to give me eggs and toast in an english muffin.  Go to Joe's for a better breakfast sans wait.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-06", "description": "Meh kind of sums up my experience. Lots of sitting around and waiting. My toast came out of a bag, and I think they forgot salt in my dish. I wanted to try this place because it reminded me of Friendly Toast back in Cambridge, but this was neither kitschy cute nor tasty. Not worth the price for something I could easily whip up at home.\n\nThe secretly sinister coffee charging thing didn't happen to us though. My bf's coffee was refilled for free.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "I can't believe this only has three stars.  That's fine, though.  I'll just keep this place all to myself.  You can stay away.\n\nHere's the thing - it's a diner, people.  It's not some trendy fusion place.  It makes comfort food, and it does an excellent job at it.  Prices aren't too high.  The sandwiches are really good.  It can have a line, but I've never seen it be more than fifteen minutes.  Then again, I avoid it during family hours.\n\nToast is on my short list of local places I frequent.  It's a great little diner, and one of the few places in the area where the food justifies the price.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-29", "description": "Three of us had a good breakfast at Toast - mid week around 10 am and no wait!\n\nHash browns are exceptionally crispy and good and my egg white Mission omelet was really good....my plate in my picture shows the plentiful portion along with good sour dough toast.\n\nService was very good, not exceptional and our coffee cups were kept full.\n\nI'd return but if there's a long wait I will probably move on.", "author": "Randall F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-10", "description": "Waiter brought the wrong order to my friend, and after 5 minutes of waiting for new actual order he tells her they're out of the bun she needs for her french dip. Food was also meh.", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-12", "description": "During the busy brunch rush this weekend, I decided to go here for the second, and probably last, time.  I ordered an overcooked \"fish n chips\" and despite the name of the menu item, they were incredibly skimpy on the \"chips\".  \n\nThe main reason for the low rating is because of the service, or lack thereof.  We patiently waited till our name was only one of two, but after standing inside for at least 5 minutes grew irritated.  Not only did several servers walk past us as if we weren't there, but we watched as 4 tables opened up just waiting to be used.  We finally walked over to a table and asked if we could sit down.  Once finally being seated, it took quite a while to even be visited by our waitress let alone get some water glasses.  She barely spoke any words to us, didn't smile or ask how we were doing at any point - she never even made eye contact with us.  My impression was that they just didn't care.", "author": "Jamie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-05", "description": "Ate here after having just moved from Chicago to Noe Valley, and decided to bring my parents here as their first California Brunch spot for their visit. absolutely loved it! Decently priced, great vibe, love the artwork and the wait staff were super welcoming and accommodating.\nI specifically enjoyed the option to replace the side toast with a salad- was not expecting that considering the name of the place haha. Seriously made my paleo boyfriends day!\nI ordered the \"toast\" scrambler. Super tasty! Didn't need even a pinch on salt or hott sauce/etc. mom ordered the veggie omelet and loved it. Dad the classic Denver. \nI did find the coffee to be a bit overpriced at $3 a pop for just your basic black.. But I over looked this on the stars since I did enjoy it so much and happily made do by mooching on my moms coffee to make up for the price.\nWill gladly and definitely return :D", "author": "Diana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "It was a really nice Sunday brunch I had here. Long line but I was cool. good eggs Benedict!\nI liked the ambiance as well. Not a greasy spoon but a breakfast join!", "author": "Lizzy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-18", "description": "While you're waiting for a table for brunch, you could make a game out of guessing how many strollers/babies/dogs you see walking past. We even saw a stroller with two babies! No, it wasn't a double stroller - one kid was in the seat, and the other was bundled up in the storage bin underneath. Who knew stroller space would be as scarce as SF real estate?\n\nAfter waiting about 45 minutes for a table of four, my friends and I finally got seated (we lost count of the number of strollers/babies/dogs). My friend and I shared a TOAST COMBO (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=sQ3j-_JMC12bzVgLs1oKrw) and an order of croissant French toast. The pancakes and hashbrowns from the combo were decent (but anything smothered with syrup and ketchup, respectively, is good in my books) and I really liked the chicken apple sausage.\n\nI had high hopes for the CROISSANT FRENCH TOAST (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=M7eudIHtBgzFuxUYQeGDgQ) but it was a  major disappointment. The math doesn't quite add up. This is what I mean:\n\nCroissants = good\nFrench toast = good\nAnd yet, Croissants * French toast = meh\n\nTheoretically, croissant French toast should be double the goodness of the individual components. In reality, all the things I love about croissants (flakiness, buttery-ness, fluffy-ness, airy-ness) gets lost in French toast form. Instead, I was left with extra-greasy French toast :(\n\nI had a bite of my friend's BELGIAN WAFFLES WITH NUTELLA & STRAWBERRIES (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=aP92-9ez-0ism6Lhu9VX7Q) and that was scrumptious! But then again, I feel the same way about melted nutella as I do syrup and ketchup...\n\nToast is a good enough place for brunch (decent menu and average food), but not a place I would wait in line for.", "author": "Steph L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "This place delivered exactly what I was looking for. Nothing fancy, just tasty, fast, comforting breakfast food. \nI got a veggie omelette with cheddar, mushrooms, avocado, bacon, onion and tomato. It was delicious. The only problem was that there was too much bacon. Never thought I would say that, but it kind of got in the way of the rest of the omelette. \nThe coffee was bad. I did not like it at all. \nThe toast was actually quite good. \nThe hash browns were kind of the star. They were crispy and salty and perfect. \nThis place delivers exactly what it claims, which is solid breakfast. I will be back.", "author": "Cami J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Good breakfast and great service. The order came fast. The server was attentive and check on everyone", "author": "Sharon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "This place is okay. My boyfreind and I come here sometimes as a back up when Griddle is a few shops down is full. We prefer the Toast location on Church street, the food tasts better there... maybe it's the different cooks. Also the seating is better, especially ouside but they don't make milkshakes at the location on Church which is a bummer. The vanilla expresso shake they make here is AMAZING! Coffee is pretty too. But it's very noisy inside and hard to have a conversation, even when the person you are with is sitting directly infront of you...", "author": "Genevieve N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "I love Toast Eatery's burgers, French toast topped with mixed fruits, salmon sandwich with salad,  fries, vanilla milk shake, root beer float and their coffee. i come here often and they always serve high quality food. \n\nfor breakfast over the weekend, this place is always my top choice to eat.  last time my wife ordered a joe's scrambler, and she loved it!!!  my kids love their kid's size chocolate chip pancakes.  and me, i really love their coffee, strong and bold.\n\nthis is a very comfortable small place to eat in a nice neighborhood.  if you come on the weekend, you would have to wait in line.  if you come on the weekdays during lunch time or in the evening, it is very peaceful, relaxing.   the food come quick - always fresh and hot. the fruits are always fresh and sweet, especially their blue berry and strawberries.  \n\nthe service is good.  the servers are friendly and efficient. \n\ni love this place for 1 simple reason:  their food is good. i highly recommend this place for anyone here to eat.", "author": "Kentaro K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-26", "description": "I was wrong about Toast improving its food quality as they grew into the space.  Toast is not upgrading.  It revels in its inner blandness. \n\nThe place is always crowded.  They have found their niche.  But, the Toast-ettes appear to all be white-bread white people from the mid-West where \"spice\" is a four-letter word.\n\nEverything on the menu is something that I cook myself (okay, I don't cook red meat, but I could fry bacon the simple way Toast does).  Except when I cook it tastes better.\n\nI have cultured friends who rave about Toast.  I just don't understand.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-31", "description": "What I like best about this place is breakfast served all day --including Egg's Benedict, which not many restaurants would actually do.  I was here on a Saturday around 7PM and the place was pretty empty.  It's a boring place to eat, not much of a scene or ambiance --it's simple and uber casual.  The servers here are accommodating and friendly and that's really all that there is to it.  \n\nI ordered the Egg's Benedict and it is just alright here.  I didn't like their hollandaise sauce, which is an essential part to a good Egg's Benedict. The hash browns are a bit on the oily side but was still pretty good with a crispy outer layer.", "author": "Brenda T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-20", "description": "If you're craving Toast Eatery, I would stay far away from this one. The one on Church street has MUCH better food & service. This one has the snobby \"I'm rich so I'm better than you\" Noe Valley attitude. The employees and patrons here are always super snooty and impolite. \nDon't say you close at 10 and close at 9/9:30pm...unprofessional and lazy.", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "I came in today for a brunch and was greeted with smiling faces. The waitress that helped me was very helpful and immediately offered me something to drink. After a few minutes, I decided to try the Eggs Benedict. The plate came out in about 15 minutes. So, the wait wasn't too long. The food was definitely worth the wait. The hollandaise sauce was amazing and the eggs were cooked just right. I'll definitely be back. :)", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "Sunday brunch is soo good! Too many delicious choices, but I settled on the Noe Valley scramble: eggs with turkey bacon, onions, creamy green avocado. Hash browns were golden brown, crispy outside, soft potato goodness inside.  The toast at Toast (!) comes in wheat (good bread) and other choices. Friendly server who kept the full-bodied coffee cups hot and full. Will return over & over again!", "author": "René T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-12", "description": "I love breakfast places, and this eatery did not disappoint! I came for dinner, so it wasn't that busy. The waitress was attentive and friendly. The food portions are pretty big, too. I had the hash brown hill, and it was really delicious!", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-08", "description": "We used to go to the one on 30th and church, and the food was ok, but the manager or main waitress just made us feel unwelcome. it's a good location in the noe valley neighborhood with the opportunity to be a local's brunch spot, but it's a missed opportunity because you feel like you're in an airport chilies getting squished in and then shuffled out as quickly as possible.", "author": "Alyssa P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-31", "description": "This place has a really cool atmosphere and a wide variety on their menu - but I gave this place 2 stars for a couple reasons. I ordered the eggs Benedict which came with hash towns . The hash browns were under cooked and cold. The chicken apple sausage was delicious . The big no no for me was the service. Very inattentive and it took forever for us to be greeted. The mimosas were tiny and had pulp when the server said there wasn't any in there- obviously lacking knowledge. I unfortunately will not visit this location again .", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "Consistently solid. Still my go-to spot for a chill brunch. Great omelets, delicious hash browns, solid sourdough toast. Favorite: croissant French toast. One drawback: $2 for real maple syrup.", "author": "Kate C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "If you love breakfast then you'll love Toast.\n\nI love breakfast.\n\nTherefore, I love Toast. \n\n\n\n\nBig portions and a combo with eggs, bacon, hash browns and pancakes!!!!!!!!!!!!!!!!!!!!!!!\n\nThat's the food I imagine Heaven serves.", "author": "Marisa R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-03", "description": "I have eaten here before and it was really good.  I had the french toast made out of croissant.  That was a good dish.  This time i got the chocolate chip pancakes.  They were terrible.  The flavor was bland and the texture was rubbery. It was actually hard to cut it was so tough.  It was a very disappointing meal.  I did get a side of hash browns and they were delicious but come on, don't mess up pancakes!  They also charge $2 for maple syrup, who does that?  \n\nFor great pancakes go to Ella's or even Chow.  If you want the best pancakes I have ever had, go to Los Angeles and hit up Joe's for brunch on Abbot Kinney.  Ridiculous!", "author": "Mick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-28", "description": "Ham, eggs, hash browns, buttered wheat toast.....coffee, juice....ahhh....my perfect breakfast.  Quick and friendly service.  \n\nFirst time here as I was visiting my sister who lives in the neighborhood and Im-so-mad-at-her-for-never-bringing-me-here-for-breakfast!! What a great neighborhood eatery. Can get a little crowded, but timing is everything.\n\nLots of families with kids, so if you want a quiet breakfast, this is not the place.", "author": "Glo F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-21", "description": "Pretty standard breakfast fare with your standard set of sandwiches and stuff for lunch. Service is friendly but can be somewhat slow.\n\nIf there is anything of note to say about this place, its how well the food was plated. A lot of diner/brunch type places will just throw your food in a pile on the plate. This place goes a little farther and makes sure things are organized correctly. They also unwrap your butter slightly for you so its easier to access.", "author": "Will S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-19", "description": "This is an old review From 11/12/10 and while I DO really like the food at Toast I think it's important comment about the customer service i received back then..\n\n It's not difficult to acknowledge a customer with simple eye contact when they sit down at the counter, even if the place is full... Just glance at  me or maybe a little smile. It's called customer service.   I've never felt so ignored or \"iced\" by a waitress.  Get a personality, b/c your food isn't THAT great.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Went here around 10:30 on a Friday and didn't have to wait too long at all. \n\nLox scrambler - lox, avocado, tomato, green onion, cream cheese, capers. $11.95\nMaybe I was hungry or just really anticipating the smokey taste of cured salmon, whatever it is, i remember the first bite was really good!  I could definitely taste the different flavors of the lox, avocado, and on a nice fluffy bed of egg.   It was rich and filling, and had a side of hash browns and a choice of toasts.  For about $12, it was the scramble was enough for me being that I don't eat that much; I didn't get through much of the hash or toast.  You get a decent amount of lox and a pretty big dollop of cream cheese.  \n\nHash brown hill - hash, cheddar, sour cream, black olives, avocado, green onions.  $7.95\nFor the price you definitely get your money's worth, at least from what I could tell.  It's a pretty big mound of hash that's both soft --not mushy-- and that still has some crunch to it which I personally like.  My mom orders it every time we've gone.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Best Hash Browns ever. Love their scramblers and omeletes too. My husband really likes their burgers and wow, the bacon is so so good.", "author": "Niki A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "Decent food, but the coffee quality has gotten MUCH worse. If you're charging $3.25 for house coffee, you can certainly afford to offer something better.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "Where to begin. This might sound weird, but you could say i am somewhat of a milk shake connaisseur. I have traveled the land sampling this truly ninth wonder of the world, and have come to find this. I have enjoyed a torani bacon flavored milkshake in Alabama, buffalo-wing flavored in Kansas City, pancaked soy flavored in Tokyo, sweet potato flavored in Idaho, avocado flavored in Chile, butter chicken flavored in Mumbai, rau muong flavored in Vietnam, Vodka flavored(although looking back that might of been a white russian smoothie) in Moscow, and Kushari flavored in Egypt. However after tasting all of these incredibly unique milkshakes in every corner of the world, when asked by some of my esteemed colleagues which one was my favorite. I simply replied, The strawberry milkshake at Toast in the Noe Valley neighborhood of San Francisco. It had a thickness that was unparalleled. A creaminess second to none. A perfect Albion strawberry flavoring that would make the Queen of England step down. \n           Having said all that, that wasnt the only component that lead me to this decision. The final piece of the puzzle was the service. This little magenta masterpiece was served by this enchanting women named Erica. She was the friendliest, most professional little service assassin i have ever encountered. I also dont want to sound fresh here, but trust me, she was not too bad to look at either. she had a smile that would make the Dos Equis most interesting man in the world blush. I had breakfast there a week ago, and Erica's heartfelt handmade strawberry milkshake truly transcended the most magnificent mornings that this old chap cares to remember. Well done lassie!!", "author": "Pete P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-06", "description": "I came here twice with a friend that recommended this place because he's so in love with Egg's Benedict.  My first time I tried the regular Egg's Benedict with Ham and hash browns.  It was good but I am not a fan of ham so the next visit, I tried the salmon egg's benedict without hash browns but with salad.  I was very satisfied!  Good customer service and quality food. I am willing to come back. =) \n\nDownfalls: Parking sucks because its a busy area and its within a residential area.  I also tried their Chai tea but I am not a fan of their Chai Tea because it had a weird spicy taste that I am not use to.", "author": "Sharjah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "Anyone who knows me knows that breakfast (or, more specifically, brunch) is my favorite meal.  Blame it on the mimosas, but I am probably as close as you will come to a certified brunchologist. \n\nWhen I'm in town, I frequent both the 24th Street and Church Street locations of Toast, although I have never ordered a mimosa here and don't know that they even have a liquor license.  (Really should check into that.)  They do have pretty much everything else -- from Mitchell's ice cream to cupcakes to dinner food made with fresh local ingredients. \n\nThe decor is clean and simple and they have some really flavorful organic teas.  The combination of flavors of some of their omelettes is great.  The pesto in the Sicilian is perfection with the sun-dried tomatoes, spinach and feta.  (If I weren't Jewish, I would SO be Italian.)  I also like the eponymous Church St. and the 24th St. omelettes. \n\nHowever, the egg part of the omelette is always really thin.  It's more like an egg crepe than an omelette.  I don't know if they use two or three eggs, but I'm guessing it's two and I'm also guessing that's a cost-saving decision.   On the plus side, I believe they use cage-free eggs.  Similarly, depending on the day, the Italian sausage is either like the size of my palm or a the size of one finger.   Maybe that's just how Italian sausage is, but I've dated only two Italians so I don't have much of basis for comparison (ba dah bump).  \n\nThe prices are reasonable -- most breakfast entrees are $9.75, but where they make up the difference is on the sides, which fare about $3.75.  If you tend to forgo toast and hash browns and need something else on the side to fill you up, the sides add up. \n\nOn weekends, it's easier to get a seat at the Church Street location.  Twenty-fourth almost always has a wait on Saturdays and Sundays before about 1 pm.\n\nToast has enough going for it that I will continue to spend money here.  It may be a better value for those who eat more simple carbs -- ya know, like toast.", "author": "Ms C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-29", "description": "I would've given this place 3 maybe 4 stars, but the customer service brings that rating down to 2 stars.  We have been here a few times and the food is ok, tasty hash browns, fries and grilled sandwich, but not worth having to put up with a rude manager.\n \nLast time we went we got there right before 11am on a Tuesday, so the place was pretty empty.  The waitress told us we could sit anywhere, in fact she pointed at the 4 chair table next to the window.  We are only 2, but decided it was a nice spot, plus there were PLENTY of 4 chair tables open.  Right after we sit down, the manager comes running over to tell us to please move to another table! She mentioned that rush hour was soon and that she might need that table.  Really? rush hour? on a Tuesday? the place was empty! Anyway, we moved tables since we were starving.  About 20 mins later, another couple sits on the same table and she does the same thing! The place is still empty! I dont know what is up with her and that table, but if your customer is sitting down, its just RUDE to ask them to move just because of the possibility of a bigger group needing the table.  I would understand if its crowded, but the place is empty!  What I really liked is that the couple refused to move and she had to serve them there.  Yes, we left about 45 mins later and the place was still empty with plenty of 4 chair tables open!\nI doubt we will be coming back, unless we are starving or ordering take out (not sure if they even do that).", "author": "J B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-19", "description": "Toast is good, more like 3.5 stars than a 3.\n\n    The service is good at Toast, the food consistant and consistantly good, and they make a mean Mimosa.\n\n    The wait can be long because the place is always packed at breakfast, so be prepared to wait outside on 24th street if you come with two or more people.   As a lonely loser, I usually get counter service without a wait.\n\n   For breakfast, I like the Eggs Benedict.  It can be a bit much, but you only live once.  Served with yummy, crispy hash browns.\n\n   For lunch/dinner, I usually get the Hummus sandwich, veggies and sprouts and hummus and avocado served on, get this, toast.  Filling AND healthy.\n\n   I've not been impressed with the Philly Cheese Steak.  Just sayin'.", "author": "Bad Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-21", "description": "Came here for the first time this past weekend. Parking can be nutz, but that Noe Valley for ya. I just dropped off my friends while I went to find parking and when i got to the restaurant, they got seats already! YAY! \n\nI ordered the breakfast sandwich w/ ham, my friend ordered the corn beef hash, and the other one ordered Toast combo with the chicken apple sausage. My friend said his apple sausage was bland, eggs were good, pancakes was alright (nothing special), and the latte was good. My breakfast sandwich was alright - yummy. My other friend said her corn beef hash was good. \n\nWe all agreed that Toast does give you big portions and was worth the price. We all loved the hash browns which was awesomely crispy. \n\nI would definitely be back, especially for the hash browns.", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Only went here once, but would go again.  Food was a bit on the pricey side, and despite having toast in its name, the toast was rather subpar; however, the omelet I ordered was rather good and so were the hash browns.  The service was decent as well even though the place was packed for breakfast.", "author": "Brendan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "I've got a pretty big weakness for big plates of unhealthy breakfast food, so this place is right up my alley. Can't really comment on the non-breakfast items, but the scramblers and omelets are all fantastic, and all the prices are reasonable.\nIf you're coming in on the weekends, I highly recommend trying to hit off-peak hours. The wait can be pretty insane in the 10:30AM to 1PM range on Saturday and Sunday.", "author": "Pat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "Dear Toast, \nI love your pancakes.\n\nExcellent service,grubbin food, consistent, quality ingredients, reasonable prices and a neighborhood favorite for a reason.  BOTH locations :)\n\nWhy are people afraid to wait a little for a good breakfast?  If you're so hungry, try to cook your own grilled cheese so you don't biatch about the price of having to buy one! \n\nI think the waitresses are all pretty damn good or they probably would be let go already.  Maybe some people missed the memos on the economy. Do you know how many people would kill for a waitressing gig at a popular, consistently busy, worth-the-wait-kinda breakfast joint in SF?\n\nJust because some masterDouche had an isolated bad experience here, Toast rocks.  I go there enough to judge honestly and am mad at myself for not yelping sooner.  Funny how the brain works when you have ADD.  :)\nLook people, welcome to life.  And welcome to restaurants.  Screw-ups happen.  Not everyone is on  their A game 100% - are you?  It's HOW the inevitable slip up gets handled and it sounds to me like Toast handled it just fine.  I find it entertaining how the same person who gives a one star gives one stars everywhere.  Smells fishy, ground Chuck D.\n\nI'm going to enjoy Toast Eatery this weekend, maybe I should invite Chuck,  scratch tat. I don't think there will be room at my table for his ego.\n\nI have 2 Toast Tshirts by the by.  I wore one while I was in St Louis and a couple stopped me because of my T.  I don't think it's just the neighborhood that are fans.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-09", "description": "We come here almost every week for brunch. SUPER QUICK turnover rate - if there's a few tables in front of you, just wait a few minutes. This is probably in part because their waitresses are all closet ninjas.\n\nI judge brunch-makers by their hollandaise. Toast house my favorite hollandaise in the city. Combined with their perfectly-cooked hash browns, that's a killer brunch. Or if you're into something sweet, get their seriously delicious fruit & nutella waffles. Also, don't forget to order a mimosa.\n\nInexpensive, delicious, & fast. I love you, Toast.", "author": "Celeste R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-13", "description": "Toast, please do better.  You're so ordinary, like a Waffle House in a better environment.  Bring some creativity to the menu.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-08", "description": "If Toast, the restaurant, were toast, the food...what kind would it be?\n\nSourdough.  Very San Francisco, a step up from white bread, tasty, but not too \"out there\".\n\nThis new location looks a lot like the original one on Church, with more room.  Everything about it is clean and organized, including the food.\n\nImagine that you are at a diner and your food comes out looking exactly like the picture on the menu, instead of a thrown-together, fat-laden, mess.  You'd probably be happy with the healthier choice, but you might kind of miss the greasy spoon taste.  That's how Toast feels to me.\n\nMy lovely lunch date Kristina had a scramble, which came with hash browns and toast - it was good.  I had the Chef's Salad with house-made poppy seed dressing.  While I could appreciate the quality of the ingredients (Niman Ranch meats), it was a little bland, and seriously under dressed.  I asked for more dressing and that helped somewhat.  We shared the apple pie for dessert which was just ok.\n\nI think they are doing well, judging by the weekday crowd that was in there the day that we went.  I can see why - it is a reliable choice.  Service was nice, so no issues there.\n\nI like Toast, the restaurant, but just like toast, the food, it's not something that I'll get overly excited about.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "Wow...this place was so good. I came here for an early brunch on Saturday morning. They have a wide selection of omlettes and pancakes you can choose from.  I ordered the Joe's omlette with some meat and veggies. It was one of the best omlettes I ever had. The hash brown was also good as well. I was surprised it wasn't too packed. I was afraid it would be jam packed on a Saturday morning. \nI did see chocolate covered pancakes with bananas that someone else had ordered. I am definitely gonna try that out next time. \n\nI was pretty filled after the meal and had no regrets. If you're ever in the San Francisco area, and looking for a good breakfast, brunch or lunch, definitely try out the Toast Eatery.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "American diner food. The waffles and pancakes are decent, but pretty much the best in the area. Their omelets are amazing. Good service.", "author": "Will D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "It's my first morning of a one week stay in Noe Valley. I spotted Toast Eatery on my morning walk down 24th St. It's got a breakfast diner feel with about a dozen locals eating when I arrived at 7:45am. I was quickly seated and served coffee. The coffee is a little bold with good body and finish. I ordered the Godfather Omelet which consists of italian sausage, red and green sweet pepper, onion, mushrooms and american cheese. It was served with a half plate of hash browns and 2 large slices of toast. the hash browns were properly cooked with a nice crust on the outside and warm in the middle. The omelet was full of flavor! The peppers, onions and mushrooms were sauted to the right texture for an omelet. I would. order it again. The server kept my coffee filled and delivered the check before I finished (I appreciate that). The meal came to $15.44 without tip (coffee was $2.95). It was a lot of food and I didn't finish the toast. I do not understand some of the mediocre reviews. My experiance was enjoyable while tasty and filling. I will be back and recomend Toast Eatery to others.", "author": "Lenny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "Great eggs benedicts.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "Been here a couple times. I've ordered eggs benedict and florentine here before and wasn't super impressed, but not disappoint either. I really don't like their hash browns though. There isn't enough to sop the sauces and yolks and the square shape bothers me. Other people I've been with have been disappointed with proportion sizes but were generally happy with their meals (such as the French dip sandwich). If you arrive at the right time on certain days, the bowl of fresh fruit is truly amazing and the freshest I've had in any restaurant.\n\nLast time I went was for my 21st birthday with a friend. But on my birthday, my friend and I had the waffle with strawberries and it was the best waffle I've had in a while. \n\nBeverage wise, I usually stick with orange juice, but I got a mimosa which was to my liking. The ratio of alcohol to orange juice was perfect. I'm tiny for the most part and not a constant drinker so if I get something strong, I usually have to make sure I eat a lot to sop it up. This was not the case though, which is why they get a 4.", "author": "Joanna A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-22", "description": "I had the veggie omelette--fresh, crisp veggies galore!  \nPortions = hearty\nPrices = good\nGreaseless diner food rules!\nService = friendly and attentive.\nDecor = shade of toast. Trust me.  But I do like the artwork on the walls!\n\nI'll have to come back to try their sammiches!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "If you would like a good breakfast and you're in Noe Valley, do not hesitate to order one here. I had the Church Street omelette, Avocado, Spinach, Bacon, Onions & Cheddar, and it was excellent. Coffee (beans from Mr. Espresso) was very good. My wife had the hash benedict, and that was great also. The portion was just right, not too HUGE, and definitely enough. Pleasant wait staff. Lot of people like the hash browns, including my wife, they were not my favorite - crispy on the outside, kind of mushy except for the browned cripy part. I paid the extra 1.75 for fruit instead of hash browns, and the fruit was good.", "author": "James P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-20", "description": "Skip the pancakes.  Skip the bacon.\n\nI was truly disappointed with this morning's Toast Eatery experience.  My husband and I shared a full order of buckwheat banana pancakes with a side order of bacon.  The pancakes came out cold and very dry.  The bananas were on top, not cooked into the pancakes (but I should've asked about this).  The bacon was AWFUL!  It tasted like it had been doused in flour, then ironed.  Yuck.  \n\nI would not eat here again if I hadn't had three better experiences.\n\nStick with eggs, hash browns, and toast.  I've had several yummy breakfasts at Toast following these guidelines.  I've also enjoyed a delicious pear salad for dinner.\n\nLesson learned.", "author": "Kristin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "I want to give this place a 3.5, but since Yelp doesn't allow for half stars I am giving them a bump up for doing one of my favorite sandwiches well :)\n\nI met a friend here for lunch on a Friday afternoon. The wait wasn't too long and the atmosphere was light and casual.\n\nI ordered the reuben which was made with  a great quality corn beef, swiss, ranch on rye.  Quite tasty! What got me was the meat quality. I'm happy to say that it wasn't fatty and was still very flavorful.  I got hash browns instead of the fries and was very happy with my decision.\n\nThe service was good and the price was right.\n\nThey serve breakfast all day so next time I am going to dig in to some pancakes :)\n\nSimple food done well at a good price.  What more could you ask for?", "author": "DJ N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Last time I went here there was a line out the door, but they did a great job of seating people fast. And no doubt the food is very good.", "author": "Oliver B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "I wanted to treat my friend that helped me on a photoshoot. I told her to pick a brunch place and though I don't like waiting, it's a sign that people in the neighborhood likes it.\n\nNice breakfast and most of all a great compliment to the wonderful strong coffee. Extra star for  the coffee!\n\nGreat waitress too.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-09", "description": "Menu items are way over-priced.  A fountain drink was $2.50 and a BLT was $9.75!\n\nThe bacon was more fat than meat and the tomatos were pale.\n\nThis restaurant re-uses Heinz bottles with lesser-grade ketchup.  How weak is that?", "author": "Hank S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-15", "description": "The service was terrible but I don't believe that 1 star is warranted based on a bad experience, with a miserable restaurant manager with poor customer service skills, alone. \n\nBut 1 star is absolutely warranted if the food is awful, poor quality AND overpriced!!! I ordered the breakfast combo of eggs, hashbrowns, ham and pancakes. It was the Denny's Grand Slam - except it cost $10.95!!! My brother ordered a scramble, literally came with two slices of american cheese melted on top - super classy! The entire table was extremely disappointed in the food - extremely!\n\nWe did have an awful experience with a woman whom we assumed was the manager, though given that she acted so incredibly rude, it now seems doubtful. I don't need to go into that, but did want to take the public opportunity to let her know that the entire table thought she was a ..... less than pleasant person.\n\nWe left the place feeling rather regretful that we strayed away from our usual favorite restaurant - Savor, right down the street. Better food, better service, better atmosphere - same price. Delicious savory and sweet crepes, breakfast all day,  seasoned home-fries (not some disgusting, greasy, Denny's style hash-browns), the same staff has been happily working there for years, yummy burgers and sandwiches, incredible salads and pretty much every dish comes with an amazing side salad, creme brulee is a secret item not found on the menu - order it, awesome back patio with heaters and an awning, the cooks are jolly happy guys that do good work. Go there instead and leave a much happier yelp reviewer!", "author": "Michele C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-27", "description": "I loved Toast and will certainly eat there again. For their delicious food I wrote a haiku of praise. \n\nAdorable Toast\nSan Francisco's tiny treat\nYou make breakfast good", "author": "Lee P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-18", "description": "I wouldn't judge them quite so harshly if their prices weren't so gouge-y. You walk in, and no one greets you for quite a while. The food is okay (but may be getting cold by the time it arrives at your table), nothing special, AND you'll pay big for it. That was Toast's last chance and I won't be back.", "author": "Kathy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-22", "description": "i love the place not as much as i should do.\nthe service again, you better be \"lucky\".\nthe bosser works harder than the waitress", "author": "B H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Awesome place!! Great atmosphere and d'lish food!! Service was good and I really enjoyed myself!!!", "author": "Mateo J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-21", "description": "So I walked in wanting something on the healthy side to eat.  I passed by and saw a dude eating a very delicate salad. So I'm in.... The place looks like a french bistro/retro diner. I sit at the bar area.  Ordered a hummus sandwich with avocado  and a salad.  The hummus had way too much tahini in it.  So much, in fact the nuttiness tasted almost like some food that was scorched in a pot. The funny part about it was that the amount of hummus was barely there.  Like you would dress the sand which with very little mayo. If there was anymore hummus on the sandwich I probably would have gagged.  Their greens were tasty though I guess overall it hit the spot for what I wanted at the moment.  Service is ok. I'll give it another try. BTW bring your own salt.", "author": "A K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "My go-to place for comfort food and all-day breakfast! Lines could be long especially in the morning, and orders could take a while especially when packed, but don't hesitate to remind them about your order.", "author": "Thea T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-19", "description": "Food is not bad. American diner cuisine. If you're looking for a quick meal without any expectations of exceptional quality, this is the place for you. It's in a charming area in Noe Valley. Lots of people watching. I find the service to be very nice. Parking may be difficult on weekend morning. But I'd definitely say try it out.", "author": "James M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-25", "description": "The food we had was very average.  The veggie burger was too dry to eat without applying heaps of condiments. \n\nAnd DO not come if you want a kid free environment.  We ate there on Friday night (7pm) and the place was packed with kids (50% plus).  \n\nThe only plus was the efficient service.", "author": "Aus B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-07", "description": "I have been living in SF for about seven months now.  I have visited Stacks, Just For You, Farmer Browns, and a few other breakfast places.  All great.... But TOAST has me writing a review.  I was going to give it a solid 4 stars, but after reading what others had to say I had to give them an extra star because I think some of the bad reviews are way off the mark. \n\nI had the French Toast and it was GREAT! My wife had a Waffle and her cousin a scramble.  It was all good stuff! \n\nI also liked the service, and the people that were eating in the joint.  They also had a GIANTS flag up and nice art! \n\nd", "author": "Dominic A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "Great French fries. Decent Mac n cheese for kids.", "author": "olivia b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "WOW!\nYou know what Yelp? You're a better adviser than a crowd. Unfortunately I learned this the hard way.  I didn't check the reviews for Toast, but decided to brunch there because there is ALWAYS a line out front, usually a surefire indicator of a tasty treat.\n\nI guess the Noe isn't tuned into the Yelp.\n\nIt was warm and pleasant, with Sirron Norris illustrations on the walls.  Menu looked good, coffee was probably the best cafe coffee ever.  Rich, dark, earthy.  The waitress was super nice.  It seemed like things were going well.\n\nBut then the food, oh dear lord, the food. The presentation was terrible. Eggs, toast, and undercooked hash browns just plopped on a too-big plate. It was a decent meal that appeared tiny and unceremoniously prepared.  The food was alright, but nothing I'd ever rave about. Why, Toast? You look like the kind of breakfast spot that knows how to make a stellar meal, but you just didn't deliver.  \n\nSomeone should go undercover to St. Francis to see how it's done. I volunteer!", "author": "Mari C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-03", "description": "For a place with a waiting list and people lined out the door I thought it would be better. The menu was standard fair and not many options for lunch. I got the Eggs Benedict with what I thought was bacon but was more a mixed round slice of processed ham and hash browns. The servers must've been really busy b/c a refill was hard to come by.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "Pretty good breakfast spot. I have been pleased every time I have been. Though, I usually stick with lunch choices.The burger on a sourdough baguette is my favorite!", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-02", "description": "Pretty good food.  Great ham scramble and corn beef hash.  But the corn beef has did NOT sit well in my stomach.  Probably too greasy.\n\nIf you're a lonely, horny guy, grab a seat at the counter.  There's one waitress who would constantly brush her boobs along the counter while taking your order.  I mean to the point my husband openly asked me \"Is she trying to show me her boobs?\"  I recommend every single, straight guy to have breakfast there.  She works on Saturdays :)", "author": "Yvonne Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-26", "description": "I FIRST WANT TO GIVE A BIG SHOUT OUT TO MY TOAST EATERY GIRLS:  \n\nCHELSEA\nJESSICA\nTRACI\n\nThey made me feel so welcome tonight.  I hate dining alone but I felt like I didn't because these girls made me feel like I had company.   And best of all they didn't even make a bad comment when I went healthy with my AMAZINGLY GENEROUS chef salad but I ruined my healthy attempt with the most delicious item to come out of that kitchen - HASH BROWNS (read my Yelp review of Toast Eatery on Church).  I have already warned them I am coming in drunk one night and ordering the plate of hash browns with the sour cream and black olives and all the other good stuff!  \n\nI have been anticipating the opening of this place for close to a year.  I spilled the beans about it to my favorite blog sf.eater.com I have been peaking in the window wondering about the progress.  Well folks if you were die hard Herb's (may they rest in peace) please don't take your Herb's attitude to Toast.  It is a different place.  BUT THEY DID GIVE A NICE TRIBUTE TO HERB'S.  Just look at the big piece of toast hanging above the restroom.  You will understand when you go in and check it out.  \n\nI tell you don't wait, RUN, get in there, because this weekend is opening weekend and it will be crazy.  Those Noe Valley people who don't travel beyond the confines of 24th Street will kick themselves that they never made way down to Church and Day.  \n\nI was excited to learn they are open until 10:00.  Not sure if that is all nights but tonight they most certainly are open until then. I say if Pomodoro can do it so can Toast.  \n\nI just hope on Saturday and Sunday mornings they don't kick me out for bringing in my BERNIE'S COFFEE from across the street.  I love a good Bernie's and so does the rest of the hood.  My prediction is in due time it will be on the menu as well. \n\nSeriously this was my first dinner experience at my favorite breakfast spot.  I will be going back over and over again.  (Shhh inside scoop...maybe they will be putting some dinner items on the menu as time goes on!)   You didn't hear that from me.\n\nMy mornings will be forever changed when I walk out the door of my apartment building and smell the yumminess of the place we call Toast Eatery.\n\nChelsea, Jessica, and Traci hang in there girls you are going to get lots of business but remember...I gave you the first shout out! \n\nThanks from the guy who lives across the street!", "author": "Scott P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-19", "description": "so so food for a lot of bucks.  I ordered the Toast Scramble with tofu instead of eggs and was it real boring.  Even the mocha I ordered was sleepy.  I was with a large party and there were some who were happy with their meal.  Just an average place with average food.  I agree with the Denny's reference from an earlier review.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "I live nearby but only came here after over a year. The lines outside on the weekends scream \"hipster joint\", but when I set foot inside on a weeknight for some dinner take-out, the ambiance was more locals' family-friendly establishment.\n\nChicken cheese steak and corned beef hash are both appropriately greasy and tastily spot-hitting.", "author": "Rob T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "As someone who lives in this neighborhood, this is definately one of the best places to grab breakfast/brunch in this area", "author": "Nate W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-24", "description": "Yuppy Denny's.  Buckwheat Pancakes had a strange after taste.  Hash browns were frozen.  \n\nPrices were not too high... service was good.... thanks for the NO stroller rule\n\nother then that...  this place is so-so", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-16", "description": "I am constantly impressed with the service whenever I come here. The food is always amazing, and the prices are extremely fair for the amount of food you get. I always tip generously to the servers who are there in the mid afternoon, and they are extremely nice! Thanks Toast for giving me my crack. Breakfast food!", "author": "Keenan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "I love that this place is called an \"eatery\" versus \"restaurant.\" I love that it has toast-inspired art on the walls. I love that it has big windows and sits in the heart of Noe. I did not, however, love my brunch.\n\nBased on recommendation, we took our out-of-town visitors to Toast for brunch on Saturday. There was about a 20 minute wait which wasn't a big deal. The five of us were seated and handed menus. I noticed that the prices were about $2 more than my favorite brunch spot, Lower Haight's The Grind. They even had my lox scramble, but for $11.95 I decided against it.\n\nThree of us ordered eggs and two ordered salad. My turkey scramble tasted fine, but the presentation was a D+ at best. The eggs had a square of cheese poorly melted on top, and the hashbrowns were also a crispy square, cut from a mold. It was also a pretty small portion, although I support their efforts at portion control. My friend ordered the salmon salad, and having asked for no bleu cheese, got a bed of greens with a formerly-frozen looking chunk of salmon and a few cherry tomatoes. Another friend commented that her salad was bland. I can't say that I need to go back. Next time, I'll check out a Noe bakery for brunch.", "author": "Emilia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-13", "description": "So, I have passed this place on the 48 bus many times and always see lots of people eating here for lunch. Today I stopped for lunch and ordered some classic Eggs Benedict. I believe that if you serve eggs benedict you know how to make it well, considering that there are 4 main ingredients: Eggs, toaster muffin, Canadian bacon, and Hollandaise sauce (which is mainly butter and lemon juice). The egg was cooked correctly and the muffin was toasted right! Yay! The bacon was too chewy and I could barely cut it. The Hollandaise sauce was horrible! Where the heck was the paprika?! It was just bland and boring. Plus, the hash browns were nothing special and sat on the plate in the shape of a square. Shouldn't it be piled high in a beautiful mound of crispy potatoes? I think so.\n\nSo the food was blah. I ate half of my food, which totaled to $12.03. However, this was only half of the bad experience I had here. The \"chef\" at the grilled was creepily staring at me the entire time I was there! It was so awkward and made my dining experience just that much worse.\n\nMy suggestion is to stay on the 48 and pass this place by...", "author": "Briza Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-16", "description": "My review here is for the new Toast on Polk & Sacramento. I'm assuming it's the same owners/food/management rules.  \n\nI ate there for the first time ever.  The food was so-so; I had a cheese and mushroom omelet.  The mushrooms tasted canned and the hash browns were one of those pre-frozen blocks. The price was too high generally but specifically because they add a 4% charge for \"San Francisco Health Ordinance\".  The prices in my opinion were high enough to cover them paying for their employees health benefit.  This is only charged to those businesses that don't (provide health insurance). It's up to the employer to pay NOT the customer.  \n\nI don't think they will change this surcharge. I don't think I'll eat there (or at any of them) again.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-10", "description": "Noe Valley NEEDS more breakfast joints! \n\nI thought it was hilarious that there is a Toast on 24th AND one on Church Street, both competing with Chloe's and Starbucks... yet there was still a line out the door at one o'clock in the afternoon on a Sunday! Annoying! \n\nWaited 30 minutes out in the rain with my 8 months pregnant sister for some dang eggs and hash browns...\n\nTotally worth it!\n\nOnce we FINALLY got seated the food came fast and hot, the coffee was strong, the omelet was AWESOME and the service was efficient (maybe not friendly but as long as I get a smile and the coffee/water/food comes quickly I don't really care all that much!).\n\nOnly reason I knocked a star off was watching the bus-person clean off the tables was maddening. Like molasses! AND got 'tude from one waitress when I asked her if they were going to start seating people in the two empty tables I saw sitting in the window for 20 minutes! Turns out they were waiting to seat a large party. If she'd told me that nicer maybe I'd give five stars???\n\nAnd! I think they need to open a third and fourth location in Noe! \n\nWe like breakfasts and brunches in San Francisco!", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-02", "description": "I find it funny how people that are not from a particular neighborhood will talk shit about going into another neighborhood. If babies and dogs offend you. Keep your ass in your own neighborhood and stop being a whiny bitch. \nThe menu isn't creative. It's a tad expensive, but I know what the rents go for on this street and all the lovely taxes that business owners pay. \nToast beats the hell outa Denny's or whatever shit hole you can eat at for less. Pick your poison. This place is a diner. What do you expect? \nThe chefs salad is awesome. The Reuben sandwich is great and so is the hot pastrami. Get the sweet potato fries. The regular ones get cold easy and taste like a rubber band. \nThe service is decent enough. I'm not asking for a happy ended with my sandwich. I'm the kinda guy that wants my food and be left alone.", "author": "Deejay K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "I have been visiting SF on the weekends now for a couple weeks and drinking heavily. After waking up groggy on a Saturday morning i love coming here to chase away the hunger pangs. Good ole fashioned American style breakfast like mom used to make. Its so good in fact it almost makes me want to move back to the Midwest. Almost.\n\nI think i am starting to wear on the servers patience but sometimes i like playing the part of an annoying hungover gay guy. Or maybe she thinks im being cute... who knows. \n\nAny they have espresso vanilla milkshakes! you owe it to yourself to enjoy one with each meal. I do!", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-24", "description": "While visiting San Francisco on vacation we stayed in Noe Valley.\nToast was our last breakfast stop before heading to the airport on our way out of town.\nWe had heard it was great, but we were disappointed.\nThe food was Ok, not spectacular, and the prices were higher than expected.  That coupled with the unimpressive wait staff and the experience was not memorable.\nThis was a bit of a letdown given the other excellent restaurants we had experienced up and down 24th while in town.\nWe'll look for an alternative for breakfasts when we're in town again.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-10", "description": "Really noisy. A lot of small children (and parents who make no attempt to quiet them). Bad acoustics add to the mix. \n\nFood is average at best (mosty cold when it finally gets to you).\n\nWaitress with an \"attitude\" but with reason: only one waitress for the whole restaurant.\n\nPlace to go if you're living in Noe Valley and don't care about ambiance, quality or service.\n\nWouldn't go back. Much better places all around.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "Toast is fast becoming my favorite brunch place. It is within walking distance to my house, not too hard to get a seat on weekend if you go early (10ish), and it has all my food needs: aromatic smooth coffee, solid good wheat/rye toast, fruit substitutions, and scrambles that can be made with tofu. I have recently found that egg scrambles are a bit too much for my stomach in the early mornings, so have started trying tofu scrambles everywhere, and somehow this is the place that just seems to get the combination of flavors right. I've tried the veggie and joe scrambles w tofu and both are excellent! And someday...I'll indulge myself in their fruit stacked pancakes!", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "Came here with some ladies for some brunch.  I got the Noe Valley scramble and it was quite good for a good price!\n\nThe service was nice and it  was a cute place!", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-20", "description": "The food is pretty good and a nice portion for those of us who can't get enough food when it comes to brunch. =) \n\nThe omelette's are pretty tasty and a decent size as are most of their dishes.  Pancakes... well... are just pancakes...  \nI usually do the create your own  omlette..egg white.,. spinach.. mushroom and cheese.. sometimes it comes out a bit greasy but that has been on a very rare occasion. \n\nIt's usually pretty crowded and sometimes can be a bit overwhelming when you have a bunch of people waiting outside. It's also pretty small so if you are claustrophobic you would have a better time at a place that has more space.  ( not as small as the one on church street though) \n\nOverall a cool place to go for breakfast/lunch.\nMake sure you give yourself ample time to find parking though. Sometimes it can be kind of a pain.", "author": "Lisette E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "It started at about 5 pm on Saturday, a fifth of the way through a bar crawl that wound up with me tossing around an inflatable killer whale balloon in the back of a taxi cab. I got it in my head and I wasn't going back.\n\nI hungered for it. I desired it. I told all my friends and they were horrified that I would discuss such a thing at a bar crawl. I told my boyfriend and he shrugged it off as the passing whim of a drunk girl.\n\nWhen I woke up Sunday, the craving was still there. And this time, the boy wanted it too.\n\nOh yes. A chocolate milkshake would be mine.\n\nToast's milkshake, in particular, was able to alleviate the sugar pangs of hangover hell. Extra thick and made with what seemed like dark chocolate ice cream and topped with a pile of fluffy whipped cream, it was perfect. \n\nThe whole menu seemed diner-ific and therefore ideal for what we needed. We both had the house-made corned beef hash, which was nice and hearty. The combination of the salty hash and the sweet shake served our headaches and rumbling bellies well. The 30-45 minute wait was long forgotten when we sat and ate in gluttonous silence.\n\nMy only complaint really comes from the amount of people stuffed in the restaurant. We were elbow to elbow with the neighboring tables and actually wound up exchanging pleasantries with both, but had I felt better perhaps I could have mustered more than a few well-intentioned grunts. \n\nOh, but that milkshake. It was worth it.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-18", "description": "Contrary to what some people believe, just because you take bread dough and bake it into a torus shape doesn't mean it's a bagel.  Call it lox and round bread, at least it won't be false advertising!\n\nAnyway, I appreciate the fact that you can get breakfast for dinner here up until around 9pm. That's such a rare thing to find in the area, heck breakfast for a 5pm dinner is hard enough! The food is generally pretty decent, and the menu is fairly vast with many breakfast and lunch type choices (from oatmeal to hamburgers) and the service is around what you would expect for a diner in Noe (a cut above standard diner service). \n\nI'll go back, but the bagel thing just rubs me the wrong way!", "author": "neil c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-16", "description": "A solid breakfast place that is hurt by their own popularity.\n\nThe problem with Toast is the wait.  If it's sunny out and everyone's outside and you'd like to get breakfast at decent hour you'll wait for more than 30 minutes.  This is a due both of the facts that the place is small and very popular.\n\nOn the other hand there are good things-\n\nFood.  Good variety of breakfast item with consistently solid quality.  The hash brown is always crispy, the fruit always fresh.  I like their ground turkey omelette a lot (I think it's called \"Mission\").\n\nPrice.  Decent price of about $12 per person which is a fair amount for what you get.\n\nLocation.  Right in the heart of Noe Valley shopping area and there's a lot to do in and around the hood. On a sunny day it's a good way to start the day to have breakfast here and then walk around the neighborhood known as 'stroller and doggie country'.", "author": "Andi H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-19", "description": "Cute little diner. I got the Corned Beef Eggs Benedict.  Coffee was filled promptly refilled. Service was very good. But nothing really wowed me about this place. It's a nice, convenient place for breakfast in Noe Valley, but I'd rather spend a little more money and go somewhere a little nicer.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-31", "description": "Meh.\n\nThe Good: Open before 10 AM midweek in Noe Valley, diverse menu, efficient service.  \n\nThe Bad: Boring food, over-mediated diner decor as predictable as the food.  \n\nThe Ugly: N/A\n\nPoints for speed. Was in and out in about 30 minutes. But had no desire to linger anyway. My sourdough French toast was fine. Other dishes on the table looked equally filling but unexciting.", "author": "Mikol G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-08", "description": "I was hoping for better but there are many places out there better than this place.  Long wait outside but I do give them credit for their good strong coffee", "author": "Pedro U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "I hate how small this place is, not the best place to go for groups but i will say it makes up for it with the food.", "author": "Paulina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "Noe, you give me so much that is good in the world - sunshine, parades of dogs, battalions of baby strollers, coffee, and peace and quiet.\n\nBut even in my podunk hometown, Toast would fare about average, and average is me being kindly.\n\nYour food is like a blockbuster movie I laugh through because everyone else is laughing and I feel weirder not laughing than faking it.  The relative who slaves away cooking a Thanksgiving feast when at the end of the day, the turkey just tastes like turkey, the green beans, like plain old green beans.  The friend who extols the virtues of Thomas Kinkade.  The baby that attracts hormonal females when you secretly find him \"weird looking.\"  [In fact, if your food were weird, I might like it even more.  Don't ask, I can't explain.] \n\nI may only walk a few blocks to reach your door, I may only wait a few minutes to get one of the coveted seats (stuck between the dad and kid duo and the hipster couple with the loud yapping girl who's clearly annoying her boyfriend), I may continue to shadow your doors when the boyfriend is in town . . . \n\nBut even that is not enough.\n\nI applaud you on being able to keep your food at perfect equipoise between disappointing and memorable. I almost like you, I do, but it takes a lot for me to get excited about eggs and carbs.  \n\nYour toast? Toasty.\nYour omelets? The eggs are cooked, and yep, there's stuff in them.\nYour hash browns? Crispy, brown.\nYour orange juice? Thick, sweet sludge.\n\n[yawn]\n\nI'll see you again, Toast.  I'll even write my name three lines down on your sign up sheet.  I won't be able to help myself.  I'll succumb to the hype.  Just don't expect me to cheer.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-26", "description": "I finally had breakfast at the nicely designed Toast today, but was disappointed. The conditions were ideal: No line, no impatient kids, plenty of empty tables. We ordered classic breakfasts: 2 over easy, bacon, hashbrowns, coffee. The server was fast and attentive. I was surprised that the food arrived so quickly. Well, maybe too quickly! The eggs were fine, but the bacon was nearly cold and completely flattened, as were the greasy potatos. No way were they cooked to order!  Even the toast was cold! I suspect they were anticipating a big crowd, so maybe the bacon and flattened hashbrowns were prepared ahead of time, then sat around for awhile, under a press. There should be a disclaimer on the door: \"In busy times, we batch-cook the meals, in order to serve you quickly\".  I had much better breakfasts when Herb's held that spot, and likely won't be back. \nLarry", "author": "laurence c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-04", "description": "Good standard breakfast but no notable menu items.", "author": "Alison F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "I`ve been eating at Toast for a while now. Haven`t eaten nothing I didn`t like. The staff and cooks are super nice. I highly recommend Toast!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-31", "description": "Solid 3 Stars. This is a practical breakfast/brunch/lunch place. Come here if you just want one. The food was good...but not amazing. The service was...alright.\n\nMy friend ordered the Mediterranean scramble - delicious. The hash browns were super crispy...I like it when they're more soft inside but crispy on the outside.\n\nI ordered the Chef Salad with poppy seed dressing. There wasn't that much dressing, or it was just extremely light, to the point where there was hardly enough flavor. Had to order blue cheese dressing on the side! It was really just alright...had hardboiled eggs, avocado, cheese, ham, turkey, sprouts (which I liked), lettuce, tomato, olives...and with a baguette. It was just okay.\n\nIt was just okay but everything else on the menu looked good. Like the macadamia/coconut pancakes! Next time maybe.\n\nThe service...well they just seemed like they wanted NOTHING to do with that place. Yes they filled my water, but they weren't that friendly and frankly just brought nothing to my table (metaphorically speaking of course!).", "author": "Eryn K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-08", "description": "The food is just ok. Not bad, but not great either. The individual who seemed to be the manager was rude. We tried it because of its convenient location. There are plenty of good places nearby for breakfast with better food and nicer staff.", "author": "A C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "we were taking a dog walk in the city and got hungry so we wandered down to this place because we thought it looked good. it was very busy when we got there and the smell coming from the kitchen was TO DIE FOR, so we asked for a seat outside and no problem we were seated right away, even though they were packed. i ordered the french toast and my dad ordered eggs and my other dad ordered a breakfast burrito. when the food came out i loved the way they decorated the plates. i tried one bite of my french toast and i will never forget it. their french toast was the best i have ever had and believe me i have had lots!!! i recommend this spot as having great breakfast and i will definitely be going back again sometime soon.", "author": "Ford W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-22", "description": "I grew up right around the corner and loved Herb's Fine Foods for what it was. . .divey diner with solid, greasy, home cooked food at a good price with friendly servers who had worked there for years.\n\nI'm moving back to the old 'hood, so I couldn't wait to try Toast.  I have to say I was disappointed and I'll probably be going further afield in my quest for breakfast in the City.\n\nFirst of all, there was utter confusion about the wait list, so who needs that stress.  \nSecond, I was a solo diner so I had to wait longer for a counter seat.  This is okay, I hate to take up a two-top, but it was still a little frustrating.\nThird, I was IGNORED for over 10 minutes.  I understand it's busy, but a nod, or a \"Ill be right with you\" or a person who only gets water and coffee as soon as someone is seated would be a nice touch.\nFourth, I ordered the coconut/banana pancakes, and there was hardly any coconut.  I did not realize I had to order syrup separately and I was not offered any, and it was too busy for me to request any.\nFifth, I ordered sausage and the order consisted of 1 and 1/2 links.  That's just weird!\n\nNot worth the wait or the cost as far as I'm concerned.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-20", "description": "I'd give it 4 stars for my breakfast *if* it wasn't an establishment that specializes in breakfast! The breakfast was good but not great. My omelette was the best part of my meal.\n\nThe hash browns looked and tasted as though I could have gotten them at a fast food establishment. No flair at all. And honestly, there was nothing special about the toast we received that day, which is weird since the place is named Toast Eatery. Furthermore, there was no strawberry jam on the table, and after asking for some, a single packet was brought to our table.\n\nIt was an OK meal, but I don't understand why it was packed. Perhaps if you live in the neighborhood, it may be the best choice (don't know, don't live there). If you're visiting SF and don't mind braving the Tenderloin, then check out the amazing Dottie's True Blue Cafe!", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-13", "description": "I wish the service was ad good as the food. Again this place over all is average at best. I wish the server paid attention to the guests as much as she did counting her tips. She won't have to worry about counting my tip...pretty hard to count nothing.", "author": "Larry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "mmmMMM how I love hash browns. Especially ones that are crunchy and still have the soft potato bite inside. This place do them good!!! Go with a friend, so one can get savory and the other can get a sweet one. We shared a savory platter and got the belgium waffles with strawberries on them. The waffles were great. Crunchy on the outside and soft in the inside. Just how I like them and sweet with my strawberries.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-28", "description": "I love breakfast.  Probably got it from my mom who used to take me out for breakfast a lot as a kid.  This was in Florida before the days of fancy omelettes and organic ANYTHING.  You had a choice of hashbrowns or grits and coffee was just that hot brown liquid that came out of the pot.  You want milk in your coffee?  Just help yourself to those little plastic tubs of half and half on the table there.   (Someone please tell me why those things don't have to be refrigerated.)\n\nSo, I tend to be generous with any establishment that serves breakfast. I'm just happy they exist.  I have always been satisfied with my experiences at Toast.  The service is fine - one waitress in particular is very friendly.  The food is simple and fresh and yummy.  \n\nI think in San Francisco we tend to have heightened expecations of our restaurants.  We forget that we live in an absolute food Mecca.  Excuse me, but the San Francisco version of \"satisfactory\" is well above average in most parts of the country.  We are so freakin' spoiled.  I just have to remember the days in college - getting a blank look when I asked for tofu in a CHINESE restaurant.  Here in SF it's practically de rigueur for breakfast places to have a tofu scramble, and Toast, of course, delivers.  It warms my heart.", "author": "Molly T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-25", "description": "We had breakfast here this morning. Have walked by a million times with a super long line. There was no line this morning and a two-top table open in the front. So we went and had our breakfast at Toast finally. Well, I can see why they have a 3-star average. Not that great, a little overpriced. \n\nFor example, I got the waffles w/the blueberries, strawberries, bananas & nutella (sounds great right?) but unfortunately would cost an extra $2 for real maple syrup. What? I can see why people joke about smuggling in their own maple syrup because of places like this. I mean c'mon, I paid nearly $8 for the waffles and you can't give me a lil drop of syrup? I mean, $1 I might have gone for but $2? I am not heavy handed w/my syrup... Also, the waffles were rich yet had a rubbery consistency. Wah. \n\nMy breakfast date got the corned beef hash and eggs. Eggs were overcooked, hash was okay but definetly for both meals \"meh, I've experienced better\" is right. We could have made a better breakfast at home and would have but decided we'd give toast a chance, well we gave it one, and we won't be returning. \n\nYour money is way better spent at a place like Kate's Kitchen where you pay less, get more, have better quality, service and ambiance. Did enjoy the people/dog watching from the window though. ;)\n\nWhy anyone in their right mind would ever wait to eat here let alone return here is beyond me... Go elsewhere or take advantage of the Noe Valley Farmer's Markets (Tues & Sun) and make your own meal.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "I LOVE NUTELLA...so this place was great!\nThe breakfast food was delicious!", "author": "Ivy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-02", "description": "A solid reliable breakfast restaurant that is conveniently placed.\n\nI enjoyed Toast and they are pretty traditional but I've had better in the past. I had their 24th Street Omelette which was tasty, and my friend had the Egg's Florentine. \n\nBoth were good but if you compare to a place like Mission Beach Cafe, MBC hands down is better, but is definitely pricier", "author": "Eric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "walk in for lunch. near empty but not a problema as I slid into the counter. Very cute waitress gets me my drink fast, and I order what was a so so under toasted not melted grilled cheese with fries that were soggy and also undercooked... fast service...maybe a tad too fast...I could of waited the extra few minutes for some color on my fries and some melt on my cheese..but this is a nice place and I am sure they do better!", "author": "Ricote F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-30", "description": "Pretty good, typical all American breakfast: bacon, scrambled eggs, french toast in a cozy little restaurant.  \n\nGreat location, nice atmosphere, great service not bad for a casual friendly eatery joint.", "author": "Stacy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-27", "description": "For the price, I think the food here is quite average. The scrambles were a bit dry, and the hashed browns seem like the frozen reheated kind (which may be a big positive for some). If you like bacon cooked on the dry side, you will be satisfied. The pancakes are average, but the waffles are good.\n\nThe service is quite good, and it gets the Noe Valley stamp of approval for child friendliness. The counter is spacious if you choose to eat there, and there is almost room to read the paper.\n\nIt's good enough for a weekday morning when there is no line, you're hungry, and you want convenience. But it always puzzles me when I see long lines on the weekend. I admit I do go back once every few months after working overnight, but I always feel somewhat dissatisfied after leaving each time.", "author": "Greg N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "Came here this past Sunday before leaving SF to come back to L.A.  I've been to the other location and LOVED it.  Toast has been the only restaurant successful at making me eat my hash browns.  \n\nAnyways, I came to this location and was so glad we got seated immediately.  I ordered their Corned Beef Hash with scrambled eggs, an english muffin, hash browns (of course!), and an orange juice.  I was so impressed with the size of their OJ.  A lot of places try to rip you off and give you a small little cup of juice for $3-$5.  Hell to the no!  I need my OJ for my AMs so needless to say, Toast was off to a great start.\n\nWhen my Corned Beef Hash came, I was so relieved it looked NOTHING like the Corned Beef Hash served at Craig's Place.  Toast knew how to do it right with the hash (note to Craig's: that's potatoes for you) and small strips of beef.  **Drool**  AND here's why I love their hash browns:  it's crispy on the outside all around but soft and potatoe-y on the inside!  Perfect texture!\n\nMy friend and I also ordered a side of Chicken Apple Sausage to share and I have to say, still good.  You can really taste the apples that give it a special sweetness.  Unlike Craig's.  (It's funny because Craig's Place has almost the same exact menu as Toast)\n\nMy friend ordered their Eggs Benedict which I had to try.  And just like everything else, it was very good.  \n\nI've yet to experience bad service at Toast but I must warn you, do be prepared to wait.  They usually have very long lines (at least at the Church location) that may cause you to wait 15+ minutes.  I think it's worth it.  YOU should try it out to see if it's worth it.\n\nOn the financial side (let's face it, we're all broke!), it might be considered on the pricier range.  For two OJs, an Eggs Benedict, Corned Beef Hash, and a side of Chicken Apple Sausage, our bill came out to $35.03, not including tip.  For me, it's totally worth it.", "author": "Linh V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-14", "description": "Pretty good, didn't knock my socks off. Eggs florentine was good - I think the yolk was slightly cooked, and the hollandaise sauce was decent. Not gross, but not delicious either. The omelette was pretty good though. oh, the hash browns - ask for them crispy, because the crispy parts were YUM. \n\nI noticed that the baked goods weren't fresh. just FYI. Maybe it was just that day? I'd go here if it were the only brunch place in town. But its not! There are so many to try..", "author": "Carol L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-11", "description": "I feel like I can get everything here for two dollars less and that tastes 20% better at various other places.  Hipster diner.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-17", "description": "We happened upon this place when we passed up Pasta P because of the kid sitch.  Like too many of them.  SO, we got a seat up at the bar which was totally fine but again, the place was pretty kid filled.  I'm probably going to offend the parent's out there but you should be offended if you actually make your kids behave in a public place.  So yeah, could have done without the kids screaming, crawling under the tables and running around but I digress.  \n\nI had a bitchin French Dip sando which was awesome.  Good roast beef, no fat and a great sourdough french bread.  The Au Jus was very tasty as well.  I got a salad with their homemade poppyseed dressing which was good but next time I'll go fries.  I would definitely go back...maybe just a little bit later =)", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-03", "description": "Certainly some of the worst breakfast food in the city.\n\nAte at Toast for the first and last time this morning. We had two items: a blueberry waffle and the hashbrown and cheese pile; both breakfast-spot standards, and I would say pretty hard to screw up.\n\nWhen my wife's waffle arrived she commented after testing with a fork that it appeared to be a frozen waffle. I laughed - \"why would they sell a frozen waffle - it wouldn't even save them much money,\" I said. Then I tried a bite. Almost certainly a frozen waffle, unless it was left over from the day before. Rubbery, flavorless, in short awful. The blueberries were..edible. The \"real maple syrup\" we paid 2 bucks extra for was almost certainly watered down with fake maple syrup. \n\nI fared no better with my plate of hash browns, cheese, sour cream and olives. This is a plate you order for bulk, since potatoes are cheap. No bulk here: a flat pile of mealy grated potatoes maybe half an inch high, topped with a nearly equal amount of el-cheapo cheddar cheese, a glop of sour cream and a bunch of those nasty pre-sliced black olives from a can. I ate it, but only because I was hungry and I had to be somewhere soon, and the decent breakfast spot up the street was closed. But I couldn't believe I was paying almost ten bucks for this pile of canned glop.\n\nMy wife ordered a tea, which the server insisted in delivering in a tiny baby-sized cup--no pint glass or little teapot available. Would providing a bigger quantity of hot water affect Toast's bottom line? Not really; whoever designed the place just apparently doesn't drink tea himself.\n\nClearly the owners think that since they have a prime spot on 24th street in Noe Valley's main strip, they can serve whatever crap they want and rake in the money, since Noe Valley has a legal cap on the number of restaurants on 24th st. And they're probably right. People have to eat after all.\n\nBut maybe if their yelp rating dives low enough business will dry up and they'll have to sell to somebody who actually cares about feeding the customer something edible. We can only hope.", "author": "jack b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "I was surprised to see that Toast only got 3 stars.  This is my favorite of the walk-able brunch places in the neighborhood.  People rave about Chloe's, but I think Toast is better.\n\nThe gals are super friendly, and they're always reasonably efficient.  Food is consistent.  Nothing A-MAZING, but definitely good and reliable.  I might put the hash browns in the amazing category.  Always perfectly crispy, yum.  I'm also a fan of the fruit salad.  Much nicer than your usual melon medley.\n\nThere are some secret times of day when it isn't crowded.  If you go during the peak, the wait seems endless, and that can be really frustrating.  The place is not large, and does not accommodate large groups well.", "author": "Kathryn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "We came to San Francisco for a couple of days and stayed at the Holiday Inn on Van Ness. Walking distance from the hotel we found this place by accident. We gave it a try for breakfast, we had Eggs benedict, Polk street omelett and childs silver dollar pancakes. Everthing was really good and was made with fresh ingredients. The check was around. $ 44.00 but it included 2 coffees and milk. Lil pricey maybe, but it was worth a good breakfast meal. It was sooooooooo good that we returned the next two days we stayed in Frisco. The next few days I ordered the same thing to my suprise. Country fried steak with country gravy, eggs over medium, hash browns made to my wish well done wth onions and cheddar cheese and of course sour dough.  I thnk it runs for $10.95. You gotta try it! Its one of the best I've tried. You won't regret it. Besides the food the staff is really nice. I highlly recommend it. Definite five stars thanks Toast you made my stay in San Francisco a memorable one.  \nMando from Los angeles", "author": "Armando Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-02", "description": "There is no doubt about it - this place has attitude! \n\nThe decor is fancy and stylish, the menu is varied and interesting, and the waitresses are all hot and.. have attitude! \n\nA couple of months ago, I popped my head in the door and asked to see a menu (there is none posted in the window - what's with that?) - the nice-looking gal behind the counter gave a snappy answer about how they were closing soon. I still wanted to see a menu, but I just left. \n\nThe lines were always long, but yesterday I was resolved to stick it out and check out the buzz around this place - was the attitude warranted? I put down a name for two people and asked how long it would be - again the attitude - nice-looking gal could not tell me - it depends on how many people on the list are still here - yeah, sure, but give me some idea, It was just a bit... off! \n\nThe wait was about twenty minutes, which is fine (it was COLD - many people had left), We took a couple of stools at the counter (my favorite!). \n\nAgain, I am sure the gal did not mean anything by it, but... the attitude! Somehow I felt like I was back in high-school - she was one of the cute popular grrrls and I was the awkward geek that she was deigning to even speak to! But maybe that's just me...\n\nIt was not that bad, but, in the end, the food was not that good either. The hash browns were overly crispy and the English muffins in the eggs florentine were tough. \n\nI am a sucker for a homemade veggie burger - and they have them with mushrooms and rise. I will be back for that - it has to be worth another shot - right? Worth putting up with the attitude? Or maybe, like high school, I just want to hang out with the cute, popular girls!", "author": "Kingpin X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "Came here for a late Sunday breakfast recently. There was a wait, but we missed most of the breakfast crowd. \n\nThe Belgian waffle was forgettable, aside from the mounds of fresh blueberries. The omelet, in contrast, was delightful, chock full of feta, spinach, and sun-dried tomatoes. I couldn't get enough of the hash browns, either. They were crisp and filling, and just enough to share. \n\nThank you so much to the server who kept my coffee filled and brought me out some more of those sun-dried tomatoes because I was still half-asleep and didn't see them at first.", "author": "alejandro p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-22", "description": "Toast is always busy, tidy, and pretty to look at. The food, however, is oddly bland and inoffensive. Underwhelming, in a word.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-14", "description": "I had been hearing a lot about TOAST as of late so I decided to order some breakfast for take out this morning.\n\nI went with a breakfast burrito\n\nPROS:\n\ni liked the addition of avocado and sour cream into the mix,a departure from any breakfast burrito Ive ever had before .The salsa was tasty too\n\nCONS:\n\nI am really into hash browns/potatoes with breakfast food and I judge a breakfast spot for how they make their taters.this place does basically nothing to theirs.no seasoning ..no nothing.just shredded potatoes fried.Kinda uninteresting\n\n\nI'll be back.I want to try their eggs benny next time since thats my jam usually", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-05", "description": "Toast has become one of my favorite Noe Valley takeout establishments; the service is fast and reliable, and orders are consistently ready ten to fifteen minutes after I place them. The pear salad is fresh and particularly good with added grilled chicken, and the sandwiches are tasty (the chicken pesto in particular). The fries -- both the regular and the sweet potato -- are good. When I have eaten at the restaurant, service has always been fast and friendly. Oddly enough, I have never tried weekend brunch (the sidewalk is always crowded, so it must be decent!).", "author": "Katie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-07", "description": "I like the Toast on Church street much better, and it's closer to my house, but since my friend was arriving in Noe Valley via 48-Quintara, I said I'd meet her here.\n\nI'll be honest, I've had almost everything on their menu and most of it is par, San Francisco American food. The ingredients are fresh and a lot of them are locally-sourced. And, like most \"hey, we're local!\" places they have omelets and sandwiches named for nearby attractions. \n\nSo, when you're looking for a \"taste of Noe Valley\" go with the Noe Valley-named food like the hash brown hill (hash browns, cheese, green onions, sour cream, avocado and black olives); if you need protein ask for an egg on top.", "author": "Elena C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-04", "description": "You're not Herb's. \n\nYour food is not good, you have all the atmosphere of a Hollister in Milpitas, and your clientele makes me want to lick batteries and chew light bulbs. \n\nYou're not Herb's. \n\nYour mere existence is a cosmic tragedy. You probably hastened grumpy real estate guy's death. \n\nNot only are you not Herb's, you are a murderer.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-30", "description": "No no no no!\n\nHow in the hell is this place so packed every weekend?\n\nLet's break it down, shall we?\n\nThe menu:  Tricky and overpriced.  Sure, the pancakes are *only* $7, but if you want some maple syrup on top, plan on spending an additional $2.  And the selection?  Below mediocre.\n\nThe service:  Slightly rude, very inattentive.\n\nThe space:  CRAMPED.  To get to your table, you have to hope that the people next to you are willing to get up and actually slide their table over while you pass.\n\nCleanliness:  Non-existent.  Our creamer for the coffee had an old piece of a soggy sugar packet in it along with some orange flecks of who-knows-what.  The table and menus were sticky.\n\nFinally... the food:  Simply not that good.  And anyway, the things that are passable are things they order out... such as Boudin bread.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-10", "description": "We stopped here last Friday night because it was hot and neither of us wanted to cook.  He had the chef salad and I had the french dip sandwich with sweet potato fries.  Both were disappointing.  \n\nThe salad had dressing pre-tossed and then all the extra ingredients piled on top...so, no dressing on them...  \n\nThe sandwich was very bland and the dipping au jus was VERY salty (that seems to be a theme in restaurants we've gone to lately...I feel like I write that a lot!)  \n\nAnd finally the sweet potato fries, usually a favorite, were limp and oily.  I LOVE the ones at Taylor's in the Ferry Building.  They are the standard I compare all other sweet potato fries to...and these simply paled in comparison.\n\nVery, VERY mediocre food.  I can't imagine why we would go back...", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-03", "description": "BRING BACK HERB'S\n\nIn the mean time, I am avoiding this overpriced low-value joint.  Savor down the street near the corner of Sanchez is a much better brunch alternative.", "author": "Don O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-13", "description": "Just got back from brunch, and first and foremost, the music they had playing was incredibly annoying - something out of nightclub, not a casual brunch place. \n\nOne way to cover up for a complete lack of ability to make any sort of good  and flavorful food is to load everything with grease and butter, which Toast did very well.\n\nIs it too much to ask for a soda fountain? Those of us with Diet Coke addictions appreciate free refills, much like coffee-addicts receive. My heart sank when I saw that aluminum can.\n\nI have lived in Noe Valley for about a year, and in that time I have settled my brunch routine at Joe's 24 Street Cafe...after trying a new place today, it's case closed - Joe's is by far the winner. I'm sorry, Joe, for doubting you.", "author": "Mollie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-24", "description": "Overpriced for Denny's-caliber food. Sorry if that offends anyone, but that's what I walked away thinking.\n\nWhile the hamburgers looked pretty good, I decided on an omelet. I've definitely had better at other similar establishments, and didn't have to wait for an hour. I will say they had decent hash browns, though.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-03", "description": "Went here on a Saturday and it was the place to be.  There was definitely a wait.  SO I guess that's why we decided to come here.  The food must be that good, then we shall try it.\n\nMimosas - $6.95 :: Average, nothing bad really...\n\nChef Salad w/ Ranch Dressing - $9.25 :: This looked huge and filling but I wasn't satisfied with this salad for some reason.  This seemed so appetizing  but the salad as a whole didn't amuse my tongue and stomach.\n\nBeef Cheesesteak Sandwich w/ Curley Fries - $10.25 :: This was well portioned and this tasted so delicious!  But then again, what fried food isn't?!  \n\nAnyways, I'd come here again to try more breakfast items than lunch items.  It's definitely worth another shot.", "author": "Limzer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Everything we had was great and the service was excellent as well. There was a bit of a wait to get a seat, but not bad. Also, the Arnold Palmer was above average.", "author": "Captain B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "Seems to be my go to spot for breakfast in my neighborhood.  Perhaps it's because they always seem to find a new way to incorporate lox, capers, and cream cheese into breakfast entrees.  You can get 'em in an omelet, scrambler, or on a bagel.  Other variations include a salad and burger (albeit the salmon is processed differently in these).  Large portions regardless of what you get.  \n\nThe atmosphere is a nice mix of retro and modern, and there's plenty of light.  It's pretty hopping on the weekends, so come at off times.  A bit on the pricey side, but you'll leave full and content.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-25", "description": "I've eaten at Toast a few times.  The food is decent as is the service.  But they lost my business this afternoon as I watched the owners harass an elderly man who had setup a small table to register voters and give out buttons and signs for Obama.  \n\nThe table was clearly out of the way of their entrance and quite unobtrusive.  The owners were insisting that \"if someone came out with a stroller and then someone else was walking by with stroller there would be a big congestion.\"  Uh, right.  On and on they complained.\n\nIf you value voting, if you value free speech and if you value neighborly courtesy, then skip Toast.  You won't miss all that much anyway.", "author": "Matt E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-09", "description": "Went here for the first time yesterday and ordered a breakfast burrito (which came with hash browns) and a glass of grapefruit juice.  \nIt arrived like a lump on an old, scratched, ugly white cafeteria-style plate, and the hash browns were actually a flat, sqare cut-out from a large pan of hash browns - dumped haphazardly on the plate next to the lump.\n\nI really didn't want to eat off that plate, so I wound up taking it to go.\n\nThe food itself wasn't terrible, but coupled with the gross presentation and the disinterested \"i'm in school and hate my job\" waitstaff, *and* the fact that a burrito and glass of juice cost $15 - I'll stay home and make my breakfast, thank you very much.\n\nThird star for location, and the fact that it's a step up from Denny's.", "author": "Jessie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "We definitely had a good experience here but it definitely wasn't anything special.  we got the pulled pork sandwich with curly fries and the fried chicken sandwich with onion rings.  both sandwiches were pretty good and filling and their sides weren't super greasy and real tasty.  Service was good and prices were decent.  I'd definitely come back here if it was close by, but I probably wouldn't specifically seek it out.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "I was happy to see that Toast had opened up a second location given how long the wait could be to sit crammed in their Church Street location. \n\nSo, I finally made it over to this one this morning. After a brief wait, my friend and I were seated at the counter. I loved loved loved my croissant breakfast sandwich. It was a mass of yummy, buttery goodness. It could become an addiction. And, the hash browns they came with were very crispy just as I like 'em. \n\nMy friend and I also split a short stack of pancakes. They left a lot to be desired. They had a certain flavoring that I could not put my finger on. Nutmeg? And their consistency was odd. They were kinda mealy and no amount of butter or syrup was helping. However, they washed down well with the yummy coffee they serve. \n\nAlthough on the small side, this location is nowhere near as cramped as the one on Church. And, I actually found the counter surprisingly spacious.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "Super cute diner. Came for a late lunch. No wait. People were still finishing up but lots of 2-tops to spare. Chose to sit on one of the silver counter bar stools. (I like dangling my feet from a higher position.) Loved the decor, fun vibe, and easy feel of the place.\n\nMenu had a LOT to offer. Can see why people come for brunch with its full page of egg scrambles, omelets, pancakes, and waffles. We went for the sandwiches instead. Was torn between the Patty Melt and the BLTA (bacon, lettuce, tomato, avocado) and went for the BLTA instead. I was thinking it was healthier. \n\nI really liked my sandwich. Served on your choice of bread (I chose wheat), the sandwich was thick with crisp crisp bacon slices (felt like 4 or 5), lettuce, tomato and avocado. Tasted super fresh and fit the bill for a hot Noe day. Comes with a side of fries or salad. Again going for the healthier option, chose the mixed greens. Tasty!\n\nMy friend had the humongo pastrami sandwich. It didn't seem big at first but with the Boudin sourdough bread, and then the inch high pastrami, not to mention the lettuce and red onions, you really have to squeeze the tops and bottoms down to take a bite. He had skinny steak fries which were super good. Stick straight, not soggy, stood well, and dipped well in ketchup (meaning doesn't fold under the weight of the sauce). For $1 more, you can get the sweet potato fries. Maybe next time.\n\nTwo sandwiches totaled a little over $19 after tax. Very hearty. \n\nMy only critique is that it is warm in there, at least on a hot day. Aim for a seat by the door.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "First time at Toast Eatery last week and it's still on my mind, so what can I say, it's a great little brunch place. We actually were planning on going to two other places but due to the packed lines, we decided to give this place a try since the wait was tolerable. Little did we know the food was great. I had the breakfast burrito without meat, which they made up with plenty of eggs inside. The hash brown was delicious! I'll so happy to find a place that serves hash brown with almost all their dishes. =) As for customer service, I thought it was just perfect. The server was super nice and made sure we were good even though we sat in the corner outside. The only reason why I gave them 4 stars instead of 5 is because they served their hot coffees in a tall glass cup. Coffees are meant to be served in a ceramic cup and as a coffee drinker, it just wasn't right. However, the coffee was strong and good. Being that it was our first time there, I would give them 4.6 stars if there was that option and would definitely go back to try something else.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "A nice quiet little diner in Noe Valley. Stopped by here after an evening of photography. Just needed a place to relax, and read. The server was extremely friendly, and their ham and cheese sandwich was marvelous.", "author": "Gurpreet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "I love eating at Toast! They are fresh, yummy and great for the early birds....My favorite time of the day! I have eaten here multiple times, trying out many dishes and have not been disappointed.", "author": "Paul R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-09", "description": "The service was slow but very friendly, good thing they had the ballgame on and enough newspaper to distract me while I waited almost 25 minutes for some below average corned beef hash. The prices are high even for good food but paying $11 for something I cooked better when I was 8 is a little insane. Honestly how hard is it to cook breakfast? \n\nThe one good thing was the friendly waitress that never let my water glass run empty. My number one factor in determining a tip.\n\nIt is super clean, sadly that's the sign of a bad dinner. When the steel front begins to rust, the floor gets a little stained, and the workers all have messy aprons,  I'll be back.", "author": "Nick P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-07", "description": "Toast is good.  It's not great.  It's clean and friendly.  The artwork is fun.  My kid always wants to eat there. It's got god-awful lineups on the weekend. \n\nMy kid loves the lox bagel.  I haven't found anything I adore but it's all decent.  Minus one star for charging extra for maple syrup (and I don't even think it's real) when you order the pancakes.", "author": "Susan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "As much as I miss Herb's it's nice to have Toast close to my work!\n\nThe new location of Toast has been highly anticipated for a while now, so I packed up the family and we went on the grand opening. The inside is decorated very similar to the Church street location. Lots of earthy tones and a warm feel. (Something Herb's lacked)\n\nWe all ordered different things for Breakfast and covered all the bases. The food was good. No complaints, just solid breakfast. The service was fine as well. The food took a little longer than I would have hoped for, but we were there within the first hour of the place opening, so I would say all in all it was a solid opening for a place that will succeed in the fickle Noe Valley.\n\nAnother thing I noticed was that they have plenty of high chairs and a changing table in the bathroom...they are ready for N.V.!!\n\nI want to give em 5 starts, and hopefully will be able to after they settle in a bit. Like I said, it was a rock solid opening to a place that will be great on 24th street. Getting the food a little slow and the pancakes needing a little work are simple things that I am sure they will correct. \n\nI'm excited to see what my next eating experience will be like here!!", "author": "JR H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-07", "description": "I went here for dinner with my honey. While the decor and remodel of the old Herb's is way better, the food seems to be just OK. \n\nI was pleased that you could order breakfast at 8 pm. I ordered the chicken fried steak. The country gravy was bland which was disappointing as there's nothing like sopping up the gravy with toast and/or smearing over your hash browns. After all, if you're going to eat this much fat and sodium, it'd better be good! The hash browns were fried to a golden crispness and tasty. \n\nMy honey ordered the Nieman ranch burger. It looked good and he liked it. For an additional fee, he got the sweet potato fries which were tasty and not overcooked. \n\nService was friendly and attentive, but then again, the restaurant was nearly empty so our server didn't have a lot of distractions.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "Large portions generally don't equate to quality. Not terrible, but not worth a wait.", "author": "Ian W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-04", "description": "They make a decent omelette...\n\nWaitress was cute...\n\nNothing else really stands out...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-24", "description": "I have been to the Church St Toast several times with not a single complaint.  The Church St location service is prompt, with solid food.  \n\nThe 24th St Toast is the EXACT OPPOSITE.  Can I give ZERO stars?  This story is almost too ridiculous to believe.  I walk into the restaurant, and the waitress kindly advises me to order the grilled portobello mushroom sandwich.  So I go ahead and do so, ordering it To Go.  She tells me it will be \"10-15min\".  So far, so good.\n\nNow pay attention:  She puts the order in, and CHARGES me for the sandwich.  I pay for sandwich via credit card.  ... then, 20 MNUTES LATER, after I inquire about the delay, she comes back from the cooking area and tells me, \"The cooks just informed me that we HAVE NO PORTOBELLO MUSHROOMS\".   \n\nWTF?!  Are you frikin kidding me? Why didn't you tell me this when I ORDERED IT 20 MINUTES AGO???  She responds, \"I don't know, they must be backed up.\"  What  does that mean?  I was completely shocked. \n  \nShe not only took my order, placed it, and CHARGED ME for it, but she frikin ADVISED ME to get it.  And 20 MINUTES LATER, she is telling me they don't have it?!!  Is this a joke?  Apparently, it was not a joke, because it got even worse.\n\nAfter spewing numerous expletives and even getting support from other, equally-stunned patrons in the restaurant, I could see she was totally incompetent and unable to explain her abject failure to perform even the simplest task of her job.  I had no interest in eating there after wasting my time completely.  So I naturally demanded my $ back.  But I was refused even this!  She said, \"I can't credit your card back.  Only the manager can do it, because it's 'their' system\".  Again, WTF?!!  Who is 'they' and why isn't SHE one of 'them'?  \n\nThis was incompetence on a truly colossal scale.\n\nSo basically, 24th St Toast advises customers to order food they don't have, charges them for it, makes them wait interminably before mentioning that they don't have the food, and then refuses to give back the customer's  $, which, last time I checked, can be equated with FRAUD and ROBBERY.\n\nIn the end, the manager told this employee to call me at HOME, and they asked me to drive back to pick up a cash reimbursement.  Then they called back AGAIN to tell me they were able to credit the card back.  They even offered me a free meal, but they have no way to keep a record of this, other than my name somewhere at the register.  Is this really 2010?    I am still waiting, with bated breath, to see what happens next.   Never again.  They can keep the free meal.  They will need it.", "author": "Chuck D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "this place is awesome! expect to wait at least 20 minutes if you go on the weekend, but believe me it's worth every minute of that wait. I got a bacon and sausage scrambler with onions and pepper jack cheese with toast and some country style hashbrowns. the portions are huge, and even more importantly, delicious! 5 stars", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-15", "description": "I give this Toast 2 stars because the service isn't very good. Of the times I've been there, maybe one waitress is working the floor. They sat us quickly but if you need anything, food, water, or the check you almost have to beg them to bring it. They never come and check up on you to see how you are doing.", "author": "Nikki G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-21", "description": "I ate at the bar, and it was pretty much cake to get a place there on Thursday night. Good sweet potato fries if those are your thing (they are MY thing). \n\nNot a lot to say - its a pretty straight forward place. The food was good. Nothing exceptional though...but then again, its a diner, so I wasn't expecting flambee alligator's milk with a side of panda confit. Laid back when I was there, but I typically see a line out the wazoo at this place on weekend mornings. Thats kind of why I went - I figured something cool was happening in there. (Yes, I am one of those people that would look at the nothing in the sky just because the rest of the crowd was. But, I wouldn't stop and stare, I would walk by then take a passing glance over my shoulder all sexy and cool like.) I dunno...it was OK. \n\nNice waitress...and she's from Montana...how FUN! That state has a face on it!", "author": "Sean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-27", "description": "Yum. I'm such a fan. Love going here for breakfast, such a good variety, incredible ingredients (fresh and high quality - I can tell and this is so important for my meal enjoyment). Toast makes my weekend brunches vary happy.", "author": "Hanan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-17", "description": "I went for breakfast.  The decor is great and the place is super clean.  I like the chairs and tables - they've done some re-arranging to make more room, it seems.\n\nThe food is just ok.  I had very ordinary blueberry pancakes - nothing special at all, and of course, I just can't respect a breakfast place that charges as much as toast does but doesn't serve real maple syrup.  That's a pet peeve of mine.\n\nMy friend got a scrambler.  It was ok but processed cheese food on top - ok, maybe it was a slice of American.  The hash browns looked good.\n\nSo , it was fine, but I paid a lot for what was not much better than I could get at any diner for much less.", "author": "Bill V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-29", "description": "I decided to stop for breakfast after dropping off a friend at SFO. 24th Street is my old neighborhood, especially the Eureka Valley end. I found the Coast Eatery to be a very enjoyable place, clean, bright with a vintage feel.The Toast Combo/ chicken-apple sausage, eggs over easy, pancakes and a really nice salad. The coffee was the best I remember having at a neighborhood cafe in many years. Excellent, friendly service, reasonable prices.", "author": "Ray P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-24", "description": "Meet the new Toast, same as the old Toast.  Apologies to The Who, for taking liberties with their lyrics, but I just don't understand why my little 'hood needs two Toasts, that are maybe 10 blocks apart.\n \nThough this new 24th Street location boasts a slightly roomier floor plan, the seating practices seem a little more chaotic.  It took way too long to get seated even though there were tables turning over.   They kept waiting for people who'd obviously wandered away to return.  I thought the general rule was \"you snooze, you lose\"?  No?\n\nIn defense of Toast, I am happy to report that their corned beef hash is just as good as the original location.  The hash browns maybe even a bit better...definitely crispier and greasier, if these things matter to you. For me, it's my weakness.  And now I live waaaay too close to it.  Yikes.", "author": "Becca V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-11", "description": "Came here right after it opened.  Not impressed.  Busy, but no \"feel\" to the place at all.  Sterile.  Don't let the fancy sign (installed later) fool you.  If a place is going to be packed and a 20 minute wait, I want something other that Noe infants to look at.  Plus, they make me hungry, the fatty little tikes.  I kid - I lose my appetite when the 7th custom stroller nicks my shin.\n\nThe food?  Also mediocre.  Maybe they're still working on it.  But as it stands, not worth a walk down to 24th on a Sunday.  There is no more damning statement for a brunch spot.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "Don't let the name fool you - Toast is open for 3 meals daily.  And while I'm bummed that I didn't get to try Toast's predecessor, Herb's Fine Foods, I think this is a good addition to the restaurants on 24th St.\n\nWe did a later Saturday brunch (1:30ish).  Letting the busboy run the wait list wasn't successful, as he wasn't quite sure who was seated, who was waiting, and what I was saying.  And there isn't a clear place as to where one should sign up for the list, or where one should wait once signed up on the list.  Hover in the doorway?  Hover near the plate glass windows on 24th St?  Hover near the curb so as not to loom over window table diners?  Not clear.  Once we were seated, things were pretty darn good.\n\nThey should install some ceiling fans - there's not a lot of air movement, and when it's warm outside, it's even warmer inside Toast.  Maybe they're trying to \"toast\" the patrons - nyuk, nyuk, nyuk.\n\nHad the Church St omelette (sausage, spinach, sun-dried tomato, feta), which was a perfectly prepared omelette, and they were more than happy to substitute potatoes with cottage cheese (thumbs up!)  Also had an iced chai, even though they didn't have it on the menu.  Also had the croissant french toast with fresh fruit - the fruit was delicious, and so was the french toast!  \n\nOur server was extremely friendly (and beautiful), and seemed to keep a pretty cool head among a bustle and noise of the crowd.  Dig the neon clock above the eatery bar, and dig the minimalist (and very clean!) bathroom.\n\nWould go back, and would like to try some of the speciality sandwiches.", "author": "Evan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-22", "description": "Nobody makes hash browns as crispy and tender, yet buttery as Toast does. Feel the love, 'cuz they dish it out seven days a week. Not just for breakfast, they do lunch and dinner, too. Very good burgers, fries, onion rings. Salads are crisp and tasty. As good as a diner gets.", "author": "Richard L M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "I am normally not a breakfast person (childhood memories of a parent with poor cooking skills cooking scrambled eggs for dinner on a regular basis still gives me the shivers), but I seem to be up for breakfast at Toast any time of the day!  A new concept for me! And one that speaks to the quality of the establishment indeed!\n\nFirst off, I have to say that Toast is adorable on the inside.  I feel silly saying this but it is always shiny! It has that old diner feel to it without it being dirty and outdated (like a lot of diner-esque restaurants are).  In fact it looks quite modern and fresh, and is impeccably clean (a huge plus in my book).  \n\nAlthough the food isn't anything I would deem out of this world, it has always been consistently good.  Anyone who offers Nutella on their menu as a side for pancakes and other delicious pastry style breakfast foods is a winner in my book.\n\nPersonal favorite is the mondo sized Breakfast Burrito - a fresh tortilla stuff to the max with eggs, cheese, tons of freshly sliced avocado, salsa, and sour cream.  If that's not enough to fill you up, the delectable dish is served with a hearty serving of crispy old style hash browns.  YUM!\n\nMake sure to go during the week or before nine in the morning if you don't want to have to wait for a table!", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-26", "description": "Sorry, but I don't understand why everyone mourns the loss of Herb's so much--Toast is a big time improvement! Greasy spoons that actually, um, *have* grease on their spoons do not receive high marks in my book.\n\nBut I digress...\n\nExcellent coffee--Peet's is king. Friendly staff and straightforward breakfast food. No silly homefries here--it's all about the hash browns. I have enjoyed every bit of food I've ever had here--from the breakfast to the salads to the chicken cheesesteak. \n\nTake That, Whiney neighbors of mine!", "author": "Molly W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-02", "description": "Breakfast was IHOP-esque, at best. Pancakes were rubbery, bacon was dessicated, coffee was drinkable I guess. Good service though and we were seated quickly even at 10am on a Sunday. Probably wouldn't eat here again.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-21", "description": "I found brunch at the old Toast location lacklustre, so I wasn't too thrilled about going to the new location for dinner. \n\nWell, color me surprised. I ordered the veggie burger, which was actually REALLY good. Crispy on the outside, yet mushy and yummy on the inside. I like that you can switch up the sides(salad/fries/soup/coleslaw I think and maybe a few other options), and I'm always glad to see sweet-potato fries on the menu anywhere. \n\nThe bf on the other hand, didn't love his steak and eggs, but that's what you get for ordering breakfast for dinner. \n\nThey've done a good job redecorating, with a nice nod to Herb's diner on the wall. The servers were good and friendly. We were there early when it was jammed with kiddies, so can't say much about the ambiance. The menu has a good selection of sandwiches, salads and misc. diner food, and of course, breakfast all day. I'm still a giant Meh on the breakfast, but I'd go back for dinner if I needed something quick in the neighborhood.", "author": "Leah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-01", "description": "Big portions + good prices = great value.  The best chicken fried steak for brunch.  Love the Sirron Norris paintings (check out his gallery on 25th and Valencia).  Downside: Generally pretty crowded.", "author": "marcie v."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-01", "description": "Warning when there is a lot of folks waiting...\n\nMy friend and I put my name in and when we came back in 30- mins to check in, they had already called our name and told us we were at the bottom of the list. They didn't tell us they were going to do that and were a touch rude about it.", "author": "diana h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-03", "description": "Add half a star to the 3. We had a long wait with Sam. Nope Sam wasn't a human friend. Sam was a canine whose dad went to Toast on a rainy day and left Sam standing in the rain. \nThe food was OK for me but my husband loved his omlette... so much so that he didn't share it with me. My eggs were ok as was the French toast BUT my chicken sausage was the best I have eaten in awhile. Decent prices for brunch... cute sort of noe place.The hash browns were awesome... delectable really.", "author": "Pooja S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-30", "description": "Wow. Can't believe how violently some people are reacting to this place. It's not exactly the Pork Store, but then nothing is like the Pork Store... that store... with all kinds of pork... mmmm.... Oh sorry. \n\nI usually get the chicken fried steak. One time the chicken-steak wasn't very crispy, but normally it's quite delicious. And like another person said, the hash browns are hands down terrific. It's the old fashioned shredded and flattened kind and their's is crispy on the outside and tender on the inside. Also, I find their service to be very fast. You're in and you're out. I have kids and that's how we roll.", "author": "L. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-22", "description": "Having lived in NYC for over a year, I've come to really appreciate great hashbrowns when I get the chance.  At Toast you can order a dish called the \"mountain of hash browns\" or something to that effect.  Go crazy and try it out.  The chicken fried steak and italian sausage are awesome.  Apparently you can also get healthy breakfast food here, but I can't imagine why I would ever want to do that.", "author": "Chad T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-26", "description": "We popped in for a late lunch on Friday after Thanksgiving. Not crowded. I had the BLT with turkey bacon, and my daughter had the pulled pork sandwich. Our waitress was friendly, efficient and delivered our food as ordered (eg, no mayo on the sandwich). Portions are LARGE, including the accompanying side salads of field greens. I would definitely return.", "author": "Beth W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-05", "description": "Meah. Cute concept but disappointing food. Hashbrowns are cooked in a thin pancake then cut in square portions for serving. Eggs were overcooked til dry and served in the same sized flat square. I like my breakfast to have a more bountiful feel and be more of messy heap on the plate.  It felt awkward like it was cooked by novices.", "author": "E. M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-11", "description": "Consistency is important and on this point Toast delivers. They have also moved to fountain soda which is nice for me and the environment.\n\nWhile what they offer is done well the menu is really is just variations. The space could also use some acoustic help - the large open restaurant gets very loud with even just a few customers.\n\nAfter being a here a few times I think they definitely deserve a 3-star.", "author": "Ennis O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "We won't go back because they are not sensitive to children.  We were about to order breakfast when my children started staring at the TV screen.  It was a very violent news show and no adults were watching it.  I asked them to stop watching but it is hard to stop looking as a kid.  So I very politely asked the waiter to change the channel (e.g. baseball, golf, classical music concert, anything less violent) and he said the other customers were watching it.  They were not.  Anyway, it wasn't the kind of show you watch while eating breakfast.  If anyone were watching it I am sure they would rather not see all that blood while eating breakfast and would rather watch something more peaceful.  I argued politely but he just seemed annoyed.  So we walked out quietly.  Luckily we hadn't ordered yet so we didn't leave them in a trouble situation.  There are lots of other breakfast places in the area so it will be easy to find a replacement.  Unfortunate.", "author": "Lancelot C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "A friend and I went here for lunch, and the veggie burgers were so so.  For $30, they could have at least toasted the bun and added more cheese.  They were also very skimpy on the fries.  Oh, did I also mention that the server did not smile at all while we were there?", "author": "Linh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-14", "description": "One of my favorite breakfast/brunch place EVER!\n\nI've been coming here for 2 years now-to both locations!\nI love their hashbrowns!!!! My favorite breakfast dish-joe's scramble.  Oh- and their french toast made with croissants are awesome too!  Sometimes I'll get a side salad and their poppyseed dressing is to die for....\n\nI don't mind the wait for a table at Toast.  I usually don't wait more then 20mins.", "author": "Alvin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-07", "description": "Loud, cramped, food is mediocre at best.\n\nAfter waiting a long time we were brought in and shown a table that neither of us would be able to squeeze through without upsetting the people at the next table. Another couple who were slim, decided that they couldn't either. After several more minutes, they found one man who was willing to squeeze in.\n\nFinally we were seated at the bar. Coffee was not offered. When she asked if we were ready to order we finally got our coffee. The coffee was fine and very hot. However, being at the bar, I wouldn't think we'd have problems with refills, but my boyfriend's cup was left empty for quite a while. Pancakes were edible, but had to use a knife to cut them. The hashbrowns were like Ore-ida pattys. \n\nFor 6 small pancakes, 3 strips of bacon. 1 patty of hash browns, and 2 coffees, we spent 23 dollars minus the tip.\n\nI don't plan to go back.", "author": "Elly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "Good little breakfast place in Noe Valley.   Hasbrowns really good.  Damn fine cuppa coffee.   Nothing amazingly amazing, but everything good.  I go whenever I'm in the neighborhood for breakfast.", "author": "Travis B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-13", "description": "Meh is right! Toast looks cute and jolly, but it's more like an overpriced deli with sloppy service and mediocre food. Like the toast on the wall, but meh meh meh.", "author": "Sara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "There are a myriad of reasons I really enjoyed my parfait:\n\n- I literally walked from Diamond Heights to get here (one missed bus after another....)\n- It was noon and I was starved\n- Parfait was gigantic\n- Parfait included quite a variety of fruit, including boysenberries, a rare add\n- It was almost one by the time I got home to enjoy it\n\nAlmost five on the parfait alone, and I did love the new Toast space. At $8 and change, just a bit pricey, but still recommended.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "\"All around the country coast to coast,\nPeople always say what do you like most,\nI don't wanna brag i don't wanna boast,\nI always tell 'em I like toast.\n\nYeah TOAST! Yeah TOAST\"\n\n-'Toast Song' Excerpt from the Bob and Tom Show (Chicago)\n\nPros: I like toast and theirs is good.  AMAZING quality for simple diner food.  I am a very picky hash brown person, and their do theirs right!  Fun atmosphere in a really cute neighborhood.  Wait staff is all super-friendly and attentive. \n\nCons: Parking can be rough and there is often a wait.  The crowds also tend to be a little noisy as well so don't expect an intimate conversational experience.  Also, that \"AMAZING quality\" of their food that I mentioned... yeah, you have to pay a little bit extra for it.  For a diner its really pricey.  \n\nMust Haves: Corned Beef Hash!\n\nMmmmm", "author": "Nicholas S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-10", "description": "Good breakfast lunch. I ordered a toast combo and it didn't have toast. Our waitress was anything but friendly or helpful. People rave about this place but I can get a $15 breakfast anywhere.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-11", "description": "I hadn't heard too much (or anything really) about this place but, as we walked by on the way to the Noe Valley Farmer's Market I took notice that it was filled with people and more waiting to in outside.\n\nThe hubby, kid and I were hungry after walking around and decided on Toast simply because of the popularity of the place.\n\nNot bad.\n\nI had the BTLA which was just the right amount of all the ingredients and a rather generous portion of fries. The husband had the crispy chicken sandwich was just as listed. Good crispy chicken in a bun. Nothing fancy, simple and good. He went with the salad option and it was a nice big portion as well. (kid nibbled from our plates)\n\nFor what it's worth, it was an okay place to have a bite.", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-31", "description": "I'm surprised that Toast ain't averaging higher ... I love it.\n\nFriendly, prompt service (essential for hangover recovery), great village-y people watching - both inside and out,  delish Mr. Espresso coffee, and dreamy lox beigels and omelets. Not too greasy. Definitely higher on the \"rabbit food\" fruit and salad side than the average brunch spot.\n\nI wish there were more independent bruncheries like this.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-21", "description": "Amazing french toast!! great and friendly workers", "author": "Joe S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-11", "description": "Toast is a nouveau greasy spoon without the grease.  Also, with out the salt.  The hash browns, while perfectly golden brown on the inside lacked any type of seasoning.  I tried the Noe Valley scramble and it reminded me of a diner that I went to with my mom when I was eleven.  Nostalgic and very hearty.  I also tasted the buckwheat pancakes.  I expected some dry hoecakes but these were moist, rich and filling.  I'm definitely coming back for these and bringing my own maple syrup a la Seinfeld.  But what drew me in was that they had a huge tv that was playing la Copa.  Viva Portugal!", "author": "Monica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-20", "description": "The food is fine, just very overpriced.  Their grilled cheese is not worth $9.", "author": "M D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "Really good pancakes with friendly service.\n\nOn 24th Street, a real SF neighborhood street with lots of cool shops.\nShpatzir around after bkfast.", "author": "Alan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-15", "description": "This place is GREAT!  It's one of my favorite breakfast spots.  The lunch is good too.  i have not a single complaint about them.  Food is great and fresh and the staff is friendly, can't ask for more.", "author": "Sheree A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-03", "description": "I'm trying very hard not to judge Toast simply by comparison to its true diner predecessor, Herb's (aka \"Herb's Fine Foods\"), which I miss dearly, but I'm finding that next to impossible to avoid.  It's not just that Toast occupies the same physical space that Herb's did for how many decades, but it is also that Toast aspires to follow in the footsteps of the American diner tradition, but just can't pull it off.\n\nYes, Toast has ketchup and those little jam and jelly packets at each table, and it also has seating at the counter.  How oh-so-charming.  That must make it a diner, right?\n\nOne fundamental problem here is that whoever designed the 24th Street outlet of the Toast chain seems to have been convinced that certain \"upgrades,\" such as the flat-screen monitor tuned to CNN; those horrific decorative gleaming plastic toast replicas on the wall (yes, we know you're called \"Toast,\" we get it) that are evidently supposed to evoke a graffiti-esque edge; the intrusively loud background music; or the sorry little wine/beer/Italian soda shelf behind the counter, either have any intrinsic attractiveness or value to them, or somehow are true to the diner experience.  But in trying to somehow be both a diner and a \"millennial upgrade,\" Toast succeeds at neither; it has \"faux\" written all over it.\n\nThe second fundamental problem is that the food is somewhat tasteless.  We went there because, to their credit, they are one of the few places to be found in San Francisco that still serves hash browns (as opposed to home fries).  But the hash browns arrived in a perfectly flat and rectangular shape, as if straight out of microwave-ready packaging.  And the taste matched their appearance.  At Herb's, I remember seeing someone actually frying up the hash browns on a grill, and actually having them look and taste as if they had been made by a human at a grill.  Maybe the Jetsons like bland hash browns with perfectly formed straight edges; not me.\n\nFinally, the pricing is a little on the steep side for what you get.  A side of bacon, which turned out to be three strips thereof, was $3.95.  At Herb's, you could have gotten eggs, hash browns, toast, *and* bacon for about $6-7.  I paid about $11 for the same combination this morning.  Now that's progress.\n\nFor those of you who aspire to eat in the New Millenium, go to Savor - which I also like, but for different reasons and because it's not trying to be something it isn't.  For those who want to eat at a diner, I'd unfortunately recommend going someplace besides Toast.  Long live Herb's.", "author": "moosedog i."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-09", "description": "This place opened a while ago and the number of people waiting and blocking the sidewalk out front always bothered me when trying to navigate on weekend mornings.  But I figured I'd try it out since I wanted breakfast and it was late in the day.\n\nThe method by which you express your interest in getting a table is kind of haphazard: you need to write your own name down.  This isn't really mentioned anywhere and we kind of had to figure it out ourselves.  Once we did get assigned a table, it took longer than I'd have liked to have it bussed.  I was expecting the service to be more attentive, another waiter would would help, but considering how cramped it is more people would have made it worse.\n\nThe food is  acceptable, but there's not much distinctive about it, generic California diner fare (ie avocado in some dishes).  I might hit this place up again late in the day if there is no wait and I fancy some uninspired eats.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-13", "description": "3 stars today, with no hangover cure needed\n4 stars if I needed a cure for a hangover\n\nEverything on the plate had grease attached to it, minus the  - pardon the pun - Toast.\n\nEggs - Greasy\nHashbrowns - Greasy\nBacon - Triple Dog Dare You Greasy\n\nFor two breakfasts, two cups of coffee - $20.00, no complaints on that front.  Coffee gave me a giddy-up in my step, thats for sure.", "author": "Jason I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "Toast is better at the restaurant than via take-out. The take-out portions seem SMALL and lame. Dining in the restaurant is pleasant. The staff is friendly and responsive, the food is high quality but that doesn't mean the dishes are as high quality, some dishes are a little disappointing...", "author": "Eliz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-02", "description": "Why do I always forget about this place? It's walking distance from my house and never fails to please. Nevertheless, I always end up wandering around my immediate neighborhood, cursing the fact that Boogaloos (GROSS) is the only vegan breakfast joint in the area, before I remember Toast! Anyway, there are several vegan options that are really yummy and the service is always great. The only downside is sometimes there is quite a wait, but hey, we're in SF, all good places have a wait!", "author": "Susie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-10", "description": "The menu has all the classics, but the prices are bumped up -- stinks for the customer but hey, someone's gotta pay for that flat-screen behind the bar.\n\nI had a $9 lox bagel (adequate, nothing special), plus $3.50 sweet potato fries that weren't even salted. Crispy but talk about *bland.* If you want awesome sweet potato fries go to Catch in the Sunset. They do use salt.\n\nOn another occasion, I ordered a 2-egg breakfast which came with toast and hash browns. The toast was tasty (woulda been ironic had it not) and the hash browns were AWESOME. Still though, I left feeling hungry. There was nothing traditionally diner-like about my dish's small proportions.\n\nService was pleasant enough, but the second time I went, my server kept doing drive-by's and dashing off before I could have a chance to make a request or ask a question. So I guess, service was on the inattentive side that time.\n\nThis place is packed by 12 noon -- even on weekdays, so if you don't want to deal with a lunch time wait, get there by 11:45am. Also, be prepared to hear every sordid detail of your neighboring table's lover's quarrel.  For some reason, I felt vaguely guilty for \"eavesdropping,\" but it couldn't be helped. They pack us in there like sardines. \n\nBoth times we went, I think we were like the only straight group in there. The Castro boys love this place.\n\nI dunno, I could take it or leave it. For heartier portions, better food, more attentive service, and a much cheaper bill (albeit less slickster), I'd rather go to Manor Cafe in West Portal.", "author": "SfMom O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-16", "description": "The food is usually pretty good, but nothing special. I'd rather go to Savor or Haystack if I was in Noe Valley. I was there once and the sewar was all messed up, which made a very bad odor throughout the dining room. The coffee has tasted over two days old at times, although I was there last night and had a damn good iced coffee.", "author": "Marty F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "I miss Herb's but Toast is a nice upgrade.\n\nI recommend the grilled eggplant sandwich = a super yummy veggie treat.\n\nWill try the milkshakes at the next visit.", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-27", "description": "Hideous does not begin to express the attitude dished out at this pretentious so-called 'eatery'.  Sneering little white chick sucking her teeth at the gall of two customers sitting at the counter Before Their Names Were Called!!!!!! We were next on the list, and I verbally checked in- \"okay if we sit here?\" to which I recieved a cursory \"yeah\" until Blondie the counter Nazi noticed us: she glared, she scolded, she condescended.  We took ourselves to Diamond Heights and saw our friends at Choice Yakiniku. Never again- You are Toast, toast, in our book.", "author": "victoria c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-30", "description": "I debated giving this review a one star.  Considering the hype and wait, food was not memorable and borderline bland.  \n\nFriends who live in the neighborhood are mystified why people were waiting to eat there for Sunday brunch when there are so many tastier places close by.", "author": "Victory V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-01", "description": "Toast Eatery Noe Valley can be summed up as a eatery of contradictions.\n\nThe good:\n\n- Boudin Bakery breads.  Ok, a little commercial, but a local business\n- Niman Ranch meats\n- Fair trade certified & organic coffees\n- Organic fruits and produce, when available\n- Compostable paper takeaway cartons \n\nGiven the above, one feels like Toast is making efforts to serve healthier food ingredients, until ...\n\nThe bad:\n\n- Smuckers brand jelly.  The second ingredient: high fructose corn syrup, the third ingredient: corn syrup.  Uh, where's the organic jelly?\n- Heinz ketchup.  Yup, same ingredients as in Smuckers\n- C&H sugar.  Ultra refinded and would probably satisfy the former Herb's crowd, but they also offer a more natural alternative, Sugar In The Raw brand turbinado sugar\n- Regular iodized table salt.  What, no Fleur de sel?\n\nOverall, Toast is a nice alternative to other Noe Valley breakfast restaurants and the late closing time of 10:00 pm is a welcome addition to our street of strollers and pups.  Typical breakfast fare, such as eggs benedict, scrambles, pancakes and corn beef hash are served, in addition to hamburgers, salads and sandwiches for lunch and dinner.  \n\nService was spotty on our visit, with delays in taking our order, refilling our water glasses and removing our dishes, but it certainly is a step above the former tenant - Herb's Fine Foods.  The building has been glamed up quite a bit with shiny metal trimmings on the exterior.  The only reminder of Herb's is the original Victorian mosaic tile at the front door and perhaps the counter service, though I miss the horseshoe counter of Herb's, it was pretty unique.  A tribute to Herb's, a hipster style hand drawing above the restroom door in the shape of a piece of toast, reminds diners of the former restaurant that occupied this space for so many years.  An additional 5 drawings line the wall with San Francisco cityscapes.\n\nUh, what's up with that distracting flat screen?", "author": "Rafael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-09", "description": "Finally a replacement for the late Herb's \"Fine\" Foods (see my other review).\nIf you like funky vinyl booths, greasy spoon decor and greasy spoon food, then I guess this won't fill the void.\n\nThe place that used to be Herb's has been completely gutted and rebuilt, with a new hardwood floor (somehow I don't miss the old linoleum floor) clean new tables, clean chairs, clean kitchen, and, unfortunately, a big (but clean!) TV behind the counter. I could do without the stupid TV, but on my first visit today the service was good, and the \"Noe Valley\" (how apt) omelet consisting of bacon, avocado, cheddar (which I declined), and eggs, of course, was pretty good.\n\nI do miss the Eggs Blackstone that Herb's used to have, and of course the prices are about 50% higher, and there's slightly less food (hmm, almost starting to miss it now...)\nbut the new surroundings make up for it. Did I mention it's clean? I'm not an OCD clean freak either - just contrasting it with Herb's.\n\nOh, and I did go late on a Wednesday morning so there were no weekend brunch crowds to make me wait.\nBut what's up with the TV?\nI go to eat, not watch CNN, or heaven forbid(!) ESPN -- can't vouch for their showing that channel but that would really suck for me.", "author": "Peter X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "First off, let me just say that I'm not one of those 'reviewers' who just wants to bash a place.  I want my review to be realistic, not mean or spiteful.  I hate how there are SO many cowards who hide behind their words (or I should say their insecurity), afraid to actually communicate their opinions in person.  Because just bitching about it here or even saying nice things (without conveying it to the business itself) will not allow the business to grow....period.\n\nThat said, I had just an OK time here.  The food was like something I'd have at a friends for brunch...comfortable but so-so.  The atmosphere was average and exactly what you'd pay for.  It's a busy place with a wait and the staff were on top of it all.  I can't say they weren't friendly but they weren't super happy, chipper people either.  Again, my experience was OK.  \n\nBTW, I did actually share this (not in such detail) with the host, in hopes that they can become a better place.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-05", "description": "Pros: The food is great, traditional breakfast food. The waiters are friendly. It's best to come on a weekday.\n\nCons: Gets very loud after 9:00, and it's annoying because it's in such a small space. Arrive by 8:30.\n\nAll in all, it's a good breakfast place if you come early (best by yourself or with one other person because you won't get a seat for 30 minutes if you're in a group) and are willing to spend a little (just a little) extra money.", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Yummy food. Great service. Friendly atmosphere. What's not to like? I'll be a regular...\nThe person working the door/wait list could be a bit more friendly.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-09", "description": "Okay were do I start I took my mother for dinner and we order the breakfast my Mother told the Fu$#@#$$ waitress she wanted her eggs well done not runny but the waitress responded with a rude question Whattttttttttttt    come on now you need us customers to go in pay the bill and tip so you can pay your rent, credit card, plastic surgery, your American Idol t-shir etc. But what you  you really need is a attitude adjustment here's a concept be nice smile I know it's hard and we know about the Noe valley attitude before you we had Herbs and the staff were highly nice... hope you take my suggestion and be nice..... The food was good....", "author": "jerry p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "Great diner breakfast! We prefer this location to the one nearer to our house on Church St. Something about the atmosphere and cooks at this location seems better to us, but the one on Church has outdoor seating so you can bring your dog if you like to that one. The hashbrowns are great as are every egg dish I've ordered. The croissant french toast is a favorite of the kiddies too. The fact that the serve breakfast all day isn't too shabby either. The burgers are supposed to be great here too, but we can't seem to get off the breakfast menu whenever we go :)", "author": "Artina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-17", "description": "I am a long time resident of Noe Valley, actually on 24th Street less than two blocks away from Toast. I would like to preface this review by saying that I have eaten here quite a few times. The only reason I periodically return is to see if they have improved their service and the quality of their food. It is my humble opinion that they have not made any improvements from the day they first opened, which is to say the food and service stinks. Why does this diner have make the patron ask for Splenda? Each table and counter place has other sugar substitutes and sugar packets, but you have to ask for Splenda. What a stupid policy. Now as for the food. If I could rate this place with a negative star, I would, but Yelp doesn't give me that option. I could probably write a short story regarding the lousy food, but I will try to contain myself. First let me say, what they call scrambled eggs would be better characterized as a fried egg patty, over cooked, and topped with food that sometimes is nearly unidentifiable. The hash brown patties must have been cooked on a device where temperatures must approach those of the sun's surface. Toast people, turn down your grill a bit. Anyone who orders French Toast, be prepared to have toast that is browned that has no taste, and the egg batter with which it is supposed to have some vanilla flavoring has no flavoring whatsoever. They could at least dust the \"French Toast\" with some confectioner's sugar. At least the taste buds could identify a flavor of sorts. I don't want to waste too much of your time or mine, but suffice it to say that the lunch fare is on par with the breakfast food, just not worth a visit. My view is not from just from one sitting. Since I live in the neighborhood toast is very convenient for me, hence my periodic visit with the hope the place improves. Since Toast is usually very busy on the weekends, I guess the proprietor(s) don't feel the need to improve its food and service. May I suggest they at least taste their tasteless food and perhaps make a change. One last thought, for the life of me, I can't understand the continued patronizing of this diner.  I have always thought San Franciscans had a far more discriminating palette. Even Herbs Fine Foods, which once occupied the place before Toast, wasn't all that great, was better than Toast.", "author": "Barry V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-30", "description": "I took my mother here when she was visiting last month and she really liked it.", "author": "Mitsi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-17", "description": "Always busy and humming with locals. Great menu with all possible breakfast combinations.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-31", "description": "\"My milk shake brings all the boys to the yard,\nand they\"re like\nit's better than yours,\ndamn right it's better than yours,\nI can teach you,\nbut I have to charge\"\n\nStaff (Jessica, Trystin, Colleen, Tracy, Emily, Megan and Rosa) are super rad, milkshakes rule, breakfast all day/night.... Werd!", "author": "Nick D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-08", "description": "Early Friday morn my son and I went in for breakfast. I ordered oatmeal and she pancakes. Oatmeal was worse than bland. Tasted like old socks and wasn't served with milk or sugar. I don't usually complain but when I did the server nonchalantly said \"well it's instant.\". What?? $6 for instant oatmeal? Then my son pushed away his pancakes. I took a bite and they were rubbery. On paying I mentioned the less than half eaten pancakes tasted rubbery as though they were microwaved. The server said \"oh no I saw them cook them. Oh maybe the grill wasn't hot enough. \"  the food was gross the server could care less and it's pricey. Don't waste your time or money.", "author": "Christina g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "Good for brunch! the breakfast burrito is excellent!", "author": "Alaina I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-29", "description": "very good food, service was attentive and easy going. definitely a place ill re-visit.", "author": "Moises M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "Yummy food, large servings, good prices, sweet servers, easy parking.  What's not to love?  Their omelets/scramblers, french toast, and hash browns are all delicious.  (I haven't sampled other items.)", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-17", "description": "4.5 stars, potential 5 if I have a great return trip.\n\nI was leery going into the experience. My friend raved about it but I tend to lean on the side of the Yelp community. Can't blame me, right Yelpers? For once, I'm going against the grain. I had one hell of a fantastic meal at Toast! Granted, the wait was a bit painful but with enough nagging (apologies to the host - my friend is an east coaster!), we eventually were seated by the window. I ordered a cup of joe and the lox scramble with hash browns and wheat toast. I don't know what it is but the combination of lox and cream cheese is just heaven to me. Scramble that together and... sorry, I'm going to need a moment. Toast took my favorite combo to a whole new level. Not only were there huge chunks of salmon but they also threw in generous amounts of avocado and tomato! I'll be surprised if I ever try another dish on the menu. And the hash browns? What can I say - crispy, crunchy, awesome.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-08", "description": "I like this place fine, as long as its an off time of day and  I get a salad.  They do produce a lovely salad.  As for the sandwiches, I wish their cooks would head to Ike's, Mr. Pickle's, or Molinari to find out what a truly great sandwich tastes like.  With a name like Toast one would expect the sandwiches to be their best items, but I have stopped ordering them there because they are so very bland.  I will say however, that the service is stellar.  So on a late Sunday afternoon, when I happen to be in a mood for a salad, they are a four star restaurant.  Problem is, there is nothing on the menu worth waiting in line for (unlike say, Ike's).", "author": "Liz R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-07", "description": "Look, the bottom line is that this place is a diner.  The food is good, not great, but certainly not bad by an means (I would say above average...which is a winner if you're in SF).  If you're looking for a yummy greasy meal or some decent breakfast, you've come the right place.\n\nIt is a little pricey, but it's also a clean place with decent service, which I'd rather have over a nasty greasy diner.  People get pissed if they have to wait, but that's part of coming here...deal with it.  Go across the street and get some coffee at Bernies (mmmm) and wait patiently.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-10", "description": "I've had a lot of corned beef hash in my life and I must say that Toast's ranks the highest on my list. Also their hash browns are cooked to perfection, extra crispy on the outside and nice and fluffy on the inside.", "author": "Dexter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-24", "description": "Ran across this place on a random Saturday night. Feeling like breakfast,  I had a belgian waffle with strawberries+blueberries. Fantastic food and fast, straight-forward service.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "This place is a good stand by for me.  I enjoy the French Burger and the Noe Scramble.  Nothing too fancy, the place is very reasonable with pricing and very clean.", "author": "Blake J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-18", "description": "4 months later and the wait's not getting any shorter and the service isn't any quicker!  GO HOME.", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-02", "description": "I like it! Nice little diner. The sandwiches are yum. They have sweet potato french fries. I usually get the turkey sandwich. They do serve beer. The staff has been friendly, helpful. There are plenty of tables. Unfortunately, it's always packed on Sundays, but that happens to most good restaurants for brunch.", "author": "Heidi L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-11", "description": "Staff was short and dismissive. Way overpriced food too! Had an omelette the first time and the ham and cheese sandwhich the second time. There are better places to spend your money in Noe.", "author": "Addy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Classic simple diner style food.  Very yummy and reasonably priced.  Food counter and tight table seating otherwise. Go Here!", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-21", "description": "The ambiance is nice, but the service and food is mediocre. Don't be fooled by the waiting diners outside.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "I give Toast high marks for their benedicts, omelets, and hash browns. Their Hollandaise is just right - not too thin, but not gooey.  The coffee is no great shakes, but perfectly serviceable as diner coffee goes.  Their hash browns are terrific with that perfect crispy golden crust on top that so few places get right any more.  I go back often since it's so close, but I always go when there's no line. It's a fine, local diner, but not a destination brunch spot worth queueing up 45 minutes for.", "author": "Kaley D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-06", "description": "service was friendly but my main let down was the food.  $10.50 for a cold platter of breakfast; hash brown (burnt), toast (cold), corn has (cold), eggs (cold)...... did i mention we sat inside?  i would rather walk 1 block down and eat at savor!", "author": "Mimi S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-01", "description": "I was excited at the modern style and menu selections of this new location - a definite upgrade to the aging looks of this chain's history.  I ordered the French Toast Slam (which apparently has been renamed the Toast Combo) and my friend ordered the Ham and Cheese Omelet (which is now called the godfather).  Unfortunately the prices of the new menu are much higher and my French Toast Slam came with a choice of sausage or bacon - not both.  The eggs were even more watery than usual and I wasn't sure if the french toast was made with bread or if they had used recycled cardboard in an attempt at being green.  I marinated my pork sausages in syrup in an attempt to make them edible, but even then they remained too hard to cut through with the knife provided.  My friend's Ham and Cheese Omelet came with Italian sausage instead of ham, which would have been a nice upgrade if it didn't taste like burned bacon.  We each had a large orange juice but it seems that while they've increased the price to $3.50, they've downgraded from minute maid to the generic powdered substitute.\n\nAll in all I'm unimpressed with the changes to the familiar restaurant design and menu.  I think I'll stick to their 816 Mission St location if I'm in the mood for bad food as at least the food tastes marginally better there and there isn't a line.  Maybe I would have been happier had I determined what the new incarnation of Moons over my Hammy is, but I think the only way I would give them a second chance is if they bring back the $2.99 Grand Slam.", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-13", "description": "Can someone please clarify for me why people lose their minds over this place? I pass by it on the weekends, and Toast is consistently packed. Before it came to 24th street, I had heard a lot of hype about it, and was excited. I've given it several chances, and am equally as unimpressed every time. Pancakes have a bisquick taste, food seems generic and runny, and it's a diner that lacks diner charm- you might as well go to ihop or denny's.", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "I would just like to say that this is an amazing restaurant with amazing service. My friend and I come here once in a while for a quick bite and always leave satisfied. We always have the same server. Aria. She is extremely kind, friendly, and makes the experience great. Thanks for always being the best service I have. :)", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-26", "description": "Seriously nothing special. Had the chicken fried steak -- it was literally identical to Cracker Barrel.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "not bad at all. just had lunch at the noe valley 24th st location and it was better than i expected. i figured their lunch would at least be as good as squat and gobble (which i would also say is \"not bad at all\"). it was better -- or, rather, at least i thought toast's reuben sandwich and burger were better. they said their corned beef was made in-house - no idea how one makes corned beef, but it sure was damn tasty, while also giving off that fresh, organic texture and flavor you might expect from something declared as being made \"in-house\". one might call it above average diner food. service was good/fast. price was fine for 2 people (by sf standards). will go again. will tell friends to try the reuben.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "I don't get why everyone doesn't xoxo Toast!!  My roommate and I love it.  I wouldn't go with a big group b/c it's small and cramped, but that's really the only negative.  I don't mind waiting - I kind of assume that's part of going to brunch in SF.  The Greek omelet, fruit salad, scramblers, coffee -- all yummilicious.", "author": "C K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-28", "description": "Even with its nice space and great service this was still the worst breakfast I've ever had in SF. The food was bland and greasy. Terrible hashbrowns. I would have rather eaten in a smoke-filled truckstop Denny's.", "author": "Jesse W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "I wonder if I'm the only resident of Noe Valley who does NOT miss Herbs Fine Foods (which was in the same location). Not that I have anything against greasy spoon diners, but the food there was far-and-away the absolute worst breakfast fare around. It did have a certain charm, I'll give you that, and the fact that it was in operation for decades was kind of cool, but man the food was tasteless and greasy.\n\nAs for Toast, well the food is okay, but rather bland. I've been four times with friends and we always have to ask for Tabasco to spice things up a bit. The menu is huge, but as many have said, not very interesting.\n\nHowever, I love the decor, and the service is quite good. And, having another option in the hood is a really good thing. (I did not consider Herbs and option).", "author": "Lucky C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-20", "description": "This place is right below my friends' apartment in San Francisco. It always seems busy and crowded. We happened to pop in during an odd time (4pm=dinner or lunch?) and were lucky to find the restaurant almost empty. The inside decor is nice - the feeling of an old diner (counter and stools and all) but more modern and sleek. The food was pricier than I was expecting, but the portions were pretty big. I had the country friend steak, which was pretty tasty. I especially liked the hash browns, which were perfectly shredded and golden. The coffee was good too. I'd go there again!", "author": "Somer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-02", "description": "Good brunch spot - especially like the hash browns with the eggs. Friendly staff, nice ambience, cool artwork, family & yuppie haven. The food is good, though not anything out of the ordinary. Also, the portion size is small compared to the prices. I don't think it justified the long wait.", "author": "Shweta V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-06", "description": "I can always count on good breakfast at this cute little joint. There golden crispy hashbrowns are the best!  Weekends are bit crowded so I often go on weekdays. Good place to eat breakfast alone, sit by the window and people/dog watch.", "author": "Kaori T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-15", "description": "Busy place in Noe valley.  I wanted regular fried eggs but they don't make them that way as the waitress said they only had them scrambled in with ham/bacon or in an omelet.  The scrambled thing was good and plenty with lots of meat in it and the hash brown fairly good as well.  No jam served with toast and no milk/cream on table for coffee.  One tub of butter for toast. It's nice cause it's not fancy at all, so it's uber casual.  I gave it 2 stars because truthfully I have experienced much better elsewhere.  My friend said people wait in line in hoards on the weekend, but that's what some people like to do.  There are so many places in SF. to eat, I hardly ever go back anywhere altho I used to love Askew on upper Market but that's something else now.", "author": "William G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "I went to Toast for a quick dinner on a Wednesday night, and it was just right.  I had the French Dip sandwich (great) and the Cheddar Broccoli Soup (so-so).  The wait staff was friendly, and the pecan pie hit the spot -- although I wouldn't say outstanding.  (The waitress said the cupcakes were her favorite.) I recommend this place for a good, any-night-of-the-week dinner.  Although I hear their brunch is excellent!", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "Our little family has enjoyed their breakfasts twice now.  The wait can be a bit depending day and time.  The service was good.  The food was great.  The kids love their chocolate chip pancakes.  Their omelettes and hamburgers are delicious, too!", "author": "Christina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "The Denver scramble was pretty good.  They gave me a refill on the water for my tea without prompting, which was nice.  The decor seems clean and pretty.", "author": "Niniane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "The ambiance brought me to this place due to it's warm welcoming and just how cozy it looked. Now for the food, the fresh fruit was excellent and the hashbrows... Best I've tasted. Their Denver omelette was excellent!", "author": "San S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-22", "description": "I give this place 3 to 4 stars. I went at an off time so there was no wait. I ordered an omelet which came with toast and hash browns. The omelet and hash browns were very tasty. The toast was nothing special, however.", "author": "Meredith G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-21", "description": "I actually find the 10am wait to be about average for most of the big breakfast joints in the city (Ella's, Boogaloo's, etc.)   The service is good and the food is reliably good.  I just don't feel like doing backflips about eggs and toast and other basics that I can enjoy at home within 10 mins. of my first hunger pangs... I guess it all depends on if I'm in the mood to dine out or to cook something, like bacon, that I probably wouldn't manage to put together at home.   Overall, a good, reliable breakfast place if you're looking to go out and want good service and are willing to wait a bit.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-12", "description": "Good food but it is packed during brunch on weekends. It's a bit small but the service is quick and friendly.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-04", "description": "Same menu and great service as the other Toast, just not as far out. Nice homage to Herb's in the cute toast-shaped decor. The place is a decent size and hopefully they can eventually offer outdoor seating... it can get rather warm inside. Viva La Toast!", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-29", "description": "Eh.  Rubbery pancakes, bad fries (frozen?), runny salad dressing, and gravy with a strange taste (from a box mix?).", "author": "Shin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-13", "description": "After rave reviews from my friends, I decided to give this place a go.  My short stack of blueberry pancakes were crammed with fresh blueberries and had a pretty decent \"mouthfeel.\"  However, my friend's \"hot link sausage\" was a surprise, as it was not really a breakfast sausage, but rather a spicy hot dog.  That is what a hot link is, but she wasn't expecting that for breakfast. Lesson learned. However, my other pal devoured her extended buffet of scrambled eggs, bacon, and belgian waffle with strawberries. The orange juice was good too, and the bottomless coffee was nice and hot, which is not always what you get in places like this.  Overall, my breakfast experience was a nice one, and it didn't hurt that we had a cute server.\n\n4.5 Star. Very Enjoyable.", "author": "Danny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "I just returned from my honeymoon and had breakfast at Toast this morning with my neighbor. It is so nice to see so many families with kids at Toast. I am expecially happy to see so many single men ( married or not, who knows) with kids. This Noe Valley and 24th Street is just wonderful! The staff at Toast are so nice and so accomodating to everyone! I just love this neighborhood!", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-03", "description": "Absolutely the blandest most boring breakfast food I've ever eaten. \n\nMy daughter had the hash brown hill, which sounded great on paper, but was so bland that my daughter, who loves all the ingredients, couldn't even finish it.  I tried it and it seemed they hadn't put even the most basic salt or pepper on it. We were craving ANYTHING that would give it flavor! \n\nI had the tofu scramble. There were no seasonings at all on it. Absolutely awful.\n\nAlso, the waitress was very unfriendly.\n\nI would never waste my money at this place again. Sigh.", "author": "ellyn h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-13", "description": "Previously I have eaten at Toast on Church St. and the service and food was great!  Yesterday my son & I ate at the Noe Valley restaurant and it was AWFUL!  I ordered eggs w/corned beef hash and the hash was stringy/ropey and dry and there were practically no potatoes in the mixture.  It must have been weeks old.  I paid $34 including the tip and I felt I should not have left a tip either the waitress interrupted my conversation while I was obviously talking.  I won't be back!", "author": "Donna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-20", "description": "So - So.  The pear salad is good, and the hamburgers look decent.  Not my first choice for Noe Valley take-out but kudos for staying open till 10 and having a clean, hip atmosphere.  This place has potential.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-12", "description": "The food is really good, but not sure it's worth the wait.  I've been going there since they opened, and the service is horrible.  I can't understand how they run a business this way.  On an average weekend, you can find a long wait, and tables can be empty, yet no one has cleaned them.  Also, when you first sit down, it takes waitresses at least 20 minutes to come to your table.  Where is the management in this place???  This place would never survive in NY.", "author": "Debra J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-27", "description": "decent food but nothing to rave about. the croissant french toast is exactly as it sounds. the croissant french toast at Chloe's is more crisp and just much better. the cornedbeef hash is dry but i kind of like it that way. a decent brunch but i wouldn't rush to go again.", "author": "Regina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-13", "description": "I understand why other reviewers are dinging Toast. I simply will not wait in line for breakfast or brunch. However, I've been to Toast several times during the week for lunch or a late dinner. No wait = good experience. It's better-than-average diner food, and it fits the bill when I'm in the mood for comfy American food.", "author": "Lee S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "Pretty good. I love to come here for dinner and eat pancakes which are very delicious. Always good coffee and specialty coffee. Service is always good. No outside seating. If you love breakfast come here or Savor.", "author": "julie q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "It was my birthday and I was undecided what to do with my day, because I was a bit tired. There were no good movies playing and it was a nice day out--so i walked to Noe Valley, because I really wanted a waffle and a cup of coffee. I had only eaten there once before and i had posted a previous review. It was quiet, but there was no menu on the window--so i asked the server if I could look at the menu and she was very nice. I decided to stay and get my meal. They were very attentive to me. I placed my order and my coffee was brought right out--it tasted good and it perked me up. I relaxed and enjoyed it. Shortly afterward, they brought out my waffle and it was awesome--it was actually huge, hot, freshly made and covered with mounds of beautiful red strawberries dusted off with powdered sugar. The waffle had the perfect crispness when I cut into it and was absolutely delicious. Jessica was a wonderful waitress--gave me my coffee and wrote happy birthday on my receipt. Lydia and Irene was super nice and friendly. They are all genuinely into their job--they are all great.....and they made my day", "author": "alexandria s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-22", "description": "I can't figure out why this place is so popular.  We were there this morning early, before the crowds.  The food is completely uninspired.  Tasteless hash browns, terribly over cooked sausage.  Boring!", "author": "laurel t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-30", "description": "Been here several times for breakfast and lunch. Will only go though if there's no one in line. The food is so-so but the coffee great. I live around the corner so it's convenient. The hash browns are a problem, tasteless and greasy. Some of the scrambles and omelets are good. Hamburgers so-so. Wait staff friendly but sometimes you feel ignored. Can't get out of there for under $15 with coffee tax and tip.", "author": "Steven V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-24", "description": "yum, yum, yum! not sure why there are so many \"eh\" reviews. i've eaten here quite a few times and everything (with one exception, see below) has been really good. \n\ntheir salads are uber-fresh and delicious, and there are a wide range of ingredient options. so many sandwiches, though i usually get the philly chicken sandwich because it's just so damned good. and their sweet potato fries are really good. one day i ordered a grapefruit juice and got an entire PINT of fresh-squeezed for $3.75--unheard of in this $$ city. my friends and bf have really enjoyed their meals, too--and my bf says the toast is, in fact, really good. (i'm trying to get up the nerve to try their corned beef hash, as kate's kitchen's is so amazing i'm afraid that nothing else could measure up.)\n\nmy only disappointment was the belgian waffle, which i finally gave in and ordered. it seemed like the batter was overbeaten, as the waffle was a bit tough, very sad. otherwise, toast is consistently fantastic!", "author": "Yelp Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-04", "description": "Kids were dropped off at a movie so my sweetie and I had 2 hours to ourselves...so what to do but go out and eat at a place that isn't necessarily kid friendly.    We found ourselves at TOAST, never been and it IS kid friendly.  The ambiance is great, just a tad bit small but the meal was really great.  Philly cheese steak with a house salad, the dressing was so very tasty.  Definitely would love to try their breakfast but suspect the wait on the weekend may deter us since it is rather small.  Cute neighborhood joint.", "author": "Maureen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-27", "description": "I kept hearing whispers and murmurs about this place with two locations in 'cool' parts of the city and was in Noe Valley doing errands yesterday around 3:00 pm and stumble upon it by accident.  Opportunity strikes in strange and unexpected ways, so I seized it and walked in and grabbed a menu and immediately liked the place.  It's small but clean, spare and inviting, and I loved the menu, it suggested good food, well prepared so I sat at the counter on a slightly too small stool (hey, I'm a huge guy) and ordered their basic burger with fries and a side of onion rings.  The menu told me they use Niman beef and the exposed stainless kitchen also told me they are meticulous in everything I could see so plainly and I felt confident I was getting fresh, well handled grub at this neat diner.  The spare space has about a dozen two top tables with nice upholstered chairs and there are maybe a dozen counter stools topped in bright red.  Color is gentle and spare and the artwork is various huge slices of toast with painted drawings by a local artist done in the style of the late Al Hirschfeld and they're wonderful.  Simple lighting, expansive, clean windows, a custom neon wall clock and well trained, pleasant servers working with clean, white uniformed kitchen staff served up my order which was perfectly cooked and served.  The burger was cooked just the way I wanted it, and the bun was toasted and the density was just right for the meat and fresh lettuce, tomato, red onion and sliced pickles.  Damn, the tomato's even had the tough, hard to chew center cut out, that's a sweet touch.  The fries are shoestring and house cut as well as blanched before frying which makes a near perfect fry, and the onion rings were addictive and delicious.  The portions are big and the prices are moderate, this place is a gem and I look forward to returning often.  They make shakes and serve Mitchell's Ice cream, a great local plus.  Beer and wine are available and they serve their whole menu from 7:00 AM to 10:00 PM Monday's thru Saturday's and from 7:00 to 5:00 PM on Sunday's.  Credit cards accepted as well as spoiled kids so choose a time when there isn't a Costco like parking lot of custom baby strollers piloted by rude, ignorant and self centered young parents who add to the current crop of arrogant slobs ruining the world with self serving greed.", "author": "Stu S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-09", "description": "Decided to go here for brunch on a Sunday.  Bracing myself for a long wait, I was quite surprised that we only porbably waited for about 15 minutes considering there was about 8 groups ahead of us.  I had the the french toast with fruits...it was ok.  Not bad but nothing great.  My cousin had a tuna melt and garlic fries.  The fries would've been okay if they hadn't used those \"pre-choped and bottled\" garlic.  The garlic taste wasn't the same.", "author": "Gia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-06", "description": "Overpriced mediocre food.  They charge a ton for maple syrup on top of the overpriced pancakes.  Nothing special about this place.", "author": "M C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-31", "description": "In general the atmosphere was rather reasonable in that one could easily have a conversation.  However, the food was certainly uninspiring and frankly not appetizing in the least.  Banana walnut pancakes were dry, bland pancakes simply with bananas and walnuts strewn about the plate.  A bowl of fruit was simply an assortment of underripe melon with pineapple.  Needless to say, I shall not venture back for a second meal.", "author": "Tim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-24", "description": "stale toast yumm. i'll stick with joe's or make breakfast at home. i have bills to pay and can't keep throwing my money away at overpriced chains like toast. service: wants to be something its not, food: price is not inline with what is on offer - nothing unique and not all that good quality. decor: is pretty good - but does not fit in with the street. that's my take. keep walking.", "author": "Sara J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-18", "description": "Breakfast sandwich on an English muffin: Very average. Hash browns: excellent.", "author": "Jacob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-26", "description": "Wow - this place rocks just as much as the first one on Church street! Went here for breakfast this morning and had the croissant french toast - I must say it was truly amazing. Service was great - what a solid start. Welcome to the neighborhood Toast - great to finally have you here!", "author": "SF Gal .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-04", "description": "While walking in Noe Valley with a friend from  NYC last sunday, we initially decided to have lunch at Pasta Pomodoro. Upon walking up 24th street ,we noticed Toast and the crazy mob waiting outside to be seated. Glancing into the restaurant thru the all-glass facade our eyes immediately focused on the generous portions of fresh-looking salads and mouth watering plates of golden waffles and fresh fruits including blueberries,raspberries,etc.\n           The hostess told us it would be a 30-40 minute wait so we decided to put our name on the waiting list and grab a coffee at Starbucks. Twenty minutes later,my name was called and we were seated at the bar. The restaurant was impeccably clean and the service was prompt and more or less efficient. Ive had my fair share of corned-beef hash and I must say  Toast's hash is amazingly tender and well-seasoned.........delicious. My friend ordered the nutella pancakes and she was not dissapointed. The fresh fruit was  F-R-E-S-H and excellent quality.....fresh raspberries,blueberries and melon. Toast is a no-nonsense breakfast spot that uses fresh ingredients with a presentation of food that is not super sheeshy or over-priced. Very San Francisco nuts and bolts breakfast spot. I'll definetly go back.", "author": "peter n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-10", "description": "It's so great to have a decent new place for casual food in the neighborhood. They have a solid menu for breakfast, brunch, or lunch food. I would be less inclined to go there for dinner. Like the Church location, the service isn't the greatest, but it's not bad either. Given that there are so few lunch/brunch options in the 24th street corridor, it's great to have a new option, and I think Toast is going to attract a lot of business from Savor, whose service seems to decline to new lows every quarter. So far, I've only ordered the Niman Ranch Classic Burger and Fries, and find it to be good tasting and well prepared, and the fries have a nice light crispy feeling. One complaint - I find the menu to be extremely misleading. They make a big deal about serving Niman Ranch meat on the menu, and many of the items do use Niman Ranch meat, but many other items use standard industrial factory farmed meats. I think it's misleading to mix organic and factory meats on the same page. Bottom line: Nothing particularly outstanding about this place, but nothing bad either - a solid, clean, reasonably fast, and tasty option for basic American diner style food.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-26", "description": "okay so i dont get why we need to toast in the same neighborhood.. but hey if you have that kind of money go for it... service was good and food was okay... i had the eggs benedict but it wasnt great! my friend had just a regular bacon and eggs.... you cant go wrong there... the door was open so it was super cold and the tables are way to close together.. rather  liked the fact they had hash browns.. but id rather go to chloe's or basso's for breakfast..", "author": "Shauna P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-24", "description": "This place is a complete joke and a disgrace to Herbs!!!!  The food is crappy at best, way overpriced and the service-horrible.  Its really amazing that people actually eat here but I guess when you're desperate u gotta eat.  If you want to try a real brekfast joint go to Cloes on Church Street.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-23", "description": "every time I see people waiting to eat here I am baffled. Why? It is not cheap, the food is completely uninspired and mediocre. It must be the shiny fixtures", "author": "Noe K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-13", "description": "i have to agree with some of the other yelpers; service was friendly but slow; my water glass was never refilled; the food was not bad. \n\nthe wait is a bit long for what it is, but such is the case with new places. i'll be back for a late lunch/early dinner.", "author": "B N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "I've been patiently waiting as I constantly walk by this space, finally the construction is finished and Toast has opened.  So glad to have another brunch option on 24th- I'm hoping this will take the wait times down a little bit.  I've been here twice for brunch already.  The wait was not bad-  I found it easy to find the sign in list and was called sooner than expected . The staff is friendly and attentive.  I'm a fan of the scramblers-veggie had a lot more avocado than i expected-not a bad thing, but the real find for me is the fresh fruit- which is far superior to what chloe's calls its fresh fruit option.  It is in fact fresh fruit including seasonal berries that seemed like it could have been carried in from the farmer's market down a couple blocks.  I have also tasted the pancakes which i approve of -but not quite like chloes specials,  the hash browns were nothing special- i'm a sucker for the potatoes at savor.  I think it is a solid option for brunch and will be back to try other meals.", "author": "Maria F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "Stopped in mid-afternoon Saturday for some brunch and loved it. Sat at the counter, watched the ball game and had some great coffee and a truly scrumptious omelette, the one with lox & capers, a bit pricey maybe but friendly staff & a clean non-grungy place to eat has to cost something.", "author": "I A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-03", "description": "Been in Noe Valley for 12 years now... some places come and go and some just blow! It amazes me why so many people line up outside for this overpriced, over crowded non inviting eatery? I make a better breakfast and don't burn the hash browns so much that they hurt when you eat them? Not to mention the poorly designed layout... the counter is so large in depth that the wait staff reach so far to serve people?... you sit so close to the people next to you on the stool that i might as well eat their food too? Tables? What happened to diner booths? Did you half ass the building permits just like your layout? The place is not fun or inviting? sure Herbs was run down but ya could of capitalized on the whole diner theme with new items and a better layout. And my favorite... just last Sunday I get that attitude from a female wait staff when I wanted to sit at the counter and order my favorite burnt hash browns... she told me to sign up for an empty counter? WTF? Everyone outside are waiting for 4 plus seating at tables and I was baffled when I looked at the sign up sheet? Walked the eff out... Toast... do us all a favor... attitude check with the staff, clean up or move out!!! One last note... I'm not the only long term Noewegian that thinks the same... word of mouth goes a long way!?!?!?", "author": "Jim T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-24", "description": "I don't think it's quite as horrible as some of you, but it's definitely not great.  I've ordered for pick-up three or four times and it's okay when I'm in a rush.  Their service needs some major work though.  First time they messed up my order and gave me the Chicken Club instead of Spicy Chicken sandwich.    My friend had a worse experience when they forgot to enter her order into the computer, so it wasn't ready when she got there.  They then tried to convince her that she had called the Church Street location...NEVER blame the customer!!!  When they found her order scrawled on a little pad next to the telephone, there was no apology or offer of a discount at all.  Not even an \"Oops, our bad!\"  Their side salad is absolutely terrible, and I'm not picky when it comes to salads.  But the lettuce was so limp and there weren't even hints of any veggies in it.  I hate wasting food, but I had to throw the salad in the compost.  The sandwich was good though.  Also, there's a waitress there who really needs to learn how to dress appropriately.  No way would I want to bring my kids in there when she's wearing hot shorts, stripper boots, and a seriously low cut shirt.  So for the service, 1/2 star, and 1 1/2 star for the food.  I hope it gets better, since it's convenient for me.", "author": "Janie K."}
