{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "Nice selection of sushi. They make it fresh everyday and has it packaged for people on the go. They have it individually packed in their own tray and displayed on the counter with signs labeling what each tray is.\n\nService: 4\nSelection: 5\nTaste: 4\n\nI remember a while back they would have samples and when your a struggling student the samples in the mall does help a lot plus a instant ramen/cup noodle.. lol", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-17", "description": "Hungry? An SFSU student? Shopper that wondering around?\n\nThis place is meh but not horrible. It will get the job done but will leave you wanting real restaurant level sushi. Save up your money and go down 19th or Daly city and find a better spot. Don't come here and think it will have the same freshness as a typical sushi spot. \n\nI'm giving it 2 stars because it does the job. It's a little cheaper. It's great for students. I've never got sick from this place but it always left me wanting to wish I spent a little more for fresher and tastier sushi at a restaurant.", "author": "Ann N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "I love their California roll sushi it taste great. The price is fine. It fills me up easily. The size portion is just right. I believe there were six pieces of California roll. I went there with my family my family got something else. We shared a little bit of everything. The texture of the sushi filling was like fish almost.\nLast time I went with my co-workers I got a combination of lunch box special and they said i picked out a good choice ,while they just got some regular meals. I think they sell happy lunch boxes im not sure but i should probably check I will come back. I had their miso soup.", "author": "Chen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "Normally I do not do mall food court but yesterday I tried the Tokyo Express and food was good. The staff very friendly and food not to costly.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-28", "description": "This is extremely unsafe. I counted 62 items, some stacked 7 high, sitting on the counter with no refrigeration/heat, at 2:20PM on a Sunday. \n\nIt looks like there are reviewers claiming they got sick. I believe them.", "author": "Brent S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "For being in a mall food court, Tokyo Express is a good option for those looking sushi at Stonestown. I enjoy their variety of rolls and sashimi, and the miso soup isn't half bad. Certain items could be more flavorful, but it's satisfying considering it's not a sit down restaurant. \n\nI like the grab and go options which still taste fresh, not always the case with this type of sushi. The staff are friendly and they sometimes offer samples upon ordering, which is nice. Worth a try if you're shopping in Stonestown and want a quick meal of Japanese food.", "author": "Edwina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "Ordered Lemon Basil Chicken, it came with rice, soup and salad. Soup was cold and salad tasted old, the chicken was crispy and tasty, but their was a hair in it.", "author": "Debasmita P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I was in Stonestown Mall and went to the Food Court. The Russian/Central Asian place hardly had anything veg, likewise with the expensive poke place, Panda doesn't guarantee that any of the low-quality food is veg even if it's veg, the ramen place didn't have any veg broth, and the Korean place didn't have the tofu Iike so I didn't get their bibimbop, which I enjoy.\n\nSo, I walked over to Tokyo Express, next to the hotdog on a stick place (do people still eat that?!), and they had plenty of veg options. The workers there were really sweet and helpful (they mentioned that the miso was fish based, so they could give me more salad instead), the sushi was really good (avocado, kampyo/gourd, and tempura sushi, as well as inari), and I'm excited to go back and try more of their veg options.", "author": "Veg V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-23", "description": "A lot of the sushi is left on the counter at room temperature... beware. Also expensive for what it is.", "author": "Karina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "I have passed by this place a lot when I am here. Today is my first time coming here since I decided to try something new today. This is when my sushi cravings came in, so I made a stop here to get some sushi for lunch. The box with 8 pieces of California Rolls taste so good. Sushi always make an excellent choice when seeking meal alternatives.\n\nFriendly team members on duty, good food, prompt and friendly service. Overall, positive first experience here and I enjoyed the tray of sushi I had. I am definitely coming back and will have to try other items from the menu.\n\nHours of Operation are:\nMonday - Saturday 10:30 am - 9:00 pm\nSunday 11:00 am - 7:00 pm\n\nBrief Edit:\nOne of the trays of sushi I had are the California Roll and the Philly Roll. The sushi is freshly prepared and delicious.\n\nReasons for rating:\n- friendly team members\n- good food\n- prompt and friendly service", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "The food is nothing special.  Ordered the chicken teriyaki bowl with salad, and the lettuce was not fresh: it looked like it a few days old and brittle.  The teriyaki was burnt mostly and I had to throw out most of it.\n\nCustomer service was the worst.  Got here on a Wednesday night, but the place wasn't busy.  There was one patron at the register, but a group of young workers were just chatting among themselves, even when they noticed us.  Once they finished their convo, then the Asian guy with glasses went to the other register and displayed his rudeness.  His tone was cold as he took our order and rushed us, even when there was no one behind us.\n\nWhen he gave us our bag of takeout, he gave me a dirty look and didn't say anything.  I can understand why there's a restaurant where you order your own food in downtown SF WITHOUT having to deal with bad customer service. Tokyo Express is in a food court, so there are many other choices of food around here.", "author": "Chan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Their lemon basil chicken is really good. Eat almost two three times a month. I am surprised by some of bad reviews, I like their food and service, they are nice and not rude, ask politely.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "This is fresh sushi. The way the place is set-up means most customer orders can probably be filled faster than McDonald's.\n\nGiving a review of Tokyo Express should be easy enough as long as emphasis is placed on the misnomer. \"Express\" means, no reservations, no valet parking, no hostess writing your name on a waiting list, no dirty tables, no waitresses, no waiting for the tab, no pressure to vacate after you finish eating.\n\nTokyo Express ingredients and methods seem to parallel what one will experience at the majority of sit-down sushi restaurants. Look over the menu. What you like might be ready for you even before you step-up to the counter. That's express. And the avacado is surprising green.", "author": "The Adv G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "Your average food court quality. I wouldn't say the price is here differ from an actual restaurant. It's just convenient if you're at SFSU and craving some Japanese food. \n\nI get the tempera udon because I'm not sure how fresh the fish are. Udon comes with a small salad and four pieces of tempura. \n\nRemember to check in with 5 Stars. Every $10 is one point and 10 points is a free entree.\n\nThere is usually at least two ladies working at all times. Today the first one was catching up with a friend on the side but that's OK since things were slow. She was aware when the customer approached the cash register and quickly attended done. The other girl seemed like she was having a bad day and hands you your tray instead of leaving it on the counter. I would've preferred if she left it on the table given that we are handling hot soup, but it worked out.", "author": "Danae L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "I had really good and high quailty sushi. This is my new favorite place in SF. Will definitely go back.", "author": "Hicran K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-29", "description": "Foods alright and they are strongly and rude when asking for extra condiments like sauce. Had to stop coming here. And hey charge you 50 cent extra and slim on it. Very cheap customer services", "author": "Marcus S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-10", "description": "Everything is a lot more expensive now.  Although they don't advertise bento boxes anymore, you still get it in the form of the entree selections (entree, salad and soup.  $2 get you tempura).  \n\nService was slow but they cook to order so I don't blame them.  Food was plentiful.  I ordered basil chicken.  That came out tough - like they left it in the fryer too long or it was fried twice.  They did not use enough sauce for the chicken.\n\nIt's ok for mall food.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-24", "description": "It is okay at best. I always get the chicken katsu with curry, but recently the curry tastes more watered down (definitely more liquidy as well). I feel like they try to disguise that with adding more vegetables to the broth. They sometimes give out samples which is nice and they're under the five star reward card. Every $10 you spend, you get 1 star. 1 star can be claimed for a free drink and 10 stars can be claimed for a free entree under $10.\n\nThe real reason for my review is the fact that a guy was cleaning shoes in the kitchen while I was waiting for my order. I'm not sure if he washed his hands after or where the shoes were placed. Definitely not high quality stuff and for the price you pay, you'd expect at least that much, right? I'd advise stopping by near closing time when the sushi is 50% off. At least you'll get more bang for your buck.", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-15", "description": "Like what many other reviewers mentioned...it's not bad for food they serve at the mall. Don't come expecting Nobu/Morimoto grade sushi...because it's not that. But to be honest, a lot of what they sell are pretty good. \n\nIf you need a quick fix...come here. But if you have access and the patience to go to a sushi bar a couple minutes away...go to the sushi bar. \n\nI usually get the California Rolls: $4.75 for 8 pieces. Prices are reasonable depending what you get.", "author": "Ralph N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "Me: \"Do you have a steak udon soup?\"\n\nAnnie (cashier): \"No. We have a beef soup.\"\n\nMe: \"What type of beef? I'm not a fan of the meatballs some restaurants refer to as beef.\"\n\nAnnie: \"Rib eye STEAK.\"\n\nMe: \"OK. I'll take the rib eye steak soup.\"\n\nAnnie: \"We don't call it that. It's just beef.\"\n\nAs I type this review I realize that I'm dealing with an immature girl who obviously finds comfort in arbitrary arguments. Just ask for \"beef\" udon soup from Annie and avoid her incorrect and dogmatic stand on type of meat used.", "author": "JD D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "I ordered from Tokyo Express via GrubHub and had to make a change to my order after submitting. The gal who answered was as helpful as can be. I wanted to add an item but the system wouldn't allow her to do it which was totally fine. Did I realllllly need another roll? \nMy order arrived earlier than the GrubHub estimated time and was perfectly executed. Their sushi is so fresh and so palatable! \nThey also added a nice treat to my order. \n10 stars for customer service.", "author": "Ash H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "Really bad service. I was on an 1 hr lunch break and waited 30 minutes for the wrong order. Prior to that I saw 4 people get their food ahead me even though they had been helped after me. I asked the server ETA after 15 minuets and she rolled her eyes and said there are two different sides in the kitchen but my order will be out in a minute. After another 10 minutes I had asked again and she gave me sarcastic condensing tone of \"just wait it will be out.\" After another freakin 5 minutes of waiting my food is ready but guess what IT WAS THE WRONG ORDER! After wasting 30 minutes of my lunch time  and giving me a attitude they couldn't acknowledge they f***ed up. I asked for a refund and to cancel my order. They still gave me an attitude and rolled their eyes after they gave me the receipt. Not going back.", "author": "Cristina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "Would be four or five stars as the food is actually not bad for a mall food court.  Prices are a bit on the higher end as if it's on par with a sit down restaurant.  But all in all the quality is fine for what it is.\n\nHowever, the downgrade of two stars is for the food prep and cooks that one can see behind the counter (the kitchen is just behind).  How does this food place pass inspection without being written up for preparers not wearing gloves?  I realize that in Japanese restaurants the sushi preparers do not wear gloves but then again I've not seen any of them use their hands to do other non-cooking things (e.g. one Tokyo Express sushi preparer used his mobile phone in the middle of preparing sushi).  The other food preparers also do not wear gloves; I've seen the person mixing the salads with bare hands.  This is totally unsanitary, and it's a miracle no one's gotten ill.  This issue ought to be addressed by the health inspection dept. yet somehow it passes.  Go figure.", "author": "Luisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Considering this is food court fare, I'd say they are consistently yummy and average priced. Their Chirashi bowl is $19, same as restaurants, but the portion size is superior. The order includes 3 types of fish thinly sliced into 4 pieces each, 3 pieces of shrimp, 2 pieces of tomago, seaweed salad and a ton of tobiko. Like, A TON. Also comes w/ a miso and salad.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-14", "description": "Decided to try this place at the mall. The salmon donburi was a dollar off that day (it was around $7). There was no one in the line, so wait time was very short. When I got my order, I was surprised by how much food I actually got. They also gave me miso soup, a salad, and edamame (vegetable tempura was for another person if you're looking @ the pic). \n\nEverything was pretty okay. The only thing was that the salmon was too fishy. It reminded me of fish markets where some stands had fishes with a stench. It's because they'd been laying out too long. If you can imagine how that smell tastes, that's what I got. The salmon didn't smell, but I guess that it wasn't too fresh. Can't remember the last time I had really bad salmon. \n\nAll in all, you get what you pay for. It's mall food, it's convenient and cheap. I wouldn't come back though... I didn't like their salmon and wouldn't want to try any other fish. Also, there was a ramen place I was checking out across from here. Will probably go there next time.", "author": "Shelby B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-26", "description": "Terrible ordering system and inflexibility . Even when I order a more expensive dish can't add on items. Losing money in spite of themselves. Owner needs to reexamine what he set up. Stupid! :-( my order was for $13.00 but because it wasn't an \"entree\" I couldn't add a side on. Really stupid system. \n\nWhat is clearly apparent since I still go to this establishment is the lack of customer service. With the exception of one young gentleman server there, the service is BAD! No one smiles or treats the customers well and kind. It is more with contempt. Not what you would expect in the spirit of Japanese hospitality at all. And when they are helping you it is done with tryouts Ng to rush you away even though they are not\nBusy. The women are terrible, mechanical and without graciousness. If it weren't for the proximity of where I live and the desire for Japanese food, I wouldn't be patronizing  this place. So little additional effort and attitude to extend and yet none. Disappointing and no sign of any management. :-( If one could give no stars that is what this place would get.", "author": "Rick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "It's too expensive for the quality but I like coming here for a grab and go before heading back to SFSU.  The California rolls are nothing special and I guess at least the combo comes with soup and salad.  Expect cheap packaging.  However, I keep coming because it's convenient and I genuinely like the tuna's splash of flavor and the creaminess of the salmon.", "author": "Quyne V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "Just spent $18 here for pretty average sushi. \n\nI paid the extra money for \"real\" crab in the California Rolls. After closer inspection I noticed that there was sushi rice inside the roll (this was a reverse roll with the rice on the outside), the rice was cleverly disguised to make it look like there was more crab.\n\nIt had to have been placed there on purpose because all the rice was outside of the nori.\n\nIf you're looking for mall sushi that's been sitting on display all morning then this is the place to go. I'd rather go to Kome Japanese Seafood & Grill Buffet in Daly City and get much better quality food (and variety) for the same amount of money.", "author": "Dino D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Pretty good plates and sushi for the mall food.  My kids love the udon and one order is usually not enough. Pretty extensive menu, and they are quick with your order. After getting your food, you need to find a table to dive into your meal. This is the only place I go for food when I'm at Stonestown. Sushi is pretty fresh for the mall.", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-14", "description": "So I come here whenever I want sushi and it's almost $1 per piece . Anyways , usually when I go to sushi places , I ask for teriyaki sauce ON my sushi and it's free of charge . I went to this place and ordered California Rolls with Terayki sauce drizzled on it and they said it's a 50 cent charge. I was fine with that so I ordered . Next thing you know , they gave me the sauce in a container , not DRIZZLED on like I asked especially since I had to pay 50 cent extra for it . Advice : listen to what your customer wants and ACTUALLY DO OT", "author": "Katy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "I had the double salmon roll and enjoyed it alright. The lemon slices on top were a bit too thick so the sourness really dominated, which made it a good thing that they didn't have a slice of lemon per piece. It was a bit overpriced at $11 for one roll at a food court, but no stomach issues from me post-meal so that was a relief (after reading the reviews for other places around that spot :/)", "author": "Mio W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-08", "description": "Funny story. I worked here once upon a time... but that's besides the point. I still frequent this spot when I'm looking for food in the mall because it's one of the better things to eat at Stonestown. Their food has been consistently good ever since 2008! Prices vary and they always have a lot of staff working so your order gets taken and food comes out quick.", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "I was surprised at how good the food was here, given that it's in a food court. Expect paper and plastic dishes and cups, but the chopsticks are wood, at least. More important, what's in those plastic containers tastes good, doesn't cost too much, and will fill you up.\n\nFrom a menu of about three dozen choices, I ordered the chirashi for $20, expecting and getting a lot of food. There was plenty of sashimi--the standard salmon, tuna, yellowtail, and halibut. The only disappointment was the cooked shrimp--stringy and tasteless as if they had sat in the freezer for 6 months. Another minor distraction was a stick of imitation crab, though it tasted fine.\n\nAlong with this were delicious greens and roe, all on top of a monstrous helping of warm sushi rice. They could do with better wasabi, though. On the side came tasty miso broth and a small green salad.\n\nThe help were friendly, willing, and able, the wait was short, and they even offered a little sushi bite while I waited.\n\nThe Tokyo Express on Mission near Fourth is more my style, but I do expect to be reporting from Stonestown again as well.", "author": "Will L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "For mall food, this place isn't bad at all. Is it amazing? No. Does it fulfill my sushi craving? Yes. \n\nI got their special--6 piece dragon roll and 4 piece California roll which came w/soup and salad. I mean, I just wanted a snack but I went a little overboard and got an entire meal. \n\nOverall, very favorable sushi (for mall food). The rice was a little soggy looking. The total came to $12 something. Not terrible but I know I could've gotten a bigger meal if I had gone to a restaurant.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-06", "description": "Do not eat here. It's not safe to have Sushi left out at room temperature. I got sick eating at this location.", "author": "Richard K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-11", "description": "I used to go here a lot, and the food was really good. One of my favorite dinner places in stonestown galleria. The cashiers were always really nice and even more enthusiastic. However, I think this place went down over time. The workers have pretty much stopped being happy and started acting like they just want to go home. Mostly just the workers that have gone down, the food is still pretty good. Would recommend the nabe yaki udon. Anyway, I usually get the nabe yaki udon, and it comes with a shrimp tempura, imitation crab, seaweed, chicken, shrimp, and fish. Overall a really great dish, but when u order to go, they don't give u a shrimp tempura. It's kind of a scam bcuz it states that it comes with it on the menu, and they don't give it to u when u get to go, and by the time u open it u realize the shrimp tempura isn't there. So today I got it again, and asked for it \"for here\". They ended up giving it \"to go\" for some stupid reason that I don't understand, and I didn't get the tempura. No big deal u think, just go up and ask for it. Well that's exactly what I did. Then the cashier rolled her eyes and slowly went back to the kitchen to get me one. She gave it to me with a dirty-ish look and did a FAKE SMILE. What the **** is your problem lady?! Read your menu! I know it can be sad working in a mediocre Japanese restaurant in the food court of a mall but don't take your anger out on me..... All in all, good food and some stingy mean workers. The other people r  nice tho", "author": "Bob J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-02", "description": "Ordered food 8:40 pm and was told restaurant was closed. They work till 9:00. You\nLost customers", "author": "Gore S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-25", "description": "A crappy place for a crappy reward program\n\nThe food is not fresh. Sushis are stirring over the counter for hours\nThe reward program will give you shit and the people will make sure that you will get screwed\n\nCarry on for the sake of your health", "author": "Jean-Yves F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-08", "description": "Worst customer services ever. First and last time I will ever eat here. The food is not even good.", "author": "E.A.A M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "I've been going to this place for years because of how close stones town is to my house. The only thing that might bother people is the price for the food, but honestly i've never ever ate anything year that taste horrible. Food is good for mall food, but prices can kill a wallet.", "author": "Pj A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-13", "description": "I got the New York and spicy California roll from here. Service was kind of slow..\n\nI usually finish my sushi but this place was different... The rice used wasn't even sushi rice... It was jasmine. Also the shrimp wasn't fresh. The tobiko was really weird.. it was too big and how it popped in your mouth was strange .. Definitely avoid this place at all costs.. Sushi shouldn't taste like this...\n\nI even had to use extra wasabi to wash down the horrible taste..", "author": "Virginia Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-03", "description": "Honestly, I was expecting more. Unlike the other yelpers, my friend and I had a bad experience here.\n\nWe ordered two rolls, because usually at other places, it would fill us up with the same prices.  However, when our order came out, we were very disappointed. The rolls were PUNY and it tasted below average. Was definitely not expected. Well, what else could I expect from mall food? It could just be what we ordered, or bad day behind in the kitchen, we'll never know. \n\nAll I know is that I won't be coming back here any time soon.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-07", "description": "Whenever I'm at Stonestown for lunch, this is the place to go for me because I just never get tired of Japanese food. I used to visit the Tokyo Express near my workplace in the financial district and grabbed it at least 3-4 times a month (given that I barely had time to step out at all so I try to come here every Friday). When I visited that place, I usually get the bento box, unagi donburi, or order a roll or two. \n\nI still frequent this location quite a bit, at least once or twice a week sometimes. Of course their food is a tad pricey but it's Japanese food, so if it's super cheap, it's either a hole in the wall or straight up bad. But this place is pretty good considering it to be a food court restaurant. I always grab their chicken teriyaki bento deluxe and split it with someone or if that's not enough to split between two people, we would also grab a 10-piece spider roll and split that as well. The server's there are usually pretty friendly and I racked up a good amount of those $0.50 off next purchase and even though it's only $0.50, it really does help. I used to toss these coupons thinking I'd never come back but realized just how many times I come to this place.\n\nRecently they offered a new dish, the lemon basil chicken and it looked really appealing so I thought about giving it a try and it's not bad at all. Their chicken is freshly fried up and pretty worth the deal with soup and salad for about $7.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-17", "description": "Great service but the sushi wasn't!  There was a bit of an aftertaste with the dragon roll (made when we ordered it) and the spider roll (pre-made and waiting on the counter).", "author": "Dar F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-16", "description": "It's been a year I've been to this Tokyo Express in particular. A lot has changed over the course of 12 months - like the prices, proportions they serve and how the food tastes overall. \n\nI recently came and ordered the salmon, and when I got it - it seemed to be undercooked. The salmon on the outside was warm and the inside was pretty cold - almost like it was just defrosted from the microwave. I was kind of bummed because for a standard place in the mall, it exceeded my expectations. Now it definitely has changed and become overpriced. Not exactly the best way to spend over $10 on a plate that looked like it was tossed in the microwave. Did I mention the quantity of food they serve got a lot smaller? It now has the amount as a Panda Express kid's meal. \n\nTough times and tough economy call for desperate measures I guess. Disappointed.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "GREAT place for students! Being a college student there are always two problems when it comes to dining: money and hunger.\n\nThe food here is cheap considering the portions they give you. When my teriyaki chicken bento came out I was surprised, there were 2 layers of sliced chicken! It also came with salad which had a tasty dressing and also came with miso soup.\n\nThe sushi here was good too and I especially liked how it also came with salad.\n\nMost definitely recommend one of the best places to eat at Stones Town!", "author": "Cristy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "For mall food, this place is pretty bomb! I love coming here because it's pretty affordable. I always get the veggie udon with a side of maguro sashimi. Always under $13! The food is pretty tasty. The miso soup is eh. But other than that, great place to get a quick, satisfying meal!", "author": "Cana Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-16", "description": "Ok so I had a wierd craving for sushi out of no where but was stuck in the mall waiting for my car in the shop.  I went upstairs to Tokyo express hoping for a cheap bento with some teriyaki and a couple of pieces of sushi.  Food looked fine and sitting on the counter we're the premade bento boxes....on the counter....not on ice...raw fish....in the zone...seriously?!?!?!?!  Has no one heard of the zone??? Now I get that they probably have reasonable turn over come on...I've been to japan many times and sushi chefs would commit seppuku before serving sushi that had been sitting at room temp for ANY period of time", "author": "Aaron E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-18", "description": "The food was typical mall food, but it's the service that's horrible. \nThe servers are all frowning and when you don't present yourself immediately to claim your food, you're given attitude. I thought those scowls they were sporting couldn't get any more sour...I was wrong. They down right stared me down for missing my number. Girls, it's not that serious, lighten up. I just didn't hear you the first time. Relax and turn that frown upside down. Remember, if you're not exactly winning beauty pageants, you're not doing yourselves any favors by throwing a mean face on the problem.", "author": "Jonsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "I was always hesitant to order from here whenever I came to the food court because it is quite pricey. but the chicken teriyaki entree was very worth it. Comes with rice miso and salad all for under $10. I will be back.", "author": "Martin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "One of my favorite places to eat in the mall. Their Lemon Basil Chicken meal is so good and fresh. I love their spicy mayo and they give out samples on weekdays too!", "author": "Lynne E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "I bought daily special of caterpillar roll with salad and soup. To be honest, I am not impressed.", "author": "Lin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-04", "description": "Thanks to Vanessa H, I've gotten a good deal on late night dinner. But think about it: the counter sushi has been sitting there, in room temperature, ALL DAY long. Not so fresh is it? But they've gotta get rid of it, and what better way of doing it than selling it for half price?!\n\nCustomer service can be a little pushy. I don't like how when you walk up to the counter, they expect you to order right away. Give me a few minutes to decide, please!\n\nOverall, the sushi (non-counter sushi) is fresher. Sometimes you get a good lunch deal (with miso and salad) on certain counter sushi orders for under $10. Their salads have a thick dressing, unlike other Japanese places that have watery dressings. Also, their udon soups are hot and delicious. Quick service! Will be back!", "author": "Priscilla W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "First time eating here and I got the tonkatsu (pork cutlet) meal. It was pretty good. I'll eat here again. Mos def!", "author": "Udawg F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "Good Japanese food if you on a budget. I usually order their Seafood Udon where it  comes with a salad, and also a side of California rolls. You also can't go wrong with their Chicken Teriyaki bento or don which is pretty much the same thing. Order is ready within five minutes and the staff is also very friendly and always remember what I would order. Another good thing is that they accept Gopago where I can just come pick up my order when it ready, good for on days I am too lazy to wait for my order.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "MALL CAFETERIA FOOD!\n\nThe food tastes good, price is reasonable.\n\nHALF OFF at night near closing time... although the sushi has sat on their warm counter all day, i still buy and eat. ((danger zone temperatures))\n\ni work nearby so i sometimes come by for a quick dinner.", "author": "Neek W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-23", "description": "Just went to this Tokyo Express at the Stonestown Shopping Mall for lunch one day ago  the food item that...  I really like to eat is the Lemon Basil Chicken Combo Meal which also comes with Miso Soup & Salad with thousand island dressing and also comes with a choice of Tempera...  \n\nI always like to have the Tempera with the Lemon Chicken Basil Combo Meal I have tried the Sushi & Chicken Katsu before, what I really like the most is the Lemon Chicken Basil Combo and it really tastes good once take a bite out of Lemon Chicken Basil!!!!! Besides eating the Japanese Food I also like to have a cup of their yummy tasting Japanese Rice Tea...", "author": "William B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-12", "description": "What a mistake. \n\nAll I came for was sushi to go on the road. And there was parking at Stonestown so I thought I'd stop by. All I wanted was a salmon teriyaki but the menu was so bunched together and overwhelming, I wanted to think it through. There were three girls at the counter. I asked one at the register for a menu. She said no then walked away to the rest of the girls. The three girls just stood together. \n\nWhen I approached the cashier again, another girl assisted me. I asked for a simple salmon teriyaki bento bowl. But first, may I say the menu on the left hand side is confusing. The picture shows more items, but what you get and what I even tasted was laughable. You've gotta be kidding me. The picture and the price was different than the items on the bento box when listed. Also, she asked me if I'd like to add tempura. I asked how much and it came out to 2 dollars more, funny the picture of the bento box says another price.\n\nThe wait was long for short meal. No over the top service or assistance. Just the cashier looking for an add-on it felt like, which is fine (I appreciate sales techniques)\n\nBut the food was awful! The salmon tasted as if it was frozen. No taste. The salad was soggy. The salmon was basted in green onions under teriyaki sauce but the oranges were put on top of the sauce as well so I couldn't even eat the oranges. The salmon was tasteless and stale. It still tasted frozen and stiff just warmed up. The tempera were only 4 pieces which is fine, but no crunch of the batter. The tempura sauce was just planted on top of it and could have spilled. The tomato that was put on top of the soggy salad was pathetic. It was drenched in all the dressing and was soggy. Who in the world would eat this. \n\nThe miso soup was warm! \n\nGah, I really feel like giving it 1 star but I appreciate the girl trying to make money for the company with the add-on. Too bad I will never eat there again.", "author": "Jacqueline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "Considering this is at a mall, I would say the prices on their sushi and other different menu items tends to be pretty reasonable and is the quality of the food. I don't get to make it up to San Francisco as much, but when stopping by Stonestown Galleria for food, this is one of the places I stop by to get my favorite Kappa Maki (which is Cucumber Roll for those who don't know; one order consists of six pieces). The servers and staff are pretty nice and helpful.", "author": "Paul N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-05", "description": "(See pics)\n\nSame as the one in Fidi. Same food same multiple combos but the sushi is made and in boxes already instead of made to order. But it might very well be made just in the morning.\n\nI had the chicken don with a fried egg, something I never ordered from them before. It was with tons of chicken, lots of rice, a good egg. It came with the basic salad and miso, and even free Chinese tea. All for $6.59. Really cheap with alright taste.", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-03", "description": "It's mall \"food court\" food, and yet the taste somewhat reminds me of Japanese food you'd order from that mall in J-Town. Not the greatest in terms of quality (the beef teriyaki reminded me of an eighth grade physical science experiment using rubber bands, seeing how far I could stretch it before it actually ripped). The salad was overly \"saucy\" and the lettuce wilting under the dressing. The chicken katsu was ALL batter and the rice portions ridiculously small as in it only took me 2 bites to finish it off. Hey, at least the food was edible.\n\nThe way the take-out package was put together could have been better as the soup that one of the meals came in exploded!\n\nIn contrast to the less than desirable food, the service was actually efficient. There were about 4 staff members at the front, all with a purpose it seemed. One took the order and money, another took phone orders, one prepared the trays and take out orders, and another made unfunny jokes to people I'm assuming were his friends.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "My Mom & i just love this place.  We been going here since before the Stonestown location, which was Serramonte.  They not only have great sushi but the soups are great not too salty.  Even if you're on a diet they have great many low cal items.  & for people not on diet all the deep fry goodies & tempura are pretty good,   The best deal here is the combo bento meal with soup salad & cal roll.  They are very fast on the week days & order by phone for express pickup orders, especially weekends.", "author": "Pearl A. F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-31", "description": "Ordered the seafood udon soup on a chilly night. Was surprised it was $9.25 at a food court, but pressed on. Was served a large bowl of noodles with 2 shrimp, 2 imitation crab sticks, and one paper thin slice of fish cake. Broth was average. Tasted like the instant udon noodle soup bowl I could have bought downstairs at Trader Joes. Appropriate price point would have been $6.00. Maybe their sushi is better? Oh, it did come with a small side salad but that was covered in a mayonnaise dressing. I hate mayonnaise.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "Wasn't sure what to eat from the choices in the food court. So went with my usual favorite food...sushi. I was pleasantly surprised with the sushi items here. There are prepackaged sushi combos that come with salad and miso soup. Other choices like crazier rolls, udon, ramen etc are offered. Not bad for a Japanese/sushi mall joint.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-02", "description": "$9 for a Dragon Roll+ california roll+Miso soup+Salad...\nSOLD!\n\nthis place has really good sushi for the price.  I'll admit it's not the best i've ever tasted, but $9 for ALL of that goodness..it was well worth it.  The sushi didn't fall apart at all.  the rolls were delicious.  miso soup was just right and the salad was yummy.  The only negative thing i have to say about it was that the tempura in the dragon roll was a tid bit soggy for me.  \n\ni am DEFINITELY coming back here.  They also have california rolls for $5! and california rolls with real crab for $6!\n\nthis is THEE best place to eat in the stonestown mall!", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-17", "description": "Really? 4 stars?   I guess it's tasty enough and reasonably priced for sushi in general but... it's  just as expensive as close-by Taraval Sushi and... it's mall sushi.  It's good for mall sushi but still not worth $30+ for 2 people to eat in the food court.  Come to think of it... 4$ hamachi nigiri is actually more expensive than Taraval Sushi if i remember right... and I'd much rather eat at Taraval!\n\nI'd only eat there again if I were starving and wanted something healthy with shopping at Stonestown mall.\n\nProbably won't see ya there!", "author": "Susan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "This is probably the best Japanese food that you can ever find in a mall food court.  I'm a fan of Tokyo Express since I always ate at their Spear location and their Stonestown branch is just as good.  The only difference is that they don't have self serve tea and water stations, but you can ask for them at no extra charge.  One item that they have here that's not at the Spear branch is their Lemon Basil Chicken.  I ordered it and it was pretty much like chicken karaage, but it was still good.  Good bentos, good sushi, the best Nabeyaki Udon, and fast service.  If you're hungry at Stonestown, it's a good choice!", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "For being a fresh sushi place in a mall this was good. This would not have been my first thought for sushi but I would come back here. It is kinda expensive and you don't get a huge amount but a decent amount. \nOverall I would maybe comeback here if someone else was paying.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-18", "description": "i find myself eating here way too often and thats not a bad thing. they are located in the food court of the stonestown galleria near SF state which is where i attend school. Their prices are decent i spend about 7-9 bucks with a soda or drink for lunch. I usually get the chicken udon. \n\nthere is fresh spinach and actual teriyaki chicken in there that has been grilled chopped up and put onto the top of the udon. quite an interesting taste with the grilled chicken on top of a soup base but i love it.\n\ntheir service is super fast, its almost kind of like a fast food sushi joint.", "author": "Ray L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-09", "description": "People, listen, Raw Fish is safe to eat.\nBut the only reason why I don't eat raw fish anymore because Fish are eating Bin Laden's dead body for crying out loud!!!!\n\nNot unlike Japan's nuclear power plant incident.\nPeople are so fxxxin' paranoid.\nI don't understand that those paranoia.\nThey should be more paranoid eating Monsanto's growth hormone and corn-fed beef, pork and chicken.\nThey don't know what is really safe and not safe.\nIt is safe to eat ocean fish, OK? OK!\n\nBtw, did you know that there is corn-fed fish from Nicaragua, or something? It's white meat cheap fish but corn fed. This is should not be eaten.\n\nBut sometimes I'll go FXXX myself like ..... eating raw fish at a shopping mall.\nMall raw fish should not be happening.\nMall Sushi sounds pretty bad already, especially Stonestown.\nHaving Sushi at a mall is Fxxxin' disgusting habit, especially Stonestown.\n\nbut it was not as bad as I was expecting.\n\nReason why I went Stonestown mall food court only because my old Puerto Rican friend wanted to buy me lunch there.\nHe is a pseudo Sushi-Nazi, you know what i sayin'?\nHe wants to see me eating the Korean Chirashi because he could not finish it because it's a big bowl.\n\nI still think that Don-Buri idea came from Korea to Japan.\nWell, to me, most Japanese cuisine is.\n\nSo, how can I say, \"NO ! Go Fxxx your self, Do you think I go with you to eat Mall Sushi? Hell No! FXXXOFF!!!\"\n\nNo, I did not say that. \nI said, \" Yes, of course. .I love to\"\n\nSo i was here with him and his Chinese friend.\nSo, 3 of us,  Puerto Rican, Chinese and Japanese. What a trio!!!, at the Stonestown shopping mall having Korean Chirashi.\n\nIt's 15 bucks + tax.\nKorean Chirashi isn't Japanese Chirashi, of course.\nThe Korean Chirashi is the bomb.\nSpicy Hot mixed with raw Maguro, Sake, Tobiko, seawead salad,  lettuce, tomato and avocado, sometimes Mango, over Sushi-rice.\nIt looks like a mountain, you don't know how or where to start eating the shit.\nThis is Bad, I mean Good.\nI recommend to ask for extra spicy.\nHo Ho Ho Muzafxxxer!!!\nFxxxmeintheasshole!!!\n\nlong story cut short.\n\nI got sick after. \nI was on the can for 45 minutes, in and out for 3 times, it was bad. \nI said to my self, \"It was a mistake. How could I eat Mall Sushi?\" I was crying, really.\n\nBut I met them 2 days after the Korean Hot Chirashi incident, they said they were OK, nothing happened to them, we had exactly the same dish.\n\nSo, I had to go back there again to find out, was it me? or the dish.\n\nIt was not the dish, it was me.\nFxxxmeintheasshole!!!\n\nThis is happened before Bin Laden died.\n\n50% Korean and 50% Latino in the kitchen.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "Man, if I gotta have fast food ... make it Japanese every time! Note most of the negative reviews are to do with sushi. If you order mall sushi I feel bad for you son ... serious tactical mistake no matter how good the place is in all other regards. There's a huge amount of other options.\n\nThe bento boxes are great for grab-n-go if you've got to get to a class over at State. If you can eat-in, the udon bowls are pretty huge for the price ($7-8 depending on what type of meat.) The food is pretty good, some of it tends toward plain and bland, but I'll take plain and balanced/healthy over loaded w/ saturated fat anyday.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-20", "description": "Got some take-out today at around 7PM and was pleasantly surprised.\n\nTheir vegetable udon was quite good!  I remember ordering udon from here around 10 years ago and didn't like it so I never thought to order it again.\n\nBut it was good!  Even 15-20 minutes after it was packed and I was home waiting for the alcohol to kick in, the udon was tasty and hot!\n\nIt had spinach, carrots, seaweed, broccoli, zucchini and two tasty pieces of takuwan (oshinko).  So satisfying!  Some green onions as well.  I'm not fond of mushrooms and onions and bamboo shoots and weird crap that a lot of other restaurants offer so I accepted this simplicity with open arms.\n\nI would not hesitate to order this again!\n\nTheir sushi remains average.  The salad that comes with udon comes with a pleasant chunky peanut dressing.  Yum!\n\nI won't be surprised if I come here once or twice a week now!\n\nMall food, you've surprassed my expectations once again!  Now only if they'd add an Indian place...", "author": "Kimiko Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "I love their salad! It makes me come back for more. I didn't expect mall food to be THIS good. I tried their beef bento box, it was good. But If you ask me, I rather have you order the Beef don instead! It's $8! And it's served with EGG on top! Way better than a bento box, with two sliced oranges. I thought bento boxes comes with tempura, but I guess not. I rather have you get  Donburi  than bento, much more worth the money! The beef donburi, the beef was kind of overcooked. So try their chicken teriyaki or salmon! It's good either way!\n\nMy mom really enjoys their salmon don! And my dad loves their raw sushi rolls! It's good and pretty legit. Service is kind of slow, but I think that's because everyone uses GoPago! But other than that, whenever you're in the mall, you MUST try their  Donburi. Their udon is also delicious and fulfilling! Comes with salad, and soup as well! :) Hope this helps!", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "For mall food this place was a pleasant surprise. We were in the area and fancied a bite to eat.\nNot in the mood to venture far, we sought out the food court.\nThe usual fare.\nWe plopped onto Japanese food and took a look at the selection of rolls.\n\nWe bought a boxed roll each and enjoyed every bite. Perhaps it was the lack of expectation that made it better than it actually was. Both impressed and satiated. Not bad and thanks Tokyo Express!", "author": "Nick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-06", "description": "One cannot expect much from mall food, but to re-fuel after some shopping with the kiddo, this spot is decent.  A big plus is coming here about 1/2 hour before the mall closes...all the pre-packaged sushi on the counter is 50% off.\n\nSomething funny:  as we were walking by, cashier says, it's half off now, some guy just swoops by and takes two packages.  I guess he's a regular and was just waiting to hear the key words before he swiftly snatching the items he had his eagle eyes on.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-17", "description": "Now there's Mall Sushi! \n\nJust as expensive with only half the taste!\n\nFor 7.95 I expected decent tasting sushi. What I got was a tasteless Spider Roll. I would guess that it's quite hard for crab to not taste like anything, but somehow they managed it.\n\nThe miso was wonderful, so delish but I've been to Berkeley where for around the same price you can get the same thing I ordered and it's fantabulous.\n\nNot unh and never again.", "author": "Meg T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "got to give this place a 4 star! :) for a mall food court sushi. this is.by far the best sushi I had. the people.there was nice. even got a free sample :). while I was waiting I saw one of the server helping out someone and talking to them about what is what and wasn't even really annoyed by it. the food was pretty good too. but the roll I had seemed a bit on the smaller size but I was.satisfied after I ate so happy me:) totally would come.back when I have a sushi craving and is on campus and don't want to drive anywhere", "author": "Janne Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-15", "description": "Apparently, I have not yelped this place.  Even though I've been here since its inception... I find this location slightly better than their FiDi location, which isn't saying much, and kind of sad since this is in a food court and the other is a free-standing restaurant.  But anyway... \n\nSo let's rank this by the mall-food standards...\n\nMuch of their items are pre-made...as in sitting on the counter waiting for you to pick-up and pay for.  They have decent noodle dishes.  \n\nA slight plus is the free samples.  A negative, is the insanely thick amounts of batter on their tempura items.  Sorry but I wanted Japanese food, not Midwestern food.  \n\nService = friendly enough (most of the time).", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "When I think of mall Japanese food, I picture cheaply made, small portions and poor tasting food. The only thing I really order at Japanese restaurants is the bento box and theirs is very good. They give a generous amount of meat, their salad is delicious and they actually package the miso soup togo. Many restaurants don't give you the soup if you order togo. Overall the quality is great and the price is very reasonable (about 7 dollars tax included for the bento box). Only took them less than 5 minutes to finish my order too! Hopefully that doesn't mean my meal was microwaved..", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Foods cheap and always decently good. I always stick with the same combination that seem to stay consistent: Salmon bento box w/ California rolls, tempura and curry. My only gripe is that cleanliness doesn't seem like any of the food courts establishments strong points having walked in the back.", "author": "Brandon I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "My boyfriend and his mom ordered some food from Tokyo express and although my boyfriend loved his lemon chicken, his mother thought the fish was undercooked. My boyfriend went to resolve this problem by asking to exchange for a better entree, the woman behind the counter said that she couldn't do that for him. I went back and talked to a different girl that was behind the register because the girl my boyfriend spoke to obviously did not know how to handle the situation. Flustered and upset I tell her that it's not correct to leave a customer with uncooked food. She tells me it was a misunderstanding and she thought my boyfriend was asking to replace his mother's meal because she simply didn't enjoy it. She continued to apologize and offer to cook me a new meal, when I told her I didn't want to wait because the mall was closing soon, she offered me a refund. I'm happy with the reconstructed situation handled and corrected by Arisa.  \n\nMinus 1 star for the uncooked fish \nMinus 4 stars for the way the first employee handled the situation \nPlus 4 stars for Arisa politely fixing the situation so I didn't have to get f/ckin ratchet in front of my boyfriend's mom", "author": "Hannah P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-30", "description": "I give them 2.5 stars. It was really nothing amazing. I got the sushi combo B for $10 and the rice was a bit hard like it has been sitting there a while, not good considering raw fish is on top. The Miso soup was cold and grainy. The salad was bland and watered down dressing, I literally ended up feeding half ny salad to my friend's pet rat.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "Been coming here for a long time now. At our most recent visit we've discovered that they've really upped the prices on most things. My daughter usually orders a plain udon with fishcake, old price was $7 ($6 for the udon + $1 fishcake), now it's over $9! We're talking about broth, udon and about 6 slices of the white fishcake with pink edging! Their ca roll/nigiri/salad/soup combo was $10, now it's $15! They use to give out a $0.50/$1.00 coupon on your next visit too (depends on how much you spend) but seems that's no longer offered.\n\nTheir sushi is decent when you have a craving for something quick but not worth the higher price UNLESS you go at their 50% off sale :)", "author": "V P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Love the fresh sushi & chicken or tempura Udon soups! Always stop here for lunch between making rounds @ F21 & b&bw -fast service & decent prices & their sushi & teriyaki is welcoming & pleasant. Udon soup on a cold foggy day in Stonestowb is a +", "author": "Julian I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "Mall food is so expensive these days so if I' gonna spend the ~ $10 + for a meal then I want something more exciting that the standard mall fair.  \n\nI usually get the unagi donbori or sushi combo (CA roll w/ some nigiri).  Both come with soup and salad so it is enough food to make me nice and full.  I also like that they will package everything nicely if you want it as a to-go order, so it is nice and easy for me go get as I run off to class.\n\nIt's mall sushi so I would never come here to order sashimi or something like that, but everything I've ever tried thus far has been pretty yummy and seems like a much better value to me than the other options at Stones.", "author": "Ariel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-01", "description": "As I bit into the jumping tail roll, my eyes were unexpectedly gleaming. It was actually pretty damn good. \n\nFor the time period of being a struggling college student, this place was greatly priced and fairly good (mainly cooked rolls). Made those study breaks during my SFSU days pretty satisfying.", "author": "Saleen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "You know... this is such a pleasant discovery!  \n\nAt this moment, I can't eat raw fish, or too much seafood at that.  But, I've been really pleased about the food I've gotten here.  Their bento boxes and non-raw rolls are what I get.  My husband and I come here quite often since it's very convenient for us.  Prices are good.  Sushi has a good amount of rice... not too much.  I think I'll go tomorrow =).", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-18", "description": "good sushi at low low cheap prices", "author": "Benson M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-20", "description": "I love sushi. Problem is, I love it so much, the only time I stop eating it, is when I hate myself. This place wasn't bad, it is in a food court. I haven't had the best experience thus far with the sushi places in the area, so my expectations were super low. But these guys actually did a decent job. I got the beef teriyaki with a side of rock and roll. The service was very friendly, but no fast at all. They seemed to be pretty busy, even though there was no one else in line. I didn't realize that people were sitting down while waiting for their order, so it's deceiving if you come here thinking it would be fast. Most of the food was good, the beef was flavorful, the miso and tempura were fantastic, and the salad was decent. I was actually disappointed with the sushi though. It was boring, tiny, and forgetful. Hopefully it was just by chance and not the status quo", "author": "Phan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-27", "description": "The service was pretty good, but the food is just disgusting. I ordered the Alaskan Maki (\"Fresh\" Salmon and Avocado) and let me just say that the avocado was hard, and the salmon was all, but fresh. There is an overwhelming amount of vinegar and when I closely looked at one piece of salmon, there was a white blotch on it that was about 1 cm long. I thought it was just some harmless paper packaging, but it's actually growing out of the salmon. I don't know how this place passed its health code... Never again will I order from this place.", "author": "Tammy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "The food is good. Had the unagi don. First time I had a dish that actually looked better than the one on display. It came with lots of unagi, avocado, pickled daikon and seaweed on top of rice.", "author": "Nori L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-10", "description": "i was kinda effy at first because the place is far.but then if the food is really good then its worth it.i forgot that i shoud have taken 'good service' into account too.\ni was so pissed off when they turned down my order through gopago. so pissed off that i was impelled to create a yelp account just to write them a review.they dont even deserve a star.\nso here's the story: i went to the front to clarify things, the lady said they cncelled my order because there are too many orders from gopago. i will understand if you run out of food but heck no, those who pays cash gets their food. so its just all about $$$$. if u cant handle the too many orders from gopago, dont put ur name on the list, or better yet, close down your business. \ni havent tried ur food yet, but no thanks! ur service sucks and i wont be coming back. never!", "author": "Kzel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "I go to this place fairly often because I live very near and I often have sushi cravings. The sushi is pretty good. Not gourmet, but it's always flavorful, fresh, and well-built (I hate it when the rolls fall apart en route to your mouth!). And their California Rolls are made with real crab, not that weird artificial crab salad that some places have. They have great combos. A ton of sushi with miso soup and salad is only $9-10. I haven't yet tried their noodle soups, but I would like to in the near future.", "author": "Kelsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-14", "description": "I will never, EVER get tired of sushi. Finally got to check this out for myself last month. I thought I was simply going to have one of their pre-made sushi containers, which had  assorted nigiri and California roll, and a drink. But to my surprise, the lady also put in soup and salad. Nice! I'll be sure to try one of their specialty rolls next time. It was a very enjoyable lunch. I stand firm on my approval of this as the best food court grub in Stonestown.", "author": "Rhia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-10", "description": "I guess this place deserves a better review from me since my friend got me hooked on thus place and the sushi isn't all that bad. For mall sushi its not bad at all. I still avoid their uncooked options but their other rolls are tasty. If I'm at the mall or at SFSU's campus I'll drop by this place, it beats the horrible sushi place at sfsu.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-16", "description": "In the land of no (okay, maybe \"limited\") good food that is 4th & Market area, this place is an OK spot. \n\nIt's called \"express\" for a reason people, don't go in expecting amazing food. It's not amazing, but it IS relatively good. Stick to the basics here, and you'll be just fine. California roll in a jiffy, yes please.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "Ok...I have eaten here three times so its time for a review. \nFood court sushi x three visits = No afterburning repercussions. So that equals four stars! It ain't Nobu NYC taste-wise but cheap, fast, fairly tasty with the old lady all important \"no gut ache\" seal of approval.", "author": "Barb B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "I usually end up choosing this place when I do eat at Stonestown.\nIt is almost like eating in a real restaurant rather than a food court.  The meals come with miso soup and salad!  It would be nice if everything was in a bento, but hey, you cant have everything.\n\nits still good, its still good.", "author": "kim w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-11", "description": "I'm sure if it wasn't for the two fish scales that I bit into in my spicy tuna roll, I would've given Tokyo Express a higher rating. But eh, what can you expect about the quality controls when\n\n1. It's mall food. \n \n2. It's made by persons of non-Japanese descent. Now I'm not saying that Mexicans can't make mind-blowing sushi, but just my spicy tuna roll didn't come out as good as it looked. \n\nI'd still give this place a second chance though because the California Rolls were decent. For 6 bucks you can get a hefty 12 pieces of real crab California Roll and 5 bucks for imitation.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "Ordered for Department Meeting...\n\nLove:\nPlenty of parking.\nFriendly and efficient staffs.\nGreat service.\nSushi was fresh.\nGave plenty of condiments along with utensils and plates for take out. \nOn time!\n\nSSF Kaiser doctors and chiefs love them!", "author": "the s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "Got a bit hungry and was craving for some sushi again. I was in stonestown and decided to check out tokyo express. When I got there I was greeted cheerfully by a guy. I got a menu, scanned it and gave him my order. I didnt wait long, which was good. I guess that was because I went before the lunch rush. I got crunch california roll, new york roll caterpillar roll. I liked the california and the caterpillar more than the new york one. Price was reasonable. They even have vegetarian sushi for those who dont eat meat. I will go back if I am craving for some sushi and Im in Stonestown. =)", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-15", "description": "randomly stumbled in here with a friend for lunch not expecting much because of the generic name and the sign to go with it.\n\nTo my surprise, the food was way better than i expected. I ordered the bento box for lunch with only came out to 7 dollar-ish, and for what i got (Salmon Teriyaki, Rice, Soup, 6 Pieces of California Rolls, and a Salad) it wasn't bad at all. My friend tried some weird roll with seaweed and mango topped on a roll will unagi in the middle; it was the first time i've ever seen/heard of that particular roll, and damn was it tasty. I will be back for that in the near future. Service was a bit slow considering that the restaurant was less than half full; disappointing esp. to hungry customers like myself and others...(minus 1 star)...\n\nother than that, parking is great, food is great and the atmosphere is great. oh yea, the prices are hiked way up for dinner, so stop by @ lunch first to see if their food is a good match for your taste buds before taking you honey bunch out to dinner... It's a recession and i'm trying to help you and your pocket out.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "I've had bad mall sushi.  Like really bad.  Like, \"when did you get this fish, last week?\" or \"this rice is really dry / really mushy.\"\n\nLately, I've had a weird sushi craving all the time.  Don't worry, I won't get mercury poisening or anything (see Jeremy Piven).  Anyway, after a long day in SF, we decided to stop by this mall and get some food.\n\nThe store front for Tokyo Express looks pretty nice, and a lot of pre-made sushi is out in front.  I decided to get one of the pre-made boxes out in front (3 pairs of nigri, 6 california rolls, soup and salad) for around $10.  Sounds a little expensive, but when you compare that to a $3 corndog, it doesn't sound so bad.\n\nI was pleasantly surprised by the whole meal.  The soup was piping hot, the salad fresh, and the sushi was great.  I'm not claiming  it is the best in the bay area, but it certainly exceeded expectations.\n\nNext time I'm being a mall rat here, I'll definetly stop by again.", "author": "Khanh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "4 stars for waiting around until 8:15pm or later for 1/2 off sushi! \n\nthe bf and i thought we were just looking real pretty that night when the sushi rang up 1/2 off. should have scanned the counter a little more to the left to see the sign. usually wouldn't purchase sushi at a the mall, but it tastes a little better on sale....we're struggling here, ok?\n\nnext time we tried going for some sushi, there were a ton of \"lurkers\" just sitting around at the tables, off to the side, and walking back and forth in front of the counter. when that sign went up, the vultures descended. \n\ntouche to you, tokyo express.", "author": "Maria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-22", "description": "3.5 stars to be exact\n\nwhenever i am hungry and at stones i always come here. i dont know why though. i usually either get their donburi bowls or a plate of sushi. the donburi, i love the beef and the chicken ones...the meat is never overcooked so its not tough or dry. it may not be the best japanese food out there, but at a mall, this is pretty decent.", "author": "Stella J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-05", "description": "Mall sushi.\n\nThe concept can send a shiver through the belly if you ever had a bad experience with it. Mall sushi can fall to such a low point that really it makes one wonder if anyone has ever died from consuming a funky piece of California roll in a food court.  \n\nSo of course it makes complete sense that I decided to try this place out  slightly hungover and weak from lack of food. But then I noticed the promising \"People Love Us On Yelp\" sticker and reasoned that I'm sure more than one Yelper had probably been here in my predicament before. I quickly grabbed a spider roll and popped a piece in with a \"dun dun dun\" thought running through my head. My first thought: it's kinda warm, immediately was replaced by, well it IS a cooked roll dummy. My mood brightened as I crunched through the seaweed and tempura. By the time, I was on to piece #2, I decided that this was in deed a good choice and happily snarfed away my roll at work as I was doing paperwork. My headache cleared and my belly was happy until lunch time. \n\nThe next time I came over I decided to venture for a full meal. I was pressed for time so I couldn't go on a coma inducing, roll binge. I went for a California roll and sashimi combo which came with miso and a salad. The California roll (w/real crab) met my mental standard for a basic CA roll, not goopy or overly seaweed tasting. The sashimi was more of a stand out. All the pieces of salmon, tuna and white tuna were soft but not soggy and not smelly or funky in the least. The miso was disappointing. The soup had a very strong tofu and seaweed smell but very weak flavor. The little iceburg lettuce salad was much better. Nothing too spectacular, just some lettuce and shredded carrots with a dab of dressing. But it was crisp and crunchy and kinda brightened my already happy meal. \n\nMy only real complaint is that for some reason some of my food tasted a little too warm. Still, for the price (under $5 for the roll, about $10 for the meal) I can assure you that the food is worth it. This should be your standard and will change your opinion of mall sushi. Trust.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-21", "description": "This place has terrible sushi. It tasted old and dry and was allover nasty. We all had to choke down the food to make it worth the money because this food was way overpriced for the quality.", "author": "Warren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "Considering it's mall sushi, this is great!\n\nThe Super Dynamite Roll- YUMMMY- and there is no rice in there - amazing.  Lightly tempura fried, avocado, spicy hamachi, tobiko and then a spicy and sweet sauce on top!\n\nAnd then there is their Crunchy CA Roll which just means it is fried!\n\nEverytime I come here I try a new roll and so far have never been let down.  \n\nReasonably priced, better than most mall food, better than some local sushi restaurants even..........Everything is fresh, and clean and they always give free samples!", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "The Stonestown food court has some great eateries (I would have said restaurant but I don't think that's the technical term for these places.) California Crisp has some great options, Sorabol isn't that bad, and if you go to Hot Dog on a Stick for the lemonade, then that place is awesome.\n\nTokyo Express fits into that \"surprisingly good\" category along with California Crisp. The sushi is actually good to great. Usually, I judge a place on how the Rock 'N Roll sushi is... and any roll containing unagi. A couple of days ago, I once ordered both the Shogun roll and Rock N' Roll, which is essentially the same thing, but the unagi is on top of the roll with the Shogun roll. Both were awesome.\n\nThe sushi itself is a solid 4... maybe a little higher... but of course, it stays at 4 because I really don't think any eatery in a food court should get five stars because I despise actually eating there, what with all the Mercy and Lowell and Lincoln kids... and the old people and soccer moms and people just generally in my way.\n\nBut then again, that's most food courts inside huge malls.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-31", "description": "Mall food is never at the top of my list...nothing too exciting but your usual panda, corn dog, sbarro, but what is this Tokyo Express?... After being disappointed by the not so healthy choices offered, I settled for Tokyo Express. A bit doubtful because of my snobby Japanese food expectations, but I took a big gulp and stepped towards the register. A YELP STICKER! That already got me excited....\n\nFood selections from sushi, tempura, and your usual teriyaki dishes. One chirashi for me please! $15 for a freakin Chirashi bowl...this thing better have some hidden treasures. \n\nTo my surprise, a decent sized bowl, and it comes with salad and miso soup?  A treasure indeed! \nQuite amazing, but it gets better. My chirashi bowl came with 6 pieces of salmon, 6 pieces of tuna, tobiko, AND Ikura?! WOW. I am quite amazed for this to be mall food. Any place with Ikura (my favs) and of course WHITE ginger tops my list. I licked my bowl like crazy and I think that was pretty much the highlight of my day.\n \nThe girl at the counter was friendly, and helped me right away. Even though crowded, they didn't take a whole long time to make the food. \nFor those really on the run, they have pre made sushi out in the front counter. \n\nTokyo Express made me forget I was eating at the mall food court. Average food, even a little above average for some place like this to be in the mall.", "author": "Catherine O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-28", "description": "The people here are nice but the food sucks. I got a chicken don, and the chicken was burnt and the daigon was pale white instead of yellow and it looked hella dry. Makes me wonder how long it was out for. The food isn't authentic Japanese. Just my 5 cents. Go eat somewhere else.", "author": "J H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "LOVE this place! If you are looking for sushi I definitely recommend this place! My favorite is the fried shrimp tempura! delicious!", "author": "Makana Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-20", "description": "The Yelp rating for 5 stars translates to: \"Woohoo! As good as it gets!\"  And yes, this place is as good Japanese food as you can get in a mall food court.  \n\nYesterday we passed by looking for dinner and we lusted after the spider roll.  Then my bf was like, \"Can we get a fresh one? Not one that's been sitting at the counter?\"  And they were like, \"Sure, no problem.\"  Good customer service? Check!\n\nLots of food for little money, you definitely get more bang for your buck.  So next time you go to Stonestown, got hungry and want something good aside from Sorabol, try Tokyo Express!", "author": "Yohanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "Uh, yes.  This place is IN Stonestown.  Uh, yes.  This counts as mall food.  But oh yes, this place has 50% off rolls after 8:30pm.\n\nWe normally wouldn't divulge a secret like this on the internet, but what are the chances that people will google a mall restaurant?  \n\nThe quality is what you would expect at an average sushi bar.  The rice is not too vinegar-y and the fish is semi-fresh.  The patrons are typically shoppers that had enough of dried pizza at Sbarro and artery-clogging corn dogs from the HDOAS.  \n\nSo, here's the scenario.  It's the Holiday shopping season.  The mall is open late and you just spent $100 and the last four hours buying random presents that will suit white elephant parties and grateful cousins.  Well, save yourself some money by grabbing half-price sushi off the counter of Tokyo Express.  If you dine in, they even give you soup and salad.  Don't forget to tip!  You have to keep this special going!", "author": "Kel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "Wow!!!  What good Japanese food!!!  In a mall???  No, seriously, they are awesome!!!  What a deal too.  You can get a Bento box for like $10-11.  In sit down restaurants, you could easily pay $15-17 for the same stuff.  I've eaten and lots of places and this place tops my list for good food.  Sushi is good too!!!  Next time your at Stonestown, pick up some food at Tokyo Express.  I even order take out on days I'm craving Japanese food.  The Udon noodles are good too!!!  \n\nTip:  I've been there when the mall is almost closing and they have a 50% discount on their counter sushi.  It's a bargain!!!  Don't have the exact time they do it so it would be helpful if someone out there knew.  I would say approximately 15 minutes before the mall closes???", "author": "Kaitlyn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "i like them if you like a lot of japanese food if youre like a up and coming university undergraduate and you can get decent to at least great mall experience foodz theyre nice and friendly staff and i had to wait for again a lil while cus everytime its a hot day i automatically go to stonestown like a android or something but you can get a meal for like less than ten bucks and it comes with everything the japanese experience gets like miso soup and rice and the random side dish so it was cool and i dont think anyone checks them out enough cus i go there all the time and only recently got into it hehe i like the basil chicken i ordered a basil chicken meal for like nine something and i tipped and it tasted fantastic i liked everything good experience satisfied", "author": "John V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-20", "description": "The vegetable Oodon is good but the salad is not tossed how can I eat it if its not tossed. The miso is good but some of there sushi here is tasteless IE: my raw salmon was tasteless. I would only come back here for Oodon not anything else.", "author": "Aurelio L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-17", "description": "Sushi here seems airtight, pre-made. Decent taste, but the prices are higher than your typical food court meal.\n\nSolid 3 stars for being good overall but nothing spectacular here.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-20", "description": "Not bad. Working in the mall means the horrible *shudder* mall food. But this place isn't bad. I've tried the beef donburi and also the salmon teriyaki. I really want to try the sushi though. Pretty decent Japanese food, considering it's mall food. The prices aren't bad either.\n\n*Update*\nI've tried the sushi, and it's very good. If the mall is about to close, they discount all the sushi...dirt cheap like 50% off. Good stuff. I like the tempura and CA roll with real crabmeat.", "author": "Alison N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "This is a pretty good place to grab a bite in the mall. The portions are generous and the service personnel is highly efficient and friendly. I really enjoy the dishes with chicken and salmon. Oh, and their California Rolls are delicious!", "author": "Chelsea J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-11", "description": "For mall sushi, it's fine.  The miso soup is meh, the fish good.  There isn't much else to say except I'm still irritated about having to get second lunch because my SF Soup Co soup was foul.\n\nBut thanks for being there tokyo express, you curbed my hunger if not my irritation.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "I was craving sushi and this was the closest place I can find at the last minute. Haven't been here before so I thought why not? When I got there, the menu looked pretty decent. Plenty of pictures with description on the bottom. Then I saw the stack of prepackaged sushi on the front counter, sitting at room temperature. From all my sushi experiences, I've learned that raw fish must be handled with extra care. Any change in temperature renders the fish inedible because bacteria will start to grow. But the sushi combo b was really tempting me. At $11 with 12 pieces, that will fill me up without ripping a hole in my wallet. Plus I saw people in the back constantly rolling sushi so I thought \"ok if I order they'll probably make my sushi fresh right?\" Wrong. The guy that took my order went to the stack of boxes and just grabbed the box with the \"sushi combo b\" labeled. And now, after eating the room temperature sushi, I hope I won't get food poisoning. Three stars because the salad that came with the meal was yummy and the California roll was decent. The guy behind the counter was friendly.", "author": "Sandy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-01", "description": "Who knew mall food can be so good?\n\nWhen I went to SFSU, I would just eat here about bi-weekly.  Their bento boxes come with entree, miso soup, and salad.  The miso soup is pretty flavorful, of course there's MSG but it's not like salty soup that some cheap Japanese restaurants make.  The salad has some awesome dressing, makes me want to order another salad sometimes.\n\nI haven't been there for about half a year until tonight. I walked by and saw some 50% off counter sushi sign. I grabbing two boxes of 12 California Roll for $5.  What a bomb ass dinner - full and satisfied without feeling fat.\n\nThey also had some tofu sushi for 50% too. There were probably some other counter sushi on there but people probably already got them.  I was there at the last minute - 8:59pm right before they were closing.\n\nIf you're at Stonestown, give this place a try next time.  It's not going to be the best Japanese food you tasted, but for their prices, the quality is pretty good.", "author": "Joanna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "I'm actually surprised that I never yelped about this place even though I've been here quite often with my friend in between classes.\n\nIt's mall food, but it's probably the best mall food in Stonestown.  They usually have daily specials and pretty much every time I've been there they've had the free sample of the tempura California roll.\n\nOther than that, prices are decent and food pretty decent.  Not as good as actual Japanese restaurants but still pretty good considering that it's in a mall.  Their Salmon teriyaki and donburi is pretty decent.\n\nI guess since I'm limited by options around the SFSU area when I go to class, this place can fill me up for lunch until late night for dinner (darn late classes).", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "This is a Japanese place in the food court of Stonestown. I wouldn't buy sushi from a mall, but plenty of others do here. The Tokyo Express is next door to the Panda Express (mall Chinese food). The line for Panda Express was mostly white, and the line for Tokyo Express was mostly Asian, so I decided to take a closer look.\n\nChicken teriyaki sounded good, so I ordered their chicken teriyaki bento. I guess I really just wanted a chicken teriyaki bowl, but for $5.99 you get a large order of chicken teriyaki, a mound of rice, miso soup, and a salad. For a buck more, you can supersize it with a tempura shrimp and some tempura veggies. This is totally the right call.\n\nI liked the teriyaki. The salad was a styrofoam cup of iceberg lettuce with some creamy italian dressing on it. No thanks. I'm not a big miso soup fan, so I don't feel qualified to review the soup. All in all, great value for the money. And in a food court, no less?", "author": "Timothy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-21", "description": "Im really picky with my sushi, I hate it when people convince me to go to their sushi place because its so cheap and good but they only really get California rolls. How lame.\n\nThis place rocks, awesome huge samples, quick to-go boxes for 'fast food' sushi fixes, and tons of different types of rolls you would never see at a mall, usually.\n\nI can't help but try something new each time I'm here. (maybe its the prices?) Usually at my fav sushi places i stick to my usual and get something different as a 2nd but here its almost always something new. They've got the normal american rolls like rock n' roll, golden gate,  catapillar, etc but they have some interesting ones too like devil roll (mango avocado?) Hopping Cali roll. \n\nTheir lemon basil chicken is really good too if you want something other than sushi, or even their chicken katsu /teriyaki if you prefer.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-02", "description": "I went here when I was craving Japanese food but was on a budget (a day in the life of a college student...) The specials are cheap, and most come with soup and salad. When I get the counter sushi, I get lucky and get there when they're making new and fresh batches =)", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-18", "description": "I was expecting more too. I came here because of the yelp reviews. The price is above average for the amount of food you'll get. Me and my GF got 4 rolls and some nigiris. It tasted bland. Should of went to a real restaurant.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-27", "description": "When my friend told me this place had decent sushi I was understandably skeptical. Since I don't eat seafood I wasn't afraid to try it out. I was pretty impressed by the variety of non-seafood offerings. The 4 stars are for price, variety and freshness/inventiveness. Although it's in a mall, it's still better than an icky place I had in Japantown and healthier than most of the stuff in this food court.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-04", "description": "Since SFSU doesn't have a sushi place on campus I haul my butt to the mall to get a chance to satisfy my cravings. I love the free samples of sushi and I stop by even if I'm not eating there! :) \n\nI usually order their chicken teriyaki combo..comes with chicken, rice, soup, and salad for like $6-7.  Skip the tempura- I once ordered it and it was soggy, and the miso soup is just \"ok\".\n\nAnd if you aren't stuffed after all that there's always MRS. FIELDS!! :)", "author": "Valerie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "Now normally I would not even consider buying Japanese food from the food court of the mall. However, Tokyo Express caught my eye and managed to lure me in to give it a try. They have a wide variety of things to eat on the menu whether it be sushi rolls, to donburi's to bento box style rice plates. I have tried most of these items and I must say they have failed to disappoint me yet. I usually get the tonkatsu which comes with miso soup and salad. They definitely have a knack for frying things as their tempura is delicious as well.\n\nOver all Tokyo Express is not meant to be the best Japanese food ever but it does live to its name. Express. Good quality Japanese goodies when you are on the go.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "I'm so not a fan of mall food, but this place is actually pretty awesome.\n\nAte here yesterday. LOVE, how they give out whole pieces of fried sushi for samples. \n\nLemon Basil Chicken and their Hopping Cali Rolls are good.\n\nTheir spider- rolls are surprisingly adequate for their price. I like how they're pre-made, but not yucky. \n\nI actually go out of my way to eat here!", "author": "Alexander D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "Yeah! We came here so hungry, and when we saw that Olive Garden had a huge line at 8 p.m., we decided to come to the Stonestown Galleria Food Court and found this place. I was staring at the soba noodle display in the case when we noticed that there were packaged rolls for 50% off on the counter, since it was the end of the day. We got a shrimp tempura roll, sashimi rolls, and California rolls, plus two bottled drinks for $15.99. One of our rolls was a meal and came with a salad and a miso soup too! We got little plastic containers with ginger and wasabi, not the little tiny packages that barely have enough for the rolls. It was a lot of food we got for that money!", "author": "Sara W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-19", "description": "we decided to try the food here because the prices looked good and the display was really cute... seemed promising. but we've definitely had muchhhhh better Japanese food.\nThe udon and donburi were quite tasteless...\nAnd portions were pretty small too. I could hardly finish the food because it was so bland.\n\nUgh. We're definitely not coming back here again. there are plenty of other places in the mall we can go to.", "author": "Roland R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "My fav is Fried Sushi with Crab Meat aka Hoppin....!!!\nYou got to eat it while it's still nice and warm and crunchy....\nsometimes you get a 50cents coupon for future purchase...\nduring the day you get a free sample of the fried sushi,\ntoward end of day...sometimes they offer 50% off all ready made sushi...\nthe nice lady Yoon...she is really cool....check this place out...you will not be disappointed!!! =P", "author": "Laimei W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-25", "description": "Teriyaki is ok. I've gotten a couple of different rolls from here as well. First time I ordered the spicy tuna rolls with my salmon teriyaki. Sushi wasn't all that great (didn't taste fresh), but the salmon was pretty darn good.\n\nSecond time I tried the Golden Gate roll, and that too didn't taste all too fresh. Also, maybe it's just my lack of experience, but my sushi was on the warm/room-temp side. I'd feel better if it was chilled.", "author": "Britany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-11", "description": "They don't have okonomiyaki. I don't blame them though. Who does?!\n\nPros:\n- Miso soup\n- Sushi rolls\n- Seaweed\n- Fast service \n\nCons:\n- Rice is a bit hard\n- If you order too much, you won't finish it\n- I tried speaking japanese, they don't understand me\n- The mall is too noisy to enjoy good Japanese food\n\n3 stars for Tokyo Express.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-12", "description": "I'm actually experiencing some self loathing right now for not frequenting this place more when I lived nary a block away. But logistics aside, I have to say I'm quite fond of their rolls, for mall sushi. Sure they're not the biggest or grandest, but the prices are relatively affordable and the fish is fresh. Surprisingly, I actually crave their double salmon rolls since they put so much lemon on the fish, it actually cooks it. I think I might have been a citrus farmer in a past lifetime, so I'm all for excessive amounts of acid. I haven't tried their meals but upon observation, it seems the portions are big and consist of what you'd expect from general Japanese fare. Overall, the food isn't anything to write home about but is pleasantly surprising for what you'd find in a mall. \n\nMark one star off for service. There's this one worker bee that's pretty rude but the beauty of mall food is the speed, so no one has to contend on being waited on for long before you get your food and are back terrorizing the sale rack at Gap.", "author": "Kat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-22", "description": "worst sushi ever, rice is so sticky and cold, fish not fresh, doesnt taste like fish ughh , wont recommend and i will never order from them", "author": "Rym R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "Nice staff members, quick and clean as well as the bargain of the counter sushi when there is too much sushi and not enough customers. 8 tiny CA rolls only cost me $2.74 for dinner!", "author": "R C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "The sashimi here is not bad in my opinion considering this is a mall food court setup, which means I don't need to tip.  The tempura is ok, could be better.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-11", "description": "This is probably the best mall food I've ever tasted - it's probably just OK by Japanese restaurant standards but after a day of dealing with crowds of shoppers, aggressive sales staff and bargain hunting - it's great to get some tasty treats and just sit down to rest a bit and feed", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-09", "description": "Ugh. Worst sushi I have ever had. Sure, they're cheap, but it tastes even cheaper. I couldn't believe how turned off I was by their rolls. I ordered the Philadelphia Roll and the Rock N Roll and they were both terrible. Not only was the flavor uninteresting and monotonous, but the texture of the rolls were non-existant. Complete mush, any toothless wonder could have swallowed them whole. This was the first time ever I've actually thrown sushi away. I spent $11 on both and threw away half of it just because I couldn't bring myself to eat anymore of it. I am totally confused as to why this place has 4 stars. Maybe everything else is decent? Their sushi is a nightmare, I'll will not be giving Tokyo Express another try.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "Because this is \"mall food\" as others have referred to, it never occurred to me to yelp this place, but after seeing \"people love us on yelp\" displayed on their desk, I agreed! I mean, this isn't comparable to places like Chin's Sushi or Mikuni's as those are upper echelon restaurants, but this place definitely surpasses mall standards! And for the price I'm paying, I don't expect too much out of the food, but boy, the food ain't bad! The tuna and rice is so fresh, and they are consistent. From my experience, getting cheap spicy tuna rolls isn't even worth if but Tokyo Express proves me wrong.", "author": "Monica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-22", "description": "Awesome spicy tuna roll and tuna sashimi... the way the cut the tuna sashimi- you can peel off little chunks off the grain, and it was tasty tasty.", "author": "Roni L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-26", "description": "Surprise!  Decent hamachi sashimi and very good miso, seaweed soup..yum rice...bad salad..who knew?", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "They have free sushi samples here once in a while! I like ordering the double salmon roll. It's basically a 49er roll (salmon + lemon slices). The quality is surprisingly good for the restaurant being in a food court. If I am hungry (which is often) and at Stonestown (which is not very often) then I pick up a roll here.", "author": "O K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-23", "description": "Good deal for Bento boxes and make sure to order tempura if you like it. For an on the good sushi, it's alright. My friend used to work here and so he seemed pretty chilled there so I was guessing that the boss is laid back. This is where I run to where I want some quick sushi.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-21", "description": "The sushi is A-OK...nothing special. Pretty decent for mall sushi.\n\nHowever, I just love the fact that all the sushi rolls are 50% off after 8pm on weeknights! Mind you, the prices here are already cheap as is. You also get complimentary salad and miso soup (which my daughter loooves) with your order. I come here from time to time after a long day of studying when I'm too tired to cook. Stonestown is only a couple blocks away from my SF home. \n\nIt's really a deal for what you're getting!", "author": "Angie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-04", "description": "it's a great deal.\neverything is delicious. \nI go here at least once a month.\nthey are nice and consistent.\nseating can sometimes be a problem, it's not their fault.\nit's the shit, go.\nEXPRESSSSSSSS.", "author": "Dadasd d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "here's another rave review for food court fare!  (i'm not a mall rat...really, i'm not)  \n\nfunny enough, i used to hit up the tokyo express in fidi (on sacramento) quite a bit back in the day, for the lunchtime beef teriyaki/tempura bento combo.  don't know why i stopped, perhaps because i 1. discovered closer japanese joints; and 2. reduced my intake of beef teriyaki at lunch (food comas are not conducive to being productive at work!)\n\nanyway, one day when the line @ panda next door was a bit too long for my impatient and ravenous self, i glanced next door and discovered the japanese place was now a tokyo express - a familiar name!  i then spied free samples - HELLO!  one bite of the deep fried sushi roll (i forget what it's called, it's a special not on the regular menu - flying something or other?  it's like a deep fried california or unatemp roll) and i was hooked.  extensive list of creative (or some might purists might say bastardized sacrilege) sushi rolls, pretty quick service.  tempura don is pretty tasty too; not greasy or overly battered tempura, just perfectly crisp and satisfying.  nice to know i now have a choice of panda, sorabol or tokyo @ stonestown!", "author": "Jen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "I usually don't go for mall food, but this place is awesome! The prices are cheap and the food is good. I've gotten the tempura udon and the donburi, and they both were pretty good. I can't wait to come back soon.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "pretty good  ... spider, calfornia rolls and  the hopper  is hella good... your safe with anything you order.... pretty cheap too 8 pieces for like 5 bucks\ngood eats!", "author": "raji b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "When I'd visit my sister at work when she worked at the Macy's at this mall, we'd go to eat sushi here on her lunch breaks. For mall food, the food is really good and cheap! Yay for cheap tasties! They've got pre-made rolls and rolls you can order to be made. Make it a combo to get miso soup and salad and you got a very filling meal.", "author": "Susan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-11", "description": "Personally, I love Tokyo Express, especially tuesday special: your choice of donburi, salad soup and sushi for $10.  Also love love the hopping california roll.  Food  is good and so is the price.  It is not somewhere I will go out of my way for but if I am at Stonestown, it is the best one in the food court.", "author": "Eva E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "4 stars for the hopping california rolls. i dont really like their other stuff actually, so i will only eat the hopping california rolls (deep fried california rolls) when i am there. careful when u eat them, sometimes they are really hot inside when the outside shell cools enough to eat it. i like the mix of sweet and spiciness.\nand i also like that i can replace the miso soup with another salad if i order the tonkatsu.\nservice is aight. its pretty inconsistent and sometimes u will get a nice greeting and other times u wonder wtf?", "author": "Bee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "You know, I think the customer service here has improved over the years by a lot. The food's alright. I just love their shogun sushi roll :)", "author": "M J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "I only review mall food it's good, and Tokyo Express is. I'm still surprised at how much I enjoy the food. I always order the Salmon Teriyaki with Srimp & Vegetable Tempura (which comes with Miso Soup and Salad) and a Green Tea Mango Snapple :) I love the deep-fried spicy tuna rolls they give out as a sample. The other sushi options are great as well. Compared to everything else they have at Stonestown, this place kicks ass.", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "I don't eat sushi, but last time I was in stonestown I stopped by and decided to try their vegetable tempura and it was delicious!  I got the meal that came with rice, salad and soup and it was all under $10.  I really enjoyed the mix of sweet potato, zucchini, broccoli and carrots.  Surprisingly, my favorite was the sweet potato.  Not too fond of miso soup but other than that, I loved it. Friendly people, too!", "author": "OLGA M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-05", "description": "i love japanese food.. and this is the only place that has japanese food in Stonestown Galleria.. food are good. sushi is pre packaged and tastes good and fresh. Love their combo plate which has soup and salad and rice with ur choice of meat..", "author": "Lily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-16", "description": "their UDON is sooooooo good! all of them!!\ntheir free miso soup is also good!\nFree water!\nFree side sald!\nany of their items with teriyaki sauce on it is a must!\ni like the caterpillar roll the best!\nSpider roll delicious!\n\nMHHM MHMM MHHHHHHHHHMMMMMMMM!!! =D", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-23", "description": "Crab shell in your sushi is not the best thing in the whole entire world", "author": "daniel a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "I love this place so much! My favorite dish is the Udon. Sometimes I get chicken udon , sometimes beef and sometimes tempura. It is the best best place to eat at this mall. Forget about Sorabol, Tokyo Express has better chicken teriyaki and the portion is far more generous too!", "author": "Millie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "No point in going over the same comments of past reviewers until you're done beating a dead horse. This place is my favorite food place at this mall.  The sushi rolls are good and better than the Japanese place it replaced.  They have a counter full of various sushi packaged to go and you get a cup of tea with it.  And if it's one of the specials, it comes with a sm. salad (peppery dressy) and miso soup (not fantastic but good).  Haven't tried the regular entrees but since I only go for their sushi, it doesn't matter.   Have to say the sushi here is even better than some of the ones found at Japanese restaurants in the neighborhood for a reasonable price.  I didn't like their spicy tuna roll and the special of the day, Tempura Donburi was interesting.  It was a big bowl of rice, topped with seaweed, picked daikon, boiled broccoli and a fried egg and then 2 pieces each fried shrimp, carrots, yam and broccoli.  It was rather oily.  Meh.  Stick with the sushi next time.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-26", "description": "if you are a SFSU student, dont have a car and u are pretty much sick and tired of the choices on campus, you have no choice but to hit Stonestown. So, I have pretty much tasted ALL in there, yes I am a professional student , and have been here long enough to have done that. Well, Tokyo Sushi was not on my shit list until yesterday. Before yesterday, I would occasionally enjoy their fried chicken thingy (i think its called lemon chicken) and the occasional pre-packaged warm sushi, but yesterday OMG, me and my gay had the spicy tuna roll. Needless to say that me and my friend looked as if we had just finished our fluffer shift down in the Valley. OK, so you say \"well that is not the restaurant's fault, you guys had allergies or something\" well, you have a point, but it turns out that we are NOT allergic to shellfish or any type of fish people!!!! we are puzzled.....well,  ok, other than that, i am not too excited about their hygiene in there, their sushi is WARM and that sashimi has been sitting there, under those hypnotic mall lights for who knows how long (TIP:  after 8:30 pm you can go in there and buy \"old\" sushi for half the price).  Anyway, food is what u expect from a mall, just  DONOT eat the sushi!! raw food and mall just dont go together. Also, are those Mexicans in the kitchen? hey! oye, lavate las manos cochinos! casi nos matan a mi y a mi amigo!", "author": "Terry R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-28", "description": "The meal is a great value when you are in a rush.  I especially like the Chicken Don.  Always satisfied when I order this. The meal comes with a salad and soup.  The sushi could be better buts it's fresh and hey it's a takeout so I don't expect too much.", "author": "A N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-25", "description": "a-ok 3 stars for mall sushi.  expand that category to all sushi, and it's an eekmeh 1.5 stars.", "author": "Reina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-13", "description": "place is not that bad.  came here with a friend after class.  its kinda pricey, maybe cause im a broke student. not the best place for japanese food, but one of the better places to eat at in the mall, and cause they got a cute girl working there..heh", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "i love their hopping california roll!!! definately try it, and this place has come a long way from when they first opened. their prices aren't too bad either. hopping californai roll--'nuff said!", "author": "P M."}
