{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-05", "description": "The food: I really enjoyed the ramen here! I got the spicy miso pork belly ramen. I've never had ramen with spinach in it, and I think it was a great combination. I was very impressed with the egg, and I only wish there was both halves of it! It was just seasoned very well. Additionally, we shared some soup dumplings, which were good but not amazing. The portions were pretty large overall. \n\nThe service: The staff was friendly, but not anything memorable. Tip was included in our bill for our party of six. I think the only thing I didn't really like was the fact that they could not split the bill, but I think that's just a San Francisco thing. \n\nOverall: I would definitely come back here some time. It was very good, though it did not blow me away.", "author": "Daniel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "I was tired from a long work day and really wanted dim sum as I was in SF for only a few more days. This hit the spot, especially for a delivery type place. \n\nI ordered the steamed buns with BBQ pork and dim sum. I don't recall what exactly. It was late! The dim sum was perfectly cooked, juicy, and delicious. The buns were really satisfying and also perfectly cooked. I was not super thrilled with the barbecued pork filling, but it was still pretty tasty. \n\nThe delivery was fast and easy and I was able to do everything through the Yelp app. It was exactly what I needed on a late night. I would certainly do it again", "author": "Adam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Would have given them 5 stars but my chicken Kara-age wasn't completely cook. Some of them show uncooked texture in the chicken.\n\nLove my ramen noodle. Great taste and so are the other appetizers.\n\nAtmosphere was great and our server was on top to make sure our table weren't clutter. That to me is a plus when dinning out.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "After when I was done with my hair cut!!! I wanted to try a different place to eat lunch at the San Francisco Chinatown area!!! And it didn't take me that long to find a new location to eat at!!!\n\nThere was a new place for me that, I didn't know about... I came across to Toppu Ramen & Dim Sum House which was nearby where I go for my hair cut!!! As I walk in for my very 1st time as I was greeted by the host... When I looked at the menu, there was something that caught my eye... This was my very 1st time for me that... I saw that this Toppu Ramen & Dim Sum House had this Japanese Style Chicken Fried Rice on the menu... \n\nAs soon as I saw that, I ordered the Japanese Style Chicken Fried Chicken right away!!! When the server brought the Japanese Style Chicken Fried Rice to my table where I was seating came out nice and hot!!! When I started munching on it all I can say is that MMMMMMMMMMMM it tasted sooooooooooooooo good!!! \n\nI definitely do wanna come back and try eating another item from the Toppu Ramen & Dim Sum House Menu!!! If there are any tourist visiting out of the USA or coming from another US State go to the Toppu Ramen & Dim Sum House it's a great place to eat lunch or dinner!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-28", "description": "Walking the streets of San Francisco with a passion for ramen, I stumbled on Toppu Ramen & Dim Sum House on a Sunday afternoon.\n\nStaff were friendly and really fast at both taking my order and delivering my meal.  I ordered their Tonkotsu Ramen ($12.95) which came with sliced pork as well as pork belly, bamboo, spinach, green onion and a half boiled egg.  So what did I think?\n\nIn terms of customer service, staff didn't disappoint.  Friendly, checking on me, and making my experience a great one.  The food?  Welllllll.....\n\nIf i'm being honest, I thought the ramen was pretty bland.  It likely starts with the broth, which after slurping for a bit seemed like it was lacking in the salt and flavors i'm used to.  The actual ingredients were nothing special and the quantity could have been a bit more for the price.\n\nLocated right at the corner of Kearny Street and Columbus ave, it was easy to see this place with the large \"soft opening\" banner on its store front.  I walked so I can't really speak on the parking situation, though there wasn't a lot that I saw.\n\nWould I go back to Toppu Ramen when i'm back in San Francisco?  If I lived here, maybe i'd give them a second chance, but chances are when i'm back in my ramen mode in the city, i'll be shopping elsewhere.", "author": "Jamarcus T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-01", "description": "Toppu Ramen is a new restaurant in the financial district. I was really craving ramen and this place stood out to me (maybe it was the big grand opening sign ). I was extremely excited to try it, but was very displeased by all of the food.\n\nWe'll start with the ramen. The noodles were literally the same noodles as top ramen. I won't get into why that bothered my so much, but I didn't like them one bit. The broth was decent, but mostly tasteless, as were the rest of the ingredients in the ramen. It was disgusting, it was just bland. The fact that I was craving ramen, and was starving, should've made that dish taste amazing, but it just wasn't there.\n\nWe got a few appetizers too. Sweet potato fries, short ribs and pork belly sticky buns. I wouldn't say I would order any of those items again, especially the sticky buns. It didn't help that all of their meat was about 90% fat, 10% meat.\n\nThe environment was fine. Our server was nice. But what was really interesting to me was that tip was included on our check. Which is normal for nicer restaurants, but this was an extremely casual place. It didn't bother us too much, but I just thought it was interesting.\n\nSafe to say I likely won't come back here. It wasn't terrible, just not very good.", "author": "Sheila G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "It was kind of difficult trying to decide on how to rate this place. \n\nI thought the dim sum was pretty average. Then again, I ordered a Steamed Vegetarian Bun ($5.98). This bun had a strong shitake mushroom flavor and was mostly plain. If you are not into shitake mushrooms, beware of the vegetarian buns! The portion size was kind of small. Each bun was approximately $2. \n\nI also ordered Fried Turnip Cake with House Sauce ($7.98) and somehow ended up with Fried Turnip Cake with no House Sauce ($7.98). The turnip cake was good. It reminded me of a mixture of tofu and french fries. It came out really hot (temperature wise). I would probably not get it again though because it was really expensive. \n\nMy boyfriend ordered the Spicy Miso Pork Belly Ramen ($14.98) and loved it because the pork was so fatty he thought he was gaining a lot of weight... which he liked. I wanted to deduct a star from this place for potentially giving him a high cholesterol, :P. \n\nHe wants to come back for sure. If I come back, I'll have to try something else.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "On my adventure to SF we decided to hit this place up.\n\nIt was slow on a Sunday 5pm.\n\nI got the tonkotsu ramen, California roll, gyoza and pork buns. I really wanted to try their dim sum but maybe next time.\n\nThe tonkotsu ramen was a big portion and filling but it was sweet to me. I like a salty broth that makes me drink too much water LOL the egg was cooked perfectly and the meat was a big portion 3.5/5\n\nPork & Veggie Gyoza so delicious to eat with ramen! 5/5\n\nCalifornia roll was good with spicy mayo. I asked for no cucumber which it had no cucumber but it came with no avocado which was really weird. 4/5\n\nI wasn't a huge fan of their pork buns but I'm going to say because I was very full and I don't like pork too much so my reasoning is invalid LOL\n\nSERVICE was good. They accommodated all of my confusing requests. My friends really enjoyed their ramen.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "This place is a scam, first and foremost the workers are running around understaffed looking like they know what they're doing, but in reality they were getting everyone's orders confused since they think it's a good idea to just take orders without writing it down at all. They also took forever to realize that they didn't give us any waters or drinks to start until I asked. The menu they had carried a huge variety with pictures, but this is where the scam comes in bc many of their pictures did not match the food when it came\nout in person. There was a problem with ordering our food as well where they ordered another order of steamed buns for our table, when we informed the lady(owner most likely), she flipped out and told us we couldn't return it bc \"they made it already\". We were shocked at this rude behavior bc we didn't even order it for one nor did we even touch the food, so she has no way to tell us we couldn't cancel it. The food also started to come out half an hour later while the people next to us who came later than us already gotten their food. Well yea, if you are scrolling through yelp thinking this place looks good, it's not good and it's a scam.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-26", "description": "Do not come here, it's seriously a rip off. \nEmployees:\nVery nice and fairly quick\n\nPrice unagi-12$ 1/5\nThis place gives you 4 little dinky unagis for a whopping 12 dollars, which is totally not worth for the price\n\nAgedashi tofu: 10$ 2/5\nThey give you only 4 pieces of tofu... that isn't even fried enough no saucy enough..\n\nNever coming back here ever again, such a rip off\n\nJust tried everything, it was dishgusting. I ended up just throwing everything away cause it was so hard to eat.", "author": "Elsa W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "Very clean restaurant and friendly service but the food needs some work. My sister, her boyfriend, and I came upon this place because we were looking for asian food in Chinatown but didn't want anything too oily. It was around 3pm so many place were pretty much closed but we discovered this place on Yelp as a new business so we thought we would give it a try. I ordered the Tonkotsu Ramen, my sister ordered the Seafood Ramen, and her boyfriend ordered the Beef and Rice plate. My sister also ordered a side of turnip cake.\n\nThe Tonkotsu ramen was a little overpriced (~$14) for the quality of the ramen. Broth had nothing too special about it and the ingredients were not as generous. My sister through the seafood ramen was bit better though because it did have the seafood taste in the broth. So I'd say for the ramen, it would be a 3.5/5 stars. \n\nThe beef and rice was the biggest mistake of this order. I tried a little bit of my sister's boyfriend's beef and rice plate and the beef was just not quality meat at all. Extremely difficult to chew and swallow and the cuts of beef were not thin enough to taste the quality and tenderness of the beef. Now, this can probably because of many reasons.. the type of cow they buy, the age of the meet, and how they cook it. By far the biggest disappointment. My sister's boyfriend just ate the vegetables and had to pass on the rice and the beef. He even had to spit a piece out on a napkin because it was so difficult to swallow. However, the waitress was very nice about this and decided to now charge us for the dish since we didn't eat it. \n\nOn a more positive note, the turnip cakes were SO DELICIOUS. Very nicely prepared and perfectly fried to have a perfect crisp where it wasn't overwhelming at all. I couldn't even take a picture of it when it first came out because once I ate one, I couldn't stop eating them. \n\nI would definitely come back for the turnip cakes but not for anything else we tried that day. I would highly recommend the restaurant to perfect on just ramen and dim sum (as it states as their restaurant name) rather than add other dishes like the beef and rice.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-11", "description": "Came here during lunch and this place was empty at noon. Because it's a new place, I gave it a pass that it's not filled with people. Glancing at the menu, it looked decent but the prices are pretty up there. Ramen is like $13, fried rice $13-14, and dim sum is a little more pricey than the Chinatown shops 2 blocks up. \n\nMy friends had ramen and I had a Unagi Fried Rice $14. It was a pretty big portion. I liked the unagi flavors, made pretty well. I had a taste of the Tonkotsu Ramen and I felt that it lacked pork bone flavor. It was very mild tasting. We got a small order of chicken wings. The wings were pretty good. Very saucy just the way I like it and meat wasn't dry. We also got some egg rolls and they were fried crispy and tasty. We also ordered a dim sum platter for $12 or $14. You get to choose 4 items from #2-8 and you get 2 of each. We had 2 XLBs, 1 shrimp dumpling, and 1 siu mai. Honestly, the dim sum was just average. For that price, I expected a little better quality.\n\nAll in all, this place has potential but I feel that it's a little bit pricier for my taste.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Delicious food (had the spicy pork ramen) and nice atmosphere. Clean, friendly, and fast service. Nice place, I'll be back for some more ramen next trip!", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "Food:  I had the dumpling platter with shrimp, pork, and soup dumplings in the mix and every single one was absolutely savory.  Nothing was overcooked, and the dumplings themselves weren't small either, so it was worth the price tag.  My friend ordered their ramen and had no complaints about it.  He wolfed that down quite quickly so it's safe to assume he enjoyed it a lot.\n\nService: pretty friendly service and efficient.  My food came out in a little over 10min and b/c it was so yummy, I can't complain about much else.\n\nAtmosphere: SPACIOUS and C L E A N!!! As it should be from any eatery.  Well-lit too, as you can see from then photo.", "author": "Savannah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Felt like this place was 3.5 stars, but I rounded it up because the waitress was nice and she was genuine in making this restaurant better. \n\nI ordered the tonkotsu ramen and thought it was kind of expensive for what it was ($13 before tip). Although the bowl was big, I didn't think there was enough noodles. I enjoyed the noodles and thought the texture was good. However, the pork that I received was cut pretty thick and made the meat tough. I thought the soft boiled egg was interesting and tasted like a tea egg.\n\nI saw previous reviews and noticed many people dissing the broth. But, I thought the broth tasted OK. Perhaps the restaurant upgraded it since their last reviews & when I came by?\n\nI came during the soft opening on a weekday at around 9pm. It was completely empty and it felt kind of weird being the only ones inside. Given the restaurants nearby, the prices for the ramen & dim sum would be better if it was lower.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "The pork buns, egg rolls, and the bacon wrapped mushrooms were all delicious! The food and service were impressive! I would totally come back and highly recommend! Our dog sat outside and was not bothered by the employee mopping the floors at all that a previous yelper mentioned. Please try this place out if you're in town!", "author": "Amber a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-17", "description": "This was the worst ramen that I've had in San Francisco by far and maybe the world.  Nothing about the ramen was good.  The broth was weak and tasteless, the noodles seemed like they came from top ramen and the meat seemed like they came from a Chinese restaurant rather than a ramen restaruant.\n\nThe ramen was also $14 so I was hoping for something special or at least comparable to what you can get in the area.  Would just go to Kan Ramen, Slurp Ramen or Ramen Underground which are much better and pretty close.  This place serves ramen and dim sum so I guess that makes sense.  It's a soft opening and I wish these guys have more luck than the Indian place used to be in this place.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-01", "description": "The food is fantastic and fresh. I ordered 3 times from here. I put in very large CAPS on my  sticky rice order No Shrimp Highly allergic, it will kill me. They do not read the notes because the 2nd and 3rd time my sticky rice orders had shrimp. The 2nd time I had to take some benadryl to stop the anaphylactic reaction. The 3rd time I ordered was tonight and I checked the sticky rice to be safe. Unfortunately there was shrimp it it. I called the restaurant and the lady on the phone insisted there was none. I told her I have photos of it. Grub hub refunded my order this time. I won't be ordering from then again, not worth a hospital visit.", "author": "Monica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-24", "description": "Food: 1/5\nSpace: 3/5\nService: n/a\n\nI ordered a hamburger curry rice and it was honestly really, really bad. It both looked and tasted like a frozen hamburger patty that was warmed up in a microwave. Sort of like what you might find in a middle school cafeteria. No flavor, no seasoning, no texture. Without a doubt this was the worst rendition of hamburg I've ever consumed. This was a takeout order at 9:30pm so I'm really hoping this was just some sort of sick joke where they straight up robbed me of $15 for ordering food 30min before the restaurant closed. Will not be coming back here.", "author": "Derrick F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-26", "description": "This review is a little overdue since I visited during the soft opening several months back.\nI came in during lunchtime and ordered the Tonokotsu Ramen. I noticed it was a little bit pricey, so I assumed it must be good! Unfortunately, it didn't meet my standards. The only thing that was right was the egg (soft boiled). The soup was very bland, noodles were average, chashu was super mushy fatty. Considering the price, this is one of the least impressive ramen bowls I have probably had.\nThe service here was fine, but that may be because there were only 3 customers in the restaurant including myself.\nI won't be going back for ramen, as Kan Ramen up the hill is so much better.\nI'm honestly a little afraid to try the dim sum, but maybe I'll roll through one of these days.\nAs I pass by all the time, it always seems to be empty. I would suggest they bring down the prices for lunch just to attract more customers. They're at the border of Chinatown and North Beach where most patrons can get a full hearty meal for around $10, and need to be more price competitive.\nI may have not realized it back then, but I noticed that in pictures from other customers that the suggested tip amounts are stacked on top of tax.....that's just not right. Make sure to do your own math before you tip a percentage, or just tip whatever is respectable.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "Very good! Went here for lunch. I had the spicy pork belly ramen  Which was sooo good! A little concentrated but I added some water and it was perfect Also had takoyaki, and dim sum platter mix. Very good as well! Service was awesome; they were very attentive. Overall awesome experience", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "The dumplings are 4 mini pieces and the muscles are 6 pieces the food is good the only thing I have an issue with is that the app will say that your food is going to be delivered early but the actual delivery time is 40 minutes to an hour. I check on the GPS and by car they are only 12 minutes away but the delivery didn't come until 40 minutes after my order was placed. So just don't expect the delivery to come until after 30 minutes or so. But hey at least the food was warm and not cold when it came. Anyways I will be ordering from here again the food is pretty good.", "author": "Gloria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "This place was very nice and accommodating! \n\nThey had plenty of seating at about 6:30 pm, so we didn't have to worry about not getting in or having to wait to be seated. There were two waiters on staff, and both made sure we were well taken care of. \n\nWe ordered the San Francisco Ramen, since it seemed to be special for the area. It didn't quite look like the picture when it arrived, but it still retained all the components. It was pretty good, but I think I discovered I prefer imitation crab in smaller pieces, ie in sushi. They didn't offer us any forks (we being white people), which was kind of nice of them not to assume we didn't know how to use chopsticks (even though my mother didn't really lol). We also ordered jasmine tea, and they gave us each our own tea pot with pretty nicely sized cup to drink out of. One of the waiters kept coming over to make sure our tea was filled, and then turned the tea pots (I think some sort of system for him to remember how much was left in them). He even placed my water bottle in between to make the table symmetrical! \n\nThey were very kind as we left as well, both saying goodbye. Over all, a pleasant experience and if I come back to San Francisco I'll be sure to go back and try more of their menu.", "author": "Anna W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "We went there Friday night at 7pm because we were heading somewhere else after and were the only ones there. The menu was a little all over the place. We had the dim sum special, and all the dishes were bland. We also ordered the Japanese wings, which we had to send back because they were cold on the inside. The replacement wings were an improvement, but still room temperature on the inside. They were also doused in the sauce, and it wasn't that good.\n\nThe wait staff was good, but it might be because no one else was there. Hopefully things improve since it was the soft opening, but we won't go back.", "author": "Thu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Delicious food and fast service. Excellent! Very friendly and helpful waitress. Great selection of menu.", "author": "Kent P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Delicious! My fiance and I were visiting SF for a few days. On our first visit to Toppu was on a late morning. They had a huge \"Grand Opening\" banner and gave it a shot. It made a great first impression! It was clean, we were warmly received by our friendly server, and its atmosphere was welcoming and chill. Music was nice too! We had some dim sum which we thought was a good and even ordered some to-go.\n\nA couple of days later, I caught a cold and needed something hot and comforting -- soup. I wanted ramen, so we went over to Toppu again. Again, we were warmly welcomed by our server. She remembered us and had a short, nice conversation with her. She really made us feel at home. :) I ordered the tonkotsu and absolutely loved it. The broth was hot and rich, the noodles had the perfect al dente chew, the egg was heavenly, and the meats and veggies were tender and flavorful. \n\nI'm definitely going to miss this place! My hometown really needs a Toppu!", "author": "Cyril R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "New ramen dim sum place on the edge of Chinatown. Hesitant to try at first since it was ramen + dim sum but hey new place might as well give it a chance.\n\nIs it amazing? No. But is it terrible? No. It's an ok place and depending what you get makes a difference.\n\nWe ordered the Unagi Fried Rice, Tonkotsu Miso Ramen (even though my friend ordered Tonkotsu Ramen since she doesn't like miso), and Deep Fried Calamari. I enjoyed my Unagi Fried Rice; it was tasty and the portion could feed 2-3 people. Only wished the Unagi pieces were in larger chunks rather than broken up. The Deep Fried Calamari was the best as the batter was seasoned well and not soggy like many recent places I went to. My friend did not enjoy her ramen. \n\nService was good, but the interior leaves a lot to desire as there are no decorations. Hope they can get some stuff to personalize it.", "author": "Jodi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-24", "description": "Food and service wasn't all that.  The wait staff never came back to refill our water or give us more napkins.\n\nWon't be going back.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "First time coming here, got a beef steam bun and takoyaki and I love it, recommend for anymore around here to try out this spot", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Delish!   Excellent for vegetarian and vegans, as there are several non- meat options on the menu.  After a long day site seeing and walking 5+ miles we worked up an appetite and  ordered the vegetable miso ramen, vegetable goyza, and vegetable bun.  All of it was fresh and delicious.  My wife had never had dim sum before and like the bun so much she ordered a second order.  \n\nThe restaurant was immaculate and comfortable.  The staff was friendly, knowledgeable, and attentive.  Only downfall is it stays in San Fran and I can't take it home with me.  \n\nKeep an eye out for Francis Ford Coppola.  He owns the building across the street and we ran into him on the sidewalk.  Nice guy.", "author": "Peggy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "We stayed at the Hilton just down the street from Toppu Ramen & Dim Sum House. The food was absolutely delicious, and I was able to order through DoorDash and pick up with ease! They even took care to verify my identity on pickup. We enjoyed shrimp dim sum, as well as a noodle dish -- a perfect way to finish our little vacation in San Francisco before heading back to Sacramento. We will most-definitely be back!", "author": "Cole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Great service and good dim sum and ramen. The staff made great recommendations for dim sum. My friends slurped the ramen while also enjoying hot tea.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-10", "description": "New store around where I live but I am not impressed.\nSeems like they are a ramen house but they also want to sell Chinese food.\nTBH, I am disappointed. \nI ordered fried Udon w beef, it does taste pretty ok, but portion wise, it is way too small.\nI can barely find beef slices on the plate and I paid $13 for that.(tips not included). 2 stars for the services, but sadly I don't want to come back again for the ramen, cuz the review tells me everything.\nI hope they can focus on what they are trying to sell and hopefully they have a better recipe in the future.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "WAY OVERPRICE! RIDICULOUS. I really doubt why they have 4stars on yelp?! With the same price, you can find a very nice bowl of ramen in Japantown. \n\nPortion is too small. Soup base is too salty. Topping is not generous. After we ordered the ramen, they asked if my friend and I want it spicy. We said yes but when we look at the bill in the end, they charged each person $1 for the spicy. WTF?! We are never informed that adding spicy is extra $1. Why wouldn't the waiter make it clear? They are so tricky.\n\nThis is not a place for local. I feel like they are that kind of restaurant who try to fool tourist.", "author": "Rita L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "The ramen here is amazing. I tried the one with pork and the vegetarian one and you won't be disappointed. My friend just told me she doesn't want to brush her teeth to keep the flavor of the soup. Also, I highly recommend the steamed vegetable bun.", "author": "Pablo C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-03", "description": "Got Miso Ramen R2. Food is not as good as Ramen Underground. 3 stars for lack luster food.\n\n4 stars for setting in that Toppu does give better service and provide more space than Ramen Underground. It does not feel cramped here, and the staff are more polite. \n\nThey also accept credit cards, where Ramen U. Does not.\n\nYou will pay less and get more portion at Ramen Underground.\n\nYou will feel more respected and more comfortable at Toppu. \n\nNow if only they could just combine the best of both and leave out the worst. That would be a 5 star restaurant in my book ;-)", "author": "Richard L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "So I was driving by and I see a good dog sitting waiting for their owner to finish eating when a worker starts cleaning the outside with a mop and starts pushing the dog (who was laying down being a good dog) away from the door. The dog wasn't doing anything other than just laying on the floor not even touching the restaurant. I was about to take a video, but the light changed.", "author": "Ashley X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-21", "description": "All I can say is that the Dim Sum should be removed from the menu, especially considering the fact that this place is blocks away from many authentic options. Everything I had tasted like it was purchased from wholesale then steamed on site. \n\nSoup Dumplings - Soupless\nChicken wings - 73.5% batter (why though???)\nDumplings taste stale\nGyoza was decent - yayyy?\n\nMaybe they should stick to Japanese and leave that Chinese food to the rest of Chinatown?", "author": "Nic B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "A mixture of Japanese and Chinese styles and flavors in this informal restaurant.  We tried fried udon, ramen, gyoza and enoki mushrooms wrapped in bacon.  Everything tasted great.  Service is prompt and friendly.  A winner for sure.", "author": "Ollie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Didn't try the ramen but had the dim sum platter and pork belly buns as an appetizer. Very good.  Very filling.  Would eat again.", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "Came here for lunch on a Saturday. Very good ramen. Noodles al dente perfect. Tonkotsu broth very good. Super clean place. Nice touches like cast iron teapot. Staff real friendly. I'll be back.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "This place is the real deal! The food is amazing!! We tried a wide variety of things from their menu. Some being beef and chicken ramen bowl, California roll, pork dumplings, and taro buns. All was delicious and came out quite quickly. Nicely priced for the size you are given.", "author": "Addie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "I am a ramen person and I went there purely for their ramen. I was excited to try their ramen based on the overall great reviews from other Yelpers. I normally eat one and half ramen and one order of the portion of their ramen was totally over my expectation. But what impressed me more was the quality of the broth. The broth is rich and load with a lot of flavors. I will definitely come back and enjoy their ramen in the foreseeable future!", "author": "Terry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Didn't dislike a single thing we ordered. San Francisco Ramen, Soup dumplings, chicken udon; all delicious!", "author": "Lars R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "Spare yourself the food poisoning and go somewhere else. \n\nWe sat down and ordered some dim sum, ramen, and chicken teriyaki. Right after ordering, my friend ran up to the server and asked to cancel her two shrimp dumpling orders because she wanted to order vegetarian steamed buns instead. They told her that they could not cancel the order because they had already started cooking it. We had literally just put in the order but she gave up on arguing. Soon after they brought out the shrimp dumpling orders first and we bit into them only to find that the shrimp was ice cold. They were still frozen. We sent them back. Next my spicy miso ramen came out, also rather fast, with half a soft boiled egg on top. I was super excited to start eating so I dunked the egg in the broth, picked up the egg with my chop sticks, and bit into it. ICE COLD. Somehow they had frozen a soft boiled egg earlier and then defrosted it? Disgusting. Never seen something like this before. Toward the end of the meal they brought out two more, this time cooked, orders of shrimp dumplings. You know, the orders we never wanted in the first place that they knew we didn't want and that they had messed up the first time. Sure this time they were cooked but the shrimp was slimey and my friend ate one dumpling and did not touch the rest. \n\nYes we were charged for all of it. Yes we all felt sick after. Yes they just wanted our money for awful, unsafe food. This place has some seriously questionable kitchen practices and their food does not taste good. Stay away.", "author": "Mitra Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Everything we had was great. I love eel and ordered that with some rice and it was perfect. The service was great very nice and helpful. The chicken wings were also great with the sauce they use. My girlfriend also got a few different dumplings that we both enjoyed.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Love the place. Clean and cozy. It may sound weird but Ramen and dim sum are good combination.  The Japanese style rou jia mo is so good.", "author": "Q C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Very well lit, clean, with great waitresses and an awesome menu. If you are not decided between Chinese, Korean or Japanese cuisine, don't frown, they have a bit of everything here.", "author": "Jose E. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "Everybody working (7PM on a Thursday) was friendly and welcoming (which honestly, makes a much bigger difference than anything else). I would have kept walking, but the front host was super warm and invited me to sit and read the menu. From him, I found out this place has been open for just two months. His English wasn't great (or maybe he was shy)--but his genuine attitude made up for the lack of communication. \n\nI ordered the dim sum platter takeout--pork dumpling, shrimp dumpling, xiao long bao, and taro bun. I probably would have paid less if I had gone to a smaller dim sum bakery, but this hit the spot regardless. Satisfied all my sweet, savory, juicy, and chewy cravings at once.\n\nFour stars, because I believe there is room for improvement. Hope to come back and try their ramen.", "author": "Angel V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "Decent taste for this price range. I was looking for dumplings with a tasty broth, and I found this place.  I haven't tried their Japanese or Korean fusion food but the Chinese here is great. The taste is better than Chongqingxiaomian", "author": "Yumi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Yummmmm !!!!!! We ordered miso soup, ramen, Korean short ribs with our favorite sake, prices were reasonable and Service was super attentive and friendly；this place is amazing and definitely worth to come back, thumbs up !!!!", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "My group of 8 friends came and had a great time at the soft opening of Toppu. The owner was extremely kind and was able to warmly accommodate us when one of us didn't have an egg in our ramen. She even gave us lots of complimentary dessert (ice cream puffs), which was awesome :)\n\nWe all ordered ramen, which was very yummy and had good portions. The chashu pork was tender and the broth was quite tasty. The ramen was a little on the expensive side though ($14). \n\nWe also got some dim sum for the table (chashaobao, steamed pork bun and sesame ball) which was nice.\n\nOverall a tasty cute new place in Chinatown with good ramen and small dim sum bites to share for the table.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "Worst Ramen I've had, ever.  The Vegetarian Miso broth tasted almost completely metallic, I had to add soy sauce and chili peppers to get it to taste like anything other than metal. Even then, the broth was undrinkable.  The spinach, bamboo and mushrooms had flavor, as did the noodles, but the broth also made them metallic.  The green tea was so weak it also couldn't defend itself from whatever transition metal ions were floating around.\n\nNo idea if the dim sum is any good, nor will I be finding out.", "author": "Troy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "We stopped by Toppu Ramen and it's one of the best ramens we've had. The appetizers were incredible. I highly recommend this place. I'll be back again soon.", "author": "BN T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "This ramen and dim sum place has a lot to chose from. We tried multiple things and they were really good. I wound recommend dim sum and seafood ramen. If you really like spicy then spicy pork ramen is for you.", "author": "Morgen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "It's always scary when your 3 friends make up 75% of the guests at a restaurant, as was the case when we went on a Thursday night. But don't let the emptiness scare you away! Highlights were the chicken wings and basically free beer. I enjoyed the slimy seafood udon noodles, as well, and while I don't totally believe them, half the people at the restaurant went crazy for the tonkotsu. Fast and cheap, why not give this new joint some love in the form of yelp traction...", "author": "Pedro K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "Taste is okay, service is okay, the price consider expensive. The waitress and chef they are Chinese not Japanese. I'm about satisfied about the service. But what I don't expect, they charge tips in advance about 20% from the total amount of your bill without our permission. Before you sign the bill, there is a column for additional tips as well. Please be aware with your bill before you sign it! There was another guest have a same problem with me as well. Hope this reviews help everyone.", "author": "Zedong M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Toppu is under new ownership, give them a try!! Great food, very attentive staff! Pictured is the Dim Sum lunch, we also had the Curry Chicken & Ramen, all delicious. I have to say I think my favorite was the Curry Chicken, I was able to enjoy the curry spice while it was not overly hot to where I could not eat and it would tear up my stomach. YUM!", "author": "Sherri B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "Just tired this place with hesitation due to the fact it's always empty. Friendly staff and good service but food is just blah. Ramen doesn't have a ton of flavor, added black garlic oil to mine and it had a bitter flavor could only eat half a bowl before calling it quits. Chicken karage was more like chicken nuggets with mayo sauce nothing very special. One app two beers and a cold sake with two ramens totals out at $62.  Much better options around the block for half the price.", "author": "Casey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Came during their soft opening with family and Toppu didn't disappoint! I got the miso tonkotsu ramen and it was full of flavor. Also, the Toppu picnic ice cream was a great way to end dinner! Definitely coming back soon", "author": "Mei Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "It was one of those days where ramen was needed for my family and I. We yelped for a ramen place near by my mom's work. We came across soft opening Toppu Ramen and Dim Sum. We order agadadshi tofu (can't spell). I was very tasty. Ha cow (shrimp dumplings) the skin was beyond soft, but that's how I like it.,side order of Kim chi. A chicken teriyaki rice plate. Three ramens. They made a small mistake on one of our ramen, but they kindly made us a brand new order and allow us to keep the old one without charge. The portions were big enough. I was able to have left over lunch the next day.", "author": "Nga C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "The owner was so nice and the staff was very attentive.  Very good miso ramen!  I added tofu and it was delicious !  I'll be back !", "author": "Donna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Such a cool little place to serve two of my favorite foods together: Ramen and Dim Sum! We celebrated the Miss Asian Global luncheon here after a Chinatown festival. The staff was super attentive and the food was tasty. The place is clean and the prices are very reasonable. I would definitely stop by here for a yummy bite to eat the next time I am in Chinatown!", "author": "Tony F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "This is my first review on Yelp, this is a fairly good restaurants, nice service and the food is good, teriyaki chicken and seafood udon noodles which is delicious. I particularly like the teapot they use, very nice, authentic Japanese iron teapot, very delicate. The overall dinning environment is clean and peace. Definitely recommend this place for trying out some Japanese food and Guangdong dim sum.", "author": "Zhenyu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "This is a very good ramen restaurant! Everyone should go there and try it!  Our group of friends went there after touring Chinatown. Vicky was very friendly and helped us in selection. I really enjoyed the pot stickers.", "author": "May W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "The food was great, but even better our service was amazing. They were prompt with the food and great customer service. I didn't get to try their ramen but I've heard that's what they are known for. Their dim sum and appetizer were greats especially with drinks. Will becoming back soon.", "author": "Zasha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Had the Japanese Curry and Sushi roll. It was tasty and hit the spot right where I needed it to", "author": "Andersen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Great new place discovered. I love the Korean soft tofu soup there and have ordered twice. Not expensive and good portion. We also had beef curry rice and a starter and a dessert. All decent and plus the server is super nice! Highly recommended.", "author": "Ai Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Had friends visiting from Colorado for just one day. I wanted to take them to eat all my favorite SF foods. Japanese curry, Ramen, Dim Sum , Dumplings. Luckily I found this place! They do all of the above at level that is above average. Clean and new inside, fast service and tasty food. check it out!!", "author": "Loren O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-20", "description": "Don't eat here!\n\nThey are really cheap about ingredients.   We got so little stuff in our Ramen.  My husband had the pork Ramen.\nThere was so tiny and so few.   And very pricy too.  $14.00 for a vegetarian ramen.   Very very thin tofu and spinach that was not coy up.   It was just so below expectation.", "author": "Doris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "The food here is quite delicious, and it offers different variety of choices in both Japanese and Chinese food. Very clean and comfortable environment. What I like most is the warm staff here. They kept asking me if the rice I ordered was enough because they thought maybe I needed more rice to get full and if so, they could offer me more rice for free. Generally, I had a very pleasant experience in this restaurant.", "author": "Shengkai W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "I always order the Kimchi Soft Tofu soup which is never spicy enough but is always a nice treat. I haven't ventured into their dim sum or ramen but I will definitely give it a try soon.\n\nThe staff is amazing and always really nice and welcoming. They really make the experience. Love these ladies.", "author": "Jocelyn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "Not the Dim Sum experience you want coming to San Francisco for authentic Chinatown food. I was in a rush and did not read the reviews or notice how many reviews.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "I would give this restaurant 20 stars if I could. I was on a mission to find great Ramen and Dim Sum when I got to San Francisco and boy did I find it!!! This was hands down the BEST ramen I have ever had. I ordered the pork belly ramen. The broth was so rich and had a creaminess, the noodles had a good chew and the pork was delicious. The dim sum and pork buns were absolutely amazing, too. The people that worked here were so nice and friendly. Just thinking about their food makes my mouth water. I will definitely go here again when I visit San Francisco. A must do if you like ramen!!!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Really good food :) \nI got miso soup, vegetable dumplings, and egg custard dumplings. I really like their take on the vegetable dumplings. Definitely a place I'll come to when I'm in the city again.", "author": "Ernes R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "Came in here because of the 4 stars -- fully disappointed. The ramen was way too salty, nothing special about it. The dim sum was also disappointing. The sauces were no good. Sorry, but this made my mom never want to eat ramen again.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Was in the mood for some ramen when I came across this new cozy place that just opened about \n3 days ago!  I had a bowl of their \"Pork Pot Belly\nRamen\" and it was absolutely delicious! The noodles were succulent not flat. Their roasted pig bone soup base for the ramen was out of this world! They even have Dim Sum and I just had to have that too! Plus I had an order of their chicken wings & some other appetizer goodies. All in all the food was delicious throughout. Will come back and try their seafood ramen and other goodies!!", "author": "Tom W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "It become my favorite place to eat ，The Food is good，staff are really friendly here。highly recommend the seafood Ramen！", "author": "Max G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-17", "description": "The portions were decent, the restaurant was clean and the service was friendly, but everything was a dollar or two overpriced, and the food was ok, but  a bit subpar.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "4 of us went here during a soft opening and really enjoyed the ramen.  The dim sum is good not great.  But the ramen was delicious.  I would definitely go back to this joint.   Not super traditional if your wondering.  But very tasty.", "author": "Jeremy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "This place is so yummy !! A great selection of different foods from a diverse range of ramen choices, to dim sum (pork buns!), family-style dishes, and more - they have it all! And all equally tasty! Will definitely be coming back here. Great service and lots of smiles :) a feel-good place to eat!", "author": "Avery P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "Great stuff here! Staff is very friendly at this location:D!", "author": "Hesti Cabinet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Loved the food. Great price for even greater food. 10/10 would recommend again. Especially the fried rice bowl.", "author": "Asher K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "I visited this restaurant during its soft opening, and I found the staff to be quite lovely and welcoming. The ambiance of the restaurant is nice and cozy which made for a great dinner to wind down to on a Sunday evening after work. My friend and I had the Vegetable dumplings, Miso soup, Kimchi soft Tofu soup and finished off with Egg custard buns. All the food was delicious -- the egg custard buns were slightly sweet and reminded me of my mom's cooking; the Kimchi soup was slightly spicy and thankfully we had some chili sauce to add to it which took it through the roof for me.\n\nI will be visiting again!", "author": "Ethan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "I went here with three other coworkers for lunch. We saw the soft opening banner and decided to give it a try. This place right now has so much options on the menu. I think they are trying to figure out which items would be successful. I ordered Kimchi Soft Tofu Soup (Kimchi SoonDooboo). The entree came in a ramen bowl, however the taste was beyond my expectation. The taste was in between soft tofu soup and the Kimchi Stew (Kimchi Jjigae), however I thought it was very delicious and spicy. Only wish I had about the entree was that I wish it had more soft tofu in the soup. I hope that this entree stays on the master menu. My coworkers ordered Seafood Sauteed Udong, Beef Sauteed Udong, and Chicken entree. The Seafood Udong dish was really delicious and I hope they keep it on their master menu. All of my coworkers enjoyed their meals and we would like to go there again.", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-14", "description": "The ramen is really bad. The menu says it comes with pork belly and chashu, but in reality it comes with a very tough chashu and a really fatty chashu. The noodles are mostly giant undercooked clumps. The broth has no flavor. My buddy was given a skunky Sapporo which expired two months ago. My other buddy ordered vegetation ramen which was just as undercooked.", "author": "Thomas H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-19", "description": "I was walking by and noticed the restaurant was doing a soft opening so I decided to check it out. The tonkotsu ramen needs major improvement. While the presentation of the bowl looked pleasing, I was bummed to discover the broth had no flavor. Bland and definitely little to no seasoning. I only finished the bowl because I was starving. Compared to cup noodles, I think the cup noodles definitely win. \n\nAdditionally, the menu is quite lengthy with too many selections. It makes looking at the choices a bit cluttered.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "The staff is friendly and the restaurant is newly renovated and clean! I visited during lunch and ordered the seafood ramen. The broth is flavorful and the noodles were al dente. Overall, it was a great experience and would come again!", "author": "Angelina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Everything here was amazing. I had the steamed pork belly buns and they were so good, I ordered a second helping! Then I had the vegetable soy sauce ramen and it was also excellent. The restaurant is clean and crisp and looks well maintained. The service was also very good. I will return on my next visit to San Fran.", "author": "Meaghan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "The hand-made noodle is amazing, was incredible with the ramen soup. The dim sums were incredible and it's served all day, fresh.", "author": "ROBERT L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-29", "description": "Service was attentive. Place is clean. Food is mediocre. This is really an in-betweener. A wide selection of dishes: Chinese, Korean, Japanese, etc comes at the expense of so-so dishes. First time visit, and my last.", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Super Great place  to go for Dim Sum!!! Looked all over China town for both vegetarian and meat eating options and this place has it! Good prices and great quality service, super friendly environment", "author": "Adriana A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "Waitress seemed constantly irritated with us and food was okay, not great. Chicken curry was delicious, but miso ramen wasn't very flavourful.", "author": "Zainab Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "We just finished a paint night in the neighborhood, and didn't find many restaurants open past 9pm. Luckily, we were able to stop by and get some dinner here. The food turned out really well, and the staff was very kind. I got the grilled eel and hambuger curry, and my girlfriend got the Tonkotsu.", "author": "Patrick I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Incredible food!! The ramen was smooth and delicious and the dim sum was great! The platter allows you to try four types - and they're all great", "author": "Joung K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-13", "description": "Yeah quite a huge let down on the dim sum front...service was mediocre though\n\nOtherwise, wouldn't recommend coming here unless you're in the neighbor and need something nearby", "author": "A D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "The food here was definitely delicious and appealing! The ramen was really soft and tastes really authentic. We got the rolls, and they were really huge, so it was worth it.", "author": "Ghee Ling L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-02", "description": "This was my least favorite meal we had in SF. The food was ok but overpriced for the portion size. The server was nice though.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Restaurant is quaint, clean and convenient location for me. Great selection of ramen, but I ordered the curry rice tongo. Quick and friendly service. Very delicious!! I'll be back again soon to try their ramen.", "author": "Rose C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "New, clean and the food is good. We had pork belly and bbq pork buns It's a couple of doors from the House of Nanking.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "I had high expectations for a restaurant that was in a soft opening. Now it's been like a month or two since soft opening and I'm still in soft open mode! We ordered some dim sum and the pork was definitely under cooked and my boyfriend got an upset stomach. I would not recommend it...", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Food is amazing! I ordered their fried rice with pork and it was delicious. Place is really well put together and super clean-will definitely come back!", "author": "Francheska M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "We saw this place and it's soft opening. We went to check it out. We ordered ramen and dim sum sampler. We also got fried tofu. The food is very good, and the sampler is awesome because you can choose any four dim sum into the sampler. That was actually very good. We surprised to find out they serve dim sum all day. Also, the ramen broth is good too. We definitely will come back", "author": "April T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "I have nothing but great things to say about this place. The service is excellent, the restaurant is super clean and everything we ordered was excellent. If you are looking to have some dim sum come here!", "author": "Ali J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "The dim sum was the best that I have ever tasted. The restaurant was super clean and service was excellent!! I will definitely be back.", "author": "Pam V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-15", "description": "My group and I had decent expectations. So we were excited. The portions are huge but wasn't good enough to finish or take home. Honestly the place being pretty empty should have been our first clue to leave. However it slowly started filling up. Food is under seasoned", "author": "Juju B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "Ramen was good. Appetizers were small and a bit pricey. Service was somewhat slow on a Monday when it wasn't no where near busy. Probably won't go again.", "author": "Maysee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "What a wonderful surprise to find this restaurant in my neighborhood. I have not been at any of the restaurants nearby as they looked like factories or really dumpy. This one took the place of an all you can eat Indian restaurant and now it looks clean and very welcoming. The food is great and although it takes a little time to get to your table it is delicious as cooked from scratch. To top it all Toppu Ramen serves all day and is open 7 days a week. A real find and I look forward to eating there often.", "author": "Madeleine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Cute little hole in the wall in the busy commercial district. We ordered a hamburger curry rice, Toppu roll, Dim Sum platter and the manager gave my girlfriend a special called \"Toppu Punic Ice Cream Sundae\" made her birthday fulfill a lot of fun and happiness!!!! Food were so delicious and all the staffs were supper friendly.  Definitely will come back.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "unagi fried rice and salmon teriyaki were super good! the service was friendly and i will definitely come here again and recommend it to people :)", "author": "Natalie L."}
