{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "My dad started coming here and picking up Torta's and other breakfast items. \n\nI will say the breakfast meals are good, maybe a little too spicy for some. Just be aware that some meals are spicy \n\nTHE TORTA'S though! You def need to try one. Seriously the best I've had in a very long time! \n\nI highly recommend this place for Torta's", "author": "Raul S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "Man has this place gone downhill since I was there last, 6 yrs ago. The service was T E R R I B L E. The torta was SUCH a waste of time and calories. I'm going to outline my thoughts on this place divided between service and food so if you don't care about one of those categories, you can read accordingly\n\nSERVICE:\n\nSome of the worst I've had. We were made to wait to order our food while the cashier ladled salsa into plastic cups and fastened them with lids. When she finally decided to come take the order of THE ONLY customers in the building, she was rude and seemed bothered by us. More on why that was in the food section. We sat down and another customer came in. He asked her what she recommended and she put a menu in front of him and walked away! After he ordered she said \"to go, right?\" and he responded \"um no I'll eat here\" and she basically rolled her eyes. About 5 mins later my dining companion received his tacos. 5 mins later the other customer received his torta. 15 minutes later, my companion was done eating his tacos even tho he was trying to eat at a snail's pace and I still had not received my food. He heard one of the cooks say in Spanish \"did this go out? The pierna torta?\" Because the cashier was so lame and unconcerned with her job, the cook's inquiry went unanswered, unbeknownst to us. About 15 mins later we were gathering our things to get up and demand a refund and leave, when the cashier all of the sudden ran to the back and came out with a torta bun in her dirty bare hands and handed it to the cooks. They had JUST begun making my food. We had been there almost an hour at this point- the other customer was long gone. We were the only people in the shop. No apology, no explanation, just a skimpy, crappy torta on a dirty bun finally tossed in front of me. And there's no way that was Pierna but I wasn't going to complain and wait longer and receive more attitude and potentially unsafe food. \n\nFOOD:\nHow on earth can you call your restaurant \"Tortas-[anything]\" when you have such a limited torta menu? The special of the day was Barbacoa tacos so my dining companion asked for a Barbacoa torta. The girl working at the register responded (her actual words) \"uhh barbacoa TORTA?! What do you mean barbacoa TORTA?!\" So he replied, \"a torta with barbacoa\". We were then told that was impossible, that they only make barbacoa tacos, so he asked if they could just use the meat from the tacos for a torta and she said absolutely not. So he ordered two tacos, which I knew meant he was annoyed because normally he would order like six tacos. I ordered a pierna torta. The barbacoa tacos came to the table and were excellent. The meat was tender, flavorful and juicy. The tortillas tasted homemade. There was one paper thin slice of avocado in each taco and a small sprinkling of onions. If this place had better service, they would be well worth the $3.50 per taco price tag, in spite of the skimpy accoutrements. The torta was terrible. They either made my order wrong or do not know how to make pierna but I didn't ask because I received my food 30 minutes after the other person in my party of two had finished his meal. The tortas are entirely bread. It's seriously 4 inches of bread with 1/8 inch of fillings. Each half of the torta had one paper thin slice of avocado, it was a total joke. The meat was terrible and appeared to just be deli sliced ham. There was nothing else distinguishable in the sandwich because everything was so skimpy. Maybe a teaspoon of beans spread over the bread? It was like they used an aerosol can to apply it. \n\nSo pick up barbacoa tacos to go but never come here for dine in and never get a torta. Eat the barbacoa at your own risk because they are not following food safety rules. But it might be worth it for the barbacoa because it is actually really good. \n\nI'll never be back.", "author": "Emma H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-01", "description": "I love their food all the time and the past times that I had come their cashier was so nice and friendly..\nToday there was a new girl and she was so rude I don't know if we're coming back since this experience was so bad! \nI got a flan and it tasted bad even the color was weird.. I told the cashier and she wanted to make me pay for it! I'm sorry but I can pay for something that's not good", "author": "Azucena M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "The tortas here are really good! Only thing I would suggest is for them to add more cream or mayo on both sides. \n\nI know they add beans, which is not something I really like in my tortas personally. Also if they can add lettuce and tomatoes ect. The lady said they didn't it to the tortas. \n\nBut so far for my 1st going there it was pretty good.  The tortas are pretty big so you will get full.", "author": "Margarita V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "I had a friend visiting from out of town who really likes tortas, so I yelped the closest torta spot to me and came across this place.\n\nWe arrived Saturday around 2 pm and the restaurant was half empty. We saw a lot of people come pick up orders, so it seems like takeout is popular here. My friend ordered one of their vegetarian tortas, while I went with #7 ham omelette with beans and potatoes ($9.75).\n\nIt took a while for our food to be ready, probably because of all the takeout orders. After waiting for close to 30 minutes, our food finally came out. I didn't realize the breakfast plates would come with tortillas, but I rolled with it and made breakfast tacos with omelette pieces topped with beans and potatoes. Yum! Unfortunately there was a lot of bell peppers added to the omelette which I ended up picking out, but I'm used to that as a pretty picky eater.\n\nMy least favorite part of the platter was the potatoes, which were extremely bland. My friend really enjoys potatoes, and even he agreed these weren't good. Disappointing since they looked quite spiced up and yummy.\n\nMy friend absolutely loved his torta and even said it's the best he's ever had, so I would definitely recommend getting that here.\n\nParking was a bit hard to find as it is all street parking. I had to circle around the block a second time before finding a spot.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-16", "description": "The tortas are amazing, but PLEASE do not ever order the burrito. Disgusting! I had to throw it away. Other than that the tortas are pretty good.", "author": "Fabian O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "We came in near closing time and they still managed to accommodate us. Food was good and also the customer service. Will be coming back again.", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "My boyfriend and I just moved in across the street from this place. He had never had a gotta before so we checked it out. I ordered the chicken torta and he ordered the Cubana. I think his brain might have exploded because he was absolutely in love.  Ow he eats there roughly once a week. \n\nThey have a killer salsa Verde make sure you get some if you're taking it to go. Everyone that works there is super nice. The restaurant is small so we usually just pick it up and go home since they can be crowded around dinner time on weeknights or lunch time on weekends. \n\nThe sandwiches are all about $10, but are DEFINITELY large enough to make two meals out of. The bread is fresh and soft, and they pack your sandwich full of veggies and meat. Definitely a yummy spot. Super casual, fairly inexpensive, and very convenient. Will definitely be back!", "author": "Taylor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "We were trying for a different place in this hood, and unfortunately it was closed for a private event, I Yelp and this was 300 feet away and 4.5 stars.\n\nIf you walked by this place you would never think it was that good. It is small and very old school (in a good way).\n\nThere are 4 ladies working - 3 in the kitchen (that you can partially see for the counter) and one lady who serves.\n\nBased on the reviews we ordered the milanese torta. (and a mushroom quesadilla). The rota was HUGE! I wish I had measured it - I would say it was about 10\" x 7\" x 4\".  It was pretty messy and there could have been more chicken, but overall quite tasty. The quesadilla was a on a freshly made flour tortilla that I would come back for. \n\nOn the way out we ordered a aqua fresca - today was pineapple. very tasty - and the medium was also very large.\n\n$20 for 2 people leaving stuffed!", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "I tawt I taw a bwig torta - I did, I did, I did taw a bwig torta!  So the story on Tortas Boos Voni is that it was called Tortas Bugs Bunny until they received a cease and desist letter from Warner Brothers. Is that really true?  I have no idea, but I do love the notion, almost as much as I enjoy the tortas. On my first visit I went for the torta de pierna (leg), number 2 on the Tortas menu. I had it loaded with everything, including mayo, tomato, onion, jalapeño, avocado, cheese and beans.  On my second visit I had the Torta de Milanesa de Pollo (#24), and it was just as good. Say, what's up, Doc?  Quite frankly everything on the menu looks fantastic.  The choice of tortas is vast but sorry, there's no conejo (rabbit).", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Best Tortas in town, absolutely better taste on the food, friendly staff, great customer service, affordable prices, the food is very delicious...! \nDefinitely coming back here for more. Loving it \nThe cooks are very clean & fast working & very good cookers", "author": "Karla P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-14", "description": "This place is small and cute. The cashier was nice. I ordered a champurrado because I was craving for some. It's difficult to find a place in the bay area that sells champurrado. Their champurrado was a little disappointing to me. It tastes more like atole or a drink version of tamale. There was no chocolate flavor in it. I guess I have to continue with my hunt in central mission.", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "The best torta I've had in the city, no contest. Practically in Daly City, it's pretty much a place I will go out of my way to visit, since I'm no longer in the neighborhood. They don't have many vegetarian options, and I doubt anything is vegan, but I'm willing to forgive them for accidentally putting a piece of salchicha in my torta de huevo because the rest of it (I ate around the sausage) was so good. It hits every spot the way no one else can. The bread is perfectly toasted to stay 80% soft, the mayo/cream combo reminds me of San Julian, and the queso is as fresco as possible. So simple, so good, and easy to mess up, make no this place a gem. I genuinely wish I could finish the entire thing in one sitting sometimes, but also glad I can't (because it lasts longer).\nFor an average price of $10 with tax per dish, this is not a bad way to go.", "author": "Astrid V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "So the excelsior district got some pleasantly filling eats, this spot is definite must come back to try everything else they serve on there menu, primarily sandwiches it looks like is offered but they do offer rice plates, tacos, and some other dishes, all looked really good\n\nI was able to sample #21 the cuban sandwich, 5 meats, diced avocados, jalapenos, eggs, lets just say it was a big sandwich, the bread was light, not dense, buttered, the meats from what I can taste were slice of ham, hotdogs, chorizo with egg, thin slice of bistek, I believe the last meat is pork sauteed in a red sauce. Meshed together you may not think it works but when it is piping hot and in your face, it is worth every bite, salty meshed with semi hard avocados, then the odd taste of sliced hotdogs with egg & chorizo mesh, followed by the jalapeno kicker with the white meat sauteed with that red sauce, oh man definitely not for the faint of heart.\n\nA must try in m books, I will be back for other dishes they offer, the sopes look good, the durango plate looks good, everything looked good.\n\nI also sampled a sliver of the hawaiian sandwich, which was meat and pineapples with the same roll of bread, allot lighter then the cubano sandwich, I would sample it again if I am less hungry.\n\nI was able to eat half the sandwich I figured I could save for dinner, half an hour later I ate the other half and now I am in a food coma, lets just say, the sandwiches are big, the taste is big, definitely spot you want to try if you feel like a filling sandwich\n\nfood *****\nprice $\nservice ***** very helpful, main waitress and cook speaks mainly spanish but also speaks english, all smiles from staff of what seems to be regulars in the restaurant\nambiance ***** clean, small, cheap eats, filing eats, definite must try", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "OMG! This place has the best Tortas in San Francisco. Reasonable prices, clean atmosphere and great service. I ordered steak Torta and ate half of it there and the other half for dinner. It was so satisfying, I'll definitely be returning here again and again.", "author": "Monica Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "First time here and it was delicious! Will definitely be back! it's really small but if you're willing to get something quick and delicious this is definitely a good spot !  The tortas are amazing!!", "author": "Maribel U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "LOVE THIS PLACE!! THE TORTAS ARE DELICIOUS ESPECIALLY THE MILANESA DE RES ( BREADED STEAK). The tortas are soo big and filling!! They always have fresh ingredients. And they heat up the bread of the torta so it melts in your mouth then you take a bit. I LOVE IT!!!! My husband loves the platillo de milanesa de res( breaded steak) that is serviced with rice and beans. They give you soo much food. The prices are great, affordable, and the food has a lot of quality and flavor!!!!!!! The staff is nice and welcoming. The cooks know what they are making because the food is Fabulous!!! The place is very clean to eat. DEFENETLLY A PLACE TO STOP BY AND EAT WHEN YOU VISIT SAN FRANCISCO, IT'S A MUST!!!!!!", "author": "Nallely P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "The food here is totally good.  Admittedly I feel embarrassed that I can eat a whole cubano torta though.", "author": "John S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-15", "description": "Been coming here for a few years now and lately they've been doing things wrong.... their tortas aren't as flavorful as they were before... new cook? ‍... and also they've been messing up my orders... last week I order tortas some rice and meat and an order of sopes... after getting home and my kids being super hungry I noticed that my order of sopes weren't there.... I was soo pissed off I couldn't call them, my husband did.... I couldn't drive back right away so the fact that I had to get out my way to get some food I paid for and they forgot to give me it's not tolerable... I won't be coming back here anytime soon....I would drive to sf and get some tortas from Los Picudos", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Wether you are in the neighborhood or not I would recommend coming to Tortas Boos Voni to try the Torta Cubana.. One word describes this Torta and that's DELICIOUS! I definitely will be coming here more often. I would recommend calling your order in prior, lunch time seems to get busy. Great customer service and more importantly great tasting tortas.", "author": "Ernesto C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "i LOVE this place, their tortas are the best I have ever had! The carne asada is my favorite, it's about $10.00 but the tortas are very big. I highly recommend this place!", "author": "Courtney A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "Very very good lolz they hook me up all the time don't need to tell them what I want anymore", "author": "Rene Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "I am a huge foodie and let me tell you this place does not disappoint ! Best tortas in the city hands down. For sure one of the last hidden gems in the city. I always love supporting my local businesses and this place is bomb. The tortas are what I come here for and of course their salsa verde which I could literally put on anything. The girls are super sweet and I come here pretty much weekly! Def recommend this spot!", "author": "Jeanette O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Great tortas at this place! The quality and quantity you get for the price is amazing and staff was very nice. Definitely a place to eat when you are in that area of San Fran! Big recommendtions!", "author": "Petar D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "I highly recommend the Milanesa de pollo torta (breaded chicken sandwich).", "author": "Gabriel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I have to say that my first time trying the Tortas cubanas were delicious and super big! Definitely going back", "author": "Crystal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Awesome tortas! I always get the number 24 and it never disappoints. The serving sizes are massive and the staff are so welcoming every time I go in.", "author": "Ronak P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "Tonight i took my family for a dinner and when we was eating a couple come inside to eat and they brought them dog with them and sit him on a chair by the counter... Some of the dog's hair fly to our table and when my wife look at the dog the owner asked her \"what you looking at\"\nI think this restaurant shouldn't allow pets inside, I don't mean if they eat on home with the dog siiting on them table or they eat on the dog's plate but this guys should respect others!!", "author": "Adan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "Great tortas and they're huge.  Can easily share one or save half for later.\n\nMilanesa de Res - the breaded steak tasted great. Wonderful flavor and good heat. But there was a major miss... they loaded up on the toppings but not much steak.  The jalapeño to bread ratio was good (joking)... but it really needed more steak considering the size of the sandwich.\n\nCubana - I usually skip Cubana tortas.  They can be gimmicky, messy, and usually a gut bomb. Boos Vooni's... wow... this is a sandwich...  Totally loaded up on everything and somehow I was able to function after eating this monstrosity.\n\nWe'll definitely be back.", "author": "Zoran L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Best tortas I had outside Mexico, try torta de pierna or Milanesa, awesome", "author": "Odin Yamill A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Amazing authentic Mexican food. I live almost two hours away and I don't mind stopping here when I visit the bay for some delicious food. Yes the place is very small but we can always wait to get a table. The torras, huaraches, tacos etc.... oh and their flavor waters are the best. Best horchata", "author": "Amy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Such amazing Tortas loved them. Splitting one is more than enough but if you're feeling up to it go for the whole thing - you won't be disappointed.", "author": "Jaclyn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-24", "description": "Small torts spot on Mission St. that you could easily miss while driving.  My husband and I were walking along trying to find something to eat for lunch and stumbled upon this place.  I had a chicken torta while my husband got an egg torta.  Ok one of the best tortas I had was in Alexandria, VA (no joke) so I compare all tortas to the one in VA.  My chicken was HUGE.  It was all bread with a chicken breast flattened and fried.  It was ok, a little dry.  It could use more sauce, more flavors and It was a pricey - $12.  Maybe I chose the wrong thing but even my husband was not impressed with his sandwich either.  Service was not that friendly.  I may return and it order something else.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-21", "description": "I don't get why people love this place. Could be my fault since I got take away and didn't get a chance to eat it until it was cold. Came here for an early lunch and ordered a few sandwiches ($9.50 each for the Milanesa de Pollo and Carne Asada) to take away to eat with friends. There was only one other table at the restaurant. The sandwiches still took a while. 15-20 minutes? Then like I said when I got back with them things were going on and we didn't get a chance to eat them until they were cold. The milanesa de pollo was flattened breaded fried chicken. The sandwiches looked big but it was a lot of bread so not as filling as it appeared. I guess my main complaint was that the sandwich was very dry. I dumped a small container of salsa on each half - which helped- but it was still dry. \n\nLike I said, it could be my fault because I didn't eat them when hot but it wasn't nearly as good as the other tortas like Torta Gorda.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "Hola Muchachos! I ran out of Lucky Charms so I went through the 'hood looking for something else magically delicious. I was lucky enough to stumble into Tortas Boos Voni after a long day of drinking and playing some good ol beach volleyball. \n\nCOMIDA: Milanesa de Pollo was probably one of my favorite tortas in a while. The sandwich was beautifully assembled with lettuce, onions, jalapeños, etc. and topped with the coveted Milanesa de Pollo. The Cubana, although good, was not my favorite. I think it was because the shredded meat was a little dry. I'm going to order it with extra hot sauce next time and hope it becomes a game changer. Both tortas were around ~$10.\n\nDRANKS: Unlike many, many, many of my other reviews, I'm NOT talking about booze! In fact, I'm going to rave about the Melon Agua Fresca was sooooooooooooo refreshing! Perfectly sweet and very satisfying, especially after a long day in the sun. A large was about $4.\n\nSERVICE: I love the abuela who took my order because she pretty much told me what was bomb and delivered! Friendly yet no nonsense. \n\nOther thoughts- The area is horrible for parking. I ain't about that life. They accept credit cards!! Cash free? That's me!", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-23", "description": "Here's the lyrics so you guys can sing along with me: http://www.youtube.com/watch?v=lQX9XTUbvNE&feature=youtube_gdata_player\n\nI've been looking under rocks and breaking locks\nJust tryna find ya\nI've been like a manic insomniaaa-aac\n5 steps behind ya\nTell them other tortas, they can hit the exit\nCheck please...\nCause I finally found the torta of...my dreams\nMuch more than a Michelin award\nThat's how much you mean to me\n\nYou could be my it torta\nBaby you're the shhh torta\nLovin' you could be a crime\nCrazy how we fit \nThis is it torta\nGive me pollo for life\nI just wanna eat all lunch long\nAnd put you in the middle of my spotlight\nYou could be my it torta\nYou're my biggest hit Boos Voni\n\nLet me play it loud\nLet me play it loud like...oh oh oh oh\nLet me play it loud\nLet me play it loud like...oh oh oh oh\nLet me play it loud\n\nAfter the closure of my favorite torta spot on Folsom Street a couple years ago.  I've been in search of a go-to torta place ever since.  I think I finally have found it.\n\nA old friend of mine told me about Boos Voni.  I thought he kept saying Bugs Bunny.  But no, it's Boos Voni.  Located right off of Geneva and Mission, next to Bank of America.  \n\nWalking in Boos Voni, it reminded me of an old diner with about four booths and a bunch of stools in front at the counter.  Quite an extensive list of tortas to choose from, about 30 tortas total.  Along with a few breakfast items and other options but it's obvious this is a torta spot.  \n\nMany people rave about Torta Cubanas because of its sheer size and combination of ingredients.  Too me the many flavors get lost in the mix and leave me feeling full, guilty, sleepy, and farting mess.  Much better to me are the simple tortas like Milanesa de Pollo.  So that's what I ordered:\n\nMilanesa de Pollo:  it's breaded and fried chicken breast.  Along with everything which includes lettuce, tomato, onions, mayo, queso fresco, and jalapeños.  Not to be overlooked is the fresh salsa verde they serve at Boos Voni, it's delicious.  \n\nThese torta sandwiches sell from $6.50 to $9.00 depending on which one ordered.  I have a big appetite and even I would have preferred to share my torta.  But I was all by myself so I had no choice but to gorge.  Don't judge me!  \n\nAfter a long search, I think Boos Voni's torta is IT.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "Delicious torts but more impressive was everything else. The sopes are the bomb, hand made made and crispy just how they should be", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "A top 10 sandwich list brought me to Tortas Boos Voni the first time and I was just blown away.  Their sandwiches are beyond epic, both in size and flavor.\n\nThe Cubano with 5 meats is a must-try and should be on everyone's sandwich bucket list.  I could do without the hot dog chunks (kind of ew) but everything else (bacon, fried eggs, steak, spicy pork, ham, shredded chicken, plus pickled jalapeno, mayonnaise, avocado, and refried beans) works unbelievably well together, it's a feast for the senses with every bite.  Their bread is exceptional and really solidifies the flavor of the sandwich.  \n\nIf the Cubano is not your speed, try the Pollo Milanese which is just as excellent in my opinion and perhaps less intimidating!", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "This place has great service and a very welcoming atmosphere. It's a small establishment, but those are my favorites because you know the food will be fresh. On that note, I ordered a torta carne asada and it was very good. Probably one of the largest tortas I've had. I'll definitely be back to this restaurant!", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Really enjoy all of the sandwiches I've had here as well as the pepino (cucumber) sweet drink.  I usually go for the Milanesa de Res (breaded steak) or de Pollo (chicken version) but I've had a few of the others.  Wife thinks they are a little bland because of the thick bread, beans, cottage cheese (queso) and thin meats but I can really taste the sauce and jalapeno which makes my mouth water thinking of it.  \n\nOnly one negative is that the other patrons kind of give me the stink eye when I come in but I still come back for the great food.", "author": "Desmo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Love the Torta Cubana! It always taste delicious! One of the best in San Francisco for sure.", "author": "Luis P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "Jamon (ham) torta = full of win.  I ate half of it for lunch...and the other half, I'll have to eat later.  You might want to split a sandwich if you're not a big eater.... lol   And I'll to try dining there some time.... can't wait!  I've had little dinner roll tortas.... not so here, so much bigger  AND better actually!  \n\nPrices = reasonable\n\nService = friendly\n\nPlastic or cash, yo! \n\nGotta come back here with the guy!!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "I assume this torta place was at one time a diner with a countertop table and stools. Nevertheless, this place has a homey-feel with the hustling ladies working and greeting every customers especially me like a part of their family. \"Now I want to cry...*sniff*!\n\nLooking at the menu, this place specializes in the Mexican sandwich with many choices of meats as the filling. \n\nI had one of the specialty sandwiches... the Carne Asada Torta Especials. For $8.25, I get the grilled steak with salsa, guacamole, jalapeno, grilled onions and crumbled queso (Mexican cheese) in a LARGE Mollette roll. This is one \"huge\" sandwich that I've ever dealt with. All the key ingredients are cooked to perfection. And the Spanish roll is grilled nicely too. http://www.yelp.com/biz_photos/22v8sohi8qcFTXxbvag3Zg?select=D6rlMOAus8WJq55HliigLQ\n\nI also got free chips and salsa with my sandwich! http://www.yelp.com/biz_photos/22v8sohi8qcFTXxbvag3Zg?select=CjZbXSo5HqcleWkn4Pr3iQ\n\nThe restaurant's lavatory is also quite interesting. The lavatory reminds me of somebody's bathroom from home.  There are four different kinds of soaps. And there is a bathtub, but the tub is boarded up. I'm not going too much detail more on the unique features.   \n\nMy Mastercard was accepted for my lunch. I might come back and try the breakfast dishes and other items from here. Also, a favorite of Yelp too with the sticker posted on the glass window!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "Pollo Torta with everything was ahhhhhmaaazzzing. You have to eat it fresh in order to appreciate the flavors. I got the breaded style pollo and it wasn't heavy or greasy. Just perfect! The owner and the owner's daughter were so nice and so welcoming! Definitely craving these tortas now as I type! \n\nYou can share the torta with someone else, but heres a warning, youre not going to want to share because they are that good. I gave the other half to my friend and instantly regretted it when I took my first bite. \n\nSo gooood!!!!!!!", "author": "Aloha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "What a gem! Such friendly people. I was here on work, and I am so happy to have discovered this place. The Cubana is MASSIVE and DELICIOUS! Best tortas in the bay area. Every time I think of San Francisco, I think of this place, and will of course stop in every visit.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "The drinks and salsa are great, but I had to wait 40 minutes to get my cubano torta to go. I was so hungry I ordered chips ($1) and basically ate that and drank my horchata. I also noticed most people who came after me got their food first even though they also ordered tortas! Maybe it's because I don't speak spanish but I would think they'd serve the orders that were to go first. No matter how good the food is, I can't go back just based on the time alone. Time is money people.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "I'm willing to say these are the BEST tortas in San Francisco. Everything I've ordered from here has been absolutely delicious; the chilaquiles (SO GOOD), torta de lomo, milanesa de pollo, torta de chorizo...the list goes on. The salsas here are also pretty amazing, I wish they would give you more though. I also love the homey-feel to this place. \nDefinitely one of my favorite Mexican restaurants in the city!", "author": "Christina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Pozole is good, both pollo and pork. Not too Spicy either. A lot of meat included. \n\nBest torta is the one with the different meats, the Cubana. My boyfriend loves to order that.", "author": "Jan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "So last week my wife and I went here to get a bite to eat. I had the Mexican breakfast scrambled eggs with onions and hot peppers. With potato's and tortillas. There is only a few times in my life where I didn't need to add salt and pepper to food because it was seasoned perfectly. This was one of those times. The eggs were scrambled perfectly with the beautiful blend of peppers onions and tomatoes. The potatoes were seasoned magically add the warm tortillas you have a breakfast out of a Spanish moms kitchen. It tasted like home. My wife had the breaded beef torta. She loved it. She didn't have it with avacado or jalapeño. The bread is so good and soft and crispy. The beef was so tasty and tender. It was a huge sandwich she brought half home. It was good cold too. I love this little gem . The ladies that work there are very nice and man can they cook.  We will defiantly be back.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Best Tortas in the bay area!! They are huge! So you can diffidently share this Mexican sandwich with someone. They are so tasty and juicy! Everything is made fresh. Whenever I am in the area I come here to get a Torta or make my husband order one for me when he's working in SF. I have been ordering tortas from this location since I was in high school and that was almost a decade ago.", "author": "Aida L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "TORTAS were HUGE! My brother, fiance' and myself ordered 2 carne asada tortas and were unable to finish it! The green salsa was spicy and flavorful.  The food here is amazing! I totally had itis after eating here!", "author": "Remie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Best tortas in the city! Every time I go in service is friendly and pretty quick the food tastes so fresh! I get the milanesa con salchicha torta it's so awesome!", "author": "Jackie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "Definitely the best torta I've ever had. And they are huge. Eat one half for lunch and take the other half home for dinner. Fast friendly service as well.", "author": "Isaac K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "Best tortas ever, punto y final. Fried Quesadillas are on point too.\n\nSmall space, not ideal for groups, but worth eating there.", "author": "Yolanda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Great Tortas like everyone says here. I love having their tacos de barbacoa on the weekends when they are only available.", "author": "Joel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "Been grabbing these pillows they call tortas from here for a while and am happy to see things haven't changed. They got it right here. Soft fresh bread stuffed with fresh ingredients. About 10 torta options to choose from. I've yet to finish my whole torta. Half usually does it for me. The Cubana and Hawaiana are bomb.com. Menudo isn't bad. Only wish their hot sauces were spicier.", "author": "Luis L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-24", "description": "I love me some torta and pozole. I wanted to try this spot from all the good reviews and since its literally down the street from my house, I figured I'd give it a try.\n\nWhat a waste of money! $9 for the cubana, $9.5 for pozole. \n\nThe Cubana torta, the plus side was that it wasnt overly stuffed, the 5 meats were portioned to fit the huge hearty sandwich perfectly. The down side, the 5meats including the egg were precooked, therefore was super dry, it wasnt even hot, it was warm from the meats being under a heat lamp. Such a bummer, huge disappointment. Not only were the meats dry, they were tasteless. And idk how I feel about hotdogs in the sandwich either. Ive had juicy flavorful tortas that would make my mouth water, that were MADE TO ORDER but this time begged me to stick my finger down my throat in awe that I would actually eat such a thing.\n\nThe Pozole. I was so excited to try theirs. My way of judging soup is by tasting the broth before adding any seasonings of my own. *looooooong sigh* the broth was like sipping water soup w/red food coloring. Soo bland. Absolutely bland, tasteless! SmFCKNhead!! \n\n2stars for the pleasant and very nice workers. Thats about it.", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "Of course their special is their tortas. I had the pambazo-- potatoes and chicken; it was delicious. Their pambazo was meaty and flavorful. The service was fast, and our server was friendly. \n\nTheir prices were a little higher than expected, but it for the quality of my pambazo, it was reasonable. \n\nMy friend ordered a chorizo pambazo, and she devoured hers. \n\nMy boyfriend ordered sopes, and he was quite disappointed in the size of it. They were a little smaller than what he is used to. \n\nWill definitely come back for pambazo.", "author": "Hazel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "A friend introduced me to this place years ago when I needed something to sure my hangover.  It was amazing then, it is amazing now.  La Torta Cuban is decently the way to go but everything is good.", "author": "Superduper Dopalisciously C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "The tortas with pierna (leg) is my favorite! I highly recommend the tortas here. They're just so delicious and totally worth the price. Beat to wash it down with aqua de Jamaica.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-20", "description": "Went here with my girlfriend on a Sunday afternoon and got the California Burrito and a Torta con huevo y chorizo and it was amazing. The california burrito was the best (a little dry, some sour cream might have helped) but it did have delicious guac and amazing carne asada. The torta had some of the best bread... ever. \n\nThe price was cheap and the food was delicious and convenient.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "I loooooove this place!!! This is one of the best places to have Mexican breakfast!... I've never had one of their tortas but the many times that I'm there they have a lot of orders for tortas to either eat there or take out. \n\nMy all time favorite here are the Chilaquiles (rojos or verdes) they are both really good. I get this 90% of the time I'm there with a side of sour cream. The chilaquiles are spicy enough and not soggy at all... it either comes with bistek or eggs but I like 2 sunny side up eggs. \n\nI also get the huarachito with bistek and it's great too. The salsa that they use is amazing and the bistek is always well cooked.", "author": "Liliana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Torta Heaven!  Good stuff , huge sandwiches.  Fruit was also good.  Food was served fast and fresh", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-14", "description": "I've had two of the tortas (pollo asado and the breaded chicken), amazing! If I could give it more than five stars, I would. The sandwiches aren't cheap, about $10, but well worth it. I have an appetite, and I can only finish have to 75%, so it can be two meals worth.\nOn my next trip, and there will be another, I'll try the 5 meat Cuban torta, heard it was great", "author": "FILL S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "Out of the sauna-like interior of Tortas Boos Voni, a torta is created that no sane human would dare finish in a single meal.\n\nThe Cubana torta is massive, flavorful, and fully stocked with an amount of meat that can supply a week-long camping trip.  The bread is soft and chewy, somehow able to withstand and appropriately complement the packed, saucy interior.  The wonderfully seasoned meats are reinforced by avocado, a fried egg, and jalapenos.  The dipping sauces provide an additional kick that further liven up each bite. \n\nBring a friend to take on the Cubana; it is folly to go it alone!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "The tortas here are delicious and really big! I had a chorizo torta and I could only eat half but it was soooo good. At first I thought the prices were a little much but once I ate the food I thought it was priced just right. Parking does kind of suck in the area so I would say that is the only down side but there are bus stops all around so there is no excuse as to why you can't get here and try out their food!", "author": "Kristina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Did someone actually complain that the staff doesn't speak much English? \n\nHere is one of my favorite things about Boos Voni: the staff doesn't speak much English. Read the reviews, it's authentic D.F. cuisine. Where else  can you go, put a quarter in the meter  and feel like you're in another country?\n\nI had the milanesa with chorizo torta and I was satisfied for the rest of the day. Run don't walk to Boos Voni, but don't plan on running afterwards. Friendly, fast, delightful.\n\nBig ups.", "author": "jim b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-16", "description": "Shake that booty... \nAfter eating here several times you'll probably have plenty of booty to shake, because the sandwiches (\"tortas\") are huge. The prices are: $6.95, $7.65, or $8.50 depending on the ingredients u choose.\n\nNote that the top main menu on the wall is in English, while the bottom menu is a duplicate in Spanish. The small space has plenty of seats with about five 4-chair tables and 6 stools at the counter. The women that operate this place are friendly.\n\nNo, the name of the place is not Italian. Boos Voni = \"Bugs Bunny\" (already explained by others). A good example of Spanglish. The menu also includes Sopes (listed on white erasable board) and plates served with rice and beans (listed on papers tacked to wall). Drinks (hot chocolate, juices, aguas frescas, etc.) come in 2 sizes: medium and large cups. There's also a refrigerator that holds bottles and cans of assorted soft drinks.\n\nThis is one of the few places that serves Champurrado (thickened hot chocolate drink). On weekends they have red menudo (beef tripe soup), garnished with shredded cabbage and sliced radish. It's those small details that give this place a special appeal. \n\nLast night I ordered the milanesa de pollo (they also have beef milanesa) plate ($8.50). It was good, 4 thin strips of tender pan fried chicken served with rice, refried beans, and salad (freshly sliced lettuce, onions, radish, and avocado). It comes with handmade tortillas inside a tortilla warmer. The carefully assembled plate looked and tasted delicious. But in my opinion I like the deep fried chicken milanesa at El Metate better because their meat patties were thicker. \n\nThey accept credit cards (VS, MC). \nHours: 9:30am-9pm \nClosed on Tuesdays.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-26", "description": "I've been coming to this restaurant 4 years already by far the best Mexican restaurant there is love the food and the women who works here is super sweet!", "author": "Wendy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-19", "description": "Some of the biggest tortas I've ever eaten. They are pretty darn good. Its in a easy to get to area, right at Geneva and Mission. If I'm going to get some good tortas in the area its got to be from here. My friends and I love going in here, and the employees are super nice. You can pick something off the menu and there's no way you can really go wrong. My friends and I usually leave here in a food coma, and still have leftovers to spare ...and I really recommend that you try it.\n\nThey have a couple of parking spots in the bank of america parking lot. I suggest if you're not going to eat in, call it in and pick it right up. Gotta love it.", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "I love tortas. Everytime I go to a mexican joint, the torta is the first thing I try. This place has one of the best I've had. The place wasn't very well ventillated so I'd recommend getting it to-go unless you want a kitchen perfume on your clothes.\n\nMilanesa chicken here is second to none. Fried to perfection, with flavor bursting out of every bite. These bad boys are definitely big enough to share with someone. If you're daring, they even have a torta cubana. Anyone that knows tortas knows that cubana = death. Putting every type of meat between two pieces of bread, I wouldn't recommend eating a torta cubana unless you would like to be comatosed for the rest of the evening. \n\nAll in all, thumbs up. Go here for a bomb torta.\n\nP.S. They have a poster with fruit on it. Look closely, you can see some fruits assembled in a manner that look like a weener and testicles.", "author": "Alvin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "This review is based entirely on the food and just the food and at that...just the one thing I got...the Cubana Torta..\n\nThis masterpiece is a must have if you go there at least once. The meat was juicy and tender. the spices were perfection. I tasted everything this sandwich had to offer and it was so friggin huge...that I couldn't finish it. \n\nYep this was a 2 day meal.", "author": "Dean M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-07", "description": "3.5 stars\n\nHad the Torta Cubana which is 6 different kind of meat. - $9\n\nAt first, I thought it was a bit pricey for a sandwich since this place is a single $, but you get what you pay for.  This torta is the size of a meteor.  If I have to estimate, i'd guess this torta has about 5000 calories.\n\nWhatever, it's not like I'm here for a diet.  This is how I feel about this sandwich.  Sometimes, you get the urge to just eat something big, fat, and clogs your artery.  It's like fried chicken and fast food.  So if you get the urge next time, you should definitely try this out.  \n\nAnyways, all the meat simply meshed together and there's no way to differentiate one flavor from another.  It's not a bad thing, but I will probably go for one type of meat next time to truly taste the specific meat.  I really like how the bread was soft and fluffy that it soaks up alot of the juices.  The avocado was also a plus.  A picture of the Cubana is available in the photo section if you want to see how it looks like.\n\nOverall, this is a good sandwich and it's worth $9.  Why is it worth $9??  Because you can have at least 2 separate meals outta this.", "author": "Ricky N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "Slowest Mexican place ever? Waiting 30 minutes (so far) for a torta... There are 6 people here and they served three in the past 30 minutes... It really had better be good to make the wait worth it!", "author": "CMOS P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-22", "description": "Great torta.  Not over-stuffed, great meat.  Highly recommend.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-22", "description": "Food rules for a successful night dancing: no beans, no Mexican, minimal bread. I deliciously broke them all at Boos Voni.\n\nI wasn't as enthusiastic when I saw the prices, all a dollar or two higher than tortas joints in the Mission. But I was out of options and needed to get to the Tiesto show at the Cow Palace. The very friendly lady behind the counter walked me through the different chicken options (shredded, grilled, etc), and took detailed notes as I asked for no mayo, avocado or onions.\n\nWhat arrived was nothing short of spectacular. Mounds of shredded chicken in a red sauce, tomatoes and lettuce complemented by a thin layer of refried beans, all jammed between two absolutely massive pieces of bolillo. I initially planned on only eating eat half to make sure I didn't get a stomach ache, but it was so, so good, I devoured every single bite.\n\nI apparently needed it. One of my favorite tortas ever provided the fuel for six hours of dancing. The night will be remembered by a good, not great Tiesto (he needs to get past this pop/dance hybrid phase), and an outstanding torta.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-24", "description": "If there was an option for a 6th star this place would definitely get it. \n\nI stopped by before my hair cut appointment at the Ace of Fades across the way for a quick bite to eat, this place is litereally a hole in the wall but it is so damn good.  \n\nI really can't say enough about this place it's fresh- they make everything on the spot and it is all home-style. \n\nIt's a little tough to find, but Rome wasn't built in a day right?\n\nGO  HERE", "author": "Dario T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "I've past this place a bunch but never got up the nerve to go in til today.  I wish I hadn't waited so long!  Not for the faint of heart, nor for those watching their diets or vegs.  That ain't happening.  What IS happening is total meaty cheesy euphoria.  It's something we should all just embrace.\n\nI didn't try the cubana which is GI-NORMOUS and topped with 6 meats.  Next time.  I had the turkey con todo and was pleased.  My pop had the milanesa and it was bomb-diggity.  One sandwich could feed two people with small to medium appetites, but if you're hungry...bring it.  You won't leave hungry.  And if you do, you're a sicko.\n\nI will most definitely come back.", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "I ordered the milanesa torta and not only was it delicious, but it was huge!  I could only finish half of it and had the rest for lunch the next day.  The bread tasted very fresh and the hot sauce they gave on the side was good!  I wish I asked for more... Next time, I'll try the chicken milanesa or the milanesa/chorizo!  Also, the people that work there are very nice.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "Amazing. Seriously. It's not just a food coma.\n\nThe $9 Cubana. That's what people here (Yelpers) order. Yes, it's the most expensive thing on the menu. It's pretty expensive for a sandwich, but a Cubana isn't a sandwich. It's a meal for a day. Maybe more.\n\nFive meats between two massive pieces of bolillo (a soft Spanish white bread roll), cut in half. Veggies? You can get avocado. But I don't need no stinkin' veggies. So I tell her without avocado. (I tried to tell her chorizo instead of hot dog, but she doesn't understand that much English. Oh well.)\n\nFlavor town. That's where you find this sammich. It's a mess. It hits you like a mouthful of bricks -- but then you realize those bricks are awful tasty, full of complex flavors, like an awesome block party in your mouth, with the spicy salsa like an ice cold Corona, bringing it all together in your belly. If you didn't have a belly, you will after eating this monstrosity. I managed only half. My body mercifully thanked me.\n\nBut, bad metaphors aside, you cannot forget this bread. Do they bake it themselves? I'm sure they do. It's soft, pillowy, flavorful -- brushed with oil on the outside, I think. Firm on the outside, yet fluffy inside. The two slices are like the perfect pair of tatas. But as food. Soft, warm, perfecta... This bread would make all typical hoagie rolls extinct.\n\nI really want to give it five stars, but there's room for improvement here. It's not the $9 price. I've payed more for spendy ohtoro that tasted not even half as good as this sandwich. The sandwich isn't hot and made to order. Five meats, including a breaded chicken-fried steak kind of meat, take a long time to cook. I don't care. If it sits around, it gets soggy and greasy. The egg? Prefried and overcooked. Serve me this sandwich made to order and I guarantee it will be a five star sandwich.\n\nBut the bread... I'd come here for the bread alone.", "author": "Perci N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "There's not much I can add that hasn't been said already, but we thought this place was great.  Looks like the ADA police got to them - seems they have to close for a week or so to bring the front door and bathroom up to code.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-03", "description": "Took 30 minutes to get our food even though it wasn't all that crowded. We both ordered the Carne Asada plate which was very bland, but a nice portion of food. Staff was friendly. Probably won't return.", "author": "Carol G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "I am originally from Mexico and Lived in D.F. for quite some time. I also worked in a publication in the Mission District so I can be demanding when it comes to mexican food. \n\nTortas Boos Voni are the best Tortas I have ever have (including the mission and Mexico)\n\nmy favorite one is the Torta Cubana, the mother of all Tortas. Beware when ordering this thing is HUGE and it really is a meal for the whole day.\n\nthe staff is also very nice and friendly.", "author": "Rigo H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-25", "description": "AMAZING! NEED I SAY MORE!!!\n\nGo and try it out, I have been there several times and never ever had a bad dish! I recommend the Cubana if you dare! \n\nother good ones are the Hawaina, and the Milanesa con Chorizo!", "author": "Ed S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-30", "description": "There are a few schools of thought on the torta.  The primary difference is the bread: telera or bolillo.  With a nod to Tarantino, this choice is as significant as chocoloate vs. vanilla, or The Beatles vs. Elvis.  The choice of bread speaks volumes about the person making it and even more about the person who prefers eating it that way.  The telera skews to excess.  The bolillo is more refined.  \n\nWhen I lived in D.F. I had 4 torta places in my rotation, each for different reasons.  2 were based on geography (1 at work, 1 at home) and the other 2 were based on being the best of their own schools of \"tortalogy.\"\n\nSince moving to SF in 1998, I've learned a few more things about the science of the torta.  Notably, that the burrito is king in NorCal.  Most taquerias put the torta on the menu mostly out of obligation since I'm typically the only person eating one in the restaurant.  But in the places where the torta IS king, the telera is the crown.\n\nTortas Boos Voni wears this crown proudly.  I don't even remember what else is on the menu because I only came here for the Cubana.  And I've got to tell you that it's just exactly like the ones I used to get in Coyoacan.  From the top, it's sporting:\nBread\nMayonnaise\nLettuce\nAvocado\nFried Egg\nHot dogs\nBacon\nHam\nMilanesa (fried beef, like a breaded minute steak)\nOnions\nPickled Jalepeños\nMore mayonnaise\nBread\n\nYum, yum, give me some!  All the reviews are true:  The Cubana is huge.  It really is big enough to feed 3 adults.  But if you truly love your tortas, you'll want to save what you don't put down on the first pass for lunch the next day.  Yes, it's missing some standard issue items, like refritos on the bottom slice of bread.  However, this sandwich is absolutely authentic and the ladies that served it up were as nice as can be.  I am definitely a fan of Boos Voni and I can't wait to come back.  It's a hell of feat for a sandwich to transport you 17 years and 2000 miles, but Boos Voni has done it.  With apologies to King Torta in LA, Boos Voni is the real King. \n\nFinal note: I, like most of my high-AQ friends, never did like hot dogs on my torta.  Even in D.F. I asked them to sub in chorizo and I've never received a funny look.  Last night I wanted to have it straight off the menu to give it a fair assessment.  Next time I'll have it with chorizo and I suspect I'll give it a 5th star in the follow-up. \n\n  \nAQ: n/a", "author": "Michael F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-18", "description": "The hubs had been talking this place up like you wouldn't believe.  Sometimes we don't share the same love, so he insisted on bringing me to sample some \"grub'n sandwinches!\"  I ordered my sandwich, but unfortunately was sidetracked by a special.  I know this place is known for their tortas, but if something labeled \"special\" it must be good...otherwise it'd not be on the menu.  So he says just order the chile relleno and we can share it--to see if it is in fact special.\n\nSo, i'm smacking my lips thinking of the food.  My torta comes out...boom.  It is savory and delicious and because of the salsa with the chips, my tongue is virtually numb to the jalapenos in  my sandwich.  Fine...the special comes out.  I'm excited.  I get my lil torn corn tortilla, slice a piece off my relleno add some of that salsa, toss in a smidge of beans and rice.  I am chewing and in the midst if my soft cheese and pepper is the 1/4\" end of a toothpick.  I am startled but realize that maybe it's just a tidbit that was slightly overlooked.  Talk about overlooked, I tell the owner and she's like \"Yes, toothpick.\"  She points out there is probably more in the relleno.  Man, don't they normally pull those suckers out!?  I sliced my relleno across, not the along the length...what the hell. I got a piece of it, but there was still 2 toothpicks inside.  I know i'm acting a little butt hurt about this, but no one warned or indicated that there might be toothpicks left inside.  When looking at the dish, it didn't even look indicative that there were toothpicks.  I know they use toothpicks, but come on.  Give a girl a break and warn her next time. \n\nI would have liked the review to be out about the delicious tortas, but I can't stop thinking about the damn toothpicks and her reaction.  She was very nice, but geez.  Not enough to overlook something so potentially dangerous.", "author": "elizabeth c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-16", "description": "I've always seen my roommate get huge tortas and she told me how amazing they were and such so I decided to try it myself.\nI ordered the basic Chicken Torta and a coke to go which came up to be a bit over $10 bucks. Pricey but for the portion I think its right.\nGot home I was only able to eat half the torta which was okay in flavor.\n\nThe bad part is that I was sick for the next 2 days, I picked the most simple thing in the menu and either the vegetables were not fresh or the meat was old but I would not recommend this to anyone.\n\nSave yourself some dollars and go to Reinas a block up!", "author": "Albert Paris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "my favorite tortas in the city. i've had tortas at a bunch of different places in the city with a little bit of variation and i'm not sure what what a \"proper\" torta is supposed to be, but these are the ones that stand out the most to me, especially because of the fluffy bread. for example, i might go to one of my favorite burrito places and decide last minute to grab a torta. but if i am specifically craving a torta, this is where i go. a lot of people recommend the cubano here with all its various meats and while its tasty, i think its a bit too rough on the stomach. so instead, i always go for the carne asada. finally, this is one place where i could barely finish the large portion size and the price just above $10 is reasonable. i usually end up leaving 1/4 of the torta for a snack a bit later. also, some of the photos here are deceiving... the sandwiches may look flat, but they are very wide and feel very stacked and massive once in your hands.", "author": "Oleg P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-24", "description": "I was born and raised in Mexico City and walking into this place is like going back...for real!..\nThe tortas are BIG!!!..almost too big but it's what makes this place unique..and all the taste is THERE!..MMMMMMM", "author": "miguel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "Their tortas here are huge. I can barely eat half of it. It can actually feed two people unless you're really really hungry.", "author": "ben s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-09", "description": "i'll be writing a review update as soon as I come out of my food coma.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-21", "description": "omg omg omg omg omg omg.\n\nI was going to stop and get some Indian Pizza.. or maybe a Torta at El Faralito.. but a friend mentioned having the BEST TORTAS EVER at this place, so we had to go try it.\n\nHoly crap.  \n\nBEST \nTORTAS \nEVER\n\n(and so big that I took one half home, and am eating it as I write this review)\n\np.s. -  hope you know some spanish, or at least know the right word to get the meat you want.", "author": "I M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-09", "description": "Another great Torteria I had discovered a couple of months back at Summer's end, they have a great Torta de Pavo and Cubana. It looks like La Torta Loca down in the Mission will have some competition because these are real authentic or close to authentic as you can get Tortas, in which the Taquerias here  in the city don't do Tortas justice because they look like soggy hoagies rather than Tortas.\n\nThere is also a secret history to this place in regards to the name Boo Voni especially those Que Habla Español it used to be called Tortas... Bugs Bunny!! but WB Sued them and they were forced to change their name to Boo Voni by cleverly disguising their name using the Spanish pronunciation as a cover in which the majority of the customers are unaware that it is named after a WB Cartoon character a flea bitten varmint named Bugs Bunny!!! Ha! HA!", "author": "Alberto L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "SO SO SO TASTY!!!\nAllow me to introduce myself, I'm Ricky, a BIG FAT ASS who wants a BIG FAT ASS sandwich (well put Boxxman, well put).  Now, at least, I'm a FULLER and FATTER FAT ASS, which is good news for everyone.  I just had a divine torta from Tortas Boos Voni.\n\nThis place is legit.  It's the type of place that I like because when I walk in, there's only Spanish being spoken, and it makes me a little uncomfortable because I feel left out.  But that's why I live in SF, so I sack up and order.  Everyone is polite and friendly.\nThe bread is soft on the inside, crisp on the outside and buttery all over, fully complimenting the panoply of flavors that is this place's torta.  I had half of the Cuban and the Hawaiian and I'd recommend both.  The Cuban had a distinct earthy, meaty flavor, kinda smoky, kinda reminded me of comfort-food sausage.  The Hawaiian has ham and pineapple in it and a crazy kinda sweet cheese.  The salsa verde and roja are delicious and some of the best I've had in San Francisco.\n\nTo sum up, I was hungry and instead of being merely satisfied, I had a blissful experience.  Thank you Tortas Boos Voni.  Maybe someday I will figure out what you're name means.", "author": "Ricky R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "I really like tortas. It really had been a couple years since I had one. Why or how is it that someone who claims to be Mexican or be anything Mexican go so long without enjoying one of these little pleasures in life?\n Well, good question with a good answer. You see, I am slightly spoiled when it comes to good tortas, and was afraid to be disappointed with the tortas in this area. I was right, I am disappointed, but only a little. Also, those things are not good for diets, and if I was going to splurge on calories, I wanted it to be worth the weight gain. Why not just throw it away, someone might ask? Well, Mexicans don't throw away food. There are starving children in this world and its a sin to throw it away.\nAnyway, the torta I had wasn't what I was used to but it was good. It was also huge, that I was not used to, so in a way it made up for the flavor. The bread was a bit on the dry side (and it wasn't because it was grilled, it was just dry), and the chili sauce was good, but not great. If they changed those 2 things I would likely gain a lot of weight over the coming year.", "author": "Leticia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "This is one of the best restaurants in the neighborhood. If you live in this neighborhood, that doesn't say much. But if I were to say this is one of the best Mexican sandwiches on the planet, you might want to live in this hood.\n\nThe sopes are also very good, befitting a smaller appetite. Check them out, they're delicious!\n\nDon't mess with the owner, she'll have none of your airy WASPy attitude. Remember your here for the sandwich. Or the chilaquiles, or the sopes, or the soup on weekends. (Green soup = b'ah, Red soup = awesomeness).", "author": "Martin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-04", "description": "As it is well-established, I looove tortas, which are Mexican sandwiches. \n\n[I've long believed that burritos are what Caucasians eat to feel ethnic or cultured.]\n\nAnyway, back to this place, I love it! The bread is crisp and soft at the same time. It is almost the best part of it. But the meat!!!!\n\nThe Cubana is avocado, bacon, beefsteak, ham, sausage, fried egg and chicken in one bun. I'm not a skinny dude, but this $9 meal gives me pause.\n\nIf you'd like to try something different, eat here.  (My Caucasian step-brothers have never eaten here, no matter my most fervent begging.)", "author": "Alexander D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-27", "description": "TORTA HEAVEN. This is the best torta in the city. If you have ever been to D.F. then you know what I mean. ( ah! brian c:  a lot of people come to D.F. to live. The ones who move there are called chilangos, the ones born there just say they're from D.F.)  I've been here many times and just the mention of going there prompts an emotion in my household equivalent to Andres Cantor and his famous GOOOOOOOOOOOOL!!!!!\nA HUVEO MI LATINS.", "author": "santiago g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "My boyfriend introduced me to this place, and now I want to go every weekend. Their tortas de Jamon are DELICIOUS... I've been to La casita chilanga but they just aren't as good. Definitely recommend, especially to those with a big appetite. You gotta try them!!", "author": "Teresa D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-23", "description": "Taste was so so, I'm not sure what the fuss is about.  I asked for a recommendation and the waitress said el cubano.  Of course, it's the most expensive sandwich on the menu, more than $9 for a torta!  It's a torta, meat and bread, that's it!!\n\nThe sandwich was big, but I don't think this place is very warm to their customers perhaps since I don't speak spanish...not sure.", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "Oh man!  My dad had been talking about his place for weeks.  Saying that in his opinion these are the best tortas.  Was he right!  I had the pierna torta with everything (avocado, beans, sour cream, cheese, jalapenos) and it was amazing!!!  Let me start by mentioning the size of these things!  The tortas a gigantic!  Seriously, these things are huge and for $7 it was definitely a deal!  The meat (pierna) was so flavorful and smoky, and the bread was crusty on the outside and fluffy on the inside. it made for one hell of a torta!!  The lady taking orders was very friendly and wrapped up the half of the torta that I was unable to finish.   I will definitely come back with a large appetite to attempt to finish one of these bad boys :)", "author": "Lesliegh H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "This place is pretty dope homies!! Im sad that  im only just now discovering its greatness! I went here one morning to reward myself for staying up for a midterm and ordered a torta with carne asada. This thing is HUGE (thats what she said) and it was only 7 bucks! loaded with meat, refried beans and avocado a great steal. I enjoyed only half of it because it was so much and i wanted to save the rest of Lunch/Dinner. Def worth you $ :D", "author": "Julio S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "Place Rocks! Tlacoyos and quesadillas all 5 stars. These are different quesadillas then what you get at a taqueria but 20 times better. Their torta de milanesa I give 4.5. They lose half a point cause it needed some salt but for under 8 bucks you get a huge tasty torta. You can eat this torta by yourself and be stuffed the entire day or share with someone or eat half and then half later. Up to you. You have options this thing is so huge. BIG TORTA!!  In addition, their sauces are excellent but scarce. They only give you one mini cup. Ask for extra sauce if you like to drink the stuff. Oh! If you are in a hurry call it in a head of time. If not you will have to wait.", "author": "Carlos N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-23", "description": "this place sucks!\nYES they have big breads, YES its expensive and overpriced and \nNO its not that good. We bought the cubana torta and it was filled with meats and egg. The meat seamed old and regrilled for heating only. the sandwich itself was oily. The staff barely speaks english so be specific when ordering. if this is your style of food by all means go here. but if you want to save $8 build your own torta or go somewhere else!!!!", "author": "Cee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-11", "description": "Excellent tortas made with fresh ingredients and savory meats. Boos Voni's tortas are a little more expensive than the ones found at your average taqueria, but they are also a lot larger. The extra cost is worth it.\r\n\r\nThe pork loin torta is especially sumptuous as well as the \"Hawaiian\". Boos Voni's also serves numerous lunch plates. Friendly staff with either table or counter seating. Menu is mostly Spanish.", "author": "Be N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-12", "description": "The tortas here are always perfect.  I love their bread!  It's always served hot and tastes so fresh!  My favorite is the Milanesa de Pollo, which is simply breaded chicken.  They are huge!  I also recommend their fried quesadillas, made fresh to order...love the one with mushrooms. \n\nAlso, their champurrado is delicious (it's essentially a Mexican hot drink, that is made with maseca or flour...similar to hot chocolate but the added flour creates a thicker consistency than hot chocolate).\n\nAlso, Ricky D, their name was actually originally Tortas \"Bugs Bunny\" but I guess for obvious reasons, they weren't entitled to use this name so they just changed the spelling of it, which is now \"Boos Voni\" to still sound like Bugs Bunny.  \n\nThe only thing is that sometimes my torta comes with beans, sometimes it doesnt.  I don't have a preference, it tastes good either way.", "author": "OLGA M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "This is probably the best place in the city to get real D.F. style tortas- and my old man is from D.F. so he knows! These are huge sandwiches on this awesome bread. My favorite it the pollo milanesa, which is a thin breaded chicken cutlet. I sometimes get the salsicha (hot dog) torta which is great too. These are big enough for two people to share. The only reason I didn't give 5 stars is because sometimes the service is slow and parking sometimes sux... They also have chilaquiles, huaraches, and more D.F. style specialties.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "Best damn tortas in the Outer Mission. This place is your true Spanish mom n' pop shop because they take orders in Spanish (unless you don't speak it, of course). The prices are a steal, so you get large portions on less cash. And that's the way it *SHOULD* be, if you ask me. The horchata is a *MUST HAVE*, and is the best I've tasted in my *ENTIRE* life from any Mexican restaurant. If you leave without some, you're a loser...", "author": "Maurice R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-17", "description": "dudes. chilaquiles verdes, over easy. flour tortillas.\n\nalways trust Centauri ...", "author": "erik s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Love the chorizo and egg torta... these things are huge... i order one torta and share it with my husband and both of us end up full... this place is a must", "author": "Betty H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-28", "description": "After all of the previous 5 star reviews, my gf and I were excited to try this place.  And we love the name.  But it didn't really live up to the hype.  I'll try it again but was not that impressed this time out.  Staff was nice but the service was s l o w.  Food quality was just average.  Maybe it was a bad day?", "author": "Brendan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-31", "description": "I tried this place cause it's in my hood.  I'm not latino, so i felt alittle out of place.  A super small hole, is an accurate description.  They put out a nice torta.  I like the ham ( jamon),  i was pleasantly surprized that they make chili queles.  I like this with egg.", "author": "Ima S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-06", "description": "i love tortas...\n\nthe problem is, my wife (miss \"perfect bite\") is not a fan of the large sandwich.\n\nthere is too much meat, too much bread, the fillings are not even in the sandwich, there is too much/too little mayo, mustard, wrong mustard.... i could go on and on.\n\nso since the wife is with my mother-in-law having dinner to celebrate her birthday, i decided to check out tortas boos voni.\n\na large carne asada torta with everything plus a mexican soda came to just under $11.\n\nthe damm thing is huge and really delicious, the \"carne\" itself could use maybe a little salt, but nothing worth losing a star over.\n\ni ate the thing so damm fast i did not notice the little to-go container of hot sauce that came with it, which is too bad since it tastes exactly like the hot sauce i would get at a long gone mexican food place in santa paula california that i miss dearly.\n\nworth the trip and i will be back!\n\n**update** 4/18/08\n\ni picked up 2 carne asada tortas for me and the wife, and she liked it!\ni guess tortas boos voni is on the pick up something for dinner list now!", "author": "erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-21", "description": "This place is awesome! Gave a friend a ride home who lived out there. We were hungry and I told him to take me to the best hole-in-the-wall he knew out here. Without hesitation, he recommended Bugs Bunny (the correct gringo pronunciation) if I want the best torta I will ever have. Great stuff! I had the chorizo and potato torta. Couldn't finish it all and I will be back. If you don't speak at least a little Spanglish you might get intimidated right out the door, but it's too greasy and good to miss out on. In fact, I'm just merely writing a review to remind myself to go there again.", "author": "mike b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-26", "description": "I love the Cubanas that they make here.  I can feel my arteries hardening just from looking at the sandwich as it's dropped off in front of me by the nice ladies who work there.  As others have mentioned, you get lots and lots of sandwich--so if you are not into super-mega-size portions, eat half and take the rest with you for your next meal.  It's still pretty good the next day!", "author": "Herb L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-21", "description": "If your a BIG FAT-ASS who wants a BIG FAT-ASS sandwich, you may look no further. I only had one(Cuban with everything), but I'm sure whatever you put on it will be awsome. I actually could've gone without the weird pieces of cut up hot dog in there but they are easy to pick out or order without. All sandwich lovers must give it a try. Also don't mind the funkiness of the place. The kitchen actually looks very clean.", "author": "Boxxxman J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-08", "description": "the sopes and huaraches are the BOMB!!! hella good real Mexican food.", "author": "Ericka S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "I absolutely LOVE, LOVE, LOVE the Carne Asada Torta. My boyfriend and I get one and share it. It's sooooooo good! I always have leftovers from my portion. I like to take my leftovers with me to work for lunch the next day.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-06", "description": "This place has great tortas, sopes, and quezadillas.  The best thing about this place is that they make their flour tortillas fresh for every order.  You can see the woman grab the dough and flatten it out right there before she cooks it.  I love the sopes, they remind me of home and the price is right, you get 3 for $5.  The tortas are gigantic and delicious.", "author": "Erica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "Good grief! These sandwiches are about the size of a flattened football. In other words, GIGANTIC. The milanesa de pollo torta is pretty awesome. Not at all like the tortas I've had in the past, which are now officially boring by comparison.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-14", "description": "They just get better every time! I'm adding a star for the Cubana sandwich, it fed three people and was darned good.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-01", "description": "Took a leap of faith to try this place out after read 2 reviews from Yelp.  Man oh man... This place is no joke.  I was struggling to understand their menu because it was in Spanish.  My Spanish is too rusty to understand it.  The staff was really friendly to help me out choosing my food.  As I sat down and noticed my surrounding, the restaurant is very clean.  I used to work at a restaurant in college so I know where to look.  Their kitchen floor was clean, so was the counter.  There was no grease, no dust.  For a moment I thought this restaurant was owned by a Japanese.  Fresh flowers on every tables.  When the food came out, I was amazed by it.  The beef asada tortas was delicious.  The bun was really tasty, not the type you would buy from Safeway or Albertson.  Another dish was one of their special.  It was in Spanish, so I had no idea what it was called.  Every guys in the restaurant were eating.  Here comes the important part, they gave me a hot chocolate instead of my horchata by mistake.  Man, it was the best hot chocolate I have ever had in my life.  It had a subtle spicy after taste.  My lunch was really good.  Too bad the restaurant is a bit too far from my place otherwise I will go there very often.", "author": "Lan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-29", "description": "The best Torta Cubana I have ever tasted, but I couldn't finish one whole torta in one seating.  It's just so huge.  I started coming here 5 years ago when my Hispanic client asked me if I wanted torta and so I asked him what torta is.  Before, the only mexican foods I knew were tacos and burritos but since I tasted Boos Voni's Torta Cubana, I didn't want to eat tacos and burritos anymore.  More power to the staff of Boos Voni!", "author": "Berong B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-29", "description": "the beef milanesa torta is AMAZING.", "author": "amy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-13", "description": "This place is great! Clean , friendly the food is good and consistent. This is a hole in the wall place so don't expect anything fancy.  Just good authentic Mexican dishes.", "author": "Jaime O."}
