{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "oh honey, $3 margarita monday's. SIGN ME UP. the drinks were mixed so well and the mixologist was a total doll. LOVED MY EXPERIENCE. 10/10 will return", "author": "Yasmeen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Good watering hole. You can drink here with people who are drinking. You can sit on your phone or laptop in the corner and be that way and no one will bother you (mostly). Or you can sit at the bar and joke around and talk to the strangers next to you or pretty much hang out as you would at any dive bar in the USA. I liked that this was a non pretentious non tourist trap sort of place in a city that seems overrun by tourists and tech bros these days. \n\nIf you want to drink and well drink then drink here.", "author": "Marc R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "$3 margaritas! And they are great!! Having drinks with friends to celebrate Labor Day! Great music and vibes. Lots of tables to gather and great beers on tap. \nLocated right on Haight in the middle of everything! Left the boys and after a few $3 margaritas we shopped and left them here!", "author": "sally s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Javie Is great! He is so nice and literally the best bartender here. The drinks are cheap and strong! I love coming here because the scene is chill and once again, the drinks are amazing! This is the only gay bar left on Haight Street. Support this establishment because it's literally the best gay bar on in the city!", "author": "Nick Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Found this bar at the end of the Haunted Haight tour (spoiler alert: it's haunted!!) \nThis bar has it all: ghosts, cheap drinks, friendly service, pool tables and great music. And don't get me stated on the $3 Monday Margaritas!!", "author": "An S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "I went tonight. 9/26. Went inside and there was a few people there. No bartender. I waited a slightly awkward amount of time. Not extremely long. However, long enough for me to be uncomfortable. I was going to stay for a bit and play pool as it was a new bar for me and was going to inquire about the Trax joining the San Francisco pool league. But, since it didn't seem like anyone was around I left.", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Bartender had some customer at the bar approach my friend for not leaving a tip. All she ordered was a beer.....\nNever been to a place that scolds you for not tipping. Really sad", "author": "Richard F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Best Bloody Marys in the city!!  Check them out on Sundays!!  $2 Tuesday all beers!!  Only gay bar in the Haight!!  Great place to hang, great music and friendly staff!!", "author": "Roy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Casual spot, cheap drinks, friendly bartender. 5 or 6 beers on tap. Good spot for people watching if you can grab a window seat.", "author": "Steven E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "This is where I experienced the best bar day ever. It was Super Bowl Sunday and my friends and I were looking for a chill place to sit and watch the game. We walk in to find this awesome place. It was a nice little neighborhood bar. We found some seats next to some awesome people and started watching the game. THEN, magically...4 giant pizzas walked in. I have no idea if it was the bar, some random nice guy, or what but it had to make the review. I mean when God sends me free pizza...I have to publicize that. Oh aaand free chicken wings. The atmosphere was great and the bartenders were super friendly! All of us were made to feel at home like we've been homiez since forever. Not sure if it's a gay bar or not. No one hit on me but that's typically not the best metric...it could have been me...hahaha :)", "author": "Leena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "One day while walking in the Haight, I had to pee really badly.  When every other bar gruffly said no, the friendly bartender at Trax smiled and said yes.\n\nHe seemed surprised when I gave him a tip.\n\nTrax is a place to chill in an unpretentious atmosphere.  It's one of the few gay bars left in the Haight. Everyone is welcome and can feel comfortable.", "author": "Sondra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Awesome barrel aged cocktails, and a super friendly bartender when we went. Good beer and liquor selection. Will definitely be back when in the area!", "author": "Jocelyn V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Great super clean bar on this crazy and historical stretch. There was even some locals openly smoking mota on the street, yep the 60's are still alive and well in \"The Haight.\" Perfect spot for an afternoon wetting of the whistle break from perusing the interesting shops. Small, but good selection of craft beers, and a full bar. Not sure how the evening crowds are, but was extremely dead on an early Sunday afternoon. \n\nRoy is a way groovy bartender too!!", "author": "Dan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Attentive barman. Acknowledged us straight away. Super efficient and friendly. \nHe works very hard serving and keeping while bar tidy. Great! Bloody Mary's amazing... pickled asparagus, green beans, carrots and brussel sprouts! Gorgeous. Try it!!", "author": "Lee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "I'd never been into a gay dive bar before this, but if there's a place to have one, it's the haight. Drinks are cheap ($4 wells, $5 martinis during HH) and strong. The bartenders are super friendly and they have TVs so you're welcome to stay for a while. The bathroom is gross in my opinion, so I just make sure to go somewhere else before or after. Other than that this place is cool.", "author": "Sara T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Thank you to Mark and the staff for always being amazing.   What love in the room yesterday for Andy's memorial.   Mark,  you have an amazing heart.  Love you man.      \n\nTrax is a perfect place for a rest stop while shopping in the Haight.   Great staff, lots of history,  and just a great place for a delicious Bloody Mary!", "author": "Matt A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "What can I say?  It was a wonderful experience!! Roy made us feel more than welcome and it was literally the highlight of our trip!!! We came in for one drink and we stayed for 4!!! He gave us restaurant recommendations that we will be trying this evening. What can I say?? Come to Trax! I had the aged manhattan and WOW it was amazing,  10$ for an aged cocktail you can't beat it! Come here NOW!!", "author": "Marisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "After a round of mediocre beers and lunch across the street, we were not quite ready to head back to the hotel, but not really interested in spending $8 for a beer. Trax was open, fairly uncrowded, and the people looked friendly, so we popped in for an adult beverage. And thus continues my habit of accidentally wandering into gay bars. \n\nThe glasses are chilled and the beer is well-poured. Ding, ding!\n\nThe bartender is friendly and willing to give you a couple samples of beer to help you pick the one you'd like. Ding, ding!\n\nThe beer is cheap. Ding, ding, ding! \n\nThe music is good, the people are friendly, and I'll definitely be back if I'm in the Haight and looking for a place to drink.", "author": "Kristy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-10", "description": "On Wednesday night 1/10/18 around 11:30pm....Never in my life have I gone to a bar and sat in the bar for 10mins while the drunk bartender smoked cigarettes and talked outside while the bar was left unattended. We never got served a drink, and once he was told that people were waiting for a drink. He responded like we inconvenience him! Has service industry people that kind mess is Completely WRONG!!", "author": "Phillip P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Robert, the bartender, is real cute & handsome! Strike up a conversation with him, you'll end up laughing by the time you leave... Oh ya & $2 beers on Tuesdays are pretty dope, you have choice of over 10 different bottled beers & 9 on tap, it gets crackin!", "author": "Jezza Mei O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "I absolutely love Trax it's my 2nd favorite bar in the world and by far my most favorite bar in the city. No trip to SF is ever complete without a visit to Trax! I typically visit during the day and their day bartender, Andrew is amazing!!!! He's super cute and attractive, friendly, and he plays the best music and has the best taste in music ever! Period! Andrew also pours really good drinks and I'm picky so that's saying a lot! I also feel that Trax is the kind of bar where anyone gay, straight, bi etc would feel comfortable....it's relaxed and chill....it's more subdued....not your typical gay bar and I love that!!!", "author": "Kari O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "$2 Tuesdays. Gay bar with the nicest people. Walking distance from my apt. Can't tell if it's a good thing I didn't discover this place til now. May be dangerous...\n\nSee you one of these Tuesdays, for sure!", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-09", "description": "We came here on a rainy day...and I was literally just here with my friend and we were here for over an hour drinking. I called an uber and while I was waiting under the door for less then a few minutes the bartender was so rude... he came up to us and told us to move outside since we were blocking the doorway. We were NOT blocking it at all, and there was also no one coming in and out anyways. So he made us stand outside in the rain ... sure maybe he could have told us to wait back inside or even could have been nice about it, but he demanded us to go outside...not how you treat customers. Will never be back. I recommend the bartender learn some hospitality!", "author": "Hoku L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Originally from San Francisco (not the bay; I'm actually from San Francisco, but now living in Chicago. I come to San Francisco to visit family during the holidays (thanksgiving, Christmas, and easter weekend). Well back on December of 2013 I was just bumming around looking for a bar to grab a beer with a friend. Stumbled upon Trax. \n\nThe beer is cheap. Considering a pint of craft draft beer is cheaper than any bar I've seen in Chicago (and we all know San Francisco is an expensive city). The bartenders are extremely friendly, and I've met some awesome people here. \n\nI try to come here with friends every time I'm in San Francisco to visit. There's a pool table that's easy to get play time on. Only negative to this place is the bathroom. Only one very dirty unisex bathroom which you need to get the key from the bartender or the person in. Very gross.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "Stopped here on a Saturday night when my clutch blew, and was waiting for my ride. It was super chill, and pretty dead considering it was Saturday. I loved that the music wasn't too loud, so I could actually hear the conversation I was having. The gay bars I've been to here in Sac have the most obnoxious music I've heard. The bartender was prompt, and friendly. The drinks were strong, and cheap. I paid 9$ for an AMF vs 15$ for the same drink here in Sac. Will definitely stop by next time I'm visiting the city. P.s. this was also my friends first time to a bar, and we're glad it was this one.", "author": "Amylia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "I would never think to write a review for a bar...but this is TRAX! What does that mean?...\n\nMy first time coming here was with a friend a few years ago on his birthday, christmas. We sat down in an empty bar and ordered a couple drinks. From then on it was my #1 bar. The vibe, atmosphere, MUSIC, the MUSIC! So good. It's so laid back in there you'd think there was no alcohol in the drinks...until you have one and you're knocked off your feet! $2 beer Tuesdays was a recent discovery and just another reason to come here.\n\nTRAX you have my inebriated heart", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Interesting dive bar in the haight and even more so late at night. Decent drinks, and there's a pool table inside. Everyone in the late night crowd seems to know everyone else there. Drinks are decent, it's not overly loud. Good place to kick back, definitely some very interesting people there!", "author": "Sherry X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "JAVI WAS THE MAN he was manning the bar by himself. Will definitely slide through again . He's chill AF and definitely someone you'd come back just to make your drink. We came from STOCKTON and will DEF be back!", "author": "Rose G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-02", "description": "This is my first time at a bar so I did not know what to expect. Which brings me to my first mistake! I'm so sorry to the bartender who served on the Thursday night. I didn't realize I have to tip, my bad!  Now I know.. anyways they don't serve any blended drinks here they only serve drinks on the rocks. With that being said, I ordered a margarita with salt on the rim-- it was a good ratio of alcohol and the lime! And being a lightweight like me, I was definitely much buzzed with just one glass.  \n\n They have only one billiard table. it doesn't cost much to play but it is quite a dirty one. But here's a little tip, if you get the white ball in the hole don't worry it'll automatically spit out of the machine. \n\n Bathroom. Reeks! You can practically smell it throughout the entire establishment.. but I guess that's what you would expect out of a bar? \n\n Gay pride?  Well the place definitely has gay people there. One was very flamboyant and friendly! He definitely made my friends day :)", "author": "Dixie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-11", "description": "Charged $12 for an old fashioned.... Bartender super rude and didn't even think to tell me the price of hibiki at the bar... overall ignored and not offered any second rounds  THUMBS DOWN!", "author": "Shane K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "With shots like that and $2 beers on Tuesdays, what's not to love?! Exactly. \nThe bar tender was nice and friendly. Great looking dive bar with an odd selection on tap. There's no crap beer on tap. Trumer pils, stella etc. Makes this place a great find. Music is decent enough, lots of tvs. The plastic strips on your way in are a little off putting. \nScratch that. The bartender's AWESOME. Talks great shit, and is who he is. He went on a tirade about hipsters. Sorry hipsters... oh wait, no I'm not.  Hard to argue with that. \nDon't know why this would matter, but it is a gay bar.\nMeanwhile, I accidentally left my umbrella there and sure enough two days later they had it in the back. I highly recommend heading back.", "author": "Don P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "$2 buck Tuesdays!\nGreat neighborhood bar. Recently remodeled. Great staff. Funny ass doorman and bartenders. Great owner!", "author": "Dustin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Great atmosphere, fantastic beer selection, super reasonable prices, pool table and kick ass music. What more do you want? Perhaps a less scary toilet... That's the reason for four stars.", "author": "Tera K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "I love TRAX! It's really the only dive worth talking about in the Haight Ashbury area.\n\nRandomly came across the place about a year ago and haven't stepped coming in since. It's one of my favortie places for getting daytime krunk! Cheap, really strong drinks. Great selection of gins, whiskeys, and bourbon. They're even going to start serving aged cocktails, so stay tuned! \n\nI always have a good time here. Trax-goers are super chill, looking for a no -frills-good -time; my kind of crowd. \n\nAlso, huge shoutout to Anthony! One of my favorite bartenders on the planet, best hugs ever! FIVE STARS :D", "author": "Krithika H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Just moved here to the Haight and this bar is two blocks from my house. It's super chill and the bartender that I met is super nice. Doesn't even feel like a gay bar - just a nice collection of all types. \n\nOther than that beer and drinks are super cheep! 2$ on Tuesdays and they have a bunch of different types of alcohol deals every night. \n\nDefinitely going to go here a lot and i fully recommend.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "Came upon this bar on here.  Javi is the best.  Walked in not knowing what I wanted except that I wanted something fruity(Im not a drinker) and he delivered. Made the best mixed drinks I've had ever at any bar. Atmosphere was very chill. My boyfriend and I were looking to barhop but ended up coming back after a round of drinks. Will definitely be back because Javi was very welcoming. Even when it was starting to get busy he took care of us. Got me drunk so that's always good. Plus the dirinks were very fairly priced. Lol.", "author": "Mey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "So we came here after going to the tattoo shop across the street because we heard the awesome house music that sounded like what we hear on the east coast and ended up staying until closing. The bartender Chris was great! Very friendly and outgoing! The crowd was great also and we made a lot of friends that we will hang out with on future visits! Drinks were very reasonable also.", "author": "Antoinette M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-04", "description": "You very likely lost my business after your bartender invaded my conversation, then instructed me to censor my language, as I was speaking truth about alcohol, problems, and the DSM V....How disturbing to  see a bar tender promoting AA, with little or no real knowledge of the subject(NIAA,WHO, Harm reduction therapy center ,etc.), or  of moderation and/or abstainet only programs in general- what a buzz kill lol... Educate yourself people! They seemed to be cool and laid back until this bartender censured my free speech: in a \"gay\" bar no less!(oh the irony) Come to think of it unless a patron is threatening or obviously wasted the bar tender's businesses is behind the bar.[period]", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "The bartenders are so nice here!! It is in a great location too. I didn't know it was a gay bar until I had been there for a while so take that however you want. Totally welcoming environment. Divey and funn.\n\nThey have a pool table too!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "Fun , lowkey, bar - neighborhood feel.. cool music - r&b, rock, ska  \ncheck your 'tude at the bar and you'll do fine. Cute boys & friendly booze-coots. Fun Women. Don't expect an NYC or LA Lounge & Model scene this is an SF tried and tru establishment.", "author": "Kenya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "+Love it. Mellow bar. Genuine staff. Decent pours. \n\n-Neighborhood folks & gays: Tuesday has turned into an obnoxious frat party -- \"This is a gay bar?!\" \n\n Wed-Mon is still good.", "author": "Brandon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "Cozy, people-friendly, dog-friendly :)\n\nAmenities:\nWi-FI, fishbowl of condoms, phone charger.\n$1 pool games, TV (movies, shows, sports games), strong drank (they bite back!)\n$1 peanuts, chips; outside food-friendly (late nite pizza, thai nearby).\nVariety of on point music: top 40s, MJ, Usher, Britney, 80s, motown, etc.\n\n\"powder\" room:\ntoilet seat gets detached sometimes. just pop that baby right back on.\nKey at the end of the bar! Keep it with you (not left in the door) so no one walks in on you.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-20", "description": "Bartender working last night repeatedly made lewd sexual comments towards my female friends.  This guy seems to think that because he works in a gay bar he can say whatever he wants to the bar's female customers.  This is not the first time this bartender has acted like this,  whoever owns this place needs to fire this guy.", "author": "Carl H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "I should premise this review by saying I'm a fan of dive bars. This place is dark, a little seedy, older crowd kind of place where you just sit with friends and get some drinks without having to wait in line or getting bumped all over the place. If I lived in Haight, I'd probably be a regular. \n\nOh and don't even think of bringing a Castro queen here!", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "OMFG Trax, you da bess! \n\nAdorable and attentive bartenders, cheap drinks and the perfect blend of weirdos. This place is awesome. A gay man I've only known for about 2 mins bought my friend and I 4 shots each and on top of that I had 3 beers. \n\nIt was St. Patrick's day, so the owner/manager handed out Irish sandwiches to everyone in the bar. It was the most precious thing I've ever seen! ^_^\nI am thankful because that sandwich helped me keep it together after 7 drinks. \n\nI'm rarely in the Haight but will definitely be back!", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "All the bartenders here are off the hooook!!\n\nBeen coming to Trax for a year now and seriously, this place is the shit.\nHands down my favorite bar in the Upper Haight.\nThe $2 Tuesdays will always make your wallet happy.\n$1 pool games are always cool to kill some time and screw around.\n\nAll in all, a great place to spend any night of the week.", "author": "True S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Stumbled upon this gem just walking by with my girlfriend not ready to head home to Fresno. ($3 margaritas on Monday got us) the bartender Oscar was friendly and had a great personality.  We ended up staying for 4 1/2 hours. We will be back for sure :) thanks for the great time", "author": "Niki P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "This place is the shit come here on Tuesdays great service, cheap beers. COME TU WITH THE SICKEST BARTENDERS", "author": "Coño R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "This place was one hell of a welcomed surprise on a Saturday afternoon. Not only was our service courteous, quick, and warm, the drinks are cheap and strong. The crowd here is fun and lively, the beer and liquor selection isn't huge but accommodates fine tastes as well as those after a bargain. \n\nI have found my perfect Haight bar. Say hi to Anthony, he's on top of it.", "author": "Kimi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "On my 1st visit, the bartender welcomed me warmly, then proceeded to pour me a vodka cranberry that was all vodka and only the slightest drop of cranberry.  Then bumped 90's music.  How f-ing awesome is this place!!  Looking forward to my next visit!", "author": "Caleb H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "Cheapest strongest drinks in San Francisco! We love this bar!", "author": "Kicker .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "I love it here what can I say. The drinks are strong the bartenders are awesome. I love coming here for $2 Tuesdays. It's been my thing for a long time. I recommend this bar to anyone visiting the area. Definitely one of my top favorites.", "author": "Krishna V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Im meam come on this place is amazing. Ive never had a bad time here and i love the crowd and bartenders. Extra love to javier! I always look foward to a drink after work and before heading back to the east bay here.", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "I live in Haight-Ashbury and it annoys me that there are NO good bars in the Upper Haight. Untill I found you Trax. Bartenders are amazing and Tuesdays $2 beers is all I need.", "author": "Jennifer V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "If you're looking for a perfect way to pass a rainy or bleak Sunday afternoon - come to Trax.\n\nThe bartender has a phenomenal collection of old school soul, rock, and Motown records - including everything from the Beatles to Patsy Cline, which he plays with a smile throughout the day.\n\nAnd with a pool games at a dollar a piece, you can just shoot away, while grooving with your cue stick to Sgt. Pepper's Lonely Hearts Club Band.\n\nIt's pure San Francisco magic.\n\nJust be wary of their five dollar Bloody Mary's - my pool companions were chugging water by the glassful - due to their overly spicy drinks.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "Their $5 Bitchin' Bloody Mary is brilliant, and delicious. Like spicy tomato hot sauce vegetable salad with vodka.\n\nI know, I know. My description is not the best, but trust me. It's legit. Anyone who fills their drinks 3/4 of the way with booze is a friend of mine.\n\nAlso, they have nice window seats so you can drunkenly leer at the sexy \"faux\" bums that hang out in the Haight. Not that I would ever do that of course. Definitely not. Not this Jillian.", "author": "Jillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-28", "description": "This was trhe best fag bar ive been to in the longest.  A bunch of great drinks and hot guys!! Thanks !", "author": "Albert G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "Throughly enjoyed my STIFF cocktails and the pool table at Trax! \n\nThe crowd here was def. a mixed bag, but being that it is a gay bar in the Haight, one can only naturally assume.. \n\nThe bartender Brad really made this dive super memorable! He was very attentive, friendly, and made an awesome recommendation when I asked for a \"pick me up\". Mandarin vodka and Red Bull? Yes puh-lease! Make that a double. The cocktail paired perfectly with the Real Housewives of New York City Reunion that was on the TV and the woman in the corner that just could not stop shoving her large breasts against the window. I'll totally pop back in for a quick cocktail next time I'm in the area. Thanks again Brad, you're a rock star!", "author": "Tate P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "My girlfriend and I made this our first stop last Monday after a morning of walking the streets. A2pm arrival, I started with a Bloody to die for.Great patons at the end of the bar and a few haunted stories about the guy in the picture when you walk into the front door. Great bartender that played requests off his Ipad. We left and came back at 6 before his shift was over and he bought us our first round. Cool place,we will be back.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "Great bar in the neighborhood, I love $2 Tuesday but come any day of the week. If I ever want a quick cheap beer with no attitude I go to Trax.", "author": "Aili P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "Let it be known (should all you *newbie* fans not have READ MY OTHER 300 REVIEWS) that I LOVE gay bars. Absolutely LOVE THEM. \n\nI'm a sucker for fabulous gay men, and so when Joe took me here after Magnolia I was pleasantly surprised. Super divey, so I could dig the vibe. \n\nThe bartender served us up some beers, and off we went to the pool table. \n\nThe next 10 games we played-- I ran the table a couple of times until I started fucking up on really, really easy shots, and next thing you know I'm losing and people are still letting me play out of pity. But irregardless, I still got to play.\n\nI had a game with this Irish guy that allowed me to show off some skillz, but he won. Twice. Said something about \"being able to play with someone who was good for once.\"\n\nExcept it's been months since I picked up a cue stick, and I got lucky. A lot. \n\nNext time I come, I'm kicking all of your asses. Just sayin.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "Bartenders are friendly and take care of you.  Drinks are well made.  The overall ambiance is welcoming and a bit in the alternative side.  People have referred to it as \"dark\"  but this has to do just with the lighting, not the overall energy. I have met several interesting patrons with great life-stories to share.  There is room for improvement in the video-selection for the TVs, not everyone watches sports.  Also room for improvement with the music selection.  Sometimes is good, and sometimes not so.  I am glad that this place is part of the neighborhood.", "author": "Julian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "Amazing place. Attentive bartenders, good priced drinks, fun mix of people. This place has pretty much become my living room, and I do not need to worry about pissing of my neighbors.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-03", "description": "Hey, do you know how fabulous Rachel F. is?  Oh, Joe C. told you?  He does that alot, it's kind of cute, really.\n\nANYHOW, so a bunch of us gathered here to celebrate all that is Rachel F.  \n\nWhile Ali, Ali's date in the mirror, Angelo and I waited for the guest of honor, we got to really check out this place.  And this place was really cool.  Where else can you drink WHILE watching the world's heaviest man get driven around on a flatbed truck on t.v. WHILE watching tourists point at something in the doorway?\n\nNowhere.  As I was avoiding the alcohol that night, I could not tell you the quality of the drinks, but that bartender ROCKED it, even after all of us showed up.\n\nToast one to Rachel F.!", "author": "Pam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-09", "description": "When I came here, I had no idea this was a gay bar! I was just impressed by the prices and drinks. \nThe service was just \"eh...\". The bartender was excited to see my guy's credit card, but said it was effed up that he didn't want an open tab. Like, okay. He was nice otherwise though.\nBut my $2.75 cosmo on the rocks was AWESOME. Admittedly it was my first time trying this drink, so my judgment may not be that reliable. Anyway, I enjoyed myself and the prices here.", "author": "Melanie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "Javie is the cutest new bartender. So sweet and attentive! I love Trax . Richard is great too. The owner knows how to hire people!", "author": "r m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-31", "description": "I just recently started going to this bar a couple months ago. I like the atmosphere, the drink specials and the location. It's more casual than the Castro bars I go to. Even when there aren't specials the drinks are very affordable. \n\nThe bar staff for the most part is great, with an exception or two. The bartender on Monday night is extremely friendly and fast. He remembers me every time I come in and what my drink(s) of choice are. No matter how busy it may be on Monday night, I never have to wait long for a drink. He always makes my boyfriend and I feel welcome.\n\nThe only complaint I have is the bartender on Saturday night. I've come in a couple times, and even when it's not busy it takes forever to get a drink. \n\nOverall one of my new favorite local bars! Thanks Trax!", "author": "Terry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "I LOVE Trax. All beer (tap and bottled) is $2 on Tuesday and I feel like I have spent an awful lot of time here because of it. \n\nThe bartenders are awesome and super nice and the crowd is awesome. It's divey and gay and half the time the music sucks but it doesn't matter! \n\nDefinitely recommend this place during the week for cheap drinks and a good environment.", "author": "Lucas W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "Excellent happy hour! Also has a pool table in the back.\n\nBartender was super cool, forgot to get his name though! Great prices and lots to choose from! Great happy hour! good stop for a pub crawl down Haight on a Friday afternoon!", "author": "Jerald B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "ANAZING bartender. So incredibly nice and flattering I would come back every Tuesday just to hear him sing.", "author": "Eileen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "Really great gay, dive bar in the heart of the Haight. We were staying in town for pride and this was a street over- so we stopped in and were pleasantly surprised. it was nice to be away from all the crowds but still among family. good beer, nice bartenders, cool place to hang out- what more do you want in a dive bar!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-06", "description": "Went here for the first time yesterday, the sign for $3 (YES $3 hello recession drinking) margaritas in celebration of cinco de mayo is what got me. The bartender was great, I think his name was Robert? I think that tells you how my night went. I started the night there and ended it there and Robert remembered me! \n\nFun music, ridiculously strong drinks. I need to come here on Saturday. My liver is anticipating 9pm-10pm.\n\nIt's a gay bar but kind of subtle about it besides the rainbows on the placemat. It's usually empty on weeknights besides $2 Tuesdays. (YES EVEN ON GUINNESS!)", "author": "Pearl R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "Trax Bar is the spot!  I always make a visit to the Haight-Ashbury when I visit SF, and I always end up drunk at Trax Bar.  Anthony is the man and I love to get him to drink with me.  He makes drinks dirty and cheap and he also knows some good obscure drinks that I am now a big fan of.  And if you haven't had his bloody mary, you are missing out.  I don't even really like bloody mary's but I have had quite a few, and his is simply incredible.  Great blend of flavors and the spice comes on slow and strong!  It's listed as a gay bar, and if you look around you'll figure that out, but it is in no way off-putting to anybody and I didn't even really realize it until after the first few times I came here.  It's simply a fun dive with a cool atmosphere, great crowd, and rad bartender.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-22", "description": "Was from out of town didnt know this was a gay bar, everybody was very nice and friendly. The drinks were inexpensive , the bartender was attentive and super SEXY always a plus !! Will definitly visit again when i visit Haight st.", "author": "Margaret G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "Walking down Haight on a lazy Sunday Afternoon, we see the $5 Bloody Mary sign and walked in.  Once our eyes had adjusted to the darkness we found a spot by the pool table.  \n\nNot a lot of seating but it wasn't that bizzy and music was being dj'd by the bartender, which was a nice mix of blues and jazz and not ridiculously loud.\n\nThe place was chill and had a nice mix of people, the bloody mary was outstanding, not just a mix outta the can, I was chomping on chunks of horseradish and a spicy pickled green bean, it's amazing what a good bloody mary will do for your afternoon.", "author": "Foxy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "We were on our way to brunch today and I had to pee something fierce.\nMama noticed the \"Bitchin Bloody Marys\" sign and we went in.\nNeeded a key for the 'customers only' bathroom so I had a shot of Jack.\nMama had a Bloody Mary.\nIt was pretty fuckin' bitchin'!\nI'll be back for another of those someday!", "author": "Barry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-12", "description": "It really doesn't get any better than Trax.  Still my favorite bar in all of San Francisco.\n\nMy usual time is Saturday night.  But I do love to pop in when aimlessly roaming the Haight and grab a quite drink and listen to some amazing tunes.  Jessica T. is right, Trax plays an amazing assortment of music.  Great taste.  I'm partial to The Mamas and the Papas, and listening to Bill tell the story about how Mama Cass couldn't sing until she fell off a ladder and hit her head and then suddenly was able to sing like a bird.  Love that BIll.\n\nCome here on Saturdays for one of the best drinks specials I've ever heard of, Progressive Saturdays.  From 9-10 all well drinks are $1, from 10-11 they're $2; and from 12-closing they're a mere $3.  Can't beat that.", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "This place was decorated super cute for Christmas with upside down Christmas trees. Just the FYI - When I checked in it said Gay Bar, but who cares, the beer was good, the bartender was nice, the music was chill and the pool table was all we needed for a good time. I would defnitely stop by again if I was in the area.", "author": "Kristin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-22", "description": "This is a regular stop for my hubby and I on our annual trips to SF.  I'm not sure why they call it a gay bar - I've seen all sorts in there.  Maybe we're just going at the wrong times.  (Not that it matters!)  Anyway, the drinks are good/strong, the prices are great, and the bartenders are friendly.  The pool table is fun, too, and the music is great.  One of our favorite \"dive\" bars in SF - but it's really not much of a true dive.  Just a local bar with a friendly crowd.  If we lived closer we'd be regulars!", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-17", "description": "I miss you Trax!\n\nWhile I lived in the Haight this was our go to dive. It will be irreplaceable. The salty characters, the friends, the cheap drinks, the lovely bartenders. It's such a perfect place. I will try to stop in whenever I can.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "So I came in here not knowing it was a gay bar, but was intrigued by the $3 margaritas for happy hour. The funnier part was that I still didn't figure it out after looking at the rainbow clock, the rainbow bar mat, the requisite super stiff but tasty drink, or the rainbow sticker on the door. However, the wang in a cocktail glass? Yep. That worked. I'm so damn dense sometimes.\n\nClassic dive bar here folks. Red lighting, a pool table, a chill crowd, and decent tunes make this a neat hang out spot for happy hour. Oh yeah, and solid $3 margaritas right smack in the middle of upper haight knock this up a star (I think happy hour goes till 7 on weekdays?). I'll be back when I'm sick of walking and could use a pick me up. BTW, insider's tip - the key to the bathroom is kept by the bar, attached to a plunger. That's right, just like at the gas station. It'll save you a 5 minute wait staring a the bathroom door knocking incessantly and wondering just what someone really is doing in there (like I was :)).", "author": "Sean C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-28", "description": "$2 for pints of beer on Tuesdays? Hell yeah! - and they got a great selection too. \r\n\r\nI don't care if it's a gay bar; for prices like that, I'd line up to dance the tango at the Blue Oyster.", "author": "Art O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-19", "description": "Happy hour starts way early, i think at noon! cant ever complain about that", "author": "John N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "Dive-y gay bar in the Haight. Cheap drinks, hysterical crowd, and super friendly bartenders that can make ANY drink you can think up.  There's a pool table in the back.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-22", "description": "Was exploring my new 'hood bars with Einstein and we staggered in here to play a game of drunken pool. After a pint sized vodka and tonic ($4 each) we stumbled out of there. I think Einstein won.", "author": "Mi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "A fun gay bar in the Haight.  Cheap drinks, $1 peppermint schnapps! Friendly and cute bartenders, fast service.  Casual, dive-y feel.  Small unisex bathroom. Good place to stop in for a drink if you are bar hopping.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "All I have to say is CHEAP ASS DRINKS!! HOLLA!! Where can you get $1-$3 drinks?? I'm so coming abck to gte shit faced. The crowd very nice gay guys :) I wasn't aware Trax is a gay bar.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-29", "description": "I enjoyed my evening at Trax!\nIt's a great place because it's kind of funky, the drinks are pretty cheap and the bartenders are fantastic; they let me dance behind the bar with them which made me a very happy lady. Even though it's a pretty small bar, they have tons of seating and a pool table in the back.\n\nThey also play really great music that definitely keeps the energy up and the booties shaking. \n\nEven though Trax is a fun place I need to ding them on one of the most important aspects..the bathroom. The bathroom is unisex, which isn't a problem. The problem is that it's disgusting and the stench is unbearable. \n\nOther than that, It's definitely a fun place with really great energy.", "author": "Denise S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "TRAX... the best place to have a drink when you want to hide from your friends from castro. cheap drinks and great service", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "I like this bar.  It's nothing fancy, but cheap, fun, and a great place to hang out with friends.  The pool table is a great addition.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-30", "description": "I haven't reviewed Trax yet??\n\nI love Trax! I have never had a bad time here. This is hands-down, my favorite Haight bar (sorry, awesome bartenders at Gold Cane. I love you too!).\n\nThe clientele will not bother you or hit on you. But they will dance with you and ooo and ahhh over your new bag, or your earrings. Teehee!\n\nThe drinks are dirt cheap and strong. They also have a really rocking Halloween party each year. Sometimes you get to watch cute dudes make out. Woohoo!\n\nThe bartenders are also quite a master team. They remember your name and are all cuties.\n\nIf you are woman in a relationship who wants to go out, get wasted, have fun, and check out a sea of hot ass without anyone getting the wrong idea, this is the place to be.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-30", "description": "So let's get this out of the way up front. I go to A LOT of bars and I have built up a pretty high tolerance for the shenanigans that go on in them.\n\nI also spend a lot of time in the Haight because  my kids go to school there and I'm an overly involved parent.\n\nSo, sometimes I'm stuck hanging  out in the neighborhood with an hour or two to kill between perfomances/parent teacher conferences/sport pick up etc.  \n\nThis used to be solved over at Magnolia during $3 Tuesdays, but last week when I gave the guy a $5 for me beer and I didn't get change back (Yes he told  me it was $3 Tuesday. Yes I've been going here on and off for the past 3 years), I'd say it's time to move on.\n\nAnyway this brings me back to Trax.  I've been here before with friends and it's a nice comfortable bar when going out with others, but lo and behold, it's also perfectly fine when you're by yourself.  The patrons are easy going, the bartenders are (shockingly) attentive and the beer is cold.\n\nWhen I was in today, it was $2 Tuesday (Yes, I'm usually in the Haight on Tuesdays. No it's not because that's when liquor seems to be the cheapest), and the place was busy.\n\nHad to wait a few minutes, but the bartender (shockingly) acknowledged me, was prompt with my beer AND (shockingly) acknowledged me when I left even though he was at the opposite end of the bar. Did I mention the beer was Big Daddy and was only $2?\n\nGlad Magnolia surrendered their spot in the rotation.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-29", "description": "My boyfriend and I wandered in here at 7pm on a Friday and had no idea it was a gay bar. Everyone seemed really chill, and there were lots of girls too, so I didn't think twice until I noticed the rainbows and the older guy who hit on my boyfriend. He was really nice, though, so we ended up staying and calling our friends to meet us there. \n\nThe cheap drinks and pool table didn't hurt either. The bartender made nice stiff drinks for us. \n8 drinks: $40. We will be back!", "author": "Jenna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-03", "description": "We came here as the first stop on our Halloween bar-hop night and almost didn't want to leave. \n\nThe fact that they use these short glasses that are used for beers in asia to pour shots in shows they mean business.  A drink at around $4 means you most likely aren't going to leave here sober.  \n\nWe ended our bar-hopping night with just two bars.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Had an awesome time!!!!  Fabulous bartenders, diverse and friendly atmosphere.      Everyone was fun, friendly, and having a great time!!!  I live 2 hours away, but I'll definitely be back!!!!!!", "author": "Leah E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "Some may not know this but Trazz was called the ?Mark Cocktail Lounge back in the 40's. It was the cool place to hob-nob. It's gone through many transformations since then and proudly boasts as being the oldest pub on Haight street. This is where out Haunted Haight tour ended. Our guide, Tommy Netzband, related a story of a haunting here, witnessed by the owner and employees, of the appartion of a man. While cleaning the pub out awhile back, they found a picture of the bar's patrons taken during the 40's. The man pointing at the camera is the man they have seen in there! Worth checking out over a pint sometime!", "author": "michael s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "I am pretty sure this is the last and only gay bay in the Haight.\n\n My friends and I like to stop here before heading to Hobson's down the street. You really can't beat $1 drinks from 9-10 and $2 drinks from 10-11! Score! The bartenders are always friendly and make a pretty strong drink. They have a cool mirror that runs along the wall opposite of the bar. We've had some fun drunkin picture moments with that mirror. I am pretty sure a lot of people don't know its gay bar. But who cares maybe it's better that way. \n\nAnywho, Trax always makes for a great start to the night. Just watch out those $2 drinks will sneak up on you later!", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-02", "description": "Got here early on Sunday eve for Ms. Rachel F.'s bday (Holla! Happy Bday darlin!). Quite a fun celebration. Since I was already in the neighborhood for a day party, I had Pam B. meet me early for dinner, then drinks. \n\nTrax was pretty empty but when I walked in, this smokin' HAWT blond was totally checking me out!! I knew it was a gay bar and I was feeling extra flirty. So I sit down, and she sits with me! OMG. I'm totally getting hit on by this chick! So I lean over to say something, right as she leans to me, and wouldn't you know we both said \"Hi\" at the same time! Jinx! You owe me a coke! OMG we're like twins. This is so funny... Oh wait... You are a mirror. DAMMIT. I'm so blond sometimes. (shhh! don't tell anyone but I totally took her home with me!)\n\nAnyways, they keep their wall of mirrors really clean so the place looks huge but it's not. It's tiny. \n\nYou need a key for the bathroom (like a true haight st. bar should). While it was clean, it smelled SOOOOO strongly like piss. It's unisex so when you sit on the toilet the urinal is like nose level. NOT GOOD. \n\nPeople here are friendly. There are the inevitable tourists who have no idea it's a gay bar - so fun to play with them. Drinks are strong. \n\nps- your welcome Joe C.", "author": "Ali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "Its been a while since I've been out drinking in the city. I can't blame it on anything other than just being too lazy to do the drive from San Jose. JZ and I went to Trax to help Rachel.F celebrate her 21st birthday. It was real fun meeting some of you sassy SF yelpers but no, I will not talk slower and no, I will not wear a kilt.\n\nTrax is your typical haight bar. Its not glamorous but its fun and welcoming. The bar staff were great. Especially Mr Tall Smiley Barman. They were exceptional at remembering my previous rounds, which changed radically each trip. I think they put magic sober-dust in the Guinness, because I just could not get drunk and believe me - I tried really hard. My only complaint would be having to wait in line for the one and only bathroom, even though I did enjoy watching the patrons play a quick game of  \"squeeze as many lesbians in a toilet as possible\".", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-27", "description": "This place is a gay bar (not that there's anything wrong with that) -  in fact it is the only gay bar on Haight Street.  That's a nice quality in a bar.  It's a little grungy, a little funky, a little divey, and generally a good place to go for a little anonymity.\n\nIt's also VERY close to my house, which is a nice quality in a bar.\n\nUpdate:  then there was the night we ran into two gorgeous French girls there . . . omg.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-03", "description": "How can I not love this place? Last night, a guy sitting by himself at the bar told me as I sat down...\"You're pretty\" and not in a 'I just want to get in your pants so I'll flatter you with lies' kind of way. He was being genuinely appreciative and it was oh so flattering and kind of made my already pretty awesome night. \n\nI've been here a handful of times now, and each time I walk out with stories to tell. The bartenders rule, drinks are cheap and strong, and although it's technically a gay bar, there is a wide array of different types here on any given night.\n\nI've been hit on by gay men, gay couples, and bi-curious women here, not to mention a certain highly intoxicated sweet older gentleman. And you wonder why I love this place?", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-19", "description": "My 3 favorite things about Trax:\n3. Beer is 2.50 on Tuesdays!  Where else can you get a pint of Big Daddy for that price?\n2. The touch screen game, which my roomie and I glue ourselves to for a little erotic photo hunt and a little tai-play and a little wordster...whoever \"Bttmbois\" is, we are gunning for you!  Watch your ass!\nand....\n1. BILL!  Bill is so completely awesome!  He plays the best music videos EVER.  And, as a gift to me, he played \"Oh Sheila\"!!!!  In addition to his awesome videos, he's also the coolest guy around and we are lucky to have him.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-30", "description": "My hot date and I decided to stop here on a shopping trip through the Haight.* We were in for a shot of jager and out within minutes on a late Sunday afternoon.  (Thanks Jessica T.!)\n\nThe bartenders were really friendly, including the tall flaming one with his no-sleeve t-shirt. His greet and goodbye was a nice and unexpected service perk that I didn't appreciate until it actually happened at a bar.  Why aren't more bars gay?\n\n* who doesn't like shopping buzzed? no hate mail, unless you hate shopping sober.", "author": "Alfred Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "I'm not gay but I LOVE this bar. They got cheap drinks and it's mellow in here. \n\nSometimes the boys will flirt but it's all good. It boosts up my confidence for the ladies!", "author": "Tyrone B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "1.00 Drinks.\n\nGot your attention?\n\nSee you there Saturday Nights for the pre-party drink specials from 9-10PM. It's how smart party people do it.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-19", "description": "Went here for Gregor's Bon Voyage after not having been here for about 10 years and you know what? Nothing has changed! Still a great dive-y gay bar, with a pretty chill clientle, cute bartenders and still only one bathroom (i'm SO sorry ladies). \n\nMy drinks were nice and strong, the bartender was just flirty enough and I met some great Yelpers there. We were obviously the life of the bar, so when things got a bit late, we decided to move on, but for a happy hour experience, it was everything I could have hoped for and remembered.\n\nI bet if I came back in 10 more years it would probably be just the same.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "Hellamuthafuckincheap!  oh, and Jack the bartender is also hellamuthafuckin' FABULOUS!  Thanks for being a sweetie!\n\nJager (sp?) shots are $4.25.  Which is cheap for Jager, since most bars charge up to twice that much for a shot.  And it's super-duper COLD!  \n\nY'alls just need to get here. :P", "author": "Karen F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-02", "description": "I think I've become immune to gayness (gay-mune?) because I live around the corner from this place, I've been a few times, and it was only the very last time that I was there that I finally got it. OH DAMN...this is a gay bar....sweet! \n\nSo I'm talking to these two guys, one is a makeup artist for a travelling production of some musical, the other lives in SF and has a dog smaller than my head, then it hits me...I'm ruining their game. Time to pack up and go home.\n\nSweet drink specials, cheap!", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-30", "description": "Allow me to break it down for a minute about Trax: The Everyman's Gay Bar.  Trax was the first bar I went to in San Francisco, and I never looked back.  It represents Haight street at its most real (along with the Gold Cane).\n\nOf particular note is their Saturday drink special: 9-10 $1 wells; 10-11 $2 wells; 11-12 $3 wells.   This event has paved the way for many an infamous \"Trax Saturday\", in which a well-intenioned pre-game turns into everyone completely FACED by midnight, because it's 9:57 and drinks are about to increase in price by 100%, so we better get five right now.\n\nSeriously folks, this is the spot.  Leave your sucka-ass friends at Hobson's and go get your Traxxx on.  Holla.", "author": "Adam F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-02", "description": "Stop #3 on our day drinking in Haight adventure. $2.75 cosmos, m-kay? That's good enough for 3 stars.", "author": "Lyn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "Helpful hint, straightYelpers:  there's a Trax in nearly every city of the US, it seems, and every single one of them is a gay bar.\n\nI used to come here after work almost daily when I lived in SF - you really won't find better drinks or a nicer group of people (on both sides of the bar).  Now I'm stuck with White Horse Inn *lament*.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-07", "description": "For years, I went here without any clue that it was a gay bar.  The reason I started becoming a patron here is because I stopped in one day while shopping and it was the first bar here in the city that served Stella before it became a hipster beer.  I lived in England for a while and it's known as \"wifebeater\" there because mainly the football hooligans drink it similar to the way Budweiser is the standard of all ex-convicts. (p.s- I also love Budweiser)  Anyway, so I took many of my male friends here, and one day my friend Phil comes up to me and says, \"Hey dude, I hope you realize you've been taking me to a gay bar all this time.\" and I was like, \"huh?\" \n\nSo the next time I went in, I guess I missed all the tell-tale signs. The large rainbow neon in front, the lack of female patrons, the overly sweet older men that frequented it and the insanely cheap drink specials.  Oh well.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-08", "description": "I had no idea this was a gay bar and I'm an inveterate hag!  Or maybe the crowd is more mixed on a summer weekday afternoon: a pack of writers, beefy frat types and the bartender, a white guy with dreads.  We gravitated to someplace open with cheap drinks.  Trax: uniting the peoples of the world.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "Me and a friend went to trax for happy hour and it was soooo cheap! Wells are only 2.75 and margaritas are only 3.75!  For the both of us for two drinks it was only 12 bucks! you cant beat that! \n\nThe only thing is that the wells werent as strong as I would like, and if they were they were hard to drink down, but you can always ask for more juice!", "author": "Stephanie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-20", "description": "LOVE...\n  Trax works me out every time.  Bill, Nathan, and Cade are the boys that I know, and they are all amazing.  They know what I like to drink, how to serve it quick and take care of a lady..zzztzt", "author": "Alicia Claire H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "Looking for somewhere cheap but fun on Saturday night. While all the dive bars in the Mission seem to charge cover for music or whatever on Saturday, Trax stands alone in charging $1-$3 for well drinks. I normally just grab a beer, but at those prices, I'll be drinking well drinks at Trax.  \n\nSecond, where else can you grab the pool table at 11pm? Started a friendly game which ended up including about 6 people, not too expensive, made some new friends, had an enjoyable night without feeling like there was a scene. Friendly to everyone, this place also has great music videos and a unique plunger bathroom key.", "author": "Anna O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-27", "description": "Cheap Shots and Bartender makes a mean bloody mary.", "author": "Tam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "I think they make one of the best Bloody Marys I've ever had and it only  costs $5 on weekends.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "Great beers, fun atmosphere, good happy hour deals.  The bartenders are friendly, and they play awesome music.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "A gay bar on haight... yes! Do people even know this is a gay bar? I dont think they do. \nThis place is a great spot to get a drink. Its not your usual gay bar. The music is not techno fed dance divas, its low key classic rock infused. The bartenders are not wearing trendy bedazzled t shirts. They are real guys, Some cute ones too =)\nGo here on a lazy afternoon to grab a beer with a friend. I suggest sitting in the front corner near haight street by the window. If you are lucky you can get one of the tables, sit, chat, and watch the people walking by.", "author": "Wes P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-22", "description": "Location is great, bartender was friendly all night...The place could use a bit of a makeover, but i was surrounded by amazing people...who cares about the place at those moments anyways?!!!\n\nOhhh, I got my ass kicked playing pool there, but oh well...good times only! Will surely stop by again...\n\nPS: And by the way..the word TRAX if translated to Russian means \"fu.....\"...how lovely, hah :-)))", "author": "Katja S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-13", "description": "Whenever I'm in SF on a Saturday night, my friends and I go to Trax.  Why?  Because the drinks are ridiculously cheap.  From 9pm-10pm they are $1, 10pm-11pm they are $2 and 11pm-12am they are $3 (that's well drinks, not sure what the prices are for beer).  Need I say more?\n\nOk, I will: the crowd is a mix of gays, straights, Haight kids, hipsters and everything in between.  They play music videos on TVs and I was introduced to a few new songs last time I went.  There's also a pool table in back.  The only downside is that the pricing schedule makes it insanely easy to get black-out wasted.  So, pace yourself and have a great night.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "Go. See. Bill.\n\nNow.\n\nHe's seriously one of the best bartenders ever. We had a great time with him last night when we were hella wasted. But seriously, I have never had a bad time at Trax. Plus the name reminds me of the record store from Pretty in Pink. \n\nAnd perhaps we were too drunk, but I swear our beer was only $2.50 each. \n\nIt's super fab. Go there.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "Great Bar for drinks after work or even a night cab. $2 Tuesdays for beers are awesome!", "author": "Erdmann R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-22", "description": "After encountering a cover charge at Club Deluxe, I walked over to Trax because they don't have cover and then I could spend more money on drinks.\n\nSat down at the bar, it's Friday night, the crowd was meager and stagnant, and the bartender...lousy. Being a former bartender myself, I know that a good bar is only as good as its bartenders. Any place can serve up a drink.\n\nThe bartender this Friday night was a pretty boy who was pleasant on the eyes but not charming with his attitude. There was no hint of a smile or interest when he asked what my drink would be. After my first drink things still seemed decent, I was chilling and relaxing. Time for drink number two. Bartender asks \"one more?\", yes I say, and I get something foul, certainly not what I ordered. After abandoning the bar for more than several minutes, the bartender came back and I then politely returned my drink for what I originally wanted. Sure, I got served what I wanted, plus major attitude. Hmm, bartender pours my drink wrong and then makes me feel bad for returning it? Not what I would consider a good vibe kind of place.", "author": "Foodie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-14", "description": "Gay bar for the everyman\n\nADDENDUM--Billy the bartender is THE MAN", "author": "Annie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-21", "description": "Such a fun bar.  My friend is a regular so I've been here a fair amount and always have a great time.  I don't really like the Castro gay bars. This place is more like a gay dive bar and I mean that as a compliment. Good company, good music. Pool table too! The bathroom is... ummm... kinda bad.\n\nThe bartenders know who to pour some stiff drinks too. Wow. And they allow dogs. Awwww... I love bar dogs. Get a seat by the window on a nice day. It's one of those cool windows that can totally open up to the street outside. Perfect for people-watching, bothering people and inviting conversation.\n\nFun story: My friend had his 150+ Sexual Partners Party here and he was carried down the street to Trax like Cleopatra. Good times. I wonder if that was the best entrance they've ever seen. I would hope so.", "author": "Laura V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-24", "description": "I love Trax and have since we got here in 2005. Every day/night we go there it's a good time and we've been there every New Years for the past 4 years - so love them! The bartenders are the best & I'd give them 5 stars, if it wasn't for Dan - he is the worst. He'll make you feel like shit for asking for a drink from him & then double-charge you & call you a liar when you call him out on it! But the other guys make up for him, especially Robert & Shando & Lee too! Also I do miss me some Joe!!!", "author": "Gwen V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "The bartenders here are so nice and friendly. It was quiet the few times I've been there (a Wed and a Fri-Sat), but I've been assured it's mostly busy (maybe I'm just bad luck?).\n\nThere's a pool table in the back, the bathroom is satisfactory and the patrons are adorable. It's a gay bar, very welcoming, the drinks are priced fairly and a cozy atmosphere.", "author": "Joh W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-17", "description": "This would be the nicest bar in town, if only it were a small fishing village on Lake Superior rather than Haight-Ashbury.  Similar day-is-night decor in terms of everything old and beat up, dark, cheap, red.  If you open your eyes and find yourself at Trax, here's how you can tell you're in San Franicisco -- friendly bartenders, decent enough alcohol selection, various local microbrews on tap.\n\nFor entertainment a pool table, a video bar game machine, a jukebox playing Prince oldies, and two TVs above the bar with subtitled reality shows.  For food?  Four of the best candies ever invented -- Reeses Pieces, Almond M&M's, Nerds, and Skittles.  But it'll cost you a quarter and you have to turn a crank.\n\nPleasant, reassuring.  I'm not exactly rushing to return but if I find myself outside and I need a drink I'll swing right in through the plastic wind guards.  Especially on Tuesdays, with every pint at $2.50 all night long.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-28", "description": "Cheap, strong drinks. \n\nAnd that is ALL that matters.\n\nBut if you must know, the bartenders are  friendly, the bar isn't usually crowded, and the bathroom is fairly clean. The music was pretty good too, a lot of electro and nineties alternative.", "author": "Vanessa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-13", "description": "Great bar. Can't believe I haven't been here sooner. Was with some friends when they mentioned Trax and, since I wasn't familiar with other than seeing it in passing, one delighted in the opportunity to tell me about the Saturday night drink specials mentioned in numerous posts below. In fact it was already 10:12 when we decided on Trax as our starting point and the girls were like \"oh! we've gotta go!!\"\n\nThe bear bartender Bill seemed stressed but nice. So I enjoyed a couple vodka sevens, talked with my friends, danced a little to the music (or, maybe just nodded my head a lot as there isn't a dance floor here) and, to top it off, ran into Richard and Jessica T (hey guys!).", "author": "Tara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "White Russians here are AWESOMELY DECEPTIVELY INVIGORATINGLY refreshing and creep up on ya! Enjoy the milk, vodka and kahlua! hic! PSST! If you ALSO come across any cute Russians... give me a holler!", "author": "Amit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "I've been going to Trax for a while--it was a friend's neighborhood bar--but we continued to go long after our friend moved away.  Bill is a wonderful bartender who shows his fabulous creativity in his birthday creations for regulars. He also has really fun music playing during his shifts (it's like my ipod is playing).\n\nTheir various drink specials Tuesday, Thursday, & saturday night are crazy. \n\nWhile of has become a bit more of a scene, it's still kept enough of its heart.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-25", "description": "I second Annie G -- the everyman's manbar.\n\nFrighteningly cheap well drinks means no matter what, someone in your group is going to be in for some trouble. Just hope it isn't you... but it probably will be.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-24", "description": "Interesting crowd, cheap booze on certain nights and the bartenders are pretty nice and converse with you...a lot. If the Haight had its gay version of Cheers, I am sure that it would be Trax.\n\nEspecially cool place to play a couple racks before heading out to the Stro.", "author": "James J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "i love this place but  it really depends overall on who you get as a bartender. there's decent music and good casual atmosphere and a pool table that is often open, and the drinks are really cheap, especially on saturdays.  i used to avoid coming in on weekend nights becasue the bartender was a jerk but i've been in a couple weekends this month and they have a new guy on who is excellent. \n\nthe bathroom isn't disgusting but it isn't that great.  but how much time do you really want to spend in the bathroom?\n\nBloody Marys are great.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-26", "description": "This is exactly the kind of bar I was looking for within walking distance to my apartment.  Wouldn't label it as a dive bar, but it's extremely casual, low-lit, with very good-looking bartenders.  It's the kind of place you want to go to grab a beer without being in a scene, or worry about being seen.  Good music playing, TVs to distract you, and a great place to meet up with friends.  Doesn't get much better than Trax.", "author": "CJ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-12", "description": "its a gay bar? \nwhatever, this place is great. a dive bar with a friendly vibe. great tunes and cool people. \nalthough i am a few blocks over this is my new favorite bar when i want to hide from the hipness of Divis.\nyeah, the bathroom is bad but thats a dive bar for ya. it encourages people to hurry the F up", "author": "Jorge E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-10", "description": "4 stars for the Thursday $2.75 Cosmo night, which is the only time I ever happened to go here.\n\nFunky 90's music, said token hot bartender, and lots of fabulous gay humor. What's not to love?", "author": "Veronica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-16", "description": "I love this place.\nCheap stiff drinks, chill vibe, great folks.\nThis is my favorite gay bar EVER!!!!!!!!!", "author": "Rebekah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "The world's most oddly located gay bar. What is it doing here?", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "Cheap and very strong drinks. Free pool too... Left my phone on the table and when I came back to look for it the bartender had it an gave it back to me; that was pretty cool... Place was empty when we were there, so we got our choice of music...", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-28", "description": "I've lived in San Fran for a dozen or so years and had never been inside this place until my posse threw a little soiree for me here before my European tour. It's smallish, but a very cozy neighborhood bar. The drinks were heavy-poured and the 'tender was attentive, so I dug it overall. Now I'm not one to schlep to the Haight much (only for Jim S.), but I would definitely come here again. P.S. Has anyone seen my pants?", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "Had the nicest young male bartender last night.  He took care of us well and provided amazing service.  Being in the service industry, I am a harsh judge on good service.  This young man was an A+.  Watermelon schnapps $1 shots didn't make me feel too great, but he sure did.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "How have I not yet reviewed the closest gay bar to my house in which to channel my inner fruit fly??? Damn. I don't even know how the gays can still hang out with me. I don't deserve another \"grrrrrrlllllllll, daaaayyyuuumm, those are some hot shoes!!!!!!\" whispered in my ear again. Not another breast fondle that comes strictly out of curiosity, not another foul and tasty grind on the dance floor while some horrible Madonna remix drones on in the background. Nope. I deserve to be confined to the world of straights who don't understand the importance of a tight tee shirt and why tops and bottoms are sometimes interchangeable and brunch and shopping are best done with lots of gossip and alcohol. \n\nBut, maybe, just maybe I will be given another chance if I beg forgiveness as take all of my gay friends for a round of drinks, or ten, at Trax next time they are shopping in my hood?? \n\nBecause Trax will get them drunk, especially since they have an insane drink special that goes something like this; 9-10 are dollar drinks, where my gays will still be shunning me as they squeeze their way to the back to play a game of pool while I sit up front lonely and sad. 10-11 they bump up to $2 and by then they might just come around and mooch a few more drinks off me as they show me the fabulous new jacket they got at Villains. 11 -12 the drinks go up to a whopping $3 and the crowd is mixed and maybe just maybe they will be liquored up enough, and I will, too, and they can touch my breasts while we dance to Erasure in this small run down bar of debauchery and booze. I will even give them some juicy gossip, the latest People with Christine Agullera looking trampy on the cover, and tell the guy at the end of the bar they think hes hot, even though there is a 15% chance he is straight, since this bar attracts a few straight people who like to drink on the cheap. \n\nBecause Trax is that sort of bar. Forgiving, cheap and a little bit dirty, just like my friends.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "I came here after work today to have after dinner beers since EOC in Cole Valley was way too crowded. I like this place! Definitely a dive, but not in that seedy, dirty kind of way. Just a very kick back place to grab a decently priced beer ($4), sit at a table by the window (fairly adequate seating, and not too crowded, but just enough people to make it fun), and watch 90s music videos. The bartender was friendly. Overall I'll come back again. I wasn't blown away, but it was a good \"locals\" kind of bar in the Haight.", "author": "Tatiana J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-08", "description": "Trax is A-OK. It wins points because very sociable \"DJ\" helped me sharpen up my pool game!", "author": "Luke M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-06", "description": "There are some gnarly fools in here, depending on the time and date. I've had some really enjoyable drinks with some neighborhoody folk, and I've also accidentally been privy to some dude's junk hanging out of his skirt. So it's a little yin, a little yang.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-17", "description": "This one-time strictly gay bar now attracts a more diverse crowd drawn by the friendly bartenders and relatively low prices. It's more of a neighborhood hangout than a destination, a stopping-off place between home and wherever it is you're going later in the evening. That you need a key for the restroom is a good thing, since it keeps the panhandling street trash outside.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "Nothing better than an $8 bar tab. Nice and chill on a Tuesday, got drunk while still being able to hear the person next to me. Didn't realize it was a gay bar, whatevs.", "author": "Irene P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-09", "description": "I. love. Trax.\n\nIt's raised my standards for all other bars. The drinks are cheap and VERY strong, the bartenders are extremely friendly (I love Shando and Joe), and the patrons are talkative. My boyfriend and I generally go on Tuesdays, Wednesday, or Thursdays (whenever we get the day off together, basically), so it's never super crowded when we go- we can always get bar seats. \n\nThe drinks taste good enough for me to drink, but I'm still down for the count after 3 or 4 (meaning after 12-15 dollars). I love their Cosmos and margaritas.\n\nIf you're trying to decide between this bar and another, go to this one. I've never ran across another one I've liked better.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "A friend introduced me to this place...THANK YOU.  It is a total dive bar.  Bartender was very attentive.  I had a jack & coke...bartender was very generous with the jack.....THANK YOU.  My friend had the bitching bloody mary and I would have to say it was bitching.  I would definitely come back whenever I'm hanging out in Height.", "author": "Natacha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-01", "description": "As far as gay bars go this one is pretty tame.  The music is appropriately dancey and loud but the sound quality is not great.  It also bears mentioning that this is a narrow bar. Maybe this works if you fill it with narrow, quiet people but the loud and boisterous crowd last night had it uncomfortably packed. Which brings me to another issue: noise. Couldn't hear hardly anything that anyone was saying to me and my lip reading skills are not up to par.  Little tip for all of you: The bathroom key is located at the end of the bar closest to the pool table and is hanging on a nail with a mini-plunger attached.  Don't wait for the locked door to open and look like a jackass like I did.  This is probably a fun little bar on a random uncrowded weeknight but it's just not my scene when it gets so crowded you can't navigate it.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "This is a gay bar? I honestly had no idea as I ordered my beer and sat down with my brother around 2pm in the afternoon. We were waiting patiently for our mother (who was shopping right next door). However, as I looked around it became more obvious: the rainbows on the clock, the 6 gentlemen sitting at the bar drinking cocktails, etc. Nonetheless, good selection of reasonably priced beer, good music (3 Iron & Wine songs in a row), a flat screen with sports, and a pool table. A decent place to relax and wait while your mother hits up every boutique on Haight street...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "You have to love a gay sports bar in the Haight.  As my GBFs are all regulars I pop in occasionally for the strongest drinks I have ever had.  The bloody marys are light pink!  The bartenders are sweet. My favorite is cheese night", "author": "M B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Went to trax many moons ago... but then in the more recent years met Robert - cool guy.  While I have not seen him for some time... was reviewing something else on here when this bar's name came up... long/short, I know that how good the bartenders are have a lot to do with how good the bar is... and how often you want to go back.  I know I go to a local pub not for the atmosphere but for the people and especially the bartenders...just cool.  So having known R - it made me want to try Trax again.   Just wanted to write here b/c the bartenders say a lot about how good of a bar it is...so when you go... ask for Robert and you're in for a good convo, probably a mean drink and off to a great night.", "author": "M. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-05", "description": "yes, i understand this is a gay bar. i was introduced to this bar by a gay man. surprise surprise. i really liked this place despite the sausage being the only thing in there. how can you not like a place where all the patrons have decided that you have a wonderful rack? (love those guys).\ndrinks are cheap, bartenders are cute (but alas dont like me in THAT way), and i discovered a fabulous shot called a cocksucker. this bar really isn't one of the types thats in your face, you must be gay kinda thing. its chill with good music and fun people :) i wouldn't mind being dragged in here for another round of cocksuckers... the shots. get your minds out of the gutter, people!", "author": "Aly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-01", "description": "I agree--this bar IS quite tame. I've only been 3 times, and the twice I've gone with friends, I've had very good experiences. (The other time was when my husband and I went there to have a quiet chat with friends...not sure what we were thinking. haha. Not the place for a quiet chat!) The people are friendly without seeming creepy--not sure if that has anything to do with the establishment itself, but it makes for a nice atmosphere. The drinks are cheap and taste fine.", "author": "Ramon E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-19", "description": "This laid back bar is a great place to start or end the night.  Being in the Haight, there's a fair share of grunge hipsters and rock-and-rollers. But this is really a community bar, so all sorts come in. The drinks are rediculously low in price for sf so come by and check it out.", "author": "Jorel P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-16", "description": "The drinks sux.  The service sux.  The decor sux.  The clientele sux.  The bum who was loitering behind me sux (and smells like poopies).  The music didn't sux and then they changed it and it sux.", "author": "Frankie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-01", "description": "my best friend and i go up haight every once in a while to shop. On a thursday, around 1pm, decided to get a drink at trax. Hella chill people. I didnt know it was a gay bar and so everyone thought we were together, but it was cool. cheap drinks. nathan is a hella cool guy too. he even took shots with us.", "author": "Maria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-21", "description": "Cheap pints of decent beer on a Tuesday (which happens to be my beer night in this fair city) can't be beat.  Cheers!", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "There's a pool table in back, the drinks are super cheap, and the bartender brought me a free refill.   Woohoo!", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-31", "description": "can i just say you cannot beat trax on mondays...  Mondays are Margarita Madness and it is just that.  Killer margaritas and lots of madness thrown in especially once you are on your 3rd or 4th one.  And to boot Nathan the bartender during the day is great.  Really nice guy and a really great pour.  So the next time you and some friends are a little in doubt about what to do on a monday afternoon.  Run don't walk to trax but hurry the madness ends by 7.  Cheers  L", "author": "larry w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "Bartenders were hot, too bad all gay and I wondered why it was ALL men in here.  Nonetheless I had a good time drinkin the chima, waiting in a 40 min line for the bathroom and then staring at all the beautiful untouchable men.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-13", "description": "I love this locals neighborhood bar!  It's nothing fancy, it's not over the top, but it's got history and dive charm. The only \"gay\" bar remaining in the Haight (although not very gay most of the time).  GREAT drinks and GREAT bartenders--gotta see Bill on Tuesdays and Saturdays, but everyone there is terrific at pouring, playing music, and conversing.  The crowd crosses the whole spectrum from locals, to tourists, guys and girls--a mish-mash of people thrown together in one space for a good time.", "author": "kyle w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-25", "description": "I like it here.  Except the last time I was here I inexplicably went shot for shot with a random gay gentleman and ended up pulling a wicked blackout.  That's not really the bar's fault.....but I'm going to blame it anyway.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-10", "description": "This was my bar of choice for about three months or so.  You have to use a key to use the bathroom, but that's a Haight Street thing, I think.  The bartenders are nice.  I have fond memories of it, really.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-02", "description": "Ah my favorite gay bar watering hole. I love it because there is always a seat and I like to be able to be gay in a laid back bar. Unlike the meat markets on Castro or in the Somaloin. Good people and the bartenders know my name. Makes me think of a gay cheers.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-05", "description": "This used to be one happening place.  It had a great party every once in a while.  Now it is your typical neighborhood bar.  It is great if you want a gay bar on Haight Street.  It is not so great if you are looking for a sleazy one night stand.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-30", "description": "My friend Cindy is visiting and she likes alternative stuff so we decided hey we'll go out on haight st.  We went kinda aimlessly, cuz neither of us have been out there before.  We stopped into a few places that had sports playing, but that didnt seem very haighty.  it was getting late so we went in one called trax.  the music was weird, sometimes electronic, sometimes more alternative.  she said she knew the music so i was happy we found a real haight st place. then she said hey is this a gay bar? and i said no.. we're in haight! then i looked around... hmmmm.... lol  oops!  it was hilarious to tell our gay friends when they got home from castro that we'd managed to stumble into the only gay place there...  cool costumes on everyone, interesting music, cute little dance floor, i liked it, not my great pick... it was not crowded, but had more people than all the other places.  good place to go if you want something different.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-05", "description": "I love Trax!  The boys are amazing... so nice!  I felt like I knew everyone for years!  I was trashed, so I don't remember the service or what I drank.  But I know I had fun!", "author": "Charlene R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-29", "description": "this place is nice, the people that goes there is so gentle kind and you can also and this is the best thing get on the HAPPY HOUR from 12-7 (i went on wednesday) and for 2.50 you can get good drinks i liked the BIG DADDY. the place is small  with a pool table the musica is ok the bartender was changing it and his service was great. and there is also a slot machine or kind of one but i try to play but i cant  but i checked somebody playing and looks good so ill try it the next time.", "author": "David m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-01", "description": "I visited this bar for the first time tonight.  The bartender comped our drinks since I had waited a while.  Nice!  Bathrooms are small, but drink prices a cheap!  A pool table in the back looks inviting...", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-15", "description": "A cool chill place to go if you want to grab a few bars and what not. The crowd is totally mixed which I love.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-21", "description": "I went to Trax bar for the second time ever yesterday, lured in by the \"all you can drink\" offer. I did not realize that it was a gay bar before I went in, but that became clear quickly after entering. Overall Trax bar didn't seem to discriminate and didn't feel hostile to the straight crowd, which is sadly my opinion of many of the cities gay bars.  The bartender was nice and had a great collection of random 90's music playing.  He filled up my cup several (about six) times, which was real, real chill.  The few things that were drawbacks were; the drunk bartender who I couldn't figure out if he was working and just doing a pathetic job (this was a different bartender than the one who filled my cup and played music), because he seemed to work there and would go behind the bar, yet he also seemed to being playing a lot of pool and not serving too many drinks.  If you are off the clock, don't stay around getting hammered at the establishment at which you work, and if you decide to; change your clothes so I don't take offense when you walk by and don't pay attention.  The other star taken off was for the lack of clarity in regards to the hot dogs which they had out.  When we walked in (my friend Kelly and I) we were told to \"help ourselves\" to a hot dog.  After about my fourth cup I did, then my friend Kelly came over and joined me.  Shortly thereafter the bouncer came over and told us they were three bucks a piece....If you are going to charge, put a sign up and don't only charge people who you don't know, that's shady as hell.  Overall it was a decent place, but I probably won't be back anytime soon.", "author": "Max R."}
