{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Overall had a fantastic omakase experience at Tsubasa Sushi. \n\nPicked the 12 pieces omakase $80/ person. The whole dinner took about 2.5 hours long. \n\nFood:\nMy favorite nigiri were the blue shrimp, scallop, snapper with uni on top, snow crab, chu toro, uni, wagyu. \n\nTheir fish selection is fairly on the leaner side and the flavor is on the refreshing side for at least the first 8 nigiri. The last few pieces were the more heavy/ buttery fish including toro, uni and wagyu (for free). \n\nOne thing I liked about the sushi is that the rice portion is very small.\n\nPaired this meal with Dassai. It's a very refreshing and slightly sweet sake. $35/180ml bottle \n\nAmbience and service: \nI sat at the bar and our sushi chef created a very fun experience for us. He kept giving me extra pieces of toro on the side to be funny and also added an extra nigiri with no charge. \n\nThey can also switch out any fish that you don't like and substitute it with something else.", "author": "Teresa Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "I ain't gonna lie, this is the best sushi I've had in my life. You can read my reviews, and yes I've said this multiple times. But tsubasa is special. It's in a classy enclave of SF, but without the classic SF uppityness. \n\nGreat cuts of fish, and no wonder they're Michelin rated. \n\nSuper amazing stuff. We go once every 3 weeks from Reno and love it all. \n\nSo now Tsubasa has the crown in our book, and beats out LA, SD, and Scottsdale.", "author": "Phil D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "I luv nigiris so much!\nThanks to the yelp that lead us to this fantastic sushi restaurant in Hayes Valley District. \n\nOmakase (12 pieces) was stunning and featured different kinds of fresh fish that all melted in your mouth.\n\nThe chefs were very experienced and knew how to use different kinds of sauce to elevate the freshness of the fish.  Each one has a unique taste, and the rice that bedded the fish was in good texture.\n\nDefinitely recommend to all the sushi lovers.", "author": "Regina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "We made reservations through yelp a week before however the day of, I had to add a couple more to our party. So I called Tsubasa Sushi and they were very accommodating and changed the reservations to 5. When we arrived out table was waiting for us and seated right away. The menu has a good variety of items including fresh fish. Our server was efficient in taking orders from every one and bringing out our beers and sake. We ordered the following:\n\nOmakase Nigiri: 12 pcs. Good variety smaller cuts of fish.\nOmakase sashimi: 15 pcs 5 different fish very good\nToro: really fatty and decadent topped with gold flakes\nUni with salmon roe: best dish of the night Uni is always better with just a little bit of rice (comes with a small portions of rice) the salmon roe was so fresh and texture tight. \nScallops nigiri: good\nAnkimo: small portions\nScallops roll: excellent the scallops were very fresh yesterday. \nSalmon skin salad: nicely charred salmon skin on a bed of greens\nChawan Mushi: very small cup of steamed egg custard comes with snow crab.\nSnow crab with seaweed and cucumbers OTH\n\nVeggies:\nGoma Asparagus\nCucumbers \nMarinated eggplant OTH\nMarinated tomatoes OTH\n\nDesserts\nYusu sorbet\nMilk Tea ice cream\n\nNice space, good service, a bit pricey in relation to portion size. Very good variety of fish and kitchen items. Parking garage 1 block away $18.", "author": "George F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "One of my favorite omakase experiences in SF without a doubt. The space is cozy and intimate; call ahead to make reservations, especially if you're coveting a seat at the bar (which you def should if you're doing omakase). \n\nFor omakase, there are three tiers, with the highest one being 12 pcs, which we both opted for. Tsubasa also offers some of the most reasonably priced deals I've seen for the level of quality and cuts served. Every single piece was fresh and loved the variety of more unique types of fish. Fan of the fish to rice ratio here. What we had listed below, and favorites marked with *:\n\n+Appetizer\n+Hirame*\n+Japanese seabass\n+Arctic char from Canada*\n+Baby yellowtail\n+Hokkaido scallop\n+Baby amberjack\n+Bluenose butterfish\n+Mackerel chub*\n+Chutoro\n+Japanese barracuda with uni\n+Japanese snow crab with miso*\n+Wagyu\n\nBonus points for the eggplant \"palette cleanser\" halfway through the meal as well as the delicious and aesthetically pleasing tomato balls presented at the end for a simple dessert. \n\nSushi chef here was on the less talkative side, though he did check in a few times to see how we were liking the cuts. Note that the omakase does take an extremely long time so plan accordingly. Ours lasted two and a half hours, which was a little too much for me. Even if I'm doing omakase, unless it's something truly special and spectacular, I want to be in-and-out in two hours or less.", "author": "Kell S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "We came here to fulfill our craving for sushi for dinner during our last trip to SF.\n\nFortunately, I made reservations on Yelp and was seated right away by the hostess. I'd recommend making reservations because this place seemed popular.\n\nWe were seated by the window and service was great. We were going to go with the omakase but decided to just order a la carte from the menu.\n\nWe ordered the following:\n-Chawanmushi (steamed egg custard): We ordered one with uni (sea urchin) and another one with unagi (freshwater eel). The egg custard was flavorful and soft. The uni was fresh and added a creamy texture and richness to the egg custard. The unagi was nicely grilled and added a great flavor as well.\n-Oshizushi (pressed sushi with chopped blue fin tuna with scallions and sesame seeds): This was served as 7 pieces of sushi with freshly chopped wasabi and some chopped daikon. The flavors were amazing and this was definitely one of our favorites of the night. I'd highly recommend it!\n\nNigiri\n-Muki Hotate (scallop)\n-Zuawai Kani (snow crab)\n-Kagoshima Wagyu (beef)\n-Japanese Uni (sea urchin)\n-Mirugai (longneck clam)\nAll the pieces of nigiri were really tasty! They served big pieces of seafood over a small bite of rice, which reminded me of the portions we had in Japan. \n\nDessert\nBlack Sesame Panna Cotta: The panna cotta was smooth. It was served with anko (red bean paste) and some matcha powder. I loved the taste and flavor of the black sesame seed. Great way to end the meal!\n\nOverall, I'd come back for some delicious sushi without having to pay more than $100 per person.", "author": "Lily Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "The master chef, Rich I believe, was phenom!\nSat at a table w my family last night at 5:30pm \nand ordered the WHOLE menu haha as usual how Persians do.\n\nORDERED: \n- POUNDS of fresh wasabi- heaven  \n- Salmon Skin Salad- Wonderful \n- 3 Seaweed Salads- Great yet too much sauce\n- Salmon Avo cut rolls- My sis approved \n- Spicy Tuna cut rolls- Also fam approved \n- Iwashi (Sardine) Sashimi\n- Lightly seared Barracuda w a dab of Jap Uni on top Sashimi- A MUST!!!!!\n- Arctic Char- Yum\n- Ocean Trout- Yum \n- Medai (Butterfish) Kama- yum but needed to be cooked longer \n- King Salmon Sashimi\n- Albacore Tataki \n- Hot Sake for my Uncle \n\nPro: WONDERFUL Server- Steven!! \n         And all Chefs \n         Tasty AF food\n\nCon: Food prep was a bit long", "author": "Cat Zaimi, M A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "I really want to like Tsubasa, but it was a bit of a let down after reading all the glowing Yelp reviews. I was excited to try the 12 piece Omakase, but for $80 I don't think the flavors warranted the price tag. \n\nWagyu, Scallop, and Toro were my favorite. Note that the wagyu was ordered separately and didn't come with the 12 piece Omakase. It was super high quality meat that melted in your mouth. \n\nLeast favorite were all the pieces of sushi with shiso leaves. They was a bitter flavor to the leaves that completely overpowered the fish. Furthermore, the leaves added a dryness to the bite of the sushi that made it unappealing. I don't think I would of minded it that much, but it wasn't just 1 piece of sushi that had shiso but multiple pieces maybe 3. I also don't think the quality of the fish was at high as other Omakase places I've been to, especially the halibut which I love, but unfortunately it tasted a bit salty. \n\nI've also been to Omakase places, where each bite was very thoughtful and seemed to build flavors on top of the next bite. Unfortunately Tsubasa didn't deliver the same experience.", "author": "Steve C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-06", "description": "We came here for one of our first omakase experiences. Made reservations for a weekend night. The restaurant was packed. Hot spot for date night. Not super fancy, so can dress nice, but still casual. \n\nIt wasn't my favorite omakase experiences tbh. Some of the fish selections were a bit too fishy. Like the mackerel and the sardine. Maybe it was just the selection of fish I wasn't a fan of. \n\nAnd then one of my nigiri pieces had a slight bone in it. Which then made me wary. I don't think that should be happening for the price you pay at such a high end restaurant. \n\nAny way I was hoping it was better, but not as impressed.", "author": "Lara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "(4.5 stars) Wonderfully authentic and delicious meal. Stopped in for dinner on a brisk summer night after seeing its Bib Gourmand status and it did not disappoint. Plus id you're more of a roll than sashimi person like I am, it's really not too pricey at all. \n\nThe basic rolls--like spicy tuna which was freaken delicious, like seriously adding soy sauce like I typically need to with most sushi spots would've actually detracted from it-- are super reasonable. The more extravagant rolls--like the holy crab roll aren't cheap but definitely worth trying. I actually preferred the simpler roll, the holy crab felt like a bit too much was going on and the crab kinda drowned out the eel, plus the sauce was more sweet than spicy while I was hoping for the opposite. That said though, still worth trying and absolutely worth stopping in. The miso soup alone will hit the spot.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-14", "description": "Fish is not fresh, hamachi is overcooked!\nToro is not fresh. I am not sure why is different from other post on the Yelp", "author": "Phoebe W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Excellent sushi and service! Nothing particularly special, follows the usual pattern, but the dishes were all delicious and the service was fantastic, and the price was reasonable. I'd definitely go back. The sushi scene here is so crowded and so competitive, it's hard to stand out!", "author": "Eater S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Overall nice. Fish is good quality, service is friendly. We had a few rolls, a few pieces of nigiri, and some appetizers. The nigiri were all missing something in their seasoning (not up to omakase style preparation, but better than average). Standouts were the chawanmushi with uni and the torotaku. The futomaki was tasty but a bit too loosely wrapped. The juicy scallop roll was a bit too monotonous in texture (could have used a crunch). I'll visit them again for sure.", "author": "Marie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "I'm shocked we never tried Tsubasa before (to be honest, I had doubts about sushi in Hayes Valley) but we decided to try a new sushi spot on a whim. So thankful we checked this place out! Made last minute reservations relatively easily via phone for 930pm on Saturday night, and we were seated at the bar. \n\nDefinitely go for the 12 piece omakase. Compared to other omakase options in the city, it's relatively affordable ($80) plus you get a lot of pieces (they give you a few extra surprises on top of the 12 pieces!) I really enjoyed the fish - incredibly fresh and high quality. The pieces from Japan were amazing and we had multiple varieties of toro/chu toro and uni in multiple preparations. Standouts included the cherry blossom salmon (wrapped in a cherry blossom leaf from Japan), toro (topped with gold flecks), Chu toro (came with a little extra), salmon belly topped with uni, and uni with Ikura. Everything was so tasty and really worth it! \n\nThe sushi chefs were super friendly, and we really enjoyed sitting at the bar. Would definitely come back again!", "author": "Sally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Hands down the best Omakase authentic experience I have had. I am always on a mission to find new spots and this is so affordable and palette teasing.\n\nThere were 3 chefs at the bar, and Peter was our main chef. He explained every fish: what it was and where it's from. \n\nMy favorites? Octopus, Scallop, Salmon. \n\nThe experience was a cherry on top for my boyfriend's birthday and honestly for the price tag, it's worth the extra $$$.\n\nThere are little appetizers dishes in between some of the courses which by the end of the dinner probably why I am soooooooo full. I almost could not finish and eat any dessert. \n\n\nThank you Tsubasa!!!", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "I loveeee this place, the service and the food!\n\nMy boyfriend and I came here for our anniversary dinner, and we ordered two 12 piece omakases and one sashimi omakase as well. The fish was AMAZING! The toro - OMG, melted in my mouth. The uni was so dang good too. I really enjoyed every piece that we had. \n\nOur server, Kristy, was really kind and really walked us through each plating. She was such a sweetheart and noticed every small detail that was going on. I didn't really like the wasabi in my omakase - she noticed and had it taken out from the rest of my plating. (i tried really hard to keep it OG but i couldnt lmao) The dessert was this locally made icecream (it was so good too! but apparently this changes from time to time~)\n\nShe also gave us a tip of sitting at the bar - that way we get our pieces one at a time instead of 4 at a time (when you're at a table).\n\nOverall I loved the 12 piece omakase the most and I'm definitely going to come back!", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "Had the nigiri omakase and it was pretty good. You can tell the freshness of the fish and the quality of the fish. I liked their pickled eggplant and cherry tomatoes if that's what they're called. Lol. Went here for drop-in since there were no more reservations available through Open Table and we were actually seated right away. Good place!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Amazing as always. Tried a couple of new items on the menu. The bluefin tataki and the carter roll were delicious. Also got to try some new nigiris they might add to the menu! \n\nChef Peter never disappoints :)", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "This review is long overdue, but it's given me the opportunity to say what most people can't - I've come back to eat here 3 separate times, and it deserves 5 stars every.single.meal. \n\nChef Chris & Peter are not only skilled behind the knife, but they explain each dish to you and WHY you are receiving them in a certain order. They take care to understand what your food preferences are, and if you are inclined to give them creative control - do it. Japanese food in the traditional way it would be served - how could we say no? \n\nThe previous time my friend and I dined there, we had just embarked on a keto journey (or at least I had), and she soon followed suit as Chef Chris proceeded to make us an entirely KETO OMAKASE dinner!!!! I couldn't believe my eyes. It left me so satisfied, and I didn't miss the sushi rice one bit. To be honest, I was almost ready to throw in the towel and forgo my keto commitment that day, but I didn't have to. The chefs delivered. That in and of itself is an example of how they will go above and beyond to make sure your time at Tsubasa is something that you will never forget. \n\nDo NOT leave there without asking trying their tiered tuna nigiri plate, in order from lean to fatty meat. Each piece is delightful, and has you appreciate each part of the fish.\n\nThey recently added Black Sesame Panna Cotta on their menu, and it's the best dessert I've had all year. My friend preferred the Green Tea, but I recommend ordering both and having your fill. You won't regret it. \n\nThanks guys. I'm officially addicted, and unfortunately disappointed in most other sushi places across the city. \n\nPS: and if you find out you have a surprise allergic reaction to shrimp after having eaten it for 28 years of your life, don't worry. They have Zyrtec on hand, so you can proceed with your meal. (hahahah we're not quitters)\n\n10/10. Can't wait to see you all again!!", "author": "Tiba G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "We've all had bad tastes in our mouths.\n\nIt may stem from losing money on the tables.  It may stem from failing a test, although you knew the right answers all along. It could be caused from buying something at full price, and watch it go on sale the next day.  Or it could be from being stood up for a meeting, or worse yet, for a date.\n\nI know at Tsubasa, bad taste will not be from the food you eat.  Bad taste won't linger even if you eat Iwashi, the rare seasonal sardine which has the strongest flavor on the menu.  If you're lucky, you'll get the Hokkaido uni with salmon roe on sisho leaf which will make you forget all of your bad tastes.\n\nTsubasa, I can't blame any bad taste on you...it must come from something else.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Delicious, relatively affordable spot for omakase in Hayes Valley. I stopped by Tsubasa after a Saturday evening Warriors game at Oracle Arena, and they were gracious enough to seat me with no issue even though we were running a little late. \n\nLoved everything we had but the standouts for me were definitely the chu-toro (everything tastes a little better when topped with gold :) and the uni with ikura.\n\nWould love to come back and sit at the bar next time!", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "I came across Tsubasa Sushi when I wanted to do Omakase in San Francisco. \n\nATMOSPHERE:\nThe place is a very modern, no frills kind of sushi place. No need to dress up compared to other Omakase places. \n\nSERVICE:\nThe service was impeccable here. We had a 8 PM reservation at the sushi bar and once we arrived we were seated right away at the side of the sushi bar which was the best seat of the entire place! Thanks Tsubasa! \n\nFOOD:\nThe 12 piece Omakase here was amazing! Each piece was perfectly made and the chefs described each piece as it was sit before us. They also gave us a few complimentary dishes here and there. We also ordered the steamed monkfish as an appetizer and we enjoyed that a lot. I've never had monkfish before and the texture of it reminded me a lot of ham which was quite surprising. \n\nThe 12 piece Omakase lasted about an hour and a half so if you plan on getting that make sure you plan well!\n\nThe chef that served us majority of our dishes also gave us a few extra pieces of toro which was amazing and so nice of him to do. \n\nThank you so much Tsubasa! I'll definitely recommend this place to any of my friends visiting San Francisco!", "author": "Belle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "[[ October 2017 Omakase - $95 total after tax/tip ]]\n\nCheap.\nHigh quality ingredients.\nFriendly chefs serving us.\n\nI always recommend sitting at the bar and so you could interact with the chef or at least see how he works. Ask for bar seating when you make your reservation.\n\nThe chefs described every piece they handed over and everything was super beautifully presented + amazingly fresh. \n\nWe received 12-ish pieces and I say ish because the chef gave us a little extra here and there, like he noticed we really enjoyed the scallop so he gave a little more or when he gave us toro, he also handed over a second little piece. My faves: scallop, chu toro, o toro, uni. Was also pleasantly surprised by the dessert which was a tomato? \n\nWill definitely be back.", "author": "Elvi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "The sushi is definitely top-grade and it's not cheap. I love Hayes Valley, and I'm surprised that it took me so long to try it. I was confused by the \"extra note\" when trying to make a Yelp reservation that they have seating times around 5:30pm and 8:30pm. But the part I missed was \"walk-ins welcome anytime\". Should have known. On Sunday nights, Hayes Valley is pretty darn busy and we were able to get seated at Tsubasa fairly easily. \n\nWe got the asparagus appetizer, 10-piece omakase, Juicy Scallop roll and Toro nigiri. The fish was amazing. You can tell how good a place is by their Maguro. It was melt in your mouth. I ordered the Toro towards the end of dinner because I had to try it. Splendid. \n\nThe staff is attentive and nice. So overall, I plan on coming back here.", "author": "Young Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Fresh sushi, great Omakase selection for the price $$! What a steal!  We sat at the sushi bar for our Omakase birthday dinner.  The head chef even threw in extra pieces because it was a bday celebration which was awesome and very much appreciated.\n\nMy only negative comment would be that during the entire duration of our meal, we didn't see any of the sushi chefs wash their hands.  \nYikes. Because of that one reason, I can't recommend this place to my friends.  If we are ever in the area, we will definitely come back and give it another go, but it was a bit unsettling for my stomach to see them handle EVERYTHING and not touch the handsink once.", "author": "Kay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "First time getting omakase! I believe they went up in price just a tad for the 12 course nigiri. \n\nThe chef started out with a yummy raw oyster. It was very refreshing. Every piece of nigiri was raw and unique to the way the chef prepared. They were all fresh and tasted superb! I was impatient with the process and I ordered a roll of sushi and it was too much (just a side note). Our chef wasn't all that interactive so our experience was lacking. He just tells the name of the fish and where they came from. \n\nIt was a good experience but I'd want a better interactions.", "author": "Vinh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "The fish here is remarkably fresh and the selection is far more diverse than what you usually see from a typical sushi restaurant. I think they do a good job importing some of the seasonal fish and keeping their menus up to date with the latest and greatest. Among the nigiri highlights were the tennen buri (wild yellowtail), kinmedai (goldeneye snapper) and the Sakura masu (cherry blossom trout). I'd ask for the shiso leaves to be removed from our dishes the next time I come, as the scent is particularly strong and pungent if you are not used to it. The Oshizushi also stood out from the specialty maki section for delivering a unique, fresh, and delicious taste; the juicy scallop rolls were some of the freshest scallops I've tasted in SF. \n\nService was a tad slow, we would receive our orders  with a bit of a delay, but otherwise a good experience", "author": "David Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Where in the bay area can you get a 12 course Omakase for 68.00?  Not that many places I'll  tell you!   We made reservations to come here for dinner after our broadway show.  The place is pretty small, so i recommend you plan ahead.  It's located right in Hayes Valley so parking can be a little hard.   The server seated us pretty quick and did a quick wrap up of the menu.  We both decided on the 12 course meal,and boy i did not regret it!   They place our sushi on one plate and piece by piece they brought it out one at time after we both finished.   I love the service here and i can't get enough of the uni because actually melts in your mouth.   Here are a few other things we ordered\n\nCherry blossom salmon- so good\nScallop Hokkaido - so good\nBlack snapper\nFlounder- my least fav\ntoro belly tuna- So good, also melts in your mouth\nBarracuda topped with uni- very smooth\nArtic something- \nKimbichi hamata\nbutterfish\nUni-The most amazing uni ever!\ngold line snapper\neggplant\ntotoro\ndessert- tomato\n\nif parking here wasn't so hard, i would come back more often.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Our experience was AMAZING. Staff was courteous and attentive. Food was even better. \n\nWent with wife and 2 kids. Ordered the Nigiri Omakase (12 pcs), Sashimi Omakase (15 pcs), Juicy Scallop Roll and the Rainbow Roll as fillers. Fish was fresh, the nigiri courses made sense. Palate cleansers were yummy, too. The green tea ice cream with rice cracker was a winner. Have you had a candied tomato? Well, time to try it here!\n\nHIGHLY recommended and would definitely revisit.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Tsubasa is surprisingly delicious. I was surprised I was able to snag reservations on a Friday, same day reservation, by phone. We arrived early but we were seated as soon as a table became free. We were seated in a spacious table and it was very comfortable. What we order was an bottle of Dragons might delicious sake they gave us complimentary crab sunomono, after that we order the Special Sashimi very good very fresh the assortment of fish which were beautifully plated could not recall all of the fishes since they were so many. We also order some seared salmon belly nigiri, unagi nigiri, The Holy Crab roll, and This chu toro square roll, and we finished it all with Uni dish served with rice and salmon roe. All in all solid 4 stars will be returning back to this delicious sushi spot.", "author": "Timothy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-01", "description": "I was in the area for smitten ice cream and was craving for sushi so I yelped this restaurant as it has good ratings. This place was so hard to make reservations and a fellow yelper was right, they never pick up the phone. I decided to walk in here around 5 pm and make the reservation for 5:30 pm. The second I walked in, I was kind of regretting because there was no AC in the restaurant... it doesn't really matter but on a 103 degree day in SF- everything matters. Since I already came here, I do want to give this place a try. I went ahead and made the reservation for 5:30 and was seated right when they open. The place was nearly half empty even though it reached 6:30. I think they limited the online reservations because they want to be available to walk-ins also. \n\nFor appetizer, we opted in to order their agedashi tofu and tofu salad as the server told us that it was their first day of serving it 9/1/17! The agedashi tofu $8 was just average/OK nothing special about it but the tofu salad $10 was pretty refreshing. My party and I ordered their omakase of 12 pcs nigiri $75/person. To begin the omakase, we got the crab meat over cucumber salad then the 12 pcs of nigiri with a fried eggplant to snack. We ended the meal with a soup we ordered as to what they called the special soup: red snapper collar soup $7/each bowl. The pricing isn't steep for its quality of fish but think of this omakase in a casual style way, you won't have to dress up for any dress code. Over all, the quality of the fish is fresh but the nigiri rice did not taste very authentic.", "author": "Sammi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Chill ambience, service top notch. Tried omakase twice, great experience with reasonable cost. Highly recommended if you in the neighborhood.", "author": "Yiran P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Fab sushi place - it has pressed sushi, which I know is not the same as the ones you get in New York, Vancouver, or Japan but for San Francisco, this is pretty unusual and definitely worth getting. Before nigiri, which was fast food sushi developed during the industrialization phase of Japan, pressed sushi was it - it's flavorful, generally consists of some sort of seasoning in the rice, and it's condensed and pressed so that the flavor is packed with the fish on top. A typical pressed sushi is mackerel sushi, but this evening on their dinner special they also had a toro pressed sushi.\n\nTheir omakase sashimi is very fresh and incredibly well priced for the neighborhood. The presentation was great. The daily special marinated fish was pretty to eat. \n\nI quite liked the house made tamago, slightly different than the ones you get from the ones that were from pre-made tamago. \n\nWhat I loved about this place is presentation. Everything on the dish is pretty to look at. And the quality of the fish is better than most. \n\nI think about the many sushi places I've been, most of them are just mediocre. The rice to fish ratio is not always good. The quality of fish and the variety of it also not great. This place has your everyday affair sushi and it has also a great selection of daily specials which makes you feel so very special.\n\nHayes Valley's food scene is very competitive, and I've been eating around here sine the late 90s to see some changes. I understand this place has been around for an year and half. I rarely eat at the same place twice, but this place will see quite a bit of me, as long as I can stay put for a while (which fingers crossed will be the case in October!)", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "12 piece Omakase for $68?! SUCHA STEAL!\n\nArrived early for our party of 4, 8:00pm reservation and we were seated instantly upon arrival. It was a full house with people waiting outside the restaurant. That's a good sign! Sat at the sushi bar and was greeted by the friendly sushi chefs Peter and John. We all opted for the 12 piece omakase and Chef Peter made sure to get all our allergies, likes, and dislikes before serving. \n\nOmakase Options includes: \n4pc for $20..... 8pc for $44...... 12pc for $68\n\nSTARTERS:\n- Crab over cucumber\n- Octopus over cucumber (for me cause i'm allergic to crab)\n- Octopus with ponzo, tobiko, and lemon\n\nOMAKASE:\n- (forgot) something with Plum\n- Madai Konbujime (red snapper)\n- Tako Ashi (raw japanese Octopus)\n- Kanpachi (amberjack)\n- Muki Hotate (fresh scallop)\n- Hirame (flounder) yumm, love the shiso leaf underneath! thanks Chef Peter\n- Chu-Toro (bluefin tuna) \n- Ika (squid)\n- Another kind of Hotate?\n- Toro Kama (so fatty, melted in your mouth and topped with these three gold flaked balls)\n- Uni and Ikura  (best for last. Uni was sweet and ikura was a burst of flavors)\n\nOTHER DISHES:\n- Nasu Agedashi (Fried eggplant in bonito broth)\n- Fried squid with matcha powder and salt? \n- This fried fish\n- Unagi Tempura from Chef John!! so delicious \n\nHonestly, I've been on a prowl for an affordable AND great quality sushi joint for a while and this place is IT! Lots of other good sushi restaurants in SF offers omakase's for $100+ and for less items, Tsubasa is one place that offers 12 pieces for a whopping $68!! woo hoo! From the fresh and delicious nigiri's to the great attentive service and friendly funny chefs, Tsubasa has really exceeded my expectations in terms of service and food and for such an affordable price. Both chefs are really knowledgeable and talented and they really strive to give customers a memorable dinging experience. Throughout our meal, we were well taken care of. The chefs explained every nigiri they gave us and we even had a few in-between complimentary dishes to help cleanse our palette (ex: eggplant in sweet broth) Everything was simply amazing! We even had the chance to \"kanpai\" with both chefs!", "author": "Anissa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "So the red sign outside makes Tsubasa look kind of tacky and cheap but the interior is modern and cleanly decorated, so don't be fooled like I was!\n\nGet. The. Omakase! They change that menu daily and when I went they had 12 pieces for $80 including one of their most expensive seasonal pieces of fish and a healthy portion of uni, it's a steal. The fish to rice ratio was great, which is to me a big portion of fish and a much smaller portion of seasoned rice. All of the nigiri pieces I had were interesting and tasty and the staff always asked how you liked the fish after so they could adjust the amount of wasabi or anything if you wanted, so nice! \n\nAlso they know the way to my heart, lots of mini courses/palette cleansers in between aka \"free stuff\" so that always makes me happier. \n\nDefinitely give this place a try!", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-23", "description": "The Failure of Success\nWhat a disappointment after my previous glowing reviews!  Again, I made reservation here prior to the Opera, expecting the good food and service wife and I came to expect.  However, there was something very different this time. We arrived here at about ten minutes before 5:30 PM, their opening time, and there was actually a line of about ten people waiting for it to open.  When it opened and we were seated, the restaurant was almost full, and people kept coming in.  Much busier than ever before.  We ordered the monk fish with ponzu sauce as appetizer, and as usual, wife ordered the deluxe sashimi ($80) and I ordered the Omakase Sushi 12 pieces ($80) that are served in four separate servings.   The Sashimi and my first 4 pieces of sushi came promptly, but then it took  more than 40 minutes for my second plate of sushi to arrive, which left very little time before the Opera.  I complained and asked all the remaining dishes be served immediately - it took at least another 15 minutes for the two additional dishes to arrive, by which time I lost much appetite.  Wife did enjoy her sashimi, but I felt my sushi was at best mediocre, unlike the absolutely delicious fresh sushi I used to enjoy here.  I doubt we will come here again at least for a long time (by which time I hope they will have mended their ways!)", "author": "Hoyle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "I was pleasantly surprised with our meal at Tsubasa sushi, definitely a solid pick if you are looking to stay in SF and stay within a reasonable budget. Most sushi is either on the cheaper end, or very expensive, and Tsubasa was somewhere in the middle. All three of us ate for about 40 bucks each, but we did not drink. The roles were standard size, and the atmosphere was perfect for a date, and right in the middle of Hayes Valley. I will probably be back again, and was happy with the experience I had.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Interesting place offering a nice omakase set.  Friendly chefs and some interesting combinations and flavors which is super great.  That said, the place could be described as homey or rustic...I would just say cluttered.  It does kinda offset the vibe here which is a shame.  Course if the trade off is cluttered and affordable vs sleek and expensive; we can just keep it cluttered. Either way, I'll be back.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Tbh, underwhelming. For $$$ non-fusion Japanese cuisine, check out Saru Sushi, which offers more attention to detail and significantly better taste. Try Kusakabe if you're willing to drop $$$$. You're going to spend a good amount on mediocre food at Tsubasa unless you want to leave hungry.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "They charge $25 for a bottle of sparkling sake that costs $9 in Japantown.\n\nNot much complaint other than that.", "author": "Tao Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "Quite disappointing experience for the price ($80 for 12 piece omakase) you'd expect professional service. Omakase was good  but mannnn was the wait for each piece unevenly spaced out and the longest wait between pieces was almost 15 minutes.  We were seated at the corner of the bar and we couldn't even see what the chef was doing because he was making our sushi with his back to us in the corner where the sink was - is that even sanitary? The chef who was in front of us wasn't the one serving us, super awkward. The first 6 pieces took an hour to come out and then the last 6 was half an hour. Like I said, weird time spaces. Good part was we got a few free dishes! But would I go back? Nahhhhh", "author": "Siri E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "I love this place!  The service is spot on... they're warm and friendly and extremely helpful with their not so normal selection of sushi fish.  They make me happy (more advanced sushi eater) and others too (rolls with ungagi and crab and things). I can't wait to go back to try  more.  \n\n\nAnd another time for a happy review.  My favorite restaurant in the city.   Worth any wait.  It's better than kusakabe and robin. Hands down.", "author": "Shannon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Very good sushi at a decent price, harder to find in SF than you would think!\n\nFirst of all, you must try the savory mochi appetizer. It is topped with bonito flakes and in a delicious umami broth. Just warm enough and melts in your mouth! Perfect amuse bouche.\n\nThe head sushi chef is definitely a character! He really made the experience of dining here for us! He's so funny and surprised us with so many delicious dishes. The toro nigiri was topped in gold flakes and perfect brushed with soy, with just the right touch of wasabi! The uni presentation was like nothing I'd seen before, so cute, and so tasty (small portion though).\n\nLeave Domo and Nara behind, this is where you can get the best sushi in the neighborhood.\n\nTIP: They seem disappointed when people order hot sake lol... just order cold and share with the chefs!", "author": "Kimia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "The omakase was amazing. 12 different nigiri's each had its own unique flavor that didn't require dipping in soy sauce. The waitress was very knowledgeable about each of the nigiri and explained to us what each one was. Saving the best for last, the uni was to die for. \n\nCame here on a Friday around 6pm. We did have reservations because it could get very crowded a little later in the night and especially on weekends. To my surprise it wasn't that busy when we arrived. It was a perfect time to come (although maybe we just got lucky) because it started to get crowded when we were finishing. \n\nVery reasonable pricing for a 12 piece omakase and definitely high quality fish!!!", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "You won't leave disappointed. I was definitely skeptical prior to making reservations because it was either here or Akiko (haven't been to either). Settled with Tsubasa because of the affordability. \n\nGreat meal; quality fish and superb service. I encountered a drunk man (seated at the bar) and he ALMOST ruined my meal. Thankfully, the head chef noticed and apologized on his behalf. The chef obviously didn't have to go out of his way but I appreciated it. Gave us a discount on our bill.\n\nOrder the omakase. I usually don't because I'd probably enjoy 50% of the chefs choice... but I took a chance and was glad I did. I ended up ordering several nigiri pieces too but was informed that some were already included in the omakase. They opted for other cuts of fish and I couldn't have been happier.\n\nI kept my expectations very low, but after dining in,  I would definitely recommend this place to anyone that's in the city looking for quality and affordable sushi.\n\nTsubasa takes care of you and your palate. Trust them.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Rumor has it the sushi comes from Tsukiji Market. We didn't have time for the Omakase, so we settled on a mix of nigiri and rolls.\n\nNigiri orders\nchu-toro - soft and not too fatty\nscallops - super soft. almost melts in the mouth.\nuni - soft and creamy type. tastes extremely fresh\n\nRoll orders\nCrab roll - real fresh crab. Unagi on the inside was soft and not salty. tastes fantastic together. \nScallop roll - comes topped with lots of scallops that taste good, but obviously not as good as the nigiri.\n\nService was excellent. They made sure we were confortable and even let us know that the nigiri would be coming slighty late.", "author": "Edward W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Came here with a friend to try out their omakase meal. It was my first time ordering omakase as it is quite an expense, and I must say, it was most certainly an amazing experience all throughout!\n\nTsubasa Sushi has a nice modern and clean look to it and very friendly service. They did an excellent job with the pacing of the meal and with explaining what each course included. With that said, let me go through what went down with the omakase meal.\n\nPrologue: The Cubular Joy\n\nThe meal began with a humble cube of tofu, but with a slight twist. It was seasoned with some black sesame for a bit of sweetness to this cold dish. Loved it. 5/5\n\nChapter 1: The Snaptastic 4\n\nSo here we have the first four pieces of nigiri: flounder, char, snapper, and amberjack. The amberjack surprised me with it's surprising burst of flavor despite its light color. The char was also a highlight of these four as it had the skin in tact with some lovely fish oil. Good stuff. 5/5\n\nChapter 2: Chu Chu Chutoro\n\nThe meal moves on with another four piece of nigiri: scallop, chuutoro, flying fish, and mackeral. The scallop came in a nice chunky size and was the best scallop sashimi I've had on this side of the Pacific. The chuutoro was the easy winner here. The fatty tuna deliciousness that it is simply melts in the mouth for a timeless experience...... or so I thought because what came later proved me wrong. Aww yeah. 5/5\n\nBonus Chapter 1: NANI?!?!?! ... ... ... AAAAAAA~~~ SUGOI DESU NE!!!!!!\n\nSo we're pretty much halfway through the meal. If this were a novel, this is that part in the middle where they insert the pictures. Here, it is in color with 4K definition physical pages. The server comes and gives each of us a complimentary small bite of eggplant. It comes in a small bowl with a bit of broth beneath and a few sesame seeds sprinkled on top. At a first glance, it kinda comes off as being soggy and mushy like it has been soaking in a bath of something for too long despite it standing up as a solid entity. Looks are quite deceiving as this piece of eggplant was stupidly good. I legitimately was raving about it after the meal. Something about the flavor of the broth intertwined with the flavor of the tubular vegetable was just so right. Wowsers! 5/5\n\nChapter 3: The True Toro\n\nAnd so the last set of nigiris arrive: wild cherry salmon, barracuda w/ uni, and toro. The wild cherry salmon was quite simply salmon on a whole 'nother level. The toro was quite simply fatty tuna on a whole 'nother level with its crazy melts in the mouth goodness unlike any other. The barracuda w/ uni was quite simply.... actually, I have no idea what a barracuda is or normally tastes like, but this was also super good with the buttery uni going in harmony with the savory fish. Best of the best! 5/5\n\nBonus Chapter 2: Chawhattawhattawhat?\n\nWhen we ordered the omakase meal, we also decided to get an unagi chawanmushi appetizer. It's basically a cup of steamed egg with small pieces of eel mixed it. It was certainly good though difficult to share. The egg came out with a nice smooth and silky texture to make for a delicious cup of goodness though it all really paled in comparison to the omakase meal. Pretty good. 5/5\n\nChapter 4: Explosive Fireworks of Flavors\n\nTo end the meal before the dessert, a bowl filled with uni, ikura, and some greens were placed in front of each of us. Each bit of ikura would burst in the mouth with wonderful fish oil. Each sliver of uni was a buttery indulgence. The greens helped to tame the explosive flavors and went well between each bite. Yeahyuzz! 5/5\n\nEpilogue: Sweet Sweet Plump Plump\n\nThe entire meal ended with a candied tomato per person. It comes in a bowl sitting on top of some sweet liquid. The skin has been pealed off, leaving but a clump of tomato meat. It's a nice bright red to look at and they add a little green thing on top as a decorative piece. It is sweet and sour like a typical tomato but with a higher emphasis on the sweet which really does make it taste like a candy but with an interesting texture. Nice! 5/5", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Tsubasa's a solid option for a mid-tier omakase, cause sometimes you wanna #treatyoself to something special but you also want to be able to feed yourself for the rest of the month. More like a 4.5, but rounding up. \n\nOf course we had to go with the 12 piece nigiri omakase for $68. From the pictures you'd think that this place would cost an arm and a leg - nope! I was really impressed with the presentation, you can tell each slice, garnish, sprinkle was done with care. Everything on point. \n\nHere's what we got: \n1. Houbou (wild bluefin sea robin)\n2. Iwana (artic char)\n3. Madai (red snapper)\n4. Kanpachi (amberjack)\n5. Ma Saba (fresh Mackerel) - standout\n6. Shirauo (wild ice fish) - this one was pretty unique since it was steamed \n7. Chu toro (bluefin tuna belly, medium fatty)\n8. Muki hotate (fresh scallop)\n9. Katsuo (bonito)\n10. Uni kamasu (barracuda) - another one of the standouts\n11. Toro (black fin tuna belly, fatty) - fatty melt in your mouth goodness with dat gold flake, omg\n12. Ikura and uni\n\nAll seasoned already, so no soy sauce needed. There were a few standouts and a few we were 'meh' about (like the houbou which we thought was chewy). We also ordered akamutso (wild blue fish) a la carte at the end which was fuego. \n\nThey have a very extensive selection of fish here, highly recommend if you want to try stuff you can't find at average sushi restaurants! So safe to say that Tsubasa is not yo average sushi restaurant.", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-26", "description": "Got sick after eating here (2nd time) and it lasted a while. I just saw that their SF restaurant inspection is low (81) and they were dinged on 6/1/18 for (1) High risk food holding temperature, (2) Foods not protected from contamination, (3) Inadequate and inaccessible handwashing facilities, (4) Wiping cloths not clean or properly stored or inadequate sanitizer, (5) Unclean or degraded floors walls or ceiling. That explains why I got sick. Not acceptable, and even less acceptable for a Japanese restaurant serving raw fish where hygiene & quality control should be a top priority (good sushi restaurants usually have a score near 100). Other reviews mention a Chinese owner or sushi chefs. Sub-bar quality compared to Japanese sushi chefs who are meticulous about the fish & process. Too bad because we loved it the first time - but not worth getting sick. Old review: Fantastic sushi and excellent service. I'm extremely picky about sushi and only eat it if it's prepared by a Japanese chef (you know why if you have the same standards). We ordered nigiri from the special chef-recommended list that tells you where it comes from and all were great. Fresh. Great texture & flavor. Perfect seasoning (subtle and didn't need any soy sauce). The highlights: Baby Hamachi was OUTSTANDING. Loved the special miso soup with fish, which had rich flavor with ginger. Spicy tuna roll was good too. The service was great and everyone there so warm. We didn't have any wait to order or for food to arri. Perfect all around.", "author": "Ruth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Super fresh, super yummy! A lot of unique dishes that I didn't see in other Japanese restaurants.", "author": "Mei P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "I came here during lunch for some delicious Chirashi which was $18. Everything else on the menu was pretty pricey.\n\nThe fish tasted extremely fresh and I heard they import their fish from Tsukiji fish market in Tokyo, which is pretty cool. It's probably one of the better places in SF for sushi. It's a pretty small place that was kind of busy when we were there for lunch, so I can imagine this placing being packed at dinner.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Food: 4/5\nService: 5/5\nAtmosphere: 4/5\n\nWhile on a short trip to SF, we stayed very close to here, and I came here two nights in a row, it was that good. The first night, we were just walking by and decided to check it out, and they were able to seat us within 20 or so minutes, which was really great. We ordered the omakase, with some extra add-ons as well. I actually didn't like the omakase that much, but it is a relatively cheap one at around $70. It just felt like the order kept jumping around a lot, and could have been ordered better. However, if there is one thing I could recommend more than anything else, it would be the House Toro roll. It. Is. So. Good. SO GOOD. Wish I could eat it every day. But yeah, would recommend you stick to more rolls or ordering individual nigiri when dining here; it's rare that I would recommend the rolls over the nigiri at any sushi place, but I definitely think that's the play at Tsubasa.\n\nService could not be better, everyone is so courteous, and our water glasses were never low. Appreciated their attention and friendliness! A point off of atmosphere because the restaurant is a bit cramped at some points, you will definitely feel like a part of your neighbor's conversation.\n\ntl;dr - Can't wait to go back for that house roll", "author": "Whitney G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "We got the Sashimi omakase set + negitoro + AO ebi + muki hotate + king salmon nigiri + japanese uni + oburi toro + saba aburi.\n\nWhat didn't go well: sashimi omakase. The pieces there were so bland and really had no flavor IMO. Things included was yellow jack, red snapper,... overall nothing fancy. I didn't enjoy it and felt like I wasted both money and stomach space.\n\nEverything else was tasty. Will describe in order of my preference.\n\nUni: I'm trying to get into uni and this uni didn't have that much \"pungency\". Overall not that large and didn't really stand out IMO.\n\nThe hotate (scallops) was quite interesting. We got the sashimi version and there were 4 pieces. What I noticed were they were a bit firmer than some of my favorite ones. When I bit into it, it felt like there was no give. Maybe I just like mine a tiny bit chewier (those seem more fresh to me).\n\nThe saba aburi was mackereel with some finely grained radish on it. It seem like it was marinated in some sauce and maybe smoked a bit. The combination made for a really good bite.\n\nOburi toro: This was a hamatchi fish and it was interesting to see the fatty version of it. IMO, if you want a fatty fish, just get the fatty tuna. It was tasty no doubt, but when I know what the bar is for the fatty tuna, it just couldn't quite hit that one.\n\nAO Ebi: The deep fried head was really good. I didn't think it was deep fried so much that all you get is crunch, and you can really taste the meat in the head (which I enjoyed). At the same time, the whiskers??? were crunchy so there was a nice balance. The actual shrimp itself I thought could've been a little bit more raw. They cook it a bit I think (3 seconds). I'm used to and prefer when it's more slippery and raw. \n\nTop 2\n\nKing salmon: Just great salmon. It wasn't a fatty cut, but it really did taste a little fatty. It was so soft to bite/chew. Wish I got more of these.\n\nOshizushi Negitoro: wow this was good. It was a layer of fatty tuna (seared at the top, raw at the bottom) on top of a layer of rice. Really enjoyed the combination of seared + raw as well as the radish that's provided for it. Knew the tuna was superrrr fatty and the rice helped to make it easier to go down since it helped balance the fatty part.\n\nAlong the way they gave some free snacks: some crab samples + marinated eggplant + sweeted tomato.\n\nStick to the \"main\" things and not the generic items and you'll be happy here.", "author": "Victor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Wow! I don't get impressed by restaurants very often, but I was thoroughly surprised by this restaurant. The fish here was unexpectedly fresh and high quality for how much they cost.\n\nOur table of 8 ordered the following for the table: 12 bottles of sake, a ton of appetizers, 12 piece omakase for each person, multiple rounds of uni and masu, and a bunch of other stuff. The thing that stood out to me was how incredibly fresh the fish was. The few that stood out include the uni, masu, and hamachi. The masu was one of the best I've eaten because it was ridiculously fatty, and I'm pretty sure I ordered at least 6 pieces for myself.\n\nThe service was a little bit slow, but we did order omakase for a ridiculous amount of people, and the quality was worth the wait. I'll definitely be coming to this place in the future.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Thick fishhh, little rice combo. And a mouthwatering wagyu (my bf said that). I did a DIY omakase order. In other words, I ordered each nigiri myself after I wasn't impress with their omakase list. Get: Salmon both wild Alaskan and the regular salmon. Otoro (fatty) with the gold shimmers. Hamachi from JP. Wagyu!", "author": "Proud C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Reel sushi restaurant. Tako ashi (raw octpus) was a real surprise. Uni was interesting , good though. The taste of sushi rice is perfect. The ratio of the rice and the fish is great. This is the place I will return for sure.", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "How did this restaurant even get such high reviews....we ordered omakase and we had to wait about 30 mins between each dish....it was torturous! We all started watching YouTube...how were we supposed to enjoy the food at all when we ended up just wanting to chunk down any food just to fill our stomachs...finally the picture is my water, which never gotten refilled even once during our painful 2 hour wait...Make sure you download a few movies and bring your own drink before deciding to come here!", "author": "Leo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "Where do I even begin? One of the best miso soups I've had is from this place.\n\nTheir lunch bentos are top notch but their sushi is even better. The bluefin tuna are so damn good.\n\nI got the two specials: chu-toro tataki & oshizushi negitoro.\n\nConsidering they are both made with bluefin tuna, I assume the \"specials\" at Tsubasa just indicate that they are new dishes the chef wanted to show off that day and not exactly a limited quantities type of special. Regardless both were very tasty. Everything was seasoned properly and the fish just melted in my mouth. Ugh I am getting hungry writing this. If you're in the area and craving sushi, I would highly recommend this place.", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "I sat at the sushi bar and had an omakase dinner. All the sushi pieces were nice but not very memorable. \nThe three sushi chefs were very casual, joking around and throwing the fish pieces around.\nThe wait staff were very sweet and attentive", "author": "Renin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Woah - best sushi find in the city - for real. The lines can be long (make a reservation - they're very accommodating!) but it's a 100% worth it. We did a no-shellfish omakase and it was truly incredible. They brought it out 4 pieces at a time over the course of an hour and each nigiri was better than the previous bite. Incredible presentation and even better taste. They also gave us the yummiest sweet tomatoes (sounds odd but was so good) to finish the meal. I'm definitely coming back here to try the rolls!", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Updated review:\n\nWe dined at Tsubasa again for dinner and as always, the meal was delicious. We dont typically order anymore since we trust in Wilsons recommendations. Omakase is always the best way to go here! \n\nMy two favorite fishes of the night were kanpachi and ma saba. Both very thick but so delicious! Rule of thumb- always order uni last. \n\nChef Wilson numbed our tongues before giving us the exceptionally fresh fish. The food is always incredible here, but I would definitely say that chef Wilson is the main reason I continue coming here and referring my friends and family here. During our meals, he is very friendly and always gives us recommendations on the freshest fish options. He teaches us about the different types of fish and preparation. I come here 20% for the food, but 80% for the experience and Wilson makes my experience worth it every time. \n\nRead below to learn about what we ordered: \n\n- Sesame tofu\n- Zensai sanshu - right to left in picture yamakake, ikura oroshi, ankimo\n- Omakase:\n- Shiro dai kobujime - White snapper marinated in kelp from japan\n- Iwana - artic charr\n- Kanpachi - Amberjack from Japan - OH MY GOSH!! So good! \n- Ma saba - wild fresh mackerel from japan - also really good!\n- Sakura masu - wild cherry salmon from japan\n- Nasu agedashi \n- Chu-toro - black fin tuna belly \n- Muki hotate - fresh scallop from japan\n- Sumi ika - wild cuttlefish from japan\n- Suma-gatsuo - wild skipjack bonito from Japan\n- Uni kamasu - wild barracuda with uni from japan\n- Toro - black fin tuna belly fatty \n- Fried barracuda\n- Shimaaji - yellow jack from japan\n- Mirugai - live giant clam \n- Atsuyaki - blue shrimp soft sponge cake\n- Uni ikura - always a must to end your meal!\n\n\n------------------------------------------------\n\nTsubasa does not ever disappoint. \n\nWe came and dined for dinner and had to have the omakase. See below for more details of our visit. \n\n- sesame tofu \n- 1. Onagadai kobujime - Red snapper from japan\n- 2. Iwana- Artic charr, canada\n- 3. Hiramasa - wild king fish from japan\n- 4. Sagoshi- Baby spanish mackarel, japan - stronger flavor\n- 5. Ankimo umi masu - ocean trout, scotland topped with monkfish liver\n- 6. Kanpachi- Amberjack, japan\n- Nasu agedashi- fried eggplant in sweet broth, chilled\n- 7. Chu toro- med blue fin tuna belly \n- 8. Muki-hotate - fresh scallop- yaaaaaas!!! \n- 9. Managatsuo - wild star butterfish , japan - melts in your mouth but texture is not very smooth, rough\n- 10. Kamasu- Barracuda topped with sea urchin\n- 11. Toro - black fin tuna belly, fatty, - another one of my favorites!\n- 12. Ishimochi - white wild croaker, japan\n- Oshizushi- negi toro pressed roll\n- 13. Uni\n\nThe attention to detail the chefs take to prepare the sushi is notable. They really pour their heart into preparing each dish. \n\nThe servers at night were different than the lunchtime servers. All of the wait staff was attentive and friendly and even better than the ones during the lunch hour. \n\nI am elated with my experience dining here once again, and for dinner for the first time. I love sitting at the bar and watching the chefs work their magic. \n\nWe always have great conversation and learn so much about the various kinds of fish from Wilson. He makes our experience worth 5 stars and the reason why we continue referring our friends and family here.", "author": "Claire W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "This was a little biased rating. I came here with really good company so I feel like I naturally had a good memory associated with this place. \n\nFirst of all, service is SPECTACULAR. I scored a last minute reservation online and when I arrived 15 minutes early, they sat me at the bar (as I had requested) where two seats have been reserved for me and my friend. That was nice that they honored the reservation and didn't make me wait around. Please make reservations... I saw so many people with party of 2 being told they need to wait for over an hour. Service continued to be super great throughout the night. Kept my glass of plum wine full and tea also.\n\nOnto the food. We both got the 12 piece omakase nigiri for $75 each. Hm. I think first off, the sushi rice was very well done. Great flavor, perfectly cooked grains, not too cold or warm, cohesive under the fish and didn't fall apart when I picked it up. The fish are all super fresh, and all of them are given to you with seasoning already, so no need to mix your own soy sauce concoction. However, I think most of the fish was overpowered by ponzu or citrus. A few pieces were dressed with ponzu, so my tongue is hit with lemon aggressively when I first put the fish in my mouth. One was dressed with lime zest, so that was very strong also. I would've rather tasted more of the fish itself. My favorites were the scallop and charred baraccuda with uni on top. Ugh so good! The scallop flesh was firm and definitely not previously frozen or soaked in salt water. They end the meal with a dish that combines uni with marinaded ikura. That was like the masterpiece of the ocean. The marinaded ikura were a tad salty since they didn't have rice to support it, but it was so good. Other fish were not very memorable but still good. I remember my fatty Toro broke into a few pieces when the chef served it to me, that was kind of... Yeah. I also felt like they could've ended the meal with the tamago, but instead they served this skinless plum tomato stewed in syrup. Very interesting... \n\nWe also got the pressed fatty tuna sushi - that was good but I don't think it's worth $19 for 7 pieces. But then again, this place is pretty pricey, so that's actually not very expensive in comparison to other things on the menu. \n\nAt the end of the meal, we were still hungry. Yep.... This is why I docked off a star. If I come in and choose omakase, I expect to be at least not hungry but the end of the meal. They couldve supplemented the meal with something like miso soup or salad in the beginning, or maybe even just more of that eggplant that they served one piece of in the middle of the meal. \n\nWe paid $115 per person including a drink each (including tips). Not bad but ... We had to go to McDonald's afterwards to eat more. But overall, we had a great experience. The sushi chefs explained each piece and I felt very taken care of here.", "author": "Susanna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Tsubasa is my favorite sushi place in the Hayes Valley area. Fresh sushi, good attention to detail, and good service. I've been able to stop by at 5:30pm on a Friday and get seated w/o any wait. I ordered oshizushi neigitoro (pressed negi toro roll), negi hama roll (yellow tail w/green onions), futomaki (jumbo roll), kurodai (black sea bream), and some fresh chopped wasabi (awesome that they had this...)\n\nExpect about $50-60 for food per person. Service is very attentive, and the place has a good atmosphere.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Great food and reasonable corkage.  Instead of ordering the omakasa we order a bunch of random pieces which was great .", "author": "Shirley V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-28", "description": "I can't say I enjoyed my stay here. I came here for lunch with a friend after our work out. But felt totally ignored. From the beginning, it took them forever to just get our initial order. When we asked for water, it didn't come until we asked again... We asked for a box and the woman said yes... Only to ask another waiter and he said, \"no take out\". It would've been great if the waiter just told us in the beginning. We were literally confused and irritated the whole time. I wasn't sure if it was a language barrier, but this waiter could have at least talked to someone who did understand to talk to us?? There were about 5 people to working and about 5 tables to serve. We really did not understand the slowness and lack of customer service there at all. How does this place have great reviews??\n\nThe food was decent... I guess. I got the negi toro donburi and a salmon handroll.  The toro was mashed and served over rice with the negi sprinkled on top. It also has the wasabi on the side. My friend ordered the chirashi bowl. She really liked the quality of her fish. I felt that the shitty service distracted me from the taste of my food. You could say it left a bad taste in my mouth.", "author": "Lyra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Chef Peter and Chef John are THE MEN!! My party of four got seated immediately for our 8:00pm reservation right at the sushi bar. All four of us opted for the omakase. Peter (who has notable sushi experience in the restaurant business) made sure to get our likes, dislikes and allergies before creating our amazing, delicious, aesthetically pleasing, fresh, (need I say more?!) tastings. Each omakase was personalized and beautifully presented. The chefs were both incredibly friendly and sociable. It was like hanging out with old friends paired with a phenomenal and delectable experience. Will definitely be back!", "author": "Annie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "The sushi here was sooo good! My boyfriend made a reservation and we came here for my birthday. We got the 12 piece omakase for ~$68 each. The service was very polite and they explained each piece of sushi.  \n\nMy favorites were the fatty tunas and salmon... to be expected. The fatty tuna came with gold shavings! The nigiri is so flavorful that you don't need soy sauce, and  the fish just melts in your mouth. Mmm. They also serve extra sides with the omakase; we got some black bean tofu thing, and this eggplant dish. \n\nBecause it was my birthday, we got free green tea ice cream with a lit candle! The ice cream was really good and also comes with homemade mochi. I think the 12 piece omakase is alright for satisfying hunger, but we did get another dragon roll on top of it. Just don't go in starving... Overall, A+ experience and sushi!!! I already want to go back.", "author": "Wendy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "O h m y g o d. It doesn't get any better than this.\n\nI made a reservation on Yelp so I could come here for dinner on my birthday. Boyfriend and I got the 12 piece nigiri omakase ($80 each) for ourselves and the ika geso (tempura fried squid legs) to share. All the nigiri pieces were SO good and the variety was very well balanced. The last piece was uni with salmon roe on top of a bed of microgreens and a shiso leaf and h o l y m o l y it was one of the best things I've ever eaten. It was so good, my boyfriend ordered another one for us. The uni was definitely the best way to finish off a great meal...\n\nBut WAIT, there's more! We got the following on the house: 2 pieces of A5 wagyu beef nigiri, 1 uni (they charged for my boyfriend, but not me), 2 oysters on a half shell, extra pieces of toro placed next to the toro nigiri that were part of the omakase, a taster glass of sparkling sake, refreshing candied tomato dessert, AND a medley of black sesame custard, green tea custard, house-made mochi, and red bean paste. I could've sworn the chef who served the toro nigiri put more gold flakes on my piece LOL.\n\nEven without the birthday perks, Tsubasa Sushi effortlessly earned itself a spot on my list of favorite places in SF. With high quality fish that won't break your wallet, it's a must try.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Quite an overdue review, but I had an amazing omakase here a couple months ago. The fish was incredibly fresh, service was on point, and the price was incredibly reasonable. \n\nMy bf and I had a great conversation with Chef Wilson, the owner of Tsubasa, which started funny enough from us not eating something he had sent out. He sent his recommendation - ankimo aka monkfish liver - and both of us had had that before and neither of us had liked it. We decided to give it a bite but sadly it still wasn't working its magic. The server brought it back in and Chef Wilson saw and asked if we didn't enjoy it and actually sent out another item for us to try, which we liked significantly better - I believe it was their homemade seaweed dish, which we loved. It was super refreshing. \n\nMy bf and I also enjoyed the uni and salmon roe dish. It was a perfect medley of textures, flavors and a good play on uni that we hadn't seen at other omakases. We ordered a couple extra sushi rolls, which were delicious too. We will definitely be back to enjoy omakase and see Chef Wilson. I HIGHLY recommend if you're looking for a delicious omakase that won't break the bank!", "author": "Cynthia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Another solid omakase spot, right in the center of Hayes Valley. Reservations here are easy to make on Yelp, I was able to book a 8pm seating on a weekday a couple days prior to going. The interior of the restaurant felt really homey and everyone working there was extremely friendly. \n\nWe ordered the 12 piece nigiri omakase, which I will have to say is ridiculously well priced at around $70pp, and a bottle of sake. Our sushi chef, John, was super awesome and gave us really thorough descriptions of the different varieties of sake and let us sample a bunch before we found one we really liked. All of the fish at Tsubasa was extremely fresh, and John was very fun and entertaining throughout our meal. My favorite pieces would have to be the wagyu nigiri, bluefin tuna toro belly, hotate, and the uni. \n\nOverall, the omakase here is well worth it considering the price point and quality of the fish. Be sure to sit at the bar!", "author": "Angela K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-19", "description": "I'm really not sure why reviews are so high here. We did omakase at the counter and for sure it is very reasonably priced for the amount of food we got, but that should've been a clue to how good the quality would be.\n\nI was highly disappointed by the sushi, the chefs are Chinese...which is fine but it just wasn't authentic. I'm not sure what I was expecting really. I wouldn't come here again. Also it's a dead zone for cell reception for whatever reason. I'm sad I couldn't like this place more.", "author": "Stine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Since it was half empty, and we didn't have much time before going to the show at SF Jazz Center, we decided to give a shot, although I'm a bit suspicious about Japanese restaurants in SF in general. \nMy comment is only for sushi as we didn't order anything else - it was surprisingly good for the price.  Our server was attentive, and we didn't wait at all like other reviews mentioned.", "author": "M G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "I made reservations online for 530 on Sunday. \nI came here 2 hr earlier in order to find a parking space. Luckily, found a spot just in front of the restaurant. \n\nThe service is pretty good. when we arrive, the waitress took us to the window seat which i really like. \nThe service is pretty good. waitresses are polite and patient.\nthe tea is pretty good\nfor the appetizer, i ordered ankimo and mochi. \n\nmochi is surprisingly good. \nankimo has a very strong smell...\n\nFor nigiri, \nI ordered scallop, a5 beef, uni, salmon, otoro \nThe otoro is kind of disappointing. the smell is a little bit strong which makes me feel it's not that fresh. \n\nA5 beef is AMAZING. super delicious, soft. It has a little butter with it. \nUni is good. \nscallop and salmon are just standard. \n\n\nOverall, I feel the nigiri here is not as good as the one I got in Wako. They are just not like authentic nigiri but it's kind of expensive.That's why i gave it 3 star. But the service and environment are pretty good.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Came here for dinner on a Thursday night and the omakase was spectacular and it was a lot cheaper than comparable omakase in other spots around the city. The omakase sashimi bowl was great as well and did not lack quality fish. The toro was amazing and completely melted in my mouth and the steamed egg appetizer was incredible. \n\nThe location of the restaurant is also great so there are a ton of places to walk around before or after your meal. Will definitely be coming back!", "author": "Norman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Love love love Tsubasa Sushi! \n\nThe staff, everyone from front of house to back of house, is so friendly and knowledgeable. They really make our visits memorable. And the sushi! Oh my! Absolutely delicious. My boyfriend and I like to try something new every time we go out for sushi and this place never fails to impress. They will recommend absolutely delicious items and then tell us all about them. They even have several off menu secrets (I'm divulging those secrets because you just need to ask for yourself and, well, they are limited. I don't want them gone on my next visit ). Everything is always delicious, fresh, and a cut above the rest!\n\nSo, I could go on forever about how wonderful this place is, or, y'all can go try it for yourselves.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "I couldn't believe I got to go see Hamilton two weekends in a row! Since the theatre is nearby and it's been like how many weeks ago (?) I visited Tsubasa, I decided to have dinner there.  It was last minute that I found out I will be going to see Hamilton so it was too late to make a reservation.  I made sure to get to the resto before they open so I can get a table, eat and go in about an hour before the show.  \n\nDidn't have enough time for an omakase so went with a la cart.  Chef Wilson, Peter, and Tom took really good care of us and made my sat night that much more special so thank you so much!\n\nDefinitely the luckiest girl that day!", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "Tsubasa is worth all its stars. If you're deciding between O-toro, Domo, or here, definitely go for Tsubasa. The sushi is authentic and fresh, service is great, and the seating areas aren't too cramped. \n\nYes you can make a reservation on Yelp (and I highly recommend that you do) but a lot of times they say they're no more reservations left but when I call they tell me to just walk in with no wait. \n\nI know some people said they never pick up their phones but I haven't had an issue with that. \n\nIf you're a salmon love, they have a few great salmon options (juicy scallop roll, salmon about roll).\n\nEdit: Very shady, they will add 18% automatic tip if you have a party of 5 (usually it's 6 or more anywhere else). This \"policy\" is not written on the menu anywhere. Then the signature receipt comes and they will suggest you tip again on the bottom, suggesting 18% as the lowest amount when other similar places start the suggestion at 15%. But why even include that when you've already added the tip yourself?", "author": "Ming Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Binky and I came here to celebrate our anniversary last month. It was the night before Thanksgiving and there were still a good number of families/couples eating! I was kinda surprised since it was so close to the holidays.\n\nBinky and I wanted to do the omakase and set a reservation for it. Unfortunately, the restaurant seated us at a table instead of the bar. Looking back, I wish we had simply asked for the bar because the omakase was N O T the same at the table (they just bring you the fish in portions of 4, 4, 3, 1). Another couple got to sit at the bar and they did the traditional omakase (w the chef preparing/handing you fish one at a time)!! \n\nNevertheless, the sushi was AMAZING. Each fish was already seasoned w salt/lemon/wasabi/etc. so there really was no need to alter it in any way. Binky and I were BLOWN AWAY with each new fish presented. My fave was 100% the one w the scallop on top -- YUM. We also got a complimentary oyster. Plating was beautiful and I was decently full after the meal.\n\nI saw someone order the chirashi here and it looked beautiful as well. I think I'd be back just to try it! :)", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Came here with 6:30 reservations on Saturday, but the boyfie forgot to ask for sushi bar seating =_= Fortunately, the chef was fine with us sitting there. We both opted for the 12 pc $60 omakase nigiri set, but was told there would be a slight wait as the chef was backed up. While we were waiting we ordered the albacore tataki as well as the ankimo. Both were delicious!\n\nWe were both pleasantly surprised with how fresh and delicious all the nigiri's were... flavors were amazing and each piece sent us to sushi heaven. To be honest, I like this place more than a lot of higher end sushi joints in the city... INCLUDING Kusakabe and Maruya. Way more casual, but not run down like Zushi Puzzle. Our sushi chef Wilson was very informative and accommodating. He noticed we were really enjoying more of the fatty fish so he was nice enough to keep it coming. Thank you, Chef Wilson :)\n\n\nI've been recommending this place left and right. So happy with our dinner :) Hope the quality doesn't go down... which I highly doubt because Chef Wilson really seemed to care about each piece of nigiri.\n\nP.S. The uni and ikura was SOOOOOOOOOOOOO damn good. One of the best I've ever had. Just WOW.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-30", "description": "So disappointed but it didn't live up to the hype. Service was very very slow. We had to talk to the manager to speed things up. Fish including the specials are not fresh. Have been to much better restaurants at lower prices. Not sure why the rating was so high. It looks like the place was not staffed by Japanese staff", "author": "Vivi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "If I could give this place 7 stars I would. AMAZING. We ordered appetizers, sashimi, nigiri, sake, and 8 pc.  Omakase.  Nothing disappointed, extremely fresh from Japan, and terrific service. Sit at the bar to see all the action. Soy and ponzu are both made in house. \n\nFor the details: We had toro (fatty and medium grades), black kingfish, sailfin poacher, sea robin, yellowtail (2 types), monkfish liver, scallop (two types), tamago, edamame, STASH roll, bread pudding for dessert and a few different sakes. \n\nWhile at the bar, all questions to the chefs were answered and you can tell they're enthusiastic about their service and customers. \n\nPricing is extremely reasonable.  Our entire meal was a tad under $200 and would've easily cost $300+ in Houston (home).", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "I have been here back in March, but decided to write this review to be their 300th reviewer! Tsubasa and Hinata are two of my favorite omakase places in SF so far, due to price and quality. I feel that with Tsubasa's omakase, they give you everything you need and want without having to order the ones you want from the a la carte menu! Hinata is great but in order to have those specialty fishes, you have to add an additional $30 to your order. But in Tsubasa, they filter out the filler fishes and go straight into it! I had a great experience here for my bday, they gave us additional courses as well, so of course I am instantly going to fall in love with this place! Now I just booked another reservation for this Sunday for my 1 year anniversary as my bf is very new to the omakase scene. I am excited!! :)", "author": "Celine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "We are on a mission to try as many sushi restaurants in the city as possible. After two amazing omakase experiences and one trip to Japan, we opted for an affordable option and chose Tsubasa. So worth it!\n\nWe ordered the $68, 12pcs Nigiri omakase and 2 rolls, and got super fresh, nice chunks of fish! Flavors are unique and the appetizers were delicious as well. My favorites - Hotate and Otoro. Not a fan of the sweet tomato you get with the check. Super friendly service, would definitely recommend!", "author": "Shay N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "You should definitely not go here and ruin my new favorite sushi spot in SF. You won't be able to just walk in at 830p on a Friday and get a table for two at the counter. The nigiri omakase won't be outstanding, the uni will melt all over your mouth, and you'll probably leave feeling way too satisfied for it to be worth your time and money.\n\nI repeat: Don't. Go. Here!", "author": "Navi O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "Summary: The quality of fish was decent for the price point, but each piece came painfully slow (2.5 hrs to serve 8 pieces of nigiri) despite the restaurant being less than 50% full, and the chefs were shockingly rude to the point where it felt threatening (slammed plates while staring our table down and cursing loudly at us in a mixture of Japanese and English after we politely asked the waiter if it was possible to cancel the rest of our order). \n\nThe chefs clearly gave preferential treatment to guests who appeared to be friends, while neglecting the rest of the customers (including us) to the point where it took 2.5 hours to serve 8 pieces of nigiri... By that time, it was already past 10pm (on a Sunday night) so we politely asked to see if we could cancel the rest of the orders if possible. At this point, I was just slightly disappointed by the slow service, but that was apparently the tip of the iceberg. Once the waiter went back to inform one of the chefs, the chef erupted in anger, yelling in a mix of Japanese & English and slamming a few plates. Naturally, I was startled, so I turned around (my back had been against the sushi bar) to see what the commotion was about - that was when I noticed the chef staring us down while continuing to mutter (unclear what he was saying though). At this point in the night, all of the guests had already left the bar, which means the death glare went on for about 2-3 minutes before the waiter came back with the check while apologizing for what was happening. I am honestly speechless from how horrendous this whole experience has been and will warn my friends and family to stay away from this establishment.", "author": "Carpus T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Absolutely fantastic. Everything we had was great- and we ate A LOT. I will dream of the Toro Kama that I ate & the a5 wagyu. The chef Peter is an awesome guy and makes incredible sushi. His style is unique and top top quality. \n\nI recommend getting the 12 piece Nigiri. It's priced at $80 but it is more than a meal- it is an experience. \n\nHands down the best sushi I've ever had. This meal is in my top 3 most memorable meals of my life.", "author": "Roman K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "Found this place through the social media platform, Instagram. I was very intrigued when there's a new Omakase near by. We immediately reserved bar seating for 2 with Yelp for the the coming Saturday, November 19 at 6pm. \n\nWe were worried about parking but we found parking about a block away and walked over. The restaurant is located the same side of Monsieur Benjamin on Gough St. but across the small intersection. \n\nEntered and gave my name for the reservation and was seated immediately at the bar with menus. We opted for the Omakase 12 pieces set - $60/pp. We were kind of skeptical about the quality with such low price tag for a Omakase in the city. We also ordered a Japanese beer, hot tea and water for drinks. \n\nWe started off with an appetizer which was included in the meal that we didn't know. After that, we were served with plates of three pieces of nigiri one after another until we have the 11 pieces as promised on the menu. We were also asked if we would like to order any other nigiri before the finale, 12th piece course - Uni. We order two additional orders of nigiri that was recommended by the waiter. While plates of nigiri were served to us by different waiters and the chef never actually had the chance to introduce himself to us. They were very busy making the sushi on their side. I wish there were a bit more interaction so I can learn more about them. \n\nThe quality of the fish superb but some lack presentation. Would definitely recommend this place for the inexpensive price tag for a good Omakase meal.", "author": "Maria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Peter is an incredible chef and always takes the best care of his diners. It was an incredible experience, and the sushi itself tasted very fresh and delicious. I will be back many times!", "author": "Alanna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "The first thing I wanted to eat when I landed in San Francisco was some fresh sushi.\n\nMy friend suggested we go to Tsubasa, and I'm glad we did. We got there pretty early (right when they opened actually), and we could see how this place gets packed during lunchtime.\n\nWe ordered the chef's special, which were two beautiful platters of sashimi followed by sushi.\n\nEvery single bite was a delicious surprise, and I was only looking forward to the next. Don't forget to eat the gari too! So, so good.\n\nThe wait staff could have been a little more attentive, and could have come by without us trying to hunt them down, but other than that it was a positive experience.", "author": "Zarene S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Very good fish .pretty reasonable price for that aria \nService are great !!\nI will come back .", "author": "Jenna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Tsubasa Sushi replaces The One sushi bar space in the heart of Hayes Valley right by Gough and Hayes Streets. And frankly, it's much better than what The One used to be. We were able to snag a reservation the day before, which is rare these days, and were extremely happy with our meal. The fish was fresh and displayed solid knife work, the service was attentive and helpful, and the overall meal experience was solid. (My real rating is probably 4.5/5, but rounded up!)\n\nTsubasa specializes in more traditional sushi; we stuck primarily to sashimi and nigiri, but has some unique takes on their traditional options. If you're looking for super creative, fancy rolls or nigiri options, I would probably go elsewhere like Elephant Sushi or Umami. It's also not the place you bring a big group and do sake bombs. But I would highly recommend Tsubasa for a centrally located traditional sushi dinner that isn't outrageously expensive; other favorites in the same range include Saru Sushi, Eiji, and Kabuto Sushi.\n\nYou can skip the appetizers in the future -- we tried: a maguro (tuna) sunomono salad which is a marinated cucumber salad with seaweed, and a trio which consisted of shirataki (yam) noodles, a combo of tororo (mountain yam paste), tuna, and wasabi, and house cured ikura (salmon roe). Everything was fine, but didn't particularly wow except for that ikura. So ridiculously good! Not sure if they cured it in sake or something else, but the roe was slightly sweet and not briny at all, and burst in our mouths like mini firecrackers. \n\nThe 10-piece sashimi omakase served with its own house-made soy sauce was a great deal. The omakase was served all at once on a plate to our table and  actually ended up being 15 pieces as they provided 3 of each kind of fish instead 2. Everything was fresh, well-cut, and they were thoughtful in the progression from the light-tasting maguro (tuna) and ending with the more pungent aji (mackerel). And I typically am not a huge aji fan, but their version was perfectly cured and not fishy at all. The aji and the iwana (arctic char) were my favorite sashimi items, although all were great.\n\nTheir nigiri was also solid. The vinegar in the rice was slightly stronger than I typically prefer but the grains were just the right amount of stickiness, and each piece of nigiri was perfectly sauced and balanced. Their specialties like the zuwai-gani (snow crab) served with kani miso (crab guts), hotate (scallop), seared ibodai (butterfish), and uni (sea urchin) with ikura. All were incredible. Hotate perhaps was the least creative or interesting of the ones we tried, but still delicious. The seared ibodai nigiri came a dab of their house cured beet root on top, which was the perfect acidic and texture balance to the soft, buttery texture of the fish. And the uni nigiri when consumed with the same amazing ikura from the starter was a party in my mouth.\n\nThroughout the night, service was attentive (but not too much so), and they even provided complimentary appetizer (a green tea tofu if I remember correctly), palate cleanser, and a little dessert (sweet potato). Tsubasa definitely won my heart that night, I would place it high on the sushi considerations for the city.\n\nRead more about the meal on my blog: http://www.vcinthekitchen.com/tsubasa-sushi-sf/", "author": "Vic C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Some of the best sushi I've had here in the states. I have been by this wonderful spot many times and wondered if the what turned out to be excellent Japanese cuisine was true. \nTonight I jumped into the wonderfulness of traveling to Osaka in an instant. \nFresh and tasty sushi prepared exactly as I remember in Japan. The style of  preparation is uncompressed! The staff are friendly and make you feel very welcome. \nI definitely have this wonderful spot bookmarked!", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "THIS IS HANDS DOWN THE BEST SUSHI IVE EVER HAD IN MY LIFE. If you're going to splurge and treat yo' self, this is the BEST place to do it. The chef, Peter, took extremely great care of us by recommending his favorite fishes. Every piece I had was a solid 20/10 score. Everything good you've heard about this place is true. \n\nThis place is rightfully pricey. Top dollar for top quality food. I 100% recommend making this your go-to sushi spot whenever you have a special occasion. You really feel like royalty eating here from the gold flakes on top of the fish to the rare toro kama that melts in your mouth. I'll be dreaming of this food until I have it again.", "author": "Dana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Since my last visit a month and a half ago I was dying to go back to Tsubasa for dinner and finally made it in last week. I was super excited to try the very reasonably priced omakase ($60) but, after reviewing the menu I decided to piece together my adventure. \n\nI started with some pieces of nigiri: \n\nAji - lightly glazed with soy and a firm fatty fish. Not for beginner sushi eaters. \n\nIkura - might be my favorite nigiri on the planet. I'm a sucker for any kind of fish egg and their house cured salmon roe is stupendous. Also not for beginners. \n\nI'm normally not the kind of person who orders a bunch of rolls but, they looked so appealing that night so I got a couple. The spicy tuna/asparagus roll topped with albacore was super light and naturally had a nice crunch. The highlight of the \"rolls\" was the pressed box nigiri. It's kind of like a roll without any nori (see picture). It was topped with toro and had fresh wasabi you could add to each piece...none of that fake green stuff :) \n\nI'll let the pictures speak for themselves as the fish is really good here and at the perfect price point for San Francisco. It's now my go-to spot for casual, yet elevated fish. Service with a smile and a short/solid saké list to boot.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Good and affordable omakase in Hayes Valley. I love eating at the sushi bar and interacting with the chefs! 12 piece omakase -- thanks chef for throwing in a couple extra pieces!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "My first time and not my last! Looking for parking is a pain in the butt! Took us almost an hour to even park. Tip , find parking somewhere... take Lyft over to the restaurant for sure.  Service is great, very friendly, attentive and answered all my questions. I ordered the Omakase and everything was so fresh and delicious .", "author": "Cynthia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Absolutely delicious rolls and sushi. I'm not a big sushi eater, but I will admit that the rolls were on point. Some of the best I've tried in the city! \n\nService was very quick and courteous as well. Jackson was our server and was extremely social and welcoming. Their welcome amenity was delicious and this felt like a Michelin Star restaurant regarding quality, service, and food taste.\n\nWould visit again. Great job Jackson!", "author": "Albert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "Got the Omakase with a friend, and it was one of the best things I've done on a Friday night!\n\nJust sit, and be pampered with each carefully crafted piece of nigiri. \n\nEach fish was super tasty and fresh! The toro was super soft and fatty. No ragrats!\n\nService is nice and attentive. We ordered more items after the omakase, and they had no problem with that! (I wished the nigiri were bigger, since they were smaller than I had expected)\n\n10/10 would recommend!", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Great great sushi \nThen service was great food was as described And the price was fair \n\nWould return with family", "author": "Paula O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "Came here on Friday night with reservations at 8pm. The first thing I noticed was the fishy smell when I walked in. The sushi is quite good but the service was so uneven and took way too long. Perhaps they focused on the bar patrons more rather than the tables but for a half filled restaurant that late at night I was a bit baffled why our meal took over 2 hours. We would get two nigiris then had to wait another 30 minutes for the next two nigiris. We remained hungry throughout the meal and couldn't even truly enjoy the food (which was quite tasty). I really didn't understand why they made two nigiris at a time... just make my whole order if it's going to take forever. This was a complete 180 from the service we received the first time we went to Tsubasa. Not sure what went wrong but it was extremely disappointing.", "author": "Cathy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "This place has an elegant and classy atmosphere. It is on the pricier side, but the quality of the fish is fresh and excellent. \n\nI came here on a Saturday night. It wasn't crowded at all, but they did ask if we had reservations. Service was very friendly. We decided to try a couple nigiri items and a roll. We had the chu toro, medai, kanpachi, arctic char, king salmon, and an avocado salmon roll. Everything was extremely fresh and seasoned already with wasabi and sauce so no need for extra soy sauce. \n\nThis is a very cute atmosphere for a date.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "Sitting across the alley from Monsieur Benjamin and taking over for the clubby, decidedly mediocre sushi spot that preceded it (The One), this modestly decorated sushi restaurant was actually working from a deficit position when it opened. I wasn't even thinking about trying it until we noticed that there would be a wait at Little Gem. Impatient locals that we are, Jamie W. and I bee-lined over here thinking we would grab a bit of sushi. Sure enough, there was plenty of space in here for lunch, so we parked our arses at one of the high-top tables near the window.\n\nJamie decided on the $11 California Roll Bento Box, which was simply six pieces of maki, a little tempura, a little salad, and an unnecessary scoop of rice given the aforementioned California Roll (photo: http://bit.ly/1tlXPu4). It was pretty good actually, but mine reflected more of the chef's touch, a $16 Chirashi Donburi Bowl with an eclectic collection of sliced fresh fish, roe, grated daikon, and watermelon radishes over rice that was quite delicious (photo: http://bit.ly/1UGttut). Along with a hearty bowl of miso soup, it made for the ideal lunch. We were impressed enough to come back for dinner about six weeks later. The rest of the neighborhood finally showed up since it was buzzing. Word-of-mouth must have spread.\n\nWhile waiting for Jamie to arrive, I went ahead and ordered the $10 Ankimo because I am a sucker for fresh monkfish liver in ponzu sauce (photo: http://bit.ly/1OfO75H). It had such a lush flavor and was very fresh-tasting. Jamie arrived too late to enjoy the ankimo, bu we ordered the $13 Rainbow Roll straight away, and it was hearty with a fresh crab avocado filling and covered with all the requisite fish in a mosaic fashion (photo: http://bit.ly/1UFVsHW). The $7 Mixed Tempura plate came next with a nice blend of shrimp, asparagus and eggplant slices lightly battered accompanied by a light dipping sauce and sea salt (photo: http://bit.ly/1YhmAms).\n\nA couple of more creative rolls followed. First was the familiar and well-executed $10 Spider Roll with deep-fried soft-shell crab, cucumber, and avocado (photo: http://bit.ly/25ONx6C). The second was the idiosyncratic $13 Holy Crab Roll with freshwater eel combined with avocado, topped with crab and drizzled with a spicy & sweet sauce (photo: http://bit.ly/1tfKzq8). Delicious with a saucy decadence. We could see how Tsubasa could become our go-to sushi spot, especially since Jamie has turned Japanese since our last trip to Tokyo. It's true. Pretty soon he'll start bowing when we meet up and maybe wear slip-on shoes before he goes through TSA at the airport.\n\nFOOD - 4 stars...the sushi really rocks here, not top echelon but good for a quick bite\nAMBIANCE - 3.5 stars...minimal and spacious\nSERVICE - 4.5 stars...very attentive like we were important or something\nTOTAL - 4 stars...sushi satisfaction in the heart of Hayes Valley", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Excellent service, and the fish quality was superb. The sashimi really melts in your mouth. Best sushi I've had in the city.", "author": "Lawrence J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Fish quality is a par with what you pay for. Very fresh and clean. Hard to get a table but worth the wait or make reservation. Personally recommend wild salmon nigiri and negi toro", "author": "Eugenia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "Poor unhygienic handling of fish. Fridge cooler always left open. Sushi came warm. \n\nWould have left if friend wasn't stubborn.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Came here last Saturday for dinner. I had a reservation and was seated promptly. The restaurant wasn't pack, but it filled up. Parking can be bad around this area. I went straight for the omakase 12 pieces for $80. They started off with 2 plates of 4 pieces of nigiri, then 3 pieces and 1 grand piece. Each pieces was exceptional seasoned and fresh. Two of my favorites was the butterfish and scallops. I normally do not even like or order those fish, but I loved it. I do wish the last piece, uni was bigger portion. In between the plates they had complimentary dishes, like a fried eggplant soaked with a sauce, the flavor was amazing and you couldn't even tell it was fried. The whole course did take about to 1.5 hrs like the menu noted. At the end the chef sent over waygu nigiri, it was amazinggggg. Overall the omakase experience and ambiance was great for the price.", "author": "Suzy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "Do you know how limited my sushi options are out in this area? Especially when I've got a strict one hour time limit.\n\nThere's so much bad sushi in the world. We really ought to shut 'em all down because of the overfishing problem \n\n\n\nSay no to pseu-shi, but say yes to Tsubasa. \n\nI'm not a bento person and I don't eat rolls often. Tsubasa offers pretty damn good chirashi and sake-don for lunch. While the chirashi is almost too beautiful to eat (the presentation is gorgeous!) and offers a nice small variety of fish, my heart belongs to the sake-don. Love the ikura they throw in there.. What really does it for me at Tsubasa is the sushi rice. The shari is perfect!! Nice amount of vinegar (and I'm sure they use a dark one because there's a slight tint to the rice) and perfectly cooked. They're friendly and they remember me. I need to come back for dinner!", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "I was super stoked for Tsubasa tonight. It was a special weekend, and I was meeting up with a high school friend for the first time in SF, so we were planning to do some sort of omakase somewhere. My friend organized, and apparently a bunch of those omakase places were pretty fully booked, but she was able to get reservations at Tsubasa, which also offered omakase, and at a more affordable price than some other places I came across when looking up restaurants. We knew we wanted to try some nigiri, but we were super indecisive, and asked the server to recommend some stuff, but of course we had no idea what our preferences were either so he recommended we get the Chef's Omakase. Good recommendation XD We also ordered a couple of appetizers as well.\n\n- Chef's Omakase: we originally got the 8 piece, but upgraded to 12 piece at the end of dinner since we still had room to spare hehe. I've never had omakase before, and my family usually orders the same like 3 things at Japanese places (salmon maki, dynamite roll, and salmon sashimi lol), so I welcome any opportunity to try new things. And boy was the nigiri such a treat! I actually wrote down the names of all the nigiri haha. I really loved how each combination was served with such care with each of the flavours, and how the server directing us to eat in a certain direction kind of made sense. No soy sauce was needed either, since the nigiri was already marinated with special sauce. My friend made the soy sauce mistake, and the server told her soy sauce wasn't eneded haha. My favourite nigiri combination was the following:\n    - Amberjack: citrus notes\n    - Golden eye snapper: kind of the bridge\n    - Butterfish: some hot sauce\n    - It was cool how there was that contrast in the combination. I also liked how there were a few \"bonus\" kind of small dishes that came with the omakase, including an eggplant marinated in a light sauce, not too sweet or strong in any sense, and the eggplant absorbed a lot of the sauce, giving it more flavour.\n    - Our last 4 pieces of omakase came in 2 rounds, with the fatty toro and gold leaf, and barracuda with a little piece of uni on top getting A+ on presentation\n    - The real uni was a great way to end of the omakase, definitely a real treat. I've never actually had uni before! It was very smooth and had a rich but not overbearing flavour. \n    - I also enjoyed the few pieces of nigiri that were slightly torched on top. \n\n- Appetizer trio (I forgot the name): also recommended by our server. It came with 3 items (apologies for the non-official names, I don't remember what they were called haha)\n    - Ankimo: monkfish liver. 5 years ago, I wouldn't touch any kind of liver, dead or alive, with a 10ft stick. But I guess tastes change, and I'm glad I'm more adventurous now. This was an interesting experience and it wasn't bad!\n    - Tuna + white suff: well, the white stuff was super sticky and apparently it's made of yam! It reminded me of spit or something (ok maybe too graphic for dinner time talk XD), and I didn't quite enjoy this, maybe because of the consistency but also it tasted a bit funky. The server recommended to mix some soy sauce with it to lessen the stickiness, but I just avoided the yam and enjoyed the tuna by itself instead haha.\n    - Ikura: I've actually had the big fish roe before! I've had plenty of the little fish eggs that come on sushi, but never ikura or that kind. It was very rich in flavour, and I loved the pop when it exploded in my mouth. Reminded me of the exploding boba hehe.\n\n- Unagi Chawanmushi: I love chawanmushi, and it's not a super common thing at normal Japanese restaurants, so whenever this is offered I jump at the opportunity. The chawanmushi was probably the least stand out of the dishes tonight, as it may have been lacking that bit of something, but it was still good, and a nice piping hot bowl to (almost) end of the night.\n\n- Dessert: green tea ice cream and mochi for the special occasion ;) I'm a sucker for green tea ice cream, and it was great. The mochi was ok, but I'm still glad we got to try it. Definitely a nice way to end such a delicious dinner. \n\nI can't believe all this beautifully presented and delicious nigiri in omakase is what I've been missing in my life! I wouldn't have my first omakase any other way, and I'd definitely recommend Tsubasa, especially for a more affordable omakase meal :)", "author": "Joanna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Phenomenal Japanese restaurant located in the Hayes Valley district of SF. Came here with a friend for an early dinner on Friday. We both ordered the 12 piece nigiri omakase, and an unagi chawanmushi (separately) to share. Our meal consisted of the following courses:\n\n1. Sesame tofu starter\n2. 4 nigiris (flounder, char, snapper, amberjack)\n3. 4 nigiris (scallop, chuutoro, flying fish, mackerel)\n4. Complimentary piece of eggplant\n5. 3 nigiris (wild cherry salmon, barracuda & uni, toro)\n6. Unagi chawanmushi\n7. Uni nigiri with ikura\n8. Candied tomato dessert\n\nAll of the items were fantastic. Each piece of nigiri was unique and very fresh. My favorites were the wild cherry salmon and the toro. Both were extremely juicy -- the umami of the fish just burst in my mouth with every bite.\n\nThe service was very friendly - the waiters and waitresses carefully explained each item that came with our omakase meal. They also checked in very frequently with us to make sure we were ready for the next course.\n\nOverall, this was a very memorable experience. The price came out to be $90 per person after taxes and tips, which I felt was perfect given the fantastic quality of the food and the friendly and efficient service at Tsubasa. Very highly recommended!", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Tried this restaurant for the first time for boyfriend's birthday  Omakase was well worth it. Service was wonderful!!!", "author": "Selina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "3.5 STARS\n\nWhen I hear about a new sushi bar opening, my eyes light up and...my wallet cries of the impending damage. If you want to good stuff, you have to put out. Well, your wallet does.\n\nI've been to The One Sushi & Lounge once and never again. It was the typical stereotypical Chinesey sushi place - bad fish and even worse service. Last month, The One Sushi & Lounge reincarnated into Tsusaba Sushi, supposedly with new owners. I read that they offer omakase and the pictures looked enticing enough to stop by for lunch. \n\nUpon walking in, I noticed some of the same staff as The One Sushi & Lounge but they now have a Japanese sushi chef. Unfortunately, omakase is not offered during lunch (different lunch and dinner menu). Disappointingly, there's only 4 nigiri options for lunch (sake, hamachi, binnaga maguro, and unagi) but there's lots of maki roll options, if that's your thing - traditional and fusion rolls. They also have bento boxes for about $13. Fish is sourced locally and from Japan. \n\nThe nigiri was the highlight of my lunch. \n\n*Sake (2 pc - $6): http://bit.ly/1RBkjRW\n*Hamachi (2 pc - $7): http://bit.ly/1RBki0o\n*Otoro (2 pc - $13): http://bit.ly/1pK33hj\n\nFor Hayes Valley, the nigiri was solid and a huge improvement over its predecessor. The neta was l-o-n-g and beautifully cut. The sake and hamachi were uber fresh, silky, and buttery. I was having a bad day and felt like splurging so I asked the sushi chef if he had otoro available and he did. Maybe it was the cut but the otoro was firm and didn't have that melt-in-your-mouth quality it should have. This is more of a preference but the shari could have been used more vinegar, salt, and sugar since all nigiri comes seasoned sans wasabi (no need for soy sauce). \n\nAs a filler, I also ordered the Mixed Tempura: Shrimp w/ rice cracker, eryngi mushroom, zucchini, asparagus ($7): http://bit.ly/1RzDEwK. Unless you like hard, greasy batter, I would skip this. The shrimp was definitely frozen as it was wet in the center. \n\nI made the mistake of ordering a maki roll from their fusion section instead of the traditional section (there's another sushi chef in charge of making the rolls). I appreciated that they were light on the rice for the Juicy Scallop Roll ($13): http://bit.ly/1o8TNkY but the roll was no bueno. The scallops had a slight slimy texture and the sour miso sauce looked like man chowdah. The sweet and sourness of the sauce was overwhelming and was a funky pairing for raw seafood. \n\nThe female server was really polite and attentive. I was one of two diners during a late lunch so I enjoyed the peacefulness. \n\nI know having their entire omakase selection available for lunch is impossible but I would love to see more nigiri options during lunch. Granted, an all nigiri lunch will be $$$$ so it's a good thing I have an office stash of $1 Nongshim ramen bowls from Walgreens!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Came here on a Sunday night and decided to order the omakase, because WHY NOT? It was around 8pm and  quiet - you probably don't need to make reservations later in the evening, though we did. \n\nThere are several different omakase options - we went for the more expensive, 15-piece ($75) nigiri omakase and it was SO worth it. We also ordered the appetizer sampler trio, which was unnecessary in the end because we were way too full. We sat at the bar for a more intimate experience (you can watch the chef lovingly make eace piece, which sometimes involves paintbrushes, blowtorches, and gold leaf!).\n\nSome favorites from the night:\n- Wagyu nigiri. OH MY GOD. This is the A5 stuff, aka the best wagyu beef out there - google it and it looks like lace from the marbling. Melted in our mouths. If nothing else, this makes it worth it to get the 15-piece omakase because I'm not sure it is included in the 12-piece one.\n- Mugi hotate (scallop) nigiri with yuzu-infused flying fish roe. Tsubasa's head chef, Peter, has designed this absurdly delicious citrusy yuzu sauce that made an appearance in several pieces. It is unlike any flavor I've had with nigiri, and really brings out the brightness of clean, fresh fish.\n- Chu-toro (fatty tuna belly) nigiri. While not as melt-in-your-mouth rich as toro, the chi-toro was flavorful, fresh, and almost creamy in texture. And let's be honest, the gold leaf makes you feel #fancy.\n- The additions (not included in the 15 pieces): Oysters, miso soup with fish filets, dash-soaked eggplant (looks odd but is a flavor-bomb of dash goodness), and candied tomatoes for dessert. All filling, hearty, and yummy!\n\nFood: 5/5 - Absurdly good food, decadent flavors, and so much variety. Plus the attention to detail was unparalleled - the delicate yes sauces, the house-made soy sauce blends - every detail was on point, the way you'd expect in a much more expensive restaurant.\n\nDrinks: 4/5 - We had the (FILL IN) sake, which was delicious, but pricey. Pro tip - offer some sake to your sushi chef! It is traditional, and always appreciated :)\n\nService: 5/5 - our server John was friendly, knowledgeable, and fun without seeming like he was trying to hard. The banter between the chefs was hilarious - you can tell these guys are friends in addition to coworkers. The chefs and hosts are really authentic and approachable while still being professional. John gave detailed descriptions of all the food that we had, and answered all of our questions in detail. As major food nerds, this made for an incredible experience. Food came out quickly but not in a way that made us feel rushed.\n\nValue: 4/5 - at $75 for 15 incredible pieces (some of which - like the wagyu - ran over $10/piece a la carte), this was an incredible deal. Throw various small bites on top of that, and you have yourself an incredibly filling, decadent meal at an unheard of price - especially in SF! Of course, with tip the bill still came to ~275 for two people, so this isn't exactly a cheap place. Would recommend for a fancy date night\n\nAmbience: 3/5 - I wouldn't say the ambience was particularly memorable. The food is the focus here.", "author": "L H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "The search for top notch sushi in sf continues.  Prices are pretty decent for sf but having just come back from Tokyo maybe my standards increased a little bit and Tsubasa is just my first review that doesn't compare.  Tried the chu toro and it didn't have the same taste as what I had in Tokyo.  Hamachi and other sushi just so so.  Sorry.", "author": "V N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "Came here on a first date and it was really nice. The atmosphere and service is really great for a first date. Quiet enough to talk but busy enough that there's things you can talk about in the restaurant.\n\nFood was solid. Nothing wow-ing but delicious overall.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "The quality of fish was great, but I can find the same quality elsewhere for a better price. It's $27 for 4 pieces of nigiri (for the chef's sampler). I also had a piece of bone in my fish, which has never happened to me before!", "author": "J. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Fantastic quality of Sushi. They don't answer the phone. Be there at opening time if you have a theater to go to. Otherwise after 8:00pm", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Food always excellent.... staff charming and attentive. Tempura has light breading and a favorite. Spider roll also s go to item. Great place before opera , ballet or symphony....,", "author": "J. Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "My boyfriend took me here on New Year's Eve and we fell in love! The place is small but the service and food were just the best combination! We came earlier than our reservation but they were able to accommodate us immediately. We checked in often to see how we were doing and cleared our plates instantly. Food came out a bit slow but there was only two chefs serving food for omakase style. It's a bit pricey but it's so worth it.\n\n12pcs omakase for $60. The spanish mackerel is to die for! That was my favorite besides the uni and toro. All the pieces just melted in my mouth! The uni came out last and came with salmon roe (marinated in their homemade soy sauce). It was a bit salted eating it alone but when eaten with the rice and uni, it was just heaven!\n\nOshizushi - pressed sushi with toro. We were going to get the toro handroll but the waiter suggested the pressed sushi instead. I always wanted to try pressed sushi (it's a few dollars more) but it did not disappoint. We loved it! It was a bit a rice but the rice was seasoned and had sesame seeds - it was just delicious! I could eat just the rice alone!\n\nGreen tea ice cream with homemade mochi - can't leave without dessert. Words cannot describe! You could definitely tell it's green tea ice cream and their homemade mochi was so soft and chewy. A bit bland but that's how mochi is. Mix it with eh green tea ice cream and it's a great combo!\n\nThey gave us candied tomatoes at the very end of the meal. It was interesting but I probably wouldn't eat it again haha. It was not bad nor good but it is something you should try once in your life.\n\nI will definitely came back here. I love the food and service. Great way to end the year of 2016 with - a perfect meal!", "author": "Linda N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "Saw 4.5 stars review came with some expectations. bit disappointed. Services were excellent but food was not great . We did order the Omakase, rice was hard tasted like leftover rice. Prepping was not great, i can tell it was cut properly, uni was not fresh. I had eat better one.  It costes about $70, not worth. We ordered a bottle sake, but it was pour in a container so we didn't even know did we get cheated. I wouls rather pay a little bit more to have better Omakase.", "author": "Lori T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "This is the best sushi I have ever had. I've been to Michelin star sushi places, but hands down Tsubasa is the best. Such a decent price and incredible quality fish. Thank you so much Tsubasa for coming to the Bay Area and gracing us with your delicious food.", "author": "Thea B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "For the price of their omakase, this place is definitely worth a try! Looks like they've just increased their omakase price to $68 for 12pcs of sushi instead of $60. You get an appetizer at the beginning and another amuse bouche in between the sushi courses. The 12 pcs sushi is divided into 5 different servings. \n1st plate:\n- sea robin\n- rudy snapper \n- artic char\n2nd plate:\n- star butterfish\n- baby yellowtail\n- spanish mackerel\n3rd plate:\n- wild butterfish\n- chu toro\n- fresh scallops\n4th plate:\n- barracuda\n- toro\n5th plate:\n- uni\n\nWe love most of the sushi, a few taste a bit \"fishy\", but overall it's a great meal!\n\nParking is tough in this area, we took uber since it's easier. Reservation is pretty easy to make online.", "author": "Prisilia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "This place is awesome!  Great sushi, great sake.  What's not to like.  Order exclusively off the special menu.  They get fresh fish flown in from Japan.  Amazing!", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "One of the best sushi spots in San Francisco- Tsubasa sushi!!! Ordered the omakase 8 pc with uni and Ikura combination. The staff was very friendly and knowledgeable and catered to us.", "author": "Denise F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Tsubasa is the best sushi experience in SF. At first glance, It doesn't attempt to impress with fancy decor or with an overly complicated menu. Instead the story that you get from Tsubasa is a mom and pop shop nestled in the heart of Hayes valley that has really elevated its game. Once you try their nigiri sushi, you'll know what I mean. We started off by ordering the 12 piece nigiri omakase. The fishes we particularly enjoyed include the wild caught mackerel, wild caught yellow tail, the blue shrimp, king salmon, butterfish and of course the Toro was immaculate. \n\n5 stars, I strongly recommended dining here.", "author": "Eugene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "One of my go to sushi spots for no frills high-quality sushi. They have a nice long list of nigiri / sashimi options with lots of specialty fish you won't see on other menus. Pretty easy to get a reservation, too.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "It was a random Saturday visit, but I'm so happy about it. I think one of the best places with Japanese cuisine. Small restaurant, but nice. Smell of wood in the air adds some kind of peace to your mind and you can enjoy your food. My meal was like a small art show. Fresh complementary starter, delicious sashimi and unexpected taste of Uni in the end. \nI will absolutely come there one day.", "author": "Barbara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "This was a good Omakase value ($68) and the fish was very fresh.  I also ordered the unagi chawanmushi, the Atlantic crab and unagi nigiri.  Everything was really good and the meal was well paced. Service was good and the location is trendy.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Great quality sushi with amazing service. They give great sake recommendations, as it's admittedly something I know nothing about. This is my go to sushi spot in Hayes Valley!", "author": "Abby E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "You can tell an authentic Japanese restaurant by Miao soup and sashimi . Love love love this restaurant! Pretty decent and authentic like the one I had in Japan. Price is reasonable and sashimi is *fresh* ! Just become my favorite Japanese restaurant in SF", "author": "Jiani S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "After finishing our shopping on Hayes St at 7pm on a Saturday (when it seems that all the shops tend to close in this area), we were fortunate to walk in and land an available table at Tsubasa Sushi which had quite a number of tables reserved and all the sushi bar area filled up. At sushi restaurants, I tend to gravitate toward the omakase while the wife prefers a couple of rolls with a side of uni if available & the diverse options by Tsubasa suited our preferences well. I had a wonderful 8 piece nigiri omakasa which included mackerel, flounder, fatty tuna, perch, a huge piece of scallop, and arctic char. The S.T.A.S.H. roll was very impressive with large pieces of seared yellowtail and seared just enough without overdoing it. Inside the S.T.A.S.H. roll were asparagus and spicy tuna which made a really interesting mix of flavors in this roll.  I think I would come back and just order like two or three S.T.A.S.H. rolls. The Futomaki roll was good but just a step below the S.T.A.S.H. roll and had more of a vegetarian flair with the egg, mushroom, pickled radish, asparagus, and wrapped in Japanese kelp. Eel was also in the roll as well.  The uni was a solid 8 out of 10.\n\nThroughout the meal, waiters brought out other complimentary items including a pumpkin tofu,  fried eggplant in a sweet broth, and yam cake for dessert. The yam cake came soaked in a sweet syrup and was just amazing. The pumpkin tofu was very creative, likely a seasonal item, and very light in flavor in that you couldn't really taste the pumpkin that much but it was a great way to start off the dinner. Our server indicated before the holidays started, they had offered an edamame tofu. Tsubasa Sushi just took honors for our favorite sushi restaurant in the Bay Area and we'll certainly find ourselves coming back here again hopefully in the near future. You can't seem to go wrong if you get only the omakase or a bunch of rolls accompanied with cold/hot appetizers.", "author": "Albie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "My favorite place in the city for sushi hands down! Always fresh and delicious sushi, friendly and amazing service!", "author": "Olga T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "I'm a regular here. It's my default for sushi when I'm not trying something new. They have a fresh menu every day, and serve the classics plus all kinds of fish you don't see elsewhere in town. Like \"Wild BoneMouth,\" \"Blackthroat Sea Perch,\" \"Goat Fish,\" and \"Amberstripe Scad,\" which are on the menu tonight. They do it well, too, and usually end with a cute free dessert. Everything is delicious and you should go here if your interest is good sushi.", "author": "Craig H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "So close to my apt. Dangerously close. Waited much too long for our table bc the chefs were overwhelmed by the omakase orders that night. We eventually got seated, after I almost fainted from starvation. I'm kidding but we had killed some time getting drinks around the corner down the street and after 1.5 waiting and the host couldn't seat us. We suggested we'll just munch on edamames first. For the long wait the host was kind enough to give us a bottle of sake on the house. The sushi was surprisingly fresh. Everything was delicious and I'll certainly go back again!", "author": "Sandy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "My boyfriend made a reservation here on a Saturday for my early birthday dinner. It was amazing! The wait staff were all so nice and attentive! We ordered the special sashimi and the waitress took the time to explain what everything was and how to eat it. It was so pretty and delicious, but definitely not enough food for two people. We also ordered the STASH roll, king salmon nigiri, smoked barracuda nigiri, and the snow crab nigiri. The snow crab was so good, we ordered a second round. Overall, I highly recommend this place! Great food, staff, and ambiance.", "author": "Debo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Everything I could have asked for in a sushi restaurant. Price was moderately expensive but the selection of hard to find fish was exceptional! Definitely get a reservation because it's a small restaurant. We discovered this place 2 months ago and made the trip into the city 4 more times in the same month. Almost resisted posting a positive review to try and keep this place from getting more difficult to get seating :)", "author": "Daniel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Excellence selection of fresh sushi. I tried firefly squid, scorpion fish, tuna and many others. Every bite was heavenly. Helpful and friendly staff was able offer suggestions based on our pallets and preferences. Impeccably clean.", "author": "Ryu B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "A rising star - young sushi chefs of Hayes Valley. Creative new dishes and a selection of unusual and rare sushi. Recently 2017 Michelin Recommended! The crab chawanmushi egg custard is really good and flavorful. Wild cherry salmon, wild japanese yellow jack, onagadai kobujime ruby snapper marinated in kelp. Highly recommend the sesame paste asparagus, delicious. Reservation highly recommended. Early hour walk-ins welcome but time is limited", "author": "Dilys S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-27", "description": "I really wish I could give half points, because this is a solid 3.5. I wouldn't travel across the city for it but if you're looking for a nigiri evening without four dollar signs this is a good option. Our order:\n\nToro Nigiri - I felt that this was actually a chu toro cut. It was reasonably-ish priced, but for $7 a piece I want otoro, not chu toro. It was good enough, not best ever.\n\nMiso Soup - Kind of watery, will skip next time.\n\nJuicy Scallop Roll - This was the best sushi entree and I wish we ordered two. It's really balanced and fresh. I think it can be difficult to take a minimalist approach to a sushi roll and make it sing and they have done that here.\n\nMixed Tempura - delicious. It was basically all asparagus, porcini mushroom, and 1 shrimp rolled in Japanese crackers.\n\nKing Salmon Nigiri - I thought this was kind of fishy. I feel like maybe they cured or smoked or \nboth (or otherwise dehydrated) the fish because the texture was lox-y but it wasn't blowing my mind. A friend we ate with thought it was incredible but next time I'd pass.\n\nS.T.A.S.H. Roll - Would pass on this. Each element was good but not together. The roll is covered with torched yellowtail and they overdid the searing to the point that it was overcooked. The spicy tuna roll underneath with asparagus felt out of place and I'm not sure the asparagus did the spicy tuna any favors. All in all a very lackluster preparation to which I would definitely say PASS.\n\nOshizushi (boxed sushi) - I thought this was pretty good and would gladly order again. Bluefin tuna on quality rice lightly torched, what can go wrong?\n\n--\n\nOur total for dinner for a party of 3 (including drinks) came to $125 pre-tip, which was super reasonable for what it was. Don't know if anyone on Yelp gives a shit but none of the waiters I experienced spoke Japanese, however I'm sure it's Japanese owned with a name like Tsubasa.", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Sushi purists rejoice. The omakase at Tsubasa is one of the best deals in SF! 8 pieces of nigiri for $40 or 12 pieces for $60 is unheard of in this town, especially when the quality of the fish is on par with that of Akiko's or Omakase, imho. \n\nI ordered the 12 pc omakase and it came with super fresh and seasonal fish like amberjack, horse mackerel, giant clam and fatty tuna. The rice was well seasoned and served at just the right temperature (hallmark of good sushi). I also really enjoyed the small dishes (edamame tofu, ankimo, braised eggplant) in between the sushi. This meal would have easily cost twice as much somewhere else! \n\nThe staff and chefs are friendly and knowledgeable.  If you are a sushi lover like me, you must check out this new Hayes Valley gem before the word gets out.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I ended up here while looking for a place to have dinner before attending a show at the San Francisco Opera house. \n\nThey kindly and gracefully accepted my party of two without a reservation, and I am happy they did because the food is excellent, the service great, and the sake selection very good. \n\nI recommend this place wholeheartedly, and hope to come back one of these days when I am in San Francisco again.", "author": "Pablo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Booked a reservation here for dinner with a friend of mine for her birthday and I'm so happy I did! I just found it randomly looking through Yelp and I was like \"I'll check it out\"! So so good! $68 for their 12 course omakase dinner and it was out of this world! Every single piece of fish was fresh and extent flavorful. Couldn't be happier! I'm a legit yelp/real person talking about this place! Go here!", "author": "Tham H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Came here with a friend and they asked us to sit at the bar area while they prepared our seats...Which was off since the place was half full and they had seated us at the sushi bar where it didn't look like they had someone there before...The quality was pretty decent and not sure it matched the price we paid. We had both ordered the Omakase because what else is there to order here. It's good that there was an option to add extras but couldn't really order anything a la carte. \n\nThey told us what came out when they severed it but most didn't match what we saw on the menu so that threw us off a bit. We kept trying g to keep track of what we had and what else was remaining but still couldn't figure it out. They did stay on top of service and kept giving us hot water for our tea, which was great since it was so cold outside!", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "Wonderful sushi spot in Hayes Valley! Recommended by a coworker for a casual Wednesday outing and we had a great time. \n\nThe staff is very warm and welcoming, even brought us a complimentary appetizer to try. The decor and ambiance is awesome, right in the cute little area of Hayes Valley (which is the coolest part of town to hang out now, very chic spots). We had a bunch of sashimi and custard egg things, which were yummy! \n\nIt got a bit crowded 7pm and after with a good lively crowd, obviously enjoying some sake and shooters. We had reserved a table by the window, so might want to do that just for back up.\n\nDefinitely would be back with a small group! Thanks guys!", "author": "Mahsa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "I would definitely recommend going here for lunch, but not for dinner unless you are JUST craving sushi.\n\nFor lunch, they have other items than sushi and they have a solid bento box. For dinner, they only have sushi so if you are craving anything else you are out of luck!\n\nI would definitely recommend their rainbow roll and their salmon and avocado roll. The sushi is really fresh and you can tell they care a lot about the presentation of the food.\n\nParking is somewhat hard to find out in Hayes but if you're willing to walk you'll be able to find a spot. \n\nOverall, this place has solid sushi and for a reasonable price.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Such a fantastic experience! My partner and I came here around 5:30 -  6:00 pm on a Sunday and were seated right away. We ordered a couple different chef's recommended nigiri and everything was super tasty and exceeded our expectation. The chef's recommended scallop was buttery and just melted in our mouths. The unicorn leatherjacket fish was extremely memorable, as were the regular hamachi and chef's recommended ebi. Service was extremely nice. We sat at the bar and the chef made sure that we were happy with the food we got every time he served us a dish. They also gave us two complimentary oysters and two complimentary desserts in the mean time. We are very satisfied with our experience and would definitely come here again.", "author": "Catherine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Stumbled upon this because Domo was closed. Didn't think we'd uncover this gem of a sushi place! Superb quality and totally worth the money. Great service too!", "author": "Felicia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "First thing I noticed was the smell. The place smelled of old fish which a Sushi place should never smell like Sushi was ok and service was fine. I wasn't that impressed. Shiitake roll was disappointing.  Instead of putting a sauteed mushroom they brined it in soy sauce.  The spicy tuna tasted like spicy canned tuna not sure why.  Rainbow roll was ok.", "author": "Adriana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "UPDATE: I came back today to make sure I wasn't dreaming...everything was just as goid if not better than last night. We had a few different items like clam today. Extremely tender and delicately scrumptious! We also tried dessert tonight. Green tea ice cream with fresh housemade mochi. Mochi was so tender and soft, and I loved those tiny toasted rice \"sprinkles\" that garnished the dessert. \n\nSo sad I don't live closer to this place... The fish is so FRESH and all the fish is so delish!!! At first we ordered the 8-piece omakase but after the first 4 pieces of nigiri I had to up my order to the 12-piece. Everything was so fresh and delicious. For piece #12 piece de resistence, I had the uni with fish eggs and my daughter had the toro with gold flake. So beautiful and tasty. Fish to rice nigiri ratio is perfect... Lots of fish, rice not overwhelming.\n\nService is exceptional. Food is excellent. Extremely fresh.  Prices very reasonable! This place is better than other places we've been to in LA.", "author": "Edie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Tried this new spot on this long weekend, I and my partner really had a great time having lunch here. \n\nIn the beginning we felt a little bit disappointed when getting the lunch menu lack of nigiri choices. We asked our server if there was some fish not on the menu we can order. After he checked with the chef and kitchen, he brought us a dinner menu and told us there might be some fish available. We're glad this restaurant was able to accommodate our need.\n\nBack to the food itself, we ordered 8 kinds of nigiri and all of them were delicious. The chefs know their fish very well and are good at dealing with them.\nWe also ordered ankimo, mixed tempura, and toro hand roll, all were tasty. I'll definitely come back for omakase dinner!", "author": "Chen-ling L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "I walk from Japantown to the Mission at least once or twice a week. I was in the mood for Sushi, and had passed this place often, and decided to stop for lunch. It was a busy lunch time and the place filled up quickly. But service was quick, efficient and friendly. I ordered edamame for an appetizer and the Salmon Bowl for lunch. It was all delivered quickly and it was not only visually appealing, but very fresh and delicious. I'll be going back again to sample other great menu items..", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "We ordered the 12 piece omakase after reading previous reviews, and were really impressed! The fish was high quality and perfectly seasoned (no additional soy sauce necessary). It was a good opportunity to try nigiri I wouldn't normally order on my own. The only thing I would say is that the timing is a bit rushed - initially, each piece was brought out after the previous had been eaten, and the waiter even took the time to mark down each piece on our menu; but towards the latter half of the meal pieces of nigiri came out served by other waiters before the previous had even been touched. Here's what we were served:\n\n1) wild spotted perch\n2) arctic char\n3) flounder marinated in kelp\n4) amberjack\n5) wild golden eye snapper\n6) wild horse mackerel\n7) chu-toro (medium fatty tuna belly)\n8) scallop\n9) yellowjack\n10) wild barracuda\n11) toro (fatty tuna belly)\n12) uni\n\nOverall, at $68 it isn't a cheap meal but worth it for the omakase experience. Will definitely return.", "author": "Shannon F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "I was looking for a good dinner spot near the War Memorial and the affordable omakase caught my attention. The 12 pieces of fish was excellent quality and the last dish, sea urchin nigiri with salmon roe, was a big highlight. Service was attentive... even slowing down the pace of the omakase when we started taking our time. Even if you're stuffed by the end, the Oshizushi shouldn't be missed.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Great food and service. But some of the sushi wasn't as fresh as I'd hope for. I think for the prices there could be more creativity with the a la cart menu as well.", "author": "F S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "3.5 stars but rounding up. If you're like me, \"$60 omakase\" is what your caught eye. An omakase in the city usually starts at $100, so it's refreshing to find a quality spot that won't break the bank. Just know that you will likely spend more to get full.\n\nMy girlfriends and I came for dinner and ordered the 15-piece sashimi and 12-piece nigiri omakases (both $60). We also split a few appetizers as well as complimentary dishes. The sashimi is all brought out at once while the nigiri is staggered with 3-4 pieces brought out at a time. Everyone in my group was really happy with our food but we were also tipsy, and that may have heightened the experience.\n\nThe fish quality and variety was good. I wasn't disappointed there. They gave us king salmon, scallop, mackerel, and more. A generous slab of uni was the grand finale and it was amazing.\n\nThe size of the nigiri could have been bigger, hence the lower rating. I'm positive the nigiri was smaller relative to other places. While my other friend said she felt full, I could have kept going.\n\nNext time around, I'll try a smaller omakase and supplement with a few other dishes.\n\nThis is a perfectly good place to get your omakase fix at a decent price point, but don't expect the most over-the-top, fantastic dining experience.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "I ordered the 12 piece sushi omakase, the chawanmushi and the zensai sanshu. The zensai sanshu was a nice sampler, and the chawanmushi was satisfying and creamy. The omakase, however, did not meet my expectations. The nigiri came with very generous amounts of fish, but I personally thought that the pieces were too big and were very tiring to eat. The quality of the fish was great, but nothing too special. If you appreciate a larger proportion of fish to rice, you will probably like Tsubasa Sushi. However, I thought this was far too much fish for my taste and made the whole meal seem monotonous.\n\nThe sushi portion of the omakase came with four pieces of sushi at once instead of the traditional piece by piece style. Service was average as the waiters unnecessarily brought more dishes of sushi to us even when we weren't finished with the first dishes of the omakase.\n\nI don't feel too compelled to come back, but I still think it's worth a try for those who like very large pieces of fish on their sushi.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "Came here for dinner and the food was good, great services, very good sushi chefs checking make sure your dishes are good. The environment was pretty chill. \n\nI recommend this place if your near by.", "author": "Christina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "----update 6-2017-----\nWasn't able to get in without a reservation last time we came by. In 5 years this hasn't ever happened. Wasn't really invited to put our name down to wait for a table. I didn't realize they'd gone to strict online reservations only. :/ \n------\n\nBeen coming here for a while and I love the new chef and menu! \n\nPrices are still reasonable. My favorite Hayes Valley spot!", "author": "Maryanne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Good atmosphere and very attentive service. I was mildly adventurous in my nigiri selection, after a helpful conversation with the server, and the results were quite good but somewhat meagre. Knowing that a full meal of nigiri would be an expensive proposition, we also had some basic maki, which were nothing special, but good and fresh. Grilled yellowtail collar came out last, and for me that was the best part of the meal, especially as it was well garnished with a variety of pretty intense seaweed. I'd go back but I'd probably order a fusion roll or two instead of the maki.", "author": "Steve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Update: the chefs changed :( it's not as good anymore.\n\nI live close by and needed to find a lunch place for my bf's sister, I was actually thinking of Domo, but then this place showed up with better review so I went there.\n\nThis sushi place is the best I have found so far for chirashi and nigiri in SF. The fish was yummy and the rice was flavored really nicely. I love the food here. It is by far the best sushi I had in San Francisco!! \n\nNote: this place used to host a subpar sushi place but the menu and food is 100% different now. \n\nNote 2: We also had some tempura - I don't recommend getting it (nothing special and not fried that well) unless you really don't like fish.\n\nNote 3: if you are on a budget come here for lunch. They serve the same lunch menu on Sat.\n\nUpdate note: I am still a regular. Their sushi is still top notch. Guys, I am still seeing everyone eat rolls here: my question to all of you is: why?! Their Sashimi and Nigiri is what really excel here since their fish is very good... you can taste the difference much better when you get the fish outside of rolls.", "author": "Clara Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "We came here on Wednesday night and pleasantly seated upon our arrival. We didn't have to wait maybe because of the weekday? boyfriend and I ordered Sashimi omakase and we absolutely loved the quality and variety of the fish selection! Japanese uni was the perhaps the best I tried in the city. Waitstaff were friendly and knowledgeable! I'd recommend the sashimi omakase and albacore tataki.", "author": "Joon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "My boyfriend and I had dinner for the first time at Tsubasa on September 29th and again to celebrate my boyfriend's 40th birthday on November 17th. Sushi Chef - John does not disappoint. His skills are on point and presentation is displayed with great love and appreciation for detail. The price is perfect for really good sushi in the city. We did the Omakase style sushi and served us a variety of silky, buttery, fatty types of fish. Overall we had a wonderful experience for the 2nd time and we will be coming here again next year! From the hostess, to the servers, to the sushi chefs at the bar they are all very engaging and pleasant. \n\nTo the comments from others who will not come back because they have seen the chefs not wash their hands, I would ask them so what happens to the restaurants they go to and their kitchen is not visible? Or the other comment about their sushi chef not being interactive, did you ever ask yourself that maybe it was you who wasn't asking engaging questions, being personable were it would allow the sushi chef to open up in conversation.", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "This place is amazing. True hidden gym in Hayes Valley. Had some drunk couple come in complaining about something ridiculous. Everyone around us had a great time. But other than that. Great service and even better head Chef. Make sure you come check out head chef Peter. Amazing sushi place in the City with great service.  Need more of these.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "One of the best sushi place in the city. I love everything about this place. :) \n\nFantastic Food \nExcellent service \nClean\n- $60 omakase for 12pcs -fresh n premium fish\n- buttery toro n salmon \n\nI can't remember the names but just show them the picture. \nWill definitely be coming back! \nSee you soon fishessssss!!", "author": "Sophia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "I'm currently still sitting at the bar and I can't stop raving about this place to my friends through text as I inhale every morsel of each delectable nigiri. \n\nWith the three nirigi omakase options of 4 piece at $18, 8 pieces at $36, 12 pieces at $54, I wanted to try the 8 pieces with the mindset of ordering other items on the menu. \n\nLuckily, I saved room to try the Zensai Sanchu appetizer which included ankimo, ikura oroshi, and toro-toro. Translation for the aforementioned includes fish liver, fish eggs, and fish belly. All served on a spoon with a hint of ponzu sauce. Each were sensational on its own. \n\nWith the 8 piece nigiri which is seasoned by the chef, high level summary on how ecstatic I am about the next selection personally handed over by the chef.\n\nI can't say more with how excited I am to find this gem without having to travel all the way out to the sunset for my beloved sushi go-to spot, Daigo.  Sayonara and konnichiwa!", "author": "Becky Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-18", "description": "Decent but extremely small nigiri. Spent 150 and decided to get a cheeseburger instead. Not sure if this is a San Fran thing. In la I feel like I am getting some value even if I spend 150 a head I walk out full.", "author": "Scott K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Absolutely phenomenal meal tonight. Chef's choice of 12 pcs nigiri. Best Japanese meal I have had in years. Even the Uni was excellent!!!\n\nHighly recommended. \n\nHighlights included the various mackerel selections; the king salmon and the butterfish. Also of special note was the \"candied tomato\" - a French inspired treatment with a Japanese perspective. \n\nYum!!", "author": "Brett A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "This may be my new favorite sushi spot in San Francisco, especially for nigiri - probably the best I've had in a long time (since Tokyo), and especially at reasonable prices. My other favorites are Saru Sushi (comparable prices but lengthier waits), and I've had good nigiri at Pink Zebra and Maruya, but at much steeper prices.\n\nIf you come here, make sure you order the nigiri. We ordered the 12 piece sampler of nigiri ($54) and the scallop roll, and it was enough food. The nigiri was all omakase, so chef's choice, and there were so many different types of textures, varieties of fish that I hadn't had before - not just your typical salmon, tuna, and hamachi), and prepared perfectly. The proportion of rice to fish was excellent (small pieces of rice with a large cut of fish), and different fish had different sauces brushed on them. Similar to how they prepare nigiri in Japan, some of the fish were charred or lightly seared, some had a particular sauce or topping that balanced each variety of fish perfectly, and none were eaten with wasabi or soy sauce. This is the way nigiri should be.\n\nThe scallop roll was also really good, with a miso sauce on top, but the standouts for me were the nigiri. We came late on a Friday night, so there was no wait, and I'm looking forward to making this my regular sushi place in San Francisco any time I want good nigiri. They seem to rotate the fish on a daily basis, depending on what's fresh. At around $40-50 per person, this is a pretty reasonable price for quality sushi, nigiri and sashimi.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Very good fish and rice, nigiri was excellent.  Convenient location, good sake selection and excellent service!", "author": "Glenn S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-05", "description": "Went a couple times, unlikely to go back unless I find myself on that block with no other options.", "author": "H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Our favorite local sushi spot! Staff is really friendly and the food is awesome. The chefs take so much care with each item on the  menu, it's a total treat for me and my husband when we get to go out for a date night. Make sure to get a reservation though, they book up fast and early.", "author": "Eurie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-04", "description": "Grew up in Japan, finding an authentic Japanese restaurant (especially Sushi restaurants) are my passion and KODAWARI (Super particular) after moving to SF. \n\nPro: \nReasonable Omakase price: Omakase Sushi 4 pc - $20, 8 piece - $40, 12pc - $60\nGood Sake list with many common sakes and reasonably priced\nEasy to book \nHokkaido Scallop - order without Wasabi, taste the sweetness of Hokkaido :) \n\nCon: \nNo bar seat experience: we were seated next to the roll guy, by looking, i think he is the newest and youngest apprentice. not much conversation... \nUni: on the menu it says from Japan, but when i saw the box, it said \"from Russia\" (in Japanese).. when i asked the chef, i guess he doesn't speak Japanese so he asked the owner? and just told us yes it is from Russia...that is it, no sorry miss-print, nothing. now i wonder if other fish we ordered were actually from Japan. \nWasabi: i am not one of those telling chef to remove the wasabi, but the chef put too much wasabi, it overtaken the flavor of the fish. In order to enjoy the sweetness of Hokkaido Scallop, i had to get another order of no wasabi - finally it was so good! \n\nthe main chef (owner?) used to train with Ken-san from Yuzuki who trained with Sam's in San Mateo which is my go-to place. would i go back? probably not but i think the NETA (fish) was fresh and good enough for many people.", "author": "Sisi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Hand down best sushi experience I've had in SF - in my opinion. We sat at the sushi bar (I highly recommend doing so) and had the pleasure of ordering from Chef Peter who provided us with amazing service the entire night. The quality of the sushi was more than impressive and Chef Peter had the best recommendations. If you are in the Hayes Valley area come to Tsubasa - you won't regret it!!!", "author": "Heather A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Had a craving for sushi and saw this place and took a chance. Wonderfully attentive and friendly service. Good sushi with interesting pieces for a set sushi lunch. Good choice for sushi if you are I. The neighborhood.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Tsubasa was on my bookmark page for a while and I finally got to try this place a couple weeks ago. Reservations was also very easy to make on Yelp. So, we got the 12 piece nigiri Omakase and all the pieces were amazing. The fishes were all very fresh, served at the perfect temperature, not too cold. All the sauces and decor paired with the fish were also very delicious. Loved the variety of fishes and other seafoods. Chef Peter was also very knowledgeable and dedicated to his craft. We even ordered 4 or 5 more nigiri cause 12 was just not enough. First time here and definitely won't be the last.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Best sushi since moving to the Bay Area so far!\n\nFood: \n\nTsubasa's sushi is very fresh and generously cut. You can really taste the thought that goes into each piece of nigiri! \nThe nigiri is prepared in a way that does not require additional seasoning, so the food just melts in your mouth. I really enjoyed each dish I ordered, and was delighted by each of the sushi's tastes. We ordered: fatty tuna, king salmon belly, uni, butterfish, live scallops, salmon & mackerel\n\nService:\n\nWait staff was attentive, and very helpful with recommending a sake that paired well with our meal. They also took the time out to explain each dish as they served it to us! I really enjoyed how the chefs sent out the sushi in small sets so that we could savor each piece one by one and space out our meal without being too stuffed at the end. The chefs were kind enough to give us complimentary dishes (a seaweed with octopus starter & saltwater eel nigiri). Probably because we had such obvious food-gasms ;-)\n\nPrice:\n\nVery reasonable prices, especially for the quality and freshness of the fish. We ordered 8 different sets of nigiri with a bottle of sake and the total turned out to be $114!! \n\nAtmosphere:\n\n-Clean and stylishly designed\n-Nice music that wasn't distracting \n-Great view of the chefs!\n\nOverall awesome experience, and I will be coming here again!", "author": "Brittani C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "We luckily got in for dinner without a reservation. This place fills up quick! The sushi was probably some of the best quality I've ever had.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "I really like this place! The fish was really fresh and the prices were very reasonable. Spent $250 for three people and we were super stuffed. The staff was very attentive, and they gave us a lot of complimentary things like tofu and dessert. Also, if you come for a birthday, they give you free green tea ice cream and homemade mochi!! So yummy.\n\nSome of my favorites:\n\n- steamed egg with mushroom/crab\n- Kamasu nigiri\n- Kinmedai \n- King Salmon\n-Toro\n-Ankimo\n\nWould recommend!", "author": "Mily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "sushi is pretty good and has an extensive drink menu to boot. had a selection of nigiris and appetizers. it was all tasty but I've had better sushi in SF (Ijji, Maruya, Saru..). The ambiance is a bit impersonal and uninteresting - all the aforementioned places or Elephant or Tsunami have better ambiance. It's a solid 4.", "author": "Ruben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Tsubasa Sushi is a cute little restaurant in the middle of Hayes Valley. We were forced to change plans when we found that Brenda's only serves breakfast for dinner on Sundays.\n\nWe ordered a bottle of Chardonnay, the mixed tempura, miso soups, seaweed salad, a S.T.A.S.H. roll, a T.A.P.S. roll and Tekka Maki. The mixed tempura was very unique, serving up corn, asparagus, and shrimp, rather than your standard green bean, onion ring, and potato. The seaweed salad was your standard prepackaged salad that every sushi restaurant serves (love it). The miso was pretty average, but all of the rolls were well rolled using high quality ingredients. The seared yellowtail on the S.T.A.S.H. roll paired well with the spicy tuna and the tempura gave a delightful crunch to the T.A.P.S. roll.\n\nI generally order the same thing at every sushi restaurant (bento/dinner combination with tempura, sashimi, and sushi) and Tsubasa's small menu made me dance outside of this zone, but it's always a great sign when a restaurant limits its menu to things it does well.\n\nThe restaurant was clean and smelled of the ocean. Service was quick and friendly. Will definitely visit again", "author": "John P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "We came here early one Saturday evening without reservations and were seated after about a 40-minute wait. The quality of their food was fairly inconsistent, with some items beging very good and some fairly subpar.\n\nGood: - Juicy Scallop\n- Oshizushi (fairly unique - haven't seen this anywhere else)\n\nOK: - Chawanmushi w/ unagi (the egg custard was a little too liquid)\nHirasuzuki (not my favourite as it was not very flavourful)\n\nNot Good: - S.T.A.S.H. (was a little too dry)\n- Futomaki\n\nThe service was OK - they could definitely have been more attentive. Overall, Tsubasa is decent but there are better options for sushi in San Francisco.", "author": "Vikram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Came here for dinner, we had a spread of various rolls and nigiri (and lots of sake). Beautifully presented and several of the nigiri were garnished in such a way that you didn't need soy sauce/wasabi added. I have cheap taste in alcohol and stuck with my hot sake but everyone in our group seemed to enjoy the various cold sake options they got. The waitress was very attentive, friendly and helped with sake recs. Will definitely come back here.", "author": "Debra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Came here for the first time tonight. Everything is amazing!! Japanese uni is the best. Must try it. Our sushi chef John is amazing and recommend all the wonderful sashimi. I highly give this restaurant and our chef a 5 out of 5 star. If you are in SF. This is a must stop spot!", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "The food was delicious. I usually don't like sushi in SF I prefer LA sushi, but Tsubasa may have me rethink that evaluation.  The uni may have been the best thing there, but you can't go wrong with their omakase or their house special fish.  Also, they were very nice about the fact that we got rather drunk there on sake.", "author": "Diver G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "I am not the type of girl to come to fancy restaurants and order expensive food and blow my money like it's nothing (I am frugal af and would rather find my way to dat dollar menu youfeelme). But, my boyfriend and I wanted to do something very special for our 2nd anniversary, he has more of the taste for the fancy, high class stuff so he thought we should give it a try. He's bae so of course I want him to be satisfied.\n\nMake reservations! Not sure if they allow walk-ins but it's a very small, intimate restaurant with 3 or so servers. Dim lighting - big scoring points for bringing a special someone here or if you tryna impress your lady friend, cause I know for sure it made me some typa way (just my opinion lol). An older, more mature crowd here; as a young adult trying to adult, i felt like a real adult (my bank account says otherwise unfortunately qq). Small lulls of conversation everywhere around, it felt nice and soothing almost.\n\nThe servers were very tentative and so nice! Always coming by for refills and quickly clearing the table when I just about finish my plate.\n\nWe had ordered the 12-piece Nigiri Omakase ($68 per person) and I must say it's an experience. It will take time to get through Omakase (over an hour or so), but I think it's pleasant since you try little by little. By doing this, I don't feel bloated or too full when done and you get to interact in good conversation in between the courses. Definitely a must try and the vibe/service of Tsubasa made our 2nd anniversary that much more intimate and special.", "author": "Angelica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Being a self proclaimed Sushi enthusiast and have eaten at many high end sushi spots It's the best omakase deal in SF.  I've gone to tsubasa multiple times and chef peter never disappoints.  Will definitely be coming back!", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Amazing sushi. Best I have had. Such a diverse selection and everything was just so fabulous.", "author": "J A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-08", "description": "Second time here was not a great experience. Nigiri was so-so, and service was extremely slow. High points were negitoro hand rolls, chutoro tataki, and chocolate barley frozen custard (minus the mochi). Our previous visit was at the sushi bar and much better overall. We might try again or give up forever.", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Went here a few weeks ago with some friends for the Omakase dinner. It was exquisite. The fish portions are generous and the selection was great. There were many types of fish that I never even had before, (all of which were tasty). Chef Peter knows his craft for sure. \n\nI usually don't like barracuda--too mushy, but that night he changed my mind. It wasn't \"melted\" according to him, which is a result of chefs buying less than par cuts. Will definitely be back.", "author": "Nam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Friendly sushi chef. Excellent food. Reminds me of Tokyo sushi places with small elegant atmosphere. Gets busy after 6pm. Get the Omakase 12 piece special $68:)", "author": "Piedad I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "My boyfriend and I love Tsubasa.  We've been twice and the price point for the omakase and fish selection is amazing.  Sake prices could be a little better and we'd love to chat with the sushi chefs a bit more, but I appreciated that they recognized us on the second visit and get too busy to chat.\n\nWe'd love to go here every couple of weeks, but it can get pricey once you order an appetizer, omakase, and sake.  However, the level of sushi is comparable with much higher priced sushi restaurants in SF and make this place a hidden gem (and a steal!).  HIGHLY RECOMMEND.  Oh, and make reservations.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Tsubasa Sushi in San Francisco is an enjoyable fine dining restaurant for the average eater. Taste experts will be able to differentiate slight imperfections in the fish served. Their 8-piece omakase was priced at $50 even - expensive from an outsider's perspective but understandable and maybe even reasonable within the SF fine dining spectrum. Some notable pieces were the semi-raw sweet shrimp, which had a slight lemon dressing, and the summer flounder which was topped well. Both had perfect texture and tasted superb. The Canada salmon reminded me very much of smoked salmon with a hint of more \"sushi salmon\" flavor embedded. It was a refreshing touch to be eaten with rice. The uni, supposedly from Japan, was very mediocre - nothing special, and the aftertaste was not like other sea urchin I have eaten from Hokkaido (where most Japanese uni is received from in the United States). I was disappointed in their uni. On the contrary, the ikura (salmon eggs) was marinated very well and had no fishy aftertaste. The bluefin (maguro) chutoro was not cut well and showed Tsubasa's lackluster attention to detail when estimating taste from appearance. Tasted good, but not impressive. Service at this restauarant was excellent, although it took about 30 minutes to receive my second half of omakase (4 pieces) from the time I received the first half. Overall, Tsubasa is an atmosphere-based restaurant that delivers exquisite taste in some regard, yet misses perfection by a wide margin. 3.5/5", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Tsubasa Sushi is one of the best sushi restaurants I went in US. Its westernized decor is not like conventional Japanese sushi restaurants, but their dishes are authentic and the quality is even better than typical sushi restaurants in Japan in that price range ($50 per person) - I'm not comparing it with Jiro;) In fact, most of their fishes are imported fresh from Japan. We ordered zensai (appetizer) and a la carte nigiri sushi with cold sake. Sushi was served in a perfect order and timing. Su-meshi (=shari, rice) and seasoning are just right to enhance the taste of neta (topping). The chef (and waiter/waitress) definitely knows what they are supposed to do. If you want to eat just rolls or expect other Americanized Japanese dishes, go somewhere else. If you really want to try real nigiri suhi, go Tsubasa. Highly recommended!", "author": "Jun S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "This place is the definition of average sushi. Nothing was beyond what you would expect at a random sushi place you might stumble into. Location wise yes, it's strategically placed in the heart of hayes valley so it seems like it's going to be great, but just expect standard. I've been here 4 times and the experience is the same each time. \n\n- Quality of fish is just okay, none of the rolls are unique or stand out\n- If you like to order premium fish like Toro, it's not going to be as good as other places and I'd suggest to save your pennies for a better Toro experience (like O-toro a couple blocks away, a WAY WAY better spot)\n- No gyoza or garlic, spicy edamame\n- Miso soup is very watery and bland\n\nAlso, my ears were in shock when the waiter told us \"sorry, the chef is not accepting nigiri orders right now unless you want to wait 30-40 minutes\". It's simply unacceptable to tell a customer that at a sushi establishment. ESPECIALLY when it wasn't even that busy, 1/3 of the tables were empty on a Friday night. Sounds like they need to staff up with another chef.\n\nIf you're in the neighborhood and don't mind an average sushi experience, go for it. If you're expecting something to be reflective of 4.5 stars, don't go here and take your wallet to O-toro instead.", "author": "Pratul L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "came here for lunch today and thoroughly enjoyed it. it's a little expensive, especially or lunch, but the sushi was fresh, the miso soup was very good and the service was excellent. their are interesting choices of rolls and donburi. I don't understand why I haven't been here before, but I will be back for sure", "author": "Bob U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Fish was fresh, ambiance was good but a little pricey for just \"good\" fish. Parking situation was reasonable on a week night late dinner, otherwise can be a difficult spot to drive to. Waitress was very attentive and explained everything clearly. Next time may try dining at the bar, if I ever get to return. Oh too many options, not enough calorie burning quotas.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "This place was recommended by my friend.  Yes, this is a great place to have sushi.  I could not believe that the chef is Korean.  This place serve real Japanese food.  The server was great, too!  He speaks fluent Japanese and helped us a lot.  I will come back whenever I come back to San Francisco!", "author": "Kim O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Legit sushi\nGreat alcohol pairing\nGreat service \n\nCan't go wrong! \nThe pressed sushi is the bomb", "author": "Austin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "I've been here in the past and the food is good but the customer service is bad. I came here 30 minutes before closing time and they wouldn't sit us despite having empty tables.", "author": "Rafael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Fresh, quality, authentic sushi. Get the chef's daily selection! Great Service too. You won't be disappointed.", "author": "Mandana N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "Disappointing...\n\nSat at the bar and watched a guy wrap sushi rolls with saran wrap all night. Based purely on yelp reviews I had expected a traditional Japanese restaurant but upon walking in soon discovered this was her another American - Japanese joint, not run by Japanese people. This places lacks quality and Japanese sophistication. \n\nOrdered some appetizers to start and the nigiri a la carte: \nChawanmushi (crab)- lacked any flavor whatsoever \nJuicy scallop roll- scallop was sweet and silky but was masked by a blob of wasabi in the roll\nSashimi- I had specified for the fatty fish to come out last and even so they brought out the fish in all the wrong order.... What kind of a true sushi chef brings out the o-toro before the white fish ?! Mixed thoughts on the fish ... Although fresh they were mediocre quality because the flavor just wasn't there. Also, rice fell apart and wasn't great. \n\nService: nice, friendly, and made up for their mistakes by bringing out additional dishes/ sake but I was expecting a top quality traditional Japanese meal. If I wanted Americanized Japanese cuisine I could have very well gone elsewhere. \n\nBottom line: If you're looking for a neighborhood place to kick back and have a beer/sake with some friends while snacking on some rolls, Tsubasu has a good atmosphere for it. If you're looking for a traditional Japanese meal, this isn't the place for you.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "A San Francisco gem !! Consistent, affordable, delicious.", "author": "E. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Stumble upon this place after my haircut in Hayes Valley. I had a spider roll and a Hamachi nigiri . The sushi is very fresh and the sushi rice tasted good. I haven't explore the menu enough to give a fair rating but what I ate tasted good. The waitress and the sushi chef is very attentive and fast so nothing to complain. Definitely will go back with my hubby so we can try more foods.", "author": "Becky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Super yummy sushi! We came here for dinner before heading to Davies Symphony Hall for a show. We didn't have reservations, but they were kind enough to seat us at the counter (this was around 6:15pm). The food was delicious and fresh and our servers were so sweet. We'll definitely be back!!", "author": "Claire M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Wonderful low key sushi spot..amazing and fresh..imported daily and high quality! If it was a weekend night I would recommend a reservation! Very small but great San Fran find! Will definitely come back next time we are in the city! A plus, it was very reasonably priced! \n\n12 pieces of special nigiri \n2 rolls \nPlus drinks \nAnd tip came out to $110!!", "author": "Lexi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "I am so glad to be introduced to Tsubasa, My husband and I are major sushi fans, we can literally eat sushi DAILY. Their sashimi were fresh, their sushi rice was on par to those in Japan. I ordered the 12 pieces omakase, and I was NOT disappointed at all. I indulged in EVERY pieces of chef choice nigris and it was only $68! The weekend before I tried Tsubasa, my husband and I were at some top notch sushi place in downtown SF and it's 138 per person for omakase (and not as good as Tsubasa)! Needless to say, Tsubasa is now on top of my SF/bay area sushi list, and I'll definitely will come back again and again.", "author": "Nikole X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "update: there is a pokestop right on the corner where Tsubasa resides. Come for the amazing sushi, stay for the pokemon.", "author": "Bo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Tsubasa is honestly so good & so underrated! The sushi chefs here definitely know what they are doing & are so sweet. I got the 12 piece omakase and the fish was so fresh and delicious. I'd for sure recommend this place to anyone and I love the fact that this place isn't super pretentious like other sushi joints. Also, their prices are very reasonable for the amazing quality that you get. If you haven't been here yet, go try it ASAP", "author": "Emily U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "Consistently great. I suppose at this price point there are a bunch of sushi places that will probably be fine, and we could argue for hours on what exactly five stars means any more, but this place works for me. Great miso, uncommonly prepared maki, and interesting sashimi options? Check. Just need to come back more often.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Really great sushi place with high quality fish.  And the place isn't stuffy or overly formal, or even that pricey compared to other high quality sushi joints in SF.  Highly recommend!", "author": "Candice B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "So good. Had the sushi mariawase lunch special and the 5 piece chefs choice was just soooo delicious. Each piece was beautifully made and the seasoning was just right.", "author": "Kerr T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "My friend and I came here on a Tuesday night. We arrived at 7:30pm and were seated immediately even though our reservation was 8:00pm. The place is not too big and the ambience was quiet and lovely. The servers were very friendly and attentive throughout the night. They even recognized my friend who had been there for only three or four times. We ordered the Zensai sanshu for appetizer as our server recommended as well as the 12 peices nigiri Omakase and they were fantastic. Each piece was very unique, fresh, and flavorful. Wonderful experience!", "author": "Winnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Tsubasa is good.  How good?  Good enough that I feel conflicted about writing a review on yelp, fearing that i will never be able to get a seat myself anymore.  \n\nSimply put, the fish is top quality, the rice is perfectly cooked, and the seasonings are on point.  And for the $60, 12-piece omakase, they served uni and giant clam (!), 2 of my favorites that usually never come as part of the prefix.  That is very, very generous.\n\nAs I foresee this place taking off like Saru and the likes in SF, I will treasure my time to be able to still drop in without a reservation, for as long as I can.", "author": "Jiajia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Came here for dinner and the food was great. Don't miss the dessert. Also lovely staff. Definitely recommended", "author": "Niaz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "Tsubasa was recommended to me through a friend. And last night I finally made a trip out to Hayes valley, WARNING: prepare to hunt down a parking spot. \n\nThis review is mainly for the IKURA, which was bomb.com. It was house cured and I definitely appreciate that. I would come back just for this alone. \nWe also ordered the 15 piece sashimi ($60) it came with blue fin tuna, scallop, kurodai, king salmon and I forgot the 5th one. All the pieces were good, but I wasn't completely blown away. They did not have any uni so I was quite sad. But the chef gave up a complementary grilled eggplant appetizer to make up it, it was surprisingly good.\n\nI'll be back again, for the ikura alone.", "author": "Evelyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "This sushi spot is a hidden gem in sf. It's hard to find an authentic/traditional sushi bar that has a fair price range in the city. Highly recommended - sit at the sushi bar and meet Wilson (sushi chef). Tell him what you enjoy and he'll cater your meal to that. We spent $114 (incl taxes) for 2 and had omakase, 2 rolls, uni nigiri, and wine. Also had some complimentary appetizers/desserts which were delicious and a nice surprise :) Definitely coming back!!", "author": "Eileen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-06", "description": "Replacing another sushi spot in Hayes Valley, Tsubasa is a new Japanese restaurant that offers both omakase as well as a la carte sushi. They definitely still have some kinks to work out in the kitchen and with the service. I had the 8 piece nigiri omakase. It comes out 4 at a time, unlike the piece by piece omakase at all the high end omakase spots in San Francisco. The quality of the fish was great, but the fish was sliced too thinly, making the placement awkward on the rice. I also tried the futomaki, which uses a soy wrapper instead of the traditional seaweed wrapper. I thought the flavors were great, and I loved the addition of the unagi in there. I wasn't entirely opposed to the dining experience and would definitely give Tsubasa another chance in the future, once they've worked out some of their issues.", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "We had reservations for 4 at 6pm.  We arrived promptly and were seated, we let our server know upon her asking that had to attend a show at 7:30.....our food arrived slowly at 7:10 pm and not at the same time for all of us!  Service was slow and plates arrived one at a time making our party awkwardly eating fast and at different times.  We barely made it to the show close by (fortunately).  Tsubasa used to have better service.  Food was good, portions were tiny but not worth the wait.  It was our last time eating there.", "author": "Nuria M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-08", "description": "Fish was not fresh. I will not go back to this sushi restaurant.\n\nI walked into the place, and there was a overwhelming fishy smell\n\nNone of the fish tasted fresh. The staff seemed like they were unknowledgeable - and were pretending to know about sushi. Poor service.\n\nBottom Line: bad sushi because the fish is not fresh - bad service. Do not come here for sushi. \n\nI would give it 0 stars if I could.\n\nBad sushi.", "author": "James E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-08", "description": "mmmm, i thought this place was just ok.  came in last night for the 12-pc omakase dinner. while i enjoyed most of the pieces and i thought the fish to rice ratio was good, nothing was outstanding.. i cant really tell you what i had, which is not a great sign.  the price is quite reasonable - $60 for the 12 pieces, so i would probably come back to try it out again.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "When you get sick of eating the same sushi, like tuna, salmon, eel, etc., go to a real restaurant. Tsubasa. They get the finest fish from around the world and it is prepared to perfection.  The Arctic Char and Amberjack are simply fantastic. And order the Seared Mackerel. Excellent. If you HAVE to have a roll, get the Holy Crab. Holy Moly indeed!\n\nDo leave those bad habits of dunking the fish in soy sauce before you eat it. The chef will chop your hand off if you try it (not really, but you'll ruin the fish and the whole point of eating sushi in the first place).\n\nUnless you know what you're doing, stay away from the belly stuff. Those fish are an acquired taste.\n\nOishi!", "author": "Joe E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "I'd give it zero if that was an option. Although we  came in a party of 6, which understandably they didn't have enough space to sit, we saw an available two seats and another four seat table. Even though we proposed to split our group, they still refused to sit us.", "author": "Rajiv A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "Wouldn't seat a party of 6 even though we offered to split up. All because we are friends", "author": "Sonny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "My husband and I loved the food presentation and service was excellent. The fishes were fresh and tasted great. Additional bonus: They gave us complimentary green tea ice cream after they learnt we were celebrating my husband's birthday.", "author": "Maya L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "Superb dinner - authentic and extremely high quality sushi by skilled Japanese chefs. Impressive in all respects. A bit pricy but in this case, you get what you pay for. Wow!", "author": "Bob D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Amazingly fresh fish and by far the best sushi in Hayes valley. A bit pricey but worth it.\n\nWe did the 8-pc Omakase with favorites being the barracuda (kamasu), Black Sea bream (kurodai), blue fun tuna, chu-toro, flounder (hirame) and wild amberjack (kanpachi).\n\nService is also great and we got seated quickly.\n\nWill definitely be back!", "author": "Farid V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Wild. Fresh. Not frozen. Tsubasa is hands down one of the best sushi restaurants in Hayes Valley. They pride themselves on serving fresh wild fish. They have a great variety as well as some of the standards. But definitely get something off the wild menu. Everything is beautifully prepared and plated at just the right temperature. Ask for a belly and have it lightly seared for a melting experience.", "author": "Phil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "The food is pretty decent! I can't believe I've never been here before since I live in the neighborhood and  have passed by this place so many times....there's no significant sign outside at all...not at all...if it's not I searched on Yelp I'll never know that there's a sushi restaurant there. Please put up some kind of sign out there please!!", "author": "Porscha Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "Went to go to THe One sushi but it was closed and this place was there instead. Pleasantly surprised, the sushi was DELICIOUS, service was good, and prices were pretty reasonable. About $35 / person including some sake. The menu is small which makes choices easier, and the place was simple and fast. Will certainly return.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "Never disappoints! Great service, amazing value and freshest seafood. Their menu changes based n the fresh fish they get from the markets. All the nigiri tastes great and have complex flavors. I never even need to use soy sauce or wasabi because the sushi is already perfectly seasoned. My favorite place in SF for nigiri and sashimi. Rolls were great too!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "The fish is super fresh and melts in your mouth. We got the omakase and the butterfish.", "author": "Tran N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Amazing sushi. The kind you dream about. Wish you knew about and almost don't want to tell anyone else exists. Basically some of the best Sushi  in San Francisco.", "author": "Tao G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Definitely my new fave sushi spot in town! We stumbled into Tsubasa randomly. Hungry and thirsty after a walk from NoPa, we were seated in 10min on a Friday night. We ordered a few items on top of the 8 piece omakase. Our food came out relatively slowly, but everything tasted so good! The fish was super fresh and excellent quality, which makes the value/price ratio quite awesome! We came back with friends the following weekend after our delightful first experience. We ordered a ton of food and everyone loved it! My picky-eater boyfriend even liked some of the fish that he normally wouldn't eat and decided to become a regular here. The chef even offered us complimentary sake! We left with happy bellies and feeling all around magical. Coming back here soon!", "author": "Nana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "Definitely a great experience. If you order omakase they throw in little dishes in between (I recall an eggplant and candied tomato). Sushi is pretty solid, but not the best I've had. The service is phenomenal. Very good prices!", "author": "J L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Not sure about the 4.5 stars more like a 4 star. We ordered a beer and sake and the first thing the server said is \"we do not do sake bombs here\" I looked at him like and said, \"do we look like kids or college kids that would do that?\" It may be subjective, but the impression the staff gave me is that this is not my type of crowd to come back to. Would I go back. Maybe but there are several other sushi places to go to before I go back to this one. Sushi was ok. They had a great selection and variety of fish. Quality was overall a 3.8/5. Meaning room for improvement is there. They haven't reached their ceiling yet.", "author": "Miguel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "I'm absolutely amazed by this new spot. Thanks to a dear friend who promised to take me to a \"great sushi\", I must say the promise was highly kept! We had a few rolls that were delicious and to try something special we had the chefs appetizer - yummy and gorgeous! The service is remarkable. Perfect for a date, for a solo stroll and for a friends-get-together!", "author": "Valentina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "INCREDIBLE food and presentation. Got the omakase and enjoyed every piece. Hands down favorite sushi place in SF!", "author": "Naomi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Come with my friends from South Cal and was looking for sushi place, this place is delicious and I will definitely return.", "author": "Collin N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-11", "description": "We talked in for a snack when half of the restaurant was empty. Yet they told us that they couldn't seat us for even 10-15 mins. The customer service was incredibly rude. Will not come back again for a snack or dinner .", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "Came here with my family - we were a group of 10 (3 adults and 7 kids) and they refused to seat us even though they had two tables available that could fit us. The head chef and hostess said 'No' outright to us because i assume that they didn't want to seat a family with a lot of kids. Can't believe that happened - that has never happened to me in all my years of eating out. That is just straight discrimination. Unbelievable in this day and age. I would give it zero stars if possible.", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Solid sushi place and good value for the money. Good quality sushi and friendly staff. Would go back.", "author": "Y E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-27", "description": "Probably one of the worst sushi I ever had. \n\nI came here because of \"Michelin recommended\". However, I found that this is just  another Chinese owned casual Japanese restaurant, that means, they care about \"making more money\" than \"making good food\",  no one speak Japanese but English with Cantonese accent , if you want to try omekase and don't want to pay top dollars, this is your choice, the food is not the best in Bay Area: Miso soup was watered down, served with a spoon (not  a Japanese way); each nigiri was just  a very tiny and  thin piece of fish and was pre-marinated, which made me not able tell if the fish was fresh or not; chawamushi was just simply steam egg with no flavor.....the presentation was nice but the taste of food was not authentic, for people who don't know anything about sushi, it's a \"good place\", besides, the  chef was wearing gloves when making sushi , it looks sanitized but not sure if he changed them when making a different sushi, the wrinkles of gloves could have harbored  many bacterias already. After all the  price was cheap compared to other upscale Japanese restaurant in Bay Area, the service is pretentious, slow but ok. I won't recommend this place for sushi to anyone.", "author": "Shan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "The freshest sushi I've ever had! The restaurant was very clean. Definitely worth it if you're seeking a special sushi experience. After having the Omakase, my boyfriend and I asked the chef to surprise us. The Chef, Wilson, and the entire staff were very friendly and welcoming. We had a blast trying all of the chef's recommendations, chatting with the staff and drinking a little too much sake (which was also amazing). Oh, and the arctic char was to die for!\n\nWould highly recommend & will definitely be back!", "author": "Lexi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "We both ordered the 12 piece Omakase, it was amazing! One of the best and great place to go before symphony or opera.", "author": "Leah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Apparently this place was opened only 1.5 months ago. We sat at the bar and it was great interaction with the sushi chef.\n\nThe seafood were really fresh and prices quite reasonable. Good sake selection as well. Good location to the theaters.", "author": "JayJay L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Came to this nice and well-designed Japanese restaurant with my friends for the first time. The service was great and the food was fresh and delicious. My favorite was the crab and egg. The menu had the date printed so I believe they change menu daily, which is excellent. Will return again.", "author": "Ella Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Went here for my birthday with the boyfriend and had a fantastic meal. The servers and chefs were very attentive to our needs and made sure we had a great night there. We went for the 12 piece omakase and I thought it was great for its price point. The rice was delicious and the fish tasted fresh! On top of our 12 piece meal, the chef offered us some monkfish liver on the house as well as matcha ice cream (for my birthday). To top everything off, all the workers joined in together to sing happy birthday to me. They definitely made my experience the best it could be. Everyone should check this place out because it is definitely worth it!", "author": "Jacqueline H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "They source some damn fine fish, some juicy roe, and the rice texture and temperature is fantastic.\n\nTsubasa is still pretty new so they're ironing out the operational kinks, but I look forward to coming back to sample the high quality staples (hamachi, uni, etc) as well as some of the more seasonal sashimi/nigiri. Who knew it was baby octopus season?", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "First time Omakase and worth every penny! We had the 12 piece nigiri set and the chef gave us an extra eggplant appetizer, monk fish, and free ice cream! Ten out of ten on a delicious scale", "author": "Sam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "A hidden gem in Hayes Valley! The 12 piece nigiri omakase is a great deal in the city, with fresh fish flown in from Japan. Chef Wilson is friendly and makes a meal at the sushi bar an incredible experience, with complimentary appetizers and unique desserts. The highlight of my meal would be the uni at the end of the omakase. It is heaven in a few bites! :) \n\nI'd give Tsubasa 6 stars if I could. 5 for the tasty food and a bonus star for Chef Wilson and his incredible team!", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Stellar service and great food. My friend and I had a bad experience at O-toro Sushi and left after waiting 30 minutes for a table. Tsubasa was able to accommodate us. The rolls are great and the steamed egg was delicious. They also gave a few dishes, compliments of the chef, that were very good. Will definitely be coming again.", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "Came following a matinee showing of the SF Symphony, looking forward to some quality Japanese food for lunch to impress our visiting relatives.  Unfortunately, we were refused seating even though we were willing to split into two separate tables (that WERE available).  I have never been so shocked AND embarrassed by such inhospitality - we did not make a scene though we should have, we were in such disbelief - when was the last time you were simply refused service?  Has never happened to me in all my years and travels around the world, including Japan.  Papito's around the corner, though busy, greeted us happily and without any reservation.  Find another place for Japanese food - don't support this restaurant's behavior that gives 'discriminating customers' a whole new meaning. Absolutely unacceptable and leaves a bad taste in my mouth, no matter how good their food might be.", "author": "Eva C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-17", "description": "Tsubasa is really good at making their sushi look pretty and plating everything to look like they are high quality. I was a bit disappointed by the quality of their fish and just overall taste and experience of the meal :( my boyfriend and I ordered the chef's choice sashimi for $40 with a side of sushi rice, battera roll, hamachi nigiri, one of their special chefs choice appetizer (shoyu ikura, Maguro, and monkfish liver), and spicy albacore hand roll. The chefs choice sashimi was the most disappointing.. Because the sashimi didn't taste as buttery (a bit chewy) and did not have any taste to it (very bland and no dimension- would have tasted better if it was brushed with ponzu). The sushi rice on the side was dry. The battera roll which included Saba and pickled kelp was very very salty, Though I liked the concept of pickling kelp..the mackerel also had some bones left in it. The chefs appetizer was placed so beautifully..However, lacked taste. Because we did not feel satisfied from the meal, we decided to order a hamachi nigiri which took them 25 more minutes to serve to us. The only thing I absolutely enjoyed was the spicy albacore hand roll- probably one of the best I've ever tried. They season the spicy albacore mix with grilled onion which gives it the tangy, savory taste. Other positive notes were the edamame tofu they give you on the house before the meal, and the house sweet potato dessert they give you at the end. \n\nAll in all, I think this restaurant is very ambitious, knows how to set up a great ambiance, and aims to serve beautiful looking food- but the food tastes lack luster :( I left the restaurant not feeling full or satisfied, and like I had wasted my money. I would come back and give this restaurant a second chance- I'd probably try the nigiri mix and the spicy albacore roll :)", "author": "Tracey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "The yellowfin appetizer was awesome, and this place had the best sake I've had outside of Japan.", "author": "Quarup B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-24", "description": "Poor customer service. Mediocre sushi. Had to ask for refills of water 3 times and there were only 3 other tables of customers. Staff wasn't friendly at all. You can definitely find better sushi and a better experience for your money.", "author": "Justin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "awesome sushi and great service.  The fish was fresh and high quality.  Other dishes we ordered were unique in presentation and great in taste as well.  Server was very attentive although the place was super busy. Make sure you make an reservation before you go as I saw them turning away walk-ins due to the amount of customers they already had.", "author": "Lian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-14", "description": "Not a good experience, everthing is salty and too much soysause. The cut of sushi and sashimi is so thin and not fresh, and i will not come back again.", "author": "Wayne Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "My favorite sushi in SF...only downside is their reservation system with Yelp doesn't work well. Their yelp reservation site never seems to work so you have to go in person and wait in line.", "author": "James R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "Not the freshest or most creative... Just ok. There are other, better, spots that feel and taste better.", "author": "Doug L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Love this sushi restaurant. It use to be the one sushi lounge that had horrible service. Now the service is amazing and the food too!", "author": "Jenny J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-24", "description": "This place replaced one of our favorite sushi happy hour spots, I'm underwhelmed. The menu isn't as extensive, missing yummy things like gyoza & ahi poke. The staff there is wonderful and attentive!\n\nWe really wanted to like it, but it just wasn't great. The miso soup and seaweed salad was great, that's where it ended. The rolls lacked enough flavor & there wasn't as much of a variety as many places. We'll try it again, hopefully they improve.", "author": "S V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "Went here before seeing a show and it was great! The sushi was fresh and tasty and we enjoyed everything a ton. We enjoyed it so much we even ordered an extra roll. Only reason I didn't give 5 stars was because the portions are too small for the price.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "One of the best sushi dinners I have had in a while.We forgot to make reservation and had some miscommunication with the guy up front about putting our name on the list. Finally got a seat about 45 minutes later at the sushi bar. We started off with some simple rolls (Rainbow and Juicy Scallop) and Edamame which were all really good. Ended up doing the Omakase 8 piece and it was amazing. Mackerel, Arctic Char, Scallop, and the last piece was Fatty Tuna which was a first for me. Amazing fish and amazing sushi chef, who talked to us throughout. Best part of the night was after we finished, I was talking to the sushi chef about his favorite cut of fish and he mentioned Sardines, which I have never tried. He cut some up for me and let me try it .... absolutely amazing. Despite the wait time and bad start, the night was amazing. Will definitely come back next time I'm in SF.", "author": "Drew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "This place is worth every star.  Expertly prepared sushi, imported straight from the land of the rising sun.  Top notch service.  This will be my official go-to-fancy-sushi spot.  A little pricey, but the quality is worth it.  I just saw a new feature when posting reviews...is there a poke stop.....Are you kidding me?  Is there a flipping poke stop?  I hope you choke if you take your phone out during a meal here.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "We went to Tsusaba to try something new and thank god we did. First of all the staff here are AMAZING. The service was top notch and the chefs were very friendly. We ordered the omakase and it was probably the best I've ever had. We actually ordered a lot more after the omakase because the fish was really fresh. Everything was just on point. The seasoning on the fish, the rice on the nigiris, the sake. We will definitely be back very soon!", "author": "Alex P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Amazing! We ordered 8 rolls and every single one was delicious... I usually can only eat maybe one roll because after that I start to feel full and a little sick. But even after eating so much I didn't feel full or sick at all. It was totally satisfying. I left feeling great, like I actually had just eaten food that was energizing. I have never been to a sushi place before and liked every single roll I ordered. We also had the octopus salad and tuna tataki, everything was great. Our server was also on point and prices are more than fair. Can't wait to go back!", "author": "Amy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-04", "description": "Well the fish is fresh....where is the variety? I eat sushi on a daily basis........and I have to say to only have a few varities meaning tuna, salon and red snapper??? Come on.........The service was good and the chef was nice but I was not that impressed for a 70.00 lunch........too bad.", "author": "Amavi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "We had such an amazing 2 hours dinner at the sushi bar with the head Chef Wilson celebrating my boyfriend birthday. We both ordered the 12 piece omakase, the zensai sanshu trio appetizer, and an unagi chawanmushi. The whole experience was nicely orchestrated. He started us with a house made edamame tofu to open pallet before starting the one by one hand crafted Nigiris. He started off with nice, clean, and light flavor white fishes then progress to more creamy and fattier flavor fishes. In between we were offered a very refreshing pallet cleanser of a cold and crisp Daishi broth eggplant. Nicely done. After a few more pieces of Nigiris, the chawanmushi came out. Which was a very nice intermission. We ended the omakase with a miso soup to wash it all down. Following with light dessert of a Japanese yam. Green tea ice cream with crunchy rice poppers and Mochi came last. Over all the staff was extremely nice. We had a great time chatting with Wilson. Every piece of nigiri was the right temperature and Texture with nicely added touches of sauce, garnishes or torching by the chef. Can't wait to be back for another great experience!", "author": "Nancy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "The nigiri was so good, that the moment when the Saba melted in my mouth, it felt like the world became quite and peaceful; it also felt like being near the ocean hearing the song of waves; it is beyond description. Alhamdulillah, I ran into this place, and it turned out their nigiri is so touching to my heart that I felt like the world deserved to be treated gently and softly.", "author": "jian j."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "I'm fairly certain my date and I did Tsubasa wrong by ordering rolls instead of Nigiri. We had spent a long day sightseeing and stopped in here based on glowing reviews and proximity to our hotel. We had been craving sushi for much of the trip and, despite noting that the nigiri menu was plentiful and included many unusual selections, we opted for rolls anyway to satisfy our persistent cravings. They were fine - nothing I would travel any particular distance for, but disappointing after much anticipation. The service also wasn't particularly attentive - we sat for 10 minutes before anyone even came to our table. Not a good look on a restaurant with 10 tables total. All in all, pricing was very reasonable and the meal was good. I'd like to re-visit and try some of the chef's recommendations, but given I was travelling it's unlikely I'll get the chance to come back. Look to other reviews on here for suggestions on what's great here - they've got to be doing something right with all those great reviews!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "One of the best Sushi restaurants in the Bay Area. Amazing. Authentic. Delicious.", "author": "Luci G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "This is my favorite sushi stop in SF, hands-down. High-quality sushi, great ambiance, amazing staff. All of the nigiri/sashimi is amazing, the holy crab and juicy scallop are a must-have for rolls.", "author": "Eli B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Fantastic!  Really great quality Japanese food, across the board.  The service is great, the atmosphere nice and relaxed, and the fish excellent.", "author": "Corey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "We went with the 12 piece omakase. Each and every selection was incredibly fresh and seasoned to perfection. The sizes were generous and just so damn good we ordered some more nigiri a la carte afterwards. Tsubasa is an instant favorite and I can't wait to get back there again.", "author": "Asi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "The food is always very fresh and I love the ambience. I recommend the eggplant appetizer and rainbow roll, although you can't really go wrong with anything there. Very friendly staff. Request for extra ginger was rewarded with a heaping bowl!", "author": "Venetia P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-17", "description": "2 stars for the food - sushi was pretty fresh\nminus 3 stars for the service - wait staff was completely incompetent \n\nI'm not sure how this place is going to survive.  This was easily one of the worst dining experiences I've ever had.\n\nI met a friend for sushi, we both live in Hayes Valley and since this place had 4.5 stars we wanted to check it out.  \n\nI am now guessing the 4.5 stars and 24 reviews = 24 reviews from friends/family\n\nThe service was horrendous:\n\nPart 1: Drinks\nI ordered a glass of Merlot, my friend ordered sake.  The waiter came back and told me the Merlot was out of stock, but that he had something very similar that was a cab/merlot blend.  I said that was fine.  He comes back and gives me and very light pinot noir, which is nothing like a cabernet/merlot, other than the fact that both are red wines.  Not the end of the world, but annoying when you were expecting something much darker.  My friend had to ask for her sake 2x before they actually brought it to our table.  When she wanted a refill, they charged her for 3 orders, instead of the 2 she actually ordered/received. \n\nPart 2: Food Order\nWe ordered miso soup, seaweed salad and some sashimi to start.  The waiter brought out our salad to share, but no plates.  When we asked for some plates, he said they would come out later.  We were very confused, and decide to just pick at the salad, sans plates.  We also never received the miso soup, and when we asked, the waiter said they would be coming out later.  Isn't miso soup meant to come out first???  While we were waiting for our sashimi, we ordered a roll as well.  \n\nThe sashimi was good, and the ONLY highlight of the meal, it was fresh and came out as ordered.  After we finished the sashimi, we sat there for another 20 minutes, until the waiter finally came over.  Instead of arriving with the roll we had ordered, he asked if he could start taking away plates.  We reminded him that we were waiting for our roll and STILL waiting for our miso soup.  He said \"oh, yeah, okay, I forgot about the roll\" and walked off to put in the order.  He quickly returned to our table, and said \"I completely forgot what you ordered, can you tell me what you wanted again?\" \n\nWhen I looked around at other tables, it was obvious that everyone was having a similar experience - incorrect orders, forgotten drinks, lack of plates/utensils.  \n\nI will be surprised if this place lasts, I hope a better place takes over this spot.  They should consider hiring a competent wait staff to start.  I will not be back.  Incredibly disappointing and a complete waste of money.", "author": "Sichia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "My boyfriend and I have eaten here five times or so now, and each time I'm more impressed with the quality and variety of the fish. The quality rivals that of some of my favorite places and at a shockingly better price. Sit at the bar and order the omakase sashimi and whatever is on the specials list. Don't be turned away if it doesn't seem packed. This place is a gem in a city where so many places are over hyped.", "author": "Marybeth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "So you know those fancy omakase places with the freshest sushi ever, but they cost like $100+ a person? This place is THAT QUALITY. No, really... It's that good. Know those mediocre sushi places that you go to because it's the only option for your weekly fix? It's along that price point. This is really the best sushi I've had in a very long time. If I didn't live in NYC, I'd be here twice a week. Beautiful fish and unique variety, a lot of which comes in from Japan and elsewhere daily. \nWilson at the sushi bar is awesome, so is the staff and hostess! I have a feeling that this is going to end up on a lot of \"best sushi/ top restaurants in SF\" lists soon... Get in there before the reservation wait list is a month long!", "author": "Sandra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Service is really good. Good dry sakes for drink. I had battura sushi and STASH roll and they were so good. Miso soups are not too salty so that was delicious. I made a reservation and they had a table ready for us when we got there. I will definitely come back!", "author": "Justin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "In a world full of critics. I must say, this place was fantastic. We came in due to the reviews and we were not disappointed. My husband raves it is perhaps the best sushi he has ever had and in our travels we've had a lot of sushi. They offered additional dishes from the chef you would not generally order when carving out room to eat your beloved dished and it was a wonderful and welcomed treat.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-19", "description": "This used to be called The One Sushi and Lounge and was my go-to spot in Hayes Valley for sushi. It was my go-to sushi spot not because it was the best sushi in H.V., but because it was affordable, rarely packed, had a TV to watch a game, and had some fun rolls (49ers roll was my fave). They have rebranded it as Tsubasa, raised prices and gotten rid of the TV and the fun rolls! Now you can't watch the 49ers or eat a 49ers roll. They kept the mediocre sushi, changed the decor and upped prices. Not cool for me. Not my go-to spot anymore.", "author": "Sean D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "Had the 12pc omakase with a bottle of sake and everything was fine, but was really disappointed that they didn't have uni or giant clam.  Wish they would've been upfront about this because I spent a decent amount on dinner and was not wowed by any means.  \n\nThe quality of the fish was good, atmosphere was nice, and service was ok.  Price for 12pc omakase is definitely hard to beat, but not sure if I'll come back unless I'm in the neighborhood.", "author": "klb l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Husband and I came here on a Sunday evening. Very impressed with their nigiri. Great customer service, and high quality fish. This comes close to elephant sushi in Russian hill which is by far my favorite sushi restaurants in the city!", "author": "jessica t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Spent an amazing evening there last Friday. I know one of the owners, Eileen, well from previous visits to one of her other Sushi places in the Marina--Naked. This past experience was by far the very best Sushi meal experience I have ever had--from the standpoint of quality and selection and preparation of fish to the service I could not have asked for more. Absolutely off the charts. It set a new standard for me. On par with Sushi Ran at far less the dent in your wallet. Great vibe...loved every minute of it!", "author": "Howard G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "We came here for dinner to celebrate our anniversary. We had made reservations and explicitly requested to sit at the bar. When we arrived to check in to our reservations the hostess looked confused and we noticed that there was another reservation under the same name as us whom did not list a seating preference however our reservation had been crossed out instead of theirs. They had given away our seating to that couple however there were still seats next to them. Instead of giving us those seats she seated us all the way around the corner of the bar where not only was the view obstructed by a pole, dishware, but also saranwrap and miscellaneous items. The seating was worse than just getting a table. We requested to sit at the open seats where our original seats were supposed to be however we were promptly told \"Do you know the chef?\" \"You see we have so many people requesting to sit at the bar\" WTH the hostess looked at us as if we were being unreasonable when she was the one who mistakenly gave away our seating and not checked whether the proper patrons were seated. Once seated, another waiter did apologize instead of the hostess. They tried to offer sake, but we didn't drink so that was a bust.\n\nThe food was ok. The only dish that was good was the artic char and the medium fatty tuna. Certain dishes tasted too sweet and although sounded interesting the egg yolk and uni nigiri piece didn't taste good. \n\nFor the money you spend here you would expect the service to be better. In my opinion the sushi found here could be found elsewhere. I can't say anything was special or memorable.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "This is my favorite sushi in San Francisco. If you care about great sushi this is the place for you. The sushi is impeccable the staff very attentive, the prices extremely reasonable and the beer cold. If you love to dunk your California roll in wasabi and monster roll covered in siracha mayo this won't be your spot.", "author": "Evin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "I can not describe how incredible this place is. I finally walked by last week when they were open and had lunch. The rolls were good, the octopus and cucumber appetizer was so tasty! I was told their dinner menu changes daily so I came back that night for dinner. The menu was the same and they had an additions menu with a variety of sashimi and nigiri options, this is the one that changes daily. At first I was a little let down as I've never been a fan of either, I only ever get rolls. But I decided to try some anyway. I chose 2 to try. Simply AMAZING! So then I had the wonderful chef pick the rest of my dinner that night. I returned again tonight for dinner and once again had the pleasure of watching the chef so delicately slice the fish and make each piece of nigiri. Everything he made me was delightful and savory. Even the presentation is beautiful! The king salmon was just exquisite...melts in your mouth! can't wait to go back soon and treat my taste buds to nigiri heaven.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "I came here with 2 friends. The sushi and sashimi were fresh and beautifully placed.  We ordered omakase and some hand rolls.  It's yummy.  I'd highly recommend it.", "author": "Wing W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Ate here tonight and it was some of the best sashimi I've ever had. Super fresh and served at the perfect temperature. Have you ever eaten sashimi that tasted like they just pulled it out of the freezer? That's not the case here. It was cool but super fresh. The blue fin tuna and king salmon melt in your mouth. We also tried several rolls and every one of them exceeded my expectations. The meal was a little pricey but well worth it! I'll definitely be back next time I'm in San Francisco.", "author": "Neill H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "I'm pretty picky when it comes to sushi, and this is the best I've ever had, except for one high-end Kaiseki place in Tokyo. Chef Wilson Chang, who worked his way up from busboy in various restaurants, and trained with a Japanese Kaiseki master, eschews the lamentable trend in froo-froo rolls, concentrating on exquisite presentations of ultra-fresh, rare and unusual fish: multiple varieties of toro, baby squid, baby eel, baby hamachi, even barracuda. Each is presented with its own unique matched marinade, subtly bringing out the unique flavors of each fish. Soy sauce and wasabi are \"verboten\", and utterly unnecessary. \n\nTry the gorgeous Goldeneye Salmon, or the King Salmon, delicately blowtorched for just a few seconds for a hint of that grilled taste, layered on top of the intense salmon flavors. Finish the meal with macha or black sesame ice cream with house-made mochi dough (fresh daily) and crisp rice sprinkles. Sit at the sushi bar and go on a weekday, not Friday or Saturday: Chef Chang likes to take his time and not rush. Oh - and if you have a friend who likes froo-froo maki, they are available.  But be smart and go straight for the yummy fresh nigiri specials of the day.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "OMG....sushi TO DIE for.... SOOOO good!!!! I went with 3 friends and we ordered a little of EVERYTHING... all of us were in complete heaven.  And the chef sent out recommendations of his favorites.... Hands down BEST sushi I've ever had.   The staff was delightful - so friendly and eager for us to try their recommendations.  I will be back for sure!", "author": "Carly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "This is by far my favorite sushi restaurant in San Francisco. The quality is superb the sushi is always so fresh! The food often looks more like art than a meal. The staff are always extremely friendly and sweet.  I would recommend letting the chefs pick out what you order they never go wrong!", "author": "Mary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Tsubasa prepares all of their sushi cuts with the level of delicacy expected of sushi chefs. So far, this is as close to Tsukiji grade as I've gotten in SF. Every other place has been a disaster but Tsubasa was amazing! Consistency of the sushi rice, size and cut of sashimi, and freshness was all top notch.", "author": "Linh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Wow... freshest, most flavourful fish since moving to SF! Can't ask for a better location.", "author": "Richard W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-17", "description": "We went there early December 2016 with six of us. We were seated for lunch and had decent sushi. We tried to go there recently at the end of March 2017 for lunch. There were five of us. They said they could only take 4 as there was no table for 5. We said okay. We could split our party to 2 and 3. They had a table for 4 open and no reserved sign on it. They wouldn't seat 3 there because it was not for 3. What is this? We will not go there again and be disappointed. There are plenty of great sushi restaurants around and in San Francisco!", "author": "Mary T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "I love this place. The sushi is super fresh and tasty. It's high quality and seasoned to perfection so you can skip the soy sauce and really enjoy the flavors of the fish itself. I quickly became a regular because it's awesome and the staff are great. Don't hesitate to check it out.", "author": "alaina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Amazing sushi. Very high quality fish with attention to detail and fantastic service. Don't waste your stomach space with rolls and go for the nigiri and other tasty treats. I highly recommend this place for an authentic Japanese sushi experience.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "Best place to get sushi before a show at the symphony or opera. Quiet and nice ambience, great food.", "author": "Tracey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "my friends and i came here for dinner before the symphony last night.  we wanted to get the 12 pc omakase, but the server thought we wouldn't have enough time, b/c we had a little over an hour.  instead, we got the 8 pc omakase and then ordered some other rolls.  the portion of the rolls here is big - like 8 pcs.  the stash roll was good, and the juicy scallop was interesting, but my fave was the pressed negi toro, which was seared on top.  the omakase definitely had interesting pieces of fish, and each was already seasoned.  hopefully i can try the 12 pc omakase next time.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Don't eat any of the nigiri with soy sauce. The chefs here create delicate flavor combos. The uni and hirame was heavenly.", "author": "Maryam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "Only been here for lunch and once for take out lunch. Ordered the Bento Box Chicken Teriyaki and Spicy Tuna roll. Spicy Tuna was good. Chicken Teriyaki wasn't cooked in the teriyaki sauce. Sauce served on the side. It was ok. Take out lunch was the Sake Don which I liked a lot more. Will try them again one day.", "author": "Cheryl W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "Great, fresh sushi at amazing prices. Chef Wilson is the boss man.", "author": "C J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Had dinner here last week at the sushi bar.  Had the nigiri tasting which was good.  Sushi pieces were large as well.  Would probably go back there again in a few months when they are a bit more seasoned.  Probably a 3.5 star place but will round up for the nice service.  Getting reservations at the restaurant was pretty easy which was surprising given the location in Hayes Valley.  Dinner for two for sushi and alcohol was about $200.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Best sushi I've had - move over Masa. This place is all about the fresh fish and friendly service. Each piece of nigiri comes with a unique coating and flavors (citrus, ginger and home made soy sauce toppings). I've been 4 times in the past 2 months and the experience only gets better each time.", "author": "Brett S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "A restaurant is about more than a meal.  Our treatment of others speaks volumes about whether we respect them.  Don't waste your time with this place.  I have never encountered anything like the women who work the front desk.  We waited 40 minutes for a table.   We walked around Hayes valley only returning at the instructed time.  When we came in one of the waitstaff instructed my wife that \"you need to wait outside.\" We had waited outside patiently.  Her tone and hostility were unnecessary.  When going to enjoy a meal, an unprofessional and condescending attitude is unwarranted.  I imagine the owner would be disappointed by the way his staff treat the customers.", "author": "Bill G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "We came here for dinner to celebrate our anniversary. We had made reservations and explicitly requested to sit at the bar. When we arrived to check in to our reservations the hostess looked confused and we noticed that there was another reservation under the same name as us whom did not list a seating preference however our reservation had been crossed out instead of theirs. They had given away our seating to that couple however there were still seats next to them. Instead of giving us those seats she seated us all the way around the corner of the bar where not only was the view obstructed by a pole, dishware, but also saranwrap and miscellaneous items. The seating was worse than just getting a table. We requested to sit at the open seats where our original seats were supposed to be however we were promptly told \"Do you know the chef?\" \"You see we have so many people requesting to sit at the bar\" WTH the hostess looked at us as if we were being unreasonable when she was the one who mistakenly gave away our seating and not checked whether the proper patrons were seated.\n\nThe food was ok. The only dish that was good was the artic char and the medium fatty tuna. Certain dishes tasted too sweet and although sounded interesting the egg yolk and uni nigiri piece didn't taste good. \n\nFor the money you spend here you would expect the service to be better. In my opinion the sushi found here could be found elsewhere. I can't say anything was special or memorable.", "author": "Juju W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "I loved this place! We got the 12 piece nigiri, which was the chef's choice of fish. The flavor and textures were perfect in every bite. We also got the scallop roll and sake sampler, which were equally enjoyable. I will definitely be back.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Fresh sushi, not too crowded, great service. Jackson was extremely attentive and accommodating. Highly recommend!", "author": "S. V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "I have become a regular visitor to this small, clean sushi restaurant whenever I get to SF.  Formerly called The One Sushi (and already excellent) they consistently serve the most fresh, delicious sushi you will find.  Their menu changes daily based on what is most available & fresh - which should give you an idea of just how wonderful the flavors and textures are.  It really is one of the best sushi restaurants I have found and highly recommend it.  I look forward to getting there every visit.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Been coming here 1-3x a week for quite sometime now.  Just wanted to quickly add, everything is still ridiculously amazing (no idea how Chef Wilson keeps getting better and better at his craft), and all the friends that I have taken here are absolutely in love with it as well.  Chef Wilson and his staff are dedicated to continuing great things in 2017.  Cheers to them on a successful 2016 and the Michelin Bib Gourmand!", "author": "Jefferson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Great sequence of food and such fresh fish. We liked the recommendations that the chef gave. We will come back.", "author": "Gary M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-07", "description": "Horrid pretentious service.  Walked in around 9 w a date and was greeted by staff with \"give me one minute\".  No problem, the two of us stand at the host podium and check out the nice décor. 5 minutes go by, at least 25% of the tables in this small place are empty and clean.  10 minutes go by, I look at the empty wait list, the multiple staff leisurely check on other customers, yet completely ignore us.  15 minutes go by, we are still standing there, the guests dining next to the door start joking with us that MTS busses come by more often than the hosts.  Apparently their food was decent but the service also sucked.  We ask for a recommendation and go to another place down the street which was packed but had fantastic service.\nThis joint reminds me of the pretentious clubs that while empty on the inside like to create a huge line outside so everyone would think how exclusive they are.\nHere is a clue on hospitality.  If you have open tables - sit your guests, it would make them comfortable, instead of standing in high heels.  Give them menus, this will take their minds off waiting and help save the server time when he gets there to take their order.   If you are busy (which you weren't) at least approach your guests and acknowledge their presence again.  You might even offer them a glass of water on this unusually hot night.  Seriously,  this would be unthinkable in any restaurant where I worked.", "author": "Sergei G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Wow, had the great 12 piece omakase here for $60. I sat at the counter without a reservation, and the chef threw in a lot of extras, and provide another option when I didn't love a piece. Great experience, great hosts, and I will definitely be back. This is probably one of my favorite sushi places in the city.", "author": "Mr. X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "My favorite neighborhood sushi spot :) Jenny is the best!  Fish is very fresh, service is amazing. We have been going here since before it was recently renamed, and this place just keeps getting better with every visit.", "author": "Gautam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "My new neighborhood go to. Went this evening and had the 12 piece omakase nigiri, chawanmusi, and chefs spoons (scallop, ankimo, and chutoro). Everything was so thoughtfully prepared and meticulous. At the end of our delicious meal we ordered an ikura, uni, and tamago. Unfortunately we were told they just sold out of uni and the ikura was not yet ready and needed to marinade more before being served. As disappointed as I was, I greatly appreciate their standard of excellence and refusal to serve anything below that standard. As we finished our tamago and wine, the server brought us two pieces of uni compliments of the chef who said the pieces were too small to be sold. That was the most considerate gesture and the uni was delicious. I will definitely be a regular here!", "author": "Samantha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Amazing. Sit at the bar and get omakase. Its such a great price for the quality of fish. I've been to Kusakabe, Maruya, Omakase, and Yume to say the least, so I know my sushi. You're welcome.", "author": "nikkita l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "The only reason I can see for this place being almost empty on a Friday night is that people don't know about it yet. The quality, preparation, and presentation of the fish are all outstanding. The five-piece omakase sashimi was legitimately some of the best sushi I've ever had in my life. The sushi quality actually outshines the standard complements (miso soup, seaweed salad, etc.), to the extent that they seem like part of a different cuisine. Once they iron out this minor unevenness, it's going to be impossible to get a table. Now forget you read this. Mine!", "author": "Joe V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "Tsubasa replaced The One, a favorite sushi restaurant, but it remains one of the best you can find.  I believe the menu is changed daily depending on what is the most fresh.  Sushi is masterfully prepared and absolutely delicious.  It will continue to be a favorite whenever we are in SF.  The staff is also very attentive and friendly.  Oh, and they actually make their own tamago which is absolutely out of this world.  If that alone is representative of their kitchen, it truly is outstanding.  One of the best and highly recommended.", "author": "LMarie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "This place is a good example of what is wrong in a sushi restaurant. I had the sushi nigiri lunch special. Umm.. Excuse where is the food. 5 tiny pieces of flavorless nigiri I was told came pre flavored with no need for soy or wasabi arrived for $18.00. Give me a break. What I dislike is the presumptive idea that tiny plates are always worth it. Sometimes it is but not here. I had to go get some food after eating here. Something with flavor. Don't waste your money. I know never again for me.", "author": "Hackey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Quaint, charming and delicious! My sister and I had a wonderful dinner here. Sushi was fresh, creative and quick service. Highly recommend!", "author": "Laurie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Top notch service. High quality ingredients. Creative & unique. Best sushi ive had in San Francisco!!!!!", "author": "Elaine T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-03", "description": "What happened to The One??! - - My co-workers and I love this place when it was The One. But we just went in the other day and it looks the same, which is nice, clean and open. The staff seems the same, very nice especially the young lady with the ponytail who is always there, so very friendly. BUT the lunch options have changed...they don't offer as many options  for lunch now. They don't have any lunch appetizers and when I checked the dinner menu, no Tempura appetizer offered. The miso no longer has tofu. My bento box seemed smaller and they don't carry the saba with ponzu sauce anymore and my co-workers teriyaki salmon came with the teriyaki sauce on the side instead of cooked on the fish.... My co-workers and I were very disappointed because it seemed that the place looked the same and the staff was the same...but they trimmed down the food costs to make more money....sad because it was a great lunch option.", "author": "Jessica M."}
