{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "I ordered a small cheese and a cheesecake slice for delivery. Delivery was kinda late but it's okay I wasn't hangry.\n\nPretty gooood pizza, I like how thin the crust is and very tasty and stretchy mozzarella cheese, the sauce is nice too, I can taste the oregano. \n\nThe cheesecake was whateva, nothing to talk about.", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "This review is based on the delivery order. $41 wasted...here is why!\n\nPizza was terrible. The meat and cheese fell off the dough. The dough was soggy. This have to be the worst pizza in my life.\n\nThe spaghetti with meat ball was edible except the meatballs were over cooked. It was tough, chewy!\n\nThe order didn't come with red pepper flake and parmesan cheese. It is a given for all pizza order.\n\nNeedless to say I was extremely disappointed and will never order from them again.", "author": "anita s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-24", "description": "HI  I ordered a pizza at 6:20 p.m. and it is u:24 p.m. and it has not arrived.  Well over your 45 min. delivery window.  You are the only pizza delivery service we use.  There 30 magnets in our drawer. Is there a point where long time customers get preferential treatment or should I find another pizza delivery service? \n\nI just got the pizza over an hour and 20 minutes late.  Nice!", "author": "scott m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Good food.  Not much room for dining in, but price is right and there are tables for those with nowhere else to go.", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Needed a Pizza for my bro celebrating his birfday.  He said \"No cake please.\" Im always wary of Pizza because if you dont eat right out of the oven...it loses its luster.... So I checked within my radius...this one is in front of my church so I said \"Why not?\" And besides never had their pizza before so might as well try it out.\n\nOrdered the House Combo and yes I added Pineapple just because....on a thin crust...and you know what? It did not disappoint.\n\nPlus the guy who took my order over the phone was nice.\n\nThis maybe my goto Pizza place now.", "author": "Em B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "My favorite pizza place in town! Best pizza, pasta and subs!! Definitely my go to place for pizza with friends.", "author": "Clara L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-14", "description": "Paid $36 for a gross, large (but actually tiny), veggie pizza with very little cheese and old dry \"fresh\" tomatoes. This place used to be good, not sure what happened. Never again. The pickup did only 15 minutes, but I'm guessing that's where they went wrong. Spend a little more time and make it right!", "author": "Ramz A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-20", "description": "Their website said it would take 45 mins for delivery - 1:16pm according to their confirmation e mail. It is now 2:00pm on a non-holiday Monday afternoon and still no pizza. The person who answered the phone at 1:30 said my pizza would be here in '10 - 15 mins' but obviously that was not true. No offer of a refund from them either.\nI now have to make my sons something else to eat because they are starving at this point, and without a tracking feature on their deliveries, I can't take the chance of just waiting and hoping it shows up. Not impressed at all and won't be using them again. Far too many options in SF for me to put up with a 2hr wait for pizza!", "author": "Miss M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-08", "description": "Ordered pizza on yelp. Said it would be here in 45 min. Called an hour later. Hadn't even started making the pizza.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "This is one of my favorite pizza places in the Bay Area!! Their pizzas taste homemade. The spice sausage and honey is my fave cause I love sweet and savory. The mascarpone cheese they used was amazing! Friendly staff and excellent service :)", "author": "Alessandra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "I go here when I want a basic pizza and that's what I get. Nothing fancy but sometimes it's just what you want.", "author": "erich i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "I'd recommend asking for the pizza to be well done if you're a fan of not having soggy pizza. Great quality and taste. I don't remember exactly what size we got, but a large was enough to feed two with leftovers for next day if you're into that sort of thing.", "author": "Taryn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-17", "description": "After having one too many drinks at happy hour last night (read: two cocktails), I was ready to call it a night...at 5:30 pm. You're probably laughing at me but once you get into your 30s, nothing sounds more alluring than plopping your hinny onto the couch after work and watching trashy reality tv. \"Thigh brows on fleek\", is the latest thing I learned. So it's cool to have bush sticking out of your panties from both sides?  \n\nAnyhow, we were debating what to have for dinner. \n\nMe: \"What do you want for dinner?\"\nMr. NSS: \"Something cheap.\"\n\nMe: \"I can cook but first I need to shop at the market.\"\nMr. NSS: \"Uhh, shopping and cooking, buzzed/drunk? You'll max out my card and chop off your fingers in the process...what about In-N-Out?\"\n\nMe: \"Umm, I guess--are you driving?\"\nMr. NSS *looks outside the bar to see rain*\n\nBoth of us: \"Pizza delivery!\"\n\nI hate doughy, thick crust pizzas so I came across Twin Peaks Pizza & Pasta on Yelp; they offer thin crust and corn meal crusts (+$1). You can order on their website (there's a $2 off $25 coupon code listed) or through GrubHub but neither offered the capability of ordering half & half specialty pizzas so I called in our order. The woman who took my order was very professional and surprisingly very friendly. I ordered an XL Pizza with Half Spicy Sausage & Honey (w/ mozzarella, mascarpone, parsley + red onion) and Half Twin Peaks (pepperoni, salami, sausage & mushrooms). An XL feeds 3-4 people but we always over order for leftovers. She said, the pizza would be delivered within an hour. It was delivered in 54 minutes. \n\nThe pizza arrived lukewarm so the crust was a bit too chewy but it was better than eating a doughy crusted pizza from other neighboring pizza joints: http://bit.ly/1UXpBDo. My half was the Spicy Sausage & Honey which was a good balance of spicy, salty, and sweet but they were skimpy on the sausage. One of the slices had just one sausage which was a bummer. Mr. NSS' enjoyed his Twin Peaks half which had more robust toppings. \n\nGood pizza aside, my biggest issue was the price. I know everything in SF is getting ridonkulously expensive but I've never paid so much for pizza delivery in my life. Usually, when you do half and half orders, they charge you for the more expensive half. Per their website, an XL Spicy Sausage & Honey is $30.67 and an XL Twin Peaks is $33.66. I was charged $33.66 plus $3.89 for ordering the Spicy Sausage & Honey which is the cheaper half. With tax and tip, our total was $47.84...for pizza! \n\nAhh the price you pay for being a lazy, drunk heffer.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-17", "description": "I called in for a pick-up order on rainy Sunday afternoon while my girlfriends and I were watching the Patriots & Steelers game at The Bar on Dolores. We got a medium barbecue pizza special and I picked it up in 20 minutes. Even though they were conveniently located to The Bar and they were on time, I thought it was 1) kind of pricey ($26ish) for a 2) mediocre pizza. And- shockingly.... when I asked for paper plates (because obviously, shouldn't a pizza restaurant that has take out offer paper plates???), they didn't have any, so we had to eat off napkins at The Bar.\n\nMeh- I would pass and probably just order for delivery on Yelp next time.", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-21", "description": "Called for delivery and was told it would take an hour (!!) for delivery - but it turned out to be over an hour later than that.  \n\nWhy so long? The delivery person did not know where Market Street was, where 16th Street was, or what 3rd floor meant.\n\nWill never order from them again.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Last night I had a very good experience ordering a pizza from Twin Peaks Pizza. I ordered a Latin pizza that was very good and they talked to me 45 minutes. But within 30 minutes they were already at my door. great job", "author": "Marcos R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "Pay attention to your total $, I think they run a scam. For a pickup order they charged me $5 more than they quoted when I came in to pickup, when I asked about the difference the guy at the counter said it was the couple sides of blue cheese that I ordered with my pizza (?) that added the couple dollars; well obviously I didn't order multiple blue cheese sides with my plain pizza, but even if I did, where were they when the rest of my order was pulled and prepared for me to leave. They just tried to add a couple dollars to my already overpriced total. I'll spare you the details on how they still ran my card for the wrong total (in their favor) even after I caught the mistakes....\n\nIt's a shame the pizza is so good here, bc the service is a sham.", "author": "Christian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Halloween was a crazy night. I went to twin peaks, it's was crazy, I ordered a house combo on a thin crust. Let me tell you the waiting was worth. Took like 25 min after I order but the pizza was incredibly. This was the first time I ordered here and I was not disappointed. The blondie on the cashier was so nice, and so happy and energetic. This pizzeria made my Halloween day, plus they had good candy in the front!! The food was great and the customer service even more. This pizzeria has won my heart over.", "author": "Jose D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Excellent pizza! Was in town visiting and just happened upon this place. Friendly staff, short wait time and very tasty thin crust pizza. Looking forward to the next time I am in town.", "author": "Jenifer M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-13", "description": "Half my food did not arrive. The food that did was 45 mins late and cold. When I called and asked about my food I was met with hostility.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "Only order the pizza, and have them cook it for five minutes extra or you'll be sorely disappointed.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-10", "description": "Ordered online. After promised time, called twice to verify \"it's on the way\". Finally, 50 minutes beyond the promised time, on the third call, they admitted the pizza wasn't actually made.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Def the best pizza and service around! Not just myself, but other people I know order and come from a far! Great pizza and nice staff!", "author": "Kevelyn R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "I've ordered from them in the past and the pizza was pretty good.  Not any more!  What a disappointment.  It was very pricey ($48 for a pizza, small salad, one desert) and took over an hour and a half to arrive on a Wednesday night.  The salad was wet with lettuce that was soggy and limp, and very few mushrooms and olives.  The pizza was cold (obviously, after all that time...) and was not good at all.  A large pizza with about 10 slices of pepperoni and a handful of mushrooms.  What a ripoff.  The tiramisu was dry and stale.  God knows how long it had been sitting in that kitchen.\n\nI usually don't complain but this time I did.  I called them about 10 o'clock.  The phone rang about 8 times before someone answered.  Before I could say anything, they just hung up.\n\nGo elsewhere.  Anywhere else....", "author": "Larry B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "Just picked up two slices of Pizza I orderded over the phone.An ice cold Pepperoni\nand a burnt Margheritta with sheriveled Basil.\nHe told me it would take 12 minutes l was there in under 10. Box was sitting on \nthe oven.\nLooks like no more local Pizza for me.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "Good moms and pops pizza parlor! The pizza is pretty good and is sold by the slice or whole pies. They also have salads, pasta dishes, some sandwiches and appetizers. The shop itself has a few tables inside. Seems like there are a lot of regulars that walked in and out of Twin Peaks Pizza.  \n\nThe neighborhood is nice, there are a few other restaurants nearby and we had some pretty tasty slices or pizza here. I think Twin Peaks Pizza delivers also. The cashier behind the counter was pleasant. Pizza's also affordable. Beer and wine available. \n\nToo bad we ate dinner and watched the Giants lose to the Marlins....  :(", "author": "Ticha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "A fresh-out-of-the-oven huge slice of cheese pizza: $3\nA bottle of Pacifico: $4\nNot having to cook because your kitchen is stacked with moving boxes because you've just moved into the neighborhood: Priceless\n\nGuess I've found my new go-to pizza spot.", "author": "Adena B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-09", "description": "Their pizza is solid. It's not going to be on anyone's top 10 list, but a good option if you live in the Bernal Heights area and want something delivered quickly. \n\nI ordered a large \"house combo\" pizza (pepperoni, sausage, bell pepper, red onion, mushrooms) for about $33. It was decent enough to where I felt satisfied, but their pies are a bit pricey if you ask me. I'd definitely consider ordering from them again, although my search continues for my undisputed go-to pizza place that delivers in Bernal Heights.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-26", "description": "A little pricey but food never disappoints \nBest value would be the subs\nA must order is the jalapeno poppers\nUpdate\nSince new ownership the quality has gone down the toilet", "author": "John R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-10", "description": "The pizza is usually good here but the service is sloppy - like forgetting the provide ranch dressing with hot wings. It sucks to open your order and have an essential part missing. Might want to consider another place with better reviews.  Oh and the pizza was so cold I had I put it in the oven. Well at least it gave me some time to wait for the full delivery to arrive.", "author": "Christian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "If ever we don't have any food in the house, Twin Peaks is where it's at.\n\nSe here's the thing: the physical store looks super divey.  I wouldn't have given this place a second glance if my husband hadn't ordered delivery once when I was out of town and sung it's praises.  I'm just kind of snobby I guess!  Point is, looks are deceiving, don't judge a book by its cover, etc.  The pizza is great and they have such interesting topping combinations.\n\nOur favorite is the Noe Valley: it has cheddar cheese, red onion, bacon, linguica, and cilantro.  Sounds weird AF, right?  It is SO GOOD.  These toppings come together to make the best flavor profile.  I would prefer if they sliced the linguica a little bit thinner, but seriously this pizza is amazing.  We also (almost) always order jalapeno poppers too (why not, right?) and they are very tasty, but can be a little inconsistent.  Sometimes they're better than others, but always tasty.\n\nWe usually order online which is really convenient; they just changed their ordering platform which seemed to erase my account, so that was kind of a pain.  \n\nAnyway, suspend your judgement of the crappy appearance of their store front, they are putting out quality pizzas at this place.  They have saved my bacon many a time with their delivery when I'm hungry and out of options in the fridge.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Thank you Marcos for my delicious pizza (: I let a couple coworkers try the pizza as well and they really enjoyed it! I will definitely come back and get some more pizza.", "author": "Gabrielle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-29", "description": "I ordered a pizza for a party this weekend and to say I was disappointed was an understatement. I ordered deep dish but after the pizza was delivered it was not deep dish. Apparently the \"Chef\" changed the order? The thin crust tasted like cardboard and there weren't many toppings on a \"combination\". There was little to no cheese. The garlic bread was chewy and not cold. For $50 I paid, I'm never ordering from here again.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "I really don't know why I can't seem to find decent delivery to Bernal Heights, all I wanted was BBQ chicken pizza.  We almost ordered dominos (in fact, I tried but it was a 90 min delivery time) so I'm glad we decided to give Twin Peaks a try.  While a bit pricey, the portion for the medium 14\" BBQ Chicken special was definitely more than enough for two people, probably perfect for 3 and the quality was great.  It came with sweet and tangy BBQ sauce, plenty of chicken, onions, and I loved the addition of tomatoes and basil.  It arrived pretty quickly and wasn't soggy.  I look forward to ordering from them again!", "author": "Chanel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-03", "description": "I have to give this place a solid \"meh\". We ordered the vegetarian pizza with pepperoni and ate it only out of desperation. The middle of the pizza was soggy and floppy making it hard to eat, yet there wasn't enough sauce either.  The entire pizza was pretty bland tasting and not worth $40.", "author": "Jenna M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-02", "description": "We've ordered from here several times, typically through Yelp/Eat24. Tonight we ordered a pizza and a salad, that with delivery and tip and all was more than $50. It was supposed to take 45-60 mins. These stories are always really frustrating for the person they happen to but boring to read, so I'll keep it short: I waited more then two hours and I'm now I'm hangry and feeling mean. I contacted Yelp through their chat feature and got no reply, so then called the place directly and they said it was coming. It never showed up so I contact Yelp again who called the place and then told me the restaurant closed, but I should wait another 15 minutes to see if they show up, before agreeing to \"cancel\" my order for a refund. I didn't want to cancel my order any more than I wanted to sit around like a jerk for 2+ hours getting hangry, That's garbage of both these companies.", "author": "M B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "..Stumbled upon this place while walking around the neighborhood of my friend's AirBnb and I gotta say I'm really jealous I don't have a Twin Peaks Pizza near me in LA.\n\nI've never seen a pizza joint with such a creative and wide selection of signature topping configurations that are all available by the slice. On top of that, everything my party ordered had super fresh toppings and was cooked perfectly. \n\nFifth star earned for very friendly and competent service. I'll be back if I'm ever in the area again.", "author": "Bob Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "Last week I ordered a gluten free pizza and I was impressed! Order arrived in 20 minutes (unheard of for SF food delivery), the price was affordable for a gluten free product (I am used to paying more), and it is the same delicious gluten free crust as Patxi's pizza (which is perfect since they have the worst delivery & customer service).\n\nIf you are gluten free but not celiac, this is where you should be ordering pizza delivery.", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-12", "description": "This place by far was in a worse place I ordered pizza from. A medium pizza cost $30 bucks to I didn't ask for thin crust pizza they gave me a thin crust watery soggy pizza it gave my cousin the runs worst place ever don't waste your time.", "author": "Ahmad O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Always order delivery and it is always fast, fresh, and delicious. Our favorite pizza place that delivers.", "author": "Maggie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "Recently headed back to this neighborhood pizzeria! Haven't been there in three years. Was stoked to see the place hasn't changed a bit! Same awesome pizza and aps! Try the spicy sausage pizza!", "author": "Ian N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "The bf and I were craving pizza and Haystack was pretty packed. So, we came across this place while driving down Church. \n\nWe ordered a small (6 slices) Piece of Heaven for pick-up. It is made with buttermilk ranch, lemon pepper chicken, zucchini, green onions, and heart of palm, which we substituted with pineapple and they were ok with it. \n\nWe called it in and the lady said it would be ready in 15 minutes. Sure enough, I went inside to pay for it and it was ready to go. It cost about $23. The place is small inside, there's maybe only 2-3 tables. So, you're best bet is ordering for pick-up or delivery. \n\nNow on to the pizza...it was DELISH! We wanted thin crust and it was perfectly crisp. The buttermilk ranch went really well with the lemon pepper chicken. The pineapple added a sweet touch. I think it was a good call instead of having it with the heart of palm. But, anyway, the combo of everything tasted amazing!\n\nWe will definitely be ordering from them again!", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "Got a slice for a little less than $5 with artichoke hearts and sausage. It was decent, but not amazing. It was nice to have a custom slice. The menu looks good.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "The crust is thin and oddly flakey, not bad.  But overall, light on sauce and cheese was a little rubbery.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Love their pizza! Service is always great! Delivery is quick! Would definitely recommend!", "author": "Lorena A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-08", "description": "Disappointing.  We gave it a try over Haystack.  Had the combo.  One third of the pizza had no sauce or meat on it.  I don't mind paying the price but I do mind getting ripped off.  It looked nothing like the one on the website.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Wasn't bad. Walked in noon time on a Saturday. Service was nice. Little pricey (beer (Corona) and a pizza slice (pepperoni) was almost $10.\n\nA little greasy, but other than that - delicious.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "Girls night out at Bingo hall adjacent to Twin Peaks Pizza order a slice to take home alone. Opened the box ..burner flat bread crust, extremely frugal with sauce and cheese mushrooms extremely tough very dry and tasteless. Put it in the freezer, took it back that following Friday after Bingo...cashier was too u understanding... she offered a combo slice... added a teaspoon of that chewing gum cheese.....took it home began to eat. And SHAZAMMM S LONG PIECE OF HAIR tucked away in the teaspoon of cheewyrubbery  cheese. I FEED IT TO THE GARBAGE DISPOSAL.", "author": "Danita D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-06", "description": "They spam everyone's doorsteps with their flyers, tacking them onto your door handles, banisters, etc. Don't come here.", "author": "Rich L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-30", "description": "This was my favorite spot to order pizza for delivery for many years. Something has changed in the last 2 months. The quality of the pizza has gone down. Twice now I've ordered pizza and it has been either under baked or baked too much, no care has been taken to how the toppings are done, and the pizzas were delivered cold. In addition, the delivery chap was clueless.", "author": "Cheryl L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-14", "description": "This place has great garlic bread, decent pizza and wings, and is reasonably priced. Unfortunately their delivery people have been extremely rude and I don't think I will order from them again. \n\nAdmittedly, my house is very hard to find. I literally live on a set of stairs, not an actual street, in the hills of Bernal. All delivery people have a hard time finding it. When I order online I give extremely specific directions, but I don't know how that gets passed from grub hub to the delivery driver if at all. \n\nMost drivers laugh and say \"wow this place is hard to find\".  Or at least they are not rude. The first time I ordered from Twin Peaks the guy ended up at the end of the block. It sounded like he had been driving around for a while. When he got to my door, he said *to my face* this wasn't worth it. This after signing heavily and repeatedly as I stayed on the phone with him giving him directions. \n\nI thought maybe that was a fluke so I ordered again tonight. This guy called and repeatedly kept talking over me, told me to \"go stand on the balcony\" (?? I don't have a balcony) and kept telling me \"you have to help me\" and then talking over me every time I spoke. He finally got close but we were not on the phone anymore. I could see his car but I guess he headed in the wrong direction, even though I told him he had to go UP the stairs (he went down). He called back and finally got to me. He shoved the food at me and said \"I didn't sign up for this\" and walked away. \n\nThanks but no thanks Twin Peaks. I know my house is hard to find but you don't have to be a jerk about it.", "author": "Nichole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "Ordered delivery from here while visiting from NY. Was very pleased with the pizza. We got a medium pie with extra cheese and I was surprised how much I loved it. Being from NY I consider myself somewhat of a pizza snob and I still very much enjoyed the pie we got. The crust was the perfect thickness and the sauce tasted great. The delivery guy was very nice and followed all of your delivery instructions perfectly. I would give it 5 stars but I am giving it 4 because as good as it was it is definitely overpriced. If they lowered their prices I could see myself ordering from them all the time I'd I lived here. Anyway if you do order - enjoy!", "author": "S H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-05", "description": "Wow ... this place has gone WAY down hill in quality.  This will be the last time we order this slop.  It came cod, flimsy, and tasted worse than the frozen pizza we had in the freezer.", "author": "Carl S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Didn't feel like cooking or eating out tonight. Looked thru my stash of 'delivery' menus and decided on Twin Peaks Pizza. My second time ordering with them.\n\nSince I don't care for their pizza, I ordered a Spinich salad with bacon and their pasta dish of Half Ravioli and Half Spaghetti.  It was pretty darn good. Even had enough for leftovers tomorrow. \n\nThe delivery was good, the usual 60 minutes.  Would order again!", "author": "Janet T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Pizza slice fresh out oven, delish.... Brazilian can 'to be beat!!!! Yummy yummy.... Great on a Friday or Saturday night for a quick bite... Have a glass of the pinot.... Cool place in Noe Valley.....-:)))))", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "I eat here quite often, usually getting the Combo, Pepperoni, or Hawaiian, with a ranch dip. The Combo is my favorite, which is very tasty, and goes extremely well with ranch. Atmosphere is welcoming and casual, and the service is great.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "Wow, what a terrible experience! I usually opt to leave no review instead of a bad one, but this place treated me pretty badly, and the food was bad too. Seems like they have some serious ongoing issues. \n\nIf you don't have time to read this long thing, the summary is: the food took forever to get here, our order was wrong, they refused to fix it, they blamed it all on Grubhub, refused to apologize. The food was bad: wings were tasteless, lasagna was pretty gross. \n\nSo we order, and an hour and a half later the food arrives. I figure, wow they must be having a busy night, but I'm glad the food is here. But then I open it and realize they forgot the mozzarella sticks and a few of the wings. I call the restaurant and not only do they not apologize, they blame it on Grubhub! They say that they ran out of mozzarella sticks, but can't update that on Grubhub and their wings order actually comes with 8, not 10 like it says on Grubhub. I ask why they didn't call me when they received the order and let me know what was up (which I would have understood) so I could change my order. They say that it's not their job and that Grubhub should have told me. At this point I was just pretty confused, because they were blaming things on Grubhub that Grubhub is just not in charge of. They got extremely defensive and kept having me talk to different people who work there. My friends were hungry so I asked if we could get some food, like maybe a cheese pizza, to replace the missing wings and mozzarella sticks. They say that they can give me a pizza, but it will take an hour (!), and that I have to pay more because the cost of the mozzarella sticks is not enough to cover the pizza. So at this point they are asking me to pay an extra 5 dollars... and wait an hour for food... after I already waited an hour and a half for the wrong order!!\nAt this point I told them, hey, I'll pay those 5 dollars, and I'll even walk to the restaurant to pick up this food because it seems like the delivery drivers are swamped tonight, but I'm going to leave a bad review. if you are willing to help me out even a little bit, by fast-tracking my order, or refunding my order, I won't leave a bad review. Is it worth it to you? And they said, well it's actually not our fault, it's Grubhub's, and we can't help you. So there you have it, here's the review I said I would give you!", "author": "Maya E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-02", "description": "The pizza is awesome. The delivery service SUCKS. Anytime I order a pizza in advance online, there is some sort of mistake with the order and this time the manager on duty BLAMED me for it, like it's something I am doing wrong. She actually hung up on me. I spent $100 for a pizza party at my house and its cold. \n\nI won't be ordering there again.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-20", "description": "Great pizza worse delivery driver ever. One we paid for our pizza in advance, went to tip the the driver when he arrived, but the driver demanded that we pay again. We explained that we paid it already, showed him the recipe, but he still wanted us to pay again. After going back and fourth for 10 min. He said he'll call the shop and check. I guess they told him it was paid for so he left. No apologies offered, he just left. Oh and at one point I thought he was going to hit my buddy. I've never seen this before ever!!!", "author": "Lon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-20", "description": "I will never order from here again.\n\nTo start with the delivery person didn't know how to ring a door bell and left only to come back later after I called. Then he decided that it was ok to open the outside door and walk up the stairs onto the property. Next he tried to deliver it to my neighbors who have a different number than I do. The tiramasu was frozen and was crunchy when I took a bite of it. The pasta was dripping in oil and was overcooked and the poppers were covered in grease.", "author": "Dyami C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-07", "description": "The pizza might be delicious, too bad that I will never know how is it. I've ordered online, waited for two hours, and the order never arrived. They didn't try to call me, E-mail me, or reach out at any way. When I finally called them after patiently waiting for two hours, the restaurant just closed and no one answered to my call.", "author": "Tamas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "I'm a traditionalist when it comes to pizza.  And Twin Peaks offers a great slice of pizza.  A solid sauce that's the right amount of sweetness and fresh cheese. Granted, the ambiance of the restaurant isn't great - so go for the za and accept the scene for what it is.  Or go the take out option.", "author": "Frank D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-30", "description": "i have gone here at least 30 times for a slice over the years I have lived in this neighborhood, but TODAY WAS THE LAST TIME. It has gotten progressively worse, but I ordered a piece of pizza for $4.95 and gave $1.05 tip. they put a piece of overcooked pizza on my table ..THAT IS ALL, \ni do not mind eating a piece of pizza with my hands BUT HAVING TO ASK FOR A NAPKIN TWO TIMES? really, can you do a little better than that?", "author": "Eugenia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "I tried this place again - even tried DELIVERY again!\n\nPizza was damn good - I did the Latina, and it was perfectly spicy and the crust was AMAZING.  Not soggy in the least!\n\nI take back my previous review.  It was clearly a one-off accidental issue.  I WILL order from here again!", "author": "Michael D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-31", "description": "Eh. Meh. Two stars for fast delivery. Zero stars for food quality.  I ordered jalapeño poppers and a cheese pizza.  The poppers arrived luke warm and without ranch. Instead they were served with marinara? Who eats jalapeño poppers with marinara?!? Pizza was hot but below average. The sauce has a weird sour flavor. It tastes like pizza that is being made by people with zero pizza experience.  I was optimistic. I'll stick to ordering from my usual spots....", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Ordered from here again. Their pizza was good but the sausage and honey pie was waaay too spicy. Maybe i'm just a wimp now, but I don't think it's worth ordering again - no subtlety to the flavors", "author": "Emma M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-23", "description": "Of all the pizza places that deliver to glen park, this is the only one I have enjoyed, so I have had it delivered fairly frequently.\n\nPros: Good Crust - my number one pizza concern, good thin crust NYish pizza.  In terms of toppings - good selection.\n\nTheir pastas are large and generous, good meatballs.  I love their garlic bread.  You can order beer and wine and have it delivered. The service is prompt and polite.  You can order online via their website.\n\nAlso - if you order on their website instead of eat24, they don't charge $2.00 for delivery and they have coupons.\n\nCons: The $$$.  High for a pizza.  You want more than one topping pretty soon you are looking at a $30 pie, plus tax and tip.  I wouldn't call them stingy with toppings, but given the price, they are certainly far from generous. \n\nSlightly inconsistent.  Of the say, 20 times I have ordered from them, about 5 times weren't as good.  Their pasta sauces can get oily sometimes.  And the free \"bread with butter\" that comes with any pasta dish is lousy.\n\naside:\n\nI wonder if ownership or chef has changed since the last 2 times in a row have been meh.  The Hawaiian pizza I ordered last time was heavy on the cheese and light on the ham and pineapple. \n\nBut tonight kind of took the cake:  Someone manning the kitchen is seriously stoned right now.  I ordered a meatball sub, no onions and peppers, extra sauce.  It came with onions.  And 2 golfball size meatballs.  For a 10 inch sub.  Also, something was wrong with the bread, it was doughy and soaked through, like someone had undercooked it then put it in a sauna.  It was genuinely inedible - too bad because I have gotten it several times before and definitely enjoyed it.\n\nPart of me wants to call and make a fuss, because I am a broke lady, and when I can order out it is kind of a big deal for me.  On the other hand, I don't want to be a dick.", "author": "M K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "They have upped their pizza game in the last year with some tasty/gourmet pizza styles! My favorite is the spicy sausage and honey. Service has been consistently upbeat and pleasant. Can't beat the location around the corner from me either for a quick bite.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Favorite pizza place in San Francisco. Great thin crust pizza with high quality ingredients. The restaurant is very small, but I think they mostly do delivery. Only negative was they don't have fountain soda.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-05", "description": "Large pizza with 3 toppings: sausage, mushrooms and onions.\n$20.13 (had a coupon)\nDelivery was right on time.\nThanks Twin Peaks Pizza for another great pie!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-16", "description": "This place used to have good pizza. Until last week we ordered  a pizza for pick up. There was barely any toppings on the pizza and it was $18. Not worth it. \nNot getting pizza here again.", "author": "S B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "Pizza and breadsticks were great. Small dining room is perfect for grabbing a quick bite. They sell beer and wine, oh and did I mention they have a tv?! Delivery is available and I'm pretty sure I saw more than one delivery person! Great neighborhood pizzeria, we will be back soon!", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-13", "description": "Just ordered delivery from this place. Was quoted 30-45 minutes and the delivery showed up over an hour later. Pizza was horrible, horrible crust, horrible ingredients, and the salad was wilted and looked old, with bad tomatoes and red onion peel inside! Way over priced for the horrible quality this place offers. Very disappointing for SF", "author": "Marwa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Got a slice of pepperoni for lunch in the middle of a noontime walk and ate it sitting on the steps of St. Paul's church across the street. The crust was quite good even though it was far too thick for my taste.  The cheese and tomato balance was fine with many pieces good tasting meat.  All the slice are reheated and the pizza maker followed through to make my piece really hot. It would be interesting to know if they could make a decent thin crust version if you order a whole pie.", "author": "Richard D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Absolutely love this pizza place...\nOrder: Spinach Salad with Bacon\nand a Noe Valley Pizza. Amazing.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "While maybe not the best pizza in town thses guys serve up a solid no frills pizza. The service is great (I've never tried delivery) and the prices are pretty reasonable.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-15", "description": "The Spaghetti and meatballs were good. If you're looking for pizza, think twice. The quality of the pizza is inconsistent. The second time we order pizza it was soggy, and undercooked - very disappointing!", "author": "Grae S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Great pizza place! Family friendly, great service and the pizza is so good! Just the right topping to sauce ratio and the crust is delish.", "author": "meghan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "Great spot to grab a pizza.  As you walk in the counter is straight ahead and they have a few tables for you to dine in.   The slices are very large and tasty.  I would stop in again.", "author": "Zach V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-20", "description": "Decent food, but they don't honor their discounts for online orders. \n\nI paid for a medium 14\" pizza with a $3 discount code, the receipt handed to me by the driver said $20.52, which is what I expected. However, the made charge to my card (on my monthly statement) was $24.62.\n\nI suppose they added some other hidden charges as well. That's pretty bad.", "author": "Nathan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Solid place. No disappointments so far - very italian type thin pizzas so I'd give 5/5 if you like those as I do.", "author": "Sampsa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "Twin bill.\n\nLoved the pizza on my first visit.\n\nLoved the chicken sandwich on my second visit.\n\nAlmost big enough for two meals. Chicken is seasoned with oregano. Tomato sauce covers the bread. Small green salad on the side.\n\nNot just another sandwich. A five star sandwich from a five star place.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "I've lived in the neighborhood for 10 years, and tried this place 3 times. Did not like it the first 2 times.  They must have changed their staff, because I ordered a  pizza last week and it was great! I ordered an extra large for 4 people and we only had one slice left. Will definitely order again.", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-14", "description": "Wow, this place is so bad, if I could give zero stars I would.\n\nI guess the trick is ordering online, cuz the woman who takes the phone orders was awful.\n\nShe screwed up our delivery order soo bad, it's a joke.  First, When I ordered the Caesar salad, she asked want type of dressing, lol.  Then when the food arrived, there was no salad.  Grrrr.  I also asked for the pizza well done.  It Wasn't noted on the ticket and the pizza looked barely even cooked.  \n\nStay far away from this place.  There's way too many better pizza places in this city.", "author": "jim j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "I've lived near this pizza place for 20 years before every trying it. About a year ago ordered a pizza to be delivered when was desperate for a quick dinner and had nothing in the house. Was I surprised! The crust was thin and crispy and it was delicious. Also was still HOT when it was delivered, which could be because I live close, but much appreciated. Usually get either a pepperoni or black olive and mushroom, or a half and half combo of both. I wish I had tried this place earlier! Not crazy about Patxi's and can't always get into Gina Lina or Delfina, but for a basic pizza at a good price, you can't beat Twin Peaks.", "author": "kim c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "Delicious pizza! The girls there are super friendly and service was great. We ordered a half-and-half pizza of Noe Valley and Sausage & Honey. I loved them both and the crust was awesome. The Noe Valley had bacon, cheddar, onion and cilantro (yum) with red sauce while the sausage and honey speaks for itself. They also have beer... What more could you ask for?", "author": "Joseph K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "It's reliable but not amazing. I go here because it's close to my house but I've always been satisfied. One time I ordered a small towards the end of the night (10 ish) and the cook already had a medium rolled out so he made me that size instead, but only charged for a small. It made my night :)", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-06", "description": "So this review is only for my one time experience with them on election night. We called to order a large pizza for delivery and they told us it would take 40 minutes. After 50 minutes with no one showing up at the door, I called to see what the status was. They said they were slammed because of election night and it would be another 10 minutes before it heads out for delivery. After another 20 minutes, I called again and they apologized and said it still wasn't out for delivery and it would take another 10 minutes. After 1.5+hrs, the pizza finally showed up and it was average at best. \n\nIf they knew they were slammed, they should have been up front about it instead of over promising and under delivering. Don't call on Super Bowl Sunday unless you want your pizza on Monday!", "author": "Lawrence H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-16", "description": "2.5 stars. Average pizza, but with above-average prices. Good for take-out when you are in the area and need something quick.", "author": "Janelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "You can order online and they deliver quite quickly. Lots of variety on the menu, you can't really be disappointed.", "author": "Hannah Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Their pizza is delicious they're delivery services however won't ring your doorbell so watch your phone.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-21", "description": "Boo!\nIf you enjoy overpriced blandness please come here. \nOrdered a calzone, motz and ricotta with peperoni\ncompletely flavorless\ni also got a slice of choc cake (delivery)\nand called back because that sad choc. mouse slice was 3.55\nDISAPOINTMENT! the delivery guy came back for it\nreally though don't waste your money on either\nthis place was very disapointing\ni'm usually a content yelper, promise. \n: )", "author": "Jill F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-18", "description": "I'm very sorry to rank a neighborhood joint so low but my pizza was horrible \n\nFriends ordered a Meaty Thin Crust & I got a Cheesy Regular Crust \n\nWe were originally quoted 45 min but the nice guy called us after 30 to tell us our order was ready....this was GREAT so we could walk over while it was nice & hot! \n\nToppings were plentiful & friends said their pie was only okay.....mine.... \n\nI'll admit I'm a thick crust kind of girl & I knew this was not going to be a thick crust but crimmeny it was paper-thin & couldn't even stand up on its own.....floppy city \n\nThe Pesto (which I ordered as a topping) was completely saturating the pie, as opposed to a topping where there's a dollop here & there. Same w/ the Ricotta Cheese \n\nJust oozing everywhere.....no \"slice\" in sight.  Literally had to spoon it off the plate b/c no way I was going to be holding that pizza \n\nWilling to give this spot another try & re-review but for now all I can say is I've definitely experienced better", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-25", "description": "I have never been this violently ill from food poisoning....all night, all day, throwing up pizza. WTF? Sausage, corn, olives. \n\nTainted meat? I have no idea.", "author": "H.S. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "These slices are huge! We came here late on a Friday for dinner and ate-in. It's a small place but we ordered slices that were massive and delicious! The staff was also really friendly and it seemed like a place a lot of locals come just to hang out and grab a bite, real family feeling.", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-11", "description": "No. I won't be ordering fom here again. I odered for the first time from Twin Peaks tonight, and what they brought me was a luke warm soggy crusted pie. Luke warm - ok, it's cold outside. But soggy crust? Not  the ,  too-much-oily-cheese-soggy, but it- got-wet-with-water-after-it -was-cooked, soggy. The way toast might be if someone spiit water on it. Really yuk.\nI called to complain and the only response I got from the young person was sorry, I can't send you another pie because we are closed. Really?WTF? Thanks for trying, I guess.\nNo. Won't be going there again.", "author": "A. L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-03", "description": "Over priced and just not up to snuff.\n\nI found their pizza to be only so so... the crust was undercooked and soggy, the flavor was just ok... and expensive. \n\nI won't be ordering from here again.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "This place is absolutely fantastic - highly recommend the Honey and Spicy Sausage pizza - it is absolutely a tribute to what a fine pizza should be.", "author": "Matthew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-09", "description": "On line ordering is easy and delivery is pretty reliable.  The cornmeal crust is $1 more, but so worth it.  They have a tasty linguisa topping that we love. They deliver to Bernal.  The kids like it.  Sounds like 5 stars to me!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Definitely my new go-to pizza place. I cannot rave highly enough about the build-your-own salad, and I have never had a bad pie here. Never eaten in, but delivery has always been quick and courteous.\n\nThat said, I think it is a teeny bit overpriced, but hey, I manage to justify it several times a month anyway. I'd order twice as often if it were more affordable.\n\nThey have an admirable social media presence, and sometimes I find really killer deals on their Facebook page. They are very transparent, seem to respond to (the very few) complaints here on Yelp with dignity, clarity, and without defensiveness.\n\nOverall, a local business I am more than glad to support.", "author": "Brooke B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "Get the corn bread crust. You won't regret it! We're only missing one piece of the magnetic pizza pie on our fridge now... YUM.\n\nI also apologize for the cruel comments I wrote in my last review. I was both angry and unjust.", "author": "Beth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Continue to love the online ordering.  Tried a \"Latina\" pizza tonight and my husband said it was the best pizza he's ever had, so I thought an update was in order! Timely delivery and everything as requested, pleasant person who delivered...and yummy!", "author": "Susan V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-31", "description": "Our pizza was delivered with the cheese and topping slid off to the side of the box and the bottom burned. When we called to complain, they offered us $5 off our next pizza. No, thanks. Won't be ordering from here again.", "author": "Leigh A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-06", "description": "12/5/2014\nI want to start by saying that if i could give them less stars i would. I heard this place was good so i ordered their pastas and they were literally the most disgusting things I had ever eaten in my life. Not only did it look, smell, and taste disgusting, but it also made me very sick. It is 2 days later and i still feel sick.  Something went wrong with my side of the order( that's my fault), so they said they had to remake the food and send it out again, and when it came it was hot but just awful. I don't know if they did it on purpose to spite me or their food is just always that bad, but i remember ordering from there a few months ago and it was not that bad. My stomach still feels like shit as I'm writing this review. Hope this place gets shut down quick.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "I ate here last night using a yelp deal (thanks yelp!). I live like two blocks away and I finally got around to trying it out.\n\nThe employees are friendly, the restaurant itself is definitely busy when it comes to delivery so I decided to hang out (I was the only one on a friday night) but it's definitely worth it because the food is expedited since you'er hanging out there.\n\nI would come here again. I had their Pesto Ravioli, and while not the most fancy, it was solid for a pasta dish.\n\nNext time I'll try one of their signature pizzas since that's what they are known for", "author": "Eric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "Yes, they have huge slices, but the pizza is a little greasy on the top and the cheese tastes cheap. The crust is pretty good but the sauce doesn't have a whole lot of flavor and in my opinion they don't add enough sauce. This is what happens when you live in SF too long - your expectations increase for food because so many places have fresh, local, organic options. On the plus side, they are open late and they deliver...and the folks that work there are pretty friendly.", "author": "Kel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "During the Lenten season back in college, Friday dinner was always a big deal because they usually served the most singular food known to man. So I thought outside the box.  I started ordering pizza on Fridays.  My toppings were mushroom, anchovies, and broccoli.  To me, this pizza was better than a margherita, and I love a margherita.\n\nThe pizza at Twin Peaks takes me back to my college days.  A thin crust, lots of salty anchovies, and thinly-slice broccoli with extra mozzarella and marinara. Oh, to be 18, Catholic, and in love with a pizza.  I guess two out of three ain't bad. :-)", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "I order from this place probably atleast once a week, and i am picky when it comes to pizza because i grew up on the east coast where \"mom and pop\" pizza shops are everywhere and you don't dare order from a chain.  granted their prices aren't exactly cheap but they have so many toppings to choose from and so many things other than pizza you are sure to find something for everyone here.  Their crust is the right thickness, and you can request thicker or thinner if that suites your preferences, and the fact you can order online, is AMAZING!  when will more take-out places catch on to how convenient it is to order via a website?  \n\nThe only complaint I have about this place is that they have magnets they give you with your pizza's and once you collect 10 you are supposed to get a free pizza.  Well I order from here weekly and it seems like about 1 out of every 3 pizzas I get they actually remember to put a magnet on the box....it would be cool if I didn't have to order 30 pizzas to get 10 magnets.  A promotional deal is a promotional deal and it's something that I feel should should be a priority to make sure every order receives a magnet, if you are going to offer a perk you should be consistent about it.  \n\nAside from my gripe about the magnets this place has pretty good food, and is worth checking out if you haven't eaten there...and if you have well, it's probably pretty obvious why you keep going back.\nAlso, try my favorite!! A cheese pizza with extra cheese and extra sauce!  it is DELICIOUS and for me a very nostalgic taste.  I also love the Brazilian salad minus the tomatoes with blue cheese dressing!", "author": "Morgan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-29", "description": "I opened a little shop near Twin Peaks pizza about two years ago.  Initially, I stopped in here and there to grab a slice while we built out our store.  I didn't pay much attention to what I was eating in those instances as we were pressed for time.  I simply shoveled the food into my body.\n\nAfter being open for a few months, and finding half an hour in the middle of my day to relax and eat at the pace of a normal human, I noticed that the pizza from Twin Peaks was really, very good.  The crust, sauce, cheese, toppings - they were all perfect.  I began to visit more often.\n\nDuring one of my visits, while standing at the counter waiting to sign my credit card receipt, I noticed the cook peeling tomatoes and stewing them.  I asked Bruno if what I was seeing was the norm, if they were indeed making their own sauce.  He confirmed that they make their sauce and dough from scratch, and that their cheese is freshly grated.  Their veggies are never frozen, and their meats are from high-quality and reputable ranches.\n\nIt doesn't get better than that.  Typically,  I had to travel to a North Beach Italian restaurant to find pizza of this quality.  Or stand in line for 30 minutes at the other couple of notable pizza joints.  Not anymore.  Now I traverse a couple of blocks and grab a slice from my favorite local Pizza spot.", "author": "Don S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "We have now ordered pizza for delivery from Twin Peaks Pizza over 50 times. Out of that many times it would be impossible for every single pizza and customer service experience to be perfect but I'm giving them a top score because 98% of our deliveries have been fabulous. \n\nYou also get 20% off an order after 10 deliveries. It used to be 25% but I can forgive that with the current economy climate. Let that cook keep his job!\n\nI should also mention that they were only late once BUT it was on a Friday eve after 9 pm. I think that's totally forgivable. \n\nMust try!", "author": "Juliann B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "Im a little sad because I've been a loyal customer for years. They used to be my hands-down go-to. But recently the prices have gone up and the serving sizes have gone down. Even the volume of each topping is noticeably smaller now. Their build-your-own salad is still a favorite, but its getting smaller too - I ordered greek peppers on it tonight and I got a grand total of 3 greek peppers. They also used to be amazing on social media and offer great deals for fans and followers. No more. Still an ok choice, a little overpriced for what you get, but decent in a land of mostly bad pizza joints.", "author": "Brooke B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "1- Great Pizza - had the Latina Medium\n2- Friendly call in and driver\n3- Good price\n\nWill order again!\n\nP.S. Not sure where Twin Peaks name originated for outer Church..", "author": "B H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-08", "description": "Margherita Pizza, flavorless.......... could have been cooked a little longer, crust was not crispy..... :-(", "author": "Altaeb s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "I am so embarrassed to admit that I've lived within 8 blocks of this place for, um, over 15 years and never tried them out. \n\nI walked past recently and noticed that the had redecorated at some point and looked pretty snazzy. Then a menu showed up at my door so I ordered.\n\nSo good! I'm a big fan of Escape for New York but I think these guys have way better tomato sauce. Very delicious and I'll be ordering again soon!", "author": "JP C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-15", "description": "I wish somebody would create a quality non gourmet pie in San Francisco.  After getting my home spammed by these guys forever I tried their pizza and was immensely disappointed on all levels (crust, sauce, toppings).  I strongly recommend ordering someplace else.  I'd rather eat Round Table than Twin Peaks.  To me, it was on par with Domino's.  FYI, if you ever get to Italy find a Neapolitan pizza maker and experience the greatest pizza you'll ever find.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "Visited this place on a hot summer SF day (surprisingly!) and soon as I entered I thought we were in a steam room. It was HOT in there!  We asked the owner if we could sit outside.  Normally they don't do outdoor seating, but the owner (really cool guy!!) brought a table and a couple chairs out and allowed us to do so.  That's customer service!!\n\nPizza was a lot better than I expected...with fresh ingredients and not greasy at all.\n\nI suggest they have a better wine menu which was extremely limited and put some air conditioning in the restaurant.  Other than that, this was a great pizza joint!", "author": "Emmett B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-26", "description": "Over priced for what u get. A thin crusted pizza with not much flavor going on. I also ordered jalapeno poppers which were over priced and seemed like they got from a bag. Not order again", "author": "Elise H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "The pizza here is excellent! \n\nI took some back to my office and it was gone in a minute! Everyone was talking about how great the pizza was!\n\nThey do free delivery or you can come in and eat while using thier WiFi. Decisions, decisions....", "author": "Alicia N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-08", "description": "Simply put...not worth it...\n\nHigh price, low quality.....", "author": "Blake J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-14", "description": "Be careful, we were served rotten ... spoiled food !!\n\nOrdered the meat lasagna and spaghetti with meat sauce.  The food came within 45 minutes, and the lasagna looked good ... cheese browned on top.  However, one bite and we threw-up.  It had a sour taste from when the tomato sauce went rancid.  Yuk!!\n\nProbably the same sauce they use for pasta and pizza.  They clearly did not taste the lasagna before they served it.  We will never order from here again.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-24", "description": "I'll admit it - I'm kind of a pizza snob. My expectations were not very high on this neighborhood establishment but I was pleasantly surprised. I ordered a regular crust pepperoni and sausage pizza (my standby order). Both the sauce and crust were excellent. I find those are the two items that can make or break the pizza. The sausage was a little spicy too which made it even more yummy.\n\nAs for all the complaints on delivery, I picked my up there and it was hot and tasty. Maybe to get a better pizza - pick it up from them. No complaints here.", "author": "Derek B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "I ordered 2 slices of cheese pizza to go and it was good. The price was reasonable and the customer service was friendly. I will definitely come back.", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-07", "description": "I've been a loyal Twin Peaks customer for several years, ordering a pizza delivery from them about once a month.  Their pizzas always featured generous amounts of sauce and mozzarella, and usually arrived warm if not downright hot.  However, for at least the third delivery in a row now, the delivered X-Large pizza featured skimpy amounts of both sauce and cheese, at basically room temperature. They also failed to include one of their little yellow magnets (save 10 magnets for a $20 discount on a future order) with the latest delivery, but I won't be saving or using them anymore.  If anyone were to tell me that Twin Peaks is under new management / ownership, I wouldn't be at all surprised. What a shame - I considered Twin Peaks' the second best pizza in S.F. (after Tommaso's), but not any more.  If you like dry, room temperature pizza with little or no flavor, then Twin Peaks is the place for you!", "author": "Pizza X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-10", "description": "5 STARS.\n\nABSOLUTELY FABULOUS.\nI called in the order 'round 9:45 and the pizza arrived by 10:23.\n\nWhat I ordered:\nMedium Hawaiian Pizza\nMozzarella Sticks\n\nLet me tell you somethin', it all arrived hot and fresh!\nUNBELIEVABLE. This never happens.\n\nThe crispy yet deliciously soft crust and the HOT FRESH toppings!\nThey even let me add on bacon at no extra charge.\nThe mozzarella sticks were crispy on the outside and the cheese was STILL gooey upon arrival. Unheard of? I know.\n\nLet's not forget to add in the part about how the guy on the other end of the phone was delightful. He was friendly, and willing to satisfy all of our customer needs. ex. not ringing the doorbell because I live with a family of four!\n\nAll in all 5 stars. Unbelievably happy!\nAND IT CAME WITH A MAGNET STAPLED TO THE RECEIPT.\nSo cute. Love them.\nNever ordering pizza from anywhere else.\n\nThank you, that is all. Over and out.", "author": "Jena R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-06", "description": "Ok, first I want to preface this review that our experience was on election night. I can understand that fact that there would be some delays, but we were told 40 mins. Instead the wait was over an hour and half and the pizza was way too salty. We called they offered an apology but no other concession for being so late. It will definitely be the last time I order from them.", "author": "Ernest L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Owner was very friendly when we walked in, even though we only stopped in to have a few beers and watch an NCAA game.  (We had dinner reservations down the street).  They changed the channel on their TVs to accommodate our request.  I will definitely come back to try their pizza.  Noticed that the staff was great with other customers as well.", "author": "Alfred G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-14", "description": "We ordered a \"Bianca\" (white sauce, ham, sausage, onion, peppers) with a regular-thickness crust, which was $20 for a 12\".  Delivery was about 30 min at 6:00pm on a Saturday, no problem there. The soggy center was either oversauced or underbaked, hard to tell. Toppings were ungenerous. There was a 2\" long black hair under one of the slices. We cut the center out, moved the toppings to the edges, and microwaved it, at which point it was pretty good, a nice change from tomato sauce.", "author": "Steel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "Reliable, friendly delivery. It's not the best pizza, it's pretty fast-foodish. But the folks are nice and they deliver super fast, like under half an hour. Great cheese, good sauce, just wish the dough and over were a bit better.", "author": "Nelson M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "My short and sweet review:\n\nI ordered (delivery) Hawaiian pizza (regular crust) and it was delicious. The crust was slightly crispy, the pizza was hot and the toppings were fresh. \n\nAlso, they have a \"buy 10, get one free\" deal, so if you're going to be a long term customer, there's some incentive to stick with them. \n\nBiggest downside is the price, which came out to around $23 for a large pizza and small salad. \n\nTHE SCOOP: Coming from Chicago, I consider myself a pizza afficionado, and Twin Peaks did not disappoint.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-17", "description": "Almost a year later and I still favor this pizza for delivery. They are incredibly fast (we've gotten our orders all the way over at Monterey Blvd. sometimes in under 25 minutes! The pizza is always tasty with a nice and thin, crispy crust. They have \"collect 10 magnets get a pizza free.\" We've only worked up to 6, tonight will be our 7th...I wonder if we will ever get to 10.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-30", "description": "I WILL NEVER ORDER PIZZA FROM HERE AGAIN AND NEITHER SHOULD YOU!\n\nBecause I received a flyer on my doorknob, I thought I'd give this place a shot.  After all, how can you netflix without a medium pizza and hot wings? I used their nifty online ordering system and fired up the movie, waiting patiently for my dinner to arrive.\n\nNearly an hour later, I called and the girl who answered was pretty rude to me when I let her know that I'd ordered a pizza that never arrived. \"So?\" she asked.  She finally checked on my order and realized it \"hadn't printed out\" so she confirmed my order (bianca with no onions) and assured me that they would make it a \"priority.\"\n\nFortunately, my movie was quite interesting and another hour later, I called again because no food had ever arrived! The same girl assured me that it was \"about to leave\" and offered me a free soda.  NO SODA! Just send me my dinner! \n\nThe food did arrive approximately 30 minutes later and much to my dismay, the pizza had onions on it. Even without the onions, the pizza would not have been good.  There are so many other, BETTER places to get your pizza.\n\nTHIS PLACE IS AWFUL!!!!!", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-22", "description": "SUCKED SUCKED SUCKED!!!\n\nI ordered a medium pizza and calamari.  On time?  YES and thats why they got 1 star.  The calamari is inedible.  I think they breaded rubber bands and cooked them...completely unchewable.\n\nAnd then theres the pizza.  Its cold...and the crust is soggy.  Absolutely nothing special about it...I could have done better walking to safeway and buying a frozen pizza.\n\n$32???  Are you freaking kidding me?  NEVER AGAIN!!!!!", "author": "Robbie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "Good Za, hood price and cold beer. How do you beat that.", "author": "Jovan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "Great pizza, service and people.  Pies are solid, customer service is on it-- nice, responsive.  People are nice.  Lots to love about Twin Peaks.  Manager Bruno is da man!", "author": "Henry F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "Wow, delivery within  25 minutes is awesome! The pesto sauce was really good and not too salty like some places. The crust was thin and crispy which I like, and the pie itself was not bogged down with tons of cheese. There is practically nothing I hate more on my pizza that too much cheese. Mama can't take so much lactose, and unlike Dominos would have the world think, not everyone likes their food dripping with queso.\n\nWork Twin Peaks Pizza, work it!", "author": "C P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-06", "description": "Ah, back in the days where 2 slices of pizza perfection was considered a binge. Now it's more like 2 whole pizzas but that's what you get when you train your body to fit.\n\nTwin Peaks use to satisfy every need. I no longer live in SF so I haven't been here for ages but memories hold dear in my heart - they take me back to the start. I give them 5 stars for this.\n\nI see their menu has changed, things are jazzy now like the popular pizza beasts. Thy use to be small and straight forward. I'm sure they aren't as greasy anymore either, what a shame. They use to be greasier than Little Caesers...I'm talking soak and stain the box kind of greasy. You know, just how I like it - to be able to see a layer of overindulgement filth on my fingers - where you need extra napkins for a good ole' wipe job. Now atta' pizza!", "author": "Food A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-22", "description": "Just bad pizza. Soggy with the cheese falling off and overpriced. Never again.", "author": "Casey P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-18", "description": "I ordered via grubhub, and got an ETA of 1 hour! The pizzia finally arrived after 1 hour and 20 minutes. No comment from the delivery dude. At least say you're sorry you're late, or that the traffic was crap, or something.\n\nAt $18 for the 'house' pizza that was 'meh' and arrived warm-ish, I'm shopping around for my next order...\n\nAnd I should add, that some reviews say that they give out coupons that let you jump the queue and get your pizza made immediately... so lame, no wonder I got crap service.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-09", "description": "Not the most amazing pizza ever, but definitely good stuff. Their service is phenomenal even after over a dozen deliveries. Their prices are great. Their calzones and pizzas are very good. All their ingredients are fresh and quality. Their pasta isn't great, but it's fair if you're craving it specifically.", "author": "Corry F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-07", "description": "Really excellent pizza (love the Mr. Eddie!) and super fast and friendly delivery.!!!!", "author": "Diana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-10", "description": "Love, Love, Love this place.  This is the only pizzeria my hubby and I can agree on.  My all time fave is the baked Lasagna Bianca,  noodles with ham, mushroom, spinach, ricotta cheese & cream sauce topped with mozzarella cheese need I say more?  \n\nWe've never eaten at the restaurant but have passed by.  Looks clean with a good size eating area.  Delivery is always fast & polite", "author": "Sally R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-07", "description": "Friendly staff. Poor guy on the phone was juggling a ton of calls at once. Ordered a vegetarian pizza with a side Caesar salad for delivery. The salad was huge and worth the $8. There were two slices of tomato floating among the lettuce, which seemed pointless. The pizza was good. Could have been a touch hotter. I loved the garlic on the pizza. I still get amazed how expensive stuff, like pizza, is in the city. I'll order it again, but I need tweak how I like my pizza from here. The online ordering is cool...but it doesn't really help when you want to just look at a menu. I kept having to restart the page just to read pizza toppings. Not everyone knows what's on a \"Bernal Heights\" pizza.", "author": "Jena D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-18", "description": "Wow I cannot believe how much this place has fallen off. They raised the price on the Bianca by $5 (now almost $24 for a MEDIUM?!? whats even worse is I didn't know about the price hike until it was delivered).  Also I asked the guy to make it well done but when I got it, it was a soggy, mushy, pizza mess. So disappointing.  I wont be ordering from twin peaks again.", "author": "Adri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "I love the pizza and have eaten it for 4 yrs now.  The quality is pretty much consistent!  Unfortunately their delivery service has caused us 2 hr waits several times in recent months.  That's a REALLY long time to wait when you're hungry for pizza!\n\nWe'll be trying other pizza shops in the area before ordering from here again.", "author": "Elaine G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-28", "description": "My girl and I gave this place a try once since we just moved to Noe Valley. I thought the pizza was pretty generic as the quality wasn't really there and the price was way too high for the product received. Unless I'm really, really craving pizza and no other places are open, I don't think I'll be coming back here.", "author": "Tyler M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "Dope.  Ass. Delivery.\nI get the lasagna with white sauce and ham when I'm feeling particularly decadent.  Everything is pretty great except for the roast chicken, which I've found to be dry.\nTry the BBQ ribs if you're hardcore.", "author": "Kati K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-17", "description": "2.5 stars (Spaghetti Review only)\n\nShhh, don't tell anyone but sometimes I like overcooked pasta with substandard sauce.  It reminds me of the spaghetti that my dad used to cook and I loved it as a kid!\n\nSure I can whip up some pasta with a homemade a sauce easily.  In fact, I love doing it.  Chop up some ripe tomatoes and add them to a pan of olive oil and garlic.  Add some salt and finish with some roughly chopped Italian parsley and freshly grated Parmigiano-Reggiano.\n\nHowever, when I feel the need for some comfort food, I call Twin Peaks.  Delivery is pretty quick and the pasta is consistently cooked 3 minutes too long...perfect.\n\nMy sister's husband is Italian and happens to be an incredible chef.  One night I told her what I was eating, a bit ashamed.  She jealously said, \"That sounds delicious!  Sometimes I wish that I could eat like that\".  haha...\n\nTwin Peaks, your $7.80 spaghetti and marinara sauce are alright:)", "author": "michelle s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-28", "description": "The following information can save your life:\n\nThe common tomato has an amazing heat capacity.  A few slices of tomato, properly placed, can protect nearby objects from blistering heat.  Recall capping oil well fires in Kuwait circa '91 - inside those silver suits?  Brave men covered in tomatoes.  Space shuttle tiles?  Tomato based ceramics.  I don't have a smoke detector in my apartment because I don't give a damn.  I have tomatoes in my bedside table.\n\nIgnorance of this property of tomatoes with regards to a pizza can be disasterous.  A few slices of tomato can add significant cooking time to the pizza, resulting in a sad, undercooked crust.  Twin peaks, you have much to learn about the tomato.", "author": "Big Stu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-01", "description": "I think the pizza maker at Twin Peaks Pizza either takes a lot of pride in his creations, or else is obsessive-compulsive (but in a good way that I can truly appreciate).  I got a half chicken special (chicken, zucchini, and hearts of palm)/half ground beef and green onion pie, and when I opened up the box to check the order, I was blown away by how absolutely perfectly the toppings were arranged.  It looked like a pizza that had been produced for an advertising shot or something -- y'know, like how a big mac in the commercial is totally done up, but the one you actually get at the drive-thru is a sad, messy version of it.  I mean, this pizza had a very definite line across the middle of it, and NONE of the toppings from either half were intermingled.  I was so impressed that I took a picture, which I will post once I download it from the camera.  It was beautiful!\n\nThe pizza itself was decent.  Not the best I've ever had, but good enough that it earns Twin Peaks Pizza a slot in the delivery rotation.  The crust could've been a bit crispier, but that's nothing that a quick toast in the toaster oven can't fix, if I care enough to bother.  The chicken special is a surprisingly tasty combination, too.  \n\nAnother thing that especially pleases me is that all of the toppings cost the same amount.  No \"this topping counts as three\" anywhere to be seen.  And they have hearts of palm!  Yay Twin Peaks!", "author": "daphne w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "I love the pasta and the service here.  The food is good and they almost always deliver it quickly.  The best thing is that they have the best calzones I have ever had!", "author": "Bruce L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Good pizza, big salads, fun desserts and honest dependable drivers. What more could you ask for? We love this place, order with confidence... they've always taken really good care of us, going on almost 10 years.", "author": "Arnaldo B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-08", "description": "I do not give five stars to pizza places in San Francisco, and that's not cause I'm crazy about \"real NY pizza\".  I've never even been to New York.    It's just that I've never ever had such a hard time finding a decent slice in a city in all my life.  I think that SFers usually don't even know what pizza can taste like when done well.  Pauline's is what pizza should be, but jesus I spent over $100 last time I went there!  For pizza?!  Are you shitting me?  \n\nThat said, Twin Peaks makes a good pie.  Good crust, good sauce, good cheese, good price. It's the only place I'll even bother getting delivery from.", "author": "Napoleon R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-02", "description": "I'm giving a low rating because their corn meal crust is not gluten free. In previous reviews people claimed that it was. \n\nFor those of you with food allergies be careful before ordering.\n\nHaving said that if you don't have to deal with food allergies this pizza is tasty.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-14", "description": "I've ordered the 'All the meat' and 'Noe' pizzas a few times and both are pretty good. Jalepeno poppers are usually great, chicken wings not so great. I prefer these guys over Paxtis, it's just better value and doesn't seem as ridiculously salty. Still feel I'm yet to find my go-to place for pizza though despite the accumulating Twin Peaks magnets on my fridge.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-02", "description": "I usually dont really like thin crust at all. But the pizza there was REALLY good. the serivce was really good. I will definetly be back when I am in the neighborhood..", "author": "Latrice W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-08", "description": "This place is funny -- the service, decor, and menu variety is great.  I expected a crappy per-slice pizza place where you order what's on the counter.  I got a cute little pizza cafe with a totally customizable per-slice menu.  But -- the pizza isn't great!  Only decent.  Too much sauce, nothing special about the crust.  So, it gets three stars.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "Been ordering delivery from Twin Peaks Pizza for years and they are always solid.  Good pizza, super reliable. Glad to have this place in the hood.", "author": "Molly T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-25", "description": "Great quality toppings, a crust of better quality than most in SF (not saying much) AND you can order online - love that!\n\nPastas are bad for delivery, but where wouldn't they be?\n\nDon't get pasta or salad, and garlic bread is so-so.\nBut again, awesome pizza & love the online ordering.", "author": "laura g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-11", "description": "We order from here for three reasons:\n\n1. First, and by far the most important, they deliver via online ordering.  That pretty much sold us.\n\n2. They're nice.\n\n3. Every 10th pizza is free.\n\nThe pizza itself?  Mediocre.  Not terrible, not a stand out.  It's just pizza.  But they've made it very easy to get that pizza from an idea in my head to my mouth.  So they win.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-11", "description": "We called twin peaks pizza and ordered a pizza, making sure to ask for it thin and crispy. \n\nI got another beer from the fridge, read a news article online and the doorbell rang. I thought...surely that is not the pizza already. It was. Thin, crispy and cheesy - just the way I like it.\n\nWhile the pizza had all the neccessary components I like, there was something missing that made me go YUMMM. It was a bit bland? But a little garlic salt and parm cheese and I was satisfied.....(ate 1/2 the pizza kind of satisfied).", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "The owner runs this pizzeria with flair and friendliness. A framed City Proclamation of Bruno Matos Day (July 29) hangs next to the cash register. I need to branch out from my basic pepperoni, olive and mushroom with the red sauce and try out the pesto.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-20", "description": "Had dinner here again, and realize now that I was overcharged a bit for the simple pizza Marguerita I ordered last time. Prices aren't that bad for very good quality pizza. This time, we also shared an excellent, generous mixed salad, at a very reasonable ($8) price, so I'm liking this place more. Again, the staff and service at this tiny place are awesome.", "author": "Lotion M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "When moving here from Brooklyn I was terrified that I would never have a decent slice of pizza again.  While Twin Peaks is no Vinny's ( http://www.yelp.com/biz/vinnys-pizzeria-brooklyn) or Grimaldi's ( http://www.yelp.com/biz/grimaldis-brooklyn), they WILL deliver to my apartment. \n\nI lived in Brooklyn for 8 years and this makes me ferociously more qualified to rate pizza than you stinky California hippies so sit down, shut up and fuhgettahboutit. Got it, buddy?\n\nAlso notable:\n*I've ordered from them almost a dozen times with no complaint AND also tried pies from several other promising menus in the neighborhood and due to my focused research and their great track record I refuse to order anywhere else. The bad reviews here seem to be fluke disasters occurring to one-time customers. \n*The internet ordering is totally convenient, especially if you want to pay by card.  They call you to confirm after you place the order.\n*The biggest problem I have with them is that they are always out of Beck's Dark.  That being said, they deliver beer, which was amazing and novel for me being a relatively new transplant to SF.", "author": "Essron J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-23", "description": "My first order was tonight. Either I ordered the wrong pizza (Deep Forest) or it just wasn't that good. The service was great, delivery fast, but the quality of the ingredients,,,not so good, especially for the price- $24 (w tip) for a small.. :(  Wish I had just had a beer instead", "author": "Michele J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-19", "description": "The Amazon Veggie pizza is really good.  I didn't want to slap anybody's mama, but I did sneak-eat the second slice the next day...when I saw a friend walking up the street to the house, I ate faster so he wouldn't know what a pig I was being.\n\nHe saw me anyway...and the excitement of the possibility of getting caught, avoiding getting caught, and then ultimately getting caught, made my heart race for a moment.\n\nThanks Twin Peaks Pizza", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-24", "description": "This place has changed over the last year or so.  They have upgraded the interior and have a decent dine in business now.  They still serve pizza by the slice and it's made fresh.  $3.45 for a cheese slice.  it's thin enough to fold over with a nice crunchy crust and a fresh tangy sauce.  Maybe a little more sauce than I like but I'm getting picky...Friendly service.  Beer and wine.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-23", "description": "Good pizza.  Really good crust, as previously stated, and not crazy dripping with grease.  The \"specialty pizzas\" with lots of toppings are probably not the best way to go -- I think this place does the basics best.  Nice little side salads for $2.50, as well, to help offset the pie.\n\nWe actually ate in, which I guess isn't something many people do, but it was cozy and the high school dude working behind the counter was nice and seemed to enjoy pretending to be a waiter for a bit.  He even brought the pie on one of those little silver pizza stands.  Fan-cy.\n\nGood neighborhood joint.  We'll be back.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-25", "description": "They make a good consistent pie, and deliver fast.  I like the website for ordering pizza, better than getting a busy person on the phone.  After you get 10 delivery magnets, you get a free pie.  The pizza isn't going to win any awards, but the convenience will.", "author": "bil t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-30", "description": "i've had this pizza three times, three different ways - delivered, picked up, eaten in - and each time it was really good... very flavorful thin crust with just enough chew, well-balanced topping to sauce ratio, fresh ingredients, served hot, by nice folks.\n\ni feel bad for the reviewers who seem to have gotten the crap end of a delivery deal. i too would be pissed if my pizza arrived deconstructed and cold. bummer. but what about the freak who gave one star because they discovered that Twin Peaks uses gluten in the pizza crust? uhm... hello! pizza dough is nothing if its not about the gluten dummy. \n\ni hate people. sigh.\n\nanyhow, i've long accepted that im not gonna find a truly great bagel or pizza outside of the ny tri-state area so there's no sense in whining about it. im happy to have a tasty approximation and call it a day.\n\nso far Twin Peaks pizza has proven totally respectable and deserves at least a first try.", "author": "Prattle P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-22", "description": "We just ordered from there and the pizza was pretty good. Crust was nice and light, but rich. The dleivery was faster than the quoted 40 minutes and the service was polite.  but we ordered a large and we felt it was a little undersized. Also, our pie was a little dry, though, and it could  have used a little more sauce. \n\nAll in all, a pretty good neighborhood pizza... Im just glad they deliver here.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-07", "description": "It's funny; this is my regular pizza place, and yet I only give it three stars.  I don't know what that says about me.  They make a good pizza - not great, but good.  Delivery is usually very prompt, and everything arrives nice and hot.  I haven't tried too many non-pizza dishes, but the tiramisu is all right and the cheesy garlic bread is nice if you're looking for cheese overload (as I sometimes am).", "author": "Michael I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "I love this place. They make great pizza, deliver it fast, and are super nice. Their pizza is great, delivered hot, and has some amazing crust. I wish I had more to say... they're just awesome. I've been going to this place for a good portion of my life, and they've only gotten better as time goes on.", "author": "Aaron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Awesome, great thin crust, nice menu of house pies. Fast delivery. We had the eggplant parmesean which was so tasty too!", "author": "Lester N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-20", "description": "Really great pizza, with enough variation in the menu to keep anybody interested. The price is comparable to most places, and some deals are clearly better. Love the food, the vibe, and the overall camaraderie at Twin Peaks!! Thanks guys for being one of the best in the business. Cheers!!", "author": "Will D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-15", "description": "I typically order their pizza for delivery but tonight my wife and I decided to drop in and eat.  It's got a nice ambiance, great music and rather than choose the obvious choice, pizza, I chose a half chicken with salad.  Excellent sized bird, delicious and perfectly cooked.  The servers were nice and attentive and we ended the night with a slice of cheesecake.\n\nWe'll definitely stop in again.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "My daughter and her friend love Twin Peaks' broccoli pizza. Service is friendly, and they have good wine by the glass. A great Noe Valley resource!", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-20", "description": "Tasty pizza with decently thin crust (or thick crust if you choose that option).  \n\nThey do a great job with eggplant (no lumps of oily vegetable), spice things nicely, infuse garlic in nice edible  amounts, and generally provide a respectable answer to \"What's for Dinner?\"\n\nFlawless, polite, reassuring online ordering and phone confirmation.  Precision drawing of \"halves\" so that the lovely eggplant doesn't contaminate the mammal-flesh  part of the pie.\n\nHappy, efficient delivered food.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-15", "description": "Mediocre pizza with a bland crust and bland sauce and bland bland bland-o-rama.  Not greasy at all, though.\n\nVery quick delivery.  \n\nFood: 1.5 stars\nService: 5 stars  \n\nDon't ask how that equals two stars... it just does.", "author": "Sleuthy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-05", "description": "It's tough to review pizza here in CA -- as much as I love the veg-friendly options and fresh toppings, the pizza just doesn't compare to the East Coast -- one of my few complaints about California in the 2+ years we've lived here.\n\nThat said, I had basically a neutral reaction to Twin Peaks Pizza. I love that it's close to our flat and offers several veg toppings and a vegan pizza. My small spinach and ricotta pie had nice fresh toppings, just not enough of them, and not quite enough sauce. \n\nI was glad the crust wasn't overly thick, greasy, and/or doughy like many of the pizzas here seem to be -- it had overall a nice chewy texture, wasn't too thin or thick -- but it could have been cooked a little longer. \n\nBasically, it was a decent enough pizza, and I think I would be more excited about this place if it were cheaper. I don't think it should cost $30 to pick up two small pizzas with three toppings total.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "Best delivery pizza you can get in Noe Valley/Glen Park.  Staff is friendly over the phone.  Treat yourself and try the desert pizza....mmmm, bananas and chocolate.\n\nPros: They do a mean sausage, mushroom, and olive pizza.  Oh and the above mentioned desert pizza rocks!\n\nCons:  Sometimes delivery is sloooow.", "author": "Melissa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "Yummy pizza but a lil' pricey.\n\nThey don't deliver to my neighborhood.\n\nCollect their magnets, you'll get something free or discounted.", "author": "? ?."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-13", "description": "Last summer my wife heard the place was under new management and had good things to say after having a few slices at a kid's party. We went a few years without ordering from Twin Peaks.  I always felt their hearts weren't in making a truly good pizza.  Crust was always soggy and had the consistency of frozen pizza and they put too much cheese on.  I tried the plain cheese and sausage and mushrooms recently.  It's simply okay.  Less cheese but same boring crust.  Now I'm really worried that my wife is losing her NY edge after living here for 6 years.  I feel like I don't even know her anymore.", "author": "John C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-22", "description": "Ordered delivery from here a couple of times. Delivery time was pretty good, pizza was just average (especially for the price(.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "Don't listen to the haters..this pizza is one of the best in the city.", "author": "Casey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "Whenever I'm thinking about ordering pizza, I always think of Twin Peaks first.  Their pizza is consistently good, fresh and warm when it makes it to my place.  I also enjoy the wings.  Delivery is prompt and the drivers are friendly.", "author": "Tom D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-27", "description": "Update: I gotta bump 'em up an extra star for following up to my 1st review. In all fairness I can't bump it up more until after I've ordered from them again. \nBut I have to say I was really impressed with the fact that they contacted me and asked how they improve. They reponded again after I sent in my reply. Now that's customer service! I really thought they were going to curse me out after I sent in response.", "author": "Sheba B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-09", "description": "Thanks to TPP I not only got my g/f off her wack Round Table addiction but found some pretty damn good thin crust as well. I'm a purist so I do not get toppings on my pizza: if the pie is good enough then it doesn't need a buncha distractions littering the surface.\n\nNo, it's not like the pizza parlor around the corner from your apartment in Park Slope, Astoria, or the Upper West Side. It's probably close enough so as not to matter, and the longer you live here the less you will miss the real deal.\n\nOh, and the calzones are not to be ignored: baked to near-perfection. I get the medium with ground beef and mushrooms, and it is so satisfying. Also reheats somewhat better than pizza does, which is odd since a calzone is basically a pizza turnover. But I digest...\n\nCaesar salad on the side. Bonus points for putting so many croutons and so much grated cheese on the salad, and for adding tomatoes. \n\nAND you can order online. Much love for pizza and calzones via the interwebs.\n\nOh, delivery is fast and friendly so I always tip well.", "author": "ChickCaesar S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-30", "description": "The roomie & I wanted pizza and decide to exapnd our horizons beyond the neighborhood joints.  After sifting through our take out menu drawer, we decided on TP P&P.  The prices seemed decent, they had a coupon and one particular pie caught our attention.\n\nIn the midst of our phone order, the clerk told us we couldn't use the coupon unless we spent over $30.  Now that clearly wasn't stated in the coupon or on the menu.  She claimed the old coupon had expired, but right there on our coupon it said \"good anytime\" with no expiration date.\n\nWe ordered anyway, but this put a bit of a damper on our excitement.\n\nCue to our doorbell, about 45 minutes later.  Money changed hands and we had dindin in our hot little hands.\n\nAs soon as we both smelled out pizza...well - our mood definitely improved.  We had ordered up a mostly meat pizza - sausage, pepperoni, linguica - and the scent was heavenly.\n\nThe pizza itself was interesting.  Very, very thin crust, which I wasn't quite sure about...until I took a bite.  Good stuff.  The sauce had a bit of zing, and the meat and dough were both cooked nicely.  And because the dough was so thin - I was able to stuff 6 slices down my gullet.\n\nNo joke.\n\nSo yeah - the coupon debacle aside, TP P&P turned out to be a nice little find.  It wasn't my favorite pizza in the city, but it was solidly good, delivery was on time, and we will likely make another order next time the pizza craving hits.", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "I love the pizza here!  We used to order all the time when we lived down the street, but now we don't get it quite as often.  Our normal order is a cheese pizza with extra cheese and extra sauce.  You have to let it cool a little otherwise everything will fall off.  We recently ordered slices to go and you can order any kind of slice that you want and they make it for you right then.  It only takes about 5 minutes for the slice which isn't too bad when it's custom made.  There sauce is so tasty.  It has the perfect balance of sweetness and tomatoey tartness.  The sauce can really make or break a pizza and this one is pretty yummy.", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "I ordered from Twin Peaks for the first time tonight and they delivered.  Large pizza (16\"), three toppings, using coupon mailed to me, $24 +tip.  The lady taking my order was competent and polite.  The delivery driver was the same.  They said 35 min. and were at my door in 25 min.  (This was on Saturday night, 9 pm, heart of the Mission.)  The pizza was very good.  The crust was thin and crispy and tasty.  Toppings: quite good Calamata olives plus good enough sausage and onions.  The sauce and cheese were fine.  Overall the pizza was very tasty and crisp, and it was delivered hot.    If I had to find a downside I'd say that for the money you can get a thicker, heavier slab of crust and mozzarella for the same price from other shops.  But this pizza was delicious and fun to eat and they delivered it just like I wanted.  I will order from them again.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-07", "description": "This is the BEST thin crust pizza in the entire city. I don't care about your crappy local pizza place this is better. It took me for ever to find a good thin crust place and now I never order anything else( unless I need a deep dish but that's a whole other thing) I also love that after you collect ten magnets you get a free pizza. I can't say that I have ever tried the pasta but that's because the pizza is that good.", "author": "mark h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "Wandered by the other day, was greeted by an extremely friendly waitress, who made great recommendations, served it up by the slice, and was very attentive without being obtrusive.  Glad it's so close to my new place, as it's definitely decent pizza.", "author": "Adam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "I know that it is Tuesday night, but I think we have found our new Friday night pizza joint.  Great pizza!  Had the regular crust and looking forward to trying out both the thin and thick crust next time around.  My daughter loved the raviolis, she inhaled them in about three seconds.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "I once made the mistake of neglecting to order the thin crust here, and I will never do that again. Their regular crust is not up to par--the thin crust is much, much better. If you know pizza, you know that thin crust is really the only way to have pizza (unless you're going all the way to Chicago, that is), but just remember to request the thin crust specifically!", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-07", "description": "I've generally been pleased with the pizza from Twin Peaks Pizza on Church Street.  The pizza is normally well prepared and the service is good.  Tonight, I was not impressed with the pizza I ordered.  The crust was completely burned and I was shocked that the restaurant even served it. The worst part was that I called in the order for pick up and didn't realize the pizza was so burned until I opened the box at home.  I ate a few bites and disliked it enough to call the restaurant.  Ultimately, the manager got on the phone and stated they took great pride in their pizza and agreed this was not acceptable.  I'm giving the restaurant three stars because they prepared an entirely new pizza and quickly delivered it to me. The second pizza was perfectly prepared.  I think when a restaurant tries to \"make right\" the mistake, that's worth a lot.  I will go back, but I will make certain I open the box before I take it home.", "author": "Ross C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-20", "description": "Decent pizza. We especially like the Deep Forest. On our first delivery order our pizza arrived cold and the cheese on half the pizza had slid off (when it was hot) and stuck to the box. On our next delivery the pizza arrived hot and intact. We like the online order option.", "author": "Romeo And Lola K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "Twin Peaks Pizza is one of my favorites in SF.  They use really fresh, generous portion for toppings and the crust is a perfect combination between crunchy and chewy!  The people that work here are awesome as well.  It is a good as a neighborhood pizza place can get...I highly recommend checking them out!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-28", "description": "The first time I went there one of the guys gave me a free soda with my slice and that was really cool.  I like it better than Zante's.  The sauce is more on the sweet side versus Zante's. I'm still on the search for my all time favorite place in the Mission but I'll be going back to get a slice here and there.  Want to give it 3 and half stars maybe 4 but I need to go back again and have more pizza.", "author": "Sidney I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "For me, writing a review is something that I always mean to do, but never really get around to doing it.  But yesterday's Bianca Pizza moved me to action.\nI have ordered from Twin Peaks 20 times or so, and it is always excellent tasting, due to them using fresh ingredients.  The phone order takers are efficient, nice, and polite; and the pizza shows up hot and quick.\nNow yesterday's Pizza... in the words of Ovo... WOW!\n\nFor the indoctrinated the Bianca Pizza is an interesting mix of Buttermilk Sauce, Ham, Sausage, Jalapeno & Onion.  The 'milk' of the Buttermilk counters the Jalapeno nicely, so the pizza is not spicy at all. \n\nSo for you folks in the know, well done. For the newest among you, you should really give this pizza and the pizza place a try.\n\n~Bill", "author": "William W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-27", "description": "So I placed an order online and you can pay with plastic- Plus!\nThen they called me back to confirm within 1 minute- PLus!\nPizza arrived HOT- PLUs!\nIt was Sofa-King Good.  Eat here!", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "When you're in school forever, you do things you wouldn't normally do beyond the age of 16 FOREVER. Things like babysitting for an extra $50 on Friday nights while all of your friends who happily skipped away with their undergraduate degrees in hand are out partying. Such was the case for me and one of the only things that got me through was Twin Peaks Pizza. That's right: every Friday, for what seemed like an eternity but was in reality only a semester, I would babysit for a very nice family right around the corner from Twin Peaks Pizza. Because their child was indeed a BABY, I'd have hours on my hands to study, catch up on movies, and eat to my heart's delight. Back in those days, I didn't have to worry about getting fat, since I didn't really have time to go out anywhere where anyone cared about my weight and I spent so many sleepless nights writing, researching, and cramming that when I did finally eat, it made perfect sense to inhale a whole extra large, extra cheese and pepperoni and garlic pie from Twin Peaks Pizza. \n\nAnd oh, the calzones. Heaven! And oh the lasagna: Delicious! And oh, the meatball sandwiches: otherworldly. But my favorite remains the pepperoni and garlic calzone with extra marinara sauce for dipping. To. Die. For. And cheap, too. And fast. Now if only they delivered to my hood...", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-26", "description": "We absolutely love this place. It's awesome pizza. Thin the way I like it. Our friends always rave when we order from here. We do delivery from here almost every Sunday night. Plus they have a great collect 10 magnets and get a free pizza!", "author": "Nancy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-01", "description": "So disappointed my the pizza we got last Saturday.  It was a \"cheap\" pizza overloaded with sauce and cheese and totally turned me off the place.  We were able to eat it but will try some where else the next time we want pizza.", "author": "ORLA L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "Twin Peaks Pizza is the best delivery pizza place for Twin Peaks/Diamond Heights/Upper Market area by far. Actually I was really impressed with everything, the delivery time, the price, the crust. For sure will order again! Delivery guy was hot too.", "author": "Jack G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-30", "description": "Everything about this place is pretty cool, but does anyone else think it's fucked up that they know the door code to my building and I don't?  you don't think that's bad?  Try this one on for size:  Not only do they know my doorcode, but they won't tell me (the resident of said building) what it is!  They just lost a star for that shit.", "author": "Caleb D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "I love this place. My kids love it too. Very accommodating and they take direction well. Request well done, as with most pizza places to ensure proper pie integrity!", "author": "John E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-18", "description": "When we moved to our new hood, I was bummed because I could not longer walk to Giorgio's for pizza whenever I want it, but hey, I have found Twin Peaks--and they deliver. We ordered a simple half cheese and half peperoni pizza--thin crust--for delivery. I was told it would be 45 minutes to an hour, but in 30 minutes, my bell was a ringin'. The pizza was perfect--OK I only live 4 blocks away, so it was still yummy warm. We will venture into the restaurant here soon, but in the meantime--I have their take out menu. Damn good pizza.", "author": "Deborah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "This is my local pizza delivery place, and it's great. I really like the specialty pizzas (particularly the chicken special) and I love that you can order online. And they always call right away to confirm your order. And the delivery guys are nice. Major plus.", "author": "Victoria A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-22", "description": "Pizza.  Bland but good.  Nothing special.  In other cities this place would get 2 or 2.5 stars but SF has very few pizza options.", "author": "BeeryMcGymrat X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-21", "description": "Okay, here we go.  Worst.  Delivery.  Experience.  Ever.\n\nI actually really like Twin Peaks Pizza.  So much so that I had accumulated 10 little magnets, the number you need to get a free pizza.  Yay!  It's, like, going to be a fun, free night!  Or:\n\nI called them at 5:30.  At 7:00, I called them again.  They tell me the guy is on his way.  45 more minutes pass.  I call again.  Phone guy says driver guy tried to deliver, but I didn't answer.  Almost impossible, as my face was pressed to the window for the last hour waiting for dude, because I was so damn hungry.  Anyway, he asks me if I want them to bring it again.  Um, yes.  Yes I do.  I'm hungry.  At no point does the guy apologize, or offer to throw in a can of coke or anything.  Two hours plus, and counting.\n\nIt takes another hour for the guy to come.  It is officially three and one half hours from the time I originally placed my order.  Then instead of apologizing for the mix-up, or ANYTHING, delivery guy gives me enormous attitude, says my phone number is \"bad\" and none of it is his problem.\n\nI'm sorry, but since when is a customer's satisfaction not the concern of an employee of a certain establishment?  Am I insane?  Dude proceeds to try to refuse my magnet-coupons and make me pay anyway.  I finally shove my precious magnets in his grubby, non-customer-caring-about paws and slam the gate.\n\nScrew you, Twin Peaks.  Honestly, all it would have taken was one measly acknowledgment that you had messed up even a little.  Instead, you make me feel like I'm the idiot.  Which I am, for ever calling you.  Never again.", "author": "k s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-19", "description": "We order from them regularly for delivery.  There pizza is great, especially if you like thin crust.  They do a great job and are fast and efficient.  We have tried a bunch of places in Noe for possible delivery when we moved here 2 years ago.  Twin Peaks is the best hands down.", "author": "Rajeev R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "I'm surprised to read the negative reviews here for Twin Peaks Pizza!  Its a great neighborhood pizza place and we have NEVER had a problem with the delivery or the quality of the pizza.  And we order a lot - we currently have about 9 magnets on our fridge and we've cashed in 10 magnets twice (you get a free pizza with 10 magnets, and you get a magnet with every order)!\n\nIt does seem that they have gotten new owners and revamped the place in the last couple of years, and personally I don't see anything but improvement!\n\nIt is super convenient to be able to order online.  Their salads are big and fresh, and the pizzas are delicious!  Our favorites are the Latina (lots of spicy sausage, jalapenos, and cilantro) and the hawaiian.  But the standbys like pepperoni are also delish.", "author": "Abby G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-30", "description": "Pretty good pizza, fast deliviery, very impressed that driver could find his way around Mt. Davidson, good deal with coupons, easy to order online. I agree that the crust was good and they followed my instructions not to overbake. So many places have pies with burnt cheese on top. WTF?", "author": "ALEXIS S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "Twin Peaks fulfills all the necessities of your local pizza place.\n\n Recently they opened for breakfast serving the most delicious Brazilian pastries and fresh fruit smoothies! With my new health kick I would normally stay far away from a pizza place, but the salads here are huge and fresh and now my mornings are satisfied with their fresh fruit smoothies. \n\nFairly Priced \nFriendly Service \nQuality food \nGreat location (right of the J line)", "author": "Marissa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-26", "description": "Great pizza.  I would give it 4.5 stars if Yelp would let me.  I haven't ordered Round Table since discovering this place.  Very yummy, quick service.  Get it well done w/pepperoni.  Mmmmm", "author": "DB C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "I really like the thin-crust and the fact that they have a vegan option-- it automatically comes sans cheese and with loads of delicious veggies.  It's very easy to order online and delivery has always been timely.  Plus, they give you those magnets to collect in order to earn free pizza.  Cute, and it gives me an excuse to order.  I'm a fan.", "author": "Christy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-20", "description": "Pizza is just ok, but the calzones are AWESOME! And huge. Great veggie pizza & calzone combos too. Delivery is super-quick, as well. Always a huge bonus in my book.", "author": "Wendy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "We just moved here from NYC where pizza is awesome. Didn't have high expectations for the pizza here. We were pleasantly surprised with our extremely tasty pizza. In fact, seconds after we finished the first one, we called to order a second.  Happy to have found a neighborhood pizza place.", "author": "Linda F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-08", "description": "Wednesday night is pizza night. and with all the great pizza in the city, we're never at a loss for new places to try. I might be one of the only people in SF who doesn't immediately recycle the menus rubber banded to the front door of my apartment building. Twin Peaks left just such a menu.\nI was very impressedwith their ingredients list- lots of meats, tons of veggies and a selection of cheeses and sauce options. most notable of these was hearts of palm, litterally one of my top 5 favorite food items and a rarity in salad bars as well as on menus- particularly of the pizza variety! \njd picked two meats, pepperoni and salami, while I handled the veggies- hearts of palm and capers with some feta for good measure. we ordered the thin crust as well as took advantage of the awesome make your own salad option- all for about 33 bucks. \nwe only waited about 40min for delivery and it smelled great! when we opened the box, though.... sadness. :(   there was only about the equivalent of 1 1/2 stalks of palm heart strewn about our quite large pizza. the capers were also so far and few between that there were whole slices of the pie which only had one or the other of my toppings on them.\nwhile that really was a major dissapointment, on the bright side, it still tasted good. the sauce was yummy and the crust was perfect (I love crust). also, the salad was fresh and totally loaded... what a refreshing treat, cuz let's face it- delivery salad from a pizza place? that has waaay more potential of going the opposite direction of well! \nI think we will certainly patronize TPP again, but kindly ask for a more appropriate dusting of ingredients!", "author": "saraH c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "This is your standard pizza/pasta joint, and I love that about them.  They make a great pizza, and for those times when, if you're like me, you just want a nice spaghetti with marinara and a nice little side salad, this is the place to go. The employees are always nice, and they deliver, too!", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-11", "description": "pretty good pizza, tasty ingredients, good delivery time. Crust was a little thick and chewy, but that's san francisco pizza for ya. Better than Cybelle's, at least the last few times I've eaten there, so I'll be ordering delivery from Twin Peaks from now on.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-11", "description": "It is a sad state of affairs that I am giving Twin Peaks Pizza four stars.  However, after having an impossible time finding good pizza in this town, I realize that Twin Peaks is a four star delivery place for San Francisco.  But in writing this I'm starting to feel that, after three years in this city, I'm losing my grip on pizza reality.  Help!  Anyway, Twin Peaks has solidly good: crust, cheese and toppings.  Nothing to blow you away but good for a night with your lady-friend on the couch watching DVDs.  I'm partial to their pizza with fresh tomato and basil on top.  When I had the pizza delivered, they had an average delivery time AND the pizza was still hot, which is more than I can say for the rest of the places from which I've ordered.", "author": "LF P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-06", "description": "One of the better pizza places in SF, and one of the best to deliver.  We tried a few different pizzas, with the bbq chicken being the most adventurous.  It was really damn good.  The chicken wasn't dried out like a lot of other places and the fresh basil really made it.  I even had a few colleagues ask me where I got it.  I would order from them again, especially since you can do it online and they call back to confirm.  Can't get much easier than that.", "author": "Mrsdubyah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "I had called this place at 10:55 figuring that they wouldn't deliver to us because it was too late. I really was waiting for that response but the guy who answered to phone decided to take our order. I told him he didn't have to if he didn't want to, I didn't mind and then I gave him a minute. He still wanted to deliver to me. I had just come home from a long day of work and then a bit of drinking with friends. Then I realize half an hour after he gave me a 35 minute wait that I didn't have enough cash and he didn't give me the total. I called back really scared because I though that I had just messed everything up but he was soooo nice and let me give him a credit card after I agreed to tip in cash. When it got here....the pizza was so yummy. It was worth it!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-18", "description": "Their pizza is decent, and their delivery is fine.\n\nBut let me say this: DON'T go into the restaurant itself to dine in, unless you have plenty of time on your hands. We walked in, noted the almost-empty space, asked how long it would take for a slice, and were told 5 minutes. \"Perfect!,\" we said, knowing I had to be downtown for a rehearsal and was planning to hop on the J after a quick bite. We paid at the counter and sat down with our beverages.\n\n5 minutes go by, then 10...15...we ask if it'll be soon. \"Yup!\" 20...30... 45 minutes later we asked if we could have our slices to go. I wolfed mine in the car as my companion drove me to rehearsal. The staff apologized weakly but didn't seem concerned.\n\nWTF? A slice of pizza should never take 45 minutes. The whole thing left a bad taste in my mouth, and it wasn't garlic.", "author": "kelly r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "Best pie in Noe Valley. One of the better ones in the city.", "author": "doug d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-24", "description": "I think this place is great:\n \nOnline ordering? Check.\nTimely delivery? Check.\nDecent pizza? Check.\nMenu with lots of variety? Check.\nFair pricing? Check.\n\nThey also deliver salads - eatable salads - not the for 'decoration' kind. Adding some 'greenery' to pizza night can only be a good thing!  Psychologically at least............\n\nHighly recommended.", "author": "Maz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "My husband and I have sampled every pizza place in the vicinity and Twin Peaks is the best.  Their pizza is delish, their salads are good too, AND they are responsive to customer concerns about the environmental impact of take-out.\n\nCheck this out:  About a month ago I spoke to the owner about how I like ordering their salads (especially the Brazilian Salad with heart of palm - yum!), but that the fact that they use plastic \"clam-shells\" to package their salad to go gives me pause, being that the clam-shell is not recyclable in SF.  The owner told me he would purchase biodegradable salad containers . . . and in about 30 minutes I'll be picking up my first Twin Peaks eco salad!  I love how responsive he was to customer input.\n\nIf you live in Noe, this is the place for pie.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "Thanks Yelpers!!! Later in  the evening, work day and hungry, looked up what you all would recommend for a calzone and some pasta to be delivered. Twin Peaks pizza was great!!! Prompt delivery, great communication, friendly, great Calzone!!!! I would have given 4-1/2 stars but that wasn't an option, hazzle free and great!! The fettucine, well, a little bland, could have used some stand out flavor, a bit more garlic and cheese and less cream, but, hey, my food was fresh, tasty, delivered promptly with a friendly face. A great experience, I'd do it again.\nThanks!!!!\nL", "author": "Lara B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-26", "description": "Live in the neighborhood and decided to give it a try for Sunday night delivery. Had a flier on the doorknob. A few bucks less expensive than the competition. But no bargain. We ordered a large pizza. It was scimpy on sauce, the cheese was minimal and the artichoke hearts had been pulled apart so that just a few single leaves were spead on the pie. All the ingredients including the pepperoni was applied stingily. The crust was not bad but very mediocre. We will stick with our usual Haystack, Nizario's, and Cybelle's in the future. There's a lot of good pizza in the neighborhood . Sadly, this establishment  just does not stack up.", "author": "Bob J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-24", "description": "i have been a relative fan of this stand-by pizza delivery option in my neighborhood, that is, until last night.  usually order a smaller pie, but this time we needed a large.  when it arrived 45 minutes later, it was so soggy i literally sopped the water up off it with two paper towels.  it was an embarassing excuse for a pizza. i immediately called TWP&P to alert them to the travesty.  in their defense, within 15 minutes, we had another replica sent over.  yes, once again, this one was soggy too.  i really don't think i can ever call them again after that experience.  should have had a digorno.", "author": "e w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-08", "description": "Easy online ordering and quick delivery.  The pizza is very good, the right amount of sauce and quality ingredients.  This is our go-to pizza spot in the neighborhood.", "author": "K V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "i have been getting addicted to their cornmeal crust pizza!!! YUMMM! they say it is gluten-free...it is gooooood! i get the corn meal crust with tomato, onion and garlic - just to put it out there!! and they deliver beer!", "author": "claudia o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-01", "description": "Twin Peaks is an easy-going, chill place. They serve a great pizza and they are always friendly. Its kinda tucked away on the end of church, but its definately a good find. They make pizza slices from scratch!!! You can get anything you want on a slice, and it only takes five minutes! Great place to go if you waiting for the J line. On a chilly day there's really nothing better than a piping hot slice with melted chesse and all your favorite toppings- the slices are HUGE too!", "author": "Sasha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-20", "description": "love this place, great pizza, quick delivery.  the computer system is advanced, you can order online, they know what you like.  a little big brother as the other poster said but whatever - some of the best pizza around  (order thin crust)", "author": "Rob V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "You can stop fretting.  It does exist.  Tasty, East Coast-y pizza, as well-done as you like it, obtainable through cyberspace, and delivered promptly to your door .  Thank goodness.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-03", "description": "we ordered online, and wound up having to call them to confirm our order (they said they couldn't call an out of town number, but they had our email so they could of sent us a msg that way and i guess also they didn't have a cell...). anyhoo, they delivered relatively quickly, the pizza wasn't hot, but it was warmish. we had a 1/2 and 1/2 one side with pepperoni the other w/ chicken. the other toppings were fresh, the chicken, however, was not flavorful at all. basically the pizza tasted like domino's but with more toppings and a pizza hut crust. i wasn't won over, but my partner loved it.", "author": "Toisha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-12", "description": "Though the place is small, the ambience is warm and inviting. The service was excellent and the pizza is WONDERFUL. The special \"chicken delight\" is awesome. I would go here again to eat there and to take home.", "author": "Steph W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "good pizza, good service, fast.  exactly what i want.\n\nno the pizza is not as good as the pizza on the east coast as mentioned.  i miss east coast pizza too, but.....i live on the west coast.", "author": "n. h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-08", "description": "I love this place! It's the closest thing we've found in all the neighborhoods we've lived in SF that compares to East Coast Pizza!  Plus the people that work there are great!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "In most other cities, Twin Peaks would a perfect average three-star pizza joint - nothing too spectacular, just a solid neighborhood standby. But San Francisco is not a pizza town. Most of the pizza places here are over-priced, some are downright awful, and a few don't even deliver! Twin Peaks, with its tasty, reliable pies and prompt delivery, positively shines by comparison.", "author": "A R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-12", "description": "sadly, this is the only pizza place in my current 'hood. gone are the days of living around the corner from delfina pizzeria and walking distance to little star and arinell. i succumbed last night because we were too lazy to pick up take out from little star. we got the sausage, pepperoni, onion and green pepper thin crust, a small salad and the chicken wings. the pizza dough although decently thin and crispy was really bland--no flavor. the sauce uninspired. the toppings were generous and well proportioned. there's just no love in the pizza--NO LOVE. the chicken wings were a miss, too. they cook them in the pizza oven! they're not fried! they're not even oven-crisped (yes, this can be done, just bake them before saucing). i'm a wing lover, and the only way i could eat these wings was after my hubs shallow fried them in peanut oil in a cast iron skillet in our kitchen. that's pathetic when you have to finish cooking your own take-out. i haven't tasted their pastas, but i think i'll save my money for now. i can't imagine it's better than what i can put together with jarred sauce and FRESH pasta, organic veggies and meat that I can buy and cook myself. this is purely an emergency takeout place. lots of people in the 'hood like this place, but it's for the same reason we all eat at eric's chinese food--there's nowhere else to go!", "author": "E L."}
