{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I love this place.  It attracts a diverse crowd of people from around the world.\n\nAnd, yes, it also attracts a core group of people who have been regulars for decades.\n\nIt is definitely worth a stop on any trip to the Castro.", "author": "Harry J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "Located in Castro district. Parking is difficult so take an Uber or lyft instead. This place was small and cozy. It's a good place to hang out and chill and have a couple of drinks. Their cocktails and drinks are kind of cheap for San Francisco.", "author": "Mia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "So this place is dated but that is the charm of it. The bar itself is small inside but I'm sure it's because most building in the area are historic. The drinks where strong and worth every penny. You must bring cash to this bar they do not take debit or credit. There is an ATM on the property just in case your like me and never carry cash. The location is right in the center of the Castro district. It has a second floor that overlooks the bar, it small and only has 3 small table with a window that overlooks the Castro district. If you in the Are and want to drink in a room full of history this is your place if you prefer a more modern less dated space then this is not for you. Either way if your are in the district give this place a chance.", "author": "Hernan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Fun, great spot to hang out with people. Love the ambience and Tiffany Glass lamps. Also, a large balcony overhead to observe the crowd. Great. Nothing but laughter, friendship and smiles.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Twin Peaks is named after the nearby hills above the Castro. In the Gay era of dominance of the Castro in tbe 1970's through the 2000's, it was called the glass coffin since it was one of the first Gay bars in San Francisco with open, clear windows as well as being a hang out for Gay seniors.  \n\nNow in the late 2010's, it's a mixed bag of the teeming masses living in San Francisco. Part old school Irish pub in look and old school dive vibe, it also serves as a neighborhood bar. Not a destination bar. Come by to wet your whistle while tooling around the beloved Castro, home to illustrious Gay politician and photography store owner on  Castro, Harvey Milk. \n\nFull service bar with a small mezzanine overlooking the main bar. Casual & come as you are.   Watch your head when going to their all gender bathroom.  3+ Yelp stars.", "author": "Gary I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "Fairly mellow neighborhood bar kinda sorta right at the beginning (so to speak) of the Castro.\n\nParking? This is the Castro. Good luck. It's literally across the street from two public transportation light rail thingys so there's no issue getting here car and uber less.\n\nThis place is a great spot for a pint or a cocktail. It has lots of large picture windows perfect for viewing the ebb and flow of the street-along with the trolley stop, Harvey Milk Plaza is fully within view. It's a classic western bar-brass rail footrests along the long hardwood counter with full size mirrors backing the bar. Also lots of wooden tables and cushiony spots on ledges right in the windows. Those last are perfect spots for lounging. There is also a smaller section upstairs that is somewhat more intimate, should you so desire. The bar has a ten or so taps which cover just about all tastes in beer, a superior wine selection, and the bartenders are pretty handy with the cocktails for the most part. Pricing is not all that bad considering you are in one of the most expensive cities in the world. While the cocktails can run you out of cash (and this is a cash only place) with a quickness, beers shots and basic stuff like rum/whisky and coke are pleasingly wallet friendly.  \n\nThis is considered the first openly gay bar in the area, so there's a feeling for history here (the bar dates to 1935), yet you don't have to be gay to come and enjoy a drink or two (or three. Who's counting eh?) while you are out and about. Indeed if you are not comfortable with/new to the whole gay culture thing, this is a great way to wade in as opposed to jumping straight off into the deep end. Start by talking to the oldtimers at the bar. They've been around long enough to have seen (and in many cases been a part of) just about everything. \n\nWhen it's all said and done, this is an excellent local spot for a shot of mellow liquor based relaxation.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Love this place! Great atmosphere and fairly-priced drinks. This place is definitely more laid-back than most Castro bars and attracts an older and frankly straighter crowd. Still I have always had a good time hanging out here after dinner.", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "Nice corner bar with great people watching. Beer is very reasonably priced. Convenient to MUNI so all different kinds of people walking by. Clean bathrooms, upstairs has a lock but the first floor one doesn't. At least the tell you before you use it. I would definitely come here again", "author": "Ellen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "Hey bartenders, being gay does not give you a free pass to say horribly sexist things to women. Came in here with a girlfriend and the bartender repeatedly suggested that based on our clothes, we were prostitutes \"on the wrong corner.\" Yeah, we get it dude. If we were selling, no one here would be buying. But we're not selling. We just wanted a cocktail after seeing a show at the Castro Theater. Get the fuck over yourself.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Great little bar on the corner next to the transit system on market and Castro. Drinks seem to be small but overall it's a cute little cozy lounge bar. Bartender very friendly.  Would recommend to anyone wanting a casual experience.", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "The heart of LGBT life in Castro! Gay or not, you are always welcome at Twin Peaks Tavern. Cool drinks and great people here!", "author": "Katerina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "This bar is a staple in the Castro. Always good energy! José is my absolute favorite bartender and is always super attentive and personable. Love this place!", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "Ordered a Vodka Gimlet \"up\" and somehow got a highball with ice, vodka, roses lime, and a sugar cube? Wasn't bad tho! Cute and nice bartender ;)", "author": "Luke P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "It was cool being in a bar that has as much history as this one. Cool ambience & atmosphere. It reminded me of a bar we have back home in Seattle. I wouldn't say I had an amazing drink or an extremely good deal for a drink, but overall felt like a good bar to be in in the Castro.", "author": "Lander L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "I usually loved to go to this place, but the last 3 times I went there the bartender with beard was very very rude with me and my partner, always with bad mood and zero patience with customers. When i asked to taste one wine he made a joke if i wanna taste all, just because pinot noir he offered was very bitter and older with bad taste. Also every time I try to pay with debit card they don't accept asking me to pay just with cash..very sad because I loved this place before, I hope they can improve in respect of all loyal customers.", "author": "Pris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Great service with friendly people. Mostly older men socializing and having a mid-day drink.", "author": "Chelsea P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "Amazing must stop visiting SF. Be prepared- bartenders hate that - ummm CASTRO has- ummm 20 freekin years ago \" gentrified. The bartender threw my credit card on counter in trash. Germans saved my life. Cash only.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "As a tourist you have to go here. It's a beautiful bar with a lot of friendly people here. It's one of those places where you may walk in alone, but you aren't actually alone.\n\nI had a cosmo there that was amazing. The staff is delightful and the crowd is very mixed. \n\nI can see it being a great meeting spot since it's right on top of the hill in the Castro.\n\nThis is definitely a go to of mine every time I'm in town.", "author": "Andy V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-18", "description": "Great place if you are not female. I've been here a couple times with my gay male friend and have never had an issue. I came with my mom and aunt and the bartender ignored us and then when he did get our order asked for all our id's and my aunt didn't have hers so he asked us to leave but right before that a male couple came in and he helped them right away and didn't ask for their id's at all, even though he said it was policy to ask everyone. Very disappointed and sad it made us so upset we left castro.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Had to stop by during our visit to the Castro and it had a pleasant mix of girls and guys of various ages but most late 20's, 30's and above.  It can go from light to dark in line with the sun and we went at night to catch a drink before going out. It has a classic/historic/local feel and you can sit and people watch out the windows, which was very entertaining.  Unlike other girl posters, my fiance and I had quick and friendly service with very strong drinks.  In our experience, we had no issues with the bartender or other patrons.  I loved my experience there and felt like this was a great spot for locals and tourists wanting to experience a landmark historical lgbtq bar.", "author": "Mee-Jin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "What a great bar! Classic guys, great classic drinks (ask for the killer Manhattan filled to the rim with tasty booze), and an historic setting. Check this place out and revel in the bright, sunshiny wind", "author": "Christopher M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "If you are in Castro street, this is one of the lower key bars that's fun to grab a drink at. A pretty laid back scene where you can actually hear your friends and enjoy the afternoon over a beer. This isn't the hugest turn up scene, but it's definitely worth checkin", "author": "Ross S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-12", "description": "Bad experience. Brought a group of 7 friends here after watching a film at the Castro Theater after hearing about it in a book. I reallllly wanted to like it. It was 5pm on a Saturday, and the clientele was all old, white, grumpy men. Men from multiple groups glared, visibly looked annoyed and shook their heads at my (young, PoC) group of friends. Unfortunately we were so uncomfortable that we left without getting a chance to check out the bar. Hopefully the crowd isn't always like that, but my experience was sadly very bad. Tried to see if others had similar experiences but couldn't find any so maybe it was just bad timing/some grumpy dudes.", "author": "Sita K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-24", "description": "Came here after we were done dancing and just wanted a night cap. I figured this place probably made good cocktails because I didn't see a lot of stuff on tap and they had a nice assortment of warm, coffee based cocktails. I ordered the Irish Coffee and it was for real SO bad. \n\nI had about 2-3 sips of it and thought..hmm..maybe it's just me. Asked the 3 friends I was with, and yeah, NOPE. \n\nCocktails were about $7-9 so really a bummer that our drinks sucked THAt much.", "author": "Aria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "As a non gay man, writing a review for a gay bar seems a bit odd, but here we go! \n\nHad a couple drinks with my uncle on a visit to San Francisco. Other than getting hit on by the bartender (how did he not know my uncle was my \"significant other\"?), and this being an all gay bar, and not being gay, this place was great! \n\nNot on the menu, I ordered an old fashioned and for $6.50, it was really, really good. So much so I got another and was only changed $5 for that one.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "The bartender at this place was very friendly. There's a stereotype that gays and lesbians don't get along but honestly I have yet to see that. We ordered Stella. The only downside is that it's cash only - as are a lot of places we went to. The bar itself is very cozy, so whether you're day drinking or having fun at night, it feels accommodating and welcoming. I wouldn't mind coming back here again.\n\nI marked the noise level as quiet but keep in mind that I checked in, in the afternoon.", "author": "Ana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "This is an old school gay bar located on Castro and Market. It is known as the \"Glass Coffin\" because the clientele tends to be older and the nature of the bar is calm, with large glass windows, hence the nickname. The decor is dated with once classy carpet and tiffany's style lighting, with an all wooden bar as the backdrop.\n\nThe bar is usually busy for happy hour and then clears out to the regulars later in the evening after happy hour. There is a music box where you can select music, but there is no space for dancing. The drinks are strong and the bartenders are friendly. Due to its location the bar tends to attract tourists, but has a good mix of locals as well.\n\nI like this place because I am able to sit down at the bar or grab a table and chat - not being bumped into. There is a great upstairs loft that is a great addition to the bar.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-25", "description": "This lovely old school bar is located at the corner of Castro St and 17th St, next door to Hot Cookie. Street parking only. While we were there, the clientele were mostly middle-aged and older. No dance floor area so even though it is listed as a \"dance club,\" the only real place you can dance is in your seat. Most of the bar can be seen through the windows so you can people watch easily from your seat (no outdoor seating though). Bathroom downstairs has no lock and really smells so be careful when you go!\n\nWe came here as a nightcap with some friends from our hometown who were leaving the next morning. Simple traditional drinks mostly w/ SF prices. My sister ordered a Kahlua Coffee which was really good! People seem to be pretty friendly as one drunkie came to sit at our table and poured his poor little heart out. Gave us a whole bunch of hugs, kisses, and compliments though. Ended the night very interesting to say the least.\n\nCash only", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-21", "description": "This place is depressing. It's  dark and dingy, the cocktails are ok at best. The glasses are always sticky. Someone's always crying it seems like. Someone's always in the way of the bathroom. Someone's always obnoxiously drunk. Now I know why they call it the coffin, and it's not because of the windows, this place literally feels like all hope dies once you enter.", "author": "Sabrina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "Being an avid fan of gay bars as a straight man, the wife and I wanted to head to the Castro while in San Francisco. We live just on the outskirts of Hillcrest in San Diego so we figured the Castro would live up to its wild reputation. The wife picked Twin Peaks Tavern and in we went. Although friendly, when we walked in I could feel the proverbial record scratch to a stop and the crowd turn our way, silently asking telling themselves \"these two are lost\". Nope, not lost my Social Security gathering fellas. The place was slammed so we resorted to standing in the corner with our sub-par drinks just standing there all awkward until the nice guys next to us offered some seats at their large table. Great place for sure, just not my cup of tea at the moment. I was hoping for something a little more upbeat, but after all it is named \"The Glass Coffin\".", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Yes, it's true that the Twin Peaks Tavern is called the Glass Coffin, but I wonder if everyone knows the meaning? The glass part recalls that the Twin Peaks was one of the first gay bars to have floor-to-ceiling clear glass windows. Before that, all gay bars had blacked-out or no windows. The coffin part is probably a sarcastic reference to the age of the patrons. Regardless, it has a prime location, friendly bartenders, and ample seating that make it very popular for a drink after work or an enjoyable weekend afternoon people watching. Notes: Twin Peaks also has a BarLink Internet juke box that allows purchasing credits on the spot or using the BarLink app to order up your favorites for a modest fee. Cash only with an ATM in the upper balcony.", "author": "Ted C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "This place was a real drag to the end of a good night. The bouncer was really bipolar and came to our table for no reason after he just let us in. He started yelling at and even hit my friend with the door. DO NOT COME HERE. There are plenty of other places that have much better service.", "author": "Jordan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Do not come here, if out for the night! I came into twin peaks with a large group and after a long while we switched to water and the bartenders cut us off of water. Despite spending quite a bit on alcohol - the bartenders refused us water, claiming this is a place of business and they care more about business than the health of a their customers. If you are out for the night, DO NOT Come here!!", "author": "Shannon S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-18", "description": "Cash only? Drinks aren't super expensive here, but it's kind of a bar for middle-to-senior-aged men even though it's listed as a dance club. There is no dancing going on here, and drink choices are pretty limited. Seating is difficult to come by, and drinks are pretty well portioned out with liquor. People are friendly, but it's an old-timey kind of place to just chill and relax. There honestly isn't much more to say than that.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Ah, the Glass Coffin, a Castro staple.  Irish coffees and cozy interiors and an intoxicating cookie scent.  Great for people watching too..", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Other than the older, intoxicated gentleman who continually cupped my partner's balls last night when I wasn't looking--this is a wonderful, comfortable place to have a strong drink and enjoy the views.\n\"Am I doing something wrong?\", he asked as I removed his hands for the second time from items that he is not privy to.\nThe bartenders are great.  They politely asked the gentleman to refrain from his fondling and then escorted him to the door where they helped put him in a cab.\nThis was all done with a wink and a smile.\nPretty cool.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Came here after I took a Detour (audio guided tour app) to meet Cleve Jones (!!!!), who worked closely with Harvey Milk. The place has a lot of character as it has been around a long time. The bartenders were super friendly and fun, but the place is pretty small. Twin Peaks is a really good spot for a drink in the Castro aaaaand did i mention there's a place called Hot Cookies next door AKA fresh baked warm cookies? mmmm I couldn't resist. What's better than a bloody mary and a warm chocolate chip cookie on a Saturday afternoon? Not much.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "Great location to stop and have a cocktail.... the people are always friendly and welcoming. A great old bar to try out when you are in the area. \n\nGet a cookie next door and then go to the Tavern for a drink", "author": "Frank C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "I like the mix up of crowd here . Theres alot of different walks of life that come in this spot and the drinks are served heavily handed which I enjoyed.\nGreat place to chill, kill time,  I had a great time just relaxing here with good company while I waited for someone to get out of therapy.  When I came in they'd always have some great sports on with a mix of other things.   Great location and the drinks are priced not badly.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-12", "description": "Was here with cherished friends who put the L in LGBTQAS.\n\"Put\"? Nah, they *gave* it the L.\nTruly, a few San Francisco OL's were in the house.\nYeah. Original Langsta.\n\nAfterpartyish of a theatre production we'd just finished.\nWe were the upper level plus some of the ground level.\nPeople (jokingly?) said we scared gay dudes away.\nI can't tell the difference between here and the Lexington anyway.\n\nWait, yeah I can.\nLexington's the one with the pinball machine.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "After a bottomless mimosa brunch on a Sunday afternoon at Bisou, my friends and I happened to walk in here because our tiny bladders were about to explode after endless cups of bubbly mimosas.\n\nPrior to looking Twin Peaks Tavern up on Yelp, I had no idea of the fame nor significance of this bar. In retrospect, I can certainly see the charm of it-- a quiet hangout spot, low-key atmosphere, friendly faces, and bright, natural lighting. It's that local bar that people frequent to gossip, catch up, or people watch. It's that bar where your table neighbors strike up a conversation with you and ask you about your day. My table neighbors recommended a coffee/Kahlua/Baileys drink, which happened to be the perfect Sunday afternoon beverage for a cold December day.\n\nI think I like Twin Peaks because it has the same kind of appeal as hanging out at a coffee shop. Rather than coming to get smashed and trashed, people come here to enjoy a drink and enjoy their company.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "Awesome bar, with some great historical significance. \n\nIt was the first gay bar with windows, and we happened to stop in on their 40th anniversary.\n\nDrinks are cheap, the staff is nice, and the patrons are friendly. Talked to some very cool people, and loved the comfy seating against the windows.\n\nI would absolutely come back here. Here's to 40 more years!!!!\n\n**The bathroom upstairs smells like the snickerdoodle cookies made next door at Hot Cookie. ***", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "Watch what you give the bartender .  Gave him a $20 and gave me change for a $5. I questioned him on it to no avail.  Not a good way to treat out of town guests.", "author": "Ed C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-20", "description": "Great neighborhood joint. Bar is never too packed, so I can always get a seat. Staff is friendly.", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-14", "description": "This bar is hot or miss....If you don't know the Bartenders, they seem to prance around you. Even if you are sitting at the bar...I'm sorry I don't come here every night, but ignoring me to chit chat with your friends isn't really good for business", "author": "Dominick S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-20", "description": "A nice little bar, but on the pricey side. I had an issue with a patron when trying to use the restroom, which left a bitter taste in my mouth and no longer care to come here. Luckily, Castro is filled with other bars.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-18", "description": "$4 for club soda in a small glass (with other alcohol purchase) is not worth the view.", "author": "Matt Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "Best smelling bathrooms EVER!  Thanks to Hot Cookie next door lol.\n\nGreat cocktails in a social yet somewhat quiet environment.  I love coming in to this bar to meet up with my pals before going out.  They actually pour a good cocktail too!", "author": "Matt V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "A must stop! Best drinks and, during the holidays, the best Nutcracker display. Friendly patrons and waitstaff make this an amazing place to rest your feet and wet your whistle.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "We came here after the Pride Parade and the Castro was crazy. So many people celebrating. Since my girlfriend and I were staying in Twin Peaks we decided to head to Twin Peaks Tavern. It was wall to wall people, but the inside is very cool and harkens back to an older time which I like. Cheap beers, really friendly people, a great place to celebrate.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "This whole place was swamped packed! Pride weekend on a saturday. bartender was nice, seemed a bit nervous and shaky. Had a good time here though, cash only which sucks, totally inconvenient their ATM is on the second floor. took me a while to get there. prices are not bad either.", "author": "Codey U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Stopped in after taking the Detour audio tour of the Castro, narrated by Cleve Jones. Perfect place for a Miller High Life, or actual champagne I guess, after the tour. If the bartender Joe is working ask him why he's always clapping :-)", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Stop #1 for Santacon... Roomies were clueless about this place's reputation, haha. All good though. Nicest crowd -- everyone was just hanging out having a good Saturday afternoon with their friends. Good place to start. Yummy Irish Carbombs.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-26", "description": "I know I ordered well drinks but they were terrible. There wasn't even music playing and the bar tender was not pleasant either.", "author": "Trish D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-14", "description": "Quite charming!\nLet your hand trail on the railing as you ascend their teeny winding staircase, for you may as well be entering another era. Pick a velvety seat, and sip on something with a cherry. I did. It was pleasantly dim and felt like an embrace.", "author": "Meghan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-17", "description": "Very disappointed with the staff working Friday evening Dec. 18, 2015 (younger male, older female). I made the mistake of leaving my bag in the bar - sober but distracted by ushering my intoxicated friends out and safely into cabs. I realized as soon as I got home, called the bar three times, told them exactly where I'd left my bag and the two times I got someone on the line they said they'd done a sweep of the place and my bag wasn't there. The next morning I called at opening and the person working then said my bag was behind the bar. I immediately picked it up and checked my wallet - to my surprise, all of my cash was gone! Over $200. I was completely shocked and disappointed. We were one of two parties that left the bar at closing time that evening, the only time I wasn't with my bag was when it was locked inside with staff. I've been a patron of Twin Peaks Tavern for 10 years, I have a friend who tends bar there, however I'll never go back due to their shady employee(s) who stole my money.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Great strong cocktails, super friendly staff and nice interior. Loved it for an after dinner drink.", "author": "Audrey W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-28", "description": "As some young gay twinkie whippersnappers call it, \"The Glass Casket\" or \"The Glass Coffin\" because the whole front is glass and inside is full of old folks.\n\nThis bar is old school, it's been around forever and when you go inside you can tell.  A great place to find SF old-timers.  A bit overpriced for drinks.  Go inside and check it out.  An excellent place to sit and people watch.  Friendly drunk people.\n\nIf you are a gay male and a senior citizen and you want to hang out with other people your age that are also gay guys, then this is your bar.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Unpretentious, friendly low-key bar in the heart of Castro that smells like chocolate cookie (coming from next door). Definitely a good place to stop for a beer and a GREAT SPOT for people watching.", "author": "Olivia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "The Twin Peaks is the only bar you can reliably have a drink and talk with your friends late on a Sunday afternoon in the Castro.  The other watering holes have succumbed to fundraisers, drag shows, and sports... All delivered at a SUPERLOUD volume. \n\nAt Twin Peaks there's usually room at a shared table, and you can always hear your friends. I like the low-key, different-aged crowd, and I love picture windows through which you can watch the world go by. The recent nudity by the wrong people centered at Market and Castro makes some of the views less inviting -- bring back the unobstructed view of the gas station -- but the liveliness of the streets coming into the bar is a great bonus.\n\nBut... \n\n1.  If the bartenders smiled or acknowledged your presence without a flat stare, I might think they cared.  Luckily, I don't have to worry.  Typical: Sunday one bartender glanced over the people queuing up at his well, turned his back, and chatted up someone he knew at the end of the bar some more.  The other bar tender was chatty and friendlier six months ago, but apparently he was told he had too much personality and is now flat, too.\n\n2. The drinks are small and more expensive than other Castro spots.  You get a small cocktail glass when you order a mixed drink, say gin and tonic. If you order a drink without mixers over ice -- say a Manhattan -- they use a really tiny glass. The gin and tonic and the tiny Makers Mark Manhattan was $12something, if I remember correctly.  They have no happy hour or drink specials.\n\n3. Their well bourbon is nasty.\n\nI so much want to have a place I can go with my friends for a drink on Sunday, but I don't want to have to fight the Twin Peaks staff and pricing. Between 5:30 and 7 Eurkea's lounge http://www.yelp.com/biz/eureka-restaurant-and-lounge-san-francisco offers happy hour special cocktails that are better, cheaper, and served by folks with personality.  Thank goodness.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "This bar has a coziness to it that I like.  I also like the seating and their arrangements.  It's a really nice spot to people watch.  For me, the best time to go there would be between 2-430pm while it's still sunny out.  The crowd is usually older - say 45+.  The regulars start drinking like at 11am, so by the time you walk in they're already drunk and cheery.  It's fine.  If you understand what the bar is and what it offers, only then can you appreciate it.  If you're lookin' to meet new people and/or \"hook up\", I wouldn't choose this bar.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-01", "description": "Meh. I've experienced better. It gets good marks for the location, being open midday, and for cheap drinks ($8.75 for a beer & a screwdriver). But it loses points for the service (not very responsive), the entertainment (was that The Chew on the TV?) and the clientele (who seemed uncomfortable with me and my partner coming in, but we're only in our late-20s).\n\nI'm glad I went once, but don't think I'd go back.", "author": "Brad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "Great (\"iconic?\") little bar for Older Gay Folks and their admirers.  And everybody else, come to that.\n\nAs I am now officially an OGF myself - big Five Oh baby - I should be coming here more often scouting out my future bar stool based on the presumed longevity of the current incumbents, though there's probably a list somewhere I have to sign, just like the freakin brunch line at Harvey's.\n\nLove this place.  A strong pour of questionable liquor - my last G&T was three fingers of a no-name Gin and I think he just waved the mixer gun in the general direction.  That's my boy...\n\nMost choose to sit downstairs admiring the view through the floor to ceiling windows, though these days it's likely a view of the pimply butt of one of our friendly nudists who parade around Jane Warner Plaza.  I prefer the upstairs.  Cozy, and like to think of it as my own little drawing room in the Castro.\n\nAgain - love this place.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "I love Twin Peaks! I can't believe I lived in SF so long before discovering this place. Like others I had no idea how famous or significant it was before wandering in. The place has a really cool, hip-yet-antiquey vibe, with stained glass lamps, vintage furniture, art, and low light. \n\nDrinks are cheap and strong, and there's a great upstairs for people watching. The bartenders are very nice and the vibe is welcoming and open.\n\nI love this place and will be back soon.", "author": "Courtney A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "Was in San Francisco June 2008 ended up at the Twin Peaks Bar in the Castro area wow!  So much fun full lenght windows good view of what was going on outside and they had a great view of what was going on inside.  It was Pink Saturday day before Gay Pride place was fun lots of cool people men and woman.  Met some nice people there we are still friends, so go check it out you won't be disappointed!", "author": "Jan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Great bar with a lot of history.  Terrific place to have a martini in the Castro and the bartenders are wonderful!", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I'm straight as an arrow and every time I've been here I've had a great time. Awesome drinks, friendly bartenders and great people. If you visit in the wintry season try their hot buttered rum. The only slightly weird thing is the men's room. But if you hang around long enough you get what you came for.", "author": "Food D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-12", "description": "This place is now more well-known thanks to Lady Gaga popping in here a couple hours before her show in the city. I've always liked this place for the warm atmosphere and great cocktails. They make a great Manhattan here, and you won't be disappointed with any other mixed drinks.\n\nIt's not a particularly amazing place to get a beer - but I don't think it's trying to be. And it's not really marketing itself as a gay bar. It's really more like a great old fashioned bar that happens to have an old fashioned gay crowd.\n\nNot to say that things don't heat up. My 6'4\", rugged type, rock climber friend got hit on a bunch of times. But hey, we came to the Castro, so we asked for it.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "Amazing, must-go-to bar if you're in San Francisco, specifically the Castro. I make sure never to miss at least one night at Twin Peaks. The location is perfect for people watching on an exciting corner in the Castro. Coming from Philly with some strong pouring bartenders, this place definitely knows how to make a drink worth your spending. However, not only does this place have a great appeal to all ages, it smells fantastic! What other bar can you go to that smells like fresh baked cookies any hour of the day or night? I thought so.\n\nI had the pleasure to meet one of the owners over SF Pride weekend - and he couldn't have been nicer and more welcoming if he tried.\n\nMy one suggestion: Cocktail boys serving those hot cookies from next door! \n\nCan't wait to come back!", "author": "Chris P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-11", "description": "No, I am not the typical clientele being a 20-something lesbian but I can enjoy a relaxing bar just as much as the next Queer.\n\nMy wife and I came here and felt drawn to the old-school look and feel. Unfortunately we missed the great cookie smells but got a full experience with the older gays and people-watching. The bartender was nice enough and since I only ordered a draft beer, I can't say anything bad about the drinks. \n\nAs an out-of-towner, I'll pop in again the next time I'm in the area. Kudos, Twin Peaks, for being one of the only bars in Castro that we thoroughly enjoyed.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Perfect location.  Great people watching spot.  Strong drinks.  Older crowd but very friendly and accepting environment.  A great spot for an afternoon drink.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "This place, in which I met the best men of my life, is now a straight bar... Spiros, the ugliest bartender in the world, cheats you out of your change.  This is a sorry place, now.", "author": "Charles J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-29", "description": "A place for older gay men, not 30-something lezzies.\n\nYou know generic-brand groceries?  The kind where the dollar store doesn't even bother to hire a designer to make label anything other than a black-and-white printout of the product's name? (E.g., \"PEAS\" or \"PICKLES.\") Twin Peaks buys the VODKA off that shelf and makes cocktails with it.  Terrible hangover - after ONE drink!\n\nIt's quietish and chill, with nice hangout spaces and a great view on the Castro. Worth a spin as long as you understand the limitations.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-23", "description": "So I'm a young guy with absolutely no interest in coming off as an old soul or bolstering my \"I'm-better-than-you-because-I'm-not-looking-to-get-laid cred\" by intentionally hanging out in the worst of all possible places to cruise. And I would be personally annoyed if my bar got invaded on a regular basis by homos with abs and something to prove about the depth of their souls....\n\nSo I'm just going to say that this bar needs a little work to be acceptable to my generation & my generation is who I write reviews for.   \n\nThe two things going for Twin Peak Tavern are its balcony--which is a nice serene place to drink and chat--and the intoxicating smell of baking cookies.\n\nIts biggest negative is not its advanced age clientele--though that's what it's most often derided for--but the horrible alcohol selection they have going on. \n\nAll the booze seems to be of a Winner's Cup caliber. If they have anything from a respected brand, it's under the bar and completely invisible.  \n\nI'm not comfortable being the youngest guy in bar and making a fuss. So I got a beer.  I got a Sierra Nevada to be exact because this bar has a beer selection befitting college dives in Chico!\n\nI don't need them to pack the place full of 20-something beauties to say it's A-OK. I need a few fancy liquor bottles and a beer from a producer I admire.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Love this place! I believe it's been here 40 plus years! Very historic and historically gay owned. Great spot for a night cap or Sunday mid afternoon drink.", "author": "Juan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-21", "description": "Great location, fantastic ambiance. However, the service left us with a bad taste. My friends ordered Irish Coffee's and it turned out John had something in his drink. John went to the bar the bartender and he said that it didnt come from the bar and there is nothing in the bar that resembles the piece of plastic. He then told john that he must have  dropped somethingin it...WHAT? We all work in the service industry and know how it is and still cant believe the guy was so rude!\n\nIf not for this experience I would have given it 5stars:(", "author": "Ginger R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "I really dig this place. They know how to make their drinks (one of the few places in the city where I don't feel bashful asking for a grasshopper), and the vibe is great. People here aren't trying too hard, or trying desperately to impress others (but this is my opinion as a straight gal, YMMV). It's just a very chill place to spend a Saturday evening.\n\nI love the upstairs, just make sure you can carry your drinks up there without spilling. Also, it's cash only. This should be updated in the info.", "author": "Angeline P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "Great, relaxed atmosphere in crazy Castro. Twin Peaks is an excellent place for cozy conversation. Full of sweet gentlemen & filled with tasty drinks & the amazing aroma of freshly baked cookies! Nice, historical spot... appreciate this cozy Castro tribute!", "author": "Jill B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-23", "description": "So this place apparently is called \"The Glass Coffin\" or a \"Natural History Museum\" because the clientele is somewhat older...\n\nPleasantly surprising, I found the crowd to be just a mature crowd of all age brackets, socially carrying on, without the hustle and bustle of an \"A&F - Britney Spears - Bubble Gum - Dance Off\" kind of bar.\n\nI met some great people who actually had great things of depth to say, and really enjoyed the relaxed atmosphere.  The drinks were nice too.", "author": "James V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-11", "description": "I like this place because it's clean and it's a great bar to go to if you want to have a nice conversation with friends. I've been passing by this place for over 10 years now because of it being known as the \"glass coffin\" because of its clientele. However, I found this place to be very cozy and warm and reminded me of a classic English pub   (or at least the English pub I lived close to whilst living in London).\n\nI only got a glass of wine here and didn't really have much experience with the bartenders because someone else was buying ;). I assume that the're nice enough. However, until I have more experience with this place, I'll keep them at 3 stars. For now at least.", "author": "Rylan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "I'm from Texas and I have to say this was the best bar on Castro! The bartender Paul was super nice and actually introduced himself and engaged in conversation with me. Really cute bar and strong drinks. I walked down Castro and ended up coming back to drink at this bar because of the atmosphere and the staff. It's a must stop if in the area!! Two thumbs up!", "author": "Cara C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-04", "description": "Matt was invited to colleague's birthday get-together. He also admits that going to a bar on Castro St. is a once in a lifetime experience.\n\nMatt didn't want to, but co-worker gave him a \"Screaming Orgasm\"... cocktail. The $6.00 poison, which contained Kahlua, Amaretto, Bailey's and Vodka, was very creamy.\n\nThen colleague and Matt together had \"Sex on the beach.\" The $6.00 cocktail was a bit fruity, which lead us to the actual sexual event at the beach.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-05", "description": "Damn this place has atmosphere. A great spot to sit and sip while watching the history of the Castro before your eyes. At least, some of the old dudes at the bar seem to have history writ large on their faces.\n\nIf only the bartender could make a drink I could force down. Maybe I was spoiled after visiting Martuni's a few days before, but... I don't think I have ever put down an alcoholic beverage as undrinkable, as I did my gin and tonic. Although my friend's bloody mary was even worse. Truly insipid watery tomato juice with CANNED soggy asparagus in it. Disgusting. Reminded me of the kind of drink one would order on an airplane, when one is barely legal to drink, and any opportunity to drink seems like a big deal, however rotten the rotgut.\n\nI originally gave this place a three for the swill they served us, but I've decided to give them a 4, since the atmosphere is worth 5 or more. Went back, stuck with beer, and it was great. Fantastic people watching, with an interesting mix of folks, chatting and looking out the windows. Drag queens, faux drag queens, old and young folks... Brits and SF natives... especially nice at night...\n\nStick to beer, and you could conceivably give this place high marks. They can't mess up beer. Much.", "author": "Paula W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "Years ago, when a friend of mine was showing me around the Castro, he casually gestured toward Twin Peaks Tavern and dismissively dead-panned the comment, \"Behold, the Glass Coffin.\"  I glanced over, and observing the aging clientele through the enormous windows, I instantaneously got the joke and almost fell on the pavement laughing. My friend didn't even look over, nor did he stop walking.  It was clear that if he had anything to say about it, we would not be patronizing Twin Peaks that evening.  It stands to reason that I didn't end up with a very favourable first impression of the place as a result of this ironical introduction.    \n\nHowever, on a subsequent trip, I decided on my own to give the place a try, and now I make a point of visiting whenever I'm in San Francisco.  It has become my favourite place in the Castro to enjoy a well-mixed cocktail and relax.  As someone else here said, they make a fierce Manhattan, and both the staff and patrons are friendly and pleasant.\n\nIf you're looking for pretty twinks on Ecstasy, loud music, dancing and attitude, you might want to go somewhere else.  But if your agenda is more easy-going than trendy, by all means, give Twin Peaks a try.", "author": "Joseph G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-12", "description": "I've always liked this place just fine on the hand-full of times I've been here. The balcony is a great place to sit and chat. It's a little tricky to get up the stairs in heels, but I suppose they don't get many women in here, do they? lol\n\nI usually have my drink ordered for me so I can't speak to the service at the bar, but I was recently trying to organize a charity event that I hoped Twin Peaks would support and I can say the two owners are not pleasant to speak with. Every time I called they were very abrupt and dismissive yet evasive. It always had the tone of \"Ugh, come or don't--we just don't want to deal with you.\"\nOur last interaction was when I reminded them of my event and they said \"Yeah, we're not gonna do that. We have too many events going on. Ok, g'bye.\" in one pauseless sentence before hanging up. I spoke with many bar owners who were unable to support my event and they were very polite when saying so. These two hung up on me as I tried to thank them for their time.\n\nIt's a nice, relaxed place to swing by for a drink, but I wouldn't recommend it to anyone looking to host an event.", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "Great local bar in the Castro district!  Looks and feels like a fantastic neighborhood gym.  I have been twice and both times everyone was very nice, the staff and the drinks are amazingly good!", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-05", "description": "I've read about Twin Peaks, people talk about Twin Peaks, I walk by Twin Peaks about once a week... but last night was my first time actually going to Twin Peaks.\n\nI think it is important to note the social and historical significance of this place, but with that said... it was just ok. It had a nice atmosphere, it seemed like the other patrons were having a nice time, they were playing Gwen Stefani (YAY!) and it was interesting sitting right in front of those huge windows.\n\nI don't think Twin Peaks really stands out for anything else other than the social and historical significance... it is just basic in my opinion.", "author": "Russell Allen E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-23", "description": "Ah, the glass coffin. I remember being actually afraid of going in this place when I started coming out to Castro at the tender age of 17. I've since been in a few times, usually random occasions, and never really had a bad time. So...I didn't have a bad time...it was just meh...pretty solid irish coffee though!", "author": "Chris W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-20", "description": "This is a bar filled with older gay men and drag queens. It has a laid back atmosphere that is great for chatting. The bartenders are friendly, and the drinks are stiff.\n\nDefinitely go and sit in the balcony to see the people. Not a place to meet new people, but a great place to have a quieter chat than most other bars in the Castro.\n\nNote: this bar is cash only!", "author": "Caitlin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "My best friend and fellow Yelper, Jeff W., was in town. Agreeing to meet for a drink, he suggested the Twin Peaks. \"Meet at the Glass Coffin?\" I've never been in my 11 years in SF. \n\nTwin Peaks was the first gay bar in San Francisco to have large glass windows which was considered quite daring in the days when the clientele wasn't as mature as it is now. \n\nSo we met at Twin Peaks. It has a certain charm with the stained glass ceiling lamps, music at a volume that doesn't make you scream to be heard and comfortable seats. They pour generous drinks. Indeed, Jeff leaned over and whispered \"I like this place better than other bars in the Castro. It's more comfortable.\" I was aghast. Then I looked at Jeff - white hair - check! middle aged - check! somewhat out of shape - check! \nI thought of myself - salt and pepper hair - check! middle aged - check! somewhat out of shape - check! OMG - we'd become the clientele for the Glass Coffin! \n\nHmmm...maybe it's time for the Botox, personal trainer and a visit to the colorist. But until all that happens, I'll go to Twin Peaks again and hang out with my peeps.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-28", "description": "I've been going to the Twin Peaks since the time it was a neighborhood straight bar. It was owned by two drunk dykes who landed up in Palm Springs and eventually sold it the present owners.  I stopped in there daily and was friends with 4 of the bartenders who all died from Aids.  \n    My partner loves the Twin Peaks bar. I hate the place for many reasons. Number #1 is that I feel like I am in Gdynia Poland in a neighborhood bar near the shipyards. I expect Lech Walensa to walk in wearing a dirty bowling shirt.  The pattrons look like they are on loan from the Tenderloin Homeless Shelter.  For being gay men who know so much about opera, and Betty Davis's hometown and shoe size, they take no personal pride in themselves and are absolutely slobs.\n     Many of the patrons are not has beens, they are never was's.  Old Queens, left over drunks who now want senior gay housing and talk about this at the table. While tourists come in from all over the world, most of the regulars are just that. Irregular regulars.\nI happened to take a hot Chinese fellow in there, age 30, and we just could not get enough napkins to wipe up the drool from fellow patrons. Had their DNA shown any piranha background, my fellow would have been eaten alive. Such bad manners.\n    There are 2 restrooms. One downstairs with that putrid cookie smell coming in from next door, and the other discrete one upstairs for those who have to poop. Its just off the balcony which is like being voluntarily exiled to Siberia. Only go up there if you feel you want to relive choir practice, you are removed from the action downstairs.\n     The drinks are okay, no bottled beer now, no blender drinks. Nothing fancy, the usual alcoholic measures to get you loaded although the Chinese waitress is a kind, older woman and they don't push drinks.\n    Food:  There is nothing to eat, not even a deep fried roach. After the straight people sold the place, all the snacks were removed and you cannot get a bag of pretzels or nuts or anything for that matter, they don't want to be bothered with it. So picture this you get your drink placed on a wooden table top and that's it. Picture drinking in Gdynia and you will get the idea.  \n     There is quite a turn over in the place and often times, patrons will come in, look around, develop a look of horror, and flee. Thank God the Dutch door swings both ways. For people watching as the Muni underground regurgitates them frequently, it can't be beat. If the sun bothers you, feel free to lower the blinds. Then raise them when the sun goes over Twin Peaks.  The Twin Peaks is a gold mine for its owners. They give little in return. If you ever get a free drink there, please let me know. Thanks folks for reading my review. There are so many other fun places in the Castro, go to them if you are turned off by Formaldehyde Manor.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-22", "description": "Meh. Fun for its novelty but not really a fan of this place or its patrons. Still, it wouldn't be the Castro without the glass coffin!", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-03", "description": "This bar is practically a landmark.  Drinks are made well here and they even have a mall staircase to an upstairs balcony so you can watch all the action below.  Classy conversation with chairs and tables that people can actually sit at make this bar a bit different than the likes of the rest in the 'Stro.  You'll also hear people refer to this as \"The Glass Coffin\".  You'll understand why when you walk in.  go grab a drink and feel like you're setting foot into a piece of California history.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "After visiting the Castro area a few years ago, a friend mentioned \"Twin Peaks\" and \"Glass Coffin\" while walking briskly by as if he would never be caught dead in the place.  Since Twin Peaks is another Castro landmark, just like the Castro Theatre and Harvey's, I decided to brave the bar and have a drink - which is a logical thing to do after seeing a film at the Castro.  Upon arriving, the place was not crowded and the bartender who's name I think was Paul was friendly and spot on with the drink.  I did not have to shove and push my way to the bar which was great.    I watched as he made the Crown and ginger, I must say it indeed was a Crown with Ginger - wow - nice! \n\nBeing from out of town, I asked if I could take a few photos of the interior and he said it was OK as long as I did not photograph any patrons faces etc..  I dashed upstairs and snapped a few quick no flash photos of the wonderful wooden bar structure which is something no longer seen in newer bars.  As I sat at the bar consuming the drink, it was evident there were many regular patrons who stop in for a drink because both bartenders knew them by name and it was not just 1 or two patrons.   \n\nI also saw the bakery which is next door and that explains the fresh baked / cookie aroma wafting thru the place as no food is served..it is liquid nutrition all the way and oh btw - cash only. \n\nOverall, Twin Peaks is nice place to have a drink and still be able to have a conversation with friends and hear yourself think. There's no blaring dive music and hip-hop to be 20 somethings who need a dose of reality.  Also, the upstairs is small but nice and certainly out of the main traffic patterns. The expansive window views to the outside have surely contributed to the \"glass coffin\" nickname.  However, while I was there there the patrons were a mix of ages and several groups of both sexes.  Being known as a mainly gay bar, I was quite surprised when 5 young ladies entered and settled in at one of the front tables. In fact, several of the couples were male / female - go figure.   \n\nOverall, this is a nice convenient locale to stop in for a great reasonably priced drink (especially after catching a film at the Castro) and not have your ears blasted off with loud music or noisy tight mobs.  If that type of environment is what you are looking for, or gay bars make you uncomfortable for whatever reason, then there are ample locations elsewhere in the city to find it.  Twin Peaks, Thanks.", "author": "G M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "After trying to find somewhere fabulous to hang in the Castro District ... my girlfriend and I were sooo excited to find RAVE REVIEWS about Twin Peaks Tavern on Yelp.  Our \"girls day out\" shopping day turned into Twin Peaks Day!  Once you sit at the fabulous bar you're greeted by a fabulous set of bartenders. The drinks are STIFF, and the people watching is SUPER!  Go see Joe.  We love Joe!", "author": "Sommer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "God I love this relaxing bar...\nSometimes it's noisy and crowded, yes, but when it cools down it has such a British appeal...calming to me.\nDefinitely perfect on a Monday night with a couple of friends.", "author": "Dario B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-09", "description": "The secret is out. I've resisted raving about this place because for years it was my secret little spot, but now even my cookie scented bathroom has been exposed. Oh well it's awesome. The bartenders are very friendly and make strong drinks. I'm still not going to tell you the best place to sit. Now go away.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-23", "description": "Reasons you should venture into the \"old man\" bar.\n\n1. The bartenders know how to make real drinks. They know how much bitters should be in a Manhattan and don't have to look up the ingredients of a grasshopper\n\n2. You can have a conversation with people here. You can hear what your friends have said  instead of pretending or asking for repetition.\n\n3. The View. you can watch all the entertainment outside. very few people look in and it's fascinating. \n\n4. Upstairs.  I love this secret (Damn I shouldn't tell you) space where you can sit and watch people from above and enjoy your perfect cocktail and chat with friends. \n\nI can't think of anywhere else in the Castro where get all of these things.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-27", "description": "It is what it is.  I am being gracious by giving 3 stars.  Mixed drinks were overpriced in glasses slightly larger than a shot glass.  They were heavy on the handle and you'll enjoy it if you like your mixed drink to make you wince when you drink it.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-04", "description": "Do yourself a favor and go to the women's room upstairs.  I don't care if you're a man, you should do it.\n\nThe bathroom smells like the inside of snickerdoodle heaven.  \n\nThe vents from Hot Cookie pump glorious cookie smell into the women's bathroom.  \n\nWhen the going gets tough and you've had one too many or you just want to get away from the Beyonce on repeat, head to the best smelling bathroom in the Castro.", "author": "Jen I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "When go to San Francisco and want a drink, this is the first place that comes to my mind. The bartenders make the most amazing crystal-clear chocolate martini, and that is enough to keep me coming back; everything else is just gravy.\n\nThe term \"gay bar\" really doesn't do the Twin Peaks Tavern justice. Sure, it is one of the oldest gay bars (if not *the* oldest). It's small and cozy, where everyone has always been friendly and inviting, and my not being gay has never been an issue.\n\nOn top of everything else, I hear that the ladies' restroom smells like hot fresh cookies from the shop next door.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "Who wouldn't love this little icon?  Everyone is welcomed in this sweet place.   My favorite spot to meet a friend for a brandy!", "author": "Linda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "I first discovered the Twin Peaks Tavern in 2007 when I first visited the city by the bay. I fell in love with this bar and its patrons. They make a killer Irish Coffee. The mixes for their Hot Buttered Rum and Bloody Mary are all homemade by one of the owners.  Ow that I live in SF, this is my neighborhood bar.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-31", "description": "Before I give my review of this bar, I've heard all the nicknames given to this establishment:  Now on to the review, I have to say that I found this bar to have it's charm.  I came in yesterday, with a friend, and had their Hot Buttered Rum cocktail.  Very tasty!  I liked the laid back atmosphere and the sense of LGBT/San Francisco history that the bar represents.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "When my former dean of students was in town visiting over the summer, we were wondering where to have a drink on a bright and sunny afternoon... so we stumbled into Twin Peaks. \n\nIt was fantastic. We settled in, the bartenders knew exactly how to make a real drink.. nice and strong... the way my dad used to make (well, still does)... a great people watching spot... and just a generally great atmosphere. \n\nI just need to go back now and check out the upstairs!", "author": "Jordan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-18", "description": "Came here last night with my roommates and was served by the oldest bartender alive.*\n\nMe:  How are you tonight?\nBartender:  I'm tired.\n\nThat said, my drink was all gin with a splash (literally) of tonic.  God bless this establishment.  And hurrah for being one of the only Castro bars where it's acceptable to sit down and stare at the crowd without having to pretend to dance awkwardly to another Britney Spears remix.\n\n*That's insensitive.  He was an upstanding gentleman.  And I give props to anyone willing to work nights at a bar.  Especially someone who grew up with dinosaurs.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-08", "description": "My home-away-from-home. Nothing like a keoke coffee after Sunday brunch. Also a perk - being next to Hot Cookie means they have one of the best-smelling bathrooms in the city.", "author": "Kyle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-17", "description": "I have spent a lot of time explaining in my countless gay bar reviews that I am not gay. I have explained my gay obsession away on men who won't grab my boobs and then expect sex, my appreciation of cheap drinks, my trying to put myself in the shoes of my brother or numerous friends who are gay, my love of 80's music and rainbow flags. Okay, not that last one but definitely the rest. I am finally ready to admit I must be a wee bit gay. Done. No longer will I make excuses when I review a gay bar. I will just do it! \n\nWhat I am NOT willing to admit is that I am old. I am never going to be old. Not even a little bit. There are no drink specials for the old, I don't feel the need to understand my old friends a little better, old people do not refrain from grabbing boobs, 90s music is growing on my just as much as 80's and there are no fucking special flags for old people that get hung on flagpoles, in doorways etc saying this is an old persons establishment. \n\nPerhaps there should be. I may be a little bit gay but I am certainly not old. This bar is great for the aging gay man, since it is packed with just that, but it is definitely not for me.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-12", "description": "The smell of cookies covers up the old man smell. RECOMMENDED.", "author": "Lana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-15", "description": "I only had one drink here... as i recall.... and it was a damn fine one too. \n\nThe Campari and soda was top notch. My gf had a Belvedere martini that was strong enough to fuel a 737.\n\nThe company was good and the bar was relaxed. It is also right next to the underground MUNI so you can easily get back to the CBD. \n\nI'll be visiting again.", "author": "Cameron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "Old gay men, pop music, and booze. What more could you ask for? This is such an old school bar - I loved that. The decor is so kitschy and you're basically in a Castro-street fishbowl, and I had a tonne of fun. We ordered coffee with whiskey in and got a freepour double shot that had me practically falling out of my seat as I chair-danced to the Katy Perry, Lady Gaga, and Pink assailing us from the sound system.", "author": "Malloreigh M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-27", "description": "This used to be my favorite bar in the Castro.\n\nI brought ten of my visiting friends into Twin Peaks on the Friday of Pride weekend.  After paying a dollar more than usual for a well drink, we all headed upstairs to mingle.  In short order, an employee came upstairs, singled out all the people who weren't drinking (about half of us) and told them they had to leave the bar.  Anyone holding a drink could stay.  Anyone not...get the fuck out.\n\nI even told him that two of our friends had just done shots....but since they didn't immediately buy another drink, they had to go.  Sample quote from employee douche was \"This is a place to drink, not to socialize.\"\n\nMajor problem #1.) When I think about the stigma that is often attached to this bar (ie: the \"Glass Coffin\") and how much I've tried to promote it as a welcoming and easy going alternative to the rest of the Castro scene...I kind of get sick in my stomach.\n\nMajor problem #2) They're basically promoting binge drinking.  Telling people who just had shots that they NEED to drink more in order to stay in your establishment seems shady at best, and illegal at worst.\n\nSorry, Twin Peaks, you screwed the pooch on this one.", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "This place is awesome and historic. Tourists and locals. All worlds collide. Right on the main intersection of Castro. Sit upstairs. Put money in the jukebox. Order something classy. Say hello to Paul, the most awesome bartender there :)  And go to Hot Cookie after.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "Respect your elders.  And you really should, young whippersnappers or else Karma will gobble you up, vomit you out, and abandon you to your own private thirsty hell.\n\nAlso known as the Glass Coffin (due to the average age of its customers...shall we say pensioned) - this bar is a total gem.  Fantastic coffee drinks, wonderful staff, and comfy interiors are all awaiting you.\n\nRowdy, sardine-packed nightclubs have their place, but if it's quiet-time you seek, look no further.  And if you are of average looks and under 50 - chances are you'll be the hottest thing in there.  Certainly a nice ego boost, when you're feeling particularly ugly.\n\nAnd hey, if grandpa start scamming on your pretty ass, waving lollipops in your direction, just grab your drink and date and gallop upstairs to the loft-level seating area post haste.  Chances are grandpa won't brave the stairs.  Once upstairs: sit at the table by the lone window.  Open it and blow kisses at the cuties down below, or do your best Evita balcony wave while breathing in the yumminess of chocolate chips and dough baking at Hot Cookie just next door.  It's all good, and it's all for you, baby.\n\nRemember: don't be hatin' ~ some of those daddies will beat you down with their canes if you toy with them too much.  But then again:  What's too much?", "author": "Mc Matty b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-27", "description": "The 20-something crew thought it looked fun after an evening in the Castro, but holy grey haired geriatric ward!\n\nNO NO NO!!!!!!!!!!!!", "author": "Chantal H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-02", "description": "This is by far my favorite bar in the Castro for many, many reasons.  I'm a fan of lists as they make information somewhat easier to digest in tasty little bulleted morsels:\n\n1. There is some magical voodoo chicken blood in the varnish of the beautiful wood that frames the large mirror behind the bar - in that it keeps the loud, obnoxious, standing and posing fags out out OUT.  For this I am grateful to the point of sending a check to some random address in New Orleans thanking some unnamed priestess.\n\n2. The bartenders are all extremely friendly and know me and my boyfriend by name.  I love me some Paul and Spyro!  Yet their athletic skills far outweigh their amiable nature.  I once witnessed Spyro who, in one impressive move, jumped over the bar, grabbed a drunk patron by the collar, and removed him from the bar in less than 45 seconds time.\n\n3. They have coffee.\n\n4. The place is full of gentlemen - men who know how to have a conversation that doesn't involve pretense or what I do for a living.  Sure there's a little leering, but it sure beats the playground antics of some of the other bars.\n\n5. There is a wonderful (and eventful) little roost up above with nice chairs and tables and lamps.  It was from here where I saw two men completely naked (if you don't count the Teva's and cock rings) standing on the corner out front.  Any vantage point offering observations like that will have to deal with my gin breath and garlic farts.\n\n6. Even when it is crowded and bustling, I can always count on being able to have a conversation that isn't punctuated by \"what\" \"huh\" \"pardon me\" \"let's go outside\".  I do not require the bass beats of the newest Kylie Minogue remix to compensate for the fact that I couldn't carry on a dialogue if it were stapled to my nut sack.\n\n7. Finally, there is this fantastic gentlemen with whom I am still unacquainted with a bejeweled belly button ring and booty shorts.  And he looks fan-FUCKING-tastic.  I wanna go where he goes!\n\nSo if I'm in the Castro, I will likely begin my bar crawl here so that I can at least have one positive bar experience in the evening.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "Great people-watching bar. The women's restroom smells like fresh-baked chocolate chip cookies.", "author": "Ang F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-25", "description": "It ain't easy, honey, being the oldest girl on the corner for as long as this place has, and yes, it was built as a bank back in the day and some of the oldest patrons say they remember it then. Today it is still and landmark, the first gay bar to have glass window walls. Nice bartenders, nice crowd. If you're an ageist keep it to yourself. Frankly, it is refreshing to go somewhere that welcomes people of all kinds. Even in the Castro.", "author": "William M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "Any place that makes a decent Irish Coffee (mmm...) is home for me... or at least home before I go home.  It was a long day at work and I didn't want to retire yet so I stumbled in on a rainy San Francisco night.  And as soon I stepped in, I see the familiar glass tumblers with sugar cubes and Bob Marley playing in the background, so of course, I know I'm in the right place, right?\n\nThe decor, very hotel California-esque... especially with this weird lady with the dark hair and crazy eye brows petting her little dog hiding in her purse... then Whitney Houston and the Jackson Five come on, so I'm thinking whatever, it's raining and I'm drinking my Irish Coffee... mmm... only thing I didn't like was that they did not offer decaf but my bartender said, \"Don't worry, the whiskey will take care of that!\"  Ha!  Loved him.\n\nNice bar to stumble into.", "author": "Tira F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "I really enjoy this bar as it isn't as loud as other bars especially during football games. You can hang out and talk and still hear each other without having to scream at the top of your lungs, also your ears will thank you.", "author": "Dat P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-09", "description": "I really want to like Twin Peaks. I like the civilized demeanor. The ability to hold a conversation without deafening music. And the balcony is a superb place to perch.\n\nBut . . . the service is often tired, sometimes almost rude, and I always feel that my business is taken for granted. Which of course it is, since this bar sits prominently at the corner of Castro and Market and has a license to make money.\n\nIf you are not a grayhair or a chaser, go during evening primetime when the crowd is more mixed.", "author": "Rincon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-14", "description": "okay I will admit I went through a phase of going here like once a week.  This one friend and i found ourselves here after a rambling drive through the city and started returning regularly.  The bar is cute and warm and the bar tenders talk to you and tell you stories about the neighborhood and the regulars.  Its a good lace to go and talk on a date b/c of the couches.  The Irish coffee is a bit strong, but who likes a weak drink?  i didn't find the staff here to be at all unfriendly, even to a straight girl. If you are looking for something more exciting, walk down the block to badlands.\n----\nWent back after not showing my face in the Twin Peaks for 6 months, and they remembered me! (it may be due to the fact that not many straight young blondish girls frequent the bar... but whatever!) I was stoked.  They even gave me a free vodka tonic. I love them.", "author": "Natalie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-27", "description": "Excellent service, drinks, and atmosphere. It was very refreshing going somewhere and ordering classic cocktails and not being asked how to make it. Very good place to grab a few drinks with friends before starting a nice night out. The drinks were very reasonably priced.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "Stopped by this place on a Sunday afternoon to grab an Irish Coffee. Not shabby for the price.", "author": "Derrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "Fag Hag Rebekah went in here one night with her Sham Fiancee Bibby once.\n\nSomehow I ended up being fed lines to Barbra & Liza songs to belt out. Then we started dancing to Madonna & these other random young people came in & Vogued with us as well. \n\nStrange night & all I had was a Soda.", "author": "Rebekah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-10", "description": "Twin Peaks is a good place for a strong drink. I would have given it three stars except that when I went there on a Sunday afternoon they had a shot boy making the rounds. Thats an extra star right there.\n\nBut what I really like about Twin Peaks is that it has the best people watching spot in The Castro. Walk up into the little balcony/ loft/ second floor and sit at the two chairs by the window. It overlooks a bus stop and Market/Castro intersection. If I was just rating the people watching it would be five stars.", "author": "John F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "Nice service, great atmosphere, STIFF DRINKS. love it here! Will be back asap.", "author": "Kayla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "My boyfriend and I were looking for a quick place to grab a drink after a long day of bicycling the city. We ended up ducking in this cozy bar around six on a thursday afternoon. The staff was friendly as were the clientele and the drinks were cheap and strong. My whiskey ginger could have made me breathe fire.", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-16", "description": "I finally visited Twin Peaks! Again! And the pie is just as good! Oh crap, wrong twin peaks. Scratch that. The drinks and service are just as good!\n\nThe bartender shared with me that his first girlfriend's name was Kimberly, though he is gay now (but it wasn't her!). And I had to share with him that my first boyfriend's brother got ditched by his high school sweetheart wife who realized she was gay. Her name was Kimberly, too. Yeah, some bonding moment. \n\nThe drinks are no nonsense cocktail party approved. The glasses are smaller, so that you end up with same amount of liquor as any other drink, but with less filler, which makes for a pretty delicious, aka strong, and less filling, drink.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "Nothing like relaxing in this bar and having some well mixed strong drinks.  Instead of being in a dark room, this OG gay bar offers windows with the view of all the \"ass\" hitting the beginning of Castro.  Definitely a good place to start your evening before you go share sweat at all the other places.  The bloody mary was tasty, the margarita was on point, Cosmo was strong and fabulous, the Irish Coffee was the whore at the bar, and my Bacardi and diets where perfectly strong.  The perfect way to start off a lushy evening.", "author": "Eryka V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "Very nice place to meet for a drink - period.", "author": "Ruthie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "Twin Peaks Tavern (aka \"Glass Coffin) and I have a special relationship with one another in that it is the place that i will duck my head in mild embarassment when entering.\n\nI am someone who appreciates the compliment that is flirtation from anyone, whether they be 18 or 40.  But being a 20-something, i do prefer them younger and closer to my age.  So when 40-somethings keep hitting on me, it makes me a little uncomfortable.  Sugar Daddy anyone?\n\nIt was a cool summer night when my friend and his recently married bff was having a post-marriage bachelor party (meh).  No, the party wasnt AT the Glass Coffin but it started there.  We were innocently having beers while this older gentleman kept his eye smack on my forehead (at least, i was assuming it was my forehead).  After a while, my friends bff asked if there was anything wrong, to which i reluctantly explained that there was an older guy staring at me and asked that he not do anything.  He promised he wouldnt.  But as we all have no doubt found out, drunk promises dont really count.\n\nnot but 10 seconds later, he gets up, walks over to the gentleman, and scolds him declaring, \"I hear a rumor that you are staring at that young man over there!  Well, i am here to tell you that he is MY man and I don't want you to be looking at him because i will come over here and i will get all up in your face!\"\n\nDuring this time, i hid behind my other friend's back to hide both my face and tears of embarassment and laughter.  After the bff was done scolding the other guy for wondering his eyes, i quickly chugged what was left of my beer (i payed for that beer, shit... i wasnt going to leave it) and we hastily walked out.\n\nOh, Glass Coffin, how i am a fan of the experiences you provide.", "author": "Reuben D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "I love this bar.  I find myself here every time I'm headed to the Castro Theater for a double feature.  Generally get the irish coffee, which is delicious.  Got a dirty vodka martini tonite- it was decent.  I give it 4 stars more for the atmosphere than anything else.  The crowd is mostly grey and gay, and always nice to the girls I come with.  Upstairs is best- the bathroom smells like delicious cookies, due to it being next door to hot cookie.  The upstairs window seat is why i come- drinking with friends around a table, looking down onto castro street.  People watching without being seen can be very interesting.", "author": "Jett S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-28", "description": "Every seat was taken when my friends arrived for a Sunday afternoon drink.  Thus, we stood in the middle of the bar, enjoying our beverages and each other's company.\n\nWhat I didn't enjoy, however, was the sun streaming into the bar directly into my eyes and the couple sitting on the bench, casually talking while one of them had his hand on the other's crotch the entire time.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "It is the very first gay bar in the U.S. that has the big open windows that people could look right in so there is a lot of history behind it. \n\nMy boyfriend and I love to sit by the window and watch people walk by while sipping on our Irish coffee. I also love to hide in the mezzanine and sit right by the small window.  That is a perfect little spot to watch people when you go to the Castro Street Fair, Pink Party or Halloween night.You could watch people without they staring right back at you.  \n\nYes, the customer are mostly older gentlemen but who cares?  Since they serve stiff drinks so it is now attracting a younger crowd in their 30s.  \n\nI would recommend any tourists from out of town to go in there for a drink.", "author": "SFGAM d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-27", "description": "Twin Peaks is more a state of mind than a bar. Ever since the BAR went completely Hunters Point on us, I have prefered my infrequent Castro outings to include the GC (see above). Carpet, an expansive view of Castro Street, 2 bathroom (that lock, wink wink) and healthy pours keep me happy for at least an hour.\n\nBest time to visit the Peak is on a Rainy Sunday afternoon. If a lonley fellow happens to be sitting at a huge table, dont be afraid to ask him if your gang can sit with him. He might be your next sugar daddy...", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "I had a good time here - I like the seating, and the vibe was very casual and relaxed.  The Victorian feel is pretty cool, and I liked the seating.\n\nThey made the strongest White Russian (drink, not person) I have ever had, and they had a pretty good beer selection.\n\nI didn't pay much attention to the music here, but it was a tad too loud.  And I loved watching people here. :)", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "If Will and Grace was real (and took place in SF), there would totally be an episode where Will meets a guy at Twin Peaks and then Jack gives him crap for being old. Grace would of course, fall for the same guy and chaos would ensue.\n\nThere is no need to say \"splash\" when ordering a belvedere on the rocks with a splash of cran. You could really just say cranberry juice with a splash of belve and get the same thing. Wowza.", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-18", "description": "I think I love this bar.  \n\nWas rushed off to catch a movie at Castro Theater next door, but the 15 minutes (and two drinks)I spent inside were wonderful.  After reading the other reviews I wonder what that says about me and my queerness.  Perhaps I've got an old soul?  \n\nWill return with a full review in the future, though I've already got a feeling that this will be my gay Castro Bar.\n  \nLucky 13 of course being my Castro Bar", "author": "Mat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-27", "description": "WHAT A GREAT TIME!!!!!! Twin peaks owners have been so kind to sponsor not only one but two softball teams which play in the SFGSL(.org). We are the San Francisco Treat, calling Twin Peaks Tavern home for over 5 years. \nTwin Peaks allows the Treats to invade from time to time, to raise money for tournament fees, field fees, equipment needs & much more. \n\nThe way we do that, is a BEER BUST where you pay one price normally $10.00 and drink all the beer you can between the times of the event. The other is TREAT SHOTS, these are sold by members of both SF TREAT teams at the event, and lastly RAFFLE PRIZES are given away every 15-30minutes through out the event time. We like to have a good time, so if like to have a good time then we'll see you at the next fundraiser. \n\nOur preseason kickoff event is coming up on 3/8/2009 from 3p-5p\nHope to see you all there........\nLook for the TREAT calendar of games up at the bar........", "author": "john a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-16", "description": "Best Irish Coffee's in SF!\n\nIs it normal for a straight couple to fight in a gay bar?  Probably not, and probably a reason we ain't togetha' no mo'.\n\nBack to Twin Peaks, I like the ambiance, I like the view of the Castro, and I like the fact that I don't get hassled.", "author": "Brandie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "What is better than perfectly mixed cocktails, people watching prime location and a bit of history.  The Twin Peaks a.k.a \"the glass coffin\" is the first gay friendly bar in SanFran with windows, and well these windows are floor to ceiling.  The bar is everything you picture when you think real bar, dark wood, comfy seating and just enough music that you can hear yourself think.  If I lived in San Fran I would probably be a regular.", "author": "Megan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "This place had a good atmosphere, cool bartenders, and tasty drinks.  Try a vodka collins.  They make fantastic ones!  Prices are reasonable & clientele was fun.", "author": "Sally L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-13", "description": "A gay friendly and a people friendly spot. I didn't see anything that interesting here, but a cozy atmosphere and a bunch of guys. I girlfriend said that the girls bathroom was pretty clean ;)", "author": "Javi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-20", "description": "I used to stay away from this bar as my friends called it \"the glass coffin\" but now, I love to hang there...reason being: No Attitude, the patrons are just as nice as can be and all are welcome....Oh, and the drinks are strong...One Long Island Tea from there and I'm ready to pull down my pants! ;)....but seriously, the patrons are usually a bit older, and very welcoming...It's a good place.", "author": "Blake J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "So what it if reminds me of hanging out with my parents in bars in small town western Mass?   Some of us need a mellow bar scene in the Castro, especially one that smells like hot cookies!  I like it!", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-06", "description": "What a quite little gem this place is. Strong stoli tonic's and a perfect place to go after your movie get's out  and sit up stairs and check out the scene.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-12", "description": "Twin Peaks has been here since the beginning of time, and so have most of its patrons.  Definitely the place to go if you've joined AARP or you're in the market for a sugar daddy . . . or granddaddy.  The crowd tends to be friendlier than in most gay bars, because there's no emphasis on youthful looks, buff bodies, or one night stands.  Sadly, too many here have had one too many, as they mourn their empty lives to the sad sounds of the golden oldies on the juke box.  In a city with so many gay resources, how is it there's no better place for the older ones to socialize and/or do something other than drink away their days?", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-02", "description": "If i ever get a date, I'm taking that unfortunate bitch here!! DAMN, this place is comfortable. A magnificent bar perfect for quiet conversation on a rainy night with Chet Baker in the background tooting his sad sad song. 5 stars.", "author": "John T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "We met our 75 year old neighbor here for a drink the other day and had a great time.  He's been going for over 30 years.  Says it was opened in the 60s by lesbians who sold it to their long-time bartenders within the last 5 years to be sure that it continued on the way it's always been.  Apparently it was the first gay bar in the city (some say in the country) to have windows.  Great history.   The customers are older, but super friendly and full of stories.", "author": "P J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-28", "description": "I'm really surprised at how many of the reviews for this place are homo/transphobic. Also, it seems some people need to get their hate of older people in check.\nI love the martinis here- strong and cheap. I've had nothing but pleasant conversation here as a super butch dyke- plus the bathroom smells like cookies.", "author": "Mr. Marie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-21", "description": "I really like the atmosphere here. There's nothing like sitting next to the window with a strong gin and tonic, chatting with your best friend, and people watching as everyone walks by. The crowd is generally older but sometimes there's a sprinkling of younger people here too. And just like Jen I.'s review... yes, the women's bathroom really is snickerdoodle-infused. It's amazing.", "author": "Bekah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-03-29", "description": "Our pet name for this bar is the glass coffin, and we call it that with some affection. After all, there is no where else in the city where you can watch ancient queens age so (dis)gracefully. Going entirely ungently into their good night, the patrons here play awful tunes full of nostalgia on the juke box, and have been known to weep quietly into their triple strength Irish coffees. It's hardly surprising, because the Irish coffees are strong enough to make anyone's eyes water.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "major props to this bar - the first gay bar with complete glass facade at a time when being in a gay bar was grounds for harassment by the cops.  No hiding here.  Forrest is a great bar tender so Wednesday through saturday are great nights to be there.  It's kind of funny to watch the older queens get sloppy too", "author": "Nick G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "I went here on my birthday a few years back, I wanted to see what this place was all about. I used to join in the fun by calling this place \"The Glass Coffin\" and \"Geriatric Park\" but I came to the realization that nothing is forever....not even this generation. As I walked in I was amazed and at ease by how quiet and demure the patrons inside were. It gets exciting in here at times, but this came off to me as a place of quiet contentment and I am all about that feeling. I have a desire to go back to this place, but not on my own cause I too have can be shy and reserved when alone...and in public. This place is deserving of more exploration....it's a part of history.", "author": "James J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-13", "description": "One of the sanest and least sexified bars in the Castro.  Mellow, geeky, old school, small but some cozy lounging places along the view windows facing Market and Castro and in a small upstairs.  Drinks are strong and inexpensive.  People know each other.  Crowd is 3-3-3 meaning a third gay men, a third lipstick lesbians, and a third straight.  Often the same person.  Keeps em guessing.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-21", "description": "I don't normally go to bars solely based on the bathroom, but I have to admit is usually part of the overall experience. But at Twin Peaks, it's without a doubt a bathroom-inspired journey. You go there, you go upstairs after getting your drink and head directly to the bathroom. Once you're in there, take a big whiff. There is a surprise that I'm not going to spoil for you by writing it here. And no it's not pee or poo, I promise. You're never going to believe the smell and it's one that I promis you, you've never ever before whiffed in a bathroom. Everything else about the bar is great too, but I'll say it again: Go to the Twin Peaks bathroom (upstairs only). It's not really a place for the ladies, but I can't say that I've ever felt unwelcome there.", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-06", "description": "As a \"twinkie\" many centuries ago, my friends and I used to stop in here occasionally and let some of the \"older\" gentlemen buy us drinks and try to get us drunk.  This was second only to the P.S. on Polk Street for finding a sugar daddy.  I never thought I'd make it to daddy age, but here I am.  And this bar still looks and feels pretty much the same.  I'd swear many of the same old queens are still coming here!  It's a great place to meet and have a drink.  No pretensions.", "author": "LA T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-05", "description": "We went in with a younger mixed crowd because we wanted a break from the loud crowded bars.\n\nThe drinks were allllright.   \n\nBUT, the crowd, the regulars and the bartender were not friendly to the straight folks!!\n\nIt is the first time I ran into that in the Castro.  sad.", "author": "cat h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-28", "description": "Being 25 I'm not quite in the regular clientele for Twin Peaks, but got dragged here (somewhat hesitatingly) one afternoon by my then-boyfriend and some other friends.  It's actually pretty nice inside -- dark, quiet decor, reasonable space, and an upstairs.  There were pictures on the wall (real, static pictures, not the television monitors of everywhere else), and it was quiet enough to talk (again unique for the area).  Plus, maybe since we were way younger than most of the other people I saw there, all our drinks were made very strong.  We had a good time.  From force of habit (mine, and definitely my friends'), I probably won't end up back here again, but it's nice to know there's someplace in the area if you're really not in the mood for loud noise and grinding bodies.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-22", "description": "Excellent for people watching because of the location--on the corner of Market and Castro--that in itself is worth a visit. BTW when i've been here, i got friendly service--check it out and decide for yourself...", "author": "Sue U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-03-29", "description": "Stellah is dead-on about this place.  It's a great location, cool name, neat sign, and nice little bar.  However, the people and staff here are very unfriendly.  I don't mind the old tunes on the jukebox, it's kind of nice, but jeez, why the nasty sour attitude?", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-27", "description": "Twin Peaks is my neighborhood bar, and I love the place.  Loud, crazy & cruisey bars are all well and good when I'm feeling up for it, but after a 14 hour work day I just want to melt into one of the comfy chairs and listen to some old jazz or Elton John, and this is the place to do it.  The patrons and bar staff have always been great to me, despite my not fitting the, uh, typical demographic.  Certainly not the bar for everyone, but I'll be back.", "author": "Jude F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-10", "description": "so the other nite i brought a change of clothes--coming from a baby  shower i was wearing the wrong outfit for the castro--and forgot to bring a bra. the shower outfit didn't require one, but the new one did. anyway, typically this is not so much a problem for me since i have a pretty small rack, but i wasn't super comfy with the shirt i had on and you really don't want to be nipplin out around the girls in the castro if you happen to be a straight girl not lookin to experiment--and yeah i speak from experience--so i asked the husband to bring me a bra. we met up with our best friends mark and jim here, they love the glass coffin, and i went upstairs to discreetly add my undergarmet in the women's room. \n\nthe thing you should know about the women's room here is that most likely it's not women in there, but boys, or older gentlemen taking a moment together. so it's not really my favorite bathroom. it was locked when i got up there and there were a couple women in line already. so what the hell, we're all girls right, and they were cool. so i just did a little improvising and put my bra on right there, keeping my shirt on of course, we don't want to get too crazy now, and we all chatted about the necessity of wearing one. one of them seemed very embarrassed about the whole ordeal and the other was pretty cool about it. and i mean, how many chances do you have to put your bra on out in public right? this is what i love about SF anyway. we're all one big happy family. \n\nanyway, the point is, you'll get some good people watching in this place. and you never know what will happen. oh and the drinks are fine, bartenders nice, all that. but really, this is a castro insitution, so don't miss out.", "author": "rachel p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-14", "description": "WE LOVE THIS PLACE!!!! And we love us some seasoned bartenders as well. And hands down.....BEST Irish Coffee in the City. Soooooo yummy.  We never waited long for somewhere to comfortably sit, with front row seats to all the dramz going on outside. Worth a visit before or after your evening out!", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "I've heard the term the Glass Coffin before, and went there actually for the first time last night. Upon walking in, I thought it smelled familiar. Now bear with me! I immediately thought, wow, it's Gramma's house! No, that wasn't an old joke, I'm not that shallow. My Grandmother's house just smelled like coffee and Whiskey! The bar was wonderful. I would definitely prefer to be dragged there weekly than the BOC or Badlands. As a matter of fact, I think I'll do that :)", "author": "Edwin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-19", "description": "The sort of evil slang name for this place is \"The Glass Coffin,\" because the clientelle is older and the glass walls.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "I love that we went in here on saturday evening - a mixed bag of ladies n gents - and were immediately asked where we were from! As if we had had NO idea what we were walking in to!! Tehehehe! Had a great Irish Coffee (who knew it had whiskey in it??! Oh right, prolly everyone BUT me) and then hustled over to All Seasons, the best squishy around!!", "author": "Inome C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-25", "description": "call me crazy (many do) but i love this place. it is full of old men, but i LOVE this place. they make stiff drinks, the bartenders smile (probably think i'm a lost tourist) and the regulars are really fun to watch. \nand to the handsome gentleman in daisy dukes..you go girrrrl!", "author": "City G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-23", "description": "yes yes, the glass coffin. my absolute favorite bar in the city. grab a manhattan, take a seat upstairs and people watch while listening to peggy lee and etta james and maybe some bar-buh-ruh.\nnow if only i could figure out a way to get those tiffany lamps off the tables...", "author": "jen w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-04", "description": "I recently moved from Philadelphia and happened to wander in here one afternoon without my partner. I'm 30 and am tired of the badlands crowd.  I had a great time!  2 older queens bitching at eachother...they were hilarious...bartenders are fabulous! but my drink was a bit poisonous...otherwise, its a 5 star!", "author": "Barry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "I adore Twin Peaks and it really is my favorite watering holes. The bartenders really try to get to know you and take care of you. You can actually have a conversation with people and it is no where near as cliquey as 440. Is it a great place to pick up a shag? Unless your into older guys, no. But is it a great place to chill and have a good time with generous pours and nice folks? Without a doubt. And if you want some young-dumb-full-of-cum cock later, Toad Hall is right around the corner.", "author": "William N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-31", "description": "We decided to grab a quick drink while we waited for a couple friends to join us for dinner and a flick at the Castro Theater.  While we waited I got introduced to Sambuca, a liquorice tasting liqueur, somewhere from Europe I imagine...sweet, very warming, strong scent, and served with coffee beans....I'll surely be ordering this more often, especially when its freezing cold outside!  The Tavern's got some charm and an interesting clientele.  If you are looking for older gay men on a Monday night, this might be a good bet.  There were a couple of ladies there, but surely there are better spots to pickup women.   There is a little upstairs area and the overall decor is what I would call classic.  You surely won't get bored; if you are, strike up a conversation and you might hear tales about \"Well when I was your age...\"  The drinks are strong and cheap, but cash only!  Bartender was really friendly too...", "author": "Summit S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-30", "description": "good vodka gimlet, excellent people-watching opportunities, old lady who looks like phyllis diller serving drinks.  not too exciting of a place, but definitely decent for a couple cocktails and some conversation.  also right next to hot cookie, which is a very nice bonus.", "author": "calamity d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-26", "description": "My husband and I go to the Twin Peaks on a regular basis.  It's a great place to people watch, enjoy a strong drink or two and meet interesting people from around the world.  The service is great, especially once you get to know the bartenders/cocktail waitress, and when they get to know you, or at least remember your drink of choice.  And yes, there are a lot of older people there, but hey, you can sometimes learn a lot from them too.  Enjoy!", "author": "Tanya K."}
