{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "The service is great \nThe food is hearty and heart felt \nSo in love with this space \nThank you Ill be back", "author": "Om H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "CASH ONLY.\n\nIf it weren't cash only this place would get a solid 4 from me but man this place is a well-frequented establishment with food that's not necessarily super cheap so I would expect they could accept credit but nah. Usually this wouldn't mean a star less but they also don't have an ATM machine on the premises. Thankfully there's one across the street in a corner store otherwise I would NOTTT have been able to afford my breakfast this morning.\n\nAnyway, cute local café. This place is walking distance from Glen Park BART. I got the Big Scramble which was a scramble with ground chuck; comes with potatoes and toast and was ~$11. They seem to be pretty busy on the weekends but the table turnaround time is really fast, though they do seem to be rushing you out at times.\n\nI had an ok time here. Food was pretty average. Service was attentive (they refilled my coffee maybe every like... 3 minutes lol) but I kinda wish they weren't cash only. I might come back, just not that often. Tyger's is kinda forgettable.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Service was 5 stars.  So friendly and warm.  \nFood was realistically closer to 3 stars.  Average/good but not great - but the experience as a whole was really good.", "author": "Madhuri K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "Not 4 stars because it is pretty average diner food. The omelette was a bit bland and oily, but I'm not opposed to revisiting and trying something else. The hash browns and toast were on point, but nothing else was extraordinary. \n\nVery good service and on point with the coffee. I must have had 5 cups. \n\nWill try again. Until next time!", "author": "Heihachiro K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "First time here w bf for brunch. We ordered French toast vegetable scramble and California scramble. Decent food, but their potatoes and bread was mostly burned..... I'll request not to burn the potatoes next time! I'll def. come back again. \nBtw CASH ONLY!", "author": "Lulu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Great hole-in-the-wall place for breakfast! This cute little neighborhood has a lively vibe, and this little greasy spoon is a winner and a local's favorite. I had the breakfast burrito and it was so large that I took half home for dinner. Try Tyger's next time you're in the area.", "author": "Em K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-11", "description": "I got a tiny, burger with bacon and avocado for 14.2 and it didn't even had fries on the side! My friend ordered eggs with sausage and it was super runny. When we asked a guy to exchange them the guy was super rude.He rolled his eyes and was explaining that that's how they always cook it while it was in front for us swimming already in water. \nExperience was very disapointing and unpleasant.", "author": "Oksana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "It's an easy 5 stars for what it is... a casual neighborhood diner catering to one of the last remaining SF neighborhoods where neighbors actually know their neighbors. I can see how someone from across town wouldn't appreciate it, but for locals it's a gem. Typical cozy diner foods. Some standouts are the: pancakes (huge and fluffy); Cheese-Burgers (greasy goodness); chicken fried steak and eggs (hangover cure); and the classic eggs, bacon, potatoes, toast. Of and really good coffee (A hint of chicory? I need to ask next time). \n\nVery kind, hardworking staff. Cash only... but that's really no big deal, there are 5 ATMs within a 2 block radius. Why insist on helping Visa, MasterCard and credit card companies make money off hard-working mom-and-pop businesses?", "author": "Jay E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "Used to dine here infrequently, but the last meal I had was literally smothered in cooking oil- I'm talking a lake of maybe 1/4-1/2 cup of cooking oil filling the plate under my potatoes. I nearly vomited,  swore never to return (and stuck to that vow for 15 years).", "author": "T J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "I really used to like Tygers. Okay casual/basic breakfast and diner food and yay for offering turkey bacon. Not super expensive. Unfortunately my husband and I got harassed by another customer today, and the staff did little to stop it.\n\nThe man was an older man with white hair, who 'claimed' his spot at the counter by slamming down his newspaper, getting in my face, and aggressively telling us to leave our seats despite the fact that we were seated already (by the restaurant staff). Oh, and there was a single seat open elsewhere. I understand this man may be an eccentric fixture who frequents often (yada yada) and likes his same spot, but no one has the right to harass someone else and say extraordinary rude things to them. \n\nAfter being continually harassed by this man, we left. Not coming back. Maybe the restaurant should decided if they want to deal with this guy or keep losing customers.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Staple of Glen park. Great diner food. Order takeout several mornings a week. The sourdough toast and potatoes are great.", "author": "Merv A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-25", "description": "Ok but not as good as other places friendly staff and reasonable prices. Next time just straight bacon m eggs!", "author": "Paul D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-06", "description": "I'm not into bad mouthing anyone but the food here is bland as all get out. I came here because I saw two people eating what looked to be a tasty looking burger from the window. I decided to roll the dice. I came here and the food was just awful. This place is also old and decrepit. I think they are probably not bad people. They just don't seem to know how to run a restaurant. I don't think I'll be trying anything here in the future.", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "Typical dinner. Exactly what you would expect in food. Service is friendly and prompt. Pricing makes sense. I would hit this again.", "author": "Nika C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-30", "description": "While the staff were incredibly kind, the food was not very good. I ordered an egg scramble with country potatoes and neither the eggs nor the potatoes were very flavorful. Food was very bland. My husband ordered the banger sausage with 2 eggs and potatoes, and had the same sentiment about the food. I wouldn't go back.", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Good place for a lazy sunday breakfast. It is located in the cute and cozy neighborhood of Glen Park. Tyger's is strategically placed close to the Bart station. The owner is a very energetic, friendly and hardworking lady. This place is very kid friendly and they even let kids use the old-school register to pay for the bill. The food is good. The country fries are well made and the pancakes and fluffy.", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-27", "description": "This place serves heavy comfort food. I don't usually come here unless I'm starving because my food coma is intense. Thank god it's now acceptable to wear yoga pants to weekend brunch cause my jeans would not have the level of stretch needed.\n\nIt's a local diner with just locals stopping by. Food is average, service is quick, and the space is decently clean.", "author": "Josephine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-31", "description": "Good lord. Where do I start? Walking in it was a quite as a library, a little music even if bad is better then feeling like you should whisper. Huevos ranchers might have been the worst I have ever had. Dirty Rice? Not sure what else was in there but the slice of Swiss cheese was just wrong. My daughter who loves pancakes didn't even finish them... Both plates unfinished yet no question regarding if we liked the meal.\n\n#feelingill", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Tyger's has seasonal specials like pumpkin walnut pancakes and spiced apple pancakes that are delicious. They also have a lot of other vegetarian options like vegan sausage and good home fries.  It has a homey vibe and adds to the charm of Glen Park.", "author": "Rhiannon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "Good greasy spoon diner, great service. I got the linguisa sausages and eggs special, rye toast wasn't great and eggs and potatoes needed quite a bit of extra seasoning, but the sausages were very flavorful and snappy. We got a couple of pumpkin walnut pancakes; they were quite large and very good. Also tried a couple of buttermilk pancakes, and they were probably the best part of it all; pancakes are definitely Tyger's specialty. It's probably not a place I'll crave later, but it's a great choice for breakfast and is open early. Cash only!", "author": "AJ P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Amazing diner food! About maybe 3 min away from the Glenn Park BART Station. I had the chicken fried steak and eggs. Superb", "author": "Saeed R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-25", "description": "Decided to venture into glen park neighborhood for breakfast since we typically eat in the mission and wanted to change it up a bit. Boy did we choose the wrong place service was pretty bad it took forever to get our order in.. in fact a table that showed up ten minutes after us was had their order taken before us. I had the steak and eggs and my gf had the veggie omlette. My steak was extremely tough even though I ordered it medium rare and the gfs omlette was extremely bland.. I'm pretty sure we won't be back again.. oh btw it's cash only", "author": "Jared V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "Went in today looking for a quiet spot to sip coffee and read the paper after smoking a fatty. I had my choice of tables so I took the one in the corner, away from all the happy people and their optimistic vibes. The food was tasty and the waitress can only be described as \"cool as fuck.\" \n\nDon't be a chump, carry cash!", "author": "Dro K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Stop in for breakfast and that's exactly what I got some good ole'down breakfast as well a great hospitality atmosphere just like in my Grandma's kitchen~", "author": "Jeberechiah S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-07", "description": "So I came here for brunch with my sweetheart. When we walked in the first thing I noticed was it reminded me of an old folks home. Basically it lacks creativity. The food was average. My French toast had a weird taste to it because of the butter they used and my bacon was too salty. I'm glad they gave me water. Coffee was great tho! The sever was great as well. Always smiling and was very helpful when helping us make up our indecisive.\n\nIf I would have to pick between spending my last $20.00 on food here or another place. I would choose another place.", "author": "Monee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "We love Tyger Cafe. Everything about this place is wonderful. So wonderful in fact that since we moved away from the Glen Park neighborhood to Berkeley we took BART into the city specifically to eat there. I wish every neighborhood had a breakfast place as special. The food is tasty and affordable, and the service is always friendly.", "author": "John H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-12", "description": "I frequently ate here many moons ago. It was a great place to grab a quick no-frills breakfast--even had my first British Banger here! IIRC Tyger was the name of the owner/cook working his tail off in the kitchen. Fast forward at least 12 years...decided to stop in with my family, bragging about how awesome this diner *was*.  Not anymore. The service was abominable, our food arrived cold and it took forever to get our check. Wasn't super busy at the time, so this was surprising. I generally don't cross a place off my list after one visit, especially an old favorite, so I decided to stop in again to give it another chance. Midweek breakfast, handful of tables were full...many open ones. Told to take a seat anywhere. I sat for a quite a bit while the waitress walked over to two tables and took their orders, gave them coffee. I didn't even have a menu. No problem...I grabbed one from the counter. Sat for longer while she completely ignored me and brought over a couple of dishes to one of the tables. In walk an couple--they're told to sit anywhere. I'm still sitting, waiting for at least a cup of coffee. After the waitress is done with the table she was waiting, she walks past me again and ignores me. Then she walks over with menus and coffee for the couple who just walked in. I left and grabbed a cold coffee from the Canyon Market.\nI love my old reliable neighborhood hangs where I can get a decent no-frills meal for a decent price. Tyger's is no longer one of them. Disappointing.", "author": "Amelia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "Chill place.  Late lunch, around 2 pm, I was the only customer, made me a little skeptical but it was very good.  Service was fast, waitress was sweet.  I was able to enjoy my mid-day solitude. \n\nBurger was done to my likeness, can't complain.   Next time I may go for breakfast food.", "author": "Sonnett S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "Cash only. Breakfast parking has always been easy for me during the week. This is not a driving destination; rather a walkable place for the locals. It's open at 7am and the daily specials are unique. This morning I had chicken enchiladas and eggs. The quality of the groceries are comparable to most of the other city breakfast cafes.", "author": "Stanley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "This place is so cute. My first time here. I live in the neighborhood and I've been wanting to try this place.\n\nGot the country breakfast which included pancakes, choice of meat and two eggs.\n\nI got the blueberry pancakes with bacon and sausage. It was filling and really flavorful. I want to come back to try the breakfast burrito. \n\nCash only here.", "author": "Jenna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "DELICIOUS HANDMADE PANCAKES!\n\nThis is an awesome place for a local neighborhood gem for brunch!  I was here with my coworker during the week and decided to order their FRESH HANDMADE BANANA PANCAKE with TWO EGGS AND SAUSAGE!  It was delicious!  They gave me a large portion and the service was excellent!\n\nI was told that they have been around for a very long time.  My coworker even knew the owners and he grew up with their son and they went to school together!  \n\nThey also have a large menu and so you can order whatever your hearts desire!  \n\nIf you are looking for a hearty fresh breakfast with large portions and excellent service - you have to stop by at Tyger's!", "author": "Edwin R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-06", "description": "Its a mediocre diner in Glen Park. They have a simple menu consisting of eggs, pancakes, and 90's diner mini cereal boxes. \n\nI forget if they are cash only or not but you get a lot for your buck here. Service is attentive and food comes out quite quickly. If you walk down Diamond past Bello's and Canyon Market, its on the corner under the construction.", "author": "Daanyaal K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "I come here often despite the food being pretty crappy. Why, I cannot explain. I wish they cared more about cooking well.", "author": "Paul A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "Decent diner food and coffee at affordable prices in the Glen Park area. Portions are huge and filling! Sadly, I found a piece of hair in my omelette and just couldn't finish it, despite how tasty and delicious the omelette had been. Maybe hairnets would be a good suggestion?", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "Dirty cups, dirty space. Food looked nasty...tasted OK. Lemonade was $4. It wasn't fresh.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-13", "description": "Came here on a Sunday afternoon and it was pretty empty. You can choose where you want to sit and they a decent breakfast selection. I ordered the omelette with the sausage, mushroom, avocado, and cheese and it came with a side of potatoes. Portion was pretty big for me. I was only able to eat about half of my plate, but I felt like it was kinda lacking in flavor. It tasted like something I could've made...and that's coming from someone who doesn't really know how to cook. \n\nOverall food isn't bad, but I will pass and find something more savory or flavorful.", "author": "Renee Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "Cute place to have some delish brunch! Try the huevos rancheros! Salsa tasted so fresh! Really recommend this place for a fulfilling breakfast", "author": "Lissett D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "I am so liking this diner and will have to make another stop to try something else from the menu. The next item of the menu to try will be the pancakes on my next visit. A gem in Glen Park! There's a fair amount of seating for about 20-30 customers. The staff members and patrons here seem very friendly which is a good thing. Service is definitely prompt - that's another good thing.\n\nHere's what I ordered today:\nTwo eggs (scrambled) which came with country potatoes and a side of toast (I chose whole wheat).\n\nHours of Operation:\n7:00 am - 3:30 pm everyday\n\nIt is close to Glen Park BART Station!\n\nParking: Mostly street / metered parking\n\nPrice Range: $\n\nThis place is \"CASH ONLY\"", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "I've been going here since I was a little girl and I just love it. If your looking for a place to eat with the family and have a good yummy breakfast then this is the place to go, slightly expensive but I promise it's worth it.", "author": "Alia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "Located on the corner of Diamond and Chenery St in Glen Park, this place offers a homey mom & pops feel. They have steel gates in front of the front door, which makes it seem like it's closed; keep on eye on the look out for the open sign! \n\nEntering, we were welcomed by the homey atmosphere this place has to offer; an old fashioned looking diner, families eating breakfast, and the welcoming owners who seated us immediately. The size of this place is small, so I wouldn't recommend you bringing in a group of people; the most I'd say you can bring per table is probably a family of four. Service is friendly, as they're quick to clean up your plate and they come by to ask if everything is okay. They also have specials written on a whiteboard behind the cash register. \n\nThe food was mediocre to me. I opted for the French Toast Combo (~$10) which consisted of a choice of meat [bacon!], eggs, and french toast.The french toast and eggs were mediocre - a little plus to the toast for being a little more delicious! But the bacon was too salty for my taste.. \n\nI think this diner is great for the location if you would like mom & pops feel!", "author": "Mandy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Wow! What a fantastic breakfast spot. I first came here when I was a kid, but just recently came back as an adult. Not much has changed! I think that's great. I was craving a big breakfast in the morning and knew this would be the place to go in Glen Park. The waitress immediately greeted us good morning and had some small talk. I went on to order the country fried steak with two over easy eggs, sourdough toast, and potatoes. The food came in a timely manner. The ambiance is pretty simple, nice, and quiet, which I value during the morning. Tyger's is a great mom and pop shop that serves terrific breakfast. There's not a long line or wait, not a bunch of young hipsters taking a bunch of photos before they eat. Just some old fashioned people reading the newspaper and taking a breather before they start their day. This place could even make me a morning person. Come prepared with cash since that's all they accept. The waitress was really nice too, I accidentally handed her a bart ticket and she says, \"We don't accept bart tickets here!\" Was a pretty funny joke in my opinion and goes to show they care about the customer.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "have been going to Tyger's for nearly 20 years, but the most recent time will be the last. The place always had a line of people waiting outside on weekend mornings, but no longer. Maybe new owners, plus a new chef, but if so, they should invest in updating the interior. The breakfast special I had was the corned beef hash, always a favorite, but this time not only was the hash soggy and basically inedible, but the price has nearly doubled. A plate special of corned beef hash, 2 eggs, toast and coffee with a modest tip set me back $18.50, whereas just a couple years ago, a much better tasting dish with coffee and tip would have been under $10. Why the huge increase?  I looked at the menu and was blown away with their new prices. A short stack (2) pancakes for $8.50?  c'mon.... used to be under $4. They're using the same utensils, plates and cups as they have used for 20 years, nothing has changed except the prices and quality of the food. Needless to say, I was very disappointed as this was my go-to place for many years. I will not be going back.", "author": "Gordon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "I have been coming here for the past 3 years as it was a very close diner that served some decent breakfast. But the past few times that I have been, both the service and the food has drastically decreased in taste and value.\n\nOnce I sat at the bar, it took about 10min before anyone acknowledged I was there or took my order. Then 10min later, I was able to see my food waiting on counter for a server to bring it to me. Took about 7min later until the cook had to bring the order to me himself. At this time during the day the diner was not busy at all with only 5 tables filled.\n\nThe only thing that the servers were prompt about was giving me my check and taking my money. \n\nGood luck Tygers, I hope you can get your quality of food and service back soon.", "author": "Braven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "I decided to eat here for my lunch break, the breakfast was so delicious and came out quick. I have yet to taste better crunchier bacon that this place. I will definitely be back. The only reason it is not 5 stars is because it is cash only and I am one of those people that use my atm card for everything.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Perfect whole in the wall / community cafe! It doesn't look like much, but the food came out QUICK, hot & they had good sized portions ! 3 meals + 3 beverages + tip came out to $41 so def affordable. I'll be back :)", "author": "Brenda E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "Great little diner! I live in the neighborhood and this is definitely my go to when I want to go out for breakfast, but not something too fancy or too far. Service is good, they're pretty attentive. They've always got some unique specials(Chimichangas and eggs anyone?) and a some special flavor of pancake. I really like their pancakes. ^_^ They also have a decent collection of hot sauces. Food is reasonably priced, and I love the cute neighborhood diner feel of it.\nOh, and fair warning, they are cash only!\n\nDefinitely recommend!", "author": "Zephyr W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "WOOOW at the portions! The size of their pancakes and omelettes are HUGE. I ordered their country breakfast w/ buckwheat pancakes, egg whites, and corned beef hash and my mom ordered the california scramble. When our food arrived we both just said WOW and the waitress (I believe owner) laughed and said, \"first time here?\" so I guess this is a normal thing hahaha! The pancakes were seriously bigger than my head and it came with two! They were delicious though. I never had buckwheat pancakes but they were soft and a little sweet! Tasted even more glorious with the butter (: the corned beef hash costed more to substitute but it was delicious as well! I thought it could've used a little more salt, but there was salt and hot sauce for me to use on the table. The california scramble was probably one of the biggest omelettes I've ever seen and I didn't really try it because I don't like mushrooms, but I ate a part that had sausage and those pieces are huge little chunks! (Contradictory, I know.) Along with the omelette came with buttered toast (YUM) and some home fries which were so good! It was weird though, they were like home fries but also like hash browns in a way. They were flat and super crispy like hash browns! Regardless, I thought it was cool and above all delicious. \n\nThis is a cute little joint that serves HUGE portions of traditional diner foods, but also with different things like enchiladas and tamales on their menu! I definitely think there's something for everyone, and no doubt will you leave FULLy satisfied. Get it? Also, the owners/waiters were super duper nice! They were so kind and were pleased to accomodate any of your needs. We got 2 coffees and those two orders for $32 which I thought was oretty worth it considering the huge portions. Good food & good service is what you'll find here. Be prepped for the portions though!", "author": "Holly P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "This place is HORRIBLE!  The food was awful, service not any better. I'd suggest just walking across the street to the corner store if you can't wait for the other nearby places, but don't spend your money here!  Pancake was plain, house potatoes were flavorless and soggy, a sausage we ordered was uncooked,  in general the food is GREASY, plain and gross.  This place is for those who care little a bout the taste and quality of their food and those who can not cook.  The meal we got could have been executed better by 8yr old.  I don't like to bash out on places, but this place really needs to bump up their effort..... By the way COFFEE WAS REALLY BAD!", "author": "Fabiola V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-19", "description": "Went here for the first time today.  Pretty crowded Saturday morning... had to wait a couple minutes.  Fare is classic greasy spoon... quality on par with what you'd expect for atmosphere and reasonable prices.  Coffee was fine, though refills came infrequently.\n\nThe remarkable part was their turkey.  I had a turkey omelet that include their turkey sausage, which was tasty, spiced, and plentiful.  I also like that they had a turkey club on the menu that had turkey ham, turkey bacon, and turkey on it.  I have never seen that before and it seems like a great way to avoid pork, which i do.", "author": "G M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "A quick and rather inexpensive to indulge in an American meal. \n\nCame in thirty minutes before closing and was happily served. I'm not usually the type of customer to show up before things are wrapping up, but I definitely felt accommodated and cared for as soon as I stepped in.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "Clean, friendly and the food is must try. Very happy I stopped here.  service is fast too so that's  a plus.", "author": "Juan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Best hole in the wall breakfast spot in SF in my opinion. Everytime I'm here I feel like family and the food instantly gives me a food coma", "author": "Francisco O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-08", "description": "Mediocre at best. It's not a diner, whatever some reviewers are writing. It's a local breakfast and lunch cafe servings eggs, pancakes, BLTs and burgers. My eggs were cooked correctly, but the homefries were parboiled, followed by an inadequate time on a grill (not crisp at all, just cold and unappetising). The vegan sausages were heated, but not browned. For $9.25, I expect better quality. $7.25 gets you two pieces of poorly cooked French toast with cheap flavorless syrup. \n\nAnd the place doesn't seem clean. It's painted from about 6 foot down, but above are age- and fume-stained textured walls and ceiling with a few cobwebs adhering to the raised areas and fixtures. I'm surprised the health department doesn't require a thorough cleaning. \n\nWon't be back.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Cute old school neighborhood coffee shop.  Normally this would be a 3 star review but I was with my favorite person in the world...so 1 extra star just because of that.  I was looking forward to the corned beef hash but apparently this just doesn't happen on a weekday, so we made do with omelets...tasty and filling but just average.  Definitely a good spot if you're in the neighborhood and need a hearty breakfast.", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Nice neighborhood diner with some tasty food options.  I tried the Country fried steak and I got say it's one of the best I've had.  My girlfriend had the breakfast burrito and I had a little bit from it, and it was just as tasty. Cash only people, but theres a bunch of BofA ATMs around. I will definitely come back before I head back home.", "author": "Juan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-16", "description": "A typical old time corner joint that has been there for over 20 years.  I would agree with another yelper.  The food is mediocre.  \n\nService is very neighborly and efficient.  My coffee cup was always full.\n\nMy breakfast buddies like it here.  I'd go back with them.  On my own, no.  It's really 2 1/2 stars.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-10", "description": "I always see a long line waiting outside Tygers when I drop by eggettes for a drink and decided to wake up extra early with my siblings to check this place out. As we were getting close, it hit 10am, and I thought in my head that there would be no one there. Little did I know, there were already people inside, some waiting inside, and some waiting inside. We waited for about 10 minutes and got a nice seat in the back corner of this compact restaurant.\n\nIt's small, but has a really homey, old diner feeling. There was only one light on since the natural light surrounded the restaurant and a fan was shuffling air around the room. The waitress that served us was very kind. She greeted us with a smile and instantly asked us what we wanted to drink. She walks away and a man brings our waters and menus right after.\n\nI ordered the french toast combo. Which came with 2 cut french toast slices, 4 sausages, and 2 scrambled eggs. The eggs were slimy, but I kinda liked it that way. The sausages were dry, but my siblings seemed to have enjoyed it. The french toast was crunchy on the outside but soggy in the middle. Not one of the best I've ever had... but I was definitely full!\n\nMy sister ordered the turkey sausage, avacado, and jack cheese omelet. I felt like the omelets were most worth it. The menu doesnt mention that the omelets come with home fries (their version of hash browns) and toast though. So don't order it on the side! It is HUGE, and super filling.\n\nMy brother ordered the bacon, mushroom, swiss cheese omelet. The fillings were all on one side of the omelet but eh, he still liked it. He said he would never get sourdough toast again though, \"it's too sour...\" haha.\n\nOther than that, the service is great, and the price is decent. They came by to refill our water a couple times and that's sometimes rare at a busy restaurant. I've honestly had better breakfast food though. I saw that their pancakes are huge! I want to definitely try that next time\n\nAnd oh! They're cash only!", "author": "Linda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "Cycles.\n\nTwo excellent hours of Max Graham for listening: https://soundcloud.com/maxgraham/maxgraham-presents-cycles-4?in=maxgraham/sets/max-graham-presents-cycles\n\nFive incredible hours of Max Graham that requires eating: http://audiosf.com/event/max-graham-12-05/\n\nFortunately Glen Park's favorite (and only) greasy spoon provided for the night of (turkey burger) and morning after (pancake sandwich with egg whites and turkey sausage).\n\nImpressed with the friendly service (predicted no mayo on the burger), price (less than $20), and both the generous portions and the intense flavor.\n\nBurger was especially delicious. Pancakes were massive.\n\nWhich was great because after 5+ hours of Max was ready to cycle through everything.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Great little neighborhood diner/coffee house. The coffee is not gourmet, but it is good enough (they do not serve instant coffee, btw). The food is classic greasy spoon diner style. My daughter likes eating here when she is off or sick at home.  The workers are friendly, and always ask about the family.  Yes, I absolutely recommend this place.", "author": "Conrad A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-24", "description": "The place wasn't anything amazing. I have no idea why everyone thinks this place is so amazing. The food had no flavor. Yes the pancakes were big but at the same time the flavor wasn't all there. My girlfriends food wasn't good at all, it needed so many condiments to make it even taste a little good. The coffee tasted like water, and this is coming from someone that drinks their coffee black. I'm sorry to say but or instant coffee at home was stronger and better. I'm sorry to say this but I would not be coming back and I would not recommend this place at all.", "author": "Antonio C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "This place is alright. I came here with my mom for breakfast. The pancakes were ok and the hot chocolate was ok. I would rather go to IHOP for breakfast that here. This place is not the place for breakfast.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Nice small diner. I like coming here for \"business\" meetings or taking my mom out to breakfast when she comes to visit me because it's a nice homey place. The workers are nice and they are very attentive for my coffee. Great for simple breakfast/lunch.\nWish they took cards.", "author": "Kieran B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Love the food...great mom and pop place to eat...close to bart, bustops, and shops...prices are resonable...if u like classic diner this is a good choice...", "author": "Alfredo G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-21", "description": "Very good stop for breakfast and prices were very reasonable - cheaper than Santa Rosa for equally good food!  I'm not a big eat-out pancake man as I prefer mine made at home, but these were really tasty and I was wishing I had some for dinner tonight!  And the turkey bacon was by far more tasty and a lot less fat than the regular bacon, which my friend hat.  Excellent, friendly fast service and decent coffee. Not haute cuisine but definitely all-American breakfast.", "author": "Mark O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "Not good. The waitress/owner is really polite but the food is at best average. I've been there many times because of the lack of other options in the neighborhood but I decided that it's not worth any more. Potatoes are always burned and at the same time under-cooked-- not sure how they are able to achieve both qualities. My poached eggs are hard cooked and swimming in water and oil. Sausage is edible but again I wouldn't call it delicious. Go to the crape place around the corner for a nice breakfast.", "author": "Rositsa K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-24", "description": "The owner(?)/waiter was really nice and attentive (almost too much so - it seemed like he was hovering over us at certain times during the meal) constantly offering to refill my coffee and water. I probably should have ordered breakfast but went with a burger instead. It was pretty mediocre for $10 - the undercooked fries had an odd taste to them, like they'd been fried in oil that had once had a fish patty or something in it. I might go back again for breakfast when I'm in the neighborhood, but definitely wouldn't make a special trip. Seemed pretty busy for mid-day on Christmas Eve, so I'm guessing that it has quite a few neighborhood regulars/fans.", "author": "Sergio S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-10", "description": "We stopped into this cute little community cafe on a lark the other morning.\n\nThough Tygers was bustling and full of people, we were seated and our order was taken pretty quickly. The service was wonderful, especially for how busy they were and their prices were on the lower side for a cafe of their type, especially one in SF.\n\nThe downside was that they only took cash and sadly, their food quality didn't seem to be the best. They also didn't have a lot of selection in their menu.\n\nI'd come back but I doubt I'd order more than their pancakes or their toast again.", "author": "Meg T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "I frequent this place. Good decent home cooking.  Consistent service, nice atmosphere.", "author": "Marvelous Margaret M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-06", "description": "It was exactly what I expected--down to the refilled Heinz bottles that look like they've been there since ancient Egyptian times.\n\nI generally am pretty good at cooking breakfast myself at a fraction of the price, but I really suck at making good homefries.  I was hoping that Tygers would one-up me in that regard, but they were decidedly average.\n\nBut overall this is a decent diner that charges a fair price, so I'll be back some day when I'm feeling extra lazy and can't take 10 minutes to fry up some bacon and eggs.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Huge portions...friendly staff...good ole fashion home cooking.  Order the Country Breakfast with the special pancake on the board for the day...you will want to take a nap after it!", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "I can't say enough positive things about Tyger. My family and I live in Glen Park and frequent this cafe at least twice a month. We prefer the breakfast menu to the lunch. Lunch reminds me of an old school diner & in my opinion there's nothing wrong with that. But their breakfast has always satisfied our taste buds. Don't forget to peek at the specials board hanging on the wall behind the bar. The pancakes are fluffy and huge! Great if you like to share! Norma is polite and has a calming way about her. Our children are always treated like family. The cooks even make Mickey Mouse pancakes for them without us asking. Definitely the earlier you can get there the better, but you must try this place out!", "author": "Brittany W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-31", "description": "Actually 2 1\\2 stars. This place is a hit or miss. I'm leaning towards a miss in most instances. The Asian lady who usually seats me is also a hit or miss. I'm refering to overall friendliness. I've eaten at better places.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "This place is tops for its genre. I love it and it's prices. You're not going to have your idea of what breakfast could be totally turned on its head, but you're going to have an enjoyable sit down meal and come away satisfied.", "author": "Mr. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "I love this place. I live/work in the neighborhood and they are great when it comes to my time issues. I really enjoy the food here and the wait staff always remembers who I am. The portions are very generous. And the prices are comfortable too. The only downfall is they close at 3p.m.", "author": "Erin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-21", "description": "Cute little family owned place. I just got slightly annoyed that we were seated first but the couple that came in after us was helped first because I guess they were their regulars. Rude..\n\nThe food was OK. Kind of like home cooked food with only salt and pepper as flavoring. I really liked how they cooked their home potatoes and they do serve pretty good portions for the price, other than that I wasn't too impressed.", "author": "Mau T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "The employees are so welcoming and friendly that it almost feels like you're surrounded by family. Other than that, the food is mediocre- nothing special", "author": "Deanna L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-03", "description": "I'm not sure why they call themselves a \"Coffee Shop\". They are a diner. Their coffee was average diner coffee.\n\nThe food was cheap and plentiful, and the service was attentive. However, the food was disappointing. My omelette was passable (though I felt like I could make a better one at home), but the potatoes on the side were awful. It's like they cut up boiled russet potatoes, piled them onto a dry skillet for 3 minutes, and then sent them out. No seasoning, not sauteed in anything. Gross.\n\nIf you want a lot of mediocre breakfast food for cheap, this place is fine. But with all the great brunch options in SF, you're doing yourself a disservice.\n\nAlso, they are cash only, which in my opinion is unacceptable in 2015.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "Ive always liked this place. Make sure to check out the Day's Special that is sometimes written on the board on the wall. Might not be included in the menu. \n\n//", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "This is a hidden spot if you blink twice you'll miss it very small inside but with quaint hometown feel. The serving sizes were huge you could probably feed 2 people off them if you're eating in portions. I had the vegetable omelet it was amazing grilled onions and not fresh cut and the side of potatoes are fresh cut def not out the freezer. Service was pretty quick but this was my first time it got packed by 10 am and there was a small line outside.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-20", "description": "It's a local diner and not too many people know about this place. I came here with a friend of mine for a late lunch. He remembered coming here a few years ago and wanted to try out the place again. \n\nThe menu is pretty simple and easy to navigate. I ordered the Glen Park Burger and he ordered a New York Steak with eggs. Overall the food was nothing special but it had a good diner feel to it. I liked eating here because the price was reasonable and there was plenty of seating. The burger was made from ground chuck and even though I ordered it medium well the burger was still tough. They don't serve it on a hamburger bun but on sandwich bread instead. They do have grilled onions in there which adds flavor to the burger. There was something missing in the meal though. I ordered it with a side of fries which are not included with the burger. They were not bad and looked freshly cut and deep fried in oil. \n\nI would come back for breakfast and give them another shot. They seem like a friendly diner and it's a good place to eat that's close to the Bart station.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "As a breakfast food lover, this place was good! I had the bacon and egg with country potatoes and toast, and it was all very good. Their coffee was amazing. The only reason I gave a 4 was because the service could be better. Other than that, great!", "author": "Jael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "Great food, loved the spicy Louisiana sausages, huge pancakes were lovely. Family run place, very warming and comforting service. Good prices for the portions you get.", "author": "Hector S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "They only serve regular coffee but they will combine the coffee and hot chocolate to make you a mocha if you ask! Loved it!", "author": "Laura K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "To quote my husband..\"THIS is what a diner should be like\". Good prices. Great food. Hot, bottomless mugs of coffee.\n\nWe got the breakfast burrito special and the ham and cheese omelette. Both were amazing. \n\nThe service was fast and friendly. We will definitely be back when in the neighborhood.", "author": "Vanna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-02", "description": "One word: hot!\n\nSteam coming off all the food: husband' pancakes, coffee, artichoke in my omlete.\n\nI got the special of the day omelet: turkey ham, artichoke, onion, spinach, feta.  \n\nIt was very yummy and I recommend this place as your standard diner for breakfast.  It met it's need, nothing super special, nothing especially blah, so I say three stars!", "author": "Liz K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "I love this place! I always come back whenever I'm in the neighborhood and have the time. Decent price to satisfy a good greasy brunch craving... just what a girl needs every once a while! \n\nI try to order from their weekly special menu whenever possible. If they have the British Bangers (sausage), GET THAT!!!! I've only seen it twice but oh my god, it's sooo delicious! I think the other ones was the Bockwurst but it wasn't all that spicy (thankfully, for me).\n\nIf you want pancakes, you can choose from the weekly batter or the usual butter pancakes. They're very fluffy either way. I usually get the weekly batter...so far I've tried raspberry, blueberry, and banana. As someone who normally doesn't like pancakes and hates bananas, their banana pancakes are the bomb!\n\nAs for service, I would have to say 5/5. I'm not exactly introverted but I like to keep to myself and prefer to not make pointless conversation. After my first few initial visits, they recognized me and would let me be. My favorite staff is the shorter waitress. She always remembers to offer me a cup of hot water after I've been seated since I almost always ask for it. Little details like that really make the difference! One quieter, late afternoon, she noticed that I kept looking up at the specials menu and flipping the menu back and forth. She came up to me and asked if she could help. I told her that I couldn't decide between the daily special sausage or the weekly pancake to which she recommended the country style breakfast (consist of 1 egg, 2 short stacks pancake, and sausage). A solution for multiple cravings...!! Yay, thank you Tyger's! Definitely one of my favorite places for brunch within the neighborhood.\n\n*tip: their vegan sausage is...not that good... Throw your healthy habits out of the window and just enjoy the guilty pleasure. :)", "author": "Jannet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "What a great mix! Kids had french toast and pancakes while my wife and I had chicken Katsu with potatoes and eggs. Beside the quirky menu, this place was fast and  reasonably priced. A great breakfast if you're in the area.", "author": "Ian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "The food is amazing. Service is good. My mom and I come here on a regular. One of the best little secrets in the city.", "author": "Lysee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "My husband and I have become weekend regulars here since we moved to the neighborhood about a year and a half ago. Food is consistently delicious and service (on weekends) is fast and friendly! They always remember us and greet us with a smile. Even if there is a line, we've never had to wait more than 10 minutes for a table. Love the pancakes and rotating weekly special of enchiladas and tamales. Cash only, but not a big deal since there is a Wells Fargo ATM about a block away. Avoid going on Monday when the regular staff is not there and service tends to be very slow and not so great. But all other days, it is a winner!", "author": "Amber H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-09", "description": "Went in for a quick lunch the other day to break from the library. I got the California Scramble which was pretty good. One star level for presentation (as it looked like it was literally thrown on the plate) but it tasted like something I would make at home which was what I was looking for. What pissed me off is their totally unstated cash-only policy. Who does cash only at a restaurant and doesn't make it known with a sign or written on the menu or something? The waitress leaves the check on the table super early in the meal, and so I put my card on top of it and wait. And wait. And finally i call her over to let her know I put it down in case she didnt see it and she says \"Oh honey wish I could take that but I cant\" and then just leaves. Uhhh....ok. Lets just hope I have the cash then, honey. It's not a cheap place for what the food is so I wasn't sure if I would have enough. I ended up having just enough, not including tip so guess what? Look who didnt get tipped! If you want your customers to not feel stupid and angry at your cafe then freaking tell people its cash only!", "author": "Natalie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Food was pretty good, service was okay. Overall it was unmemorable but nice. I was a little worse for the wear after a night of drinking, and the food was just the thing to fix me up.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-17", "description": "There is nothing more white people like than eggs, toast and some sort of meat for breakfast. We line up for hours for it and it is all the same for some crazy expensive price for what you actually get. This place is no exception. The breakfast served here could be made by a 10 year old. The food is completely lacking of any originality and style. The meat omelette will have two or three small pieces of meat and you can tell they are trying so hard to cut costs wherever they can. Why do people get so excited about this? In addition why do they only accept cash? Oh wait, it's because they are trying to hide their revenue from the IRS and for that reason they will never get a tip from me.", "author": "Ddc C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "This had become my new lunch place. It is not pretentious or trendy. Two qualifications I look for when venturing out on the weekend.\n\nI always get a tuna melt on sourdough with diet coke. PERFECT! \n\nFast service, good food, not too pricey.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "3.5 stars, but I've rounded up this time because I support family run operations such as this.\n\nIt's a cozy little diner nestled in the heart of the Glen Park business district on the corner of Diamond of Chenery.  The small space has tables parked fairly close together so the community inside can eat together and enjoy each other's conversations.  The spot is super popular too so a short wait outside is pretty common.\n\nI came in with four other friends I had just volunteered with at the nearby Glen Canyon Park where we pulled ivy, and dug up radishes, mustard and fennel on a steep, grassy slope.  A park staffer kiddingly noted that we were more effective than a herd of billy goats since we pulled up the unwanted plants with roots and all.  We were tired and hungry but enthusiastic about the work we had just accomplished, and the SF Recs and Park staff we worked alongside of highly recommended the restaurant for small groups.\n\nThe menu lists a nice assortment of breakfast dishes alongside burgers and sandwiches.  There is a daily specials board mounted behind the counter but many of the specials (not all) are already printed into the menu.  We all agreed breakfast for lunch (I guess some call it brunch.) would be the preferred choice.  Little glasses of ice water came around to the table.  It took a bit of time before the waiter came back to take our orders.  Very understandable considering how busy this place was.\n\nWhen the waiter returned I ordered an omelet with turkey sausage, mushroom, onion, avocado and jack cheese.  The omelets come with pan-fried house potatoes and choice of toast.  I had an iced tea to go with my water.  The turnaround time was very fast as we got our food in just a few minutes.  There were so many platters on our little table that we had to jostle everything around to get plates to fit.  My omelet (http://www.yelp.com/biz_photos/uymg9f_cBIprwMWOqzHGhQ?select=9w-Zgr0TKocW_tyRpGrNNw) was a nice size.  I'm thinking it was probably three eggs.  The generous portion of ingredients sat inside the pocket of the fried egg shell.  The turkey sausage are links cut up into bite sized pieces, and I'm happy to report they give you lots more of the good stuff (avocado) and less of the filler (onion); although, the onions were cooked up soft and I prefer that.  The thinly sliced potatoes were good with nice crispy edges.\n\nThe food was a tad on the greasy side, but none of us were complaining as we all ate everything on our plates.  The service is very friendly and very efficient.  In order to get to the small bathroom in the rear you need to go through the kitchen area to get there.  It was quite amazing watching two cooks prepare everything in such a small space.  The bathroom is decent too.  The water in the wash sink was very hot and perfect for scrubbing off all of the dried mud caked on our hands.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "I love love love this place. It's the perfect little neighborhood nook for my weekend breakfast. Every time I eat there I'm so glad that such old school family-run gems still exist in the city. The food is hearty, tasty and always fresh. This is not your typical 'go out for Sunday brunch with mimosas' kind of a joint. It's for the neighborhood and should stay like that :)", "author": "Tanvi C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-09", "description": "Ugh. Glen Park seriously needs a greasy diner, but this place is colon-blow. I'd take just about anything moving into Tyger's at this point. I gave it two stars because the people are nice, but what the food does to my bowels is not nicer than two stars.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-20", "description": "OK, so I went in here with my lady and I really wanted to like this place.  The service IS excellent.  The food was REALLY bad. My wife had scrambled eggs with vegetables mixed in, (how hard is that)....  well it tasted like the vegetables had soaked in oil for hours. \n\nDo yourself a favor  walk across the street to \"a nice place to eat\" and ENJOY your food.", "author": "Mister E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Great food!  You'll be satisfied.  Prices have risen a bit but as long ad I'm satisfied I'm fine with it.  Different types of pancakes, like banana, blueberry... they have vegan sausages.  When we go there we have pancakes & omelets.  The cheeseburger with avocados.  What I don't like us when one of the server's tells us \"too much food\"  We usually get a doggy bag.  Before I finish giving him my order he starts taking my daughter's order.  LOL.  I then tell him \"wait I'm not finished.  Other than that I have no complaint.  Mmmm...maybe he's looking out for my girlish figure", "author": "Dee G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-19", "description": "Very poor quality ingredients, and seems expensive for what you get.  Had a Denver Omelette, and the peppers and onions had no flavor, didn't finish it.  Hash browns were OK.  Rye toast was more like Wonder bread.  Sausages tasted like paste, ate one of the four.  I was very hungry going in and still sort of hungry going out, but $20+ poorer.  With tip, well over $20, will not be returning.", "author": "Ruth F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-03", "description": "This is your typical, neighborhood greasy spoon. I think Yelpers got it right with the cumulative 3.5 star review. It's no frills, not fancy, efficient and everything you would expect from an old-school, traditional diner. Dont get me wrong, there was absolutely nothing wrong with our experience -- it was just average.\n\nLiving in the neighborhood, its obvious that its a place where many locals go. It has that throwback, vintage feel which i appreciate. Went early on a Sunday morning (around 8:30) and all tables were filled so we sat at that bar. We got our coffee quickly, the waitress was quick and the food came out as expected.  Nothing about it blew us away. \n\nWe paid, went home and never discussed our meal...which is a sign of mediocrity (in my opinion).\n\nOh yeah, its CASH ONLY!!!!", "author": "M. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "My husband and I come here almost every weekend. It seems there aren't any other diners in downtown Glen Park, but this one is pretty good and hits the spot. I like the Roberto's Omelette. My only criticism is that the restaurant could use some renovation, the building it's in is pretty old.", "author": "amber h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Solid breakfast spot and it isn't too overcrowded. Great food. I do wish they had some hash browns and not just country potatoes--but hey a potato is a potato I guess. Eggs are always great and check out the specials.", "author": "Won't B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "I've eaten here several times and enjoyed all my meals. Love the pancakes. The portions are huge so order accordingly. It tends to get crowded around brunch hours during the weekends. People serving the food are pleasant and welcoming. All in all it's a great local breakfast joint. I'll be a regular here as long as I live the Glen Park area.", "author": "Pursarth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "This is such a great neighborhood gem. The service is fast and friendly and the fact they have a turkey bacon BLT with avocado just seals the deal for me.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "RAWR.\n\nTyger's I could just EAT you all up. \n\nIt isn't five star dining but it's certainly satisfying . It's everything you want out of a greasy breakfast and it isn't Denny's or Mel's Diner. Good Bacon, Hot Links, Pancakes, Potatoes, Country Fried Steak and Sausages. \n\nIf you want healthy food, go pick some fruit . Personally, Tyger's is a bit of a guilty pleasure and good for a Nasty Hangover.", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "Hangover breakfast food!\n\n- Cash only, when our group was doing the whole split-the-bill thing, one of us had to go over to the B of A ATM a block away because we were short. \n\n- Generally large portions. The five of us each ordered something, and the table was filled corner to corner with plates!\n\n- Funny waitress lady. After giving our orders, one of us decided he wanted more, so he asked, \"Can I get a side of french toast\" and she says, \"Nooo\" in this knowing tone, \"it's a lot of food!\". Hahah we all cracked up, nothing like a middle-aged asian lady telling you what to do! :) Turns out we had ordered more than enough food and probably couldn't have finished the extra french toast :P\n\n- Food itself is nothing to die for, just your standard eggs and pancakes and such.\n\n- Parking was metered on Diamond St. We were in and out in an hour.\n\n- A little grungy on the inside in the \"neighborhood diner\" kind of way", "author": "Suejung S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "I came here for breakfast during my last visit to San Francisco. I had a cheese and ham sandwich toasted, which tasted good. The service was also good, can't really say much more than that.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "What a great place.  Visiting in the area from L.A. Looking for breakfast near my favorite bookstore - Bird & Beckett (what a GREAT neighborhood!). The breakfast at the counter on Saturday morning was perfect, the Tyger scramble? Omlet? Don't remember but the veggies were fresh and lightly cooked and all was hot and well served. Just loved it. Oh, and quite reasonable for so much food!", "author": "Laurie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "My boyfriend and I like to have breakfast here weekend mornings. The place is small, but that's not a deal breaker. The food is mediocre, but refills on coffee are free. Huge plus. I need me my coffee. The service was good and they're very friendly. I'm all for mom and pop kinda places like this.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-31", "description": "I've never posted before, but my meal this morning inspired me to write a quick review of this place.\n\nI like the old-fashioned neighborhood diner feel, despite the fact the food is mediocre. I ordered some oatmeal this morning and a fried egg. Egg should have been fried medium and instead the yolk was entirely uncooked. Oatmeal was bad. Clearly their instant oatmeal was stale. It had a bad \"off\" taste to it.\n\nOkay, this is not a huge deal to me, actually. I just didn't eat the oatmeal and dealt with the runny egg.\n\nBut when they came to clear my table and asked about the uneaten oatmeal, the fellow looked concerned, but not for me. Next the owner/waitress comes over and starts to argue with me that it's fresh and they make each batch as it's ordered--which I must say isn't that tough to do when dealing with instant. I reply that I'm not trying to argue. She says that no one's every complained and she's been there 30 years, to which I reply that there is a first for everything.\n\nAnd yes, I do end up paying nearly $5 for a bowl of uneaten, stale oatmeal that cost them maybe .50 cents.\n\nSo, like I said, I know this isn't a gourmet place and I'm fine with that. But some semblance of civility and concern over a bad dish would be appreciated.", "author": "David Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-31", "description": "I liked this place. Feels like the place has been around for a very long time although I can't find any history on the place yet. I got the country fried steak. Delicious if you can afford the calories. \nCoffee was standard dinner style. \nWe had a great seat at the window that looks down Diamond.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "The pancakes here are the best.  The omelettes and other stuff is good too.  They have cool stuff that other places dont on their menu.  Since the Village grill in west portal closed I currently rank this as #1 breakfast diner in town.", "author": "Petey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "This is one of those great home-y diners that reminds me of my mom and dad's old diner. It makes me feel so at home =) \n\nFood-wise  they have all your typical american diner breakfast stuff from blueberry pancakes (DeLISH!), omelets, french toast, and various other egg dishes. \n\nI had the turkey sausage omelets - it was very good with big bits of turkey sausage interspersed. it was also served with toast and homefries. My friend had the blueberry pancakes along with accompanied eggs and bacon - very filling and satisfying.\n\nOverall, the food is obviously nothing out of the ordinary, but I just love that longstanding diner feel where everything is pretty good, greasy, and friendly. I picture coming back on a sunday afternoon in need of some comfort food.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-01", "description": "Food was okay, nestled in Glen Park a cool breakfast spot. nothing you can't make at home. only issue i had was it was wayyyy to loud in there.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "i like to go to here for various reasons including reasons not already listed below\n\ni enjoy the service and also i like the location and also i like potatoes and breakfast meats which are served here", "author": "Andy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-01", "description": "Before we had set out on a long drive out to Monterey Bay, my friend took me to a small diner nearby his place. The place isn't glitz or glamoured, but has a nice warm homey atmosphere to it.  Upon entrance, I was greeted by a small framed Asian female with a big friendly smile that just lit up the place. \n\nI would recommend ordering a plate that is served with the sausage. Slightly seasoned with a hint of cumin & spices, the sausage has a nice light spicy flavor with each bite. \n\nAside from attentive and friendly customer service, and hearty portions, I just love the warmth of the diner. It was a definitely a great place to momentarily escape from the fast pace of the city.", "author": "Vicki T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "I regularly walk by Tyger's and it's almost always packed because it's the only \"real\" coffee shop that serves a full breakfast in Glen Park. \n\n IMHO, food quality is just ok.  Comparable to any other diner type coffee shop I've ever been to, including Denny's. The prices are a bit high -- $8-10 -- but the servings are large (which justifies the prices) and the service is quick and attentive despite how busy they are. \n\nI had the pancake/egg/meat combo recently and the pancakes were so huge that I couldn't finish them.  Coffee and water are promptly refilled w/and w/o request.  \n\nA great place to have breakfast if you're in the area.", "author": "Martin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-25", "description": "I have been coming to this breakfast spot since I was a little girl.  I now call it one of my neighborhood gems.  During the week there is generally no wait.  On the weekends, it is often another story and the wait can be awhile.  The portions are large and filling.  I love everything, the pancakes, jumbo raisin walnut french toast, or eggs and bacon (http://www.yelp.com/user_local_photos?userid=GIMg5oHqsJXdRq_7tR2jjQ).  I have, however, had better home fries and the lunch doesn't really do it for me.  I also think it is weird that you have to get French Fries on the side, but they aren't good for you anyway so whateves.  \n\nCome for breakfast.  The service is good and the food hits the spot.", "author": "Justine D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-08", "description": "This Place Is Awful. When You Walk In, You Can Tell The Place is Dirty. The Walls and Windows Need To Be Cleaned. The Service Is Prompt But Over Priced. My Mom Ordered One Pancaked, One Sausage, And Two Eggs. The Waiter Messed Up The Ordered And Charged Almost Double. I Ordered The Chenery Scramble, It was Tasteless, Needed Salt, Th Onions Were Cut Way To Big. The So called Country Potatoes Were semi Mashed and Sliced, Not Cubed, And They Had NO SALT, NO FLAVOR. I Do Not Recommend This Place, Go Across The Street For A Better Experience.", "author": "Susana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Yum! Had the pancake sandwich cuz the reviews said pancakes were good. And they were. Prices were reasonable too. Long time friend said this place was good and she had been going here for many years. People are very friendly. What more do u want in a restaurant?!", "author": "Sandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Great service. Great food. And great coffee. Highly recommended.\n\nThe staff is friendly and helpful. \n\nPlease note that they only take cash.", "author": "Fred T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-02", "description": "A friend suggested this place since we wanted to grab breakfast nearby & weren't too familiar with the city. This place is pretty fun-sized & it was pretty packed, but we got seated quickly. I got the french toast w/ ham & easy over eggs. It was good, nothing outta this world that would make me want to really come back..but we left satisfied after a long night of partying :)", "author": "Elise T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-27", "description": "Cozy corner diner in Glen Park. I found myself a table by the window and sat by myself when I was approached by (what I believe to be) the owner's son. I asked him about the tea selection and he turned and the first thing out of his mouth was \"mom.\" How often do you run into that nowadays?\n\nI ordered the california scramble, two eggs scrambled with avocado, mushrooms, and tomatoes. With Stash Green Tea (so glad that it wasn't Celestial Seasonings tea) and a side of turkey bacon. No toast.\n\nThe scramble: not the best in presentation...I know, I know. I am in a DINER so let's say it's \"diner scramble\" quality. I didn't know the scramble came with a side of home fries too, which were thinly sliced. Yum. The 4 turkey bacon strips were crispy.\n\nAttentive service.\n\nMake sure to stake out a window table (there are 2 two-tops and 2 four-tops along the window) for people watching. :)", "author": "Ileana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "I love this place. There's nothing fancy about it, but it can't be beat for a simple breakfast and coffee.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-12", "description": "Not a bad place for breakfast. There are a number of breakfast options in this part of Glen Park, but this is one of the better. The coffee was not the best I've had -- far from it, actually. The eggs were decent, and the bacon and hash browns were very good.\n\nTyger's is easy to get to from the Glen Park BART or from any of the houses nearby, if you live there. Definitely worth checking out.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-30", "description": "I get coffee down the block daily, sometimes twice a week.\nI must have walked by at least a million times (understatement).\nWhy I passed up on this cute diner so many times will remain a quandary (especially with my preference for diner food) but I'm glad I finally paid Tyger's Cafe a visit. \n\nIn short, I am always happy when I can get breakfast, namely omelettes, any time of the day. I like the way the eggs are cooked here, they aren't overcooked and dry like most places. They have a \"unique\" jumbo walnut french toast that sounds divine, which I have yet to try. Will be back! Whatever coffee they serve is outstanding since I can drink cups on end... I'm sure I almost consumed an entire pot in one visit. \n\nOverall I am impressed and satisfied every time I eat here.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "I have been coming here for a few years. A very good neighbor diner. The specials are always good. Corned beef hash is made from real corned beef and not canned. Everyone is treated special. Prices are fair. There is plenty to chose from on the menu. The omelets are cooked perfectly. I like coming here for Sunday breakfast, i am rarely disappointed in the food or service.", "author": "Janet C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "This place is awesome. I've been here more than a few times, but thought it deserved a proper rating. \n\nThe location is fantastic, but given the popularity of this place, it is just way too small for the number of apparently loyal clientele that visit here...some on a more than once a day basis. \n\nI have tried a lot of their items off their menu, but I'm always a fan of going with what the regulars are eating and/or what seems to be the item that most people are eating. \n\nThe item that inspired me to write this review today was the corned beef and hash. Admittedly, I just came from running 1/2 of the SF marathon so any food would have been welcome, but an order of corned beef hash, eggs over easy and and two slices of sourdough was the ticket. \n\nThe wait staff is pretty busy running around trying to get everyone seated, ordered and eating as quickly as they can. \n\nThe two man cooking crew in the back is obviously busy pushing out orders and of course the two busy \"boys\" are just as frantic turn tables for the next group. \n\nThe corned beef hash was excellent. Definitely not from a can and I've been to my fair share of places where stuff is obviously from a can or an amalgamation of components from different cans. I regret not asking for it to be cooked a little longer, maybe a deeper char on the outside to get more crusty goodness. Oh well, no loss here. \n\nThe eggs oozed their yellow goodness over the top and with a squeeze of the Heinz ketchup (aka condiment ambrosia aka the condiment of the gods) and some crystal or Ashburn hot sauce and the meal is complete. \n\nIt actually hurt to eat, because of the run, but i inhaled that thing.... it is awesome... you have to get it.... but make sure you choose the right weekend as it is only every other weekend. \n\np.s. - they have an eggs benedict and a pumpkin pancake which also is awesome, even if you can't use condiment ambrosia on pancakes...or can you?", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-19", "description": "I love Tyger's for my weekend breakfast. There's never much of a line, and when there is, it moves quick. They offer all the usual breakfast staples, plus a board full of delicious specials. My favorite is the every-other-weekend eggs benedict. I get it with the vegan sausage and it sure is yummy! The buckwheat pancakes are mighty fine, too.\n\nThis is very much a Glen Park neighborhood favorite and with the good food, and quick and friendly service, it's no wonder.", "author": "Kenny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-28", "description": "I think I would actually give them an 3.5 if I could, which I think matches their average. I have only ever been here for breakfast, but I really enjoyed my omelette. It was something of a fat-bomb (my fault for ordering the deliciousness of bacon, sour cream, and avocado.)\n\nThe drawback is really the not-very-nice bathroom (so if you are picky about such things, don't pay it a visit.) I am normally open to a wide variety of sketchy bathroom situations, but even I declined to use this one.", "author": "Dena D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "One of my favorite spots for breakfast. I always order a cheese, bacon, and mushroom. Pancakes are good too. They only make homefries; I think hashbrowns would be better, that's the only thing I'd change. Service is good here, family owned.  Can't go wrong here.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "Tyger's coffee shop is just what it's name says. It's a great old school family friendly (read: can have some noise) joint. If you're looking for a slightly fancy take on traditional American breakfast fare, then try Toast Eatery or, for a very fancy take with fancier surroundings) then consider Savor in Noe valley. But if a straightforward yet delicious omelette, pancake, French toast, etc with lots of refills on fresh brewed coffee (decaf available but don't expect a cappuccino), then look no further. I've been there over 20 times and the smiles as well as the food from the friendly staff are very consistent. Oh, and my breakfast companion is impressed by their poached eggs. 5 stars. Cash only.", "author": "E K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "Came here today for my friends bday because it had pretty decent reviews. We ordered banana pancakes, an omelette, and sausage with eggs. The food took 15 minutes to come and it was good. typical breakfast food that is yummy and satisfying and also a GREAT PRICE! The woman there is also very friendly and super bubbly and happy. Will definitely go there again.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "I have nothing but great respect for the letter \"Y.\"  After all, my name starts with it.  However, as it was the case in that Will Smith movie, The Pursuit of Happyness, the letter Y in the name of this diner seems to be accidental.  Since I don't go to dyners . . . umm, sorry, I mean diners . . . to learn spelling, I think it might be time to move on.\n\nI stopped by last Thursday morning, and the place was buzzing.  I found a tiny table by the window and sat down.  It took me a second to flag down the waitress/cashier/owner (?) but I didn't mind one bit.  It's not like she was sitting around filing her nails in the corner.  She was running around, bringing food, taking orders, cleaning tables and ringing customers up.\n\nWhile I waited for her to notice me, I had a chance to look around.  The wood paneling screamed 1980s, as did the lithographs on the walls.  The specials written in dry erase marker on the white board, on the other hand, screamed 2010.  What the hell is \"quinoa?\"  Do I want it in my soup?  Wikipedia on the iPhone to the rescue . . .\n\nI ordered the basic diner breakfast fare: 2 pancakes, ham, scrambled eggs and a side of wheat toast.  Don't judge.  The pancakes came on a separate plate, and they were absolutely humongous.  They were very fluffy, although they seemed to have too much canola oil in them.  Either that, or the canola oil was extra pungent.  Eek.  The eggs were fresh and fluffy as well.  The slice of ham, although small, was delicious.  \n\nThe place is really old school: there is no sugar free syrup or Splenda.  If you care about things like that, bring your own.  The maple syrup is on the table before the pancakes, just like Rainman would have liked.  Serving it in old honey bear-shaped bottles is a nice touch.  The little packets of jam were on the table, too.\n\nWord of advice: drive 200 feet up Diamond Street and park for free.  There's no need to pay 25 cents for 7.5 minutes of parking at the meter, or whatever they charge you these days.  Don't give Gavin Newsom the satisfaction.\n\nI live very close by, and I will be back with my own Splenda looking for parking on Diamond Street.  See you there?", "author": "Yan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "My new favorite breakfast spot!!! Banana pancakes were to die for, servings are HUGE!!!! And the apple juice is the real deal!!!", "author": "Kristine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "I go here quite often, I've tried many of their dishes and they were awful, I wouldn't order them again.\n\nI only go here for the OMELETTES ! (Bacon, Avocado, and Sour cream). I'd say it's a good breakfast spot, but consider other restaurants in the neighborhood for lunch.", "author": "Brigida W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "This place may look a little intimidating from the outside, but once you get inside, it is the best greasy spoon I have ever tried. The service is great, very friendly people, the atmosphere is nice and comfortable, and the food is exactly the hearty, delicious goodness you would expect.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-09", "description": "SUPER greasy spoon. Huge portions. Really sweet service.", "author": "Jacquee P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-23", "description": "Stephen and I love this neighborhood and have wanted to try what looked like an old school diner.  There are often people waiting in line.  Usually a good sign.  We finally made it there today.  What a let down.\n\nWe were seated right away and liked the family style help.  There!  Two stars so far. . . yeah!\n\nBut the food?  Yuck.\n\nStephen had the jumbo walnut raisin french toast.  Undercooked.  Undergood.  They want you to use the syrup on the table served in honey bears.  I doubt its maple - tasted watered down and couldn't hide the bleh taste of what is usually a no-brainer yummy thing to get.\n\nI made a huge mistake in ordering the chicken enchiladas and eggs.  By enchiladads, they served up what tasted like chicken chili rolled in tortillas with Pace Picante salsa on top.  Seriously.  Eggs were fluffy and pretty good.  Potatoes were the blandest thing I've ever tasted.  The best part was the wheat taste on the side.  \n\nSorry, cute-ish, old-school, family-run neighborhood diner.  I wanted to like you so much but the food was just this side of yucky.  :(", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Found in this place on a fluke and came back the very next weekend. It's a simple cafe with a great selection. The owners and staff were really nice and attentive. Loved the french toast and the country fried steak. Cash only but most small cafes are. The prices are very reasonable so it doesn't bother me and portions are big. Win win.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-16", "description": "Been here a few times and it's really not very good. Pancakes from shopbought batter, OJ from a bottle, the meat is not very good quality - and nothing is particularly tasty or well cooked.", "author": "Pia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-11", "description": "I am a big fan of well-made pancakes and this place does it right. Big, fluffy and the blueberry ones are stuffed with blueberries. A bit pricey for a place with a hole-in-the-wall vibe, but pancakes are worth it!", "author": "Rich P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "Very nice neighborhood restaurant. I had the Ham & Cheese omelette and got a side of sausage gravy to pour on my potatoes. I was very satisfied when I left and would definatly go back. Good service.  It's not a huge place so probably not good for big parties. You can tell lot's of locals which is usually a good sign of repeat customers.", "author": "Tim H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-22", "description": "Their pancakes are absolutely otherworldly. Thick, rich, moist and flavorful. Best I've had in a long time.\nKudos also due for the warm Korean hospitality.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "BIGGEST PANCAKE I EVER SEEN! Oooof, I'm full. Yummy. Coffee's the worst of all mankind there, BYOC (Bring your own coffee). There are few place you can get coffee before arriving at Tyger's to get their killer Pancake!  Note: just get the pancake, not the combo deal because you won't be able to finish'em all.", "author": "Pepe W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "The best diner feeling hometown ambiance. Never that long of a wait for weekend brunch. The pumpkin pancakes were intense. Cash only.", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-10", "description": "This is a breakfast/lunch spot. Nothing fancy about it but the staff make this place run like a machine. This is like the 60's version of the chain Toast. From the great tasting pancakes to the bottom less hot coffee this place is on my top list of places to go for breakfast. \n\nTheir menu is not complex and their meals are basic (omelets, eggs, burgers and club sandwiches). For instance if you ask for steal cut oatmeal they might not have any idea what you are talking about. But that is okay! This is a fresh experiance to the typical over trendy breakfast places of San Fran.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "Tyger's isn't one of those posh restaurants with pretty decors and sleek furniture. But who cares, right? As long as it's clean and the food's good, that's all what matters!\n\nMy friend and I came down here after taking our JEPET exam at SFSU because we neglected to eat breakfast before the test. I thought parking would be hard to find but it really wasn't. If you guys are looking for parking at Glen Park and you didn't know yet, there's a public parking lot right in front of the Bart station. I think the limit's 5 hours. Just saying...lol\n\nAnyways, the food, as I said, is pretty good. Tyger's can beat Denny's and iHop's asses anytime! Pancakes are the fluffiest, even fluffier than iHop! International House of Pancakes my ass! I love their toast and sausages too! I had a taste of my friend's spicy cajun sausages -- perrffeeecctt! I suggest you try it sometime too =]\n\nThe only thing I kinda didn't like is the space isn't big enough to accommodate big groups. So yea, I don't recommend taking your whole family (including aunties and uncles and cousins and grandparents) to have breakfast here. It's ideal if you bring 1-2 people. But other than that, you might have to wait a while to get seated.\n\nAll in all, I'm definitely coming back! Yay!", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "I checked out Tyger's the other day during lunch and went for their breakfast. I've never really been into breakfast places because my dad makes just as good or even better breakfasts.\n\nThe scene:\n\nIt's a quaint little coffee shop with limited seating. There was a huge wait out the door when we arrived, but they were able to sit us quickly.\n\nThe food:\n\nOur group got the Raspberry Pancakes, Louisiana Hot Sausage and Eggs, Country Fried Steak, Pastrami On Rye Sandwich and the Tyger Special (turkey and bacon sandwich). I, myself, had the pancakes, but I was able to steal a bite of the hot sausages and the country fried steak, and boy, they were good!\n\nRaspberry Pancakes - These chewy and thick pancakes are made with a raspberry puree batter. With each bite, I could see chunks of raspberry in the pancake. I'm always curious to know how you make chewy pancakes! I must find the secret.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Any place that serves buckwheat pancakes is usually a hit with me! I shared a short stack with my friend to needlessly supplement our already large breakfasts. \n\nThe home fries are ok, I wished they were a little crispier. The French fries I saw on other people's plates looked good so maybe those next time instead. My eggs were done just like I like 'em and the bacon was great. Firm yet chewy and not overly greasy but a little overly salty. My friend, however, described his ham n' jack omelette as \"basic.\" \n\nI'll be back for more of those buckwheat pancakes for sure at this totally old school diner.  ....  I think its still 1962 in there.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "Pretty solid breaky-break. A little pricey, but thats SF breakfast for ya.", "author": "schmoo l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-06", "description": "*The Experience*:\nI really love this place! The staff here are so sweet and are always happy to see new people and the regulars. They make sure to greet you and make sure to let you know they'll be with you in a minute (if they haven't already seen to you!). Whenever people are in this neck of the woods and are hankering for some good ole' fashion American (well, Californian American) breakfast, I make sure to suggest Tyger's and try to get my friends to go there. \n    The ambiance is straight-up, no frills, tables-and-chairs. I've never been there when it hasn't been empty, so I usually eat with the chatter and the normal noises of families with small children, families with older grandparents, young people, old people, all types of people! I'm glad there is a place like Tyger's to show people that not all eating establishments in SF are full of hipsters, bougie techies/i-bankers, huppies (hippy+yuppie), faux-homeians (fake bohemians), and earth-mother breeders. You'll find that all are welcome at Tyger's and the staff will make sure that you feel that way.\n\n*The Food*:\nAgain, straight-up, good ole' fashion breakfast items. I agree with others that the coffee is a bit weak, but it'll do if you need your caffeine fix. I've had the pancakes, scrambles, omelettes, and the sides of bacon and hash browns. Seriously, the food hits-the-spot. For some, the food would just be a-ok...perhaps a step-up from Denny's/IHOP, but not as good as other SF breakfast establishments. As for me, I'm a 'Yay! I'm a fan' and give a 4-star rating because Tyger's fits the bill of a breakfast place that serves the kind of no-frills breakfast you remember growing up in your small suburban town (but, in my case, Tyger's is  way better since my suburban town was a hell-hole, and SF has fresher ingredients).   \n\n*Would I Eat Here Again?*:\nHell to the Yea. I can't get here as often as I like because I am not up early enough to eat breakfast. But like I said, if friends want to meet up to have breakfast in Glen Park, then I have no qualms in recommending Tyger's and secretly hope that we can decide on Tyger's as it's so convenient to get to (a block from Glen Park Bart Station), the great and welcoming staff, and the hits-the-spot kind of breakfast food.", "author": "Patricia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-09", "description": "Still the best place for breakfast.  Best coffeeshop coffee anywhere and yah it ain't cheap but neither is Starsucks or Martha and Bros.(that's where I buy bulk coffee).\n\nThis is definitely Pancake, corned beef, and omelet city!", "author": "Charlie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-19", "description": "My friends took me for a late breakfast at Tyger's.  When we got there afternoon, it was not busy at all.  So, we have no problem getting a table right away.  Nice homey diner feeling.  Waitress was attentive.  The prices on the menu is decent.  Portion for our food was more than enough. =) We shared a banana pancake. I must say it is delics!  However, for my own plate, The California Scramble with potatoes.. it was somewhat too oily for me... But i was hungry, so i finished all my eggs anyway. But overall, it's a nice place to go and get together with friends.  Parking could be hard to look for if it's peak hours. On Wednesday, there was constructions going on.. so there was a lot of parking spaces N/A... .", "author": "Selina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-03", "description": "Food-Good\nService-Very friendly\nAtmosphere-Crowded, noisy, warm and cozy\nDrawback-It's \"Cash Only\" but there are NO signs posted to indicate this, so after a good food-induced coma, one must lug his/her self to a nearby bank to withdraw cash.", "author": "Suna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-17", "description": "I went here because some people I was with said it was the best.  We were seated right away and our food came quickly. I was starving and ordered the tuna melt and the french onion soup. The tune melt was almost decent. Pretty dry, kind of a weird color and I think they put carrots in it. It was no where near cheesy enough. The soup was downright terrible. The \"crouton\" might as well have been a piece of cardboard set on top (it was so terrible it might have really been cardboard) with a little pile of cheese on top. The soup itself was pretty flavorless. Normally, when I'm as hungry as I was, anything and everything tastes pretty good. But even this food was still lousy.", "author": "mel m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "I just got back from a great breakfast here! \n\n--Big portions!\n--Truly fresh-squeezed orange juice!\n--My pancakes and sausage were above average but pretty standard.\n--My over-easy egg was cooked PERFECTLY. Best-cooked egg I've had in years.\n--The boyfriend had the buckwheat pancakes, which he didn't seem thrilled about (never had that kind before) but I would have traded for them. They were great.\n\nThe service was friendly and efficient. We sat at the counter and I could see the goings-on in the kitchen.\n\nThis is very clearly a beloved neighborhood joint; it really adds to the delightful small, home-town feel of Glen Park. If I lived near here I can imagine coming back often. As it is, it isn't *quite* special enough to go out of my way to return, but that's the only thing stopping me.", "author": "Lynae Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-23", "description": "This place has been around a LONG time.  It's your standard greasy spoon, hangover breakfast.  During the weekend, it's insanely busy, and you will wait a while for a table.  I usually sit at the counter, and have my eggs and breakfast meat.\n\nPeople seem to know everybody here, and there are plenty of daily regulars.  You won't find anything too special here over anyplace else.  There are daily specials which seem pretty good.\n\nStop by if you are in the neighborhood!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-22", "description": "File this in the \"overlooked for way too long\" category.  In fact, I should really just go and Yelp every last restaurant in Glen Park--there's only what, like 3 more?\n\nGranted, Higher Grounds provides such a killer breakfast fix that it left my curiosity satiated, and I never bothered to trek across the street to Tyger's.  The very nonchalant facade and difficulty of seeing inside don't help either.  So, the verdict?  First, be prepared to wait outside in the cold, but take heart that the line moves fairly quickly (our total wait on Sunday at noon was about 15 minutes).  A lot of reviewers call this a \"diner\", but there's no bright color scheme, no booths, no waitresses in pink outfits.  I tend to think of it as a \"neighborhood breakfast joint\" instead...you can really feel that the locals jealously guard this place as their own.  Very much like Breakfast at Tiffany's in Portola, only with fewer crayon drawings and better food.  French toast with walnuts?  Old-school but scrumptious.  Omelettes?  Enormous.  Veggie sausages?  Available.  'Nuff said.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-10", "description": "Tyger's needs a better fume hood, because inevitably you'll come out of breakfast there smelling like a greasy spoon. Which isn't entirely inappropriate, considering that's exactly what it is. \n\nI have a friend who waitressed at Tyger's during the Unemployment Bonanza of 2002-3, and there's something about Tyger's that lends itself to that archetypal tired diner waitress brushing the hair out of her eyes, sighing while picking up yet another coffee pot off the Bunn warmer and calling you \"hon\" and \"darlin.\" Not that my friend was like that, just that it's that kind of place. It's also the kind of place that makes Glen Park such a neighborhood. There's a wall of pictures of neighborhood kids, and when a neighbor is down on their luck, they can earn tips slinging french toast to all the neighbors who show up faithfully on weekend mornings to bask in the bacon smoke.\n\nWell, that may be romanticizing it a bit. And by a bit I mean totally ridiculous. But you know what I mean. It's a diner. Greasy decent food. Cute neighborhood. The end.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-21", "description": "I've heard many a story about this place.  I went today with a friend for breakfast.  We were quickly seated, and I ordered the chicken chimichanga and eggs and my friend got the beef tamales and eggs.\nPretty standard stuff.  I had no idea what a chimichanga was, and my friend pretty much summed it up as soon as the plates arrived at the table.\n\"Frozen burritos.\"\nSpot on description.  \nAnyway, the food was pretty bland and kind of overpriced for what it was.  The beef tamales were pretty haggard looking.  The staff seemed friendly but we were ignored for awhile when we wanted refills.  However, they had Dr. Pepper!  This was exciting because I love Dr. Pepper.", "author": "Meh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-17", "description": "Slinging a FIVE with pride I am. \n\n1 Star = One word, rib-sticking-down-home-good-greasy-delights\n1 Star = Staff that remembers you and even if they don't they do a damn good job of faking it.\n1 Star = Homey local feel, in fact if you are not from the Glen Park/Sunnyside i think you get charged some kind of tourist tax.\n1 Star = Because some things are totally worth the wait.\n1 Star = Bear shaped syrup bottles, real sour cream and did we mention the hash browns?  My my my, I think I need a moment!", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-27", "description": "I love Tygers!  Tygers is one of those places you don't see anymore being created anymore.  Down home good cooking.  Today it seems everyone wants to be the new posh restaurant.  With their sleek designs, modern furniture, down tempo lounge music, and trendy wait staff that people forget there were alternatives. Simpler places.  Diners.\n\nTygers is great.  The wait staff there works frantically and efficiently to keep the customers happy.  Granted this isn't your fancy restaurant but man the brunch food is good.  The diner coffee is great.  The service is wonderful.  It is a perfect place to have a nice Sunday brunch at, and I often do.\n\nCountry Breakfast here I come!", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "I get headaches eating here.\nAlways a loud clatter, the service is always rushed and rude (whether is is bustling as usual or empty) and the price indeed can be beat.\nBut the cook is great!\nExcellent American diner food.\nHere's my best guess - the cook met the server in Vietnam or Indonesia and moved out here to open up the restaurant.\nHe must have been a cook in the service, no one else knows how to prepare such delicious food without much butter.\nIt seems to be his dream - Tyger's, while it seems to be simply her life.\nMaybe I'm building a narrative around limited exposure, maybe I'm insightful.\nThese conclusions I've drawn don't change with any visit though.\nIf the waitress was nicer, I'd ask her about it.\nI never get that chance.\nSO - great food - terrible service.\nI kinda love it.", "author": "Theo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-17", "description": "Reliably solid breakfast food. The friendly staff always sculpt a little happy face on my nephew's pancakes, and the vegetarian fake sausage is a peppery delight.  \n\nI wish it weren't cash only though.", "author": "angela n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-28", "description": "I love Tyger's! When I moved to SF 14 years ago I live in Glen Park briefly and would stop by this diner in the morning to carb up before risking my life on BART. My old favorites are the chimmichanga's and the spicy sausage. Eggs are always done right (over medium). Always get the sourdough toast.  The ladies that server up this goodness are top notch and super friendly.\n\nTyger's may not be right for those of you with refined tastes. And anyone who has watched Glen Park change over the years knows that the neighborhood has become more 'refined'? There's a French restaurant caddy corner to Tyger's for goodness sakes! That place used to be a dive bar. The Canyon market? That was a Middle Eastern grocery store many years ago - with parking! Anyway, I'm way off track here.\n\nTyger's is a slice of that old Glenn Park...the one that introduced me to San Francisco living many years ago. \n\nThese days I'll visit Tyger's once or twice a year. One thing that I always look forward to (besides the chimmichanga's) is seeing the ladies who have been serving goodness for all these years. They never cease to please me when they see me walking in and give me that flash of recognition and greet me like I've been going there 3 times a week for 14 years.\n\nI love this place.", "author": "C K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-16", "description": "Tyger's needs, um better food?  \nMe: My french toast is burnt. \nWaiter: No it's not, thats' just how it is. \nMe: Thats' burnt, and it doesn't taste right please fix it. \nWaiter: fine. but that not burnt okay i fix for you. but you no complain.\n?!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!(1)One extra point for the laugh but I mean its either the food or the service I can't decide.", "author": "fuck you p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-23", "description": "Delicious, hearty and very reasonably priced traditional breakfast fare at this mom and pop coffee shop in Glen Park. \n\nCheck out their (?) wacky website: http://www.tygerscoffeeshop.com/corp/mission/", "author": "Trinh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "I love diners.  I love diner food.  Tyger's is a perfect diner.  Big portions and the breakfast is generous and delicioso.  The place is old and looks it....it has the same kind of presswood paneling that my abuelita's kitchen had (and still does...abuelito refuses to remove it).  Perhaps that's why I feel at home here.\n\nI'll warn you, if you're AT ALL prissy, you may be offended by these shaggy-looking premises.  But then again, if you're prissy, you probably spend a lot of time being offended.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "The best neighborhood diner! Be prepared to wait in queue outside on weekends. Great specials written on the white board changes daily. Awesome pancakes and home made corned beef!", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-02", "description": "This is a really tasty breakfast spot, but it's far from perfect.  The highlights are the pancakes and the bacon, which are both delicious.  However, their omelets / scrambles and potatoes leave a LOT to be desired.  If they changed their recipes for those, I could bump them up a star or two.\n\nI used to go here a lot when I first moved to the Glen Park area, but I've since started going to Toast and Chloe's in southern Noe Valley, as I think their menus are a little bit more well-rounded.  Still, you can certainly do worse than Tyger's.  Be prepared to wait in a line on the weekends, though.", "author": "Chad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-07", "description": "When my roommate and I first moved to Glen Park, we were always lamenting everything 'the old neighborhood' had that we would never see again *sooo dramatic, lol*.  One of those places was Eddy's cafe on Divisidero.\n\nLast week we decided to have brunch together and tried Tyger's.  As soon as we walked in I pointed out excitedly that it reminded me of Eddy's.  The food was great although I wasn't too keen on the vegan sausage-but with enough ketchup anything tastes good.\n\nThe ambiance was cozy and friendly and the wait staff were attentive.  I would highly recommend this place, and it's right off of BART too!", "author": "Lily E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "Yelp, it's been a while since I've written a review - so I'm firing off another quick one to continue my reviews about breakfast places (going to do one or two more of these - sadly, I haven't been diligent about eating breakfast lately).\n\nI'm charmed by this diner - generous portions of good food at a reasonable price.  Plus, it's a cozy setting with very friendly service.  As I've been living in Glen Park for the last few months, it's comforting to know that this place is nearby for French Toast, eggs, and bacon.", "author": "Eddie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "Pancakes A+++. Prices good. Very clean.  One of the places where you have to walk through the kitchen to get to the restroom. Very cool place. A little quaint and funky. Close to Candlestick.", "author": "Tom O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-18", "description": "Pros: Great prices for breakfast, Generous portions\nCons: Service is a bit slow, can be crowded, feels like a cafeteria rather a diner. \n\nOverall: I will definitely eat here again, but in the quest for affordable delicious breakfast, this local fav falls short in my book.", "author": "Philip H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-29", "description": "Glen Park is a different place from when I moved there eleven years ago.  Back then it was definitely an old school neighborhood.  Some things have changed for the better or worse but my breakfast standby has thankfully made it through the years.\n\nThanks Tyger's-- don't ever change.", "author": "SaraMitra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-28", "description": "Love this little neighborhood gem for a weekend brunch.\n\nTerrific Turkey Italian Sausage -- a bit spicy, but delicious!\n\nOnly negative about this joint -- cash only. So come with cash.", "author": "Gil Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "This is my second time here and I'd keep coming back. It's a great breakfast/brunch diner in Glen Park. Good food, good service, and cheap. Their specials are really good and are posted on the whiteboard. Hasn't disappointed yet, and the bonus is I saw SF's current poet laureate whom my girlfriend did a research project on last month!", "author": "Lyndon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-15", "description": "This is the diner equivalent of Cheers.  Everybody knows your name.  Friendly and full of neighbors--regulars.  Not only will they remember what you like and how you like it, they will put your drink on a table when they see you crossing the street.  \n\nDiner menu.  I have found some things I like here, and stick with 'em.  Burgers, bbq burger especially, garden burger, tuna melt, BLT, club or turkey sandwich w potato salad or chips.....my favorites.  Good coffee/tea.  \n\nIt's just a good-feeling place to be!", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-25", "description": "I've lived in the neighborhood for over fifteen years and been to Tyger's maybe four times. The last visit was in January 2014. I'm always surprised at how mediocre the food has consistently remained. The quality of the food reflects the attitude of the management . . . why make improvement when business is steady? My recommendation: If you' re too hungry to get in your car or hop on your bike and go elsewhere, Tyger's is an appropriate choice. One thing that is entertaining is the Asian women who runs the restaurant who is truly the \"Tyger Mom\" with her customers as undeserving children. For those of you who like neglect and are familiar with indifference then go to Tyger's to get your familiar dose of invalidation. If you want to raise the bar and find a great place for food in a setting that actually attempts to make your experience memorable, go elsewhere.", "author": "Charlie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-13", "description": "I have wanted to try Tygers for...years, really, and finally made it over today about 1:30 p.m.  It was packed...Sunday afternoon, I guess...but husband and I were greeted and treated to a table by the window.  So far, so good.  It was smaller inside that I had imagined and no booths...still...hoping for a pleasant experience.  I ordered the shrimp salad and hubby the BLT&A, his usual no matter where we go.\n\nThere was a long wait to be served, but I'm used to that and can deal.  My shrimp, however, were FROZEN.  There were a liberal amount on some lettuce, a hard-boiled egg, pale tomatoes.  I couldn't quite get over the frozen seafood.  No one came back to the table to inquire, so I just picked around the salad and tried to \"thaw out\" the shrimp with friction from my fork.  Not fun.  The BLT&A got good reviews, although he said it needed more mayo...but that is a personal taste.\n\nMight come back for breakfast, but no more shrimp salads for me, that's for sure.  Sorely disappointed.", "author": "Susan V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-05-31", "description": "Every neighborhood needs a corner coffee shop, this one needs a remodel.  Its always crowded, especially on the weekends for breakfast but my gut feeling is it is convienient rather than beloved.  \r\n\r\nThumbs UP: Glen Park's only classic breakfast joint \r\nThumbs DOWN:  Gravy colored walls and so-so food.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-25", "description": "UNPRETENTIOUS!!\nTyger's is a wonderful neighborhood restaurant with yummy food at great prices. The staff is always warm and friendly. Most of the customers are regulars who are greeted by their first name from the waitresses who have worked there forever. My husband I and go in there almost every weekend for breakfast. Their pancakes are my favorite in San Francisco!! For less than $7, you can get eggs, your choice of meat or vegan sausage like me if you're a veg, and pancakes so big they need their own plate! Also, the restaurant is full of normal, non-hipster folks who are interested in good food at good prices instead of the decor. It's usually crowded on the weekends, but I've never waited more than 5 minutes for a table.", "author": "Cindi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-20", "description": "The food isn't spectacular by SF standards, or even, say, Indiana standards. Actually, \"standards\" would be a good word to describe the menu, which primarily consists of American classics. Western omelettes. French toast with walnuts. Patty melts. Freedom fres. The stuff we started liking when we were three years old.\n\nAnd the safety of the menu is part of Tyger's charm. It does feel a wee bit like chowing in someone's home. The wall behind the cash register is plastered with photos of neighbor kids and pictures of tigers, the feline type. \n\nYou won't be wowed, but you'll come back.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "We came here a little after 12pm, there was a small wait, but wasn't too bad.  This place is small, 14 tables total.  I had the hot sausage omelet, it was delicious.  HUGE portion for under $10.  I will def. come back.", "author": "Oriana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-02", "description": "I live in Glen Park and had never gone. I know I know, what the hell is wrong with me? Given the fact that there are a total of 6 or so places to eat in GP it's absurd that today was the day.\n\nWell, if their sign wasn't so misleading, things would be diff't. I probably would've eaten there 50 times by now. Thing is their sign says \"coffee shop\" and that's misleading because you can get a burger there. I don't know of many coffee shops you can get a burger at so I just assumed the joint was a straight coffee+pastry joint.\n\nWell, I was wrong. It should be called Tyger's Diner because that's what it is. It's a diner.\n\nAnyway, I go in today, rock a french toast combo breakfast with a coffee and it was straight. Pretty good, not mind blowing.\n\nFrench toast combo = french toast, 2 eggs, and your choice of meat (I went with sausage).\n\nFrench toast: B+. Pretty good, not \"holy-shit-this-is-blowing-my-mind.\"\n\nEggs: C. Should've gone w/ over-easy. The scrambled were kinda sub-par.\n\nSausage links: A+. \"Holy-shit-these-sausage-links-are-blowing-my-mind.\"\n\nOverall, it was a solid diner breakfast experience. Will definitely go back.\n\nBTW, my combo+coffee came out to $10 and change w/o tip. Bit pricey, but not steep.", "author": "Gil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "I came here with a good friend of mine 5 years ago and I still remember it to this day for some very strange reason. I came here with another good friend of mine and the food was still good.\n\nI ordered the bacon, swiss, and mushroom omelet and it came with a side of home fries. I love me some potatoes and I was actually going to order a side of them after seeing people eating them at other tables but decided not to as I was looking for hashbrowns (which they don't have any). I don't think they mentioned it on their menu that the omelet came with potatoes but it worked out in the end. The omelet was great; the bacon wasn't overly salty and the egg still had a spring to it (I don't like runny omelets or overcooked omelets). It was definitely good and I could see myself ordering it again.\n\nMy friend ordered a rueben sandwich and although he said he liked it, it didn't look that appetizing to me personally, but I'll take his word on it. My friend lives nearby so he frequents this place pretty often so I'm sure he knows more about this place than I do. Overall, the service is pretty good and the food is good so I definitely see myself coming back again.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "\"Oh my God. It's SO FLUFFY. I'm gonna die!\" Yes I'm talking about the pancakes. The pancakes are not only HUMUNGO JUNGO but they are SO FLUFFFFY! I got bacon, eggs, and buttermilk pancakes. The prices in this place is LEGIT! Very cheap. Very tasty. Worth the money. \n\nIt's a small area and pretty diner feeling. It's pretty janky setting but w/e. The pancakes are SO FLUFFY! I can't say it enough. If you're in a pancake craving mode, then Tyger's is the place to go. Best pancakes I've ever had. I got full off of that bacon, eggs, and pancakes meal. I'm a big guy and it takes a lot to fill me up. Those two slabs of pancakes alone would have gotten me plump like a Foster Farm Chicken! Ahhhhhh, it's so delicious too. Yes I've only been there once but it was an amazing experience. \n\nFast service. It's on a corner, so parking might be hard to find. But yeee dog.", "author": "Philbert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "A no-frills greasy spoon that services with a smile.\n\nI had the walnut french toast served with a mound of melting butter, I looked for the syrup - nowhere to be seen!\n\nI caught the honey bear container in the corner of my eye, that usually is filled with honey - but gotcha! Filled with syrup, the rest of the meal went swimmingly...", "author": "wayne s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-10", "description": "I want to love this place since it's our new neighborhood local breakfast joint. But the last couple of times I've been there, I couldn't even finish my omelette. It just wasn't good. Dining companion felt the same. Bathroom way in the back is pretty nasty.  Breakfast usually isn't that hard to mess up, and I love lots of diner food.  I don't eat pancakes, I'm sure those are likely better than any of the egg dishes.", "author": "Megan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-23", "description": "A decent place, in every sense.  I love the cheesy pictures of tigers, the never-changing menu, and the pictures of the Diamond/Chenery intersection years ago.\n\n     I live nearby, and I dive in here whenever I need to just relax and fill my stomach.  Many mornings I sit down, read a book, and eat a pile of bacon, mushrooms, and swiss cheese loosely wrapped in an omelette.  Sometimes the food seems bland, espescially with a taqueria like La Corneta right down the street, but there is a rack of boutique hot sauces under the register if you want some kick.  I'll probably keep dropping by, when I'm in a neighborhoody kind of mood, but a city like this one has a lot more to offer with a little bit of effort.\n\n     This is my first review, so tell me what you think.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-03", "description": "Summary:\nI would go back for breakfast again. It is worth a try if you are in Glen Park.\n\nMy Story:\nStopped in on a Monday morning after picking up my dry cleaning. Got a Pumpkin and Walnut pancake which was good. You get two big flap jacks that are heavy for about six bucks. I got the food to go but the lady was nice about ringing me up and getting the food to me quickly. I ate one right away and saved the second. After cooling off in the fridge all day, the pancake was like a desert. Real good but not something you can eat daily.\n\nOrdered:\nPumpkin and Walnut Pancakes", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "This was a solid, yummy greasy breakfast. My husband had the french toast and didn't like it (too cinnamony not much other flavor), but I had buckwheat pancakes that were fluffy and awesome, even if they had way too much butter on top. Very generous servings- your basic greasy diner food. Bacon was good, sausage was eh, like out of the package Jimmy Dean style. I thought the coffee was pretty good.  Service was fast and friendly, you can tell they have a dedicated neighborhood clientele.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-12", "description": "So good it is making me re-rate my other diner reviews.  \n\nEvery time I come here the service is quick and friendly.  If I have to wait, it is never long enough to annoy me.  I'm always pleasantly surprised by the vegan sausages (not necessarily their quality, but the fact that they're available).  Quick service, great collection of hot sauces, reasonable prices, a bar section - everything I require in a diner.\n\nI just wish there were formica tables - a diner just ain't a diner without them. \n\nThat and I just never can get used to places where you have to walk through the kitchen to use the bathroom.  I know space is a premium, but it really puts into perspective my level of hygeine (medium to low) and its relation to everyone else (usually lower than mine - of course).  Ick.", "author": "Mat K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-22", "description": "I get that this place has been around forever has a dedicated following that goes back generations.  I'm just not one of them.\nI found their food to be mediocre at best.  The menu is blah, nothing new or different and much of it was greasy.  I do have to give them credit for the bacon, which was super crispy and thick, just the way I like it.  But, everything else...I'll pass.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "Excellent greasy spoon. Great coffee, delicious food, large portions. Very friendly staff / owners. The only drawback is that on weekends you can expect a line outside.", "author": "Angel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-17", "description": "They make one of the best fluffiest pancakes I have ever eaten.  Waitresses there have been working for years.  Service is quick and friendly.  This place is my favorite breakfast place to get some delicious tasting pancakes and their french toast are delicious!  I feel like my meals are always hearty and orange juice is yummy delicious.", "author": "pengrin .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-21", "description": "Tyger's is a place I wrote off after my first visit as being just another greasy spoon, one that offered little, if anything, I wanted in my mouth.  But then I went back on a whim and everything was different for me this second time.  \n\nI can't recall what I had exactly on that second visit to change my disposition toward the locale, but my attitude was different.  Maybe it was the variety of meat options available as a side to a couple of eggs--how often do you find turkey bacon on a menu of an average diner?  \n\nMy best experience ever at Tyger's was when I enjoyed a plate of hot  pumpkin pancakes.  It was a special, one that comes and goes, but if you ever are lucky enough to be in Tyger's when they are serving pumpkin pancakes, try them.  \n\nThe service is friendly.  The place is clean.  The is usually a wait by 10:00 am on the weekends, but the service is speedy, so the turn over is quick too.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-08", "description": "Only had to wait about 10 minutes to get a seat on a Saturday morning, which I don't think is too bad for a breakfast joint around here.  The food was worth the wait.  EGGS AND MEAT. That's what I like in my breakfast, and lot's of it.  And I want tons of flavor in those eggs and meat.  \nThey delivered.\n\nFor once though, I would love a normal, run of the mill breakfast place to have delicious coffee.", "author": "Levi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-02", "description": "Solid breakfast place - nothing fancy, just large portions of American food.  It's perfect after a night out, when you're tired and hung over.\n\nTheir lunch is also pretty good. I've only had the Veggie Melt sandwich - a grilled cheese with fresh vegetables and avocado inside it - and it hits the spot.\n\nOverall - if you're looking for a nice brunch experience, this isn't the place, but if you want a solid, reasonably-priced, breakfast, Tyger's is the place to go.", "author": "Sekhar S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-23", "description": "well executed standard breakfast.  coffee from the 1950's (cuppaJoe-style). Bacon is half pre-cooked, so arrives quick and crispy, but grease-soaked and not hot enough.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-03", "description": "Tyger's is an awesome breakfast spot that is conveniently located down the block from my house. I always get either an omelette or a burger (bacon, avocado, mushroom) with a side of awesomeness a.k.a. Tyger's home fries. The portions are very generous and the food is always fresh and delicious. The people that work here are great. One word to describe the service is welcoming. I always feel at home at Tyger's. The food comes out very quickly and always with a smile. Oh, and yes there usually is a line going out the door, but since I can see the front of the place from my window I dash down the block and cut in front of people trying to get in line. Suckers, me first.", "author": "Alexander C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "It has been said but i will affirm.  Good greasy hangover fix.  For some reason, i crave good brewed ice tea the morning after, and they had that so i was pretty much set.\n\nI have a veggie omelet, and the veggies were all nice and crisp which like.    I could have used a few more potatoes tho.\n\nDecently cheap, and there was no wait on a friday morning which was awesome.", "author": "Darryl S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-02", "description": "When I was living in Glen Park, going to Tyger's felt almost the same as rolling out of bed & walking into the kitchen.  It's that cozy, that comfortable, just like home.\n\nIt's not the food, not the service that keeps you coming back.  It's the feeling that this is a comfortable place to be.  Sometimes that's more than enough...", "author": "Seth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "Friendly staff and affordable breakfast made to order - a great neighborhood gem.", "author": "Bradley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-07", "description": "A fabulous, affordable, classic greasy-spoon style diner. Love the staff. They're busy but they'll get to you. Just bring your check up to the counter for a faster exit. Everything from egg scrambles, omlettes, sandwiches, fries, and pancakes are yummy. I especially like their turkey sausage links, which seem spicy but not too salty and greasy.", "author": "Lotion M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-10", "description": "The best word to describe this place is \"bleh\".  If I am hungover it is actually decent otherwise almost unbearable.  The prices are affordable for the neighborhood and the service is fast.  The food is just not very good.  \n\nOnce the eggs in my omelette were undercooked (ewwww!).  Since I know I will be back one day, half drunk and desperate for pancakes with a half a cup of margarine on top, it is only fair to give it 3 stars.", "author": "Jessica E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-03", "description": "This place is the best. i have been coming here for over 10 years now and they still remember my name. I could skip out for months and when I come back BOOM they cal me by my first name. I have tried nearly everything here and will tell you that the specials are worth giving a once over. They have great sausages, omelets and even burgers.", "author": "E T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-27", "description": "Standard diner fare, served without attitude or pretension.  Hearty and filling, it is all that you want it to be and nothing that it is not.  The price is right and it's not so nice a place that you want to read your paper there, taking up valuable eating space...  Eat and get out and let the people in line follow suit.\n\nWhile I will not roar about Tyger's, it gets a contented purr and a happy meow from me.", "author": "Tony A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-05", "description": "I rolled up in this place with a toddler in tow and the diner/cafe completely packed!  I was sat next to the window, which was nice.  People watching!  The bus boy quickly took my carriage and stowed it away and brought me an old, but working fairly well, high chair.  \n\nOur server was very busy and was short with me, but I quickly ordered a sandwich and a ground burger for the tot.  Lunch came.  I was disappointed with the sandwich and the ground burger was not that.  It was a whole patty, but I faired ok.\n\nI don't know, I felt a bit rushed and I felt the service was not that great.  A bit disappointing, but I guess I can understand since she was slammed.\n\nI would have given it 4 stars if our server would have been a tad more attentive and if my sandwich had a bit more meat.  The meat was scarce and I suppose I should have said something.  But, time is of the essence when you're with someone at the age of just one.\n\nProps to the lady who came over to help me figure out the dinosaur highchair.  Thank you!!\n\nDoubt I'll be back again, but everything is worth trying at least once.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-11", "description": "I lived across the street and I loved the convenience of the place. Other than the convenience factor I really would not venture from another side of town to check this place out. The food is very cheap which is great, but the quality is ok. So all in all if you live near glen park check em out.", "author": "J B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "This place is super packed on the weekends. It's a little to cramped for my test. However the food was quite good. The service was quick and friendly. The turkey sausage is yummy.  Just get in early. Otherwise you have people hovering over you while you eat.", "author": "Sandy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-11", "description": "I have to admit that Tyger's has some REALLY GOOD breakfast! I live right up the street and my boyfriend & I ALWAYS go here for breakfast. The omelettes are amazingly good and I love the \"specials\" they have! I've been to other places that sell the same omlettes and no where can compare to Tygers. However I had to give it minus 1 star because service there COULD be better. Here are my reasons:\n\n1. When it's JAM-PACKED (and it does get like that OFTEN.. sometimes people wait in line outside the diner for 30+ mins!) and you want to order a \"TO-GO\" item.. the wait is FOREVER! I waited about 45 mins for my to-god! UGH.\n\n2. The ONLY GUY waiter there is NOT an example of good customer service. There was one time when my boyfriend & I ordered a omelette w/ potatoes.. the potatoes there ALWAYS taste RAW AND UNDERCOOKED so we asked to make them extra cooked/cripsy whatever on both of our orders and he said \"OK, ONLY ONE THOUGH BECAUSE IT TAKES A LONG TIME\" You just DO NOT say that to a customer.. that's RUDE!\n\n3. They have gotten my order wrong quite a few times. Once when I ordered a to-go burger for my mom. I wanted it EXTRA WELL DONE AND I EMPHASIZED NO RED AT ALL TO THEM & WHEN I GOT HOME IT WAS STILL RED. There was also another time when I ordered a omlette (TO-GO) and the omelette automatically comes with toast. I said I wanted english muffin and when I got home, the toast wasn't even there! Nowadays when I go there I just make shure that it's there before I go so I can catch them right then and there if something's wrong.\n\nRegardless of their wrongdoings I still don't let it stop me from going there because their food is A+! The great tasting food makes up for the not so good service. :)", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "Great place to come for a classic breakfast. The pancakes are great and so is the chili.", "author": "Andres M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-21", "description": "Tyger's makes a decent breakfast, and the staff is nice. \n\nHowever, one word of caution: avoid the meatloaf sandwich. It looks and tastes like crap. Or order it and see for yourself--and let me know what your thoughts are on what it's made of. Even though I had no idea what was in it, I put some tabasco on it and ate it all, but that's because I'm a goddamn cheapskate, not because it was edible.", "author": "AJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "I truly believe that decent breakfast places are like public utilities; their presence in all districts is to be expected, like hydrants or mailboxes. In fact the more low-key they are, the better. Nothing fancy-schmancy here. Check out the favorite start to a weekend morning--not-too-early seating at Tyger's, crispy eggs sunnyside-up, pork sausage, buttered pancakes, and cheery buzz from neighbors talking, smacking lips, rustling the Chronicle. The word neighbors here is important because though I love the food and the ambience you might not get it. To each her own. You might ask, What's the big deal? Friendly efficient staff, neighborliness, traditional American breakfast (tasty and cheap) is what. I got mine but, sorry to say, you'll have to find your own perfectly comfy morning cafe. Ask for extra butter if you must. Coffee keeps a-coming. Check out multiple hot sauces shelved low near the counter.", "author": "John T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-14", "description": "I would put Tyger's in the category of \"greasy spoon diner\". It's like truck stop food. If you think of it in this vein you won't be disappointed because it's decent truck stop food...", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-05", "description": "I still love this place.  San Francisco is so inundated with new, trendy, and pricey places to brunch/breakfast, sometimes you need a break. Tyger's is old San Francisco to me and very comfortable.", "author": "A R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-05", "description": "Bar none, the best pancakes in the city...and they have buckwheat pancakes, too.  This place is not frilly or refined, but what it does wonderfully is old school delicious breakfasts.   I've been eating there for 20 years, and they're consistently delicious.  Wish they offered eggs benedict on a regular basis...the only complaint.", "author": "Julie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-02", "description": "I liked Tyger's because it is so unpretentious.  Plus since I don't eat red meat I really appreciate the abundance of turket bacon and sausage choices.  I love their Club Sandwich that is made completely from turkey products (ham, bacon and turkey slices!).  Get it with fries which are perfectly hot and crunchy.  Hot sauce lovers note: they have about 25 different hot sauces available for your enjoyment and sampling.", "author": "Xander S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-30", "description": "Great breakfast place, love the home fries. I been there like about 5 times, I usually try something different on the specials menu.  Totally dig the different  flavored pancakes.", "author": "Harold G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-29", "description": "As a Glen Park resident, I love coming to Tyger's on a Sat or Sun morning.  There is often a line outside on the weekends, but this restuarant offers a perfect combination of great breakfast food, unique specials and a homely, neighborhood feel.  \n\nThe food is not particularly fancy, but it is well done and the staff is very friendly.  You cannot go wrong with the daily specials.", "author": "Niraj P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-20", "description": "Cheap, quick, decent breakfast.  Old school diner type place.  The cool thing about this place is their extensive selection of hot sauce.  I mean, this place has about 30 or 40 hot sauces to choose from and some of these hot sauces are EVIL, so use caution when experimenting with them on your scrambled baby chickens.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-18", "description": "Another weekend, another breakfast joint. Ventured out to Glen Park this time for my San Francisco breakfast explorations. My friend recommended Tyger's and was like it's just a classic diner, which it is, and I love it! They have all your standards and you can tell it's just a family run establishment and all the people who come here are from around the neighborhood and have been coming here for ages. Love it!! I had the bacon, avocado, sour cream omelet with home fries and sourdough toast. Service is fast and efficient and their home fries in particular stood out. Crispy on the outside, soft on the inside with bits of garlic and onion. Really tasty! We didn't get the pancakes but saw someone who did and they were HUGE and fluffy and smelled amazing! Next time I'm getting the pancakes.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-06", "description": "I love this place, LOVE, LOVE, LOVE! They have awesome omelets and the walnut raisin waffles are AMAZING!", "author": "Michael F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-14", "description": "i love this place, its totally OG. ive been coming here since i \nwasn't even born yet. a good mix of old-san francisco people like school teachers, funny lookin old people, people with children and filipino people.\n\ni like when they have country gravy over TOAST (F over biscuits).\n\nHorrible coffee (some of the worst in the city, sometimes tasting like a dirty dishrag)\n\ninconsistent (albiet fresh squeezed) orange juice. sometimes they just happen to use not so tasty oranges.\n\nover-all all people should try tyger cafe once.", "author": "christopher a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-12", "description": "This place gets 5 stars because I feel it has perfected a form... the coziest diner, friendliest staff, fastest service, and best diner-style food. It really shouldn't be compared with some fancy schmancy place twice the price. There was a 2 minute wait on a Saturday morning, and DELICIOUS food- we had the pumpkin-walnut pancakes and corned beef hash, with nice strong coffee, for about 15 bucks. Now, if only I could afford to live in Glen Park.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-21", "description": "I had lunch here for the first time and I went to sit down on my seat and sat right down on a pile of sour cream ... nice.  The waitress apologized and immediately began to clean up the mess that was missed when the table was cleared :(  I had a tuna melt sandwich which was very tasty but didn't come with any sides (which had to be ordered separately).   My friend had the Reuben and she really enjoyed her meal as well!", "author": "Shaw Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-04", "description": "Like previous Yelpers have said, the portions are large.  The food is very good and very affordable.  It is a standard bare-bones neighborhood coffee house with good home-style food.  You can't go wrong with a visit to this place.", "author": "Marjorie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-14", "description": "I've come here for breakfast and lunch a few times in two years. The service is excellent, the food is good, and the prices are consistent. It's your basic greasy spoon diner-type establishment. It's that small-town, remember your name, butter-comes-in-a-small-cup, kind of place. Hung over? Great! This is where you go. Early morning and later mornings towards lunch seem to be the best times to come.", "author": "Christian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "Come to Tyger's for classic diner breakfast. The portions are generous. The staff is real. And the chicken sausage is waiting for you. I'll even have pancakes here and I'm very picking about my breakfast food.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-25", "description": "Tygers is one of my favorite diners in SF (and that's saying a LOT because I love breakfast).  I sit at the counter and get great attention from the woman there.  This place is always busy on the weekends (and they are only open for breakfast/lunch), but the wait is never too bad.  When  they have the eggs benedict on the special menu, don't miss it!  Always check the white board for specials, they are consistently good.  This is worth a trip to cute little Glen park.  Only 1 block from GP BART.", "author": "Dayna V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-12", "description": "A great neighborhood spot for some classic breakfast items. Nothing fancy, just decent food.  The buckwheat pancakes are great (without the gigantic dollop of butter of course).", "author": "Romeo And Lola K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-11", "description": "Tyger's is crowded, but I've never had to wait that long.  The service is friendly and efficient, and the food is good.  I really like the apple pancakes.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-15", "description": "The food is not really that great.  It reminds me of stuff I can make quickly at home.  There is a long wait.  The prices are too high for what you get.  If you are looking to be surrounded by many people, then maybe this is for you.  But as far as the food goes, noo, skip it.", "author": "see y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-22", "description": "Tyger's is dependable in that Mom & Pop way. The food is good; solid takes on diner fare that make some accommodations to California palates (like turkey bacon instead of the regular stuff and no fear of avocados). The potato salad is a little on the sweet side for my taste, but they get points for using Dijon instead of American Technicolor. Also, they serve Crystal hot sauce at the tables, so they definitely get extra points for that. Pretty good pancakes and french toast, too. Be prepared for a wait on weekend mornings.", "author": "Alberto Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "Good old fashioned greasy spoon at its best.  I'll be honest, I've only ever been here when I was hungover, but man does it satisfy barfy stomach.  The special pumpkin walnut pancakes are incredible, they should put them on the menu full time.", "author": "Caleb R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-07", "description": "it's not really the best, but i can't give tygers anything under 5 stars. i love it here. i have literally been coming here since birth. i went recently and had the andouille sausage with potatoes, eggs, and toast. HUGE ass plate, stuffed myself and it was like 6 bucks. \n\ni like this place because there are so many different kinds of people that come here and the lady who works here is great. she has framed photographs of her kids on the walls too.\n\nsuper fast service.", "author": "Samantha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-08", "description": "Best pancakes and I usually don't even order pancakes but I eat these ones!\nGet the pancakes you will not be disappointed they are so good.", "author": "Judy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-28", "description": "I have eaten here many times before, like most Im a local to the area.  But the last few times the food has gone downhill, and today's experience had me look up Tygers Cafe on yelp to see what people are saying about it.  Seems like most support this place because its local to them, and they have a relationship with the owners, but that cannot be a reason to give this place 4 or even 3 stars. The food is greasy, and loaded with butter. I watched Suzy scoop butter of pancakes, blot it with napkins and proceed to serve it to customers. They manage to ruin eggs for me the last 3 times I have  been there, and the service is mediocre at best. There is no quality to the food- if you dont believe me take a look at their \"splenda\", jelly, and hot sauce-all cheap no name brands that lack quality. They seem to cut corners but the prices on the menu do not reflect that. Im not saying its expensive, just comparable to many other QUALITY breakfast places. I can say I will never go back to Tygers after todays experience- which is a bummer because its within walking distance.", "author": "Ken A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-01", "description": "People line up outside of this place on weekends, and I don't understand why. Okay, I've only eaten there once, but it was enough to know that the food Tyger's serves is strictly mediocre. Not to diss them -- it's a real neighborhood spot, and the same customers eat breakfast there every morning. It's a nice place to have around, atmosphere-wise, but I seek my brunches (when I do manage to get up on Saturday or Sunday in time) elsewhere.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "I'm here to defend Tygers.  Okay, okay, it may not look that great from the outside or the inside for that matter.  But here's why it deserves four stars: the food is good, they give a lot of it, and it's fairly cheap.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "I enjoy tygers in the morning after wild parting the night before. Its perfect hangover breakfast. I also enjoy the waitresses, they have been there forever.", "author": "Francisca H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-23", "description": "Tyger's is tasty and a good place to meet up with friends for a slow breakfast. This is a decent meeting place where you can linger and talk for a long time.  Not a \"city\" place, reminds you of the suburbs.", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-06", "description": "Breakfasted there today with my gf. Paula  nice, quaint, Glen Park area spot. We ordered a full stack of the buckwheat pancakes and a shrimp, spinach and sour cream omelette.  The pancakes were by far the best, as the omelet was runny and not really good at all. Nice place, very reasonably priced. They do not accept credit cards as well... which is always a bit of a drag because honestly who carries cash with them now? But thankfully BoA and Wells Fargo ATMs are literally steps away, so it's not so bad.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-28", "description": "Very homley type meals. I used to go here on a regular basis with my master's rowing team for Sunday Brunch. No better way than to rack up all those calories we just burned off rowing for a few hours. Ohh I love it =)", "author": "Alia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-22", "description": "I have been coming here for years for their breakfast standards.  I started coming back again with my bf who, like me, loves their fluffy pancakes.  This is a reliable place for us to go on lazy weekends.", "author": "V B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-12", "description": "Even in sleepy Glen Park, you can find a good breakfast and a reasonably priced burger. The service at Tyger's is amiable and efficient even in crowded situations. And yeah, the decor is a little behind the times, but not everyone has an inner interior designer or can afford to hire one.", "author": "Be N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-29", "description": "As a native of San Francisco, who may have been temporarily displaced elsewhere, I have to say, HERE'S TO THE GREASY SPOON. Having seen the city go through so many transformations, and knowning that we are a foodie institution in the country, you gotta give it up to greasy spoon's like Tyger's that uphold some of the old school, traditional character of this city! Tyger's has that for me. Yes they have weird takes on California cuisine (chicken enchilada's and eggs, that is truly something I see my self eating while intoxicated or as a poor college student) the food is decent diner fare great pancakes, specials, the hash(!) and scrambles. It's truly disheartening to see people so against places like these, especially ones that didn't let the dot com bomb disrupt their flow.  To Tyger's!", "author": "Niki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "this place always reminds me of the small roadhouse diners i remember eating at during vacations \"up north\" as a kid in wisconsin. wood paneling, family run, hearty breakfasts make it all a worthwhile trip.\n\nlots of syrup, ketchup and hot sauce on the tables.\n\nridiculously good hot chocolate for coming out of a machine.\n\nfair prices and frequent coffee refills.\n\nplus they have veggie sausage, just to remind you that you're in sanny franny.", "author": "Joanna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-29", "description": "It's a great neighborhood spot for a big breakfast and the coffee is very good.  It's not a gourmet delight, but the food is hearty and there's LOTS of it.", "author": "jill c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "Good ol Tyger's.  What can I say that everyone else here hasn't already?  Great food, great environment.  Little jam packed, and feels a little cramped at times, but then again I'm 6'3\"", "author": "Sean V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "Great food , great service. You get the feeling your in the sticks when your here. The interior has not been redone probably since the place opened ,oh around sixty years or so ago..?", "author": "Jack O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-01", "description": "This place is not the best and its not that cheap but if you live near by its not bad. The foods good but when I lived near by I would jump on the bart and go somewhere else.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-26", "description": "As a night owl, it takes a lot of persuasion to get me out of the house at a decent time, particularly on the weekends when I am even more lazy (is that possible?) But Tyger's has the fluffiest egg omelets ever and the staff is friendly, prices are fine, and like some other reviewers have said it is just a great place to eat without being trendy, so overly self-conscious, and all that other frou-frou crap. Do not come here expecting a hip brunch with mimosas, it is just well done eggs, pancakes, sausage that kind of thing. And yes, parking is quite limited at Glen Park. It is very close to BART and there are several bus lines as well.", "author": "Empress C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "My friends used to live up the street from here, and there were many a times when we go to tyger's for hangover goodness. tyger's is you basic semi-greasy breakfast joint with good food. The only complaints that i have with this place is they're cash only. This place is relatively small and if you don't get there at the crack of dawn on the weekends, the wait can be almost 30 minutes.", "author": "Lynette R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "awe, i love glen park.  i lived there for 2.5 years, and they were absolutely blissful.  in part, to sunday mornin' breakfast at tyger's in my jammies.\n\nsmall place, so you have to wait outside, but if you time it right, you can walk on in.  i often just go and eat there alone while reading the paper.  the wait staff is so great.  they've all worked there for FORever and so it's got that home feel.  you know, pictures of everyone's kids up on the wall, ect.\n\nfood is yummy.  pretty much traditional american cafe food, cooked anyway you want, and always to perfection.  \n\nthe best part about location, is the glen park canyon is right there!  so i always like to eat and then take a nice walk in nature to let it all settle :-)\n\ncheck it oooooooooout!", "author": "nzingha s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-24", "description": "Sincerely good greasy spoon fare.", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-04", "description": "I love Tyger's for what it isn't!  It isn't fancy, it isn't pretentious and everyone is treated like family.   It is a true Mom and Pop from a bygone era.  Most importantly - even after all this time - the food and smiles come in healthy portions.  Any given Sunday - I'll be there!", "author": "Dean F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "I like Tyger's quite a bit.  My husband has been going here since he was a lil' one, and we like to go whenever we can. Fwiw, when my parents visit from Atlanta, this is their first stop in SF!  Try the rasberry or punpkin pancakes.  They are delicious!", "author": "Mairin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "Tyger's is exactly what you'd want in a neighborhood diner; the kind of friendly, reasonable, and reliable place that inspires loyal devotion.  We've been Sunday regulars for over a decade now, and when out-of-towners visit, they don't just come to see us or San Francisco -- they come to have breakfast at Tyger's.  A good-weather weekend means you may have to wait for a table, but it's never long and always worth it.  Cash only, but within a couple of blocks of Wells Fargo, Bank of America and Citibank ATMs.", "author": "Danny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "This place is great for a diner-type breakfast. But the food is better quality, their sausage links are awesome and their burgers (yes I am still talking about breakfast) are mighty tasty. Also they have a surprising number of chalkboard specials, and I've never had a bad one.  On Saturday morning you might have to wait out front for ten minutes for a table, but doesn't that just make everything taste better once you are finally seated? This place is solid, no frills, you won't leave disappointed.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-28", "description": "The breakfast here was okay.  It wasnt horrible but wasn't great.  I'd give it 2 1/2 stars instead.  Place is small and packed on a Sunday brunch.  Food was overly greasy.\n\nIf your looking for a good breakfast joint, go to Howards Cafe or Art's Cafe in the Inner Sunset.  I guarantee you'll taste the difference.", "author": "K T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-11", "description": "This is a good place for a cheap, but tastey meal. The menu is mostly breakfast foods, but they serve it all day long (at least through lunch). All sorts of burgers and sandwiches too. Simple, unaffected diner type place in a nice little neighborhood.", "author": "Caitlin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Awesome eggs and burgers. Can get crowded on weekends but is worth the wait. Staff are friendly and ready to refill coffee and water with a smile.", "author": "Tony J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-13", "description": "This place is always good.  Every Sat and Sun there's a line around the corner trying to get into this place.  Great breakfast!!  Worth the wait.", "author": "Ryan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "this is a five star basic fare breakfast joint. if you have to scan the menu for something not considered basic fare, you are at the wrong place.  eggs toast pancakes bacon keep it simple and you wont be disappointed.", "author": "pablo p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-06", "description": "I agree with most of what's been said here.  Really good American style diner food.  Breakfast and lunch is dependable, fresh with large portions. Service is swift and no frills.  There aren't too many places like this around anymore.  Reasonably priced also.", "author": "LA T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-13", "description": "5 Stars for Tyger's pancakes.  Been around the world, eaten lots of pancakes. No place can hold a candle to Tyger's.  When (and if) I get to heaven, I'm sure it'll be very nice and all but I doubt they'll have Tyger's pancakes.  Oh, and they're fast and friendly.", "author": "Colin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-02", "description": "I guess I'd describe Tyger's  as a typical greasy spoon breakfast joint (not that it's dirty, just that type of ambience), but with a slightly more interesting menu (spicy italian sausage breakfasts, etc)... \n \nGreat bacon & french toast", "author": "Nose Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-14", "description": "This place is ok, full of regulars but honestly the food is just ok. I'm a little suspect of a breakfast place that can't properly cook an over-medium egg. For syrup they use the cheapest corn-syrup based syrup---for the prices they charge they could upgrade to a better syrup, that would help!", "author": "meg o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "Good breakfast and prices. The pancakes were yummy.", "author": "m m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-23", "description": "You don't go to a place like this expecting fine cusine, nor expecting to be able to order something vegan. Surprise of all ages though, there is vegan sausage on the menu! And it was delicious! Sometimes you just need to get out of the neighborhood, and Glen Park is great for imagining your alternative suburban lifestyle. What I like about the corner where Tyger's is located is how much is reminds me of a small Yorkshire town in England, apart from the lack of brick or cobblestone (and teenage moms) - a tiny cluster of shops and cafes in tiny buildings up and down a series of twisty hills, except with a gourmet health food store where 50% of the customers are yuppies, Russians, or both, a tapioca internet cafe and pleasant, nevermind tolerable, weather. The \"y\" in the name along with the greasy generic food and atmosphere of the place really brought me back to my days in the industrial North. Except the food is way better, and there's no way in hell you'd get vegetarian sausage OR fresh fruit in a place like this in Leeds or Sheffield, or even London for that matter. That said, it cost $10.50 for the said fruit and sausage plus some home fries. I can't in good food-loving conscience give it anything more than three stars because while it's not terrible, it's definitely not amazing, and clearly, they're just not looking to create the best food ever. It's the general mood of the place you're after here, a cozy, sweet, elderly, anachronistic trashy-yet-homey traditional cafe-diner, or in the words of the owners, a place with \"uniqueness and quasi-quaintness.\" (what?)", "author": "Jessalyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-15", "description": "Best unpretentious breakfast in SF.  I challenge you to find me a place that has better pancakes.  If you like tofu or bree in your breakfast, it's obvious this isn't the place for you.", "author": "Jose W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "good breakfeast always eat here when in sf. if they banana pancakes jump on them", "author": "Tom M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-22", "description": "The food isn't fantastic, just basic diner food with some hits and some misses, but the place and the owners are nice and down to earth. A very comfortable place to bring friends and family.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-13", "description": "Tygers is not that greasy of a greasy spoon.  On weekday mornings you see the same old-timer regulars.  Buckwheat pancakes are great.  Waitresses very peppy.  Good prices, nothing too fancy.", "author": "Christine N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-25", "description": "5 stars? Tyger's is a standard ma and pa with a gum chewing waitress (actually no gum, but she does say \"Sweetie\" now and then), satisfying breakfast fare and really bad coffee. Reliable standards with heartland condiments (Kraft Mayo, ketchup, etc). The usual artery clogging brunch. It's great advantage is that it is neighborhood and unpretentious. Lots of kids, tables that can take larger parties and no reservations. No laptops, or not yet. You go there to eat. Sunday papers ok. Tuna melts and BLT's are just that: Tuna melts and BLT's. Decent pricing, nice old hippie owner and a counter with stools. You wouldn't have to drag me there with ten horses, but on the other hand, I wouldn't take a detour. There are a bunch of decent locations in Glen Park, and West Portal. Small groups only.", "author": "Otto S."}
