{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "It's a love/hate thing.\nLove all of the free food samples, hate the idea that there is no alcohol being served. Love that there are plenty of great dive bars and restaurants on this street, hate that they are sooooooo packed!  One of them we went into to use the bathroom and to get to the bathroom was a half hour long adventure!\nI don't recall them having port-a-potties either.\neep.  I would say, if you're in the area go for it, if not... it's not too great. It's a meh for me.", "author": "Sara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Felt like a college fraternity block party. Or a football game celebration.\n\nThe streets were Packed with young, college-age party folks. The restaurants and bars were all converted to \"night clubs\", with LOUD rave music and completely packed with high-octane dancing. And this was all 3pm in the afternoon? What?!! What's even more outrageous is how the \"clubs\" are so packed there are long lines outside, for pretty much every \"club\". And did I mention is 3pm in the afternoon?\n\nSome of the restaurants converted their place to a club, and then had a \"food fair booth\" in the middle of the street to sell food--the food they would have been selling if they weren't so busy taking in cover charges at their actual location. Pretty smart.\n\nThe people there are attractive, the weather was nice, and the food was great. This is actually the first time I've had BBQ cooked oysters--the oysters I had in the past were always served cold. I never knew BBQ oysters were so good! The heat brings out all the flavor, and the ones they served at the fair were Giant and packed with oyster-fleshiness. Damn!\n\nOverall, a pretty cool place to check out.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-08", "description": "Was looking forward to checking out this street festival but it's not worth going to in my opinion. There's a large crowd and nothing too exciting that stood out to me besides some spin the wheel to get free things and a few food samples like yogurt, cereal, etc.\n\nIf you're looking for food go somewhere else there was only a few food stands and it was your typical overpriced fair food like a turkey leg and various fried things. I got crab fries for $10 that had garlic, crab aioli, and crab on top. It was pretty good but not worth the price or trip out here.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-06", "description": "Came here for the first time during june 6-7, 2015 weekend. Its quite chilly when i came here with couple friends. It was an okay festival. My friends and i just walked up and back to browse around to see what vendors and foods they had. All the vendors are either clothes, arts stuff, accessories/jewelry. There're an area where you can get your alcohol such as beers and wines. They have live music. They have this spin the wheel/free printed t-shirt that was sponsored by Ford. Pet friendly since a lot of people brought their dogs to this festival. The foods are pretty pricy: got chicken kebob for $9 and turkey leg for $11 at one of the food vendors. Its pretty crowded, mostly young adults, some older adults. I just thought it was funny how couple stores closed during this festival. Like many other reviewers had mention, its difficult to find parking.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-18", "description": "I ALWAYS have a kinda like hate relationship with the Marina..I'm sorry but it is d-bag central, plus I've gotten a few comments when I've gone out here at night just because I'm Asian.  However, I actually thought this was fun for my first time a few weeks ago.  Sad to say, this was my first festival in SF I've been to, nope, no Cherry Blossom Festival, Asian Heirtage Street Festival or North Beach Fest for me yet!  My friend and I were pressed for time so we only got to browse for a little bit, but I told her we totally should come back next year.  Yes, the vendors are there to persuade you to buy their products or whatnot, but that's expected.  And some merchants are more chill than others.  \n\nWe got our hands soft and smooth from one of the body care vendors, free totes from  Eat 24 and Fiat, and flyers for a free eyebrow threading sesh and SoulCycle sesh.  And we got to test drive an adorable Fiat convertible with an awesome staff member.  We saw the free slurpee truck but didn't have time and on the way out we stopped by the Brass Knuckle truck for a fusiony ghetto dog (bacon wrapped hot dog) that they called the Snoop Dogg ($8).  It was a little pricey as I heard the other food items at other stands were too, but it totally hit the spot.  \n\nParking of course was even more difficult than usual because it encompassed like 4 blocks on Union, but we parked about 4 blocks down the slight hill.  I'd like to come back next year when I have more time.  3ish for now.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-07", "description": "Food stands, accessories, clothes and other  sponsor stands at this multi-block stand festival!\n\nThere are freebies that are worthy to visit as a passerby!  Such freebies include the Crunch and Flywheel!  Other than the freebies, it is basically to stroll through!\n\nThe food here is expensive!  11 bucks for a turkey leg!  What the heck!  I might be able to get the same price at an amusement park!  \n\nKeep walking through and it is enough to not need to backtrack!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-07", "description": "We've been coming to this fair intermittently over the years.  This year, there was not much to see, rather a disappointment. There were at least 3-4 drinking areas to corral the drunks and keep them off the streets. A few food stands and the rest were vendors selling things that you really don't need which will clutter up your home with \"stuff\" that your heirs will curse you for buying and leaving them with the dirty deed of having to get rid of them for you. \nIn prior years, there were more real \"artists\". I saw only one metal sculptor who won the blue ribbon for the show.  In reality, he didn't have much competition.  I wonder if he sold any of his large pieces.  There were a few painter/artwork but nothing like in the past and I didn't see any glass work, ceramics, pottery of significant beauty.  \n\nThis fair has turned into more a drinking, eating, walking tour.  Really too bad as it pales in comparison to the Fillmore Jazz Festival. It took us only 2 hrs. to get thru it and that's with milling around and taking our time to walk thru.  I miss the old street festivals.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-06", "description": "Beautiful weather for a festival in the city.  There was only 1 band stand with music that I didn't care for.  There was no wine/beer being sold, so, lines were long at each and every bar on this street.  Good for the business... bad for the patrons who have to wait in long lines to get in. \n\nWhat I noticed compared to many other SF festivals, there are more babies in a carriage.  This is gear towards families instead of singles that wanna mingle.\n\nBut overall, it was your typical festival of garlic fries, BBQ's, unique artwork, and nick-naks for sale.  It was something to get me outta the house.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-06", "description": "Went to the Union Street Festival on Sun 6/6/10.  Was gonna take the #3 Muni bus (Sutter & Sansome), but the bus driver told me just walk up Sutter to Grant (on Rt) and take the #45 it stops right near the Union Street Festival which I did.  Only bad part of taking the #45 is all the Chinese people take it to Chinatown so it gets really crowded.\n\nTypical street festival with generic food booths, but also some good ones like Tacolicious and Kasa; Jewelry booths; Art booths, etc.\n\nFREEBIES:\nSmucker's Toppings - giving out small sample of vanilla ice cream w/ topping.  I got milk chocolate topping.  Then take a FREE picture, gotta go to their website to retrieve it.  Magnet & 2 tiny toppings FREE: hot fudge topping & Black Cherry Topping.\n\nStacy's Simply Naked Pita Chips & Hummus samples FREE\n\nFREE Plum District cloth bag.  Enter \"plum10\" during checkout at plumdistrict.com until 6/30/10 get $10 off:\nhttp://plumdistrict.com/deals/photograph-frame-fathers-day-frames\n\nFREE San Francisco magazines\n\nSamples of drinks & GLOP (something on mini toast)\n\nFandango - Spin the wheel to try to win $50 worth of Movie Passes.  Tried about 4 times & couldn't win it, got a pin, stickers, & 1 FREE movie pass.  Line takes about 10 min ea time.\n\nFREE bag filled with stuff: Texmati Basmati rice; Dorset Cereals Berries & Cherries; Santa Cruz Organic Apple Sauce; Method Smarty Dish dishwasher detergent tabs; Nature's Path Organic MMMaple Pecan; Lifeway Kefir Chocolate Crisp; Method Laundry Detergent in Fresh Air; Chef Paul Prudhomme's Magic Seasoning Blends Seafood Magic, Dog & Cat food (those gotta give away).\n\nSlurpee - Stickers & choice of key chain or magnet.  I got the magnet.\n\nAte at Kasa Indian Eatery booth - Aloo Golbi wrap $5.  Just ok, Small, not enough filling, w/ a side of yogurt sauce.  \n\nKiddie area w/ rides.  Need to buy tickets to ride them.\n\nBus ride back #45 at Union & Van Ness.  Drops off at 4th & Market, close to Powell St Bart.\n\nHrs: Sat & Sun Jun 5 & 6, 2010 from 10-6p.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-04", "description": "I don't know why I come to this festival every year. The art is pretty lame, they don't serve alcohol, and the food sucks. No food trucks, just a bunch of vendors selling mediocre and expensive chicken teriyaki, greek food, and other carnival-like food.\n\nMaybe their target audience is families.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-06", "description": "Date & Time:  Saturday June 6, 2009 @ 2pm\nCompany:  Michael & Jack Met Up w/ Stacy, Lisa-Ann & Ryan\nCrowd:  Eye-Candy.  Mostly Hawt 20-Somethings w/ Aviator Shades; Scantily-Clad Girls in Miniscule Dresses, Short-Shorts or Just Button-Down Shirts w/ Wedge Heels, slouchy Boots or Strappy Sandals & Guys in Pastel Popped Colors, Fitted Tees & Rock n' Republic or William Rast Jeans\nVibe:  Rowdy Will Be Tame Tomorrow\nMusic:  Two Live Bands Playing Latin Beats & 80's Music\nDecor:  Beer Gardens on Every Block.  Faux Grass w/ Tables.  Street & Food Vendors\nImbibe:  Beer & Fresh Strawberry Lemonades\nDevour:  $6 Etouffe, $7 Osha Pad Thai, $8 BBQ Chicken Skewers, $6 Papusas, $9 BBQ Oysters, $1.50 It Takes The Cake Mini-Cupcakes or $1 Full-Size Kingdom Cupcakes", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "The 38th Union Street Festival was held on June 7-8, 2014 from 10AM - 6PM on Union St from Gough St to Steiner. Parking is very difficult to find since it's in a partial neighborhood area (plus all the hills!).\n\nDescription from their webpage:\n\"In its 38th year, the 2014 Union Street Festival is introducing new, exciting additions to this long standing San Francisco event. For the 2014 Festival, each of the six blocks of the event will feature a unique \"World\" including: Fashion World, Culinary World, Tech World, Local World, Craft World and Health & Fitness World.\nIn addition, the Festival will host Craft Beer and Wine Tasting Pavilions with Food pairings such as gourmet cheeses, nuts, olive oils, chocolates and more. Each of the Tasting Pavilions will include decor based on the \"Worlds\" they are located in.\"\n\nSaturday, June 7, 2014 Entertainment Schedule\nWebster Street Stage\n12:00 - 1:30 PM Kippy Marks (electric violin)\n2:00 - 3:30 PM John Chatman (saxophone) \n4:00 - 6:00 PM Frank Martin Trio \n \nLaguna Street Stage\n12:00 - 5:00 PM Faz\n \nFashion Show Stage at Octavia\n1:00 - 1:30 PM Fashion Show\n2:00 - 3:00 PM Lucy SF Yorkies\n3:00 - 3:30 PM Fashion Show\n3:30 - 5:00 PM Burnie SF Swing \n \nChef Demonstration Stage at Fillmore\n11:00 AM -12:00 PM Dosa\n12:00 - 1:00 PM Cooking By The Bay\n1:00 - 2:00 PM Sur La Table\n2:00 - 3:00 PM Cooking with Ray\n3:00 - 4:00 PM Cater2u SF LLC\n4:00 - 5:00 PM Café Claude\n \nSunday, June 8, 2014 Entertainment Schedule\n    \nWebster Street Stage\n12:00 Noon - 1:30 PM Tony (saxophone )\n2:00 - 3:30 PM Waiters Race\n4:00 - 6:00 PM Michael LaMacchia\n \nLaguna Street Stage\n12:00 Noon - 5:00 PM Dave Costa Trio \n \nFashion Show Stage at Octavia\n1:00 - 1:30 PM Fashion Show\n2:00 - 3:00 PM SF Yorkies \n3:00 - 3:30 PM Fashion Show\n3:30 - 5:00 PM SF Swing \n \nChef Demonstration Stage at Fillmore\n12:00 Noon - 1:00 PM Cooking By The Bay\n1:00 - 2:00 PM Sur La Table\n2:00 - 3:00 PM TBD\n3:00 - 4:00 PM Cater2u SF LLC\n4:00 - 5:00 PM Café Des Amis\n\nFashion Show Participants:\nLorna Jane\nles Petits Carreaux\nPink Bunny\nAmbiance\nCloset 1951\nLawless\nUko\n\nTastings Pavilion Vendors:\nWineries:\nEden Canyon Vineyards\nRosenblum Cellars\nDogwood Cellars\nMt. Beautiful Vineyards\nSpicy Vines\nThe Winery SF\nSol Rouge Vineyard and Winery\nVIE Winery\nHowell Mountain Vineyards\nLusu Cellars\nPope Valley Winery\n \nCraft Beers:\nCiders/Imports\nStella Artois Cidre\nJohnny Appleseed Hard Cider\nKirin Ichiban (Japan)\nSpaten Premium Lager (Germany)\nShock Top Family: Honey Crisp Apple Wheat, Lemon Shandy, Honey Bourbon Cask Wheat, Raspberry Wheat\nGoose Island Family: Sofie (Belgian Style Saison), Matilda (Belgian Style Pale Ale), Ten Hills (Seasonal Pale Ale), India Pale Ale (English Style IPA)\n\nFood Vendors:\nBrass Knuckles\nAunt Betty's Corn Dogs\nUltimate Souvlaki\nHot & Sizzling Grill\nSonoma Teriyaki\nAroma Concessions\nTante's\nMarengo on Union\nOsha 5 Inc\nEverything LUMPIA\nGourmet Faire\nSaigon BBQ\nInay Filipino Kitchen\n\nThere's a lot to see here. My favorite is the Yorkie Fashion Show. The little things were darling! My friend's favorite thing to get at this festival is the Garlic Crab Fries. She waits all year for it. My order had very nice thick, crispy fries but the crab on it barely had a flavor (tasted like water) which was weird. There was barely any garlic as well. My co-worker (who's slightly allergic to garlic) didn't even need to take any allergy meds while/after eating the fries. Good for her, bummer for me as I love garlic! =/ There were a lot of samples given out and plenty of food vendors so even the picky eaters can find something to munch on. Lots of local artisans hocking their wares as well. Spent about 3.5 hours casually looking at everything. Great thing to do on a gorgeous day in the city. :)", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "It is a beautiful area but this fair doesn't do much really. The little vendors aren't awesome but ok. My fave part was the NRDC info-people dissing Foster Farms about Salmonella right next to where Foster Farms had a mega booth!", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Wow, to the person who wrote this review:\n\n\"Decision tree for the Union Street Festival:\n1: Is it sunny outside?\n2: Can you stand crowds of overgrown sorority girls and fraternity boys?\n3. Can you stand crowded beer gardens filled with the aforementioned?\n\nIf you answered yes to the above, proceed to the Union Street Festival. \"\n\n\nI need to answer back,\nSORRY FOR (1) PARTYING AND HAVING FUN AT A FESTIVAL, (2) NOT BEING A GRANDMA, and (3) LIVING LIFE A LITTLE.  \n\n\n\nGoodness, I had a blast at the festival -- not just for the fun, but for the people who walk around, it's just great.  There's so many different foods to try and cool booths of everything you can imagine from selling jewelry, to displaying cool new electronics and gadgets, etc.  This year they had a lipton tea big tent/RV area that gave out free samples of their mixed drinks...I tried the Sangria flavored (no alcohol) and the chai tea one..both really fruity and delicious.  \n\n\nCome on people, live a little and experience the city!!!", "author": "Liz W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "What a bad \"festival\". More like a trade show. \n\nVery little art or crafts booths of any interest. Lots of crap for sale. If you want to join a credit union, sign up for the NY Times or buy a Blackberry, this is ths event for you. And the food... Yuck... nearly all from the same vendor, just with different booths on different corners, but the turkey legs, chicken skewers and garlic fries were the same where ever you looked. \n\nNo thanks next year!", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-12", "description": "I really like the Union Street Fair. You have people like myself, Alan the Balloon twister, and Korene Tom doing what I think is a wonderful job twisting balloons for all the kids. It's San Fran(sillyness)cisco at it's finest!", "author": "Kenny T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-05", "description": "Celebrating All Things Vanilla!\n\nPerhaps next year, the organizers can hire Up With People to sing the Carpenters' greatest hits with their interlocked arms held akimbo. I'm sure the Lennon Sisters are still available for personal appearances. For a city with a variety of cultural ethnicities and sexual preferences, it seems a bit stiff and sadly myopic to have a street fair celebrating the Marina yuppie. How else do you explain a kiosk selling kitchen cabinetry?\n\nNo cannolis here. No spanking booths. No leather chaps. No lambada. No glory holes. No How Weird. More How Dull...with just a little beer drinking in strictly enforced demilitarized zones. And a few hidden pleasures like the Killer Brownie Company and their chocolate chip macadamia brownies. Every year, I seem to take less and less time strolling past the booths. Total elapsed time in 2007 - 24 minutes flat...and I didn't even break a sweat.", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-02", "description": "Having lived in the Marina while in my 20's, I spent quite a few years wandering up to Union Street to enjoy the festivities.  Now, keep in mind this was many, MANY years ago and I now live happily in the burbs with my husband of 16 years and my two children.\n\nYesterday I met a friend and we wandered down Union Street.  Yikes.  Once upon a time there were REAL artists who sold their one of a kind pieces of art.  Yesterday I saw ONE.  The rest of it was pure crap.  Geico insurance?!  SF Giants fan club?\n\nSaid friend and I were heading to Spa Radiance for relaxing massages.  Ha!  The spa is next to the Mauna Loa.  This is a bar I would frequent in the early 90's.  A lot.  I never remember it being open during the day but yesterday it was.  I spent my massage in a room overlooking the courtyard of the bar.  I felt like I was in the middle of the bar having my massage.  The Spa should have either warned us or just shut down for the weekend.  OMG.  But, that's for another review...\n\nWe couldn't even get out of the doorway of the spa as it was filled with drunk \"girls\"!    Girls huddled in the doorway.  Weird.  Anyway while wandering the streets in disbelief I  noticed quite a few stores were closed with signs saying they'd be back when the street fair was over.  That speaks volumes.  A store closing while all this foot traffic is around?  Humm...  \n\nAfter looking around... I realized why.  OMG!  These \"people\" could not be from the Marina.  No way.  They were clearly from The Jersey Shore.  I swear I saw Situation on the corner of Union and .  What is the deal?  Are these the new \"Marina Breeders\"?  Holy Hell.  They were everywhere.  Blocking doorways, blocking sidewalks...  It was uncomfortable and a part of me was scared but I was also very confused.  How did THAT look get to SF?!  Barf.\n\nAvoid this festival unless you spend your days at the Shore.  There really, truly is NOTHING there!  It's nothing like it used to be...", "author": "Jen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-05", "description": "Grabbed a $10 turkey leg, spun a few wheels for free stuff, witnessed a random fashion show, got more free tote bags/drawstring bags, and watched the gf peruse the visually disorienting assortment of overpriced trinkets.\n\nAt least I got some exercise walking up and down Union.\n\nOh yeah, Google Local posted up here too...long live Yelp! :)", "author": "Nick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-07", "description": "One of my favorite \"FIRSTS\" ever!\n\nAs a SF native, I'm ashamed to admit that yesterday, 6.6.10 was my first time at the Union Street Festival. So far this year, I've attended the Cherry Blossom Festival, Asian Heritage Street Festival, and Carnaval and without a doubt the USF is hands-down my favorite!\n\nDAY/TIME:\nSaturday, 6.5 and Sunday, 6.6. from  10AM-6PM.\n\nLOCATION:\nUnion Street; Gough to Steiner Streets.\n\nPARKING:\nCan be quite difficult since the festival is held in the residential area in The Marina. However, we were lucky enough to snag parking near Van Ness which may be your best bet. Otherwise, just take MUNI. \n\nFREEBIES (to let your inner Asian-ness come out):\n*Stacy's Pita Chips\n*Sabra Hummus\n*Smucker's Sundaes\n*Science Diet Doggie Treats\n*Glop Cheese and Olive Oil Spread\n*Rockstar Energy Drinks\n*Wellness Pack: Rice, Apple Sauce, cereal, nutrition bars, cat and dog food and detergent. \n\nIf you're a foodie, you will love the USF. Of all the festivals I've been to this year, they have the most extensive array of food booths:\n\n*Saigon BBQ: banh mi, bun, spring rolls\n*The Roasted Corn: corn, fried veggies, funnel cakes\n*California BBQ: peking chicken wraps and bbq sticks\n*Tacolicious: short-rib beef, carnitas, chicken, and veggie tacos\n*Da Kine Drinks: coffee, smoothies, shaved ice\n*Gourmet Faire: gyros, beer battered fries and crab fries\n*Main Street: pupusas, gyros, bbq oysters, fish and chips\n*Sonoma Teriyaki: teriyaki chicken, fried rice, chow mein\n*Pedemonte & Co.: hot dogs, brats, garlic fries\n*Aroma: turkey legs, tri-tip sandwiches, kebobs, crab cakes\n*Tantes: falafel, shawarma, fish tacos, jalapeño fries\n*Earthly Delights: BBQ Pork and philly cheese steak sammies\n*OSHA: pad thai, chicken satay, eggplant\n*New Orleans Catering: jambalaya, crawfish etouffee, gumbo, blacked shrimp\n*Kasa: naan rolls, chicken tikki masala\n\nMy friends and I tried the following:\n*Saigon BBQ's fried spring rolls ($6 for 10 small pieces): The pork spring rolls were ok, but would have been better if there were served warm. They were room temp and by then have lost it's crisp. There was not sweet and sour sauce just peanut, fish sauce, or sambal. \n\n*Tacolicious ($3.50 each or 3 for $10): \n-Short-rib: DELISH! The beef was tender, moist, and flavorful. \n-Carnitas: Our fav! The pork was smoky, tender, and slightly sweet. \n-Beer Chicken: The chicken was moist, tender, and super flavorful. \n-Watermelon Agua Fresca ($3.50): Yuck, it tasted sour and bitter.\n\n*Gourmet Faire's Crab Beer Battered Fries ($8): OMG--SO EFFEN GOOD! The fries were lightly battered and fried to a golden crisp. The beer batter made the coating nice, airy, and crunchy. It was slathered with a creamy aioli sauce with a slight hint of spice and then generously topped w/ fresh sweet, succulent Dungeness crab meat. Salty, creamy, sweet, salty, crunchy--an explosion of different taste and textures! \n\n*Main Street's BBQ Oysters (3 for $7): YUMMY! The oysters were plump, juicy, tender, smoky and sweet. It was topped with fresh drawn butter and minced garlic which gave it a nice savory and slightly pungent taste. \n\n*New Orleans' Crawfish Etouffee ($8): The crawfish stew was spicy and savory, but the crawfish was overcooked and mushy.\n\n*The Roasted Corn's Funnel Cake ($5): We opted to top ours w/ powdered sugar and whip cream. YUM, there's nothing better like fried dough. The funnel cake was crisp and doughy in the center. The powder sugar added just a touch of sweetness while the whip cream added a nice creaminess.\n\nBEER GARDEN ($6 for 12 oz.):\nThere were 3 beer gardens serving up Blue Moon, Honey Moon, Pale Moon, Bud, Bud Light, and Heineken. Unlike Carnaval, where people looked like drunken imprisoned animals overflowing from a cage, the USF's beer garden was bustling yet spacious enough w/o feeling you were getting shoved around like in a club. \n\nOTHER VENDORS:\n*30-40 booths of art from local painters, handmade jewelry, clothing, accessories and trinkets.\n\nMUSIC:\n*Live light rock and jazz music which you can enjoy while sitting on the synthetic turf lawns. \n\nCROWD:\nMixed \"elites\" as I would like to call them. And, plenty of cute doggies that I spent most of my time coo-ing over.\n\nCLEANLINESS:\nAfter last week's experience at Carnaval which made me feel like I had to jump into a pool of Purell, I was pleasantly surprised at how clean the USF was. There were clean porta-potties scattered around; however, there were no foot pump generated sinks. *sigh* There were plentiful receptacles which we saw workers regularly empty out and \"shine\". The seating area and turf lawns were clean and free of debris. For a germaphobe like myself, this is a big PLUS!\n\nI absolutely can't wait until the next USF. Gotta rep that \"Asian\" in me somehow, so next time, I'll remember to bring plenty of cash (all the bank ATMs and ATMs were out of cash or not working) AND a shopping bag to collect all the goodies. J/k!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "Not the best festival but it's pretty big. Lots of things to see if you're bored. It's more family-oriented so if you like that then this is for you.\n\nAnd for the record, I don't see anything wrong with the people in the Marina. Every time I've ever visited the area, I've only had good experience. And I'm not white. So not sure where all that negativity is coming from. It's a perfectly nice neighborhood.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "Yay Union Street Festival! Went yesterday. Nice weather. Was breezy, but warm and sunny enough for us to enjoy the festival.\n\n5 of us went, and all we did was grubbed. First stop the Kashi booth for our free healthy whole grain cereal! ahahaha. it was goood. Kaaaashi. *drools*\n\nBecause there were so many food booths and we're friggin fatties, we decided to share our foods so we can sample everything.\n\nWe had:\n-crab garlic fries. OMG. soooOo good. the garlic fries were so good to begin with. nice and crispy, drenched in oil and covered in garlic. then a nice hearty scoop of crab aioli (real crab meat with a mayo based sauce) on top.\n-fried calamari with limo cilantro sauce. freshly fried. nicely battered. yum!\n-turkey leg. the ones at disneyland are nothing compared to this one. huuuuuge!! it was quite juicy too. it took us forever to kinda finish it. had to throw it away cuz no one wanted to carry it anymore. lol. \n-funnel cake. topped with powder sugar and fresh strawberries. coodles for having fresh fruits (well just strawberries and bananas...but its better than the syrup crap)\n-strawberry lemonade. very refreshing after everything we had.\n-oh yes. another crab garlic fries.\n\ni was glad that they had a separate alcohol section because...welll speaking for myself only, i was pretty dang full after all that food. if we had grabbed beer like we planned to, i think my stomach would've exploded. lol. \n\nit was a good fair. tons of things to look at. samples here and there. went around a full circle in about 2 hours. good times.", "author": "Marti L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-09", "description": "I think the best thing I got out of this years' Union Street Festival was the Kashi free tote bag, and trying an arepas from Pica Pica.  Also, mini cupcakes for $1 at the Kingdom Cake booth!  Yes, parking was a pain, but if you circle a little farther in the neighborhoods, you'll be able to find something. \n\nThe smartest thing to do is to park at one end of the fair so that you can walk along one side then turn around and walk down the other side so that you check out all the vendors/foods. I did like how it was more children-friendly by having the mini carnival rides/games.\n\nNo doubt, still one of my favorite festivals!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-10", "description": "The weekend of the Union Street Festival is the weekend this Union Street inhabitant goes out of town.  It has gone from a family atmosphere to what others have said a giant frat party.\nIt is not even good natured fun.  It is groups of 20 something year olds trolling the street inebriated causing damage to other people's property. I called the police twice last year as we had  idiots hanging off their balcony and throwing beer cans at people and cars.  ENOUGH with this freak show.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-13", "description": "Way to make a sunny day on Union a total clusterfuck.\nIf you live here, it's a good excuse to go roaming around for greasy overpriced stand food and laugh at all the people that actually tried to park.\n\nSince it's the first of the summer of lame festivals in sf, it's ok.\n\nBeer pens are weird.  Do any of the merchants actually sell the ugly hand sewn wool bags or 8x8 $1000 oil paintings?", "author": "Randy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "We had a lot of fun this past weekend at the Union Street Festival. Things I liked were:\n\n* The Beer Gardens had Blue Moon, very good.\n* Street Vendors had delicious food, my cousin and I split a Teriyaki Chicken dish. \n*Jewelry vendors made it easy for me to do some \"pre-birthday\" splurging on myself without killing my back account. \n* People watching was my favorite past time. \n\nIt was my first time coming and it was pretty fun, I'll come back next year.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-04", "description": "I know this review is a bit overdue but I had pretty much written it up but never submitted it. =P\n\nThe Union Street Festival was a bigger event than I thought and the weather was awesome...warm and sunny with a slight breeze. What more could you ask for? Here are some highlights:\n\n- tons of food options from Thai to gyros and crepes to BBQ (http://www.yelp.com/biz_photos/wZ7L6QYJpWs6mM28xDD-Zg?select=-mt1asQxxRHuGTHvQNdgww)\n- eco-friendly vendors such as candy wrapper purses, hemp/bamboo clothes, etc (http://www.yelp.com/biz_photos/wZ7L6QYJpWs6mM28xDD-Zg?select=t1aOgKFM5HPrXHjBx6y0Nw)\n- beer battered garlic crab fries were so good! (http://www.yelp.com/biz_photos/wZ7L6QYJpWs6mM28xDD-Zg?select=ZYlw1wLyzcCkgDTOc8Hy0A)\n- Kashi booths for reusable bags and free samples (http://www.yelp.com/biz_photos/wZ7L6QYJpWs6mM28xDD-Zg?select=OJF6GqNwOavZP_KA0AtjlQ)\n- yummy pulled pork sliders for $3 (http://www.yelp.com/biz_photos/wZ7L6QYJpWs6mM28xDD-Zg?select=jskQxBJP0h9c_AkV4F5YSQ)\n- mini cupcakes for $1.50 (http://www.yelp.com/biz_photos/wZ7L6QYJpWs6mM28xDD-Zg?select=o1gLYRVRd995cH0_tBzxKA)\n- free samples!\n- lots of boutiques and restaurants on Union St to browse\n\nIt was pretty crowded but a great way to pass a few hours and get a tan in the meantime. Looking forward to it next year!", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "The beer does not make the festival and I think it turned out better without it.  It's better to have those who wants to drink in bars and restaurants than out and about,  spilling beer, stumbling...plus, why do you want to be packed like sardines in those \"beer gardens\" with the fake plastic green flooring?  That's the dumbest idea ever and I'm glad to see it gone. \n\nA lot of dogs to my discomfort.  Vendors are mostly accessories and tees while we enjoy both, it would be nice to have more varieties.  That said, I got a couple pretty necklaces and hubby got a few cute tees.  On top of that, we got some tasty jerkys that's perfect with beer.  \n\nIt was great to hit the stores along Union too - a great day and no rain!", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "Been going to the Union Street fair for years and was starting to tire of it since every year, it seemed like the same old stuff.  To my surprise, this year was much better!\n\nThe booths were bigger, taller, and fancier with a much better variety of vendors than in the past.  Lots of new vendors with some interesting offerings this year.\n\nLots of freebies too...how could one not love free ice cream with your choice of toppings?  Thanks Smuckers!  There was also free flavored energy drinks (mango and others), but I don't remember the brand.  Free cloth bags from Plum District and someone was also giving out free pita chips and hummus.  I even saw free sample packs of dog food!  Had to chuckle when someone suggested bringing it to the bar as an hors d'ouerve.  (No, we didn't, but it was a funny thought...gives a nice shiny coat!)\n\nAs always, the alcohol flowed and most people over-indulged including myself.  Sorry, but I don't do beer gardens.  I'm not into beer (just give me good vodka or wine) and I don't like to be corralled in a drinking pen like cattle or livestock.  We don't do pens, we do bars!  Luckily, an old standby on Union saved the day which is my next review.\n\nGreat festival...much improved!", "author": "Roy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-05", "description": "Boring!\n\nAlcohol-free??? What was the point!?\n\nIt was like a big farmer's market. Stuff being sold could be bought anywhere. Food was overpriced. Not enough music (a random opera singer, really!??). Not enough freebies. \n\nSome good looking people and a lot of good looking dogs. \n\nI will not pay $15 parking to do that again until they bring the alcohol and music back.", "author": "Tu N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-06", "description": "Other than ironic fashion, I'm not into ironic consumption.  I don't drink bad beer to be cool or engage in other  such activities.\n\nBeing at the Union Street Festival was an unintentional act of irony. \n\nIt was Saturday after a late late Friday night.  We read about some eco-conscious festival with gourmet food. \n\nWe weren't thinking about the fact that this was in the Marina.\n\nOnce we got closer, we realized we were about to enter a giant frat party.  The demographic made it okay for folks to carry around cases of bad beer without cops stopping the party. \n\nIf you like being in a crowd full of loud stumbling people who are all a hot mess, check it out.", "author": "anjou k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "I have been wanting to check out the Union St Festival for quite some time but a good 3/4 of my friends always say stuff about it like \" Hell no, The Marina? You'll never find me there!\" \n\nWell, too bad, because you're missing out...a fun vibe, in excellent weather, with great food, music, and people. \n\nI avoided the beer gardens like the plague ( way too packed) and watched the band with the tweaker drummer play. They played an awesome set of bluegrass while trippers hula hooped. Hardly the stereotype I was warned about. \n\nThough I spent maybe an hour at the festival before we were smuggled into \" The Brick Yard\", I will def hit this festival again in 2011. \n\nUntil next year!", "author": "Taj A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-06", "description": "This event was marketed as being eco-themed with gourmet food and all, but it was just like any other street festival, except almost everyone was white, 20-something, and in unofficial uniform.  For women, it was a tight dress and either sparkly flip-flops or five-inch heels.  For men, it was a button-down shirt with khaki shorts and flp-flops.  With a case of cheap beer in one arm.\n\nWay too crowded, way too Marina, and no special content.", "author": "Leena K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Morning rains kept the crowds away so it stArted out mellow for us. Loved the music, people watching and the general vibe. We're b\nNot college age and yet we stayed for hours! I guess it's just our love for SF, it's neighborhoods and it helps we don't live nearby!", "author": "M F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-21", "description": "Decision tree for the Union Street Festival:\n1: Is it sunny outside?\n2: Can you stand crowds of overgrown sorority girls and fraternity boys?\n3. Can you stand crowded beer gardens filled with the aforementioned?\n\nIf you answered yes to the above, proceed to the Union Street Festival. \n\nThe long of it is that if it is a nice day outside, it could be worth heading over to the Union Street Festival. The food isn't anything to write home about. It is your typical food you'd find at any other street fair or fairground. However, it is always nice to fill a sunny weekend in San Francisco with some food, window shopping, and enjoying some live music.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "I was looking & dodging for Art Mann at the same time??  Anyone seen him? Union Street Festival is a prototypical \"Art Mann Presents...\" Somebody email his show and tell it to the world or I will.\n\nLearned me a new trick: Go one block off of Union to avoid waiting 4,000 hrs for a beer @ the Beer Garden. Get you liquor fix, go back & grub.\n\nGood times.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "First off, whoever said this is \"good for kids\" is severely mistaken. The USF is not good for kids, or dogs. It is good for adults in their 20s and 30s (maaaybe early 40s) who can handle being surrounded by large quantities of  their drunken peers. Yes, there is a large kids' area, but if you bring your children, it's really better that they stay there because the rest is for a difference audience.\n\nThree of us came to the festival this year and had a great time walking around. There is a lot of jewelry and food for sale (automatic question: how do jewelry designers display $100 necklaces where so many people are drunk?) and really all your typical street fair items. I found a great booth that sold $5-$25 jewelry and got a spiffy pair of earrings. We were not drunk at the festival, but left for City Tavern for a few hours to get drinks. Then returned to have BBQ chicken sticks and fries (soo good.)\n\nBut back to the environment. I don't really get WHY everyone is drunk, but it's not dangerous or shady...just not a place for kids. Or dogs. I'd suggest coming with a small group (no more than 4) or else there is risk for losing people, or wasting time figuring out where to go.", "author": "Emilia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-28", "description": "Dear Angry-Wannabe-Artsy Cooler than Thou Yelpers:\n\nI will summarize your reviews of the Union Street Festival so you don't need to duplicate efforts:\n\nDouchebags (please find a new, original word), Frat Boys, striped shirts, popped collars, evil Republicans, and hot chicks with expensive purses.  Yuppies with expensive strollers and bluetooth headsets.  Also, crowded beer gardens.  You are an artist and you are better than everyone else because you don't buy into the Capitalist Corporate culture.  You are a true original who shops in the Mission and knows where the \"real\" bars are.  Kids and dogs are for yuppies, church and God are myths formed to spread hatred, and Obama God.  You are an ORIGINAL who thinks for himself.\n\nDid I cover it for you guys?  As I read these reviews with my 3 kids, two dogs, expensive strollers, and striped Facconable polo shirt, I wonder if someone could write a review that's helpful to me.  By the way, I have no intention of visiting the beer garden.", "author": "Marc L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-04", "description": "The higher rating is mostly for the jewelry and clothing stands, and the free snow cone. \n\nReally typical atmosphere overall at the fair. Suddenly all these kids appear out of nowhere, which is weird considering that I hardly see kids under the age of 12 anywhere in SF. The Redbull Races were beyond lame and the DJ announcer very annoying (and lame too). Beer gardens that had no tables and required you to sit on astroturf; totally unappealing. The smell of sausage and thirst inducing lemonade gleaming out at you from every which-way, but after finding out that the lemonade is $4 until you decide not. Doesn't even scratch the surface of the Del Mar Fair Grounds.\n\n\nLOVED the jewelry I got there, plenty of selection and with good prices. Almost all the goods vendors took credit card, which was a relief for us girls that don't carry cash. Also a sweet and wild sista from Modesto sold me this great yellow-fade-to-green ombre dress for only $15! And there were a group of teens outside of Ralph Lauren handing out free snow cones! Free! \n\n\nBut it's cute. And hey, we try! I'm definitely not too thrilled with the EcoZone signs they had posted every block, however, since everyone standing in those designated areas was holding plastic cups and dropping food on the ground. And we call this an Eco Zone people?", "author": "Alita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "I see everyone went on Saturday.  Guess I gotta try doing that next time.  \n\nI went this time with some friends this year on a late Sunday afternoon.  OMG, parking sucks.  Explain to me how we let 5 people only 2 seconds ahead of us take a spot right in front of us.  After being bitter and restless with the clock counting down to 5pm, we forked out the $15 for parking in a structure.  *shakes head* (I never pay for parking)\n\nAnyhow, bunch of us met at Webster and started our way down Union St.  Plenty of people, sun was bright, it was a festive time.  The streets smelled of all different kinds of food.  There were bands at both ends of the street too bringing in the loud bangin music from reggae to country and all.  But what we had were the following:\n- Garlic battered fries with crab and tartare topping...need i say more? ($8)\n- Giant giant roasted turkey leg the size of my forearm....yes it is and its delicious.  My spoiled one and I had the hardest time trying to finish it cuz it was \"so big\" (that's what she said)  \n\nand to top it off, after the fair was over, we found ourselves walking into a nearby bar at Lefty's.  Such the perfect way to enjoy a festival\n(Cherry Blossom followed by Playground.....some things never change)", "author": "Vincent K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-25", "description": "I love San Francisco! I love FESTIVAL SEASON! So much to do every weekend! So many options to choose from! The Union Street Fair brings out the girly-girl in me. It ranks lower for me than most others because I feel like the whole point of this fair is to bring focus to the merchants on that street. Shopping is the only thing I think about when I'm out there, probably because there's not a high focus on music or arts (like most of the other festivals I attend). GF and I are obsessed with festival food. The grilled chicken sticks, the garlic fries, the grilled oysters, etc...these are the things that we consider \"bonuses\" at most other festivals, but for this one, they're the only things we actually go for. We still have a good time, but when grading on a scale...it doesn't stand out.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "I went on Sunday which I heard was much more mellow than the Sunday crowd.  I have to say I had a lot of fun.  Seems like this year there was a much better variety of vendors and loved the eco-section.   Weather was perfect.   Got to see live ShamWow demo.  They're amazing! \n\nOOOOOOOh!!!!  Saw a police officer that looked like a young Brad Pitt (think Pitt in Thelma & Louise) I got the tingles!!!!", "author": "Angela N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "Hmmm... I had a nice time at Union St Fair this year.. maybe because I didn't drink in, let alone set eyes upon, any of Steve Restivo's beer gardens.\n\nThe Marina has lots of douchebags? I'll show you a douchebag, Steve!\n\nHe shut down some of the most fun parties of the year. And really, I think we should all attend a house party once in awhile. They're v. conducive to meeting like- minded people. How many of us have met significant others at parties? Am I right?\n\nThanks for ruining it, Steve. But we still partied anyway, and I didn't buy any of your crappy $8 beer. Suck it!", "author": "Katie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-04", "description": "Last year I thought the Union Street Fair was the cat's pajamas.\n\nThis year I thought it was the cat's shit-covered litter box.\n\nI was drunk last year.....it began at 11 a.m. and by 1 p.m. I was standing on the street pouring hot cans of Bud into a stolen keg cup; slobbering all over high school bitches I all of a sudden liked now that I was faded; and saluting cops as I illegally stumbled down the sidewalk with my booze.\n\nThe soft boozey cushion and beautiful weather made it possible for me and the striped shirted, sweat-band-wearing douches to live peacefully in symbiotic harmony.\n\nThis year, I showed up at the fair at 3 p.m. sober as Lindsay Lohan at Promises rehab facility...but without the rosary vile of coke and the prescription Vicodine for the \"stress\"/aka night sweats.\n\nI walked into the beer garden and was immediately sandwiched between three dudes in vertically striped shirts and a chick that was using my back as recliner and demanding for everyone to sing \"Happy Birthday\" to her. \n\nI looked at boyfriend and said \"I'm so not drunk enough to deal with this shit.\" We hauled ass out of the chaos, planted ourselves at Silver Cloud for the next three hours and poured bloody Mary's and pitchers of Stella down our throats until trying to get off our bar-stools to head back to the fair was a serious challenge.\n\nBut the booze didn't really help the situation at hand...Which was that the Union Street Fair blows fat chunks.\n\nNote to pregnant mothers pushing $800 strollers while walking three golden retrievers: This scene is not ok for your baby and your pooch, unless you want your baby to pick up half full keg cups off the ground and your dog's tail to be stepped on by 4 inch Jimmy Choos (during the day bitches? Who wears heels at a street fair?).\n\nThis fair is a chaotic ex-Greek cesspool of inebriated hookers with muffin-tops and Abercrombie & Fitch models desperately trying to prove how not gay they are.\n\nIt was freezing and I kept pouring beer on myself, which normally happens cause I'm short as hell and people don't see me and therefore end up pushing me, walking on me and elbowing me in the head. But this time, it was my own fault. I kept leading over to grab something off the ground (cigarettes, crack rock, diaphragms?) and would pour my beer all over my front. I did this twice, and then decided it was time for me to go home.\n\n+1 star because I managed to avoid any contact with Bar None.\n-1 star because I lost my favorite earring somewhere in the mess of booze, pizza and chodes", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-06", "description": "They should totally just call it the Trixie Festival (as Jenn Y. noted down below). Those of you from Chicago will know of what I speak.\n\nI still give it 4 stars because street fests in general are cool, but the downside is that it's a bit too crowded and a little heavy on the \"obnoxiously drunk in public\" factor.", "author": "S R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-02", "description": "\"Let's get ready to ruuuuuuuumble!!!!!\", that's the first thing that comes to mind when you see the beer gardens at the Union St. Fair. I personally think they should be called cages since you're baracaded in by 6' fences covered in tarp. Since you're not allowed to carry beer through the fair you have to enter one of these cages to get a beer....oh just what I wanted to do on a Saturday afternoon, have a cage match with some douchebags.\n\nWhile walking through the fair I did notice some carnival rides that young kids could enjoy, that's what my one star is for. I can imagine it being great for parents to bring their kids when they want a novelty in the city.\n\nAs for the bar lines, there was no point in trying to get a beer along Union St.  If you consider a 30 person line for Bar None entertaining then you should definitely check out the Union St. Fair. I can't believe that so many people want to go to what I consider one of the worst bars in the city. Perhaps I should be glad Bar None exists though, it seems to be a honey pot for douchebags so if it didn't exist they might escape and go to the cooler bars in the city.\n\nAll I can say is, \"Union Street Fair, thank god you're only one weekend a year\".", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-04", "description": "You get so wasted at this thing . . . you could seriously get a D.U.I for taking a cab or any form of public transportation.  \n\nThen you wake up in the morning in shock over the 2 possible scenarios:\n\n1) the strange naked person laying next to you, or\n2) the strange piece of \"art\" laying next to you . . . \n\nARRRRRGHHHH!\n\nSee you next year Union Street Fair!!", "author": "NISHisHOT g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-05", "description": "Everything you hate about Union Street at night....\n\nOh-My-God...Was this for real?   I'd like to give this mess\n5 stars for the sake of people watching.  \n\nI was just walking through on my way home from a movie\nat 6pm and first noticed the red keg cups.  I'm thinking....party?  \nHuh? Took the corner at Fillmore and Union and oh, damn...\nit's a fuckin' street fair.     \n\nBest part of walking through the carnage was watching all the \ndrunk girls trying to navigate the obstacle course of trash while\nwearing spike heels, smoking cigs and blabbing on their cell phones......yet still looking cuuuuuuuuute.   *Hhiiii*\n\nPhones really not necessary since the bimbos scream at full \nvolume.  Save the minutes, chickie boom-boom;  we can *all*\nhear you.    And the drunk singing....yummy.\n\nBella?  Next year?  Let's find a stoop, park our cans for the day\nand mock the parade of humanity.   Garlic fries, on me.\n\nI don't know what a \"chode\" is but I have a feeling this is where\nyou can find many living in their natural environment.", "author": "K-leen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "What can I say, other than it was a success! Success meaning I proceeded to get hammered due to the massive amounts of peer pressure to take shots of tequila and drink bud light, the funnel cakes that were involved, and a jolly good feeling of celebrating my beloved neighborhood. Love you Union St!", "author": "Krista S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-17", "description": "Festivals are hard to rate because it really depends on what you are looking for.  For me, food is the priority.  I don't care about getting drunk, checking out guys, or buying chotchkes.   If you do care about these things, here is my feedback:\n\nGetting drunk- This is the place to go.  They have \"beer gardens\" in the middle of the street.  It's basically a fenced off area with a bunch of high tables that you can get  hammered and hit on each other.   \n\nHooking up with guys/girls- Odds are high... especially if you have beer goggles like most of the people here.  There are plenty of drunk, scantily-clad groups of women staggering down the street in stilettos who will think you look like Brad Pitt.  Ladies, you might find the man of your dreams if you don't mind the fact that he is drooling and slurring...  and that he has a piece of turkey on his chin from the enormous smoked turkey leg that he is holding onto for dear life.\n\nBuying chotchkes- If overpriced cinnamon-dusted almonds, strange hats, candles, and uninspired clothing piques your interest...this is the place for you.\n\nIn all fairness, they do have a pretty good selection of food stands (their corn dogs were amazing!)   The festival is located in a fun, shopping-friendly area of San Francisco.  When I went, I was with a great group of friends and was spoiled by the beautiful weather...so it was still a fun experience.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "To sum it up shortly:\nWeekend-long daytime frat party!", "author": "Miss H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-05", "description": "If you are a reporter for Glamour Magazine's Fashion Don'ts, you literally have a cornucopia of examples for you - truly!  1 hour with a camera at the Union Street Fair and you don't have to work for a solid 5 years - muffin tops, exposed flabby bellies, crunchy over-gelled hair, orange over-tanned people -hahaha.  I love the Marina.  \n\nIf you were a frat boy or a sorority girl and you still consider them the best days of your life, then this fair is GOLDEN for you - the barfing in the beer gardens will have you reminiscing about those oh so fun days!  Woo hoo!\n\nIt's easy to bash the marina - but I love it.  But this fair sucks big, sweaty, hairy donkey balls.", "author": "Chi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-31", "description": "Things to check out @ Union Street Fair:\n\n1.) 30 year old dudes wearing their fraternity rush shirts from '95\n2.) Tons of blue tooth phone headsets & Blackberry's holstered to belts\n3.) Jam packed \"beer gardens\" with $5 beers in plastic cups\n4.) Bros with their collars popped\n5.) Yuppies \"brunching\" at Perrys\n6.) At least one fight\n7.) Homogenous crowd\n8.) Street vendors hawking overpriced wares\n9.) Drunk idiots\n10.) My drunk ass having a fun time despite #1-9", "author": "Chris B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-01", "description": "Oh my god. So I accidentally wandered into the Union Street Fair. I swear I didn't even know there was such a thing. Mom was visiting and wanted to see what the Marina was like. So like a dutiful daughter, I dragged my boyfriend and father along and steered us towards Chestnut street.\n\nAnd just like that, I ended up at the fair. Oh my god. I just moved away from Chicago and Lincoln Park. I thought I was safe in San Francisco and the Mission. WRONG. SO WRONG! What a textbook gathering worthy of the Lincoln Park Trixie Society! The beer garden alone was my definition of purgatory.\n\nThat'll teach me ever go to the Marina again.\n\nOne extra star for the fact that they were selling deep fried cheese. That's always a positive in my book.", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "I think for the Union Street Festival there area few key things, good friends and lots of drinks.\n\nWell for me that was the case, I had a great time with some great friends and I believe I got some cool reusable grocery bags as well.\n\nI know that most street festivals are a family affair but I'm not sure if this one is appropriate unless you are familiar with the scene.  It is a very marina affair and if your not into that you probably won't have fun.\n\nI would recommend it for a good time, a kind of holiday in the Marina.  and last year it was beautiful and sunny outside, lets hope it happens again this year.\n\nNote: Be careful with the drinking, bathrooms are mostly limited to porta potties.", "author": "Sabine A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-05", "description": "It was cold........I could not show off my cute shirt by this great designer we met at Shop SF! anywho I still had a great time with my friends but I think they need more beer gardens if you ask me. \n\nI honestly was not tipsy enough to enjoy walking down a crowded street in SF, getting jostled, freezing, and stepping in god know what and being stepped on by these rude drunk peeps.\n\nI will go back next year only if its warm:)", "author": "Setareh N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-31", "description": "It's the Folsom Street Fair, without the chaps, leather vests, dog collars, chains, and whipping booth.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-09", "description": "Meh.  I've experienced better.  Far better.  The food was tasty...but you had to consume ridiculous amounts of alcohol to shed the claustrophobia.  In fact, if we were snakes we could have shed our skin prematurely due to body buffing and elbow cracking in the cage-of-a-beer garden (read chain-link fence with tarp and Budweiser beer flags)  The crowd wasn't my jive either.  Meh.\n\nThere was a very talented band.  I don't remember their name, but they get 4 stars.  This festival gets none.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-19", "description": "Braaaaaaaaah.\n\nHighly recommended if you wear Kanye glasses, Old Navy cargo pants, and polo shirts. Chances are if you think Will Ferrell and Dane Cook are comedic geniuses, this is your crowd.", "author": "Rose S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-05", "description": "Two words: Beer jail.*\n\nYeah, it's fun to get sloppy and wander around, but it's lame that you can't drink on the street and they pen you into the Guantanamo-esque beer pens.  Not to mention the booths sell nothing but crappy local art, pictures of the Golden Gate Bridge in the fog, designer olive oil, or meat on a stick of some sort.\n\nTwo stars mainly for the eye candy.\n\n\n\n\n\n* Phrase trademarked by Noelle Q. and used with permission.  All rights reserved.", "author": "Geoff K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-02", "description": "I HATE THIS FAIR!! Why does it have to go on for two days? My drive way turns into a parking lot and I can't get reception on my cell phone because the network is busy! Drunk yuppies who have peed on themselves sleep on your porch and it is impossible to catch the 45 and leave the hell hole which was Cow Hollow. I try to leave the area every year for this overrated street fair. I don't get why people get so crazy at this thing? Mental note: good weekend to spend in Napa.\n\nOnly one positive remark: The police on bikes look so funny! I'm sorry but the bikes make me want to laugh at them rather then take them seriously.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-22", "description": "God, I knew how the Union Festival was going to be and yet I still turned out for this year's Festival. My bad-totally my bad. I only have myself to blame.\n\nMaybe I wanted to relive my college days where being around overprivileged, stupid undergrads made me want to gouge out my eyes. It was almost impossible and painfully slow trying to wade through the swarms of obnoxious, drunken, overgrown frat boys and sorority girls aka Marinanites-they were everywhere. On the bus, spilling out of the bars and pubs onto the sidewalks, up on rooftops, swelling from the beer gardens, literally everywhere. \n\nIt is quite an overwhelming experience, in the worst possible way. I came home with a headache, a look of disgust on my face and with a lot less brain cells. \n\nOh yeah, and the eco portion? Totally missed that. Didn't notice it, couldn't find it, wouldn't have known it was actually there until my co-worker claimed she had seen it and said it was still pathetic.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-08", "description": "A giant frat party.. a lot of good food. Lemonade seemed to be the drink of choice this year. Just another excuse to trash union st... plus a friend of mine got hit by a drunk driver after... suprisingly\nHere are some slogans I was inspired to write about the union st festival while walking around:\nThe union st festival: come get roofied on astro turf instead of at blue light!\nThe union street festival: greener this year with compost bins to puke in!\nThe union st festival: soooooo much food... And chicken skewers!\nThe union at festival: where the overall hotness of the crowd goes down every 30 minutes starting at 4pm(I can't take credit for this - it was actually a 60 year old dude saying it to his buddy towards the end of the night)\nThe union st festival: where random vomit is practically a handshake!", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-05", "description": "I enjoyed this fair immensely last year - of course last year I didn't know my toe was broken until 6am the following day.  Alcohol as anesthetic...\r\n\r\nThis year I worshiped the sun, avoided the beer gardens (marina containment camps...really...you tell me what they're for then), and thoroughly enjoyed poking through the wares at every jewelry vendor.\r\n\r\nLeft by 3pm - perfect timing as the containment units become full then and they start letting them out into the general populace again.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-12", "description": "The port-o-potties were surprisingly ... accommodating ...  \r\n\r\nWay better than trying to leak your lizard at:\r\n\r\na)  Notte (aka cattle call)  Is it NO-TAY or NOT???\r\n\r\nb)  U-Street (Help!  I lost my contact in the sink! Nobody come in here!  - Unknown Fratboy)\r\n\r\nc)  Kickass courtyard party where the owners \"lost the keys to the house\" - Hrmph,  a likely story.\r\n\r\nd) Prego - UGH.  Don't remind me about having had to disinfect my feet.\r\n\r\ne)  K.T. which nobody can find because they're all looking for a sign that says Kelly's Tavern.  Bah!  Amateurs!\r\n\r\nThanks to the U.S.F. for giving us an opportunity to fill bladder, empty bladder, repeat...", "author": "lulu p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "NOTE: THIS IS A REVIEW FOR SUNDAY\n\nI am not a fan of popped collars or men in pink. My friends usually have to drag me kicking and screaming to Union Street for anything, and the farthest I go into the marina with out complaint is Black Horse London Pub. \n\nThat being said, I had an Okay time at the Union Street Festival. Sunday is the perfect time to attend (as all the quality men and women are still hung over from their wild night out). The doushebaggery is at a minimum, vendors are not over crowded, the beer garden is not scary packed. I bought a beautiful engagement gift for my best friend (which I still haven't mailed) . \n\nNot too bad. I attribute my zen attitude in venturing into the marina and having an okay time to my friend Ben comparing it to visiting the zoo. I am okay going to the zoo to visit the animals and see how they live, when  I make the decision to go to the zoo I have a good time, it is only when I see the animals escaped and wandering around in my neighborhood that I freak out. You don't visit the zoo every day, much like the marina.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-06", "description": "One of the lamest outdoor festivals to occur in San Francisco.  Held every first weekend of June, this is nothing but an excuse for college kids to come out and get drunk in the afternoon.  I just don't see the point of people getting outside if they're just going to gravitate towards the fenced enclosures where they can drink.  Laaaaame!  Some of the art was impressive, preventing a 1 Star rating, but all in all it just wasn't anything special.  Some typical landscape photography on display of the same ol' SF sites and some interesting exotic clothing that can be found pretty much anywhere on Haight.  Just a waste of time, unless you happen to find some good BBQ there.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-06", "description": "This is a fun event, but take a cab because finding a place to park will take a lot of time and could cause frustration.  Take it from a guy who drove around for 20 minutes before getting lucky with a metered spot.  Thankfully, I had enough quarters to get an hour and 20 minutes on the meter (one quarter is 10 minutes), which was all the time I needed to check it out.\n\nThis year, the event was huge...maybe 10 city blocks?  The weather was perfect with men in shorts and women in sundresses.  On the Steiner Street end, it started with carnival rides for the children.  Then, the rows of tents with arts, crafts, food, drink, and other things began.  There was a band performing on one block with people sitting on astroturf in the middle of the street watching.  Boy did that look comfortable!\n\nThere was a plethora of food options.  Go with a group and you will inevitably try more things.  I got screwed in this department as the two people I went with got sandwiches at the Lucca deli before attending.  Who does that?  I had a BBQ pork sandwich for $8 that was pretty good.\n\nThere were a lot of bars and places to consume alcohol, but you couldn't wander around freely with a beer in hand.  That was a bit of a shame, but rules are rules.  The result was a family-friendly atmosphere.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-06", "description": "I love the people that knock the Marina yet still flock here!  Must be all the beautiful people...sorry, what can I say?!  Why come to the Marina just to complain about Marina girls and \"frat boys\"?  I love this festival, always have, always will!  The weather this year blew, but it is summer in San Francisco!  \n\nI agree with Kirsten V., the KEY is not only having your own PRE-Union Street party, but also hitting up all the bomb ass house parties in between.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-02", "description": "I like Union street, I do. I like to shop and it has cute stores. I, however, just can't handle the Marina. Nope. And everything I dislike about it can be found in the beer garden during this \"festival.\"", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-08", "description": "This street festival is never as good as I want it to be. It really has more of a booze-fest vibe and a lot of the vendors are unimpressive. The only things Marina/ Cow Hollow-ish about the entire thing are the massive amounts of alcohol consumed and the general feeling that most people wish they were still in college. As for what's being sold, it's all pretty cheap, ugly, and average (with a few notable exceptions). \n\nHowever, if you are into binge drinking on beautiful sunny days in San Francisco -what luck, btw!- then you'd like it there. I ran through on Saturday morning and actually attended Sunday- they seemed comparable. Beer \"gardens\" are a bit tacky, but as soon as you're drunk you won't care.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-04", "description": "*The event with the highest cop : yuppy-white-kids ratio* \n\nAs much as I love making fun of the marina and as much as this is a frat party scene (...with a sizeable splash of old folks and kids in strollers and on leashes), i enjoy it (ouch that hurt to say), well, for an hour or so.  It always ends up on a sunny and warm weekend, and its always a fun people watching time.  I'd probably give four stars if i weren't so embarassed and, well, nevermind, ...too something to admit liking it a little.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-04", "description": "\"YEAH, THE SUN!\"  Omgawd, it was freakin hilarious!  Everytime there was a little glimpse, people would scream like they were at Disneyland.  And oh, the beer garden was funny.  Lots of ass bumping traffic.  Only reason I'd go back next year:\n\nCorndog, Polish Dog with Extra Onions, Garlic Fries and Meat on a Stick!  Yes, I had all that in a matter of 2 hours...and I'd eat everything in the same order.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "Hooray for Blue Moon!  I love that they let me paint AND taste beer!  Woohooooo!", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-05", "description": "A shining example of why no place--even my beloved San Francisco--is perfect.\n\nIt's just so sad and disappointing to see such a beautiful part of town handed over to a bunch of mindless, cliched people that find such great delight in turning it into a giant frat party.", "author": "Derek R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-12", "description": "Since this is my first SF fair I can't say whether it's the best or the worst but I do know I had a really good time.  This was either due to the company I was with or the copious amounts of alcohol in the beer garden, or in the dive bar just off Union, or the pitcher of beer at the pizza place many blocks from Union.  No, it must have been the company.  Or the endless booths selling fried, bbq'ed or grilled everything?  No, no, definitely the company.  Maybe all the talentless over-priced artwork?  No, I know what it was.  It was the fact that the company I was with (4 grown adults) merrily ran from the third round at the dive bar to the child-sized tea cups to squish their generously adult-sized asses into quickly twirling plastic death machines.  \n\nPossibly to make it easier for the carnies to break the tea-cups down when the festival was over, the cups were only loosely screwed to the tray they were sitting on.  Hence any slight movement within the cup, caused it to spin wildly out of control.  After what seemed 60 minutes of non-stop torture we got out and quickly came to our senses.  We then remembered how old we were as we stumbled much less merrily to the porta potties.", "author": "Shelley H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-08", "description": "After what seemed like forever to find parking on the busy streets of San Francisco, we decided to pay $10 at the middle school to parking. It was just a short walk up a few blocks to the festival.\n\nUnlike the festival at Campbell, the weather was just perfect. Windy yet sunny weather, so those could wear a light sweater if they wanted, or like most, t-shirt less and short shorts. \n\nThe food was pretty good. Most vendors had similar products. We had the fried seafood platter ($12 for fried shrimp, calamari, oysters, and catfish all on a bed of garlic fries), BBQ Chicken Kabob ($7), Tri-Tip Sandwich ($8), and Funnel Cake with Strawberries and Whip Cream ($8). All were pretty good, your typical festival foods. Wish we could have tried the Osha Thai food but we were pretty stuffed!!\n\nThe crowd was generally catered to the upper 20's, mid 30's crowds with balcony parties in almost every block. \n\nIt was alright, wish we had some people with us to make it even better, but at least it was something to do!", "author": "JQ V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-21", "description": "The festival itself is pretty vanilla and lame.\n\nHowever, it's a great excuse to bring all of your friends out to a bar or house party at 11:00am.\n\nAnd that's enough for me.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-31", "description": "Wake up at 8:00 AM; apply heinous amounts of make-up and cutest outfit recently purchased in hopes that sun will shine in San Francisco.  \n\nTake taxi to friend's house.\n\nCommence \"Brunch\" as defined by fraternities everywhere and refined by their graduates now living in the Marina.\n\nStumble out into (fingers crossed) sunshine, and strut (or one leg race) to Union Street.\n\nBecome overwhelmed by sunglasses, people and noise upon which time escape to the beer garden is necessary.\n\nNo idea.\n\nWind up dirty and tired on some poor soul's back porch/living room/roof deck, hoping that pizza/BBq/more booze is on the way.", "author": "Grave Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-30", "description": "When I was 22 and went to Union St Fair...which we call \"San Francisco's National Make Out Day\" because everyone gets drunk and makes out...it was like so much fun! No way! YES WAY!\n\n23, 24, 25 even... still fun...especially if the sun is out.. I mean I LOVE getting squished in a beer garden, waiting in a long ass line for my beer, spilling my beer all over my newly purchased slutty shirt which should increase chances of making out, then having to stand in line to pee \"like a race horse\" at the port-o-potty where nasty drunk old dudes hang out to hit on you, ***and getting my ass groped by random drunk ex-frat boys that still think they are in college. ....It used to be fun...so much fun that I had friends from other cities fly into town for this...from Philly and San Diego...we went to Andrew Firestones pimp pad for a par-tayy baby! I was so cool back then we would play beruit in bar None...walk around spewing such horrible phrases as..\n\n\"Oh my Gawd I am soooo wasted right now ...giggle giggle giggle...let's do more shots and find that hot guy in the 'I'm Trouble' shirt\" OR \"Duuuuude, I can't believe I made out with that guy, he was slobbering all over me hahaha...was he even cute? ..aaahh who cares, where we going next?\"\n\nNOW, I went this year, was so pysched, got my \"Ho on the Go\" shirt, actually fixed my hair and gross it was cold, foggy, and WTF happened to all the good looking marina people? I didn't see any of them...in fact I walked all the way to North Beach to meet my Swedish friends who were watching the Sweden vs Denmark soccer game after being at Union St Fair for like 1 hour...that's how much Union St Fair sucked this year....\n\n** Side note** Have you ever noticed how at every bar there are always a few random loner guys that hang out near the womens bathroom line? Get a fucking life...don't hang out here that's so not fair! We can't escape you whilst we wait to pee!!??", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "Im new to the city, so I don't have alot of SF Festivals to compare this one to, but I had a great time. I ended up goin both Sat and Sun. \n\nSaturday was a day of drinking.. the beer gardens we're great, a frosty Blue Moon on a warm Spring day in the City. Awesome!! \n\nIt was a little over crowded... but that's a small price to pay to enjoy the festivities.\n\nDay two I went for the food and to see the 'sights'. There is so much going on, it could take you all day to really soak it all up. The art was cool, music was solid, the food was great... BBQ, Thai, Indian, you name it, it was there. Great place to grub!\n\nCan't wait for next year!", "author": "Blake W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-05", "description": "I love the Marina. \nIt has taken me a long time to admit that and if I could move to anypart of the city I would be in the Marina. \nI am completely sober at the Union STREET Festival as one I hate porta potties AND paying $$$ for bud light (no monks involved or NMI)\nwent to Matt Seligas annual Union Street Festival Party and the heat told us to get off the fire escape. I thought about going on the ranch opposite of fred but thought better of it. As always his party had a number of attractive women. If I could move to the city I would live in the Marina. If you have a house in the Marina and you are going to Tibet for a year and you need someone to pick up your mail then I will charge a nominal fee if you stock your fridge with turkey and vegetables. Could I drink grilled vegetables. Also you will need to include a parking spot and a use of your car but your mail will be taken care of.", "author": "Marcus R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-15", "description": "1. Abercrombie & Fitch uniforms? Check.\n2. Beer Gardens because the more you drink the better I look? Check.\n3. Strange vendor selling wooden oversized watches? Check.\n4. Amateur night in the daytime? Check.\n5. Obscenely long lines for food? Check.\n6. Hilarity ensues? Check, check, and check.\n\nWhat? You've never been to a fraternity/sorority party in college? Then come on down to the Union Street Fair. You too can see drunken debauchery. Chicks hanging out of apartment balconies. Rooftop yoga! Strange leathery women! Yes, wear your club gear leaving the house at 10AM! AWESOME!\n\nSay what I will, I love this fair. Pissed I missed it this year, but I\"ll live because I know (say it like DJ QUIK) we'll do the same ol' thang...NEXT YEAR! Woot!\n\nBIG TIPS: Parking sucks in the area, but if you got 10 bucks or so, you can park at the Marina Middle School off Chestnut. Walk a few blocks and you're good to go. Also BRING CASH. The ATM line is redonkulous and why stand in line when you could be gawking at all the fakeness all over the place. It's too fabulous to miss.", "author": "Charlene L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-01", "description": "What a disappointment today was at the 'green' Union Street Festival.\n\nWe searched high and low for the advertised 'organic farmer's market' to no avail and also never found any area with 'arts and crafts created with recycled and sustainable materials.'   I saw ONE booth with handbags with recycled candy-bar wrappers but I had seen that years ago.  We walked the whole thing beginning to end.\n\nThere WAS a half-block, disgustingly sad Saab display - yeah, CARS are real eco-friendly.  I heard someone oohing over a prototype bio-diesel car - you know, the same technology people have already been using here for years now?  Someday Saab says they MIGHT POSSIBLY sell one FOR REAL!\n\nBut probably the things I found most annoying though were: 1)  the requirement that to have a beer you stay in one of the sad and crappy 'gardens' they made to cordon you off from the actual festival 2) a guy shouting to his muscle-bound friend that someone next to me  looked like they had a face like 'a little faggot' and 3) the amazingly busy republican sign-up corner and all the people (who I always fear are brain dead, naive, or evil) with McCain stickers proudly displayed on their backs and the silly Schwarzenegger campaign about preserving the very things he has taken steps to exploit.\n\nSo to summarize: it was much of the same crap as every other street festival only you can't walk around with even a beer and you might get called a faggot while being surrounded by inconceivably proud McCain supporters.  Yay!", "author": "Drew D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-04", "description": "I went yesterday to my 2nd Union Street Festival.  \r\n\r\nSay what you will about the \"experience\", but the crowd is a pretty good looking one.  They are also *very* interested in drinking.  Hard, fall-on-your-face-at-11am-drinking.  I respect that. \r\n\r\nAll this being said, if the weather is nice, check it out for 15 minutes and then go to Zeitgeist where you'll be able to relax with a beer.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-05", "description": "I'm torn as to how to \"rate\" my review because it is not so much for the Union Street Festival as it is for Steven Restivo Event Services who puts on the Union St Fest.\n\nI live in Cow Hollow and really enjoy the Union St Fest. I like all street fairs really though, Haight, Fillmore, North Beach... I like to walk around outside, listen to live music, hang with friends, and mostly: eat \"meat on a stick\" which they all serve. I think they call it BBQ'd Chicken or something perverse like that. I call the shots as they are.\n\nEach year (for the last 5!) some friends of mine who live on Union St have a big party during the festival which allows all of us to get together, drink, dance, and be merry and peruse in and out of the street festival. It's a well managed production, with control of who comes and goes, safe, in control, etc....\nThis year Steven Restivo has put an end to it, and the festival hasn't even started yet! Steven took it into his own hands by calling the police, the fire marshals, and LANDLORDS of the apartments and buildings on Union St ahead of time, to ensure there were no parties this weekend, OTHER THAN THE ONE HE WAS THROWING. It seems he's a big cry baby and thinks the house parties which are a custom with Union St Fest detract sales from the Beer Gardens he hosts. So he's doing whatever he can to ensure he makes the most profit and no one has any fun.\nAs a result we are all boycotting the beer gardens at Union St Fest this year (and the Fillmore Jazz Fest which he also puts on). Anyone who's partied in a house for Union St should do the same.\n\nThe Union St Fest house parties make it the special event it is, and SF what it is. I mean, first Bay to Breakers, now this! What Steven Restivo doesn't realize is that they bring more people to the festival and thus boost overall revenue. Hopefully, he'll realize that this year!", "author": "Brooke R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-31", "description": "i'm surprised there's no reviews for this year's Union Street Festival. \n\nThe weather was perfect today- not hot and not cold- but perfecto!! it sucks walking around when youre either sweating like hell or freezing to death! Anyway...I walked the festival today and had a pretty good time. I was so happy that they had a lot of security and completely blocked off the alcohol section and kept the drunkies out of my site. Some people get so drunk, wasted and act a fool in public- im sure you know what i mean :)\n\nThey also have a kids section which was cute. It was definitely an \"eco-friendly\" theme and they had a bunch of cool stuff for sale including purses/bags/wallets made from recycled paper. They also had a lot of stands selling cool art and frame photographs. I generally don't buy much from fairs/festivals- i'm mainly there for the food.\n\nAnyhow, they had a variety of food that were all yummy. Osha Thai had their own little stand, and there was also a bunch of bbq stuff, corn dogs, hotdogs, garlic fries, etc... My bf and I bought a cheesesteak sandwich which was delicious and a bit messy to eat. We also got some shanghai lumpias which taste like the ones we buy from Ranch 99 and deepfry ourselves at home, but oh wells! We also had a chicken terriyaki stick which was very tasty and then for dessert, we bought a funnel cake with fresh strawberries...it was so freakin good...warm...yummmmmmmmm!!! oh we also got a lemonade- the cup was eco friendly as well which was pretty cool.", "author": "M W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-22", "description": "You wake up on Saturday morning, excited about the pre party, jazzed about the festival.  You stroll down Union, unencumbered and strolling freely.  Then it comes time to get a beer, and they put you in the cage (beer garden) with a hundred thirsty Marina kids.  \n\nPopulation density outside the cage = 10 people in a 30 foot by 60 foot area\n\nPopulation density inside the cage = 150 people in a 30 foot by 60 foot area\n\nI'm all for the festivity of the weekend, but the beer garden thing doesn't make any sense to me.  \n\nI'll see you at the post-party.", "author": "Cully W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-03", "description": "Ever since I went last year, I've raving and ranting about to all my friends and co-workers. and Once again I left fulfilled. Satisfied by pints of beer, good conversation and the garlic fries. \n\nSure they had a lot of booths. and lots of food product stands pushing free samples. but basically i go for the beer, food, music and the thousands of people walking through the streets.\n\nYou will most definitely see me there next year!", "author": "Maureen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-02", "description": "Went there on Saturday, it was cold, didn't see any farmer's market, it was cold....\n\nWhere the hell was the farmer's market????\n\nMy co-workers were scaring me that it would be like 10,000 frat boys screaming with beer and their Paris wannabe hoes flooding the street and stuff, but they were all \"caged\" away in the beer drinking section or some house parties around there, so no disturbance to the general public. Cool.\n\nWhy do those college kids always scream with beer and stupid hand sign? Why do those hoes say \"like\" and \"oh my god\" so many time?\n\nCrab garlic fries! Cool but $8 on the street, damn.", "author": "Kokoro I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-08", "description": "Great: Eye-Candy and fun times with beer and fair food", "author": "Steve M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-01", "description": "The teriyaki chicken was real good.  The tchotkas, doo-dads, and what nots were also interesting to sniff, taste, and try.  But, the Soompas were out in large numbers.  If you want to know what those are, you need to do further research because there is not enough room on Yelp to expand on that thesis.  \n\nThere were many house parties.  I was fortunate enough to attend a few.  One in particular consisted of Beer Pong, some sassy dice game, and genuinely phat social kats.  \n\nI was surprised to hear that the inhabitants were not homegrown San Franciscans but, actually were injected into the area from surrounding cities.  \n\nIsn't it interesting that most people who make the soul of a city are actually not from that city originally.  What a surprise...what a relief.....", "author": "Mo H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-06", "description": "It's time for the 33rd Union Street Fair in San Francisco!!! One of the most festive street fairs in the city, it was an event not to be missed, as there was food galore, beer gardens, and numerous vendors. Gino, Jacklynn, and I decided not to go through the parking hassles and took the BART up to the city. Excellent chicken kabobs and spinach/potato knishes abound!", "author": "Stanley C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-03", "description": "I'll give this event 2 stars cause it had a good selection of different types of food, chicken skewers, potato knishes which were yum.. it was a little too over crowded and there really wasnt alot to actually do, except for walk up and down and look at the artsy stuff, or listen to a hard sell from the napa guys who were trying to rope you in to attend things in the promise of free trips..... \n\nThey did have funnell cakes and a few small areas where you could sit, but really nothing to look at, listen too, and the bars on the street were just a mess, mobed. also going to give it the second star cause entry was free, and maybe people attended to actually buy the lovely art work and stuff that was laid out in the tents in other words had other things to do their except drink.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "Good times for sure.  Lots of cool stuff to look at. Lots of hot people to look at.  Great weather this year was a huge plus.  Things started gettin a lil rowdy towards the end of the festival with all the 20 somethings and day drinking going on and the cops were pretty strict with the \"no open containers unless ur in the designated area \" rule. But still managed to get MC Hammered with my drink in my water bottle and enjoy the atmosphere!  We hit up a few of the house parties on the block as well as the bars and conveniently crawled out to barnone later that night.  Got too trashed to drive home and unfortunately left the car in the Marina School parking lot overnight which led to a $25 overnight fee which blew balls but at least we didn't drink and drive.  Fun day and would go back today if it weren't for this hangover.", "author": "shauna a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "I came on both days this year and we were fortunate that the weather was very nice (today was a tad bit windier). The block near Steiner has a lot of kiddie rides and face painting, which was cute. The other blocks have your gamut of vendors, olive oil, clothes, paintings. We stopped off and bought habanero balsamic from a place up in Ukiah and Japanese inspired t-shirts. Osha had a stand with yummy food and we also had vegan food. I got a mini red velvet cupcake from Kingdom Cupcakes for $1 and it was delicious. We also got corn on the cob for $4, which was good but kind of pricey for corn. Fun affair with lots of people. Saturday seemed more energetic with lots of people having house parties on the blocks around the festival. Sunday was more calm.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-15", "description": "drunk yuppies.\n\n\noh yeah and you can buy stuff.", "author": "Flemm F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-05", "description": "God I love this festival.  Each year we switch off houses to throw a pre-party which is crucial when rolling to the festival with a significant dent.  I always always make new friends and it is house party galore.  This year since Ustreet was closed we spent most of our time at Osha.  It was really really fun and comfortable.  Only geeks would give this festival less than five stars as you obviously didnt sniff out the bomb house parties.  Or you just weren't lucky enough to be invited.  Sorrrrryyyyyy!", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-26", "description": "I'm so glad I don't work at Jamba Juice on Union STreet anymore, because my team and I dreaded the Union Street Fair. Imagine Mardi Gras except every white person next to you make over 70k a year and will run you over with their BMW over a parking spot. Add in the copious amount of Beer and you have a Fajitafgate time 300 in your hands. The Jamba Juice would be full of people lined up JUST to use the restroom and after we closed, a bunch of trustfund babies tohught it would be funny to piss on our door! Trust me, its way too crowded and its obvious everyone isn't there for the arts and crafts, which was its original itention, to showcase the neighborhoods artists.", "author": "Harry B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-04", "description": "Hands down, the funnest festival in all of San Francisco.  I'm sure most of you will disagree but hey, to each their own.  I love it because all the foxy people come out, get friendly and the weather is always gorgeous (although this year, it could've used a little work) I love it because it's in my hood which makes it even more fun to run into people and get into TONS of trouble!  The past three years I've been, and it's never let me down!  Anyone, which is most of you that have reviewed this festival and gave it one to two stars, probably didn't get invited to any house parties, so yeah, it would suck to be you and get stuck in a beer garden checking out fugly art!", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "This fair takes place on Union Street ~ Gough to Steiner on 6/2 & 6/3 10am-6pm. GL in finding parking.\n\nFeaturing fine arts and crafts, entertainment, great food and children's activities, this place is def a place that hits the spot whether it be for locals or not, like me!!!\n\noh, how this place brings me such fun filled, fond (snorts) memories, but sadly, it's just a memory ... Thanks for the memory Mr L!\n\nwhat do i remember from this place? crazy people bumping into each other, having a bad tummi~ache (i wish i hadn't, so i could've eaten corn on the cob, BBQ ribs) drinkin at this bar, eating ice cream, picking up MAD samples of the crest glide floss, witnessing my friend floss his teeth in front of this bar, having to pee so bad i couldn't walk 4-5 blocks... \n\ncame here last year, on 6/3/06, for their 30th annual... but this yr, because the days fell on a diff day, it fell on it today and it will go on tomorrow for those who happen to be in the area...sry for the late notice... i was SUPPOSED to be there this wkend but due to personal commitments, i'll be in the 415 in a few...\n\ni kinda remembered this day but kinda didn't until a friend IMed me today and reminded me..\n\ncrazy...\n\ncrazy also how time flies...\n\n(sigh)\n\nso sad, so sad ... for those who haven't been, i have to say, it's a great place to come out and enjoy the fun festivity! have to say, it was prolly one of the biggest art festival ive ever been...\n\nthe crowd is filled with every kind of people you can ever imagine.. from frat boys to soroity girls to young professionals to young moms to old folks, black, white, purple, green, every ethnic group.. \n\ni have to say, it's a great way to blend in through the crowd and not stand out like you're a tourist, especially if you're just checking it out, since everyone's doing their own thing..trust me, you won't stand out... plus, its a great reason to get drunk on the streets for all you drunkards.\n\nparking is truly a nightmare.. my other friend took almost a good hour to find parking for this place, but regardless, it was DEF a fun place to be.\n\nit loses 1 star because parking is SOOO bad !!!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-12", "description": "Didn't think it was physically possible, but this festival both sucks and blows at the same time.  You couldn't walk around with a beer, and the beer gardens were a cluster fuck.  You constantly get elbowed in there and I wanted to kill these douche bags in there who kept on yelling when the sun came out and went away.  When I tried to drink a beer on the streets, I was asked after one sip to pour it out by a cop.  The fair food is always a plus, and there were some hot chicks there, so that's basically all it has going for it.", "author": "Gani U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-05", "description": "The GUARANTEED TO SEE YOUR EX STREET FAIR.  ugh.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-06", "description": "My poor parents, who live in the neighborhood, brace themselves for this weekend every year, and swear that they will ban the beer gardens, if it's the last thing they do (you heard me right). At the height of the drinking (Saturday afternoon), the roar coming out of the beer garden is enough to make you run for cover (perhaps to the Marina). They would give their first born (me) to make it the Chestnut St. Fair. Anyone willing to sign the petition?", "author": "Leah B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-14", "description": "Only fun because we had brought our own bottle of lemonade-vodka and gotten drunk on the walk/cab ride over. Besides that, this festival was crowded with people who were a little TOO dressed up for a daytime family festivity. Tried out the sausage stand, not too impressed with the bratwurst. Had a little bit of the chicken strips, nothing spectacular. And the bf helped himself to corn on the cob smothered in butter, but not smothered enough. And best part of my day, the mini red velvet cupcake from Kingdom. We didn't bother hitting up the beer gardens, they were overly crowded and I don't even like beer. The booths, as far as I can remember were lively and fun, wish I had more time to stop and look at the local arts and crafts, but I did cop myself a cute little green pearl necklace.", "author": "Anh P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-05", "description": "Soooo here's the deal...I'm an equal opportunity day drinker, which means that I'm happy just about anywhere on earth at 1 PM with a beer in my hand. With that said, the vendors are uninspiring, the crowd can be annoying, and it's a bit too crowded for my taste. Howwwwever, the house parties that usually accompany the festival can be fun, so I can't run around dissing it too much. Oh and did I mention the corn dogs? Yumm in my face.", "author": "Kristen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-04", "description": "Now I know what it feels like to be a cow trapped on a jam packed farm trying to get some beer...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-15", "description": "So my friend and I decided to check out this festival. It was fun with out a doubt.. SO SO much food.. And about everything you can imagine. Lots of shopping on the street and off the street.. Tons of cute guys and fun people. Def a San Francisco must! My only complaint is that you can not walk around and drink beer! Why? Why the hell not? Oh and lots lots of cops everywhere. Fun but beware of these things...LOL", "author": "Samantha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-31", "description": "i love daytime drinking holidays, e.g. cinco de mayo, july 4th.  (ok so it's a \"fair\" not an official \"holiday\"...whatever.) how can you not? i love the marina (yeah yeah...i don't want to hear it. go read my review of the neighborhood.) the street fairs are classic SF *local flavor* and the union street fair is a quintessential marina holiday...(2) sunny days, tons of friends, beer & art. i can't wait. \n\nso don your big sunglasses, short shorts, high heels and headband (or cargo shorts, flip flops and collar-popped polo) and meet me in one of those beer gardens! some other yelper wrote that it should be thought of as a \"marina\" theme party...perfect.", "author": "rachel l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-05", "description": "Union Street Fair is a great time. My kids can run around like manic idiots, similar to the much more drunken 20 and 30 somethings here. Guess I was jealous!\n\nShame that there are beer gardens, and ALL those bars lining Union St. cannot sell booze that hopefully sane, responsible adults can walk around drinking. Would make it easier for the arts and crafts booths to sell some of their hideous stuff.\n\nAbout four or five art booths with some incredible works! Hearts with the industrial look made out of metal or the collaged photography by forgot his name?\n\nKids area is great, bounce houses and games keep the rug rats entertained.. They need an adult bounce house, would pay to see drunken antics in there.\n\nAnd those almonds coated in what surely must be some narcotic were awesome!", "author": "David B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-16", "description": "Ehhhh... it was ok. I came last year and pretty much just drank at Bus Stop all day, completely oblivious to the actual festival going on outside. This year, I stopped first at a house party, then walked around the festival. Not wanting to waste any of my unemployment checks in the over-crowded bars and beer gardens, I shared some garlic fries with a friend, and walked around and looked at arts & crafts, people watched, and took as many free samples as possible.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-03", "description": "100. slowest there. Why this review? It was one of the first events i attended moving here. Yes it was much better back than. Yea Yelpers have \"reservations\" about \"residents.\"\nI guess for me. It was a reminder of the festival in my little blue collar neighborhood. We at least had Craps for fund raising. It attracts many people. You run into those you haven't seen in awhile or co-workers you might not have spent time with. It's what you make of it with friends. Bad points, being a woman and having to use a decent restroom. That and staying ahead of the crowed. Oh and where was Bella and rest of crew. \nSure you need to take a lap around. You have to be able to say you saw something on the street. Grab some food. Yea i wanted to eat at Left at Albuquerque to but it was too crowded. Beer gardens = beginner. So at some point it becomes a pub crawl ending up at KTs on Lombard so catching a cab is even possible.\nSo 100. I could have reviewed Yelp and the fab women that run events. Seems passe now. I got here too late. I also need to venture out for a bit more exciting things. Oh well. Fleet week is coming up. Maybe I can hit 200 by than.", "author": "Mark A P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-07", "description": "Went down Saturday evening 7-ish not realising it had closed at 6 to witness a bunch of 20-ish white males throwing balls at each other from an upstairs balcony into another bunch of similar demographic in the street.  They were pretty good humored, but very drunk.  There were lots of balls flying around and some pretty heavy - footballs, basketballs, medicine balls, those squishy things that people do pilates on.  Lots of these balls flying all over the place - only trouble was this was between Gough and Franklin - open for traffic.  Sooner or later one of these balls hits a taxi cab - pretty hard thunk actually.  Taxi driver gets out picks up a ball yells at everyone and no-one and flings it into the crowd.  Just the slightest bit of change in the atmosphere - what's he going to do next?  Security guys still hanging around the festival eyeball all this and enjoy the spectacle calling in their pals - take a look at this lads (apologies for schematic rendering of security guard patois).  Hmm. is this the height of responsible event security?  Anyway, taxi driver realises that  sun + alcohol + testosterone = no chance of getting any sense out of these guys.  Gets back in his car and drives off.  Kind of funny, but kind of edgy too.  Not sure what happened next - we wandered off back to Polk.\n\nSunday we came by again by accident.  (We're new in town - could you tell?)  Got off the 22 bus at the Steiner St end and wandered through at about 3 o'clock.  Kiddie-centered rides, roundabouts and face painting and so on at this end - then the usual food, clothes, beer, SFPD, SFGate, NY times (completely empty) Zipcar stalls, more food, clothes and beer.  Those beer gardens are noisy.  There's a stall selling faux-retro-ad placards - picture of a glass of frothy beer - caption: \"the best head in town - get it here\" - the old ones are the best, right?  I nearly buy one, but catch my wife's eye - maybe not.  She's right of course - bad jokes about fellatio soon go limp.  Instead, we buy a straight one of \"Wizard of Oz\" which has a good pic of Toto - dead ringer for our dog Barney - aah.\n\nAbout halfway down, we see lots of people sitting in a cross street waiting for a band to come on.  Everyone totally focussed on something - can't quite see what - oh yes, it's a man with an iguana on his head.  Thought for a moment it's the same guy who walks down to Union Square with his rat on the back of his cat on the back of his dog - but no it's a new act.  At least, it's new to us.  But then, everything's new to us.\n\nNot quite sure in the star department.  If we're here next year and still living nearby we'll drop in, but to be honest, I don't think we'd make a big detour.  Didn't catch any of the bands - were they more interesting than a man with an iguana on his head?", "author": "Nick J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-05", "description": "I can't say I fully experience this fair as the beer gardens are just not something I'm up for...however, as someone who used to sell handmade jewelry at fairs, the selection of art and photos here was pretty good. Of course there's the usual weird crap you're not sure who buys...but there are also a great handful of artists who are just like us-- cool people who know what's cool to wear or hang on your wall and they're just waiting for us to buy it. So...when you're drunk next year, stumble around and spend some dough, these people are sitting there all day, sweating, just hoping to sell enough to cover the fee for that space and maybe make a little money to stay motivated to create :o)", "author": "Diane S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-05", "description": "I gave it a chance. We went even though our gut and some of these reviews said don't. But  have t say, what a hell hole. Such a shame that so  many find drunk, loud behavior appropriate in order to have fun. What a mess Glad we got out before the drunks started peeing and puking. Will skip it in the future for sure.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-31", "description": "Start at 11am at a friend's brunch party.  Bloodies.  Mimosas.  Bacon.  Chances are I'll never actually make it to the fair, but the neighbors are having a great party, as is everyone on the block above Union Street.  Treat it like a theme party - Marina theme.", "author": "ellyk E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "based on food alone....(i am trying to erase that horrible frat party pit stop out of my memory) and focus solely on the FOOOOD! \n\nday 1: flied lice and veggie chow mein & a pink lemonade = meh; cinnamon roasted almonds = delicious!! gimme some more; and the star of the show: funnel cake with fresh strawberries and whipped cream!!!!!\nday 2: fried artichoke hearts = a first, very tasty; more almonds = yes; chili lime butter something corn on the cob = winner; some kashi cereal and soy milk = random; & a veggie corn dog doused in ketchup = go soy!!\n\nthis plus a bunch of beer = good wknd :)", "author": "Kaylan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-11", "description": "Terrible music blaring from sound system set up practically outside my window.  I usually have to flee the neighborhood for the weekend.", "author": "daniel g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-15", "description": "I use to think this is the best San Francisco street fair.  I went this year and found there were areas of round-up pens to keep the drunken stupors corralled.  What's with the dogs, baby strollers, and drinking?  The day time diminution of sensibility just shows you how low a neighborhood can stoop over the years.  I saw lots of vacant business fronts which  gives me an indication that this area has gone down hill.  The fair vendors were not quite as exciting.  The good ones were too smart to try and sell their ware where people spend mainly on booze.", "author": "Nanette L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-02", "description": "This was my second year checking out the fesetival, but again, I wasn't very impressed.  While the weather held up, I wasn't too intrigued by any of the stands.  Last weekend's Carnaval definitely had more appeal to me.  My favorite part of the festival were the Kashi booths.", "author": "Allan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-04", "description": "Well it was much better this year then in 2006. Maybe because i was in better company? I dont find everyone to be having a great time and I hate that anyone that drinks is restricted to those beer gardens (well, not us...rule breakers!) Bay to Breakers is so much fun because people let loose and just have fund whereas people at this festival are much more worried about how they look to others. yawn! Boring! Definitely dont try parking nearby it's impossible! Take a bus or cab. Still always nice to be outside in the sun with friends having drinks though.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-04", "description": "I've been to the Union Street Festival for the past 5 years. Granted it was way better back in the day when they closed off the streets and you could actually carry your 40 on the street. Instead, some f-ers probably complained and for the past couple of years, you can only drink in the beer gardens - or as I like to call them, the pig pens. It's no different every year except if the sun decides to come out. Ok art & crafts (who's really going to the fair for that anways), drunk Marina-folks, and anyone who strives to be one of them wondering the streets. It's great for restaurants and bars in the area for business. I'm sure they sneak in double charges on all the beer they sell that day.  Not to say I dont have a blast every year. You can't beat meat on a stick!!", "author": "Josephine H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-10", "description": "Boring vendors and beer gardens to corral the alcoholics, and ultimately a poor excuse to get the Marina eye candy out on the streets.", "author": "Pelle Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-14", "description": "I use to work at Jamba Juice on Union street long ago and seem to be stuck every years working this faithful day. This fair use to drive everyone insane because their would always be two lines out the door, one for the restroom and one for order. (Rich people can get pretty nasty crappying on the floor when the toilet is like 2 feet away). Anyways it was always fun trading smoothies with local shops that were set up for business on that day. Many great snacks to try from bbq corn, garlic fries, to grilled oysters. Art work paintings and scuptures were always fun to enjoy. Trade ratio was two 24oz medium smoothies for 3 oysters....three 24oz smoothies for one corn....wow luckly I was management controlled inventory lol death to that juice hell whole!!!", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-13", "description": "Cheap beer gardens.  Plenty of old friends to run into.  Never a dull moment.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "I went with some friends today and we all had a great time.  It is much better than the past few I went to (including the St. Patrick's Day Fair in front of City Hall and the KFOG firework night).  \n\nMusic: Two stages, one plays Rock and the other plays Latin music.  Both bands were very good and they attracted a bunch of people dancing.\n\nFood: SOOOOO much better than the other street fairs.  A lot of variety and they were all good qualify.  My personal festival favorite is Turkey Legs, which usually run out very early, but not this festival.  It was available all through 6pm.  The Lime Chili corn was insanely delicous.  My friend almost got his 3rd, but we missed it at 6:05pm.  The foot long corn dog was another surprise.  The batter is very well seasoned and light.  I'm usually not a funnel cake fan, but I enjoyed it very much here too.  Too bad the blueberry funnel cake sold out much earlier.  Whoever is going tomorrow should get it early if you plan to have one.\n\nVendors/shopping: Many different types of products available which kept us entertained the whole time.\n\nOrganizer: Did an awesome job.  The festival is big, covering a few blocks.  The walkways on each side are very spacious, so even though there were a lot of people, I didn't get pushed around.  The beer gardens were well controlled. The website provided a lot of information, including a detailed site map, list of the vendors, food menus, entertainment schedule, etc.\n\nThe crowd: We enjoyed the people watching.  The people all seemed friendly.", "author": "E H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-03", "description": "It's fine to go really early in the morning,take your kids on a ride perhaps. But leave before its just swaths of staggering, slurring, yelling drunk youths.", "author": "jen n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-14", "description": "One of the first festivals of the year in San Francisco, if the weather is warm, nothing better than walking around union street, listening to the music, eating corn on the cob or meeting friends at one of the restaurants. One of our favorite places, house restaurant closed down... used to serve good mac and cheese. Great fun people watching", "author": "Sandy p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "Hooray, it's nearly summer and to kick off the fun filled San Francisco spirit, Union street fair is the first of the many neighborhood extravaganzas lined up for the next few months. Stretching from ~Octavia to Fillmore, upscale Cow Hollow is the place to be this weekend. Vendors selling artwork, jewelry, clothes, and more camp out on Union street and city dwellers from near and far weave in and out of the stalls, happily munching on fair food (many restaurants have outdoor stalls) and listening to music. Gen, Kam, and I arrived around 11:30 and perused a few booths, acquiring in the process, samples of tea, olive lotion, free $2 drink tickets at Osha Thai, free teeshirts from a nascent web program akin to facebook, and chapstick, before settling down at Betelnut. As we snacked on kalbi, green beans, and dumplings, we had a perfect few of the surrounding festivities. People seemed to be extremely friendly, and samples abound. Unfortunately the weather left much to be desired, and as we continued down the street after lunch, Gen and I were so cold we found ourselves warming up in Moonstruck chocolates down on Chestnut, for some delicious hot drinks (this time I branched out and got the cinnamon roll latte- extremely delicious and oh so sweet). Luckily the fair continues today, and as it appears to be a bit on the sunnier side, I might just pay another visit.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-20", "description": "one of the most generic street fairs i've seen in sf.  run of the mill craft booths, but absolutely nothing special...hm, maybe it's a statement about the marina at large!", "author": "Roshni R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-08", "description": "I stopped by on Sunday after hearing a few friends talking about going.  The weather was good, nice and sunny with a breeze.  I guess if your scene is \"Bros\" aka white frat or ex frat types, then this is right up your alley.  Lots of hard gelled hair, flip flop n tight polo shirt wearing dudes getting hammered at the beer garden.  I was there on the family tip so, thank God I didnt have to go in there and deal with that.  Girls there were typical of Marina types. The band playing at the time was pretty good, jazz:)  The food was alright as I had a hot link and some garlic fries which is nice once in a while. Other than that, it was just something to do with my son on a lazy sunday.  Nothing special...", "author": "Christian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "i was there today on sunday and loved the blues band that played some swing to. i would have went on saturday ,instead i watched the belmont! union st. is the tops. i  saw some babes.  i  had a good time,good wine and good times....what a nice crowd.", "author": "OSEPH E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-03", "description": "a couple of parting thoughts about the union street festival:\n. boy it sure is a lot more fun when it's sunny and hot out (and people are dressed for it).  seeing hootched-out girls getting goosebumps in the cold is just plain funny.\n. why in god's name would you bring your baby to this?  and why are you attempting to navigate a stroller through the throngs of Drunk Frat Boys in Big Sunglasses (the dominant species)?\n. why in god's name would you even attempt to drive here?  parking on union street sucks even when it's not blocked off.\n. no matter how slammin' your body is, a muffin top is still a muffin top.  loosen up them jeans, girl.\n. note: stay away from the regular garlic fries and make sure to get the BEER BATTERED garlic fries.\n. waiting in line for a half hour to get drinks in red plastic cups is just plain stupid, no matter where you are.  hit up a place like jovino, and whaddayaknow, no wait.\n. do people really buy art at these things?  i mean, it's the same vendors you see at every street fair.  really, why bother?  i appreciated the honesty of bay to breakers more - drunk people running.  just make the union street festival about what it really is - drunk people checkoutfest - and everyone will have more room to roam for hotties, instead of getting herded like cattle into beer \"gardens.\"\n\nevery year, i have more or less the same thoughts about the union street festival.  and yet i keep going.  see y'all again next year!", "author": "brian w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-31", "description": "the start of condoned public drinking on streets for the daylight hours of summer, stolen purses, lost cell phones and less parking in a 20 block radius. take a bus, do NOT take your dog or bike, it will be traumatized and damaged by the human crush.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-03", "description": "nutin special....but why did I go both days???.....ah...the beer garden......", "author": "Roger T."}
