{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "I love this bar, I have been going here for a while.  But keep your eyes out for thieves!  My friend's jacket and phone were stolen by a bunch of girls who might have been from Russia.  Rather than notify the bartender, we decided to leave.  They got very rude and defensive when we tried to get our jacket back from them, which had been stolen, and covered up by one of their jackets, sitting on their table.", "author": "Suzy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Cute/clean bar. Would definitely recommend coming here once you've already had a drink or 2 and with a couple friends. But the bartenders seem to be inattentive. Relatively dead (understandable on a week day) but neither of the bartenders said hello as I walked in. Once I was physically at the bar, one of them was forced to say something to me since she was eye level with me rinsing a glass. So like I said, the bar is definitely cute and clean. More my jam. But it would've easily been 5 if someone at least said hello once I stepped up to the bar.", "author": "Quinn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "One of my favorite bars in the Mission. \n\nI've come here a bunch of times in all of its previous incarnations and it's still a good spot to come to.\n\nI generally come in the late afternoon to chill or get a little bit of work done with a pint. I've had a lot of random conversation with people at the bar which always makes this place an enjoyable spot. The drinks are also still well priced which makes it even more or a rarity in this day in age in the Mission.\n\nThe servers are almost always on point but the bathroom is still a bit sketchy after all these years so 1 star off for that.", "author": "Art O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-26", "description": "Was looking for a casual place to get a drink before heading to the airport, and this was just fine. Nothing bad to say but nothing great to say either. There were a few beers (and a cider) on tap. I asked the bartender what his favorite beer was but he said he didn't drink beer, still was able to give a few suggestions though. \n\nCash only \n\nThe couches were alright but I felt a little weird lounging on them (they gave me a feeling of not knowing who/what has been in contact with them..). Overall seating arrangement was kind of awkward.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "This place was nice. Quite in the middle of the day. \n\nQuaint and simple.\n\nNot super divey but still kinda...\n\nI'm currently interviewing new dive bars and this one is top of the list.", "author": "Steven T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "Great local bar. Divey...super local clientele...strangers  actually talk to each other here. Perfect dive juke box.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "Uptown fuck me up.\nThis place has some rad drinks and good prices.\nGreat ambience was set by good music and chill people.\nGet fucked up here, but expect to be kept out by the staff when you need water and napkins for whoever needs to get home.", "author": "Emilia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "Loved the bar.  Will be back again.    We went for a drink.   Good service.    Not too loud.   Easy to talk to your date.  Cheap prices.", "author": "William G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "um cool bar there are dogs sometimes here. Divey whatever. Normal selection of alcohol. Have gone on two dates here and both dates have ghosted me so I think this place is cursed. That's really all I have to say........... okay it's long enough now and post review.", "author": "Cecilia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "Not sure how I feel of this place.  They have nice ambiance for smaller groups. It's like the hipster version of the Star Wars IV bar. It's in a prime location on the other side of mission .  If expectations are low and you just want to enjoy the company of your friends this place is great!", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Don't want more people coming to the Uptown necessarily since one of the reasons I like it so much is that it's not super crowded and the folks there are chill and real.  It doesn't get the typical Mission crowd on weekends and it's got pinball (The Walking Dead as of July 2015).  The machine gets code updated too when they release new code - like the awesome update on TWD.  Just remember to always go from the drop targets on the left.  Those will enable a mode, and the first time you hit one, it'll lock in to either Food, Weapons or First Aid.  You have to fully light all three to get to Blood Bath.  Once you get all the drop targets down for Blood Bath, it's a two ball multiball and you can add a ball each time you take down the drops again.  This can also be stacked on to Well Walker Multiball or Prison Multiball, so it's super valuable.\n\nThe  multikill values are now like 20 or 25% of your mode value so if you blow up a mode, the multikills can be valuable especially when stacked with 2x playfield or your inlane \"x\"\n\nOh and they have a good array of beers are solid prices!", "author": "Gene X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-30", "description": "Phil Collinsish bartender REMEMBERED my first order when I walked up for another. Because who with grownup friends present gets a can of PBR at a bar anyway? http://whilstinsf.tumblr.com/post/23319325046/when-someone-orders-a-pbr-at-the-bar Nah, I was aware enough to eschew the Peeb for a calculatedly nonchalant Tecate. (It was either that or Red Stripe, both of which really hint back to the same thing.) The second was \"the one with a whale on it\", Scrimshaw.\n\nSpace was chill with limited seating and a RING OF COUCHES we filled till our exodus to the arcade & pool area. The ~60 VIDEO GAMES cabinet was neat, though a number of its titles were obscure. Not \"OG nerdstalgia cooler than thou because I remember it\" obscure but \"nobody played this then and we wouldn't want to now\" obscure. 50c per play, quarters only.\n\nLORD OF THE RINGS pinball was a novel item, but access to its features and progressive scenarios was tough to the point of the game not being as fun as it could've been. It obviously contained characters set up to move and multiple storylines, but they were too strange to activate.\nhttp://www.yelp.com/user_local_photos?select=OMr0nHetvlhSSZjD_OGVhQ&userid=WALNtcSZlONK4Yj-o3pzKA\n\nSurprise box of free LEFTOVER PASTRIES from a later bartender's friend's bakery was cool.\nhttp://www.yelp.com/user_local_photos?select=c93FqCcSvymXr_Of6PiyAQ&userid=WALNtcSZlONK4Yj-o3pzKA\n\nTagged-up no-lock bathrooms were BYOAS (Bring Your Own Art Supplies). And maybe your own door lock.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "Dive bar that smells like a urinal, but exactly what the doctor ordered. The drinks were really well priced, with heavy pours. \n\nIf you like peanut shells on the ground, slumped over locals, and a sprinkle of (nearly) gutter punks and early 1980's mod kids I would suggest this place highly.\n\nSometimes it gets weird when there's no music, that's all.", "author": "Brooke N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "Random and fun holiday Sunday night. Best non denominational mule drinks by the nicest bartender D and friendly locals... SF", "author": "S M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "Cozy, and $4 for a brewski. Good atmosphere, good non-hipster mix of clientele (at least when I was there), and there's a pool table. I like.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "This god damn bar. Well priced, mix of the regulars who have been here for years and the younger. Pool table. Bartenders are all awesome. The juke box holds some good classics from jazz to rock.", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-14", "description": "A chill dive bar, friendly bartenders. Good place to hang out and grab an inexpensive beer.\n\nMy friend was in from out of town and wanted a local beer - the bartender really knows his stuff as they had beers that were brewed anywhere from a few blocks away to across the bay. Went with the Anchor Steam and my friend seemed to enjoy it.\n\nI got my bf the Shim Shah (am probably butchering the spelling on that one..) and he found it had a stale flavor and was a bit flat.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "Best bar in the Mission with pool table and excellent draft beer selection.  Bartenders are friendly and quick with the drinks.  Cash only place and a decent jukebox with a nice mix of classic tunage.   This spot is best after work and has nice comfy booths for getting cozy with someone special ; )", "author": "Zach T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-30", "description": "open or closed?...walking closer towards iron grill...pushing the door and it's open...careful, the door springs back quite fast....casual friendly bar...five:thirty wednesday and moderately filled...taking two seats at the bar....pleasant bartender chatting with another patron on a neighboring stool...waiting for conversation end...ordering two guinness $five each...add a $dollar tip per drink....cash only...place is little rough...aged and worn inside and out....but, comfortable and friendly...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "This place looks sketchy as all get out from the outside. Janky door entrance, cheap linoleum floors circa every elementary school in america in 1965, random mix-matched seating...BUT THIS PLACE IS SO GREAT. \n\nI love that it brings a smorgasboard of people, the drinks are good, they're decently priced, and I can hang with my friends without it getting over-crowded or loud. It's a no-muss, no-fuss bar, and I like it!", "author": "Maggie F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-12", "description": "This place is so gross! I don't see the appeal to it. I guess for the hipster who want to slum it up in the mission.", "author": "Veronica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "uptown! always here for a late night drink. It's close to home so not a big deal to drink more than I should, and schlep the short distance home walking my bike because my vision is a little messed up and its dark. And they have a pool table! everything a dive bar should be, and huge comfy couches.", "author": "Elton F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "I can't say enough good things about this place. Great crowd, cheap drinks ($4 doubles, woot), and awesome music. I was here on a Thursday night and the place was pretty full, but not overcrowded. My friends and I were still able to sit down and hear each other talk. Also, I want to note that the bartender was fair in his choosing the order of people at the bar to serve. I didn't have to wait too long, the drinks were strong, and no one felt like there were any \"favorites\" being picked over them.\n\nThe clincher for me giving this place a 5 star review? Well, I stupidly put my things on the back of the toilet in the ladies room. Note, there is a FAT HOLE IN THE WALL behind the toilet. So, I recently had my iPhone stolen. I had JUST got a new phone that day. What do I do with it 10 hours later? I nearly toss my phone into the abyss that is the FAT HOLE IN THE WALL behind the toilet. My 3 friends and I tried to reach into the hole to recover the phone and none of us could see and/or reach it.  I left my roommates phone number with the bartender, and less than a day later, the bar called saying they had retrieved my phone!!!\n\nNot that I am a pessimist or anything, but there is no way I expected to have had a fun night, paired with cheap drinks AND a bar staff nice enough to actually recover my lost phone and call me to let me know they had it and were keeping it safe and sound forever.\n\nGiven the above, I will not only be a continued patron here, but I will be a BIG TIPPER :) \n\nTHANK YOU UPTOWN BAR!", "author": "Ali P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "Sure, per capita, there are more prostitutes canvassing the streets of Capp in the Mission than any other set of coordinates in San Francisco, but don't let that deter you, as Capp is home to one of the best dive bars in the 'hood, Uptown. \n\nIt's a little off the beaten path, so it's generally not a bar that someone just happens to stumble upon. This is a great attribute as you don't ever have to worry about your night being ruined by a bunch of gasbags or unsavory visitors from East of that long silver bridge taking up residency in the Bay. It's just a cool group of folks who like to have a good time in the company of others with dark lights and cheap liquor. And really, at the root of things, aren't those the bare necessities we all strive for in a dive bar?", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "For over a year and a half of living in San Francisco, Uptown was my local watering hole. It was convenient, considering it was literally a timed one-minute walk from my crappy Capp St. apartment. It was cheap, the fare of a well-drink did its duty as I was rendered drunk enough to view the unemployed deadbeat patrons that visited this fine establishment as almost attractive enough to forgive their questionable hygiene and their skateboards that litter the floor. I was also lucky enough to carve a reputation for myself as a local pool shooter in the back room, because I too, was a local unemployed deadbeat who had nothing better to do than to play pool all day. However, as Bob Dylan once said, these times, they are a changin'. \n\nAlas, the glory days of Uptown are no more as a new customer base started frequenting the bar -- customers that actually have jobs. I left the city right when the PBR stopped flowing, the pool table price was upped to a dollar and the young techies/brogrammers started coming to the bar to get a \"real\" dive bar experience. The worst part? Someone even had the audacity to fix the broken toilet seat in the women's bathroom. If you can't cry or do drugs on a crappy toilet in a dive bar, what's the point? Go back to whence you've came, Stanford graduates who work at start-ups! You're making our shit-hole meet the city's health and safety code! Go code somewhere else. (Pun intended.) \n\nI give Uptown 4/5 for the fond memories and the sharp pool shooters that kicked my ass and taught me how to be a better pool player and for the bartenders, because they don't give a shit about you and that's how all bartenders should be.", "author": "Carolyn H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-30", "description": "There are flys everywhere!!! Even in my drink. My girlfriend refused to order a drink. She was the smart one. when I tell the bartender about it, he just stares at me and says \"well how did it get there? I didn't put it in there.\" ---dirty, insect infestation, and shit service. I will be be filing a complaint with local health agency.  This place is like Russian roulette with food poisoning.", "author": "Nick E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "Sooooo good lookin'.\n\nHot tip - cheap Irish coffee.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "This bar is super cool, the crowd is usually quiet, and overall, a great place to be. There's a piano that people (and myself) are inclined to play in one room, and a great pool table area in the other side of the bar. \n\nCapp street is a really nice place to hang out at (but I've only been to this bar!) It was in a nice location, and the bartenders were extremely friendly.  If I end up back in this area, I'll definitely go there again.", "author": "Clinton J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "People say it smells in this bar but I beg to differ. It just LOOKS like it should smell. They should actually film Febreze commercials here because you look around and all you see are a bunch of unshowered people with greasy hair wearing dirty flannel shirts and you think it's going to smell like body odor but it doesn't at ALL.\n\nThe bartender ignored me, gave me an \"I hate you\" stare when she finally asked me what I wanted, and then rolled her eyes at me but I'm not even mad because I think it is one of those places where they are rude on purpose to be funny, ya know? It would have been way cooler if she had just SAID \"go back to the marina, sorority girl\" but maybe it was her first day on the job and she was just getting warmed up. Next girls night out me and my girlies are totes going to come here and hopefully that dollface can perfect her rude attitude. \n\nOk, in all seriousness the drinks are way too cheap to really care about any of this so the bottom line is that the bar is great.", "author": "Kathryn V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-21", "description": "Don't let the fact that yelp has this place categorized as a \"lounge\" fool you; Uptown is a dive bar! Just because there are some couches doesn't make this place a lounge.\n\nHere are the arguments in favor of calling this place a dive:\n\n1) It doesn't look like anyone has put any money or effort into the interior for the last 70 years.\n\n2) Its cash only.\n\n3) The bathrooms can be at best described as \"no frills\" and at worst \"rough\"\n\n4) Bartenders that range from uninterested to plain old surly.\n\n5) At any given time there is at least one regular customer drinking their life away.\n\nThis is my kind of basic neighborhood dive bar, it's rowdy and cheap; of course it used to be more interesting before they ran all the hookers off of Capp St.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "Cozy seats, friendly bartender, Johnny Cash on the jukebox and cheap drinks. Uptown is a new found favorite.", "author": "Nan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "Why do people talk shit about how dirty this bar is? Every bar is supposed to be dirty and sticky. At least this one does not smell! And crowd does not have a lot of smelly people!\n\nAnd they have couches\nAnd they have booths\nAnd they have a pool table\nAnd two separate bathrooms for the sexes\nAnd there's a juke box\n\nI give 5 stars because of the really nice bartender. I forgot her name, but I'll edit this later to put in her name.\n\nThis is our to go to bar. We know familiar faces. My bf knows more than familiar (no, not at all any intimate, hah)\n\nBut sometimes, the crowd can be really annoying because they tend to play the song over and over and over again. Please, just stop. And sometimes, when the night is mellow, you can see their faces, instead of focusing on socializing with and showing interest to their friends, they look around, every minute or two, to see if there's anything \"going on\". It's kind of like the boredom you see on kid's faces back in high school when they're always waiting for something to happen. But that's just sometimes. Sometimes, the crowd can be really energetic.\n\nI must say, crowd is changing.. Is it because this \"hipster\" scene is no longer at its appealing peak, and people are capitalizing on it since its fall?\n\nWe have met some douchebags here. But there is always a douchebag everywhere.\n\nNevertheless, still a 5 star because it is a great bar.", "author": "Colleen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "I've only been here once but I think it's my new favorite bar. \n\nI stumbled in here with some friends after a few drinks. Saturday night. $2 PBRs? On a Saturday?! In love! I had enough to keep my buzz and catch a cab home. \n\nThe neon lights seemed to compliment all the fine young gentlemen in this establishment quite well on that Saturday night. A friend of mine agreed with me...indeed, there were lots of cute boys here! But maybe we both had beer-goggles on.\n\nAll I'm saying is...it's a cool hangout. Didn't get too crowded, didn't wait too long for a drink and definitely didn't pay too much for the alcohol. That's a dream come true on the weekend.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Super chill, local dive. Even on a Friday night! Got a seat at the bar and my songs on the box.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Approaching this place it looks like the typical dumpy corner bar. There's a cage gate around the doors and the doors are basically painted over wood panels with no knobs ( if I remember correctly). There was even a prostitute or 2 standing outside. But despite the outside it's a nice little bar away from the ultra trendy -ness of the rest of the mission. Fair prices and good patrons.", "author": "Patricia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "decent bathroom, a lot of cool tags and colors on the wall. toilets work so thats cool", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "A great little hipster place in The Mission. The photos on Yelp are a bit deceiving as they portray it as a bit of an older crowd, but both times I've stepped inside, it's been people my age. Mid to late 20's and early 30's. Neighborhood is sketch, as the Mission can be from time to time and I wouldn't advise dragging your jeans on the street corners unless you dig the scent of urine on your pants. \n\nCool style wrap around bar with good music and a bar staff that downright hustles! Despite being 2 deep, I never waited more than 5 mins for a drink. That was simply impressive. \n\nCash only, so bring your Jacksons or be prepared to use the in-house ATM with the industry standard surcharges.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "Super seedy down & dirty dive bar - but totally hits the spot with a generous offering of beers on tap. 2 beers (prohibition & hefeweizen) set me back only $9. \n\nPlace is almost uncomfortably stuffy (in the dead of winter, too) so I can't imagine what it's like in the summer. Don't come wearing anything nice. Also found a booth seat with the foam upholstery entirely ripped out revealing a 1.5-foot gaping hole. lol. \n\nSeems like the prerequisite for blending into this bar is to dress like a certified hipster. Black skinny jeans on scruffy skinny hipster male alert. Go sit at the benches near the pool table and you'll get some nice eye candy from leering at the sagging pants of said skinny-pant-clad scruffy white male hipster. Provided you avoid getting your eye poked out by a wayward pool cue. \n\nGets pretty crowded on a Friday night, but the bar order wait was not too bad - took only about 5 minutes to flag down the bartender.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "I love this bar.  The bartenders are great, prices are wonderful, and there is pinball machine (Lord of the Rings),a pool table and great tunes.  A complete mix of people from yuppies to street.  Everyone is awesome, and if want a good drink with great company...this is your place.  I wouldn't walk the streets alone late at night (duh) but this is a definite go to for us.", "author": "emilie p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-23", "description": "Never before have I walked into a dive and thought \"this place is sweet\" only to leave 2 minutes later saying \"I can't stand the smell of wet dog\".  One day I'll go back and see if it is always as odoriferous as I experienced.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "I was trying to find a place to hang out while waiting for my friend. I came across Uptown on Yelp and thought I'd give it a try. I was pleasantly surprised. \nIt was fairly early on a Saturday evening (6ish), so it wasn't too busy. I was able to get a seat at the bar. The bartender seemed nice. I didn't get to chat with her much, but she was responsive to my requests. I didn't have to wait to get a refill on my beer. \nI was drinking Mirror Pond Pale Ale. It's one of my fav beers, and I was shocked that such a small place had it on tap. And it was only $4.50 a pint!! I'm used to paying $5-6 at other bars. \nThe bathroom had the cleanest toilet I've seen at a dive bar. Maybe because I was there early, but I expected worse in unisex bathrooms. I was honestly shocked when I went in. \nOnly cons are that it was super dark inside and its cash only. Minor items that I can easily overcome. I will definitely return if I ever find myself alone in SF again.", "author": "Robin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-25", "description": "The bartender forgot about me, and I patiently waited for about 5 mins.  When she realized she forgot about me, my drink was on the house. Service doesn't get better than that.\n\nPlenty of seating on a Friday night at 9pm, affordable drinks, diverse clientele.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-22", "description": "Portland frat house chic!  The doorman knows what's up.  Not only was a top hat at attention, but a draped fleece neck-cozy for this cold San Francisco night.  His dress is whimsical, but his demeanor is gruff.\n\nThe couches are a major selling point.  If I'm going to a bar it's to hang out with my two friends and feel like we also have a lot of other friends around us.  Chilling on fluffy couches deepens the illusion.  Cheap drinks, attentive bartenders, congenial crowd, except...\n\nTwo fights happened at the bar tonight.  The first was some tall douche that decked a guy sitting at the bar twice.  The bartenders were super-responsive, removed the douche in question, and handed the victim a damp towel for the blood.  As I waited for my well I watched the dude ignore his bleeding face in order to dry his gentle tears.  The second was after the bar closed and everyone was just hanging outside. Suddenly a chick was sprawled in the road and a dude tangled in his bike.  The chick was freighted off by two friendly goons.  Bike dude stumbled upright when a blonde banshee arrived, fists out.  She started pounding the dude, who was too drunk to fall.  This was the moment I bounced, but the general character of the crowd struck me as restless and volatile.  Not someplace I'd like to be. Ever.", "author": "Ellen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-17", "description": "CASH ONLY! Dammit! But I guess all of Mission is like that?\n\nThis place was alright. It's decent enough for a good time with a bunch of couches and a pool table. \n\nThere's not much to say other than the fact that it's genuinely a dive bar.", "author": "Maggie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-08", "description": "Suuuper divey. Kinda gross. I know a lot of dives that are just as dingy, but have enough character to make up for the lack of hygiene. \n\nPros: Good scotch selection (they have laphroaig), Pool Table\nCons: Gross everything\nSide effects may include: depression upon entering, exiting, or even viewing this place", "author": "Peter F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "One of the best dive bars in the city. Dim lighting, really nice bartenders, great prices, solid draft beer selections, cool juke box, pool table, really chill crowd, a dog or 2... Very cool!", "author": "Ben S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "Where Bikes (and their owners) Go To Heaven. \n\nHeaven includes cheap, good beers, ample bike parking, pool tables, lounge couches, dark lights, heavy mist of sweat&graffiti. Keep in mind-- bathrooms don't lock. \n\nPerfection. Bike Heaven.", "author": "Daniella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-21", "description": "Tracee, myself, and Professor Mike had to attend a screening of a friend's short movie at the Secret Alley on Capp Street. I'd seen the movie before, I knew what to expect, so we got there early to get a few beers inside to numb the impending pain. Shuffling in to the Uptown, which was completely empty, we ordered a round. Our beers were... well, beers - not the best selection in the world - but Tracee was all over her vodka tonic, which was heavy on the alci-mi-hol, and we couldn't argue about the prices. (Cash only, BTW...)\n\nSo we ordered another round. And another.\n\nThe screening went surprisingly well. The complete arseness of the movie was dampened by the room spinning. Wheee!\n\nWe stopped in for another round afterwards, before we met the aspiring moviemaker and her crew for dinner. At this point, the place was full of douches who were trying their best to look trendy - and failing miserably. We downed our round and left.\n\nI'd give this place three, but for simply fuelling me with beer to get me through that screening, they get one extra.", "author": "Gary E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-24", "description": "Seriously Uptown? Do you even WANT my business? I thought the point of a bar was to attract patrons.  \n\nNever mind that the couches smell like a bum peed all over them and the guys at the pool table stand around making small talk and then chew you out when you try to play pool (sorry, maybe you have a pending game, but if I'm watching no one do a thing for 15 minutes and then walk up to start a game and you give me douchy pseudo-hipster attitude and tell me someone else has the table, you're officially an asshole). The bartender was enough to turn me off of this place all on her own.\n\nFor starters, smile a bit, and don't act like such a hater. Also, when my friend tells you it's his birthday and you make him a nearly $7 drink, don't make snide remarks to me about how I'm not a good enough friend and should be buying his drink for him. Maybe you could take a hint from Elbo Room, or Casanova, or any number of the other bars we went to who gave him free drinks. Or if free drinks aren't your thing, that's fine, just don't give me lip when you don't even know me. \n\nHonestly, this place does it for some people, but not for me. I'm far happier spending my money at bars whose employees make an effort to give two shits about their patrons.", "author": "Natalye R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "I swear to god I met Tommy (as in, the Who's Tommy) here.\n\nThis man was absolutely giving it to the pinball machine.  It was like nothing I've ever seen before in my life.  He was shaking it around, hitting it, smacking it...\n\n... he made the pinball machine his bitch.  It was amazing.\n\nAt any rate, drinks are tasty, couches are comfy, and the place has a well-worn, cozy feeling that makes you want to drink like a 20 year old.  You know, like a fraternity living room, or the basement in your friends' house at college.  Mismatched, kinda dirty furniture, extra-loud laughers, and people playing pool poorly abound.\n\nI could move in here, if it weren't for how incredibly sketch the bathrooms are.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "My awesome roommate took me here to enjoy a cheap drink while we explained to the bartender how we autopay our bills. Like adults. It was fun.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-18", "description": "Where else in this city can a 20 spot buy you four pints of premium beer and after tipping the bartender still leave you with change in your pocket?\r\n\r\nThis place has got dirrrrty (we're talking REAL dirty, not Xtina-style dirty, folks) down pat. Avoid the bathrooms and remember this about the stench that permeates the place: you'll get used to it after a while. . .", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-03", "description": "Yay for dive bars and Johnny Cash! \n\nHonestly, this bar isn't all that divey, but the vibe here is grungy in a good way. The bartenders are ON it. Thanks ladies! Points for the comfy couches, the decent selection of tunes on the juke and the general lack of annoying people.", "author": "Joy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-20", "description": "It's a dive bar.  That's basically all I can say about it.  It's crowded, cheep drinks, loud, lots of drunk people but it's a great place to go if that is the mood you are in.  It doesn't have the club feel so it is easy to just grab a beer and drink.\n\nThere are a bunch of couches that at first glance are fun and looks like an easy place to talk to strangers but once I sat I realized that they were gross and felt like I was in a college fraternity house all over again.\n\nIt wouldn't be my first choice but I wouldn't deny ever going back.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "$4 draft beers? Sold. Or $2 cans of pbr if that's your thing. (You know who you are).\n\nI agree with Caitlin S. that people don't mind when you need to squeeze your way up to the bar to grab a drink. It's small and crowded, therefore it's generally understood that you're going to be rubbing arms with several strangers throughout the night.\n\nIt is cash only, so make sure that you hit the atm before going to Uptown; that is, if you're anything like me and you go through cash quicker than an H3 goes through a tank of gas.", "author": "Madeleine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "I used to go here when i first turned 21 and wanted cheap, strong drinks.  people bring their dogs into this bar.  Kinda weird.  \n\nThis bar is in a ghetto area.  But it's a good place to get drunk at when you feel like slumming it in the Mission.  You might meet some cool people here.  Nice people go here for the most part.  It's almost like getting drunk at home with friends.\n\nit's not ritzy, it's not fancy, it's not even that clean...but it's cool.\n\nWho put thatthey have valet parking?  lol", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "The first thing I thought when I walked into Uptown was \"divey.\"\nCool people. A few hipsters here and there. Pretty decently priced drinks. \nNot my first priority for a bar, but definitely worth checking out or ending up at the last half of your night.", "author": "JJ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Excellent place to get your beer on, get your couch on, your pinball on, or anything else. Quite the dive, but who will notice when you're downing $2 PBRs and as cheap drafts. Plenty of couches if you want to lounge like a bunch of high people, booths for the small groups, or pool table for those looking to shark. \n\nNice staff, good crowd even on a Weds early evening. Note: cash bar.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-04", "description": "This place isn't a looker but it's a step up from a dive bar. Super friendly staff, easy to get a drink, good amount of space and cheap-ish drinks. \n\nCheers!", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "It's a classic mission district dive bar.  It has all the attributes -- nothing pretentious or lame.  Cheap drinks, interesting people and nice  bartenders.  It's got it all!", "author": "Rene P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-16", "description": "I was on a dive bar exploration expedition and visited this joint, Elixir, and 500 Club since all 3 were recommended by a random website as some of the best dive bars in San Francisco (also all in the Mission). Uptown is pretty much exactly what I'd imagine a dive bar to be with a random crowd and decently priced drinks. If you're here during drinking hours, it may be hard to find a place to sit down since there aren't that many seats. The thing that stuck out most to me at this bar is all the action figures and dolls sitting atop the bar shelves. It's just a random collection of things that have arms and legs. There's also a pool table in a room that should be bigger (you might hit someone when shooting). I like this place a lot more than those other 2 dive bars I just mentioned. It had more a homely SF feeling to me. If you need a drink at some a straight up dive in the Mission, this is a good option. However, I've been to some other amazing dives that might be more worthwhile elsewhere in SF such as Zeitgeist.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "After wandering the grimy Mission streets at midnight, this little dive bar offers little change of scenery, but great character. If you want to appreciate the true San Francisco dive bar scene, this is the place to be.\n\nIt may not be clean, and it may not always smell so good, but dammit I only came for the cheap beer. That's the way it will always be, because even on the busiest city nights, you can depend on this place to be fairly empty.\n\nMaybe it's the homeless people gathering outside, or the faint and wavering smell of urine. Either way it doesn't matter.\n\nFairly strong drinks for the price, and they have a piano, so if you wanna be like me and bust out a drunken and incomplete version of Rachmaninoff's Prelude in C-sharp minor you are entitled to. Just don't expect anyone to pay attention. You are, after all, incoherent and rambling.\n\nAnd where better to be than in a place that encourages you in your habits?", "author": "Samantha P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "It's old.  The paint is chipping off the wall.  The bathroom is horrid.  4 stars?  Absolutely. The music is bumping.  The atmosphere is active and this is a local bar is great.  Grab a cheap drink and have a great time.", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-04", "description": "The Uptown reminds me of the basement at my Great Aunt Alice and Uncle Nick's house back home, on the West Side of Detroit.\n\nAs kids, my cousins and I used to hide out from all the scary old people down there, with their pipes and their weird Polish food. Because there was a pool table and a pinball machine... Wood-paneled walls and a scratchy couch and a wobbly little bar they put in themselves, with a set of old poker chips... All kinds of games we didn't know how to play... Rituals we hadn't been initiated into yet... But we pretended... \n\nWe practiced growing up to be Polish drunks just like the Polish drunks smoking their pipes and drinking their vodka upstairs -- we just didn't realize that by the time we were grown up, we wouldn't have any place so authentic as Uncle Nick's basement to be drunk in. We'd be hanging out someplace like the Uptown.\n\nWhich is tolerable. But I would trade all the hipsters at the Uptown for my old relatives ANY DAY now.\n\nThe girl bartender, though -- she can stay.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "do you ever get that not-so-fresh feeling?  well, sometimes, it's appropriate.  sometimes, i LIKE feeling dirty.  being squeaky clean and sparkly all the time gets old, and i feel that uptown would agree w/me.  i also feel that he and i are often misjudged.  he's eccentric and not dirty or gross at all.  and i'm not harsh.  just selectively nice.  : )\n\nit's a total dive, and i feel at home here.  this low-key bar is separated into two rooms, and you'll find me in the pool room 99.9% of the time.  (.1% of the time, i'm in the bathroom.  : )  ladies, there is no lock on the stall, but the door is 1mm bigger than the doorway, so if you just pull on it a little, it shuts just fine.)  the pool room also houses a jukebox (w/minimal hip hop, boo hoo), a pinball machine, and an arcade game.  in general, uptown's regular pool players are pretty good, so bring your A game.  it can get a little cramped on the weekends, but non-pool people are good about moving out of your way if necessary.  p.s.  50 CENT POOL, people.  take that change that you were going to donate to third world kids w/flies on their faces and play pool w/me instead.\n\nthe other room has a tv if you want to stop in and watch a game in peace on a sunday afternoon, and there's a piano in the back if you feel like getting your beethoven on.\n\nsuch an array of people too.  not only will you find the regular mission folk here, you will also encounter interesting individuals, such as the man in the top hat making skeletons out of pipe cleaners.  the bartenders are cool too.  i was once a guinea pig for a new shot concoction.  (it tasted like christmas morning.)  \n\nas if the 50 cent pool wasn't enough to lure me in on a continuous basis, my drink of choice (jameson and ginger) only costs $5.  ($5 make me holla fsho.)", "author": "Ting A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-03", "description": "Uptown really isn't my kind of place. \n\nThe only two things I really enjoyed about this bar was the $2 PBR's and the big comfy couches surrounding the oversize coffee table.\n\nOh yes, and the bathroom looks like the setting for a brutal rape scene. I've never used facilities faster.\n\nSo, with that said I probably won't be going back anytime soon.", "author": "Denise S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-28", "description": "Great little dive, cash only. Interesting conversations to listen to and jump in on!", "author": "Amber M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-27", "description": "they let me in while carrying my friends pet fox. Also, i lost my glasses here and they called me when the bar closed to let me know they had found them. Saved my life.\nCash only is always a bummer, but i'll deal .", "author": "M. V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-07", "description": "SUPREMELY Mission-y. By that I mean it is run-down and full of hipsters.  But it has undeniable character, it's cozy and unpretentious. Not to mention RIDICULOUSLY cheap. 4 drinks for less than $10.\nIf you like Pabst, Parli Lights and plaid, this is the place you want to be.", "author": "Korla M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "Nice bar, but when we walked in there was a leaky roof that dripped onto my bf's head. plus, they had just wiped down the floors and the poor air circulation left a strong chemical smell lingering in the air. Drinks are inexpensive, but sadly enough we will probably not come back.", "author": "Sharon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "I love The Uptown. It's become my regular Thursday night spot, though it's great everybody's. Weekends it does get a little crowded but that's to be expected, and no one really seems to mind when you're squeezing up to the bar or through the crowd to the bathroom. \nPool table, good music in the jukebox, a Lord of the Rings pinball machine.\n Also there's a circle of couches and plenty of seating to make this a comfy place to hang out. \nMost importantly, they have tons of great beer on tap. Yes please!", "author": "Caitlin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-26", "description": "This joint isn't exactly a dive. There are some random folks in here- decent beers to pick from. A dive usually has character. This place is hella plain. No decorations, nada. After 20 minutes, we got bored and left.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "I went into this place expecting it to be like that trendy I'm cool spot. No it was the opposite the person I talked to there was like rebelling against the whole idea that it was liked on Yelp, that's pretty cool if you ask me other spots like totally try to suck up to the social media aspect of their place being a hotspot. This place has an authentic vibe that's filled with locals and newbs like myself, everyone I talked to was super friendly and the staff was very nice and I got my drink fast. Probably one of the best bars I've ever been to.", "author": "Nicholas A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "The absolute definition of a dive bar. \n\nThe atmosphere is a little shady, but it becomes less and less so with each sip of beer. The selection of drafts is the respectable variety you typically see in mission bars (Paulaner, Trumer Pils, Hoegaarden, Sierra Nevada, Stella, Racer 5, Prohibition, Anchor Steam, etc). Pints are about $4 or $5, about average price. \n\nThe bartender poured our beers without tilting the glass at all and waited a little while for it to settle before serving it. Not to be rude, but tipping the glass should be rule #1 for serving draft beer, I couldn't believe that. If your bartender can't properly pour you a beer, then what the hell can you count on in the world?\n\nDefinitely a good bar for peoplewatching. You can bring your dog too, if that's your thing.\n\nCash only, but they have an ATM.", "author": "Ramsey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-17", "description": "My memory of this saloon is hazy after spending most of the evening at the Attic drinking the nefarious Racer Five beer, among other things. My chum and I arrived here after a long, oblivious walk. Incomprehensibly, I ordered another Racer Five, which proved to be my downfall quite quickly. \n\nAfter ordering our pints and heading for the empty sofas, I felt nature's call and headed for what I thought was the men's restroom. I walked down into a pitch-dark cavern and wandered endlessly inside it, still convinced that it was the men's room and I'd find a urinal somewhere nearby. After feeling my way around, I decided to turn back and exit this mysterious grotto and use the ladies' room instead.\n\nAnd so I used the ladies' room, but was confused as to why there was a urinal in there. Of course, it turns out that it was the men's room all along, and I had previously stumbled into some type of storage area. \n\nI remember enjoying the music, the quadrant of sofas surrounding a coffee table, the cozy atmosphere, and the dearth of patrons. Just the right type of environment in which to pass out. Which we both did, for a time, in between my unsuccessful attempts to vomit (having found my way to the restroom with ease now). \n\nI must return at another time to assess the place, and avoid drinking Racer Five at all costs.", "author": "Mortimer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "Total dive bar action. No pretentious clientele, there was even a free roaming dog which made more people smile than anything. Prices were by far the cheapest I have come across on my trip to San Fran. Good+strong+cheap= awesome any day!!!", "author": "Kapena C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-01", "description": "Last time I was here, I made awkward small talk with the guy sitting next to me, while he softly stroked a giant pet rat in his lap. \n\nYeah, that's how you roll at Uptown.", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-14", "description": "My favorite dive in the Mission. Great beer selection, good amount of seating, pool & pinball. Its a smaller place and can get very crowded.", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "Watch out for the people who regularly play pool there, you won't be able to beat them. I like sitting on the church pew and heckling people playing pool. You are the king if you can snag the 1 circular table, people will try and join you, to hear what you have to say. The double sided bar is great too, which makes it really accessible. I like getting my drinks quick. Low bartender turn over speaks volumes, and the soap jar is always full in the b room. Babe factor: 6. It's been near 9 before.", "author": "Nicholas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "Cheap drinks and a Lord Of The Rings pinball machine. Need I say more? I'm shire to return.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "I need to stop visiting dive bars with my current dive bar partner. Really, it's skewing my views of places. I'm giving two star bars 5 stars, and literal one-star sh*tholes 4 stars.\n\nNot to say that the Uptown is a sh*thole. It's a pretty standard dive bar, with a crappy tv in one corner, and some couches in the back that obviously have seen better days. The clientele is super friendly, as is the bar staff, and it seems that there's always a seat at the bar.\n\nThey have Trumer Pils on tap, and service is super fast.\n\nThe Uptown's overall pretty cool, but then again, I think that he and I would have fun underneath a rock.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-17", "description": "Yep, there are an awful lot of Uptowns in this here grand nation of ours. \n\nWikipedia says they are in the following places so I am sure this must be the complete and all encompassing list: Uptown, Normal, IL; Uptown, Chicago; Charlotte center city (\"Uptown Charlotte\"); Uptown Dallas; Uptown (Harrisburg); Uptown, Hartford; Uptown Houston; Uptown, Manhattan; Uptown, Memphis; Uptown, Minneapolis; Uptown New Orleans; Uptown, Pittsburgh (see Bluff (Pittsburgh)); Uptown, Seattle, Washington, officially known as \"Lower Queen Anne\"; Uptown Toronto; Uptown Lexington; Uptown, Montreal.\n\nNotice there is no listing for San Francisco. Except this bar apparently. If I dig really hard I guess I could assume it is uptown from the crackheads down the alley, or uptown from a few liquor stores. It is, however, not uptown in the sense that one would typically associate with this word. \n\nI, personally, find this to be a good thing. This bar is worn, and by worn I mean the furniture is banged up, the pool table is uneven, drinks are strong, the ATM kiosk is often broken, the fireplace could double as a fire hazard and pieces of the floor are missing. \n\nIt, however, seems to attract a great friendly unpretentious mix of people from the neighborhood......and not a one of the crackheads who reside outside. I guess that is what uptown means around these parts.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-19", "description": "Came here the other night with Kristine J as part of a short tour of bars in the Mission.  \n\nOkay, Green Bunny PSA - I am NOT a dive bar aficionado.  I grew up in squeaky clean suburbs, led a boringly average adolescence and my drink of choice tends to be wine.  I did not discover the phenomenon of dive bars until I was working on boats in Alaska.  So - I'm not the best person to provide insight into a bar most label as a dive.  Now back to regular programming:\n\nDue to some overenthusiastic imbibing earlier in the evening I had switched to water, so I didn't get to experience the actual drinks here - but I liked the vibe.  Lots of seating options, not too loud but not murderously quiet, friendly bartenders, nice mix of customers.  Definitely worth another visit - when I'm not drinking water!", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-28", "description": "Now I'm no nancy boy, but I was a bit miffed by the piles of trash in the gutter outside and the two scraggly old dudes standing guard by the front door, not a tooth in their heads.  \n\nTurns out this is all just an elaborate facade to disguise a haven of $4 drinks and plentiful entertainment that is inside.  \n\nIt kind of smells like feet, but from what I understand of Mission Theory, the foot smell is the left side of the elaborate equation that equals the striking but attractive hipster clientele, pinball machines and pool tables, sofa lounges and graffiti'd bathrooms.  \n\nOf course the kicker is that for ten bucks, I got half a liter of Hefeweizen and Mani got a martini glass so deep you'd need to hire scuba divers to resurface the olives.", "author": "Cassio P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "really fantastic dive bar.  great drinks, really chill crowd.  not overly crowded usually.  great pinball machine.  i haven't found this place to be filthy at all really.  it's old, no doubt about it.  however, i wouldn't call it dirty at all.  for reference, i'm one of those people who gets nervous after touching anything on BART if my hands don't get properly sanitized.  i also have yet to see many techies here as other reviewers have reported.", "author": "maria f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-04", "description": "This is my idea of a neighborhood bar that somehow manages not to be overrun by hipsters. Of course they're there, but so's the weirdo old dudes from down the street. It works out well. Pretty tiny of a space, but if you get there early enough you can grab a booth by the windows overlooking scenic Capp St. My girls and I always seem to make boyfriends with all the single homeless dudes loitering outside, so that's pretty cool. I know you're jealous, but being a hater won't get you anywhere. \n\nThe juke box sorta blows--it's really weird, actually. For example, last time I checked they had the X anthology, but only disc 2. Hmm. And the \"Master of Puppets\" CD is totally scratched, yet they keep it in there. Hmmmmmm.  \n\nOnce I lost my birth control pills (NO BABIES!!!!!) between the wall and the booth and never retrieved them. So, like, if you're straight and anti-baby, maybe you can dig them out. Use them yourself. I dunno, guess I'm just feeling generous.", "author": "Chloe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-26", "description": "I love me a good dive bar and this is up there with the best of them. No complaints about the bar.  \r\n\r\nI must have been having an off night though because somehow I managed to:\r\n\r\n* pour beer all over my foot\r\n* play two games of pool without ever successfully sinking a ball\r\n* get so distracted by the stick lengthener apparatus thingie that I just straight up hit the ball I was aiming at instead of the cue ball\r\n* get bitten on the arm by a random dude\r\n* later try to demonstrate to the arm-biter that I had a bicep, thereby allowing to bite me on the arm AGAIN before I realized what was happening\r\n* get walked in on by two girls while in the bathroom\r\n* knock a bicycle over into the middle of the room using only my head\r\n* cockblock a guy by accidentally hitting the girl he was flirting with in the neck with a coaster, causing her to leave\r\n\r\nI didn't break any glassware though. That was definitely someone else.", "author": "Liz G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-05", "description": "I love you, but I'm not in love with you. \n\nWait, that seems harsh. I take it back. \n\nIt's been a long time since I've come around the Uptown, but it used to be my go-to place. It's cozy, kind of slimy, but I wholeheartedly accept all its grimy glory. The company you keep in Uptown is always complimented by new faces and characters that you wouldn't run into at other locales. I'm never itching to go there or itching when I leave so I shouldn't make too big of a deal about it being a dirty place. It's more of a no frills thrill. In writing about it, I miss it. And I think it's high time I pass by. :)", "author": "Nicole d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-06", "description": "Grubby. At times scrungey. Gods, how I love this place.\r\n\r\nWhen this bar opened years ago (I even recall when it had the best 45s jukebox in SF) calling it The Uptown must have been a hilarious joke. And with all of the gentrefication that's hammered the life out of The City and flattened so many of its delightful edges, the still-ironically named Uptown stands. With the same crappy couches, disgustipating WCs and total lack of charmless, perfumed slummers.\r\n\r\nYears ago, Treat Street was the place that scared away all the bridge and tunnel creeps out on sub-culture safari, with its taxidermied heads and balls to the wall juke. The Uptown needs no decor or lack of it to weed out all but the most sympathetic. Although I was there recently when they were projecting Meet The Feebles on the wall. That couldn't have hurt...", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "Uptown is the best possible type of dive-bar--a cheap, fun and cool place that's not at all impressed with its own cheap, fun and cool-ness.\n\nUptown is so laid back they have couches, which are awesome when you can snag them, until drunk kids trying to give each-other piggy back rides fall on top of you and bend you in half and then get chaffed at you for telling them to watch the fuck out instead of being all \"WOOO MY SPINE IS SHATTERED!! PARTAAAAY!!\"\n\nBut that's not Uptown's fault.  Its a fun and laid back place, so people are bound to get a little crazy there now and again.  As it should be.  Just keep your crazy off of my lap, please.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "Appropriately smelly for a dive in the mission. On weekends, it's crowded, the line for the bathroom is too long, and you should count yourself lucky if you get a shot at the pool table, the juke, or the couches. Feels a bit like a house party - if most all of your friends ride bikes and have decent taste in music.  \n\nIt's close to a friend's apt so I've ended up here more than a couple times now and I have to say the cheap beer, friendly bartenders, and odd booths have really grown on me.", "author": "Angela N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-08", "description": "It's a rare thing, the hipster joint that is so chill about its own hipness that it just doesn't try.\n\nExhibit A: the mirror in the ladies' room is so covered up in red paint, graffiti and stickers that no one has seen their reflection in it since the 90's. \n\nExhibit B: the jukebox. (OK, so you have to pay for a soundtrack to your evening, but the drinks are so cheap it's a wash.) I don't know another bar that has the nerve to put Fugazi, Modest Mouse, New Pornagraphers, Neko Case and Yo La Tengo smack up against Steely Dan. They just don't care.\n\nExhibit C: Bartenders who focus on, like, making your drink. They're there to work, not to make instantaneous decisions, God-like, on the hipness of their clientele and then communicate this to their patrons either by ignoring them, or by flirting with them, as determined by the size of your a) rack b) hipster-wanna-be-trucker-hat c) tattoo. \n\nPlus, they have a very respectable collection of beers on tap (Racer 5, yum yum) and those couches are, hands down, the best way to end a first date that's going really well. It's dark, dark, dark in the Uptown and  let's all pray that no one ever decides to spiff it up with a damn votive candle. Better for it to burn down like it is than change a thing.", "author": "Mary B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "Even considering its proximity to the 16th Street Crack Corridor, I dunno if I'd gloss this a \"dive bar,\" really...it's more like a super-ultra-casual beer cafe. Very SF with its iffy-quality, semi-hippie artwork on the walls. I like it jus' fine. Generally good neighborhood people (no fashion superstars or B&T invaders), generally good prices, and generally good conversations to be had.\n\nDoes anyone know why it's called the \"Uptown\"? It's neither \"uptown\" schmancy nor \"downtown\" schmoozy...it's just, ummm, \"town.\" Yeah, that's it.\n\nThis is a townie bar. Nuff said.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-01", "description": "Get downtown at the uptown.\nI get down here. Like drunk... playing Brian Ferry/ David Gilmore on the jukebox drunk.\nYeah.. that drunk. \nGreat bartenders and -tendresses. They know how to make dirty martini's. \nNow, on to the fact that I never go there without someone else. As I get drunk there- I can't navigate the crack-ho's and pimps by myself. To say that Capp is shady is a gigantic understatement. And don't say I'm faint of heart or some shit. It's rough as hell out there. \nSo word to wise ladies- bring ammo or another person.\nThat being said I do love to get down at the uptown.", "author": "shannon t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-27", "description": "I've been here twice, and have enjoyed it both times. It's generally easy to find seating, which allows you to comfortably hang out with friends, both old and new. Drink prices are very fair, and they also have a pool table (although that was pretty crowded the two times I went).\n\nIt's also located close to the Mission/Valencia action, which makes it easy to start here and move elsewhere (or vice versa, for those who like to end their night on a mellow note).", "author": "Art D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-19", "description": "I'm a Bud & a shot guy.\nBut the detail that goes into tap Beer inventory, and it's pouring are of Zagat caliber. \n\nThey allowed me to renew my Customer Application several years in a row. I don't know if that is good for YOU, or just satisfying for me.\n\nUptown will always be a place in the New Bohemia of the Lower Intestine in my book.\n\n\nTo Kai~ Skoll.", "author": "Richard N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-02", "description": "In our recent attempt at escaping the Mission takeover by yuppies on Valencia Street, we dashed through puddles of pee and gang bangers dealing drugs to grab ourselves some late night refreshments at The Uptown. Located on 17th and Capp Streets, The Uptown isn't there to coddle those of you from neighborhoods with clean sidewalks and valet parking. \n\nThis is the essence of a good Mission dive bar, never TOO crowded even on a Friday night, a killer jukebox that's never too loud, a great beer and liquor selection and a fairly friendly crowd. They've got a pool table, some games, some squishy old couches and plenty of spots to park your bike outside. \n\nIf you seek solace from the frat-boy insurgence of the 16th and Valencia area, then check out the Uptown.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "Don't be fooled by it's name for the Uptown is anything but classy... however apart from not having a photo booth, it does manage to meet my criteria for necessary staples for a perfect dive bar which include the following:\n\n- cheap drinks (grey goose & soda for $4.50- you can't beat it!)\n\n- sweet jukebox featuring a nice selection of non-stereotypical bar music (Uptown's JB features the magnetic fields, moby grape & can!).\n\n- plenty of space to take a seat whether it be at the bar, a booth, couch, or bench.\n\n- a pool table\n\n- cool down to earth bartenders with zero attitude.\n\nJust a couple of block's from my BF's place, Uptown has become a regular stop to kick off our weekend mission bar crawls. Be warned though, it is a dive, and aforementioned bestie said she once took a date here and they both witnessed a dog pull a rat out of the couch they had previously been enjoying themselves at... yikes!!", "author": "Callie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-23", "description": "Gotta love the cute little hipsters who come here and think they are the saviors of the city. Luckily, the beer selection isn't entirely PBR and if you get real lucky, you'll see a wave of hipsters dutifully congregate on the sidewalk for the ever-important cigarette which means half the bar will be empty for a good twenty minutes. I can deal.", "author": "Sherry G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-30", "description": "Although it does get crowded on the weekends (proof of it's fun-ness), it's still not that hard to get a drink, which I appreciate. Low-key crowd, good jukebox, cheap drinks and adequate seating space. Plus, the bathroom has a stall, which I like. Although, said stall is sort of gnarly. \n\nI like Uptown most for it's lack of pretensions. Let's all drink, together.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-09", "description": "FUN dive bar with strong BIG drinks.  Fun crowd, good tunes on the jukebox.  Just plain fun.  \nDefinitely a little broken down, but that's what makes it beautiful.  \nI went here with a posse of peeps on a Saturday night, the place was packed.  Saw some familiar faces.  Bar staff was nice too.   Totally my people.   I really liked it here. Will def go back and drink myself into oblivion again soon.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-07", "description": "So i just moved here and being the raging alcoholic i am i was in dire need of a good dive to replace the one i loved so much in Savannah, GA (Say what you will about the south but they have really fucking great dive bars and take their drinking seriously) So for the first few weeks i didnt have a job and spent most of my time drinking at random bars throughout the city and after my first visit to the Uptown i knew i had found a home.\n\nThe bar is dingy(like a dive bar should be), but has plenty of places to sit.Benches in the pool room.Big frat couches, booths and bar stools.People bring their bikes, dogs, and babies even one night, into the bar, and its great.The first night i went i actually had shit stolen off my bike so ive been keeping it in the bar now when i go.The neighborhood is certainly interesting.Prostitutes and drug dealers  are usually hanging outside, but they are fairly harmless.\n\nSo the bathrooms are easily accessible and never have a wait.Plus the bartenders with the exception of one, are VERY friendly and very quick.There is one short bartender who is very cool and is ones of the best bartenders i have ever seen.\n\nSo i hope to make this my neighborhood after work dive.", "author": "Joshua T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-29", "description": "One beer and a martini for $8 total?!\nAmazing.\n\nA friend and I swung by Uptown for a quick drink while we waited for a table down the street at Maverick's. The host there suggested it, since we \"looked like we might appreciate a good dive bar\".\n\nWe did indeed. Despite it being a rainy and therefore pack night, we were able to find a quiet little booth in the corner near the pool table.\n\nRockin' music on the jukebox too (it serenaded us with \"I wanna take you to a gay bar... GAY BAR! GAY BAR!\" on the way out).", "author": "Trey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-17", "description": "Bartenders here are really fucking awesome. \nThe couch area near the bathrooms is a good place to sit with a big group of people. Its also a good place to break your fall after youve spilled a drink on your friends shoe rocking out to sweet metal coming out of the jukebox.\nOutside is pretty sketchy but its the mission so pretty much anywhere in the mission is sketchy.", "author": "Mod S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-17", "description": "Okay...I love this bar at night, but hate it in the morning. I have never once left this establishment sober. It is a cool dimly lit place to meet a first time date...just don't stay there all night or you will never have a second  date. \nIt is also a great place to bring a group of friends or co-workers...just make sure you save cab fare...", "author": "anissa m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-30", "description": "Capp street - didn't even know such a street existed.  It's actually not a bad location as a Bank of America was nearby (and Bart).  Drinks were cheap (but I have a sneaking suspicion that the bartender hated my friend and thus raised the prices on my beer), decent music and the constant back & forth of police cars was oddly comforting.  The seating options from the booths to the couches seem comfy.  And the bathroom was decently clean.  That's key.", "author": "Helen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-27", "description": "There's something charming about the Uptown. Sure, it's in one of the filthiest areas of the Mission, & you're guaranteed to have an enlightening conversation or two with a few homeless people &/or prostitutes (not even being sarcastic...I've had some legitimately hilarious & awesome back & forth dialogue with some ppl 'round there) if you hang out here a few times.\n\nDrinks are cheap, the jukebox is affordable & stacked with perennial favorites, the clientele are cool but decidedly unhipsterly, it's never too crowded, there are plenty of couches to sprawl out on...the list of positives keeps on going.\n\nThe Uptown is one of the gems of the Mission.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-16", "description": "So the other day I was taking BART over Oakland and it happened to be Cinco de Mayo (ps. white people, Mexican Independence Day is September 16th, but if you want to look like a dumb gringo in a sombrero so Corona can make more money, that's your deal). A guy in a business suit was on his cell phone discussing his cool Saturday night party plans i.e. \"I guess I'll go to the Mission, I know it's cliche and all...\" This is pretty much a summary of going to a bar in the Mission on a Saturday night: a yuppie dude in a suit crusing around \"bars in the Mission.\" Not like I need another reason NOT to go to a bar (which are generally expensive, boring, and full of idiots), but that's a pretty good one right there. The Uptown, however, is one bar is do enjoy.\n\nNot only is it generally less full of people than most bars, most of them are not idiots (I am not disputing the possibility that they may be crazy, but hey, that's part of the charm). In fact, the occasional random person I chat with (which is not many as I generally don't talk to people I don't know at bars, hence another reason i could just sit in my living room and pay less monies), is charmingly weird but for the most part non-threatening. Like the psychic lady who my friends and I encountered on Saturday. She had a lot of information about our lives which I have to say was fairly inaccurate, but she was pretty intuitive and a definite interesting character. Totally non-threatening! Plus the drinks are cheap, and if you do get bored with the clientele inside the bar, you can always pop outside and chat with the colorful array characters out for a gentle evening stroll.", "author": "Jessalyn A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-21", "description": "It's been a while, so I am going by fleeting images from the 90's.  I thought this place was gone. Let me tell you, I am pretty happy it still exists. It's like deja vu just thinking about that place.\n\n+ good beer\n+ excellent pinball\n+ I vaguely remember the Tarnations playing a gig where the couches are.\n+ at the time, excellent jukebox. it's probably gone to shit though. \n+ hookers on the corner make for great people watching from the booths by the window.\n+ Crowder is right, it is dirty as hell\n+ cheap drinks\n+ not as packed as every other place in the mission\n+ The Brian Jonestown would chill here before playing at the warehouse across the street. Same goes for Henry's Dress.\n+ my name is scribbled on the formica table second to the front, followed by some boys name but i can't remember who it is.\n+ watch out for guns. it's not called Capp Street for nothing.", "author": "Olivia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "The first time I came here someone started playing \"Don't Stop Believing\" on the piano in the corner and the previously subdued hipster crowd joined in a huge full-bar singalong. And the rest is history...", "author": "Kimberly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-09", "description": "I'm goin with someone else's words, because that's all that needs to be said:\n\n\"Uptown is the best possible type of dive-bar--a cheap, fun and cool place that's not at all impressed with its own cheap, fun and cool-ness.\"\n\nI met someone there and we hit it off right away, so I wasn't able to check out the 8-bit video game machine someone told me about... but the fact that it's there in and of itself is pretty awesome!  also, there's a pool table -- thumbs up for that.  I went on a Sunday night, so it was pretty empty.  I'm always a fan of that.  The bartender was also really awesome.  Her name slipped my mind, but she was really great.\n\nAll in all, I had a great time here, so five stars.", "author": "Beccie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-15", "description": "I love this bar.  It's cheap and less than two blocks away from my house.  What could be better than that to stumble home from?\n\nIt's never been so busy I want to leave, although it is sometimes sorta packed.  I enjoy days when I am able to score a couch seat.\n\nIt's also pretty easy to play pool there which is surprising seeing that there is only one table.  The jukebox has some jams on it as well!\n\nAll in all a place I look forward to spending money at, despite some of the sketchies in the alley.", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "I had a good time at Uptown. It had a laid back feel and it is not trying to be anything other than what it is. It is a hole in the wall drinking establishment. Reasonable prices and an unpretentious feel. Exactly what I am looking for in a bar.", "author": "Peter V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "The Uptown rulz for 3 reasons:\n\n1) cheap drinks\n2) pinball\n3) friendly, sarcastic bar tender who tried to hook my roommate up.\n\nAlso has the strangest, worst/best painting on the wall of the Hulk playing pinball or something.", "author": "April D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-05", "description": "A-OK for a hipster type bar.\nBartenders seem unusually well adjusted.\nCD Juke box has some good stuff on it. Some locals in here and natives could stand it.", "author": "Mag N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-16", "description": "Cool bar, if you want to be scene. People are suppose to drink at bars right? Junk box is good, I'll give it that. \n\nWhats up with the weird Mexican monster art above the bar?", "author": "Robert M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-19", "description": "I love a good dive bar, but the Uptown gives the impression of being one of those extra sticky dive bars, where you expect every surface to be coated with several layers of accumulated... you almost have to make up a word like... say, \"slooge.\" Something about the entrance. The lack of light, signage, the permanent odor of urine on that particular corner of the Mission.\n\nIt's not my favorite dive bar, but it always draws a crowd, so maybe it's just me.\n\nLast time I went there it was to meet some good friends - a married couple and another dude. I drank Makers and ginger ale, and the bartender poured my drinks generously. I appreciated that, and I appreciated that the music droned at a low ambient level that was conducive to conversation. We stayed for hours.\n\nEventually, the place thinned out, and my married friends left too. My other friend wanted to chat up some girls at the bar and wanted - I'll say it - a wing man. I obliged, although I definitely didn't see what he was seeing (maybe whiskey goggles aren't as powerful as the beer variety?).\n\nHe was still talking to them when I left, an hour or so later, and as I stepped into a taxi, I got a text message from him: \"going home too. that girl had hella bad breath!\"\n\nYep. Dive bar.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "A bartender here lets me make up my own stupid mixed drinks and then charges me next to nothing. Let's get married? Call me.", "author": "Rebecca P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-24", "description": "Wow, okay, forget my previous review for this place, because I was thinking of another bar hahaha.\n\nI came here with lauren v last year!  I don't remember much of the actual bar itself, but I know it was a good night. :)", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-06", "description": "meh. perfect way to describe how i feel about uptown. \n\noverly crowded.\nobnoxious drunks.\nprostitutes.\ndirty.\nbad music.\nalright drinks with an alright price.\nvery frat house-esque.\n\ni like to relax at dive bars, not barely be able to move.\nhave to worry about getting jumped on by a drunk idiot sitting in the booths who \"had to pee and couldn't get through and it's his friend's birthday and he's really drunk and he like really totally had to pee so he jumped and he's sorry\". ...not that i'm bitter about it or anything.\n\nit's just too much and too little for me.\nsorry uptown, i'm just not that into you.", "author": "Jena R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "This has become \"our bar\"...why? Glad you asked:\n\n1. excellent low key atmosphere that never fails to be \"just right\"\n2. excellent juke box with many fav tunes\n3. truly excellent friday night bartender - yeah Crista!!!!! makes the best margarita's ever\n4. short walk to home\n\ndo yourself a favor and grab a neighborhood burrito or pizza and head over to the uptown, but make sure you save a booth seat for me.", "author": "holly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-20", "description": "Stopped into this bar while waiting for dinner res down the street.  I was accompanied by a couple of friends who hail from Seattle.  And, we all agreed that this is basically what you think of when you think of a dive bar.  Cool b-tender, old wooden bar, interesting drinking locals and tecate, pabst, etc by can.  Or, impressive beer selection on draught.  My kind of spot.", "author": "Dusty B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-30", "description": "Best jukebox evarrrrr!!!! 4 stars because you raised your price of pool from .50 cents to 1 dollar.", "author": "Jessica U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-12", "description": "For a dive bar, this place isn't so bad and has some decent beer on tap.  There are couches for larger groups (if you get there when they are empty) a pool table and a few games to play.\n\nSolid 3 stars.  Not worth going out of your way for, but decent for what it is.", "author": "daniel m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-12", "description": "It is somewhat of a Mission tradition.  Plenty of seating at the bar or on the couches throughout the place. I have been here a number of times and don't remember it ever being super crowded.\n\nIt is off the beaten path so don't expect \"edict\" to be the same here as it would be just 3 blocks away.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-02", "description": "Oddly enough, I find myself here more now that I've moved out of the area (I used to live about 3 blocks from here for 4 years).  And it's fine that I find myself here now, and it's fine that I didn't.  \n\nThat is, it's a fine neighborhood place, especially! on weeknights.  The prices for beer and liquor are decent; they can serve good stuff if you choose wisely.  The weekends can get pretty packed, which isn't my thing for a bar without dancing or art or something.. just a personal preference. \n\nBut the pool table in the back room is nice when there's not too many people around (again: weeknight!).  And, as others have said, the place does have some sort of layer of grime on *everything*.. which is not a bad thing, per se; it's just a thing to know: it's that type of place.  As for the bathrooms, you better stand, man or woman, for reals. \n\nEven though I think the place is totally fine, that's the thing: the three star rating is basically because nothing really stands out for me, nothing has really struck me as kickass when I've gone there.  In short, it's a good standby for friends in the neighborhood.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "I like this place a lot, went there solo ( like yami bolo) after the Noisebridge 5MoF a few days ago and had a very good time.  Met some real people and had some good conversation, got drunk and played some pool.  It was a simple night but chalk full of quality folk, made me smile the whole way home to frown-town-napa.  A  cute chick blew in my ear whilst shooting a bank-shot, I missed the shot but that was OK by me.  There were a bunch of wet-behind-the-ears but I was not faded, the ladies knew what I brought to the party.  The beers were cheap and the beer nutz were cheaper.  A dood got me high, and being from out of town told me a little bit about the neighborhood.  Met another who schooled me on the history and changing times of street performers, and I do love my history.  Man looking back on it, it was prolly the best night I have had out in SF in a long time. \n     Next time I see you guys the drinks are one me, that's a lie cuz I don't have that much money and prolly never will but its a nice thing to say to some nice people, thanks for being you...wow that's out of character.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-27", "description": "Disclosure - I live across the street, so I'm on a first-name basis with just every regular here. With that bias in mind, I fucking love this place! The drinks are cheap and, for the most part, well made. Great beer selection, great booze selection and great...no, don't drink the wine, it sucks. \n\nBut! Lots of old soul and jazz on the juke, pool, pinball, board games, weird books and friendly folks. It's in a shithole neighborhood (2 blocks from Valencia), but they still don't need a bouncer. The bartenders are nice, the regulars are actually articulate, interesting folks and no one minds if you smoke a joint right outside the door.\n\nPersonally, I avoid this place past 9 or so on the weekends, as it tends to get too crowded, but barring that, I've had many an epic drunk at this place.", "author": "Jay N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-05", "description": "The Uptown has always played second fiddle in my choice of Mission Bars but I always end up coming back.  \n\nReasons to go : cheap drinks, good selection of beer, decent whiskey, and a pool table that usually is playable within 20 minutes of getting there are all worth a star in my book. That's 4 so far. Damn, am I easy or what? The crowd is usually an eclectic mix of patrons. Intelligent conversation is a hit and miss - but pool and cheap drinks - well that's almost always a resounding thumbs up!\n\nSome endearing things about the uptown: \n\nBartenders: They have always been cool, quick on the draw, and friendly if a little bit bored seeming (depends on the night). \n\nSmall world: I've met random people that previously knew from my my past life in a small town over 300 miles away\n\nScorpions: WTF? Yeah. They have some Tequila with a scorpion in it. Any takers?\n \nSome not so endearing things about the Uptown:\n\nPanhandling crackheads: soliciting you for $1.43 at 2AM when all you have left is enough for a slice of cheese pizza\n\nInteresting clientele: Hit or miss. Usually miss - at least on the poolside of things. Minus one star. Boo Hoo.\n\nOverall, I would recommend the Uptown a great place to get hammered and play some pool on a budget. A great place to drink when you don't feel like dressing up, and a great place to go when you want to escape everything pretentious. I've usually always had a good time here. I keep coming back - so go figure. Maybe I'll see you across the bar some night.", "author": "Frank Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "Its your local dive with friendly staff and a jukebox straight from God's itunes.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-08", "description": "So cheap and So good! \nthe juke box has yo la tengo, dolly parton, and televison.\nit's everything I could ever want from a bar", "author": "donna m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-28", "description": "Great music selection, great beer selection, bartenders with a sense of humor, empty pool table (on weeknights), and only having to stumble half a block to get home... priceless.\n\nAlso, I hear tell of a BBQ actually being used on the sidewalk in the early evenings... not sure what it's about, but the mystery is intriguing!", "author": "Natalia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "Nice dive bar for the area. Friendly staff and patrons. Had some time to kill in the mission and found myself pleasantly surprised. Not a large selection of spirits. But good for a dive bar.", "author": "neal s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-19", "description": "this is where i killed my liver.  they have a pool table, a couple games, and a jukebox that has the same tom waits and similar music since forever.  scott the owner has also been known to throw bbqs in the afternoons once in awhile.  tamale lady stops by. \r\n\r\nif you hang out there long enough you'll realize the bar isnt boring.  the neighborhood used to be more colorful.  midnight was like rush hour as fresh girls were shipped in from oakland.  we'd see the cops 'bust' them and the very same ones would be back on the corner within 2 hours.  one night we saw a one legged bicyclist toss a bag to a hooker on the street who handed it to someone else who walked away in the opposite direction before the cops who were chasing the bicyclist got there.  one time someone brought magnesium and lit the bar up bright white momentarily as a couple of women started fire-breathing, but usually the crowd is more sedate. \r\n\r\nthe crowd varies depending on the night but the same regulars from 10 yrs ago still sit in the same places daily.  it's the kind of place where the regulars watch the back of the bartenders.  once customers tied some tips to a bottle to catch this guy that used to come in off the street and steal tips.  the guy grabbed the money as usual which made the bottle fall and the entire bar shone their flashlights at the guy,  he got 86'd and was never seen again.", "author": "X X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-19", "description": "I love this crusty, nasty little hole in the wall. I've been doing dishes and slinging drinks at this place since 1998, and though I've had my moments where I thought I could never go back, I always do. The jukebox is great (although I'd be happy never to hear Johnny Cash ever again), the smell is awful and the colorful crack heads on the corner make for some lively conversation. The drink prices are the best in town, and I've heard comments that we have a bad case of heavy pour, but that isn't really a bad thing. So if you want no frills, strong, cheap drinks and offensive odors, Uptown is the place to be.", "author": "miss m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-18", "description": "Bartenders happily make hot toddies.  There's a pool table, couches, and vaporized sweat constantly hanging in the air.  They do dive right.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-19", "description": "Pretty cool spot for a shot and a beer - decent pinball machine.  Definitely the place if you like boys who were in the philosophy club in high school.  The girl bartenders can be a bit dismissive to other members of the female persuasion, prolly cuz they wanna keep all the geek worship for themselves.  Eh, can't blame 'em really, you know those boys can't tip very heavy so the ego-boost of unrequited lust must have to make up for it.", "author": "Mokirobinson M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-13", "description": "Cozy & Crusty are not your average combo, but it's a winning one at the Uptown. This is one of my favorite dive bars because of its extensive, inexpensive beer selection, comfortable and ample [for its size] seating, and location. Bridge & Tunnel losers will not be found at this off-the-beaten path locale, which is cool on the weekends. (Ooooh, I just called them out.) There's usually some reading material tossed about on the coffee table or piano and I've never been annoyed or bothered by other patrons or their dogs. Normally, I avoid skaggy bathrooms at all costs, but I gotta say that there's a charm about Uptown's oversized onesie---it's a bit of a reading room. Bring your own sharpie!", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-16", "description": "Decent semi-dive bar...they have a pinball machine which is a huge plus in my book.  Bartenders seem on point, and drinks were supercheap.  I was a bit too sketched to sit on the couches, but overall a decent  place to stop for a drink and a round of pinball.", "author": "Jaimie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-14", "description": "I think this is my favorite bar in the entire world. It just never ever changes. It's dank, dark, dismal, the couches in the corner are disgusting. I LOVE IT! If this place ever tries to attract marina douchebags like Dalva and Delirium, I will be very very angry.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-25", "description": "The bartender was very friendly; she does service with a smile better than that Wal-Mart happy face. Minus a half for not knowing what a brandy separator is, but then again, I didn't know either. I purchased a white russian instead, which didn't make me feel the least bit drunk until I stood up. The lighting is perfectly dark, so that anything that may be really dirty isn't noticeable, but you can still actually see the person you are sitting across from. Minus another half for the very conspicuous bars on the windows, though I guess it wouldn't be a dive without them.", "author": "Midori G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "Fantastic dive bar with $4.50 Hendricks and Tonics and awesome bartenders.  The perfect place to start or end an evening (or just spend the evening there).", "author": "MJ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-10", "description": "My favorite bar to get away from it all. I usually only know maybe one person here and go for Happy Hour on Thurs with the lovely Shay. Good on a sunny day when you want to do some people watching while sipping a nice refreshing mojito or blueberry Stoli drink.  Plenty of other activities to be had in sundry seating arrangements, from the nice barstools, back area by the pool table or the cozy living room area. I have fond memories of hanging out with my arty farty friends here when they came to town. Or the old standby when we'd be on our way to one of the 17th Street warehouse punk nights, sigh.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-07", "description": "One of my favorite places although I don't get there often as I used to.  They know how to make a martini, and give you a shot back without being asked.  The staff, the owner, are as nice as it gets and they always show their appreciation to a good customer with a decent habit.  The neighborhood is more than a little iffy, but just increases the appeal for me.", "author": "Cheezy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-14", "description": "Uptown is a disappointing dive with a scary ladies' toilet.  The bartender either didn't know how to fix the drink I requested, or she didn't have all the ingredients.  I will never ever ever visit this bar again.  Gross.  Can you believe a man brought me here?  Uptown is no place for a lady.", "author": "Camille K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-02", "description": "Best place to get loaded on a Tuesday and chat with some beautiful hipster boy and a hobo crack head", "author": "aynne v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-27", "description": "It's a mission dive, so you know pretty much exactly what you're getting into. Filthy. Pool table. Small and crowded. Unremarkable but enjoyable. Decent beer selection on tap.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-07", "description": "Nostalgia follows me each time I go here b/c it's so much like bars back in Philly.  But then I remember why I left Philly, too.  The thing I like most about this bar is that you can actually have conversations here.  The drinks are well priced and it's three blocks away from my house.  Out.", "author": "Rhea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-20", "description": "Excellent dive bar. Runner up to the Latin American on Sun, Mon, or Tues nights. It's got a great classic jukebox, a pooltable and couches to crouch in with your posse.  Best on a rainy winter night when you can cozy up to your friends in a booth and look out at the wet weather outside on 'charming' ;-) capp street. Sometimes it's almost empty and you get the whole place to yourselves! (not wed-sat!)", "author": "Maïa Cybelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-18", "description": "The quintessential dive bar, The Uptown always comes off shady and usually pretty stanky. The jukebox, like the bar is an eclectic mix so whatever you're into you should be able to find something you dig. You'll also find pool, pinball and I seem to have a hazy memory of a sit down Mrs. Pac Man. The best part about this place is that there is no posturing or scenester bullshit, just real folks who like to get their drink on. Definitely not the kind of place you will find Blondie's overflow. (NOTA) The Bar is in the center of the space so it won't take a half hour to get a drink. If you're there by 11:30 or so you can probably catch the Tamale Lady before she heads to Zeitgeist!", "author": "Mingus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "Yes, the Uptown is one of the seeeeeediest bars around. Just round the corner from gross and grosser. But somehow, it has grown on me and I love going there! Especially on monday evenings, when it is HOT and a girl neeeeeds a cold DRINK! Brion can whip up a cool tall glass of fresh strawberry lemonade vodka, and don't tell, but even the boys were drinking these fruity ones! Nuff said!", "author": "Ingrid K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "Like a pair of old comfortable shoes the uptown awaits your nightcap needs. Bartenders are really laid back and friendly and if it's not too crowded it's a great place to bring friends, play pool, sit in a booth, and listen to a great jukebox. I like this place on a dark and rainy day and they will even make a great hot toddy. Minus one star for some of the younger generation messengers(not all, just the coked up rude ones). SF's version of backwoods mountain dew drinking \"extreme\" douchebags (like the ones in Harold and Kumar go to White Castle). Only the mountain dew is cocaine, and the trucks are fixies.", "author": "Julian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-17", "description": "One of the better bars in the neighborhood. Granted, most of the bars in the mission are complete crap weekend nights...but, somehow the uptown is a bit more bearable. A friend of mine once passed out on one of the couches and woke up with a pseudo-homeless, smelly guy cuddled up to him. Always something entertaining going on at the Uptown.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-11", "description": "50 cent pool, Neil Young on the juke, pin ball and a piano. Racer five is $3.75 a pint and the crowd is always nice. Couches and booths. My oh my this bar is just fantastic. The only thing I would have said that they were missing: dice and a deck of cards but no matter, I purchased some for this fine establishment last night so make sure to ask for them when you go in if you're like me and enjoy liar's dice with your friends. Jennifer the bar keep is as nice as they come, John takes some warming up to. You can usually find me at the piano.", "author": "eric m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-01", "description": "Excellent when you're rolling 5 deep with idiot boyfriends and can brave the maelstrom of funky lewdness when disembarking the 22 at 16th St. BART. Comfy couches and eclectic selection of inexpensive libations. Dim lighting in the main room is a bonus. The jukebox is well rounded, though an update would be nice.  I've spotted cuties here as well.", "author": "Coco K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-10", "description": "At first, I thought this place was condemned or otherwise unusable since the entrance looks disreputable and caged off. Then I clonked myself on the head and remembered I totally love all things disreputable and, er, caged. Not always. Anyway, for a refreshing shift from the attitude and asinine tastes of other, less seedy MIssion watering holes, come here. It gets pretty packed on the weekends, but on less tumultuous nights, some of the greatest dramas and comedies of the last year have taken place here.", "author": "Kimberly V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-25", "description": "Best dive it can be without being creepy so close to Crapp Street. The bartenders are friendly, the people aren't pretentious. What more can you ask for?", "author": "Erin O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-05", "description": "dear uptown,\n\nwhile i do like the fact that your men are cute, your drinks are cheap and get me drunk quickly (i am all about economically efficient drinking), i do not appreciate the bitchy bartendress who ignored me for 15 minutes at an empty bar, cutting lemons and limes while i sat there and made eye contact multiple times without success.  when that didn't work, i tried the other bartendress, who flirted with a patron for 5  more minutes and then ran off into some back room.  apparently i didn't look cool enough to be served until my hipster friend mooni p. came and flagged her down.  in the meantime, i'm going to give you the benefit of the doubt and blame it on an eye-contact miscommunication.  next time, i'll make sure to wear some skinny jeans, jump on top of the bar and wave my money in your face.\n\nyours truly,\nkk", "author": "Katherine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "like everyone's mentioned before... YES! it's quite the hipster hangout. bothers most people. me not so much. cheap beer and the chill environment is enough for me to want to go back. can get a bit crowded on the weekends but can be a real pleasure during the week. love the couches and the employees. when people say they wanna meet up at the uptown, i usually have a hard time saying no.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-01", "description": "I heart Uptown. Just a few blocks from my work, this is a perfect happy hr spot for my coworkers and I. It's casual, the bartenders are friendly and it's that local dive bar tucked in the mission where people just come to drink and hangout. This is not the place where you go to see and be seen but for an alcoholic like me who depends on happy hours to get through the work week....this is my little gem.", "author": "Richard K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-22", "description": "i like the uptown in oakland better.\n\nor at least, i used to. \n\nsince the uptown in oakland is currently closed. \n\nsigh...", "author": "Irene S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-03", "description": "Seemed like a good crowd of people--but I'm really new to the city so I felt like it wasn't the type of place you go to and meet anyone new cause everyone seemed to have their little groups. Bartender was really nice and got to us right away. Dolly on the jukebox..yessss.", "author": "Krystha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-19", "description": "don't let its capp st locale scare you off, this is a very cool nice clean establishment, with comfy couches and booths, great music selections and STIFF drinks. And i guess if you wanted a prostitute after your night of drinking you came to the right street huh?!", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-02", "description": "Great spot for a drink in the Mission, if you feel like slumming it.  This bar does not try to be anything other then what it is...  a spot for booze hounds to hunt down a pint.", "author": "Tony A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "So cheap, so divey. When this place is busy, it's really great. When this place is not busy, it sucks. What does that mean: it's a dump that attracts a cool crowd.", "author": "Skyler C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "This is a great dive bar in a seedy part of the mission.  Uptown as plenty of places to sit and a relaxed atmosphere.  They have an excellent beer selection including Abita from the Big Easy, Anchor Porter, and Mirror Pond Pale Ale.  Also, the prices are really cheap - less than 4 bucks a pint.  Great spot to hang with friends.", "author": "Moe J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-01", "description": "the knock may be the greatest thing in all of bar history. it means that you are nice enough, a decent tipper and you are in a sweet bar that knows how to do things the right way.\n\nyou order your 5-6 90th drink and as you go to pay the bartender knocks on the bar. free baby  free!!!!\n\nevery time i have gone to uptown this has happened( i think this says more of them than of my drinking maybe?)and i am cheap beer guy so its not like i was making them alot of money. add that to a place with a great jukebox pinball!  some super comfy couches, a nice long bar with an opening for the other side of the bar and a pool table well that is all a bar needs.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "It can get pretty crowded here on the weekends, sure, but it's a hell of a lot better than squeezing your way between coked up skaters, taggers and SFSU slutbags at delirium. The jukebox here is awesome, the bartenders are the least pissed off of any bar I've ever been to in the mission, and the drinks are strong. Get yourself a bunderburg and jameson and you'll be made in the shade. The clientele is what one might expect from a bar on 17th and capp, though yuppie transplants do have tendency to show up expecting \"Uptown\" to mean \"Overpriced and White\". That is, if they don't get scared away by Snoop, the friendliest crackhead in town. He gave ME change! The only reason I'm docking these guys a star is because I'm there all the time, step outside for MULTIPLE cigarettes, and the bouncer asks for my ID every fucking time.", "author": "Willy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "On friday and saturday nights, when the D(elirium) is packed with yuppies trying to slum it, this is where a percentage of the weekday Delirium crowd goes.  Good divey bar, lots of hipsters.  Never standing room packed, and they have a pool table.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-23", "description": "this bar is OKAY. only because it is really close to my apartment & there is a lord of the rings pinball machine. it has a really relaxing feel to it unless you go on a busy night. the big tables make it easy to sit with your friends & chat if you can actually get a table. the jukebox has a good selection of music but hearing it at this bar just makes me kind of sick. its not the only place in a 4 block radius that serves drafts for $4 & pbr/tecate for $2, though. the bartender has never been nice & the well drinks are too weak. \n\nive never been desperate enough to go to this bar; id rather just go to kilowatt, delirium, or benders.", "author": "Annette s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-10", "description": "Stopped in recently to this refreshingly off the beaten path dive bar while waiting for a table at Maverick, which has no bar to wait in. After stepping over and around all the bikes parked outside, we found a dark (as dive bars should be), and fairly clean (as clean as dive bars can be) interior, with a down to earth vibe. They have booths, what looked like a sofa seating area, and a pool table on the other side of the bar.", "author": "N B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-02", "description": "Everytime I go to this place I am struck with a whiff of foul body odor...seriously....EVERYTIME.  Oh, and the first time I came to this place, I had to tell some nerd boys burning napkins to STFU!!!  They were probably not even old enough to be in a bar and consuming alcohol.  Other than that, this bar is okay.  I will go here again and suffer the aroma.  I'm a lush and this place is 10 times better than any bar in the Marina.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-12", "description": "This used to be my local bar when I lived in the Mission. It was really cool and what I would solidly call I dive. This is where I learned how to play (and simultaneously forgot) pool. The drinks were fairly cheap, and have probably gone up in price. But overall, it is a fairly unpretentious bar when I used to go there.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-23", "description": "Alright dive bar.  We came on a weeknight and it was somewhat empty.  So the alcohol came quick and we got seats at the bar.  I'm happy.", "author": "Naomi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "I enjoy this bar.  I like the couches in the back and I would have given it five stars if I didn't hear the SAME songs over and over again on the jukebox.  The bartenders are great and generally pretty good people hang out here. Thursday nights are my fav.  Don't forget the bar is CASH only.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-02", "description": "The Uptown is always solid for a low-key atmosphere, a relatively cheap beer (under $4), and comfortable couches.  There's a pool table in back and a pretty decent jukebox.  My favorite parts, besides the comfy couches, are the bathrooms (complete with fecalface.com stickers) and the huge painting above the couch area.  The place has character and is definitely chill.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-30", "description": "i really liked this bar!  it had a great energy, not too snobby or hipster!  cheap pbrs (2 dollas on a saturday?!!) and friendly folk.  we found some nice people right upon entering.  cute boys A+++ :)", "author": "Lindsey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "This is hands down my favorite bar in this part of the city. I have made people walk here from BART when they say \"Hey, you know a good bar in the Neighborhood\"", "author": "Gabe L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-29", "description": "I just have never managed to get Uptown, despite going their with friends on several occasions.  It is a dive bar, but to me it seems more that it is more just falling apart.  Maybe it is just ending up there at the end of the night, but I find drinking there really depressing, sort of like one of the make Moe's look really soul crushing on the Simpson's episodes.  Not the sort of thing that makes me want to keep drinking, which really isn't helpful when I really want to keep drinking.", "author": "Alured P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-28", "description": "Two words. Beer Nuts.They have them packaged for fiddy centavos! (never eat a communal bowl of nuts or pretzels), unless you like germs, and i am not speaking about the band. This dive has a rad juke, pool table, and ample lounging space. The one drawback is the counter has that rounded edge corner that is tough to navigate if you're reading or whatnot, but you're at a bar, you're supposed to be drinking and socializing, not homework! The tenders of the bar are cool too, with little 'tude. It's in my neighborhood, and not too clique-y.", "author": "wayne s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "This is my favorite bar in San Francisco, make that my favorite bar in California. They loose one star for not having enough room around the pool table, when you're drunk and trying to excuse your self for jabbing people in the stomach with a pool cue it gets complicated. The Juke box is divine, the couches and the booths are comfy, though dingy and the staff has always been nothing less than holy. The drinks are very well made especially for a dive and they have a good selection of booze, including something with a whole rattle snake in it, no joke!", "author": "Amelia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-13", "description": "Perfect as a dive bar. Mission hipsters? Check. Sketchy location? Check. Dirt cheap drinks? Check. After spending absurd amounts of money on drinks in Miami, anywhere that charges me $6 for a round definitely gets four stars. I'll be back.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-27", "description": "Great dive bar, my only problem is they don't take cards (I hate carrying cash). Other than that, super mellow place...not a pickup-type place usually some pretty cool peepz. Many of the same people there every time I go in there. Decent but not spectacular beer selection, I find it can be a good jumping-off point.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-31", "description": "A pretty good bar. It has pool, friendly bartenders, relatively inexpensive drinks, a number of good beers on draft and pinball.  If I ever get around to making a list of the 10 worst men's restrooms in San Francisco, this one is going on it. On the other hand, fastidious people probably wouldn't go in here anyway. Plus, I always clean my bathroom after every time I go here, so it does create good habits, which is unusual for bars.", "author": "Surly V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-26", "description": "I live across the street from the Uptown and I could not have asked the divebargods for anything more in a neighborhood bar. Nicest bartenders, best jukebox, and fully functions as my living room when I need a place to watch the news with friends. Also, the Pink Drink has ruined me many a time, and is now the first clause in many of my favorite stories: \"So this one time Christa made me a Pink Drink and theeeeen...\"\nHeart you Uptown.", "author": "Stephany A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-03", "description": "I showed up for the hour before last call and had a good time. It was one of the darkest bars ever. There might have been a big painting?", "author": "B C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "i enjoy the uptown when it is not too crowded. they have a great jukebox selection and a pool table that only costs 50 cents for a round. it's also nice to sit at a booth and chat with a circle of friends. the bartenders have always been friendly, the drinks tasty, and the company good.", "author": "Kayla K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-03", "description": "Man, fuck this bar! What a shithole. My worst all time bar experience happened just the other night at said uptown. Have you ever been in a bar that not only denied you water but whose bartender (I believe his name is John) leaned his arm smugly on the counter and said \"Are you gonna get a beer with that?\" My reply \"Not quite yet but I am sure I will in a few.\" He responsed to me, smugly and like a dipshit, \"How do I know your not gonna just drink it and leave?\" Its water, guy, its free in San Francisco and in most places in our country. Yes we have a limited supply and we need to solve the worlds water problems but guess what? WE NEED IT TO LIVE! My girlfriend and I walked across half the city to get to this dive (which up until this point was a favorite bar of mine.) She asked me to get her a water and I tried my best. After the douche-bag bartenders third \"you can't have water jerk\" comment I told him to fuck off and walked back to our booth. Upon hearing this my girlfriend got up and asked him \"Are you really not gonna give me a water?\" He gave her a couple words and she pointed out that we were here with 20 or so people. Easily three quarters of the bars customers. \"What if they all ordered water?\" he said. Good point guy. You're an asshole. At that point I was pissed and started yelling about what a dick he was, fuck you for not giving us water, who made you god of the drunks, etc, etc....All he could do is cower into his corner and cry that \"I don't like the way you are talking to me.\" Oh boo-hoo you fucking moron! Wow, ruined my night. I wanted to leave and almost had all 20 convinced to leave but they were expecting more friends. Who am I to ruin a poor girls party. So I played pool and had a some friends buy a few beers for me. I didn't want to give that jackass the satisfaction of getting me a drink. I have never been so pissed at a bartender or waiter in my entire life. So smug and moronic. Such an ass. Anyway and once again Zero Stars for the Uptown mainly for the jackass bartender, which is sad because other than that...it is a pretty nice dive.", "author": "tex w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-19", "description": "Had been coming here on the regular for a quick couple drinks either heading to or from some other place. Most times, the Uptown has nice, efficient bartenders and a generally good vibe. After last night, I will never go here again. The unfortunate denouement of our evening: friend orders our drinks at 1:40 AM, bartender announces last call at 1:45 AM. Chunky, usually benign, pseudo-intellectual doorman, decides that he can remove our full drinks from the table at 1:48AM, literally taking my friends whiskey and coke OUT OF HIS HANDS. Other friend wouldn't give his up, and doorman starts shaking with fury; shaking like Muhammed Ali with the DTs and then acts like he is going to punch him. Disgusting way to treat your patrons. His power-trippin (almost psychotic) ego can be measured by his beard. Gah.", "author": "Anon Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-25", "description": "smells terrible but the bartender is one kick a** lady. my credit card didn't work after she made the drinks and she just replied, 'there's more to life than money kid' and let me be on my way.", "author": "Derek Alistair J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-11", "description": "cozy hipster bar right off mission street at 17th. cash-only bar, couches, pool table, music blaring, booths, lotsa straight people but some queers too...sort of like the crowd of latin american club but on the other side of mission street. a good place to take just about anyone wanting to go to a normal mission bar.", "author": "Marla W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-11", "description": "this was the bar i was waiting for. unsuspecting when i walked in, i instantly felt stoked to be there. you are lucky if you arrive in time to score the coveted couch spots. this is one of those rare bars that you can approach from all angles - instead of a mirror behind the bar there is a window framing the faces of those whose names are next up on the chalkboard for pool. extra love for there being a pinball machine and a jukebox too. all that plus $2 PBR and a friendly and urban-ly attractive crowd? yessss....", "author": "julia r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-04", "description": "sometimes this place is just too hip, and due to the fact that i, however, am not, i sometimes feel a little outa place.  that doesn't change the fact that the bartenders are rad, and the drinks are cheap.  go there.", "author": "Dingo P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-02", "description": "This place has the dive-bar attitude and decor but without the disgusting, unusable bathrooms. It typically has plenty of seating in the form of wooden booths and sofas. The pool room has just the one table and is a bit cramped, but the surface is in better shape than the felt on tables at most bars. What's more, there's rarely a line to play, and each game only costs 50 cents. The jukebox has a good selection of rockin' tunes (read: classic rock, punk, Johnny Cash and the like), and the clincher is that the drinks are cheap: $2 for a standard beer, $3 for a premium beer and $3 for a well drink. The crowd manages to keep its contingents of the too-cool-for-schoolers and the scenesters to a minimum, so it tends to be nice and chill.", "author": "Eugene P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-05", "description": "this is definately a hipster bar.  The drinks are cheap but on a friday night its prety darn crowded.", "author": "pauline e."}
