{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Love this bar! Awesome place to watch sports games with great drinks and selections of beer! \nThey make a killer Bloody Mary! \n\nThe back of the bar has areas to hang out with extra TVs to watch games so you don't miss a beat.\nCool place to hang out with friends.. it's a gem! \n\nRecommend it!", "author": "Joseph J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Clean. Lots of beers on tap. A pool table. Sports-centric. It has everything. The bar has a design where booths and tables are situated all around the entire place. So, you can have privacy or communal seating if feel like it. It's also nice that the servers come around and check on you.\n\nThe back patio is a true patio, which doubles as a beer garden really. Again, there are sections for privacy and the patio is tiered so you get extra isolation if you want. The outdoor area does close earlier though.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "Vally Tavern is a great place in Noe Valley. While other bars inundate you with attitude and sell you cocktails infused with stuff you never heard of before, Valley gives you hard drinks and plenty of good beer with fast service.", "author": "Rafael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "My group of four had brunch nearby. Wanting to continue the drinking while sitting outside (it was a nice day), one of the boys suggested Valley Tavern. We stopped by on Saturday, June 17th around 2:30pm. We all ordered at the bar and brought our drinks to the outdoor patio.\n\n*Tavern Pimm's Cup: Pimm's No 1, gin, lemon, lime, cucumber, ginger beer ($12)\n*Racer 5 IPA: Bear Republic, Healdsburg CA, 7.5% ABV, 75 IBU ($6.50)\n*Space Dust: Elysian, Seattle WA, 8.2 ABV, 73 IBU ($7.50)\n*Allagash White: Allagash, Portland ME, 5.1% ABV, 28 IBU ($8)\n\nI got the allagash white. I couldn't really drink anymore, so I wanted something that was easy to sip on. We sat outside for a good two hours just enjoying the sun and talking. It was a slow afternoon, so we just chilled and caught up. I hadn't seen my some of my friends in a while. The waitress was really nice and attentive. She kept checking up on us even though we were just nursing our one drink each. The patio is actually rather big with many levels. We didn't have trouble finding a table as there was only one other party out there. Ended up sitting at the picnic table on the top level to the left when you enter the patio.\n\nGreat bar if you want to sit outside and enjoy a drink. Or a few if you're in the mood. If in the area, I'll definitely be back.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "I really like this spot because the patio area is big and its pretty nice to hang out in mid-day. They have a decent selection of beer and liquor and its clean.\nPerfect spot for a lazy day.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-10", "description": "I've been to Valley Tavern twice now and the atmosphere is nice. However, on my most recent visit, I was charged more for my drink than the price listed on the menu. I tried to fix the issue and brought the error to the staff's attention, but the bartender said that the menu was incorrect and that the correct price was the more expensive version listed on my bill. \n\nI left Valley Tavern feeling off about this, since to me, the ethical thing to do would have been to honor the price listed on the menu.", "author": "Taylor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "So many beers! So many screens! Finally, a real sports bar!! So happy. Even an outdoor area. Easy parking outside. I might be in love.", "author": "Kari E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "Fun local bar. Many screens. Bartender was friendly and knowledgeable. He also allowed us to bring our pizza to eat!", "author": "A. R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "We visited the tavern on a saturday evening. It was not crowded. and, ordered different types of beers. When you drinking your beer, you can talk with yiur friends, volume of the music is quite good. The main problem is here, they only serve 2 types of panini to eat. There is no any food such as chips, frebch fries. You can get some food from the other restaurants and bring them inside to Valley to eat they allow it. Guys who work there are cool and helpful.", "author": "Hatice S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "I am not a Barfly like Charles Bukowski as I have only drank three times in my life & all before the age of 21. I am a big hoops fan & especially since the Warriors have been having a historical season which makes hoops in the Bay Area exciting. I haven't owned a television in 20 years nearly as long as I have been vegan so going to see the Warriors play in the Finals at a Sports bar is a definite for me.\n\nI met some friends at Valley Tavern to watch the Warriors & the Cavs game. My friends enjoyed their beer while I had a grapefruit juice. The service here was on point. The energy was nice & the bar had several large screens for viewing the game. \n\nAnother nice addition was that Valley Tavern allows you to enjoy food from outside. One of the friends I was with had some pizza from Patxi's Pizza next door & found out that Patxi's pizza has Daiya Vegan Cheese which is awesome for those who want vegan pizza. \n\nThe game was exciting as was neck & neck the whole time yet the Warriors broke through in the final minutes led by Durant's superb performance in the clutch. He will be the Finals MVP!\n\nThe only drawback here was we were sitting right next to a smoking room & every time the door opened it was heavy w/ the smell of cigarette smoke. Definitely a time warp into back in the day before there was smoking & non-smoking sections of restaurants yet for those who smoke that could be a good thing. \n\nGo Warriors! I recommend coming here for game 4 of the Finals on Friday where the undefeated Warriors could potentially have a historical game becoming the first team in pro sports history to remain perfect in the post-season.\n\nWarriors! Warriors! Straight out of Oakland.", "author": "Shane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "Bloody Mary Review - Handmade with sriracha, tabasco, horseradish, black pepper and celery salt, this true tavern style bloody mary is easy to sip, and perfectly spiced. A full bodied heat coats your mouth while a bright acidity washes it all down. Garnished with bar olives, a cocktail onion, pepperoncini, celery, lemon and lime, you'll have all the nibbles you need. Why go? Spice. | Price: $8.50", "author": "Shelley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "This place is tight! I can see how it's a a popular watering hole for the neighborhood. Kinda divey - woodsy interior, lots of seating.Friendly bartenders, EXTENSIVE list of cool local beers/ciders on tap, and also many imaginative cocktails! I ordered something that had Peet's cold brew and Bailey's. Thumbs up.\n\nCool outside patio in the back, not much to see, but good option to be outside. Smoking allowed outside though, so not too great for non-smokers like myself.\n\nSwing by if you're in the area!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Watched NBA Finals here and had a blast. Not a bad seat in the place. Great selection and friendly staff. Loved it.", "author": "Erin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "This place has a friendly staff and large selection. Plenty of sports and other friendly patrons. \n\nLive in the area now after being in the east bay for 2.5 years and returned to noe valley because of places like this.", "author": "David A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "It's almost 15 years later from my first visit and it hasn't changed, a drinkers bar with good drinks and TVs for sport... quick service and great location... what does one expect! Not worth a trip for a tourist but as a local bar it's stellar... would be nice to live closer... but oh well...", "author": "Reg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "This is such a great neighborhood bar! My friend and I were exploring the area and felt it was time for a drink or two. Valley Tavern popped up on Yelp and was also the closest one. We walked in around 4:30-5 and the place was pretty empty (but by the time we left, they had a full house and a live band setting up!). The bar is super spacious, with bar seating, booths and regular tables up in the back. And what sports bar would be a sports bar without walls of TVs?\n\nThe bartender was interesting -- she was super nice, but at the same time a bit standoff ish? I'm not sure...She asked for our IDs, then walked away to help another customer. Then she'd ask us what drinks we'd want, then go close out someone's tab haha It was in no way rude, but it was weird?\n\nAnyway, I had my first Bloody Mary here. Yes, you read right. I had it with Grey Goose, medium spicy. SO GOOD! My friend got hers spicy, and loved it as well. After our cocktails, we both got a pint of beer. The bartender actually gives you samples to try! I don't see this happen too often at bars (or maybe I'm going to the wrong ones...). But that was super nice! The strawberry wheat one, not 21st Amendment, was really good. Those who don't like sweet may not like it though haha\n\nThey have a menu of all their cocktails and beers on the tables and bar counter, which is great. Prices are pretty reasonable, too. Hope to stop by again soon!", "author": "Doris K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "It's a bar, I guess? It's pretty inexpensive. I had cocktails with a friend here at some point; I recall them having a very strong taste of liquor. They didn't seem all that well-mixed.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Love this place! Good vibes, exellent service, and delicious drinks! Keep coming there every week. My favorite spot in Noe Valley", "author": "Guy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "Great little bar that's perfect for watching the game or just hanging with friends. Really awesome service (quick and friendly!) with your standard booze selection. I also appreciate that they've got a few food items on the menu- it's no frills stuff like fries, wings, burgers- but by not having a massive menu they can turn around the food quickly and it all tasted above average for a bar. They also let you bring in outside food which is a massive plus!\n\nReally big and nice outdoor patio (with plenty of TVs for watching the game) as well. Only one bathroom though which is a major bummer-\n\nCheck it out for sure!", "author": "Elliott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "This is our neighborhood spot! Everyone is welcome, we say it's the \"realest place in Noe Valley.\" Brittany is awesome, they couldn't pull up the Oregon game we wanted to see and she pulled it up on her laptop and she streamed it for us. That's the type of place this is. Our hood, our peeps. Real San Francisco and Noe Valley. Not enough stars  available to rate our gem!", "author": "Timothy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Friendly staff, great large patio area, and they know how to make a bloody mary!  They don't serve food, but sometimes they set up a grill outside and have a limited menu for game days. \n Only complaint is that the patio isn't dog friendly!", "author": "Riley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Deklin was nice enough to grab my friends wallet before we caught our lyft home. Great service, cheap beer and solid cocktails. 5 stars without hesitation!", "author": "Taylor T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Not a bad spot. Plenty of taps and not expensive. There's plenty of seating. They're happy to change the TVs to whatever you're looking for.", "author": "Micah B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-26", "description": "The beer is good, not great, 20+ taps, nothing of mention. If you want good service, you better be friends with the bartender, because she's too busy on her phone or conversing with her clique. We saw this spot as a potential local sports bar, we're gonna stick to Paxti's if we're in the neighborhood.", "author": "jacob m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "If you go here, hope that you get the lovely Linda as your bartender. She pours the best drinks, is understanding when you spill and is as nice as gets. If you were to try irish car bombs, you probably wont break our record. \n\nPs bring back the fryer", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Best Bloody Mary I've had in the Bay Area. Hands-down. The bartender was friendly and knew exactly what she was doing -- no garbage mix, just straight and simple with a generous serving of Tabasco (she asked whether I wanted it spicy). The garnish was amazing, too. Knocked a star because they weren't letting people out onto the terrace.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "In all honesty, this place is a dive bar with lots of tvs, but not to take anything away from its name, Valley Tavern feels like an old-timey tavern when you walk in. Wooden planks, secluded booths, and random bags of chips and nuts surround you as you take a seat at the bar. TVs blare overhead in every direction as the bartender makes her way over to ask what you'd like. Giant Bloody Mary for $10? Or special Valley Tavern mule (in the right cup) for $6? Or, how about one of our tens of draft beers, many bottles of wine, or solid selection of spirits? I could grow to love this place, especially because the space is huge and parking is easy. If they had food all the time, this would be my watering hole. Oh, and $2 off your first drink for checking in on Yelp. Good times to be had by all. You'll thank me later.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "As my friend is addicted to Easy Breezy (ok, it is really good), we had walked past Valley Tavern countless times and I'd commented on wanting to try it out. So on our bar hopping day drinking event on a hot San Francisco Saturday, Valley Tavern was my first stop.\n\nThe place is huge. Long bar, with a number of booths across from it and past it. There are two up front areas - one of which is a designated smoking section with it's own door that I thought was an interesting touch. The beer selection is actually pretty good. Not a pure craft beer bar, but they did have Almanac on tap and a number of other local craft breweries which I appreciated. The staff was also very attentive and helpful. There are pool tables somewhere, and they grab food from neighboring spots.\n\nNow for the true highlight of the bar - the backdoor patio/beer garden. Ok, first you hit this back foyer type area, which is the perfect spot if you're by yourself and want to read or get some work done and enjoy your beverage with natural light but not outside. Then you reach the three tiered back patio: \nThe bottom level has a table but is really there if you can't get higher seats. \nThe second level has 4 long wood booths. Depending on the way the sun is hitting or popularity, you might be sharing one of these.\nThe third level has one dedicated booth (which makes it feel a bit like a private VIP section) and another which was closed off that they may turn into a quick bar on popular days. \n\nThe outdoor area does close early due to noise, but the amazing Irish bartender was serving us out there.\n\nIf I'm in Noe Valley and want a great weekend day bar, Valley Tavern is it.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "I don't frequent Noe Valley much but when my wife and I were in the area, we passed this cute place with a sign \"beer garden\" out in front and we couldn't say no to that. Luckily it was a nice sunny day and sitting outside with a few drinks and with our friends was a perfect Sunday indeed.", "author": "Vanessa O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Food, TVs at every angle and then some, too many types of beer to go through, and game 5 Warriors v. Cleveland. Heaven.", "author": "Gordon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Linda is the greatest! Best bar I've ever been to. Try to break the car bomb record, you can't. #bringbackthefryer", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "My best friend and I came here the day after saint patricks day and enjoyed several drinks before walking back to our Airbnb. Adorable little place. Service was great and fast. Nice people! Wish I was there now!", "author": "Brittney F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "This is everything I want a bar to be. Friendly staff,  friendly crowd,  vast beer selection,  great food,  comfortable patio.  The place is always the right  amount of populated for people like me and my friends who enjoy a relaxed and non crowded environment.  \n\nNew favorite bar in the city.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Great place to grab some drinks and watch a big game. They have plenty of TV's to go around, also a great selection of beer. Definitely coming back for some games!", "author": "Ian E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "Cool sports bar in the Noe Valley area, with a lot of tv's and ample bar space. The outdoor patio is also cool, and I liked the taps that stick out of the wall (no beer dispensed, btw). But $6 for a Trumer cup of beer, not even a pint or a bottle? Damn, Daniel. That seems to be their market rate, even though I went during St. Patrick's Day. I understand if it was a draft, but a cup? I don't think that's me being cheap, either (I've paid $10 for German craft beers, so I'm not afraid to spend, as long as it's for a worthy product). At least the service, even though it was busy, was fast and efficient. BART is also about a 15 minute walk away for commuters going back to the Big Bad East Bay. They also let you bring food in (there's apparantly a Patxi's pizza right next door).", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "The Best bar in Noe Valley .. very professional service, very good environment for those who want to have a rest from the problems", "author": "Marcos R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-10", "description": "The food is great. Soup, sandwiches and salads superb. A bit pricey.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "Good beer, good sports, I come alive in the day time! ;) Valley Tavern is the perfect place to grab a beer and watch the game with your friends. Like Stuft Pizza in Milpitas, their walls are lined with TVs. \n\nBesides the full bar, they have booths and tables scattered throughout this sports bar. If you're not sitting at the bar, the servers will come around quite frequently to clear your table and check if you need anything. What's even better than the great atmosphere is the *secret garden* in the back. All the way in the back, they have a table set up with salads, breads, hot dogs, cheeseburgers, and even pastries. It's free for the taking, but please leave a tip for the cook!\n\n... Go Niners!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "I'm not a bar person, and I loved this place. We came here for the super bowl. Free food, great beer and a garden!!! This is why I'm giving this place a 5 star. Because I was able to stay in a bar for 4 hours without going crazy. Inside was other story. Too crowded and two noisy (again, I'm not a bar person).\n\nI'm pretty sure I'll be there for the next super bowl!", "author": "Maggie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "I have been here a couple times now and as someone who loves beer and great service, this is the place to go. The atmosphere has character which is refreshing compared to other bars in the city. It has a really cool outdoor space that is terraced with lots of tables. The selection of beers on draft is one of the best you will find. Finally, one of the times I went was during a Warriors Playoff Game and the place was packed. I have worked in hospitality before and the way the staff handled the crowd was perfect. They worked their butts off to make sure everybody was getting service in a timely manor. I was extremely impressed and will be going back to this gem for years to come. Oh yeah, they also serve food.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "Love this place. \nLocal yokels from my neighborhood.   Laid back.  Mellow.  Friendliest bar staff I have ever met. \nBBQ during football games. Very mixed crowd. \nI love the selection of beers on tap!\nThere is a great jukebox and Paxtis Pizza (next door) will deliver right to your place at the bar. One of the bartenders will even order for you. This is a great place. Truly a SF original.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "My favorite bar in Noe Valley. Large selection of beers on tap, lots of tv, cool neighborhood people, great service. The place is clean and looks good.\nThey have a patio which is great on warm days if you want to come as a group of friends or even on your own.", "author": "Muhip T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-25", "description": "Great place! Old American style pub quite cheap and with a good food and beer selection. I would definitely stop there again cause I d like to try a lot of stuff that was on the menu but didn't have enough room. Service was not so good.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Wow this place is great. Strong drinks, excellent service, and a beautiful back patio. LOVE.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "The best Sports Bar in San Francisco is the (Noe) Valley Tavern. \n\nTelevisions galore adorn every higher wall in this establishment. TVs in HD and nice and big easily create an environment with no bad seat in the house. \n\nGreat beer list on draft as well and prices are fair at $6 a craft pint. \n\nThey even serve grilled sausages of different variety for FREE on game day. \n\nSay what you want about Noe, the Valley Tavern is the soul of this part of town.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Nice local tavern...a large selection of beers on tap!  Wonderful garden terraces to gather with friends and socialize.  An ample sized bar surrounded with a large number of big screens displaying a variety of sporting events.  Booths inside to cozy with a date or group of buds.  Tasty drinks...friendly on it bartenders an Waitstaff!", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "Love love love the valley tavern! Come with some friends and enjoy the back patio in the sun with some beer or mixed drinks! Favorite spot in Noe Valley for casual drinks and conversation.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "This place attempts to be a little divey but is actually really nice. You can go here for birthday or other celebrations, great couch/cubicle type seating and affordable drinks! Lots of screens if you want to watch a game too. Nicer than most of the places I've been to in the mission.", "author": "Nilay P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "Walked in while waiting for a table to open up at Contigo. \nNot bad, pretty chill. Has a pool table in the back.", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Have been coming to this bar as a favorite for a few years now.  They made a mean bloody mary and have so many good beers on tap!  The staff are great and its probably one of the best places to catch a game.  Pro Tip:  You can order a pizza from Patxis next door and bring it in - they don't mind. :)", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "Came here to watch the World Cup final. Super crowded. Was at a table with 9 people, ordering all kinda of drinks. We probably spent well over $250. The waitress was really busy and My girlfriend and I wanted water, so I walked to Starbucks and bought two bottles of water. When I tried to come back in, the owner stopped me and said I can't bring bottled water inside. He said they sell water and I couldn't bring outside water in. As he is saying this, people are entering with pizza, coffee, etc...all from outside sources. So I walk to my car and put the bottles inside. When I come back, the owner says sorry and asks what number table I'm at and will bring water to me. I tell him and say that we're spending lots of money and just want water. He says he'll bring it. \n\nIt's now been 25 minutes and he hasn't brought water. I've asked the waitress and she hasn't brought water. \n\nNot sure what's going on here, but they're only interested in you if you're spending money. God forbid you should ask for anything free. I'm surprised I even got a free napkin. \n\nDear owner - you're a jerk and I won't come back here again.  \n\nPS it's now been 30 minutes and no water.\n\nPPS it's now been 40 minutes without water. \n\nPPPS it's now been 50 minutes since I asked for water...and nothing.\n\nPPPPS finally got water 55 minutes after asking. Not even thirsty anymore.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Live just up the street and this is absolutely hands-down the best bar in the neighborhood.\n\nSomething for everybody really.  Little enclosed - but open to the street - smoking room at the front, small patio at rear , and a long bi-level main bar with a dozen or so screens showing a variety of the sports du jour.\n\nHuge ale selection and prices are decent.  Plastic happily accepted.  Bring in your own food, or order in from the neighboring pizza and pasta places.\nFriendly crowd of, mainly, locals.  Lots of euro expats, especially during the soccer games.  Wide age range.\n\nStaff are uniformly great, friendly and efficient folks.  That's what keeps me coming back.  Special shout out to Declan, Rikki and Linda.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "Right down the st from my house, local pubs are always the best.\n\nEnough TV's everywhere so you can catch the games and a huge beer list.\n\nDid i mention that they will grab food from across the st? perfect idea.", "author": "Enrique R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "My husband and I were in town and staying in the neighborhood.  We stopped in on a Thursday afternoon for a couple of drinks after touring Alcatraz. The place was pretty empty except for a few regulars at the bar. The bartender was friendly and greeted us as we grabbed a seat. Nice selection of draft beers and all were reasonably priced. Would definitely stop in again next time we are in the area.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "I bring anyone that teases me for moving to Noe Valley here - and it does a pretty good job of soliciting an 'alright, I guess it's not too bad'.  They have a solid beer selection and nice little patio and plenty of screens playing the game.\n\nThat being said, do not try their 'specialty' drinks.  Their tika masala bloody mary was hands down the nastiest thing I have ever drank and their pickle back is pretty gnarly as well.", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Excellent neighborhood bar:\nFriendly staff\nAdequate (but not particularly novel or wide) selection of beers on tap\nGood group of regulars\nBar + tables + patio seating before 8pm\nSeveral screens for ball games\nWhat's not to like?", "author": "Scott C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "Pretty good for watching football.  Lots of TVs with many games on.  They don't serve food in house though.  If you order food, they get it from a restaurant nearby in a takeout container.  The beer selection was very good and the cocktails were decent.  Cool neighborhood...", "author": "Nisha P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "Go to spot for NFL Sundays.  Good crowd, good beer, and free food, what more can you ask for.  During playoff time, this place is packed for the niner games.  They will have free BBQ (burgers, hot dogs, wings, ribs), did I mention they're free.  TV's are all around the place.  There must be over 15 TV's.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-16", "description": "Disappointed with service mostly and, as a unique beer lover, I was disappointed with their selection. I'll continue to walk to my favorite beer bar, Toronado's and Patix's in Noe Valley, though limited beer selection. They are more personable and not clique-ish like Valley Tavern.", "author": "Don M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "I love this place! TONS of beers (and ciders yay) on tap, super friendly staff, and really thorough sports coverage. I was here for the Giants winning the 2012 WS, and it was SUPER!! They've always been really accommodating of large parties (their new upper-level booths are fantastic), and they're reasonably priced, too. \n\nAlso, I have to disagree with some of the other commenters--I've never experienced any sort of discrimination from either staff or patrons. It's a nice vibe here; friendly, gregarious, basically as advertised--a good neighborhood bar.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "Just moved to the area so came here looking for a place to grab a drink and watch the games.  Overall was very pleased with the experience the staff was friendly and the drinks were good (bloodymarys).\n\nWould definitely come back here again and seems like it would be a great place to hang out and enjoy some sports games.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-15", "description": "Oh yeah!  Screens on practically every wall to watch sports, an awesome selection of beers and well drinks, and a great place to hang out with the buddies.  \n\nThe only reason why it gets 4 stars is because they don't have any grub- however they do have menus from neighboring eats (e.g. patxi's who delivers within steps of this place.)  Well, by forgoing the food, there will be less drinks to make me experience paresthesias of my phalanges.\n\nBe prepared to be faked out about how young you look by the bouncer at night, because ID's are required by all.  I don't look like a spring chicken anymore, so I am not easily flattered when asked to produce my drivers license.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "Was recently sharing reminiscences of living in Noe Valley with a chick I met at a party and she said, \"Yeah, Noe is great there just arn't a lot of bars to go to at night except um...you know...that one...\"\n\n\"Valley Tavern?\" I posited. \n\n\"Yeah, yeah. That's the one! Where you can smoke in that weird little area! How'd you know?\" she exclaimed.\n\n\"That's where all the bad Noe kids hang out.\"\n\nWe giggled. But it's true. And by bad kids of course I mean cool kids that still don't have kids. \n\nSeriously though, Valley Tavern is a refreshing \"Just a regular ole dive bar\" in the midst of so much Whole Foods, acupuncture  Double Soy Latte, fro-yo, children's learning toys pretension. It's kind of fun to watch the shock and awe as the Noe-folk walk past the smokers box (\"People STILL SMOKE???\"). Yeah, they do. Get outside of the Bay Area once and awhile, for god's sake.\n\nIn general, a great place to get the stick removed from your ass if your starting to develop one (and we all do these days, right???). Lots of good beers on tap. Pool table. Internet jukebox regularly loaded with the eclectic stuff by Noe denizens with good taste. Nice bartenders, fun bouncer, good for sports, and even karaoke a couple nights a week.", "author": "Serena Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "The Valley Tavern used to be my spot for watching games and meeting friends when I lived in Noe. It has the pub feel with many beers on tap, pool table in the back and always entertaining. \n\nThere's karaoke for those who dare to sing a little louder and they let you bring in outside food, so I suggest you order a Paxti's pizza from next door and order a few pints in the meantime. Next song up is yours...", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "Went to VT for the Monday Night Football game. It was about as lively as I expected Noe Valley to be..... This seems to be a quiet bar to grab a drink and catch up with friends while viewing a game on 1 of their 15 tvs. The crowd seemed to be more 40-50s and grabbing a beer after work.... It is not loud and easy to talk with one another at the large booths or at the bar. \nThere are large number of foreign beers on tap and a really cool beer garden in the back. Also, the pizza place next door delivers into the bar or you are allowed to bring food since they do not serve any. They do however supply plates, utensils, etc.  Very friendly service! \n\nWorth a visit for some good european beer!", "author": "Paul P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-16", "description": "Neighborhood bar which now serves food. Really just comes across as a mediocre brewpub with poor service. Which works for Noe. Won't be returning, will go to Dubliner instead.", "author": "F G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-08", "description": "Great spot with loads of quality taps. Lots of screens to watch games and friendly staff. Nice beer garden for good weather. A bit pricey - $7 for a beer. Great neighborhood.", "author": "Lori P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-30", "description": "Oh you dear dear dear old friend!  How I enjoy drinking with you on Friday nights!.... Thank you so much for letting me bring dinner in......\n\nThis place is great!  The staff is Irish or Irish adjacent... I love to ask 'what county are you from' (if you're Irish you will understand)... The hubby says it's important for an Irishman to have 'his bar' where everyone knows your name...and you can talk about the going ons back home....   The crowd is very engaging and liberal... everyone is there to unwind a bit...", "author": "Blake J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "This joint has an awesome back patio. Its three levels which allows you to find at least one spot. On a hot sunny day its as if you are somewhere else. The brews and bloodys are delicious and the bathrooms are surprisingly clean. Good stop if you want to read and grab a beverage.", "author": "Bri R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-17", "description": "The only bar in the area that's not a complete dive. which is a nice option.  Plenty of TVs and an extensive liquor list.  We sat at a table and had to wait like ~20 minutes to get a waitress to come over (mind you it was NOT very busy, at all).  And then she had to take our orders once, go back to the bar and get a notebook because she for them, and then take them again.  Add 10 more minutes to get drinks, and we were losing steam fast.  All in all took way way way too long to get simple drinks when we could have just walked up to the bar and ordered in 5 minutes.  Our mistake, but not super impressed.", "author": "Raina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Very nice bar, with a HUGE selection of beers.\nI went there to watch a football game and I really enjoyed it! \nThe only thing is that they don't serve food, but it's ok to bring your own. Other reviewers recommended the pizza place next door, but it's quite expensive.", "author": "Charles R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "The live music performances are realllyy good! No cover charge  and great cheeseburgers.", "author": "rena b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Huge and regularly updated selection of beers on tap - including good stouts, Matilda, and sometimes also Fort Point. Decent TV screens for various sports, a sizeable beer garden, and Free BBQ on football Sundays too!", "author": "Nik Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "Came here for a 49ers game a few months back and it is definitely a great place to grab a beer, sit back and chill.\n\nLarge selection of beers on tap, and there's even a yelp checkin coupon! $2 off on your first visit! \n\nThere's quite a few tv's in the bar so you won't get blocked, especially in the back. I can't vouch for the people in the booths as more and more people trickled in and stood in front of the tvs though. \n\nWhat makes this place even better?! They have free food! (With tips much appreciated, of course)  It's self served out in the back patio. Someone is cooking food somewhere and constantly bringing food out,. There's hot dogs, and salads, with the occasional chicken wings and even bbq! \n\nDefinitely a place to keep bookmarked. I'll see you again soon, Valley Tavern! Especially when football season comes back.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "this is our go to spot for a beer and some football.\n\nthey have multiple tv screens indoors and outdoors.  beware though...this place gets super packed on sundays (during football season).   they offer free bbq on sundays...just don't forget to leave a tip.  valley tavern also has a wide variety of draught beers...wish they had trumer pils...but i guess i don't mind the pilsner urquell.  \n\nthe bartenders are super nice and attentive...oh, and they have a pool table!  \n\nbathrooms have been pretty clean when i've used them...but then again, i try to avoid them on sundays.  haha.  they don't offer food...but i normally like to grab a slice at patxi's next door.  pizza and beer...can't go wrong with that combo right?", "author": "Jen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "FINALLY GETTING AROUND TO THE REVIEW! THUMBS UP GREAT CUSTOMER SERVICE TAVERN SQUAD!! Decklin, Olivia, Britt!\n\nThis is our regular stomping ground during the NFL season. Although the staff are 49-er fans they are uber New England Patriot friendly as well whooo hoooo! Usually there is a huge following of New England fans in this bar. I've also watch Sharks games and MLB here. It's a total different crown on evenings and weekends though. \n\nTons of draft beer selection available by pitcher also, a wicked homemade bloody mary, and you can have food delivered from nearby restaurants if you want.\n\n****TO THE CHEAPSKATE \"ARTHUR Z\" WHO REVIEWED ABOUT THEIR COVER CHARGE THIS YEAR:\nDuring playoffs this year they charged a $5 cover to weed out the bad element that started coming into the bar, and it worked out great! No problems with drunks/riff raff trying to cause trouble! The locals and regulars had no problem paying a measly $5 to get in, and yes they always put out a ton of bbq food all season and never charge (donation only if wanted). Obviously if you had a problem with the cover charge, you aren't a local/regular, don't know the bar, and I for one am glad your cheap ass won't be back! \n\nFunny how Arthur Z has to leave San Ramon to find a decent bar huh, nuff ced.", "author": "Risque B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "The crowd has already spoken, and while I would quibble with the 4-star average, people have successfully hit upon all the main points. To recap:\n\nStaff: awesome\nTV's: showing the game\nPorch: Open again (NIMBY's can't keep us down!) and sunny (Noe Valley)\nBloody Mary's: try them with Hanger 1 Chipotle Vodka next time\nFood: The bar is now serving Paxti's, Little Chihuaha, and Easy Breezy, for those willing to walk less than a block.\n\nIn short, a winner.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-23", "description": "Midnight in the Garden of Good and Evil,\n\nThis place is a great tavern for anyone looking to go have a nice drink. It caters to the sports fans with TV's that play games. It caters to intelligent types with their Brainstormer's quiz. It caters to Sun worshippers with it's beautiful backyard garden.\n\nPros:\n\n1. Friendly staff and very prompt\n2. Lots of seating both inside and out\n3. The only tavern in the area with a great garden\n4. The most beers on tap of any of the bars in the area\n5. Brainstormer Quiz on Tuesdays\n\nCons:\n1. Smoking room in the front of the building. As a former smoker, I realize this is a pro for you. I however can't stand the smell of smoke anymore. (the good news is, the smoke smell doesn't carry into the rest of the bar.", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-29", "description": "This is a solid watering hole. Been here a handful of times over the past couple years.\n\n-open space inside, natural light, not some seedy joint, and there's a tri-level beer garden with outdoor flat screens\n\n-Patxi's delivers! & their menus are everywhere.\nAdditionally, you can bring your own food in.  Once a friend of mine and I brought some killer sandwiches from the deli across the street, the bartender immediately gave us plates and extra napkins. He rocks. Plus, he was bumpin 80s when we went.\n\n-Kick ass tap beer selection\n\n- Unpretentious crowd, both blue collar and suiters out of their suits\n\n-Not a dive and definitely NOT a loser bar.  You've been to those and if you're like me, they end up on the ixnay list.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "As just about the only place open past 10pm on 24th Street in Noe Valley, I'm a fan of Valley Tavern when I'm in the neighborhood, even though I don't have a lot of options unless I want to make that long walk to the Mission or the Castro. \n\nThe crowd is mostly local, since Noe Valley doesn't exactly call the party set. They've got a big selection of beers on tap, though I wish there was more variety in the wheat beer department, mostly because I drink like a college sophomore rushing a sorority. That said, the cocktails are strong and the Fireball shots we had made me curiously drunk-ish even after I woke up the next morning. \n\nOf course, post-midnight, your options get very limited for transportation if you don't live in the area or have a designated driver. ('Cause drinking and driving is for jerkfaces.) But thankfully, the cabs in the area seem to know that too, and we were able to catch one rather quickly. \n\nIf you find yourself in Noe Valley past 10pm, well, as far as I know, this is your only option. But the wait staff is friendly and the drinks strong, so as \"only options\" go, this is a pretty good one.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-27", "description": "Cool place to hangout only when you're with your friends. I came here on the way to home to get a beer and hopefully to meet some people but that wasn't the case. The lady bartenders were busy talking with each other and the crowd was only sticking to themselves (rightly so as one does at a bar). Didn't feel welcomed here but would come back only with a group with my friends.\n\n As for friendlier bar, I'll go to The Peaks down the street.", "author": "Ezequiel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "Nice local spot to catch the game and a cold one. Nice crowd.    - 1star as the took out the pool table.", "author": "Mick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Visited on a Sunday morning to watch the 49ers play. Was absolutely packed, but has a nice atmosphere with plenty of die-hard fans. Free food on the back patio throughout the game. I'd definitely return if I'm ever in the neighborhood during a game.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "Valley Tavern, you've earned a coveted 5 star review! \n\nThis place is awesome! The bar is cozy, but not too small. There is an outside patio, pool table, bar. \n\nMore importantly: every Sunday, they have FREE food! Yes, free hot dogs and hamburgers, as well as assorted chips, etc. It's an amazing perk to the usual bar fare and i was very impressed. \n\nTop all of this off with a badass digital jukebox and we've got ourselves a go-to location! \n\nIf you're not planning on heading to Noe Valley, well, here's a reason why you should!", "author": "Tom A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "I have been coming to the Valley Tavern for the past 4 Patriots seasons. In my opinion, it's the best sports bar in San Francisco. Lots of big screen TVs and plenty of seating so you can always see the game. I can't say enough about Decklin, Britt, and everyone who works there. They are always friendly and the service is always great. I would highly recommend Valley Tavern to anyone looking for a great sports bar in the city.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Very cool neighborhood pub. Beer selection is great & staff is friendly. TV's everywhere which is awesome since the Giants are in The World Series! Cheers!!", "author": "Ellie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-15", "description": "So I am finally back  to my  home sweet home San Francisco Noe Valley   from the Army most of the time I was stationed  in Germany  I think this place use to be called rat and raven forgot . but I went in there to have a beer and seen it looked different for the better. and a lot more beer but only 1 or  2  from Germany  and of course the ones I did not care for but in the end it worked out I got to try ones I never heard of and they were pretty good so I will be trying a different one  each week. the people there were all cool and laid back, no sketchy people hanging in the latrines or outside and being out I felt pretty safe in there. now the trick is meeting new friends.", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "Wednesday 25cent wings! The chili lime is my favorite but buffalo isn't bad either. You have GOT to try their garlic crab fries though, it is one of the best things I've ever tasted and the portions are huge! The atmosphere is great for watching sports games but get there early, because it will be crowded!", "author": "Yige Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "If in San Francisco's Noe Valley neighborhood, and thirsty, go nowhere else but the VT (as we locals call it). The drinks are great, especially if you're lucky to get one of the barkeeps to make you a mixed cocktail. The crowd is very friendly, and they have an outside beer garden in the back that's open until 8pm for taking in the sun on those beautiful SF days. \n\nWith a whole bunch of TV's, you can catch any flavor of sports, may it be the Giants or the 49ers. (Yes, other teams can also be seen on the screens)\n\nIf you're looking for customer service, you'll get the best service in SF. They are ALL polite, courteous, and very prompt. No grumpiness or attitudes to be found at the VT.\n\nProbably the best watering hole in the city. Find yourself there.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "Was waiting for a table at a restaurant down the street.  We stumbled into this place and had a really great time.  The drinks were good, staff was friendly and there was a Yelp check-in deal that was really nice too!\n\nThey have tons of TV's, we are going to be back for sports games and a chill night really soon!", "author": "Chad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-17", "description": "One lovely Wednesday evening I decide to satisfy my craving for a bloody Mary.. I believe Adaya ((sp?)) made my drink. Jessica brought our drinks over and was very welcoming!\n\n\nI found the perfect bloody Mary!\n\nThis bloody Mary was just the right amount of spicy. It came with olives, pickled onions, celery AND pickled string beans. Neek was thrilled about this!! I'm tired of v8 poured in w a shot of vodka.. This was made with effort :) Friendly staff, dim lighting at night, fairly clean..", "author": "Neek W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-25", "description": "Imagine if you will, a lovely Sunday afternoon in lovely wood-filled tavern with plenty of beer an a smattering of lovely folks (some even lingering in the lovely back patio). And towards the back, a lovely table set up with all sorts of bbq fare and a lovely little sign beckoning readers to please help themselves to the free food. \n\nIf I wasn't holding out for a proper meal with my darling later, I would have been all over that stuff. I'm fairly certain the free food is related to NFL Sundays but that might be reason enough to get me to watch that severely docile sport in public.  \n\nIt's a lovely watering hole as it is but its participation in Barspace might be the only reason I'm not madly in love with it. It's possible to be here and not be on camera (you're not viewable if you sit towards the back) but the fact that it's there still kind of bothers me. Nevertheless, it's still a nice spot with nice people and a nice free food spread.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "This is my favorite bar in noe valley. They have an outdoor patio in the back. This place always has a bunch of people and something going on. Cheap drinks and a good spot for drinks.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-14", "description": "Valley Tavern WAS my sports bar of choice - spent two seasons watching New Orleans Saitnts games there, as they are not televised locally, and I do not own a TV anyway,\nToday I went there, got my table, watched game, ate food,...the game went into OT, as the Niners game went on. Mind you, there are about 20 tvs (estimating) all on the Niners game. Some little young lady whined that THEY SAID ALL THE TVS WOULD BE ON THE NINERS - waittess grabbed remote and changed channel telling me I COULD FIND SOMEWHERE ELSE TO WATCH THE END OF THE GAME..which, by the way, ended a quick field goal later.\nSo, anyway, since it does not matter that customers other than 49er fans are not reprsented there, I WILL FIND ANOTHER PLACE TO WATCH THE GAME. there are plenty of places with a beer and a television \nAND A BETTER ATTITUDE..", "author": "Eugenia P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-08", "description": "There is absolutely nothing wrong with the Valley Tavern. It's a tavern.  In Noe Valley.  And when I'm looking to have a quick drink after a long afternoon stroller-dodging on 24th street, this is a solid place to wet your whistle.  The beer selection is good, it's rarely all that crowded and indoor and outdoor seating in plentiful.  \n\nOn the seating, I would actually call their beer garden the highlight of the place.  I'd been to the Tavern a few times before I even noticed it was there but once you step outside, you'll be pleasantly surprised at how big and chill it is.  \n\nSports fan?  I think there approximately 76 TVs in this place, so you'll have your pick.  Pool shark?  Yep, they do that here, too.  Love a booth seat in a bar?  Check.  \n\nSo lots to like about this place.  To be truthful, there is nothing exceptional about it, either, but for a good old neighborhood pub, Valley Tavern gets the job done.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "I'm a fan because it's close, staff is friendly and the owner knows how to run a good bar. Not cheap and I wouldn't call it a 'dive'. \n\nOnly downside for me is that the place seems to be getting more popular lately- which means it's harder to have a conversation or find a seat.", "author": "martin l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "My favourite bar in the city. Great service, awesome staff (special shoutout to Linda) and friendly atmosphere.", "author": "Padraig J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-07", "description": "Don't live around here.  Visiting my dad who lives sort of close..Diamond Heights/Noe Valley area....looked on Yelp to find somewhere to go.  \n\nAt first was disappointed to realize they didn't serve food but bartender immediately advised that a few places delivered and she was willing/able to call and place an order and give CC info so I didnt have to do anything but sit there and decide what I wanted.  I think it was Bascos or something that I had food from...decent sandwich with great fries.\n\nAll female bartenders while I was there and all three were good, especially one, but I didnt get her name as she wasn't at bar when I left.... longer wavy dark hair.  Anyway...good experience and I would come back.  Thank you!", "author": "Meghan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Another great neighborhood bar in my opinion. Very clean, a food menu offered, and a full bar. We indulged in a couple of beers while watching some sports and totally enjoyed ourselves. It was a Sunday so not too crowded but I would imagine this place is \"poppin'\" on a Friday night. In addition to the indoor area, there is an outdoor patio out back. A nice addition. I can't say much else since our time was short here but the bartender was very pleasant and there's no reason we wouldn't return if we venture out to 24th street again. Oh yeah, there is a $15 minimum for credit card transactions, but there is an ATM in the bar as well as a Wells Fargo across the street and a Chase bank about a block down.", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Great beer selection. Great crowd and atmosphere for sports.\n\nWe have been watching postseason Giants baseball here, and always have fun. \n\nOnly negative is that beers are on the pricey side ($5.50-$6.50 a pint).", "author": "Steve P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "This is a great beer bar!\nIf you like a variety of beers on tap or bottles, this is your place.  Service was great.  I came here on a Sunday afternoon, but even in the daytime the place has a good vibe.  I'm coming back in the evenings!", "author": "Jack R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-20", "description": "$5 cover charge for standing room ONLY to watch the Niners/Falcons game without any drink specials and they're typical FREE NFL Sunday BBQ which turns out to NOT be FREE with the cover charge.  \n\nWe also tried to make a reservation since I have an injured knee but they lied to us and said they don't take reservations ONLY to find out that people have reserved spots even at the bar and all the booths.  Screw this place & I'm the Duke of it on YELP to, great job with the horrible marketing guys!!!  \n\nYou've lost my referrals and most of my business for your unclean old tap beer.", "author": "Arthur Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-29", "description": "I'm a regular at a bar in San Francisco's \"Pleasantville\", and couldn't be happier about it. Ever since I started working in the neighborhood, I began falling in love with Noe; If I were to pick a bar to represent it properly, it would be the Valley Tavern.\n\nThe crowd here is obviously very close knit and typically all regular faces, patrons and employees alike. Drinks are fairly priced and there is a large variety of beers on tap (which change every so often). \n\nPool table and arcade golf, but the real ace in the hole is their back patio! Multiple tiered deck for catching rays, which is used on Sunday during football season for -FREE BBQ!- yes, I said \"FREE\" and \"BBQ\" and \"football\". Not only that, this place typically keeps just about any variety of important sport match on their TV's no matter how obscure the sport.\n\nA real tavern, in Noe Valley of all places!", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "Love this place.  The staff are all friendly.  We come here to watch games since we don't get them at home.  The only downside is that they don't have the PAC 12 Network, which always amazes me in California bars, but that seems to be commonplace in SF. Will be back regardless. Huge upside is that if our game is on, any of the staff will always go out of their way to get it on a screen for us.\n\nThey have a solid beer list with options for everyone--it's no Monk's Kettle or Abbot's Cellar, but it's not supposed to be.  It's a friendly, fun, neighborhood bar that we love.", "author": "Steve K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "Stopped in for a beer and a shot after work.  Then I asked Katie how she rated the bloody mary out of a scale of 1-10.  She said 11.  So i bit and ordered one.  Katie was awesome and made the bloody mary perfectly... Ok it was a 10.5. But still... WOW!  Good job Katie and good job Valley Tavern", "author": "Aron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "Cool place to grab a beer and watch the game. They usually have all the games on. They also sell beer by the pitcher which is great when you're with a group. On game days this place gets pack quick so if you want a table make sure you get there early. I wish they serve food tho.", "author": "Ann C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "We first visited the Valley Tavern when we had moved over from England and went for a drink after looking around an apartment. The Irish lady was SO nice and gave us our drinks on the house to welcome us. It was the start of a beautiful friendship. The best thing about the Valley Tavern is that when you sit outside in their fab beer garden, the cheerful ladies come out just as you're putting your empty glass down and ask you what you would like for your next drink. But the options aren't red, white or rosé or one kind of beer. Oh no. You can have a Bloody Mary made to order with extra jalapeño and an olive, an Irish coffee, a WINE GLASS OF PROSECCO, a mimosa, a house special margarita or choose from the many beers they have on draught. They also play every sports game you would possibly want to see - and STILL COME OUT TO TAKE YOUR DRINKS ORDER SO YOU DON'T HAVE TO LOSE YOUR SPOT. And even on the most busy of game days, they don't get pissed off if you order a Bloody Mary with extra celery. They still bring it out to you with extra celery - within 3 minutes!!! And they don't judge you for being British and getting drunk on a Sunday afternoon in the most child populated area of San Francisco. Valley tavern, you don't know us but we know you and we  you.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "Noe's. The Dubliner. Bliss. Twin Peaks. \n\nNow all these places have their charms, Noe's is attached to Basso's, The Dubliner is REALLY CLEAN, Bliss is dark and has jazz on Sunday afternoons, and Twin Peaks has that bartender that is always laughing and some ex-cons. But the best bar in Noe Valley is hands down The Valley Tavern. \n\nThe tavern has everything I want in a bar. Pool table? Yeah, they gots two. Juke box, yeah, one of those infinite jobbers that I love to program for hours to keep away the Gaga and Kei$ha. Beer garden out back? Not quite the Wild Side West, but still pretty cool. Food? Delivery from Basso's, Patxi's, all good. Czechvar on tap? Oh HELLS yeah. They have like 30 beers on tap or something, so you are bound to find something you like. No Booker's bourbon though : ( \n\nBut the best thing about the Tavern is the friendly bar staff. Declan, Marie, Kellie Jo, Jon and the rest of the crew are really fun and attentive, and, if you are a local, they get to know you and your drinks and practically have a fresh pint waiting before the first (or ninth) is gone. \n\nThe Vally Tavern is a great, local bar, and if you live in Noe Valley or the surrounds, then I would definitely stop in if you have not yet. Cool spot.", "author": "Bad Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Awesome game at the Valley Tavern! Linda & Deckland are amazing & I'm definitely come back again and again and again!!!!!", "author": "Alpa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "VT boasts a wide array of beers on tap, and the taps are all lined on the walls framed by barrel tops.  the alcohol selection isn't too shabby either.\ncheck out their gigantic touch screen jukebox -- i've never seen anything of that size!  patio out back for those gorgeous days, or when you just want to enjoy your pint outside, as well as an indoor smoking room.  the staff are always friendly and on point.\n\noverall great pub.  what's not to like?", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-18", "description": "Reeks of smoke! Gross!\n\nGood service and drinks but the smell is atrocious.\n\nFor the first time in SF, my clothes came back stinky. I wish I could frequent this bar, but there is no way I can tolerate the smell.  :(", "author": "Shal J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "\"Valley Tavern: Where the Neighborhood Meets\"\n\nSan Francisco certainly won't have a shortage of bars anytime soon, so with all of this choice for the average Jane and Joe, why stop at the Valley Tavern? Aside from the awesome beer garden at the back of house, VT just feels like home: a drunken and debauch home at times, but home nonetheless. Staffed by some of the friendliest bartenders in SF, this place just feels warm and inviting. Some people might disagree with me considering the front of house looks a little plain and almost draconian, but take a step inside and sit down for a while. You'd be surprised by how easily you can strike up a conversation with one of the patrons or the bartenders when he/she isn't busy. In a world full of bars populated by sleezy men or hunched drunkards, Valley Tavern is a refreshing respite: great drinks accompanied by even greater people.\n\nLet's be honest. You can get a beer or a cocktail anywhere, but you'll rarely get such a jovial atmosphere. Do yourself a favor: come to the Valley Tavern, grab a pint, and relax. You'll thank yourself in the morning.", "author": "Frank Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-23", "description": "Let me preface this with telling you guys that I am, in fact, a bartender. No, I haven't bartended in over 6 months, but if you asked me for a French 75 I could whip one up for you. Granted I'll be scowling and probably spit in it, but that's not the point. The point is that I know how a bartender should act, and you'll find out why I'm so damn pissed. \n\nThe bar is relatively nice--the patio is, as well, but this whole thing about the fucking bartender being Gestapo about checking everyone's ID's. I had left mine at home, but about 90% of the people in there (to include my FATHER) could attest to me being over 21, since I drink with all of them. HELLO! We're there for CUPCAKES, not DRINKING. This is the CUPCAKE CROWD, not the DYL ALCOHOLIC CROWD, hence being a lack of SF Yelpers. There were hardly any damn people in there! You were so damn ubiquitous that you would have been able to catch people buying drinks for anyone who even *could* have been under 21. \n\nThen the leaves started falling all over us in a sudden wind gush, and we screamed a little. It was 3pm and you're yelling at us to keep it down because there are people living nearby? Look asshole, if you're going to live next to a BAR then prepared to stay up until the drunk idiots go home or throw up on your plants. At this point, she berates me for my damn ID again. \n\nMe: It's at home, but I'm 21. \nHer: It doesn't matter, you guys are yelling and if the cops come and they check ID's then I'm going to get in trouble\nMe: What? That's a nice crack pipe you have in your mouth.\n\nOk I didn't compliment her on that, but I'm PRETTY SURE that she was smoking SOMETHING, or PMSing because she was acting like a bitch.\n\nIf I'm going to go somewhere and drink, I'll skip this one, thanks. I'll have my ID the next time, but it'll be for that *other* bar. You know, the one where I feel proud to be a bartender, not ASHAMED.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "The first time I came here was with my girlfriend to grab a couple of drinks and relax.  The bartender was super nice and made my girlfriend a drink based on a general idea of what she wanted for a cocktail. I had an old fashioned that was tasty and well made. \n\nI came another time on my own to grab a couple drinks to wind down from a long day of work. Even by myself the place felt relaxing and lively but I wish I could have played some billiards but a group took over the table the whole night. \n\nI would definitely recommend this place for anyone who finds themselves in Noe Valley and looking for a good meet up spot for some friends or to grab a drink or two and watch whatever sport you want on their TVs.", "author": "sergio a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-22", "description": "I freaking love the VT!\n\nI have loved the VT since I discovered their amazing bloody marys a couple of years ago.  Those bloody marys and the relaxed neighborhood atmosphere and local guests have kept me coming back, no matter how far across town I might have been.\n\nBut then I moved to Noe Valley and I just can't stay away from the VT.  The drinks are great, the bar tenders are friendly and besides the night that the GIANTS WON THE WORLD SERIES they are rarely too crowded at night.  Ok- and except on big game days when the place is swarming with testosterone and beer towers in front of all of the big TVs.\n\nThey don't serve their own food, but have no problem with you bringing in your own.  They even have menus from the local restaurants for you to have delivered right to your table or the bar!\n\nNot that I want you to come and steal the table I was going to take, but there is a huge patio in the back. And a TV.  And free food on Sundays. Word", "author": "Laura P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "This is an AWESOME place to come watch a game. Here for world cup and the service was great.  Love Linda and Decklan. This is the place to be.", "author": "Jojo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Love this place!! Would recommend watching all sports games here - tons of TVs and great service.", "author": "Kathleen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "Sports on the screens, beer and Paxti's pizza. \n\nWhat more could you want in a bar in the middle of Baby Land?", "author": "Jay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-28", "description": "There are several things I've begun to notice since mortality has come knocking around my arrogant younger self and they are as follows:\n\n1.  Large venue parties have given way to smaller dinner parties.\n2.  My straight Asian hair has decided to go native and get wavy at times.\n3.  I am a night owl, but even more so.\n4.  My walks are gaining in time and distance as I wander more frequently.\n\nBut the one thing that keeps me grounded in the firm belief that you are what you think you are, is going to a local pub where the drinks are strong, the beer keeps flowing, bartenders tend to their liquor keeps, and the men are men.\n\nrecent visits here have been dates.  Yes, you heard it right.  He he.\n\nMy experience here last night was everything but, since I was not expecting to stop by a bar before a birthday soiree I had been invited to.  First off, I had nothing to eat since that afternoon.  Second, Crown Royal has got to be smoother than the Tanqueray gin that winked at me from the table.  One sip and it bit and burned my lips.  After a few seconds of discomfort, it slid effortlessly and I began to feel very warm.  The gin/tonic became an afterthought...\n\nThe bar is indicative of typical Irish pubs.  Lots of dark wood, seats are dark, and as my friend pointed out, the walls were of earthen color and the decorations tinged in red, so I had nothing to worry about.  A nice gesture of assuaging the warming factor that usually indicated to me that the flush of alcohol consumption was rising and appearing on my cheeks (basically, I look like a raccoon)  A step up and two pool tables flanked themselves under the bright lights.\n\nThere is also a small enclosure in which many could stand and smoke away to their hearts content.  Reminded me of the clear cubes set off to the side for smokers at the St. Louis terminal on my way to Wisconsin.  Specimens.  For study.\n\nIn all, I felt giddy and extremely talkative, no thanks to the vivid slap of Crown Royal earlier.  But am happy to report, that all conversations were delivered on an even keel and in an eloquent manner.  Mortality can be forgiving ;)", "author": "Miika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "Whoever had the idea to have a cupcake bakeoff at a bar was pretty creative because you have the vices of sugar and alcohol colliding together!\n\nCute bar.  Unfriendly bartenders.  Great secluded space.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "One of my preferred local watering holes of Noe Valley.  I have been here to start the evening and to wrap up an evening. Either way it is a good place with decent deals. While they do not server food they have a bunch of options from local food vendors. So no need to fret if you are hungry.\n\nThey have outside back patio seating but the last time I was up there it needed a bit of a clean up job. Good staff and perfect location (I can walk there) make it a very nice place for me!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Not a bad bar. A lot of cold beers on tap. Kinda divey but good. Awesome beer garden in the back but closes at 8pm", "author": "Rick W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-01", "description": "Lots of games on, decent tap selection, currently they have 7 anchor steam beers which is interesting. Service is so-so, they can't seem to pour a beer without spilling it over the side. They have a grilled ham and cheese sandwich that is actually quite good.", "author": "Will D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "I love this place because it's a proper pub (a rare thing) within walking distance of my place. Nothing flash, just a decent, spacious place with a lovely back outdoor area, pool tables and a jukebox that has Kenickie on it. Ticks nearly all my boxes!\n\nPlus, the staff are always awesome. They even have free BBQ food on occasion. You can tell this place is great because I still love it even after I had the worst cup of tea of my life there :) (microwaved water and ripped tea-bag, because some of their equipment was not working at the time - I don't hold it against them though!)", "author": "Annie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "I came here to watch the Big Game a few weeks ago with some friends and was very surprised by this place. It does not look like much on the outside but it's a great bar with a lot of fun people. Atmosphere was fun and the free food was delicious. I definitely will be coming here a lot next season!", "author": "Tom I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "We stumbled upon this place because we were trying to kill time. We were originally going to have lunch at Hahn's Hibachi but because they aren't clear on what time they are open, we decided to park it here.\n\nPlus, it was Sunday football--I LOVE football. Usually, I watch it at home but it seemed appropriate to watch it here. It was lively and fun! We ordered drinks and ate some free BBQ! Yes! Free BBQ! The staff are very friendly and the drinks are good.\n\nI think I know where I'll find myself on Sundays! :)", "author": "Mel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "My girlfriend and I were in Noe Valley on a cold February afternoon and stopped into Valley Tavern to get out of the cold. We've lived in SF for 5-6 years now, but rarely make it out to Noe Valley, but we're glad we did.\n\nThe ambiance is exactly what we expected; very pub-like atmosphere with TV's and a pool table. It was warm inside, tons of room to sit at the bar or at a table, and pretty quite for a Sunday afternoon.\n\nShe ordered the Bloody Mary and myself a tall Guinness. The bill came to $13, which seems pretty reasonable for SF (I've had $13 bloody mary's in this city to say the least.) Both drinks were delicious and the Bloody Mary was spicy, but not too spicy.\n\nThe best part of Valley Tavern is the outdoor seating. They have a three tier outdoor patio area, complete with TV's and heat-lamps. This was ideal for the cold SF day we were caught in the middle of, and since we wanted to watch the Oscar's, the TV's outside were awesome. \n\nThe bartender was super nice and even double checked that we wanted to Bloddy Mary spicy. \n\nAesthetics 4/5\nDrinks 4/5\nService 5/5\nLocation 5/5", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "A lot of good things going on at the tavern.\n\nShowed up on a Sunday afternoon for the Yelp cupcake bakeoff.  I showed up a half hour-early, so I sat down with my lady friend for a quick beer.  Spacious seating, saloon-themed decor with a big beer garden out back (alcoholic beverages not allowed, though -- must be smoking only?).\n\nThe tavern had a fairly large tap, I grabbed an Anchor Liberty and Lauren a Blue Moon for $9.50.  We watched a soccer game (loads of TVs) for a while and chatted it up with the friendly bartender.\n\nTwo pool tables in back, as well as a pinball machine and some video game cabinet.  Good times to be had at this place; I'd definitely stop by for early evening drinks and pool.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "Great place.  Awesome variety in their beer selection.  Great sampling of local and some obscure craft beers.  One of my go to bars.  It has an attentive wait staff and is always a good time.\n\nAlso a great place to watch a game", "author": "Rich C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-07", "description": "We were out with my friends and one of our friend's mother who was in town. Eight of the nine of us were still awake and chatting while our friend's mother closed her eyes for 2 minutes. \nThe waitress kicked us out when she saw this. What?? We had already bought $60 of drinks, was about ready for the 2nd round, before they kicked us to the curb. \nI won't be coming back. Our group was still awake except for the one older member. Moms want to go to bars, too.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "This review is getting posted later than it should be. We stumbled in here to catch the end of the Giants Phillies game that happened to be the same night as the Double OT Warriors/Spurs game. \nThe place was absolutely packed, yet I was served extremely fast. \nI ordered a Manhattan and Declan (the bartender) made the best Manhattan I'd ever had. Once the placed died down after the games, I chatted him up about it and got his secret. I'd tell you, but then you wouldn't hit Declan up and give him the tip he definitely deserves. \nMy wife ordered an Irish Coffee and it wasn't hot. Somehow while it was still packed, they figured it out, found her and replaced it all on their own. My wife didn't want to complain because of how packed the bar was. But after they fixed it she said it was superb.  After the game I ordered another Manhattan because of how good they were and we were only charged for 2 drinks even though we had three. \nThey had good selection of beer on tap and there was a crap load of TV's for catching the games. There wasn't a bad seat in the house. You know it's a good place when the cops come in to catch the end of the game and they're welcome with open arms. \nCome for the Manhattan's, stay for the next one! I'll be back.", "author": "Don P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-26", "description": "I'm not a big fan of bars or \"taverns\" in Noe Valley. It seems like this place is for locals but everytime I go in it's always dead empty. It's a little pricey, and kinda meh. \n\nHorrible description but whatever. I do what I want.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-02", "description": "My friends and I came here before and after eating dinner over at Bacco the previous weekend. Atmosphere is great - good music playing, but not so loud that you have to yell. Surprisingly enough, it was less crowded after we got out of dinner, around 10 PM, than it was before (around 7:30 PM). They've got a huge selection of beer on tap, and it's easy enough to find a table to stand at or a booth to sit down. It was Sweet Sixteen weekend, so college hoops and NBA were on all screens - a solid choice. The gin and tonic that I was ordered was a bit strong on the gin side, which was my only complaint. Otherwise, a very nice bar to relax at...wish there were more places like this in Manhattan...", "author": "Asuka N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "Living in Noe Valley leaves one with pretty limited options as far as the bar scene goes...  The Mission is just \"down the hill\"  and definitely is full of fun choices (and more interesting crowds), but sometimes the idea of walking back up that hill/catching a cab makes it just too much of a pain when you just want to grab a quick beer or two.\n \nValley Tavern is a decent option for these times.  The beer selection is good and the bartenders are friendly.  There's even a patio in the back for those cherished warm, sunny San Francisco afternoons.  An extra star for the bar letting you order in food from local restaurants (Paxti's, Noe's Bar, etc...)  to enjoy with your brew...", "author": "Anne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-06", "description": "Valley Tavern is my favorite neighborhood bar.  Its a great place to hang out as well as catch a game.  Love coming here for a game and getting their Spicy Bloody Mary-its my favorite.  Beer selection is fantastic and the staff is great at handling the crowd and drink orders.", "author": "Samantha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-27", "description": "Not really my type of scene, but stopped here for drinks last night before dinner in the city. Modest selections of wine, a much larger variety of beers, and a full bar for cocktails. Very generous pour of whiskey in their Irish car bombs (still can't believe I did one, I felt like I was in college again). Very nice bartenders, and not too busy on a Saturday night around 7. ID check at door.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "Free BBQ is awesome any day of the week, but on Sunday, when it finally hits you how much you have spent over the course of the week and on Friday and Saturday night...this offer becomes ridiculously awesome!\n\nPlus they have Hoegaarden on tap with the hexagonal pint glasses.\n\nPlus they have approx 10 HD flat screens. For a small place like Valley Tavern, you can literally be sitting everywhere and see all of them.\n\nThis place is amazing. I wish it was closer to where I lived. Most definitely worth the trip though. Even though I wouldn't consider it a sports bar, it is better than most sports bars in this freaking city. The people here are super friendly too.\n\nI would give this 6 ****** stars if I could!", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "I've gotta hand it to Valley Tavern  - open bar for two hours on New Year's Eve 2011, for free?????   I couldn't believe it either, until we arrived there and sure enough, the bartenders were essentially handing out drinks to everyone.  Unbelievable!!\n\nPerhaps the even more impressive feat was that somehow the bartenders were keeping up with the demand - not easy considering that half the neighborhood probably showed up here.  I applaud the hard working staff that took the whole event in stride and didn't skip a beat the entire time we were there.\n\nWe definitely will return here on a more typical night.  We owe it to Valley Tavern to pay for a drink one of these days!  Great job guys.", "author": "Tim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "#1 go-to bar for NFL football Sundays in Noe Valley/Castro area\n\nI don't hang out at the tavern much.  As everyone knows Noe is not well known for its nightlife.  However, you will find me here almost every Sunday for the following reasons:\n\nCrowd.  Very diverse (Ravens, Pats, Eagles, Colts, Giants, Cowboys, Raiders, 49ers) and very friendly atmosphere.\n\nSetup.  Enough HDTV's to follow all the games.  Free wifi for you to check your fantasy score too ;)\n\nFree food.  Not just free, but they are good!  Most Sunday's they will have bangers, hot dogs, louisiana hot links, cheeseburgers and salad.  On some Sundays they will throw in ribs or catered Chinese food.\n\nBeer selection.  About 15 on tap\n\nStaff.  Very friendly even though from time to time can get overwhelmed (for example when Giants are in the playoffs on a Sunday)", "author": "Andi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "Valley Tavern is a great place to catch a game.  Here are the facts:\n\n1) Great beer selection\n\n2) No food but you can order from Paxti's (pizza) next door and they will deliver right to your table.\n\n3) Pool table.\n\n4) A bit expensive.  Not for Noe, but certainly compared to the average sports bar in the city.\n\n5) Multilevel outdoor patio and deck area, complete with TV\"s and picnic tables.\n\nThis is a solid, cozy neighborhood sports bar.  \n\nMy is only complaint is that the outdoor area area can attract those cigarette smoking, tequila (love tequila, just not a noon on a Sunday with a marb red) drinking chads that have nothing better do than hate the world around them while slowly killing themselves.  I almost made it the entire year without fantasizing about smashing a bottle on someone's face.  Maybe next year.", "author": "Johny X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Big place, good for sports and lots of beer on tap.", "author": "Veronica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-11", "description": "It's the only place I've been to in Noe Valley. I'm excited to explore the rest of the neighborhood. \nThey have friendly bar tenders. There are pool tables, for a buck-twenty-five, WHAAA!?!?!. There is a smoking patio. There are tables to sit at. Some people were watching a game. \n\nI think it is a cool spot to meet up with friends.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "The Tavern is a great neighborhood bar with friendly staff and people with plenty of sports for those that want it. The smoking patio is great if you want it (they've even recently fixed the heat lamp). \n\nThere is also a patio out back that has the beer garden vibe down so take advantage when it's open!", "author": "Ennis O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "Awesome complimentary Sunday night football snacks.", "author": "Nikki B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "Good bar with a nice selection on tap, though they are a little light on dark beers.  I love that they let you bring food in.  I don't love that the smoking section is kinda connected and occasionally you will get a bunch of smoke blowing into the bar.  This isn't a problem towards the back of the bar.  Probably a good bar if you are a smoker though.", "author": "Paul T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "Love this place. Amazing selection of brews, great place to watch a game. Staff is the best ever. Also the soccer team, Totti I think, is super sexy and hot. Especially the guys :) they are there every Thursday", "author": "Chad J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-29", "description": "Again, a solid bar. I came here during the 1st game of the World Series and it was Packed and Rockin'.\n\nIt's a great atmosphere and this is my go-to bar in Noe Valley", "author": "Eric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-18", "description": "This is my friend's favorite bar.  He lives in Noe Valley and know some of the usuals names by heart.  That makes me wonder if he's a usual too?  We went here for some drinks to waste time while waiting for some people.  The place is a decent size.  I agree, more space in the seating area would be nice, but hey this is SF.  We have to be grateful for what we get.  I need to check out the patio another time.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "DIVERSE crowd before heading to At@t a lot of Giant apparel. NOT a sniff of Green & Gold.Good Pisco Sour Very inviting wish I lived closer for a place to hang.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-07", "description": "What Happened Here?\nseriously - WTF?\nThis used to be a good place for a beer and to hang out for awhile.\nNOT ANYMORE - this place is horrible, \nCRAPPY MUSIC that's too loud to talk over, flat stale beer, when i took it back (yeah, it was pretty bad) the bartender tried to charge me more for a fresh beer, i actually left with half a beer unfinished. \nWill not go back. \nUgh.", "author": "Hans H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-14", "description": "Tons of beers on tap. Its a chill area, and a nice atmosphere. Great for a relaxed Saturday night, while still being out.", "author": "Leslie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "By far the best Bloody Mary's in SF, I get mine extra spicy! The service is also top notch.", "author": "Nicholas R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "This place was a lot of fun. Great bartenders, good selection of beer, and great atmosphere. Highly recommended.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "Easily the best bar in Noe Valley. Great tap selection and friendly bartenders make this place a regular stomping ground for my friends and I.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-16", "description": "Nice pub to go to for happy hour.  They have a really nice patio out back but closes around 7:30pm because it's around houses.  If they kept the patio open later I would bump up my rating. \n\nThey also have 2 pool tables inside which are extremely cramped.  I could not hustle people because I didn't have enough room to properly shoot. (JK)", "author": "Danny P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "Are you headed out for a night on the town with a large group of people, or maybe it's just you and your best friend, oh heck, maybe it's just you!  The Valley Tavern is an amazing place to go after a long workday, or even a long work week.  They have SO many beers and ciders on tap that it makes those of us with decision making problems go absolutely bonkers, in a good way, of course!\n\nIn addition to the plethora of beer and ciders available, the bar also features 3-4 flat screen televisions so you can catch a glimpse of your favorite athletes battling it out, a jukebox for your music needs, and a few pool tables in the back for when you and your friends want to get a little competition going.  \n\nAny time I've visited this place I've had  no problem saddling up to the bar and ordering, but there are also tables for small parties and social gatherings if that's more your style.  The bar staff are friendly, when comparing them to other bartenders around the city, and most will sit and have a chat with you if the evening isn't too demanding.\n\nJust so you know!  The Valley Tavern does not have a kitchen so, unfortunately, ordering food from them is not an option.  They do have a carry out option where food from another restaurant can be delivered to you but I'd just eat at one of the adorable locales in Noe Valley and venture on over to the Tavern afterward.\n\nI absolutely cannot emphasize how much I love this place and hopefully I'll have an opportunity to run into some of you there!!", "author": "Kat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "Great place to watch games, good service and a large selection of beers on tap. There is also multiple HD screens so you won't miss a thing. Great crowds, especially during big SF games. The best part, FREE food during NFL Sundays!\n\nThis is the go to Sports bar!", "author": "Nate V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Nice local bar. Fun crowd, mostly local. Great staff. Cool backyard most people are unaware of. Karaoke on Thur.s. Free BBQ on football Sundays.\nCons:  Overpriced pool tables ($2 a game). Overpriced jukebox.\nPros: Awesome staff, strong drinks, nice locals.", "author": "Jojo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-06", "description": "Is this your average tavern? I think not. \n\nWe walked past the bar since my friends told me that back up past the pool tables, there was a large wooden patio (though it closes at sunset). As we walked to the back, we came across \"Free Food\" and \"Free Hamburgers, Sausages & Steak\" signs. Turns out the Valley Tavern was having their anniversary, though we did find out that on some Sunday Afternoons they serve free food, anyway.\n\nCheap beer, large establishment.", "author": "Anna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-27", "description": "awesome cocktails (giggity)... great place to chill very friendly even when they are busy. Quality booze attention to detail in making cocktails and solid knowledge of recipes. FRIENDLIEST staff Ive ever met at a bar.", "author": "Neil V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "The tavern is my favorite neighborhood dive. It's always a great place to grab a beer and catch up with the homies, its never too crowded or filled with weird creepers. They have a bunch of beers on tap, I think 15-20 different beers, and they also have great cocktails, some which include house infused vodka. I especially recommend the  bloody mary's which I like to get with a blend of horseradish and chipotle house infused vodkas. One of the great things about the tavern is the back patio which is a great place to get together on a sunny day!!! All the bartenders are super friendly! I also especially appreciate being able to order food from Noe's and they'll come bring it over to you at the valley tavern!", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-29", "description": "Oh, Valley Tavern... my love affair with you started on a cold Pink Saturday night in the summer of 2010 when my group made a hasty exit from the Castro in a hail of gunfire. Even though I live on the other side of the hill from Noe in Cole Valley, the Tav (as my friends and I affectionately call it) would eventually become one of my favorite places to hang out in San Francisco. A good night usually begins with a visit to the Tav to check in with Declan, Kelly Jo, Marie, Olivia and the rest of the awesome staff that have become so much more than that--we're even friends on Facebook, y'all. We've come to call this place \"the living room,\" because that's really what it is. Just so happens my living room has a huge selection of beers on draught, awesome bartenders, and was the place where I watched my Giants in every game of the 2010 World Series.", "author": "Rich U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "I love this place soooo much!! The amount of beers they have on tap is crazy!!:) went in to watch the game when it was slammed and I got served so quickly by the nicest bartenders!! And they have servers up and down the floor all the time checking on you. This is one of the best bars Iv been too. Il be back for sure. :)", "author": "Linda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-12", "description": "Can I give this place 6 stars?\n\nOur waitress, Liz/Kat/Melissa/Fergie/etc., was the coolest person EVER.  She was super attentive, really fun and even bought us a round of drinks.  I love her.  Come to Valley Tavern!", "author": "Evan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-16", "description": "As far as Noe Valley bars go, this one's the best. They have a solid selection of beer, and I particularly like that they have two pool tables. The tables are a little tight on the wall side, but the fact that we can generally find one free on a Saturday night makes me happy. \n\nSo, you'll find me here when I'm too lazy the roll down the hill to one of the Mission bars.", "author": "Kristen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "A group of us came here after prepartying at a friends place near Dolores Park following the Naked Earth wine event at Atlas Cafe.\n\nAfter enjoying a couple bottles of Hennessey and some Mothership Wit brewskis, we decided to hit up Valley Tavern. My co worker used to live in Noe and said it was the best bar on 24th St.  Immediately upon exiting the bldg to walk down there, the J came, saving us an eight block walk. Nice!\n\nI liked this place. It's a good spot to go with a group of friends. The bartenders, all cute girls, were fun and friendly. Some rounds of drinks were stiffer then others, but cheap! Cheap, as in 2 ketel ones and a stella for 17.50. \n\nThe elevated area with pool tables is an added bonus. They even have a smoking room.. I don't think I've seen that in SF before! Besides Harlot.. I'll definitely go back if I happen to be in the Noe/Mission-Dolores area again.", "author": "Joel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "Fabulous place. Super clean and lots of TVs. Wonderful staff and customers. Enjoyed Irish coffees made the way they're supposed to be made.", "author": "Curt E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-29", "description": "NUMBER 400, Bitches!!! \n\nValley Tavern is, as of this past Saturday, October 27, 2007, on my list of favorite places. Not only did they graciously allow us to take over their bar and patio for an SF Food Bank Fund Raiser and Live Date Auction, but it is also the establishment where Matthew Capital R officially bought the cow (me, mooooo) when he already gets the milk for free. That's right. Matthew outbid everyone for a date with moi, who he already gets to do a lot more than date with. Aaah, My Hero!\n\nI used to avoid Valley Tavern. Mostly because I'd spent more than a few nights there, being hit on by men old enough to be my dad. But Valley Tavern appears to have changed a lot in the past 4 years. The crowd is younger, the bar staff is quick and generous, and the owners are clearly saints of the highest caliber. (In addition to allowing a full Yelp takeover for fund raiser purposes, they also gave us beer specials and donated a percentage of sales for Saturday night). \n\nThere were hot boys aplenty, drink orders were filled quickly, and  the place is huge as far as neighborhood bars go. There are pool tables and lots of tvs to watch sports on, too.  On principle alone, I'll be back and I'll recommend Valley Tavern for parties, get-togethers, and afternoon drinking on the patio. \n\nThank you Valley Tavern for a memorable night. I look forward to more.  Thank you, Euge and JR, for bringing everyone together for such a great cause. And thank you, boyfriend, for making me the happiest girl in the whole universe :)", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "My dear friend Rachel and I stopped in here last night for a couple of beers before her date at the Mayan restaurant down the block.  She had Pilsner Urquell, I had Czechvar (I know, I know - not really in keeping with my \"think globally, drink locally\" credo; I made up for it be drinking extra Trumers later on in the evening).  We had just discussed exactly how late she should be (7 minutes, that was my opinion) when whom did she spot ordering a martini at the bar, but her date!  Literally one minute before their scheduled meeting time.  Oh, snap!\n\nAnyhow - hilarity ensued.  I entertained them with my Mitch Hedberg impressions, endeavored to make him feel comfortable that I wasn't stealing his date, while at the same time not so comfortable that he wouldn't feel like he needed to work for it.  He bought me another beer, we all had some laughs, and the two love birds flew off to dinner.  All's well that ends well.\n\nOh yeah - nice bar.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-28", "description": "I had a friend that used to live down the street from Valley Tavern above the Supercuts. During midweek when she felt like it, she'd just leave the house in her pajamas and roll into one of the nearby bars. That was years and years ago and I'd not been to this part of town since, so when I drove here today, the deja vu started kicking in. \n\nUpon entry you notice that the place is sectioned into many little pockets of hangouts, all with ample access to one of many tv's to view sports. There's a small cove on the right side of the doorway, the main room with the long bar to the left and booths to the right, a step up the pool tables and then outside where there are three more levels of outside patio. Today, Yelpers basically took over the outside area where Yelper Euge L. hosted an SF Foodbank Fundraiser. I had promised to man the BBQ station so I went to the very top of the patio to find a Weber coal kettle and another large gas grill waiting for me. As I started firing the two up people start drifting in and even the manager comes out to greet us. I assure her that I will try not to set the back of her bar on fire and that we'll behave for the sake of the residential neighbors behind the bar. Pretty soon  ribs, leg of lamb, trip tip, whole bbq chicken and booze is flowing and every one is having a good time. Other treats where homemade salsa/guac, pasta salad, rice crispy treats, Pastry Chef Yelper Laine L's amazing cupcakes and tons of other goodies. To top it off there's a fried chicken cookoff going down with Yelper JR H. from Selecta Auto next door allowing the participants to fry up in his shop and that food makes its way over to the Tavern too. It was funny to be running back and forth between the two place carrying tongs, knives and trays with people in the streets giving me funny/dirty looks. As the night progressed we gathered everyone inside to the pool area and various Yelpers were auctioned for the fundraiser. Amongst the World Series, Cal-ASU sports watchers, and costumed Halloween celebrators, we became one large rowdy crowd. \n\nI have to give kudos to the staff at Valley Tavern because, not only were they super cool about letting go us rampant on the place, they were some of the friendliest servers ever, and more than willing to help promote the fundraiser. Hell they even let me cook with large amounts of fire and explosive propane :)\n\nGuinness on tap (a personal favorite) as well as many other cheap tasty drinks, great staff, pretty cool patrons and laid back vibe. What more could you ask of a neighborhood bar?", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-10", "description": "Great service!\nFriendly staff!\nFat Tire on tap!\nOutside patio area!\nSelecta Auto Body next door! \nRock star parking!\n\nWhat else would you need in a bar?", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-23", "description": "I'll always have great memories of the Valley Tavern. Though I'll admit, this was my first legal bar & beer way back when..so I may be a bit biased. However, it has a certain comfy Noe Valley vibe to it that most friends tend to appreciate. After a long night of hopping through the Mission or Castro, I definitely sigh with relief once I've almost made it home and can enjoy the last call somewhere the crowd isn't pretentious and the bartenders are sweet & welcoming.\n\nOk, so the pool tables are a little cramped, but overall the layout of the place is great for a small neighborhood pub. The ladies bathroom is clean and rarely full of wasted girls doing who knows what. The crowd varies depending on the night, but generally Noe Valley locals tend to take the majority. *Just an FYI to those who think Noe Valley is made up entirely of \"yuppy\" moms, dads and their golden retrievers; try to look past the borders of 24th street on a weekend afternoon and you might see another picture. \n\nValley Tavern: Awesome selection of beers on tap and consistently tasty cocktails for the price. Love the jukebox! Great place for good company and always a fun night in the neighborhood.", "author": "Coco P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-17", "description": "The Valley Tavern is my chosen temple at which I worship all that is holy in Texas football on Sundays - the Dallas Cowboys.\n\n(but don't fear... it's not a Cowboys bar, it's usually just me and one other fan ;-) it's a pretty balanced crowd.)\n\nThe Bay Area is a television nightmare for football fans, because we are treated each and every week to two local broadcasts of the NFL's bottom feeders.   If I lived in LA or Portland for instance, I'd get the best feature games on TV every week, but not here.  Despite this, i'd rather live here so don't hate.  I'm too cheap and do not want 200+ channels of TV to get \"The Dish.\"  So, I've come to accept watching games at the bar, and hey - it feels kinda \"European\" watching games with groups of strangers.\n\nI've visited many many bars over the last 10 years to watch football, and this is my fave.  You don't feel too crowded, there's natural light, (sunlight, not the beer) high ceilings, there are patios in the front AND back!  then you've got the other good stuff... pool table, pinball, jukebox, etc.\n\nbut wait it's gets better!\n\nKAT:\nBEST\nBARTENDER\nEVAH!!!\n\nWhen you become a regular, Kat remembers what you drink.  I don't even need to say anything, she can read me when I walk in like Dan Haren taking signs - fastball (Stoli bloody mary), splitter (Guinness), or curveball (Mexican coffee.)  She makes the most amazing bloody mary mix by hand too which makes it a great hangover cure. \n\nThis year, they've also added a buffet of food every Sunday that you can pay whatever you want for a plate of food!  What a bar!", "author": "christoph s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "I think this has officially become my favorite neighborhood bar. Great beer selection and lots of drink specials, friendly bartenders, lots of TVs if you're in a sports viewing mood (but placed in such a way as to be non-obnoxious if you're not), pretty good drink specials, lively but not overly crowded. Basically everything I need in a drinking establishment.", "author": "Pat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "Noe Valley is a daytime neighborhood for me, so I am not in the bars there all that often.  I had been to the Valley Tavern a while ago, and thought it was a pretty decent place.\n\nToday, at the Cupcake Bake-Off, I discovered the back patio.  There are 3 levels of chill space, hidden like a secret just behind the pool table area.  Sweet!  Outdoor drinking spaces are the BEST, and uncrowded ones are rare.  And because it is smack dab in the middle of a residential neighborhood, patrons are asked to keep their noise level to a minimum, which is cool with me.  I just want to bask in the sun and enjoy my drink.\n\nWe had a great event today, and it was nice of the Valley Tavern to accommodate our large group.  Hidden gems like this are what make our neighborhoods great.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "Ah, date #2. Always interesting, never know where it's going to lead. Date #1 was surprisingly good, very spontaneous, full of laughs, so I had high expectations for Date #2. \n\nWe planned to meet at Mi Lindo Yucatan at 7:00 for some Mayan food and sangria. Since it's right next door to the Valley Tavern, and I kind of miss Noe Valley at times, Joe C. and I (not my date, mind you) decided to have some pre-date drinks at VT. \n\nThe beers went down well, there was ample sports and such to watch on the myriad of TV's there, and the crowd was rather jovial for 6:00 on a Monday. So jovial it seems that someone had to be poured into a cab before 7:00. How does that happen so early on a Monday? \n\nAnyway, apparently Date #2 and I had the same idea, because he rolled into the VT a few minutes before 7:00 to have a pre-date cocktail. I'm sitting there in my date get-up, chatting it up with Joe at the bar...well, this isn't awkward at all! \n\nDate #2 looked a bit surprised to find me there, but I was quick to put him at ease, letting him know that Joe was my buddy and that he was going to skedaddle as soon as it was dinner time. Well, no problem, Date #2 bellied up to our conversation and made himself right at home. \n\nThe Valley Tavern has a nice patio, a smoking room right on the street, and plenty of room. And the bathrooms are non-offensive. \n\nAll in all, a great place for somewhat awkward pre-date drinks with a friend and your date.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "I've been to the Valley Tavern twice.\n\nOnce to sit and drink beer and plan an event and once to attend the event.\n\nThey have Boddington's on tap. That's right, you too can drink a properly poured cream of Manchester at the Valley Tavern.\n\nThere is food sold from next door (a magical place) which is very good. I had a bacon cheeseburger with fries both times I was there and it was excellent both times.\n\nThe owner is nice enough to offer his bar on a weekend day to us for a fundraiser at no charge.\n\nThe outside patio is wonderful. Constructed with three tiers the first two are protected from the elements and the third one is open to the sun and wind and rain.\n\nFor those smokers around there are two options. The outside patio which is very nice that you can smoke AND drink and not have to chose. But there is a second option -- in the front of the bar they have an inside glass smoking room with windows opened to the outside.", "author": "Shelly V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-18", "description": "I like this place because they didn't judge me when I got sloshed here at 11am.  Now that's professionalism.\nAlso, they have cheap pool and cheap pinball.  And generally a good layout.\nBartender got me to try a Wyders and Guinness mix.  Surprisingly good, considering I openly call people \"pansies\" if they order a plain Wyders.  \nI'm definitely going back.  Maybe this time at night?\n\nUPDATE: I went back (in the cloak of darkness, i.e. at night) and was pleasantly surprised to discover that Monday night is Trivia night!  Good trivia, and I can confidently say that I would have won by a landslide if I had not gotten sloshed and forgotten to turn in my last entry card.\n\nUPDATE #2:  I went back again, vaguely recalling that I had enjoyed my truncated experience at Trivia Night.  However, as this time I was plagued by a raunchy sinus infection, I kept beverage consumption to a minimum.  Turns out Trivia Night is meant for a much, MUCH older crowd.  I do not have any idea who Bea Arthur's first husband is.  \nOh, the rare clarity of sobriety.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "Waiting for my piss-drunk boyfriend and friends to meet stone-cold-sober me after they get out of a party in bayshore, I wandered down 24th to find a drink somewhere and try to play a quick game of catch-up.\n\nPassed Bliss Bar, and the 16 or so unattractive, douchbaggy guys outside tried to get in my way so I couldn't pass: really guys?  Really?  In what world does that ever get you the girl?\n\nAt any rate, clearly I'm not going in there.\n\nValley Tavern was a breath of fresh air after inhaling all the cheap cologne and hair gel fumes.  Normal, fun people, good beer, flat screens filling me in on my Sox, and a juke box where two wasted girls are trying to figure out who sang 'Take On Me'.  Clean, spacious bathrooms are also always a plus.\n\nI was particularly entertained when the bartender went to card my friend, who said, \"Do you really think I'd wear pigtails to a bar if I were under 21?\"  She got her beer.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "i came here a lot to watch sport events with my friends, one of those neighborhood bars where u see the usual, old faces\nthey have 2 pool tables in the back and some videogames as well\nthe bartenders are super friendly and ppl are nice here\nand there is a little area near the entrance where u can smoke but its still connected to the bar itself\n\nand i love their karaoke fridays here, one time i walked in with my friends and i decided to sing California Love - Tupac feat. Dr. Dre\n\nall these ppl are like looking at me \"whats this nerdy asian doing here?\"\nthen i sang the shit HARD, ppl started cheering for me and i got the ppl singing California Love with me, and ppl gave me daps and hugs at the end\nits an awesome bar, you should def. check it out\n\n4 tars", "author": "Michael K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-22", "description": "So we had a cupcake bake off contest here at Valley Tavern...Wait, did I just say what I think I just said? Why yes, I did! We had an awesome cupcake contest at a freaking BAR!!! In most parts, it sorta worked...Up until the bitchy bartender started carding everyone. Really? Do we look like we're under 21? Some of us have beards and wrinkles that would make Joan Rivers flinch! Don't be taking it out on us just because you have a problem with working without any help on a day that soocer was being televised on the tube. Seriously, attitude adjustment, please.\n\nNow, this is just a review for the bar, not the event that we Yelpers had at the bar. Hence the low score. Remember, score the joint, not the event! Unless the event royaly blew but that was not the case this time. Yay CUPCAKES!!!", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-18", "description": "While this joint is a little far from my neck of the woods, it's definitely a winner.\n\nIt's this sort of divey sports bar, with Noe Valley's locals. Lots of nice people, a hot bartender (who gives free shots for no apparent reason), and smoking hot box if that's your thing.\n\nOnly drawback was the lighting. I'm a fan of the dimly lit places, and this wasn't one of them.\n\nNot my first pick for a bar, but definitely a cool place to chill with friends & sip some drinks.", "author": "matt m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-13", "description": "not too much to say about this place - good list of beers, no food, serivce Meh.", "author": "Belinda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "This is my first review on yelp and glad I'm giving it to the valley tavern. The service here is top notch and I can't get over how efficient and friendly the staff at this place is. They can make any drink you can think of and they are happy to serve it with a smile! Thank you valley tavern for making my day.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-30", "description": "Full service bar with wooden booths against the walls to eat and drink. Front section to drink and smoke (i don't but will do cigars). There's a back a patio (this is where the date part comes in) to hang out. No its not a backyard with chairs there's tables and foliage around. \n\nThere's a pool table to practice your hustling skills. And of course there's tv's to watch sex and the city (yea right) a game is always on. Prices are reasonable and the bartenders are friendly.", "author": "Lola L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "Love love love it here!! Everyone that works here is awesome! The vibe is mellow, the beers on tap are plentiful and there's never a dull moment in the smoking room;0) My home away from home for sure!", "author": "Veronika O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "I love this place..and maybe I am a bit partial because i work next door, but I love the feel in the bar. I am not a Bliss Bar guy, no offense to the Bliss Bar at all, but that's not me. The Valley Tavern is great for sports, hanging out and drinking related holidays and more. The bartenders are friendly and the people that are in there are cool.\nIf in Noe Valley, stop in and have a beer!!", "author": "JR H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "Went with a couple of buddies last night for pub quiz and had an awesome time!  The entire wall behind the bar is covered in tv's, just in case you needed something to entertain you besides the current beverage at hand.  \n\nThe Mexican place next door supplies the pub's eats, and even though they MESSED UP THE ORDER, I'm not gonna focus on that.  My chicken quesadilla was decent, and I must say that it's amusing to see cheeseburgers offered at a Mexican place as well.  :)\n\nPub quiz never starts on time.  Sorry, not getting drunk beforehand.  I need to be fully capable of answering the awesome pub quiz questions.  :)  Anyway, we got 3rd place and got a few free pints.  I've never won anything in pub quiz EVER.  So I now have a soft spot on my impressionable heart for Valley Tavern.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "I think I'm slowly becoming a fan of drinking in Noe Valley. A nice watering hole up from Bliss Bar, with fantastic bartenders to boot. These girls knew their stuff and tossed out great jokes, all while remaining sober. Dive bar/pub like setting, plus the well priced booze, minus the gross bathrooms and spotchy service.", "author": "Alita M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "Good place to grab a pint and watch a rugby game.  That's right, I said rugby.  \n\nLots of stools to saddle up at the bar, tables for groups, and a large (multilevel) beer garden in the back.  Lone window seat is a coveted spot.  \n\nWouldn't make it an all-nighter, but it's a solid starting point.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-28", "description": "Your neighborhood tavern and mine!\nWhy? because they had a chicken fried fest food a thon!", "author": "J A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "This is a great neighborhood bar, with cheerful staff able to manage large crowds and make you feel like you are the #1 customer.  Multiple screens and football games with BBQ that is quite tasty.  Green salad along with standard BBQ fare.\nMany cheers for the home team.  \nDefinitely a fun place to watch sports on an afternoon.  I am a fan.", "author": "D'oh S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-30", "description": "I'm so pleased Yelp included the Valley Tavern on its latest email newsletter because it reminded that I have yet to review it and give it the smallest score possible.\n\nAfter being pretty frequent visitors for a number of years, back to when it was the Rat and Raven, we decided that it would be the best place to watch the World Cup Final in July 2006. We showed up early, at 9am, giving us a good while before the game started, and we made sure to start with the drinking there and then. More of our friends arrived and before long there were about 10 of us, all drinking beers except for one designated driver who was drinking coffee.\n\nMidway through the game I went up to the bar to order more drinks and some water for the DD. They proceeded to charge $3 for a glass of tap water. When I questioned it, the owner came over, Mr. Grumpy Money-Grabbing Irishman guy (his real name is Vincent M. Hogan according to the CA ABC website) and got all up my face. He said they couldn't have people in there on the busiest day of their year drinking for free. I explained that she was the DD, that the rest of us were drinking (and had been for a while) and that she wasn't looking for bottled water, just from the tap. I suggested that they should be encouraging DDs like many other bars, especially when they're making damn good money off all the people she's transporting to and from the bar.\n\nNow it got really unpleasant.\n\nAnyone who knows me knows I'm not the aggressive fighting type so it was pretty damn surprising to be physically threatened by this obnoxious little fuckwit. Not wanting to ruin the game for my friends I backed down and told Mr. Asshat he wouldn't see me or my friends in any of the bars he and his wife own again.\n\nFYI, that includes the Dubliners on 24th St and West Portal.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "great place to go after work and have a few beers.....friendly people, nice staff and very comfortable. Great place to hang out with some friends to talk crap and catch up.  \nThe tv's are great for sports too.  Bathrooms are a bit smelly but I guess most pub bars are like that?????", "author": "luke b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-19", "description": "Noe Valley conjures up visions of everything suburban. We all know the stereotypes: babies, dogs, strollers, land rovers. \n\nValley Tavern is like a little piece of urban heaven amidst the otherwise quietness of 24th St. The music is always upbeat (although somewhat random due to the jukebox; Genie in a Bottle followed by Don't Stop Believin'?), there's a great mix of people, pool tables, great selection of beers on tap (I counted at least 16), and Liz is the coolest cool chick/bartender/server in the Valley. Not the best date place, but a great place to sip and chat with friends. Also, they're a little snarky about verifying your ability to pay before you start a tab, but whatevs.\n\nBONUS: You can order food from the next-door Mi Lindo Yucatan. Tasty apps and entrees delivered right to your seat at the bar!", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-11", "description": "I must say that despite the generic feel to this bar and how crazy packed it can get on the weekends, I still think this is my favorite local watering holes (Dubliner loses points for being more than 2 blocks away.  Can we say, \"Chris is a lazy bastard?  Ah knew ya could.\").  \n\nThe bartenders are nice.  The beer selection is pretty good.  The music is (usually) good and customizable through the use of those nifty Internet jukeboxes.  The clientele is good.  Just all around good stuff.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Solid bar to jump in and grab a drink. Came here with friends and there is ample room to walk around or sit by the bar. There is a solid selection of beers to choose from as well. I wouldn't go out of my way to come here, but if a friend told me to meet them at Valley Tavern I would definitely not complain and go meet them for a beer.", "author": "Sebastien D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-10", "description": "Another stop on the Pub Quiz circuit.  Random J and I went here last night as a 2-man team and got clobbered.  Damn music round...I swear these new artists all sound the same.  At least I got \"She's Not There\" by the Zombies.  Also, it's got the same British guy emcee from Martin Mack's, and he's definitely the best of the quizmasters.\n\nAs for the bar itself, it's equal parts pub, sports bar, and dive, with a surprisingly non-Noe Valley clientele (one pub quiz team called themselves \"The Laptop and Blackberry Crowd\" and was roundly booed).  Despite having 18 beers on tap, the selection was pretty \"been there, drank that...hey what's that red one?  Oh, just Amstel Light.  Damn.\"\n\nBetween this place and Bliss Bar, you've got your basic bar needs covered in Noe Valley.  Or, if you're really preppy, you can get your sports & pints thing on at the Dubliner instead, but I like Valley Tavern better as it's not quite so sterilized.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-08", "description": "We were having dinner next door with a friend visiting from New York and decided that it was to early to call it a night just yet.  Having walked past the Valley Tavern on our way in we decided to stop in for a quick drink. \n\nMuch to my surprise, and inevitable glee, we stumbled into the middle of a pub quiz!  For the next hour, we were able to astonish and amaze our out-of-town friend.  She apparently had no idea that I was a veritable fountain of information about old TV sitcoms, or that my boyfriend's arcane political acumen could come in so handy, or that our other friend was absolutely indispensable when it comes to identifying songs based on two seconds heard in a noisy bar.  Apparently, they don't have quizzes in New York. Or, at least she had never heard of one.  Poor people!\n\nValley seems like a good place to go for quiz, especially if you are new to the idea.  You could actually hear the quizmaster (and he sounded sober, which is rarer than you may think.)  The questions were a nice blend of difficult with some gimmes thrown in to keep your confidence up.  \n\nI'm hesitant to give the quiz a real score though, since we were only there for the last part.  But, we'll be back to try out the quiz in it's entirety and I'll do my best to update the review then...", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-12", "description": "The Valley Tavern is just how I like my bars:\n\nAffordable drinks\nGood music (80's music!)\nRelaxed atmosphere\nClean bathroom\nand I can hear what my friends are saying (aka we aren't shouting)\n\nI'm definitely going back.", "author": "M O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-27", "description": "On the plus side, if you are a smoke there's a little glassed-in nook for you that opens onto the street.\n\nMy only beef with the place is that it feels a little too big for what it is: a decent neighborhood bar. If it were on Valencia or Mission St. it would work better. It's a bit lost in mommy/daddy - mommy/mommy land.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-19", "description": "I went to happy hour here last night and really had a great time. This place has a great feel to it. I like how my husband put it: \"this is how bars should be.\" It was warm and welcoming, and had a great layout. Lots of seats at the bar, as well as tables and booths along the other wall. The pool tables are a great aspect, but I was disappointed that the patio closed at 730pm as I wanted to sit out on the great deck. (I suspect it closes so early b/c the bar backs up to a residential area.) \n\nGreat beer selection on tap, and a full bar to boot. The service was good as well - early in the evening (\"Breakfast,\" according to my bill) we had to order at the bar, but as the night wore on we had table service. We also ordered some food, which is delivered to you from the place down the street (we never did figure out exactly where it was coming from). It was typical bar food, but did the trick. \n\nThis is the type of place I'd go to regularly if I lived in the area. Hopefully I'll have some excuse to go back in the future.", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "One of my neighborhood bars. We have a few here in Noe. I like this place. And they have pool tables... Oh if only my girlfriends from San Diego were here. We would rock those tables and a few beerz. I like the selection of good beer on tap. Chimay and Guinness are my faves. But then I am Scottish. Part of me is anyway. We are not sure which part. But it loves beer and real Whiskey.  The drinks are descent too. And the redhead.... whoa. Yeah I am a dirt old broad. I'll stop while I am ahead. ;-)", "author": "Nichole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-26", "description": "I think that the problem with this bar is the location. It's got pool tables (but there isn't enough space for them-- be prepared to use the special 18'' cue stick they've kindly provided for when the cue ball is anywhere near the wall), a pinball machine, a juke box, some very friendly bartenders (tip Sarah and tip her well) and yet... it's kinda dull.\n\n I imagine that this place is quite nice on a warm evening, what with the beer-garden out back, and it's great for an afternoon brew, but nearly every time I go there I find myself on the phone with friends making plans to move elsewhere. Perhaps it's the crowd, which consists largely of older men. Or maybe i've just been going at the wrong times.", "author": "Jonathan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-14", "description": "As discussed in previous reviews, I am not one for the traditional bar or pub.  My normal style when going out for drinks is more of a laid back lounge scene.  Somewhere that has a cocktail menu along with the traditional extensive selection of beers.  It's just more my style.  Usually I hate frequenting bars or pubs where there are loads of loud sports fanatics cheering during the latest playoff, but The Valley Tavern seems to be the exception to my own rule.\n\nThe tavern looks completely divvy on the outside in my opinion, therefore making me believe that the inside would reflect their grungy outward appearance. Not true.  I was shockingly pleased with how clean and nice the inside actually was.  And there was plenty of seating besides at a bar stool!  Although decorated like your average sports bar & pub, it is done nicely which earns it points in my book.  \n\nThe drinks are generally cheap and decent, and they have a couple of pool tables and pinball machines, which add a nice addition to the place.  I do on occasion enjoy a good game of pool (even though I suck), so the pool tables definitely helped in my overall first impression.  My good friend and I got our butts kicked a few weeks back...but it was all in good fun (it was HER fault we lost).\n\nSo if you're like me, and weary (or sometimes even scared) of entering those sketchy run down hole in the wall bars, give The Valley Tavern a chance.  You might be pleasantly surprised.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-09", "description": "Solid, not-too-loud bar for locals with a cool outdoor smoking area - even though I am not a smoker. Funny place where an older man in his late 60's or early 70's walked up to my table, completely loaded, and said \"excuse me, I am drunk. what should i do?\" Also cool was the option of Anchor Bok at reasonable prices. Not too loud, comfy, and just chill. Noe is the cutest.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-01", "description": "This is a review for the day of the 2nd Annual Yelp Cupcake Bakeoff.\n\nThe chick bartender was nice enough but seemed confused when I ordered a Midori Sour and asked her to go easy on the alcohol. I just didn't want a strong drink on an empty stomach prior to gorging myself on cupcakes.\n\nReally nice patio area that would be lovely on a less crowded occasion.\n\nSeveral times the bartender had to come out and shush us. I guess we have to be quiet on the patio as to not bother the neighbors. Isn't that kind of weird though? I mean, if you live next to a bar, don't you go in with the understanding that bars get noisy?", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-18", "description": "Came here to continue celebrating best friends bday, it was a blast! Bartenders were awesome and joined in on the fun! thank you valley tavern!", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "Visited Valley Tavern on a Wednesday night from about 730p-1130p. The bartenders working were nice and the waitress was definitely attentive. I was a little bummed that although there is a hanging sign outside the door that says beer garden they were out of 3 different beers we wanted. Other than that the place is great. There is a patio out back that I would like to come back and visit some sunny afternoon and a separate smoking room that is visible but not \"smellable\" from inside the main bar room. The place has some pools tables and a few games in the corner as well as a high tech juke box. You can bring in your own food or order delivery since they do not serve food which I thought was pretty awesome. If you order from Bossa, the waitress will call for you.$5 dollar beers + nice atmosphere + friendly peeps = not a bad place to grab a few beers.", "author": "Tuesday C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-02", "description": "Update 3-07-07:  On the good side, this place has gained a bit of character by displaying local artwork.  On the downside?  It's gotten extremely young, and worse yet.....very boy-heavy.  I'm just too old for this place.   The place is infested with teeny boppers and faux surfers, and all of the older folks seem to have vanished.   It's still a decent hangout during the day...but the last five times I've been in here, I've wound up looking around and asking myself the same question: \"What the hell am I doing here?\".   \n\n(Original Review Below)\n\nMost Drinking establishments gather a culture, a scene, a crowd, or a dominant pack of regulars that pretty much sets the scene and forms an unwritten code of conduct, the likes of which govern any place of congregation.  Once things settle in, you can pretty much predict what'll be happening and who'll be around any time you visit.\n\nThe Valley Tavern is not such a place.  Despite it's location smack-dab on 24th street in Noe Valley, it has failed to garner an image that will aid in predicting what type of crowd will be hanging out at any given time.  Two owners ago, the same place played host to an extremely diverse crowd of interesting people.  But the place changed hands during the dotcom era, and the new owners subjected the \"Rat and Raven\" as it was called, to a an extensive remodel.  Out went the old wood, the worn floors, the creaky doors, and the battle scarred bar....and out went the bar's soul.  The place changed hands again about 4 years ago, and the new owner managed to undo allot of the dotcom era wretchedness that stained the place around the turn of the Milena.  Unfortunately, the character that came with decades of hard wear can't be brought back.  To it's credit, some local artwork of the surrounding area has displaced the buy-in-bulk reproduction beer advertisement decor that plauged the walls until recenty.  Sure, it's a nicely fitted place, but very little about it is distinctly San Francisco.  The entire bar could blend into the scene of any Major U.S. metropolitan area if it was yanked up with it's foundation and moved...\n\nIt's a bar that many visit, but few call home.  A small collection of middle to late-middle aged regulars tend to collect at the end of the bar farthest from the entrance, yet they make no effort to mix into the more dominant twenty-something couples and singles that begin to fill the place well after nightfall.\n\nOn the positive side, the owner's pro-active management style has been one of weeding out problem patrons such as sloppy drunks, combatitive personalities, and drug dealers.  In short, it's one of the best run bars in the neighborhood.  Peace has it's price however, as the establishment lacks any kind of \"edge\" that many city dwellers seek out.  Dueling pool tables in the back make a great place for multiple groups to mingle, and a detached smoking area that faces 24th street provides a conversation-friendly refuge from the music, which all too often is loud enough to hinder friendly chat.  A covered patio in the back makes for an even quieter oasis from the noise, and  a clear, corrugated plastic roof lets sunshine in and creates an audible pitter-patter on rainy days.  \n\nThe Valley Tavern probably gets almost half of my monthly bar tab, mainly because it's walking distance from home.  It's a got a convenient location, a good beer selection,  and it lacks an insular crowd of overbearing regulars to contend with (i.e., like the Dubliner down the street).  All in all, not a bad place....though somewhat lacking in character and local charm.  I'm considered a regular, but if I lived in another part of the city I wouldn't consider this bar a destination worthy of inter-neighborhood travel......", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "Very chill spot, great beer selection, comfy seating, a jukebox, and pretty reasonably priced alcohol.  Love that you can order food from Basso's or Patxi's and they will deliver to you at the tavern.  On a heavy drinking night, when we closed out our tab, the bartender gave us four free drink chips to be used on our next visit - awesome!  We would have come back anyway, but this was even more incentive.  Bartenders are friendly and accommodating.  It's wheelchair accessible - my friend had no trouble getting a spot at the lower part of the bar or getting into the bathroom.  I've never played here, but there are pool tables as well.  Overall, a super chill spot to come and have some beers.", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-22", "description": "The Valley Tavern has been a local favorite since it was the Rat and Raven and the Coyote Club. The Monday night pub quiz has brought more neighborhood regulars and a few imports.\n\nI believe this is the largest bar in Noe Valley with lots of TVs for game day, and two pool tables. But the real plus of this bar is the beer garden out back. During the World Cup they even put TVs out back so you could watch the game while outside.\n\nThe staff here does a good job at taking care of the regulars and treating those who are just passing through. If you are in the neighborhood, stop by!", "author": "Kemp M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-13", "description": "i teeter between two and three stars b/c my experience wasn't a complete one.  why?  i only played pool and didn't drink anything.  0_o  no, your eyes aren't being deceived.  i stopped in around happy hour on a wednesday to get a couple of pool games in before yoga class.  (nobody likes a liquory yogi.)\n\ni immediately liked the mellow vibe of the place.  dim, w/a familiar feel of a buddy's basement (minus the lack of windows and stale smell).  it seemed like a comfortable spot to be low-key and have a beer.  \n\nso where do the two stars come in?  ...holy miniature pool tables!  ...and $1.25 a game too!  there were two small pool tables in the elevated area in the back.  it was probably the most cramped setup i've ever seen.  not comfortable at all.  i would've gone w/only one pool table.  ...if you want to play pool in this area, i'd go over to the peaks.\n\ni suppose i could go down to one star if i was rating valley tavern solely for its pool tables, but that'd be as ridiculous as rating any establishment based on their bathrooms.", "author": "Ting A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-10", "description": "If I lived in Noe Valley, this would be my hangout.  \n\nIt's the ideal neighborhood bar.  Clean, tavern-y feel, pool tables, clean bathrooms, jukebox, smoking room (not that I smoke, but for the BF that is cool), lots of beer on draft as well as stuff for mixed drinks.  \n\nNot too crowded.  I would say about 80% full which I find rare in SF on a weeknight without any specials (ie. Taco Tuesday, or Trivia Night) going on.  That was good though because then you have a good vibe, but not every seat is taken and it's not nuts to butts in there.  \n\nService was good, the bartender was super friendly and even bought the BF a shot for his birthday. Not much else to say, I liked it alot and would come back again even if it's not by where I live.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-12", "description": "Came here on a sunny weekend and enjoyed a couple of pints on the super chill back patio. I really liked being able to sit in the dappled sunlight outside (inside, the bar is very dark)  and the no-gimmick, no-nonsense vibe.", "author": "M M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-08", "description": "Average Bar, pretty typical of the local pub gone corporate (not TGIF corporate, but not much soul in any case.\n\nOne wonderful redeeming feature is the bar menu is from the Latin restaurant next door, Mi Lindo Yucatan.  Yum, great food, but the ordering and service is a little wonky.\n\nGood beer selection, but do not try to order a real drink (the kind with clear liquor and no bubbles).\n\nGrab a beer while you are waiting for a table next door, but don't expect much.", "author": "David R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-26", "description": "I used to love this bar a few years ago...and still very much enjoy the mellow atmosphere/vibe - I was just really disapointed last time I visited.\n\nI was there with a large group who spent plenty of money there and had nothing but respect for the space. I found it rather upsetting when I told the waitress I was sober driver and she charged me $2 for a coke. Even at the most yuppy bars I've never been charged as sober driver, no less TWO DOLLARS for 8 oz. of soda. \n\nI probably won't recommend to go there again.", "author": "Erika P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "Valley Tavern's beer towers are so great, especially when you have a large group with you. Even more so, when you are with a large group and playing drinking games at the bar... $28 for 3-4 rounds of domestic beer is pretty good. VT is chill and the service is wonderful. They don't have their own kitchen, but you can order of the menu from Basso's and they bring it right to you. I recommend their patio on a nice day... it's pretty cool and fun and all that jazz.", "author": "Nichole P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "They have a great beer selection, pool tables, CLEAN restrooms (yes I did say clean restrooms...in a pub they do exist), and a comfortable environment. The prices are very reasonable and the bartenders are nice and chatting. But one of the main reasons I like this pub is that it is close to home, I could say its stumbling distance but I live in Twin Peaks district so its all up hill so if I do stumble I would be going back in the direction of Noe Valley. None the less the location rocks.", "author": "Violeta E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-23", "description": "Effin sweet.\n\nOverheard yesterday, I learned that humans fart an average of 14x/day.\n\nGreat visible TVs for your weekend sports as well as baseball games.  The beer/booze selection is top notch.  Chimay on tap is the way to my heart.  The prices are just right and they take cards as well.\n\nThe staff is friendly and fun as well as the other patrons.\n\nThe patio is ridiculously nice.  It is a great place to enjoy an afternoon with a pint and some conversation.  Although, I am confused on whether you can take alcohol all the way in the back of it...if not I'm perplexed on why.\n\nAnywhoo, inside is mad clean and spacious as are the bathrooms.\n\nIf I lived nearby this might be one of my first choices for the comfy pub day.  But since I live a 10 min 24 ride away it will be a Noe Valley break and an occasional meeting place for those idiots that live beyond Glen Park and want to meet in the middle.\n\nOh, yeah...I'm way above average.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-05", "description": "I've come here a few times to watch 49ers or other sports.  Decent, affordable beers.  Pool table in the back.  If you're hungry, they let you order food from a restaurant nearby (pizza/wings/etc).", "author": "T Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "Love the little BBQ they put on during big games.  Great place to be to watch sports and grab some food/drinks.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "**Great for Sunday Football**\n\nMy boyfriend dragged me to this bar when we first started dating and I was a little annoyed (especially when he told me that the bartender had a crush on him). However, once I got the dirty martini the way  I like it (filthy dirty) and quarters for the ping ball machine, with a smile- I was very pleased. \n\nKat is the best, and if you care, doesn't have a crush on my boyfriend.", "author": "Paige B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "I've celebrated birthdays, graduations, and regular happy hours at Valley Tavern. Never does it disappoint me. Tonight, I visited with an old token for a free drink, and ended up with another two shots on the house for me and my wife. And the bartenders are probably the nicest I've ever met. Not only that, but they KNOW their drinks. Plus, they have some great food from Basso down the street now. See you soon, Valley.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-18", "description": "My favorite of the 24th Street haunts... Strong drinks, fun bartenders, lots of beers on tap and pinball.  Add that with a couple of pool tables and a ton of TVs with all the sports you could ask for (including Guy's favorite, FUEL TV on the plasma with XTREME sports!), this place fulfills it's role as a great local bar.\n\nRotating art installations keep it fresh and they encourage you to have any food delivered to the bar.  The smoking lounge in front (for you lucky bastards who still smoke) and the garden seats in back make it a nice place to relax and chill.\n\nIt gets crowded on the weekends, but not intolerably so.  For a drink after work, during the week it can't be beat.  I also seem to find myself there quite a bit during the day on Saturday's and Sunday's, it's a great place to catch a game and practice on my mad pinball skillz.  \n\nI got pretty wasted at the old Tavern a week ago, but that was my fault as I told Katherine it was my birthday and she proceeded to pour Patron and Jaeger bombs into my face.  Bless that girl.  \n\nNot pretentious, always fun.  They could use a better happy hour, but who am I to tell them how to run a business.\n\n**Update:  3.75 Sierra Nevada Happy Hour = SWEET!**", "author": "Tony A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "Monday Night trivia! Woo.\nNice bartenders, speedy service. A lot of choices to be made.\nLocal, which is nice.\nA generally good, clean place to be. Oh, and a place that opens at 11 on a Sunday is totally fine by me!", "author": "Meghan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "We came across  this bar while we were cruising Noe Valley. We just popped in for a beer, and our friend was coming to meet us. We happened upon Monday Trivia Night. We ended up with a team of four and stayed the whole time!\n\nThe trivia was pretty fun, adn we did pretty well. The bar filled up quickly, and people were having fun. We ended up getting pretty into it, but we blew our lead in the last round! :( plus there were some crews there who obviously come all the time...\n\nGood beers on tap, two pool tables, pinball machines, and you can order food from M Lindo Yucatan next door. And the Tamale Lady came in!\n\nWe will definitely come back to make another go of it! Best part is you get to make up a team name and the nice announcer guy with the accent reads it out load! GO TEAM SWAMP CROTCH!", "author": "Audrey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "My friend just recently had a birthday get together here.  This place had a great selection on the jukebox, the drinks were very cheap (I was surprised), and the bartenders were friendly.  Also, they have TVs visible at many angles so you can watch sports (the Olympics was on).  I didn't make it over to the pool tables, but they have them too if that's your thing, plus a little outdoor patio for people to smoke.\n\nMinus 1 star for having to get carded at the bar every time I got a drink.  I would suggest they get a door guy checking IDs at least for the weekends.\n\nOverall, good bar, parking isn't bad and the drinks were priced really well.  I can dig it.", "author": "Ruben P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-11", "description": "I came here a few nights a go with a good friend of mine to do some catching up.  We were in search of a nice place where we can catch up over a beer or two.\n\nFor a Thursday night, there was quite a few people seated at the booths and such.  We picked a location at the end of the bar, away from other patrons.  The music can be a bit loud at times but conversation is manageable.  At least for two people - any more people and we would have been yelling across the table.  At least there weren't strobe lights or anything that would turn this bar into a wannabe dance hall (see voda vodka lounge).\n\nThis seems like a good local joint to go to.  Four stars for \"I'll come back if I'm in the area and need a place for a beer.\"", "author": "Robert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "Thank you to the Valley Tavern for hosting the Yelp 2nd Annual Cupcake Bake-off.  We had the run of the 3-tiered back patio.  I ordered a couple of Wyder's over the course of the afternoon and the bartender was friendly and the service prompt.  \n\nOver the years, I've been there periodically but the back patio was a (happy) surprise for me.  Valley Tavern is a neighborhood bar that's been around more than a while, in a continually changing neighborhood -- and where the change is (generally) to add more shiny, pretty, spendy places.  Yay for the Valley Tavern!!", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "On a Saturday evening, this place was crowded but we were able to get a drink pretty quickly.  They have a large draft selection which was a plus, and the bartender (who looked 16) was great!  I need to come back to this place on a nice day to hang out on the back patio.", "author": "Dana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Every single time I've been to Valley Tavern they greet me with a warm friendly smile. It's little things like that that keep me coming back here.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "Cool, mellow crowd.  I went on a Thursday night and it wasn't outrageously packed.  Sports on the TVs, people playing pool in the back, and my friend and I enjoying our beers and some nachos.\n\nThe nice thing is that their food is from the Mexican place next door.  You can order it at the bar and the restaurant staff brings it over to you.  Just know that you have to pay cash for the food -- you can't add it to your tab.  Pretty wide variety of beers, including the illustrious, always-classy PBR, although I had a Newcastle.\n\nAll in all, great neighborhood bar.  Go on, catch up with your friends over a beer.", "author": "Tamara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-25", "description": "If you just want to go and drink with your buddies and aren't really interested in being seen, you should consider going to the Valley Tavern.    This is a place to drink more than it's a pick up joint. \n\nSince it's walking distance from my place I go here and Bliss Bar a fair amount.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-06", "description": "Free food, forgetful bartenders and football games are what I think of when I think of the NVT. After noon they bring out some kind of free food, which varies from week to week. The bartenders there seem to be more interested in conversations going on at the bar than keeping track of everyone's tabs... I've gotten at least one free drink every afternoon spent there(but I tip very well)!", "author": "Nate S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "Weird. It's cozy, they have Chimay on tap (woohoo!), and... a cool bartender girl with buzz cut. I felt very comfortable here, on a solo night out.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-24", "description": "This bar is kick ass.  Its like a hidden gem, its got a sweet outside area and inside it's pretty nice too.  Ive never been to noe valley, honestly didnt even feel like i was in sf, but i did like this bar a lot.  Came here on a sunday, so not sure how it usually is, but it wasnt too busy so that was nice and i really liked the outside area.  There was this huge freakin cat thou that looked like a black panther that was like on the fence outside, i hate cats so it was good it just stayed up there.", "author": "christopher h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-07", "description": "I was visiting San Francisco over NYE weekend. After searching the city for a friendly bar Im so happy I found Valley Tavern. Kelly Jo was my bartender and she was WONDERFUL!!!! She made our night kick ass. She was sweet and quick to make our devil juice. She also ordered  us pizza from next door and had it delivered to the bar! \n\nOver all Valley Tavern Rocks! Thanks Kelly Jo we will surely be back next time we are up north!!!", "author": "Magnolia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "Very good bar....one thing I love about this place is they let you bring in your own food since they don't have a kitchen. Fun crowd and trivia nights on Tuesdays are always fun. They have a fair number of beers on tap....best bar in Noe, in my opinion, and I recommend ordering some Patxi's pizza from next door to have with your beer.", "author": "Drew K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-18", "description": "A good place to go have a drink or two on a Sunday afternoon.  Not a place I would want to cozy into myself for the long haul.  For a bar with a lot of TV's was pretty disappointed that the only TV showing my hometown Portland Trailblazers (woot) was changed off in favor of a third TV of the same lacrosse match.  Better luck next time!  Service was good but nothing to write home about.", "author": "Todd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-31", "description": "I really don't know how you could not like this bar.  It has ample room for being a local hangout, a separate but still enclosed smoking area with it's own tv and heater, plenty of flat screen TVs, pool tables , three outdoor levels (two of which are covered and have TVs and heaters), lots of good beers on tap, and a locking door for the crapper (just bring your poo drops so you don't wreck it for the person coming in after you).  You can even order food from Mi Lindo Yucatan next door from the bar and they bring it to you in the bar.  More bars should be this convenient.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-04", "description": "They have a pretty back patio.  That's kind of nice, right?  And they have that nudie photo hunt touchscreen TV game, I like that.  Pool tables?  Sure!  That's cool. EXCEPT MILLER LITE FOR $4 ISN'T A HAPPY HOUR SPECIAL WORTH BRAGGING ABOUT.   I mean, really?  You can't sell PBR for $2 or $3 like everyone else? I'm sorry, am I at the airport?", "author": "Laura F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-07", "description": "so after having a couple ordering too many buckets o corona y modelos at playa azul with a client over some delicioso seafood, we decide to hit up some random bars near his place so he could drop off his car. we found ourselves at the valley tavern. what a nice surprise. didnt yelp it, didnt call around, just randomly picked a place and it turned out to be very nice. clean inside, i mean clean. i dont think ive ever seen a bar during opening hours so clean. thats always a plus. two pool tables in back, the usual mp3 jukebox off to the side......\n\nooooo chimay on tap. nice.\n\na smoking area? ehhh its right by the door so same thing. \n\nwould definately come back here if i was in the neighborhood. shit drop off your car at selecta autobody next door and come on over for a drink. sounds like a plan.", "author": "Euge L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-09", "description": "This place is great any time of the day or night. They have a wide variety of beers, pool tables, photo booth, a 3-tiered back yard patio, and a smoking room. All that and their bartender, Hank is a great guy. During the day when it quiter, it a great alternative to a cafe if you want a change in scene and a quiet place to work. The fact that they have free WiFi only adds tot he appeal.", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-31", "description": "a mellow local neighborhood bar....nothing fancy or impressive...just comfort the offering...pool tables...various seating options.....friendly cute barmaids.....happy hour specials of $three before seven.....beers on tap averaging $four to $six.....typical local scene....but added benefits of screens, screens and more screens.....sports, games, tv 'n' more...but...do think the delivery food suck pretty bad...bar good....delivery food from near by restaurant bad....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "A top-notch place. It has everything you could want from a bar in quiet little Noe Valley. Two pool tables and an Addams Family pinball machine provide excellent entertainment. Does it get any better? You bet! Trivia night every Monday.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "Good spot to walk to/from the Dubliner for a slight (and I mean slight) change of pace.  Same smoker's lounge, same set-up, similar feel overall.  That's a good thing - both places are solid bars and good to have within a short walk.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "My favorite local pub.  I usually celebrate my bday here, there's always room for a group, they let you bring food in, and it's not hard to get a chance at the pool table.  The only negative is that some nights it turns into a collegiate frat scene around the pool table section in the back.", "author": "Courtney Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "Pretty darn fun place to go for football games. The free food is kick-ass.", "author": "Jonny A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-07", "description": "Simply the best.  Valley Tavern is acceptable for every night or day of the week.  From Football Sundays with the free BBQ to New Year's day (warding off the hang over) with free cheese and crackers (wait... both of those were day time drinking...), Valley Tavern rocks my world.  They have fun games too, pinball machine, sacks game (corn hole... .what?!!!), pool and I'm pretty sure erotic picture hunt in the back.  They also have a nice back porch thing going on.  Truly a neighborhood hang out.  Thank god it's in my neighborhood (and happens to be the closest bar to my house).", "author": "Brittney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-15", "description": "I really much enjoyed this place when it was a dark & gloomy dive 10 years ago. Fast forward to the present and the crowd leaves a bit to be desired, but if my favorite drunks are there it's a ton of fun. Plus there is a lot of space, so you can hole up in a corner and forget about the rest of the place. The bartenders seem cool, but I don't know how they work in a place with that much bright light! Ugh.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-31", "description": "I miss the old days of The Rat & Raven when I lived in Noe Valley.....  It had a great old jukebox full of punk classics and good deals on pitchers of beer.....Back in the day I remember that Cybelle's was right next door (Monster Slice for the crab walk home)   The Valley Tavern is ok but I miss the old days of the R&R", "author": "Mike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-01", "description": "Cool enough place. Lots of people, but still didn't wait long for a drink. Awesome neighborhood place for after work de-compression.", "author": "Art W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-13", "description": "Went to Valley Tavern for Pub Quiz night last night.  Had a good time.  Beer was a little pricey.  Quiz was really hard.  Nice facility.  Friendly enough people.  Not special, but a fun place to do Quiz Night.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-17", "description": "this place would get 5 stars if...\n\n1. the giants game was automatically on. we had to ask to change the channel.\n2. they didnt have wwe or wwf whatever its called wresting on.\n3. THEY HAD BEER PONG tables set up.\n\nnow i didnt really go to the back. i just saw some pool tables. but they were full. but seriously this would be my bar if they had beer pong.\n\nnot too crowded. seating. sports. variety of beer on tab. jager. jager. JAGER!!! chilled jager i might add.\n\noh and they have these beer dispensers for like $24 that has like 4 pitchers of beer in it. oh so awesome! so awesome!\n\nanyways. good time.", "author": "A. V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-07", "description": "A very nice place to hang out with your friends on a fine Monday afternoon which there is a cozy back patio where it is quite private from the bustling summer group which Noe Valley brings. With the beer selection I found that it was quite premium all together with at least, as I can recall, 15 beers on draft / tap, which in my opinion with the selections were all great ones. They had Sierra Nevada, Blue Moon (my choice), Guinness, and for the recession people, PBR. \nIt's sad that the patio closes at 7:30, so if you go there late, you should of gone during the day. The bartenders are very nice and will let you watch your choice of sports game without any hassle or \"can't do it, boss doesn't like hockey\". \nIf you're in the Noe Valley area or off of 24th during the day and want a drink, come check this place out. The bar altogether brings a nice atmosphere and positive environment (which is weird to say for a bar), but you'll enjoy the conversations which come with the place.", "author": "Jon-o G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-13", "description": "Great music, but  not a great stand-out besides that.  Average three stars here...although I went on a Wednesday night, so I assume things improve on days when there are actually other people in the bar.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-25", "description": "Much like the Dubliner, a great local bar that has enough going for it to be a destination for people who live in other parts of the city.  Plenty of good beers on tap.  It has a spacious main room with several tables and a decent-sized bar. There's a pool table in back, and for you smokers, there's an open air smoking room that faces the street.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-10", "description": "I enjoy the fact that this bar has pool tables!!! And you can always get an opportunity to play. Every now and then you might have to put up with a silly drunk, but for the most part, it is not bad! I have not tried the food at the tavern, it does look appetizing though!!", "author": "sonam d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-08", "description": "Cool local bar.  Always showing multiple games.  Cool outdoor patio too.  The best part for me is there are nover any pacmina's in the bar.  :)", "author": "Fred R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-12", "description": "A typical neighborhood bar in a neighborhood where such bars are atypical.  This and the Dubliner down the street are the only ones (Bliss is trying to be more upscale and trendy).  I definitely appreciated the mini pool tables and the variety of miniature-sized pool cues.  Very useful when you pack them into a space this tight.  The outdoor patio in back was closed behind locked door, but of course, I went back there anyhow to scope out the setting.  Looks like it would be nice on a fine summer day.  Will have to come back if we ever see the light of summer again....", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-04", "description": "I dig this bar for a variety of reasons, but summin' it up- It just says\"friendly\".  Always a good vibe in here, especially on Mondays with the quiz-type game.  It's in my 'hood, but we'll always walk past 2 or 3 bars just to go to this one.  'Nuff said?", "author": "Afab M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-21", "description": "Ahhh, I love this place.  Good times, good people, great bloody marys, what else can you ask for?", "author": "kerry l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-23", "description": "Very neighborhood-esque. We went with two regulars who knew the waitress by name so the service was great. About 15 beers on tap, some more unique than others. Full bar, and they'll make you whatever you like. Including a \"bloody amaretto\" from what I understand. Mostly a middle aged crowd so not the most \"happenin\" place. Not a good place to \"go out,\" but a great place to meet up with friends over a drink.", "author": "Halley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-08", "description": "Definitely agree with Mike's review:  this place is a cool hangout with decently strong drinks and a relaxed setting.  They may not serve some of the trendier drinks like mojitos, but they whip up a pretty good dirty Grey Goose martini for a relatively low price.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-13", "description": "People in Dublin have no idea what an Irish car bomb is. They would find it offensive that you're mixing their Guinness with other crap. But the Valley Tavern serves GREAT Irish car bombs. Drinking is fun.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-24", "description": "My favorite locals bar in SF.  Def biased because I live in Noe", "author": "Sam G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-19", "description": "Ah... lovely Chimay White on tap! Get yourself a glass and sit in their little smoking alcove overlooking 24th street. During the daytime, it's a sunny little perch from which you can watch the world go by.", "author": "Maureen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-06", "description": "This is a great spot to get a quiet drink with friends.  Even on the weekends, you can pretty much always find a seat.  There are two pool tables, although there really should only be one in the space they have.  They have an outside patio with heat lamps open until 8pm and they have a smoking vestibule in the front open all night.  They have an internet jukebox and wifi.  All the bartenders are awesome and the drinks are reasonable.  It's one of those rare places where you can be comfortable showing up in evening wear or in sweat pants.", "author": "angela k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-17", "description": "I love this place! I try to stop by on the weekends since I don't live in the neighborhood. Good atmosphere, friendly bartenders, great selection of beer. What more can one ask for in a neighborhood pub?", "author": "Larry J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "Great local!  If you're on upper 24th, it's the place to drink.  Friendlier than the Dubliner, and especially the \"Noe\" on Church.  Only problem: no real food . . . but you don't go there to eat.  There's a smoking room as well if you haven't quit.  I step in for second hand smoke, just to remember the old days.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-09", "description": "Under rated joint in an under rated hood...I lived in Noe Valley for almost 3 years and then this place popped up after I left. How typical. In any event, it's very solid...nice dark tavren with good beer and a good juke box. Nice little back patio area as well. Worth a look if you're in Noe Valley and want something less showy than Bliss.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-17", "description": "This is a place that really embraces the mediocre.  Valley Tavern is large and never too crowded, so you can always get a table to sit at, making this a good place to go if you have a small group and just want to sit around and talk. If you like pool, the tables in the back are good for that.  Other than that, it is a little too big, or echo-y or something.   It's not very cozy or comfortable, the couches are soft and all but they are just too clean!  This place badly needs to be broken in.   Finally, and worst of all, the beer here is too expensive, and there is no happy hour.  The best way to break in a bar, expand your geographic draw, and begin the nurturing of reputation and character that is so essential for a bar is to have a great happy hour....or at least some cheap beer.  A pint of miller light was 4 bucks, thats just silly for a \"local\" joint.", "author": "Mr. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-12", "description": "I had a blind date here.  Yeah that's right, this is where people had us meet!  You know what though, it turned out pretty good.  We had a few drinks in this relaxing environment and then once we knew we would not be killed by the other one, we moved on.  It is a great local Noe Valley bar.", "author": "Pele N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-04", "description": "Local neighborhood bar. THe place is cool with good beer. Pools tables are fun but not much room. I love the back porch area. Everyone is pretty chill and there is almost always a seat.", "author": "Carli M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-06", "description": "I just recently found this bar, its in a good location, away from all the mission bars so its a good break from the norm. I walked in to play some pool. I am easily impressed but they do have a Internet jukebox which lets you select the songs you may not find at other bars. Pool tables are small but never crowded... I am a fan of the backyard \"beer garden\" and the front room smoking area. Only complaint would have to be the prices, didn't matter if i was getting a draft or a bottle everything seemed to be 4+ bucks (mission bars around 2.50) but yeah its a good escape, probably catch me there once a week...", "author": "jamie z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-23", "description": "I always have a good time at the Valley Tavern.  Friendly bartenders will loan you dice and play 1-4-24 with you, which is nice.  I went on Sunday with a buddy and we enjoyed the good FREE bbq (how often is free bar food actually tasty? Almost never, I know!) and some cold beers.  Good selection of beer on tap, not totally unfriendly prices (it is Noe Valley after all) and friendly service.  I went back last night for the pub quiz and had a great time, despite a disappointing 3rd place finish.  I blame my teammates and myself for vetoing a couple answers that ended up being right, my bad.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-20", "description": "I've been here a few times with friends on various nights of the week, most times just to catch up and drink but also once for the quiz.  The place seems friendly enough, parking as you might expect for the area is dreadful but if you're lucky enough check out the car park on the opposite side of the road!  \nA good selection of drinks, the music is kept at a reasonable volume and the pool tables are a nice addition which have always been available at some point during the night.  The quiz was fun but at times we struggled to hear some of the questions.  It's worth keeping in mind that this place isn't of any considerable size and is pretty dark, so anyone looking for a quiet drink sitting down might want to either arrive early or look elsewhere.\n\nOverall this place is worth a visit and on the right night can be a lot of fun.", "author": "P H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-15", "description": "The drinks are mixed well.  Great mix of beers on tap.  The male bartender is an interesting character.  All bartenders are friendly.  Place is usually quiet, and I like to sit at the bar, so it works out well.", "author": "Brett B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "So this is really the neighborhood bar!! I live at 24th and Castro and I love this place. Great to watch sports, take friends. They have a great stepped patio out back past the pool tables. Sometimes serve free food for Friday happy hour. This is the place to go if you want the neighborhood bar feeling.", "author": "julie q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-30", "description": "Cool bartenders, 2 pool tables with only sort of enough room to play,  pretty good selection of drinks and plenty of seating.  It's a great bar to end an evening or just relax with people.  It is very rarely crowded.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "This bar was my local for years when I lived in Noe Valley. It's a great place to play pool because really good players show up all the time. When the regulars call it home, it can make a stranger feel at home. Having been a regular there, I have to say I am still friends with people I met there, even being out of the hood.There are long term bartenders that make the place feel cozy and familiar, and both the smoking room and the back garden are great places to strike up a conversation with someone new. I miss it and wish there was something even a little bit like it in the upper Haight.", "author": "marci m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "nice neighborhood bar. its a good place to go with a group of friends. its usually pretty chill. prices are pretty good from what i remember. the waitresses are pretty attentive and come around pretty often to check on your table.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-27", "description": "If you want to be treated disrespectful come here.   I personally don't like getting ignored when trying to buy a drink just cause the bartendar feels like being a jerk.  Bliss bar a couple of doors down is way nicer and has better service.", "author": "Patty G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-14", "description": "For a local pub, this is my favorite.  There are comfortable leather couches and lots of good beers on draft.  There is even a little smoking lounge in the front and a bigger one in back.  You can get hammered here and they still treat you with respect. This place is as unpretentious as it gets in SF.", "author": "Bethany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-22", "description": "The Sunday football bbq buffet is awesome!  And yes the beer is cold too.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-20", "description": "jon.......sarah     awesome bartenders   great drinks good crowd        internet jukebox     you can find any songs awesome", "author": "tommy b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-22", "description": "this joint is great -- nice TVs for the sports watching; comfy benches; good beers; cool crowd; pool table in th back; smoking deck; and did i mention this is a dual review?  they deliver mi lindo yucitan!  so much better than your average pub grub.  4 stars for them too!  it all works.", "author": "e w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "great bar with a casual pub-like (yet not scummy) feeling.  the beer selection is really good and i love the fact that you can order the mayan food next door right from your bar booth!", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "good ol down to earth bar. it's like cheers..although i'm not sure they know MY name, they def. recognize me and my coworkers when we stroll in here for a long hard day of work.\n\nhappy hr special everyday from 5-7, and trivia nights on mondays!\n\nthis place is so chill, they let you have your pizza delivered here...which is perfect when you're buzzed and not wanting to go outside for a snack!", "author": "joanna u."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-25", "description": "i cant say I minded this place, but its not my scene. first of all, i dont know, i dont like bars that are lit up too much. it scares me, i felt like i was in a rec room at a youth center with the bright lights, and all the video games and pool going on. at least it had a lot of space though, the music was good, and i dont remember the drinks being super expensive", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "being from the UK i really miss pubs and no bars are not pubs. The valley tavern is a great mix of pub and bar. Great atmosphere and really great beer!!", "author": "Stuart g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-23", "description": "i love the valley tavern.  it's a perfect place to have a beer and people watch if your boyfriend insists in watching that thing they call football.  they even have bbq on sundays, and a super fun game called \"bags\" - it's like a girls version of golden tee.  to top it off - on nice days people seem to forget about their back patio and you often have it to yourself. the bartenders are nice and never seem to cut you off no matter how many jager shots you have, which isn't always a good thing...especially on one of those \"lets just have one beer\" sundays.", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "i went here for the very first time with my cousin and friends a couple of weekes ago!!  know its not liek the bliss all fancy and stuff.. this is a real neighborhood bar like the peaks just looks better.. but same people... just i had a great time for getting wasted on a week night! had fun taking shots of patron and playing some pool on the 2 tables they have in the back... the bartender sarah was so sweet cant wait to go back for another \" just off work getaway\"", "author": "Shauna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-03", "description": "what a chill place!  Great beer and a comfortable layout- booths and barstools as well as 2 pool tables.", "author": "pauline e."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-03", "description": "As sportsbars go The Valley Tavern, and consequently The Dubliner (same owner, same block), try very hard but fail as places to go see the \"big game\". The televisions, while plentiful, have the distinction of being roughly ten feet directly above your head, making for a very sore neck after three hours of football. In addition, the view from the seating area another twenty feet away is no better, and from there you will also have to wait a century before the waitress will arrive to take your order. For that matter I found the bartenders to be completely obnoxious when I sat at the bar. When the waitress came to take my order (at 11 am) I let her know I would need some water to rehydrate first and would then have a beer. She brought me my water. Immediately following, the second waitress behind the bar also asked me what I would like to drink. I told her the same thing. Within fifteen seconds of that conversation the owner approached me from behind the bar as well. He informed me that there was a two drink minimum and that he was \"trying to run a business\". This all took place within three minutes of my arrival. Is this really the way to treat your customers? Suprisingly, the owner decided to utilize this same setup for both of his pubs.", "author": "Doug G."}
