{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "We just saw this spot accidentally on our way to basketball training at St. Ignatius and wanted to eat a quick dinner after a long drive here. Glad we stopped by and ordered before reading other reviews! Actually decent prices and food was pretty good. We had the vegetarian eggrolls which were with the vermicelli noodles and shitake mushrooms which I like. It had taro in it as well but could not distinguish this- overall good. \n\nPad Thai was the usual and good. Then we had the pumpkin curry and they use kombocha squash instead. I love kombocha but pumpkin would be even better, but understandable since not in season. So the dish was still good and mine was spicy enough that I liked it. \n\nNice and clean. Service was friendly and quick. They were very attentive and filled our water cups. This will be one of my quick go-tos when I am in this area! I can't wait to try the other dishes ( my son only wanted Pad Thai but loved it all after eating it all) bc I saw other diners and they had the rad na( like chow fun) and angel wings which looked even better than what we had- Yum!", "author": "EllenMarie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "I've been here a few times for lunch now and I get the Thai fried rice with chicken every time! Although the rice is a tiny bit mushy sometimes, it tastes good overall.\n\nMy girlfriend gets different dishes each time: red curry with rice, tom yum soup, garlic pork, etc. All of them were delicious!\n\nThe restaurant is kind of small but there were tables open each time we came here. The staff is nice, service is good. I would recommend checking this place out if you're craving Thai food.\n\nOne thing I wish this place served is fried chicken fried rice!\n\nNote: there is a lunch special menu available from 11:30am-3pm.", "author": "Wesley S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "Just about what you'd expect at any Thai place. The service was great, I got an order of pad Thai with prawns to go and it was ready within about 5 minutes. However there was only 3 shrimp in the entire thing, and I paid extra to have them added. They also didn't give me a fork or napkins in the bag and I had to borrow those items from a friend. The pad Thai tasted great though, no complaints. I'd have included a fourth star if there was a more fair amount of shrimp in it.", "author": "Dakota C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "I would give this place a zero if I could for making my 3 year old cry. We have been loyal customers but the team who works Sunday nights is awful. They delivered our green curry to another table, set 2 dishes that we didn't order on our table. We told them they were not our dishes and the waitstaff left the dishes on our table\nFor 5 minutes then decided to serve them to another table. That's not serve safe. Then our pineapple fried rice took 30 minutes to get to our table. We explicitly told them no prawns because of a shellfish allergy. They brought us prawns in our rice. All this and still no apology. Then said well do you want us to exchange it? IT HAD Shellfish which would make us die! By this point my 3 year old is crying because she's so hungry. They never gave use our rice and never apologized and didn't even try to make it right.", "author": "Soledad M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Pretty average Thai restaurant, close to Ocean beach. We came here mainly because it was a 15ish minute walk down the beach and we were hungry!! Ordered Thai tea (yum), Pad Thai, and Green curry with rice. Pad Thai was pretty good, nothing too impressive. Came with big prawns, I was pleasantly surprised by that. Big portion, a lot of noodles. Green curry was okay. Overall average Thai restaurant, convenient close to the beach, and good prices very affordable. Good service!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Lunch special is great price and delicious! Treat yourself by coming here. The L1 and L4 combo was perfect.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Nice restaurant! We ordered the spices beef salad, red curry, sticky rice, and drunken noodles with chicken. Everything was priced really well. Most dishes were only $10. Will definitely come back to try the lunch specials.", "author": "Angela T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-02", "description": "Nice neighborhood thai place with yelp check in for free thai ice tea that was really sweet and had to be watered down.  Service was friendly. Food was good and just hit the spot.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "The place is clean and very inviting.  The food was hot, and the food was very tasty.   The portion was good to share with family.  I would come back again!  Even received a free dessert.", "author": "Joel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "We got a lunch special with pad Thai, yellow curry, and rice. We also got angel wings. They were all super amazing. The pad thai had the perfect amount of tanginess and the perfect amount of ingredients. The yellow curry was yummy when mixed with the rice. It was kind of coconuty tasting. Very good and cheap deal for lunch special. The angel wings were crispy and tender. It includes wings and legs. We got free coconut ice cream with the check in. It was very yummy as well. The service was fast and friendly.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "They serve the best thai food in the area during lunch time hands down! For the taste, quality, and price you cant beat it. Haven't been there for dinner but I plan on it soon.", "author": "Kealiiaumoku K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "Food isn't great. Tried the chicken Pad Thai (usually my favorite dish from any Thai restaurant). It was bland and fishy, missing the real essence of good Pad Thai. Also tried the yellow curry, which you would think you can't really go wrong with, but this place really didn't taste good.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Meh\nOverpriced \nOverrated \nPetulant take out cashier \nLast ditch effort for late nite grub in outer sunset\n\n\nSkip if possible\nOtherwise prepare to spend thirty dollars for two entrees from a snobby cashier who gives no utensils and napkins for thirty dollars of food that should cost half as much", "author": "Charles B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "Pretty good thai food from what i tasted. I did a lunch special. They have 1or 2 item lunch specials. I chose the 2 items, eggplant chicken and yellow curry chicken. Their food is definitely worth the struggle of parking. Theirthai iced teas are nice and strong.  We will come back for sure.", "author": "meeky P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-03", "description": "For $10 you get only this. Food is good but expect to get 2 portions (I'm 5'6\" 130lbs) or down a bunch of starchy rice.", "author": "Jayce T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "I'm in town staying at a nearby motel. I ordered delivery over yelp. Food was delivered quicker than I expected. My order came wrong. I ordered the pad thai and asked for the prawns on the side, no peanuts and no  bean sprouts. The itemized ticket clearly says this. My meal was delivered with both peanuts and bean sprouts. The side of prawns came with 3 pieces.  And I also wrote I wanted many many extra sides of the Chile garlic sauce. They gave me 2. It was also delivered with no utensils!  I'm not ordering from here again.", "author": "Cindy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "I've been here a few times before and liked this place but tonight was not a good experience. Short pour on wine, main course came while eating our starters so our entrees were cold when we got around to eating them. Under spiced and under flavored. Garlic pepper pork had no flavor of pepper or garlic, also hardly any cabbage. I wanted another glass of wine and was not given the chance to order one. We felt rushed. I don't think we will be back. Too many better options in SF...", "author": "Lauraine E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-07", "description": "We've ordered togo before and its always good. This time, nearly everything was wrong.\nWe ordered mild yellow chicken curry with extra potatoes and chicken with a larger serving of rice. \nWhat we got?\nThey ran out of rice so we only got a small order, not a big issue. But when we got home, the curry was not the same. It was spicy, and still somehow bland. The last time it was rich and sweet. It also didn't come with any extra chicken or potatoes, instead they gave us a bunch of veggies (cabbage, carrots, broccoli, and some tofu). On top of that I found a hair in the food. \nSo disappointing. Only reason for 2 stars is I understand sometimes these things happen, but it was so many issues and my husband cannot eat spicy food for health reasons so we had to toss it.", "author": "Bella T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "GREAT THAI FOOD Hiidding spot that I got just by accident and this will be my Thai restaurant from now on...\n\nThe food is EXCELENT !\nThe service was very clean and on point...\n\nIt was so nice I was able to leave  my doggy outside and They brought her watter....that was a very kind gesture from Them.", "author": "Daniela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Garlic Pork! MmmMmm\n\nStaff has always been nice to me and seating area is always clean.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "This was an awesome place for a quick Thai craving. Star w friendly and food was flavored well", "author": "Bobin G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-13", "description": "The best lunch special in town is here! Great food comes with lot of options around 13 bucks!\n\nBe careful with your \"to go\" orders, one time they forgot to put the entre in the bag and I had to complain when I reached home.", "author": "S J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "If you are ever craving that spice in your life, or should i say in your work day. This place will give you that extra kick.  My co-worker and I came here for lunch and parking wasn't too bad.  There was already a small crowd of people already eating but we still got a seat.  They have a special lunch menu which is great for your wallet.  You can pick 1 or 2 items for just under 10.00.   That's a pretty good deal for the amount you get.  \n\nI got the Ga Prow with chicken with chili, garlic, bell pepper and sweet basil along with the Pad Ma-Kuer with was sautéed eggplant with fried tofu, chili, bell pepper, onion and basil.  I was prepared to add more hot sauce to my dish, but I didn't have to.. It was so spicy that I downed my drink so fast.   I love the spices in this dish and I'm glad they did packed it with lots of ingredients.  We also got the fried calamari.  The Fried calamari was really good. the Calamari was not covered in batter like most places.  You have a good large slice of calamari that is lightly dipped in batter.  \n\nOverall i love this place, but i'm sad i lost all my pics before this review.   If you check in on yelp. you get a free scoop of coconut ice cream.  The ice cream was so good, I'm not sure what they put on top of the ice cream but it made it the perfect combo.  I'll be back!", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "First time having dinner here.  My aunt taught ESL to the owners children.  This is a family run business and for a week night this place was busy with customers.  There were 5 of us for dinner 2 beers and 6 dishes and brown rice.  We had a range of dishes and each dish had their special flavor.  I will need to go back again!!!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "Came here for lunch during the work week. I probably wouldn't have come here on my own due to the lower reviews for this place, but I'm glad that it was recommended!\n\nTheir menu is quite extensive and their lunch menu offers a shorter list of options, but still great variety. You can select one or two entrees from the lunch specials list and it comes rice and soup or salad. \n\nI chose the salad, which came with a sweet dressing and Pad Thai and Green Curry with Prawns. The pad thai was pretty good and came with lots of tofu and two tiny prawns. You can choose your protein for the green curry. I wanted more prawns which was an additional $2. I believe it only came with two prawns. Chicken or beef is a better deal! I chose this curry specifically because it offered eggplant, but I didn't notice any in my portion. It also wasn't spicy at all. Perhaps I should have asked for extra spicy! Despite all this, it was pretty good curry, perfectly creamy and delicious to mix with my rice! Portion sizes are perfect.\n\nMy lunch mates also went with the two entree lunch specials and really enjoyed their food as well. \n\nOverall, good value and great tasting food! Awesome lunch option!", "author": "Dorothy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "The best lunch special in town! I get pad Thai, yellow curry, rice, and a cup of Tom kha soup for less than 14$! It always ends up being two meals. And the food and service is amazing. COME HERE NOW!", "author": "Phillip T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "One of my favorite Thai restaurants in the City. My favorite dish is duck and they make a great roast duck red curry. The Orchid Duck dish is also good. Prices are reasonable and the staff are friendly.\n\nI will definitely return and I highly recommend this restaurant.", "author": "Chilly W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-02", "description": "I've eaten in this place a few times, and the food was decent, so I thought it would be safe to order for delivery. I placed my order a few minutes after 5, and it arrived a few minutes before 6. The woman who took my order said delivery would take 25 minutes. Let's move on to the food. The green curry with chicken was at least medium spicy, but I ordered mild. I had to strain the solids from the too spicy liquid. Where was the curry flavor? The stir fried veggies consisted of mostly pale white cabbage, bean sprouts, and soggy fried tofu, not exactly the crisp stir fried green veggies I had imagined. But worst of all was the brown rice. Instead of visible grains of rice, I got what looked like a big glob of thick, mushy rice pudding. It's really sad that Vanida Thai would stoop so low as to serve me this crap. I flushed most of the food down the toilet where it belongs. Obviously, I won't be ordering from this place again, and I would advise you to stay away as well.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "A local joint in the outer sunset... no one would seriously venture into this part of town to get a picture of a Pad Thai to post onto their IG or snapchat accounts.  There's nothing fancy about this place, your usual hole in the wall.  For the price and decent thai flavors, this makes it a go to for a quick fix.  \n\nI always get the pad thai or pad Kee mao aka drunken noodles.  I've been to Thailand more than my fair share and the flavors here always bring back memories I've had there.  That's enough for it to land an easy 3.5/4 stars.\n\nService isn't bad but it is a little awkward.  I come back for the convenience, price, and authentic flavors that resembles more like home cooking than a restaurant.", "author": "Colin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-07", "description": "Dined here for lunch on Lunar New Year's Eve and the place was quite empty at 1pm. I had made a reservation 2 days prior, but it definitely wasn't needed. The price was good for the portion size. Seems they have the lunch menu every day of the week, which is pretty awesome. \n\nI did enjoy my mom's garlic prawn combo. The flavor was delicious; too bad it was much too salty though. The one-item combo came with tom yum soup, which did not taste authentic at all, as well as a side of rice. My drunken noodle dish was beyond spicy! I know it was stated on the menu as such, but our server did not make sure I was aware when she took my order, nor did she ask if I would like it to be more mild. Also, the service was extremely slow for how empty the restaurant was. She did not ask what we would like to drink; instead, she asked as an afterthought when taking our orders. None of the servers looked our way during the meal either. It took me awhile to flag our server down for more water and to have them send over the forgotten house salad that came with our family friend's meal.\n\nParking was surprisingly decent; everyone was probably flooding the Chinese restaurants on Noriega or Irving. Judging by the inattentive service and just average tasting food, I don't think I'd visit in the near future.", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-17", "description": "~~~~Yes, They Deliver For Free~~~~\n~~~First Time Using YelpEats24 App~~~\n~Overall Experience: Tethered btwn 2 & 3~\n\nIt's always a plus when food is delivered to us. Especially for a group of 15+ in SF. This restaurant was very close to where we rented a house for the weekend. We actually didn't have much of a selection in terms of delivery. \n\nLet me tell you, it was quite a process to use the YelpEats24 App for a large party. I would recommend to place a phone order instead and here's why. \n\n1. Some items they offered were not on the app. This delayed our order. I had to ask my friends to order items from the app after we realized this.\n\n2. Write orders down first instead of plugging it in the app. It had been over 45 minutes by the time I was able to grab and enter everyone's order and double check them. We almost lost our order!! \n\nOne of my friends wanted to use her credit card after I had plugged everything into my phone through my yelp app. When I entered her name and credit card information under my yelp app, it prompted me to re-log into my yelp acct. I lost our order when I did so. Luckily, my Samsung S7 Edge had a back button. Somehow I was able to place the order under guest, instead of logging into my yelp account.\n\n3. It took another hour for the order to arrive. We put in 15% tip on top of the total bill of over $145. On top of the SF Health Mandate Tax. Perhaps we should've paid cash for tip. We did not receive extra napkins under special request. In fact, we didn't receive any napkins or utensils. Maybe we didn't put enough tip??\n\nOn with the food:\n\nIn my opinion, it was mediocre. Well my Tom Kha Goong Soup was not prepared right. It is quite tricky to prepare coconut milk soup. When prepared right, there's a noticeable separation in the coconut milk, with lemongrass and other spices added, the flavors are truly harmonious and this takes time. What I received tasted like sweetened milk with no hint of  lemongrass or other spices. I ate all my shrimps. It was clear that not enough time was put into my soup. I do judge Thai Restaurants by how well they prepare this dish. \n\nIf you're still reading this review, you might be thinking this review sounds more like a 2 star review. I bumped it up because two of my friends enjoyed their eggplant dishes. One even mentioned it was the best she ever had but she mentioned this after she finished her dish. I was not able to confirm, however she did finish it.\n\nThai bbq chicken was a bit on the dry side, mentioned by the one who ordered it. One mentioned the pad thai was too sweet but we had three orders for it. The rest of the dishes ordered had no complaints. From what I can remember, we also ordered pineapple fried rice, a couple of non-coconut milk soups, red curry, chicken satay and couple of Thai Iced Teas. \n\nFyi, usually rice is an additional fee at Thai Restaurants but some people have a hard time believing this until their curry dish or soup dish arrives without it. Luckily, some of us ordered and sharing is no big deal in our group.\n\nWe we're all too hangry to take pictures by the time the  food arrived. However, I did snatch one quick photo of my soup I posted under the tips section of this restaurant.", "author": "Yuri K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "Average thai restaurant located in Sunset. \n\nThey have affordable lunch deals. I believe they deliver as well? Check it out! their pad thai wasn't bad.", "author": "Danae L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-10", "description": "This is the grossest restaurant I've had the misfortune to try in SF.  We ordered a noodle soup and a fried rice dish for takeout. Started with the soup and found a very long dark brown hair tangled with a piece of chicken. Disgusting. Ditched the soup, started eating the fried rice... after more than halfway through the plate, we found a DIFFERENT type of hair (a short, coarse black strand) in it. Unbelievable.\n\nI think the flavors were decent... not that it matters.", "author": "Sara H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-18", "description": "I came here with the family for dinner. It was pretty empty, but could possibly also be due to the rainstorm and no one was trying to leave their house. The six of us weren't too hungry, so we ordered four plates to share: Beef Satay, Pad See Ew, Combination Fried Rice, and Green Curry. The beef satay only consisted of four skewers, which is quite minimal but pretty good tasting with the sauce. As for the pad see ew and fried rice were pretty classic, so you can't go wrong with it. Last but not least was the curry, which was quite unique as it was my first time having green curry. If you're into spice and coconut, this is a great option. You also need to order rice with the curry, and as someone has mentioned --make sure to get two orders of rice at least or you'll have a lot of leftover curry.\n\nWith each Yelp check-in, you get a free scoop of coconut ice cream. I liked that it was topped with some fried coconut crisps and was quite refreshing to end the meal. Overall, pretty decent spot for Thai food.", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-07", "description": "I ordered from Vanida twice during my week in San Francisco. They serve up some unbelievably delicious Thai cuisine, and EAT24 delivers it. I ordered my favorite dish: panang curry with shrimp. \n\nThe only problem was that the steamed rice doesn't come with the curry and if you forget to order it separately, you're screwed. That's what happened to me the first time with my delivery. And if you do order the rice, make sure you get two orders. If you don't, you will likely end up with way too much curry sauce and about half the amount of rice to eat it with.\n\nOther than that the taste, the seasoning, the spice level, and overall quality was delicious! Four solid stars for the food, and 3 for the service.", "author": "Helina G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "OMG OMG OMG is it enough of OMG for this Vanida Thai restaurant?  I mean seriously OMG!!  I found this little insect in my bowl of soup after I ate almost all of it.  I felt like I wanted to throw up instantly, so disgusting.  I just hope it's not more than one insect was being cooked in my soup and now in my stomach.   Bullshit place to dine at.   Plus their meat was way overcooked.  This is the worst eating place that you don't want to dine there.  They don't take good care of their food that they serve.  I guess there is a reason why it's so empty during meal hours.   People didn't know they are so bad will come here once and they will never come back again.   I think they should close their store for goodness sake.   I would give them zero star if I have that option.   A total Thumb Down restaurant.", "author": "Winnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Awesome! Lunch special is a great deal. Two selections of Thai foods for $10.95 plus a side (salad or soup). Wonderful service", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "I'm going to start by saying their lunch menu is exceptional in terms of portion size and value. You get to choose one or two items from a list of options which also includes a soup or salad. These items not only include your ginger pork or satay options, but also things like pad thai or various curries, which would usually cost more on its own anywhere else than this entire combo meal.\n\nI ordered the green curry with beef and pad thai as a two-item combo which came out to be around $12 (A STEAL!). There was so much food I honestly could have split it into two full meals had I not made dinner plans already. I particularly enjoyed the coconut milk-based soup we were given as the starter. Both the curry and pad thai were flavorful. \n\nThe one area this place needs to improve on is service. It took forever to get the waiter come write down our orders and just as long to get our bill. I typically am not a stickler about service,  but considering the restaurant wasn't even full, I can only imagine how much worse it can get with a packed house.\n\nOther than that, I definitely would come back again for their lunch menu and try their other food!", "author": "Derick N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "Had an incredible lunch here today.\n\nFirst time here and the food and service was EXCELLENT.\n\nI parked in front and then proceeded on in. I was greeted right away and found a seat near the front window. I asked for water and then looked in the menu. They have a lunch special which is good because these meals are at a reduced price compared to the normal evening hours. I was looking for the Pad Kee Moa and found out that they do have it but it called Dragon Noodles here. AWESOME.\n\nAfter I had placed my order I took time to look around the restaurant. This is very fanciful. There is not too much color or over the top decoration. It almost seems like this place is a hidden gem in the sunset. Everything about the inside is peaceful and relaxing. Even the music being played in soothing. I had a very peaceful lunch here.\n\nWhen my food finally arrived I was ready and so was my stomach. The meal was hot and tasted incredible. It seems like every time I go to a new Thai restaurant the Pad Kee Moa gets better and better but the taste stays consistent. CONSISTENT TASTE IS KEEP!!! The meal was very pleasing and met all my hunger needs. \n\nThe waitress was very attentive and nice. She refilled my water and checked on my food and myself. She did a phenomenal job of taking orders, greeting customers, seating customers, and bringing out the food. Super sweet and nice. These kinds of non verbal cues and actions will put BIG tips in her pocket. Kudos to her.\n\nIt is easy to be stirred away from this place based on some of the reviews posted but just come and check it out for yourself. I had a wonderful time.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "Vanida is a solid Thai option while in the Sunset.  \n\nThe restaurant is clean and small, with limited seating. The staff is always super fast and friendly. They seem to do a lot of TOGO orders and also offer delivery.  \n \nMost recently we ordered Pad Thai with prawns (small prawns might I add!), Chicken Eggplant, Cashew Chicken, small side of brown rice, and the Vanida Salad with Fried Tofu.  The salad was yummy with fresh veggies and a warm peanut sauce that is to die for. Eggplant was a little too cooked for my liking but the flavors were still there.  I would have never ordered the cashew chicken, but my dad really wanted it so I was down to try it. Sure enough it was the star of dinner.  Really good flavor with crisp bell pepper strips. For desert I had the coconut ice cream with toasted coconut flakes on top (complimentary with a YELP check in!). \n\nWill I be back?  Heck yeah!!", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Great lunch special, food was flavorful with hearty portions. The complimentary coconut milk soup to start was delicious. Service was quick and friendly, can't beat the quality for the price.", "author": "jessica f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "Below average food for average price. \"Medium spice\" was inedible due to heat. Paid Thai was disappointing. Coconut soup was ok.", "author": "Anthony D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "The rice was ok, but everything else sucked! I asked for beef fried rice, but gave me chicken and the chicken wasn't even cooked right. Soup was bland too. I will never come here again.", "author": "Giovanni F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Excellent quality and taste. My go to place for Thai food in the Sunset/Parkside areas. \n\nCheck this place out. You won't regret it. \n\nThe beef satay appetizer is the bomb.com. So many other good dishes, too. \n\nWhen you check in here, you get a free scoop of coconut ice cream. So yummy!", "author": "Gigi F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "Went there for dinner with my cousin tonight. When we walked in around 7:30pm there were only one couple inside the restaurant. We hesitated to go in but it was getting late so we decided to give it a try. We've ordered the Pork Thai Fried Rice, Grilled beef and Seafood Eggplant. The portion was so small. The seafood was stale and nasty. The Grilled beef was cold. The food was so bland and greasy. This place is so over price. When we were driving home, we both had a stomach ache. We almost did not  make it home in time to use the bathroom. Boy did we both had diarrhea. We both felt so sick to our stomach. Hopefully we won't end up in the ER tonight. This is the WORST thai restaurant we ever been too. Think the Health Department needs to be called in to check on their kitchen and their cleanliness. Boy this is the worst experience we have ever been to. We should have known better not to go in when we only saw one couple in the restaurant especially on a Saturday night.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-13", "description": "Ordered Pad Thai and Crispy Noodle with prawn today for dinner through Eat24. Never had the crispy noodle before so I decided to try it as it looks good on the Yelp photo review. I don't know if it's because it's Monday night, but portion is small, only has 2 prawns, literally only 2, no bean sprout as it said on the menu, teeny pieces of tofu, and that is all. For $10 plus tax, that's bullshit. I rather drive to Irving and get a really decent meal for that much. I come here almost everyday since I live just a clock from here. But for what you pay, it's north worth it. It's only convenient cause it's close. But again, I would never order dinner again here. This was the last time I order dinner here. For some reason, when I order food for pick-up, it's just meh...", "author": "Jas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "Found this Thai place on a Yelp Ad while hanging out by Ocean beach.  Very glad we decided to come here for lunch.  The place is very clean, the decor is nice and relaxing, and the service is great. \n\nThe lunch specials allows you choose from 25 items like pad thai, green, curry, spicy eggplant etc. and it comes with soup (tom ka or tom yum) or salad.  They also offer rice plates and noodle dishes as part of their lunch specials menu.   Our server was very attentive, and handled the lunch crowd with ease. \n\nI ordered the yellow curry with and eggplant dish in a spicy sauce with delicious tofu and rice.  The food was good, 3.5/4 while the 5, star service and great prices will have me back soon.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-13", "description": "I was craving Thai but wanted to eat at home, so I found Vanida on Yelp and decided to order for takeout. I got to the restaurant, the interior is very cute! Not a big restaurant, but it was simple and I could see there were a couple people here on a date. \n\nI ordered the Duck Basil and Pad See Ew with extra noodles. When one of the servers handed me my check as I waited for my food, he did not say a thing to me, nor did he make any sort of eye contact, he simply handed me the check. Umm how rude..? Anyways, I got my food and headed home.\n\nWhen we opened the food at home, I wish we had opened it before we left Vanida. First, it was a takeout and they did not give any sort of utensils or napkins. Second, the duck basil dish....literally had 2 pieces of duck in it. WTF?!?!!? 2 pieces of duck with actual meat, the rest was just skin. The pad see ew was okay..nothing spectacular. At least they actually gave us the extra noodles. \n\nI've definitely had better Thai in the city and will not be coming back.", "author": "Christine Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "I've ordered from Vanida a number of times since its a block from my house, but I've never had a 'good' experience there. It's decent Thai food, nothing great - and definitely nothing that justifies the rude employees that work there. My fiancé and I usually pick up our orders , but the last time we picked up food the employees were talking about us negatively, in their native tongue (non English), and likely didn't realize that my fiancé understood what they were saying. \n\nIt's been a little while since we ordered from them again due to this poor experience, so decided to get delivery thinking it would be better. Wrong! The guy delivering the food was another rude employee. When I opened my front door, the delivery guy hands me the bag of food and immediately says 'whoever ordered this didn't include a tip'...this is super rude. I ordered the food online and since I've worked in the food industry for yrs, I always tip cash. So for this guy to just call out there was no tip, as if he was entitled to a tip was completely poor judgment. I gave him the cash that I already had in my hand and told him to have a good night. \n\nBottom line. This Thai food is alright at best but the service gives me more and more reason to just order from one of the other, many, Thai food spots around.", "author": "Joe G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-13", "description": "Ordered Postmates. \n\nPad See Ew - too many fillers of cabbage and carrots. Bland \nPad Thai - asked for no bean sprouts and extra lime. Was given extra bean sprouts and no lime \n\nWorst Thai food. Ever.", "author": "Serena F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-28", "description": "Indifferent service by immature teens.  Bland tasteless food. Fairly decent small seating area. Good for a safe bet from stomach horrors, but that's about it.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-09", "description": "We didn't get what we ordered (takeout). They didn't put any chicken in a dish that was supposed to include chicken. And put mussels and calamari in a dish that was only supposed to have shrimp. The noodle dish was also greasy.  It overall could've been a lot better.", "author": "Breonna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-05", "description": "I ordered pickup through eat24 app:\n\nI have had an obsession with Indian food recently and decided to switch it up and break the cycle last night with some Thai food. I actually had not eaten Thai food in a couple years (because ahem I used to be obsessed with it!)\n\nI went with Vanida due to it's proximity to my house and because they were on the eat24 app.\n\nI ordered for pickup Pineapple fried rice, Pad Thai Pak, and Spicy eggplant tofu.\n\nWhen I arrived there was only street parking so I double parked with my hazards on in a side residential street. It is a small place and upon walking in, there were about six tables with people dining in. I walked to the back and picked up my order.\n\nNo disposable silverware or napkins were provided in my take out bag, which annoyed me. I guess you have to request for that? \n\nPineapple Fried Rice: This was very bland. Huge chunks of pineapple but I only counted five pieces. Three small shrimps. Maybe two and a half ounces of chicken. It lacked any kind of spice or dominating flavor. Probably the saddest thai style fried rice I had ever consumed. \n\nPad Thai Pak: All the noodles stuck together in a huge clump. Plain noodles in the center where the sauce had not penetrated. A good 15% of the dish was composed of bean sprouts. Being a veggie dish, I only counted 2 small sad pieces of broccoli. I threw most of this dish away.\n\nSpicy Eggplant Tofu: I think they messed up my order and only served me the just the spicy tofu , because this dish did not contain any eggplant whatsoever. It was also the most flavorful dish of the three with a spicy sweet and sour sauce. I actually poured this sauce onto my fried rice to give that life. Still it's fried tofu so you can't really screw that up-\n\nOverall this was not food made with any passion. I wanted to give this a try and support a local business, but with so many other Thai options in this city I am willing to keep searching for one that I like instead of returning here.", "author": "Travis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Thai food isn't something I prefer on a regular basis, besides their desserts. But Vanida Thai deserves at least 3.5 stars. The customer service is FANTABULOUS! Absolutely amazing because there was only one waiter to tend to the many tables on the floor. He seemed to take care of everyone very well! Props to him.\n\nMy friend ordered the Roasted Duck Noodle Soup with extra Chinese broccoli. After digging through the noodles a bit, she couldn't find any Chinese broccoli so she asked for more. Somehow, it was actually hidden deep in the noodles. She told them nevermind but they gave her the veggies anyway and didn't charge for it. Obviously, if he already put in the order for extra Chinese broccoli, they're not gonna just throw it away now that she found it but still. Good customer service deserves to be recognized.\n\nThey have a really good lunch combo deal. You can either choose 1 dish for $7 something or 2 dishes for $8 something and they come with either white/brown rice and a soup, either Tom Kha or Tom Yum (chicken OR veggie)! If not, they have other options. I LOVE their selection of Noodle Soups!\n\nI really enjoyed this Thai restaurant - one of the few after my Thailand trip.", "author": "Athena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "Had the pumpkin curry with prawns and chicken... and wow! DELICIOUS! One of the best I've tried (and I've tried many!). It's creamy and full of flavor. The portion was bigger than most places. Also had the pad Thai and the basil chicken. Neither disappointed either. Definitely recommend trying it out.", "author": "Norma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "I love their Angel wings!!! I really think this place should be known for these wings. Everything else is good too but my favorite will always be the Angels wings and red curry here. \nAnd you can't go wrong with mango sticky rice.", "author": "Alane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Very great food, really good flavor, and super service! I'm very picky with food and this is one of the best Thai places around, it is also quite cheap.", "author": "Nicole K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "All my experiences coming here were amazing the service the food was all amazing this to me is one of the best Thai restaurants in the Bay Area", "author": "Tadhg M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Among the things I miss about my old neighborhood in the Outer Sunset in S.F. this place is near the top of the list. I used to go there often or order for delivery, and the food and service were top notch. I'm glad to see that it's still there in case I'm ever in that neighborhood.", "author": "Kristen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "It was ok. I ordered the fried sweet potatoes, pad Thai and mixed veggies. The veggies were just beam sprouts and carrots not very good. Pad Thai was ok. I won't be ordering again.", "author": "Bobbie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Food is always delicious and fresh.  Try the Pad See Ew and fried tofu.  Their beef larb is also off the hook! Great neighborhood Thai eatery!", "author": "Roger E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-14", "description": "Have been here for lunch a few times. The food is solid, service is prompt and the restaurant is clean. It's one of my husband's favorite places.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Hey Vanida, glad to eat ya\nFor the kind of filling Thai food, I must beseech ya\nHey, eating with you is a top priority\nAin't no need to question their yellow curry \nMenu on the board, the chef of attention\nYou got mouths to swing in your direction\nHey, I like your pad see ew, you know\nVanida Thai food, you gotta put me on", "author": "Augusto M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "simply amazing!\nsuper sweet staff.. prompt service.. beautiful ambience.. amazingly delicious food.. what else do you expect from a restaurant!\nlove this place and will definitely be coming back more often..\n*seriously whoever was the chef.. thanks for the awesome food.. loved it!\n*last but not the least, loved the flower made out of straw cover on the straw with my drink.\ncheers!", "author": "Karan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "I didn't know how lucky I got when I moved in around the corner from Vanida. This place is awesome. I've never been disappointed, I've ordered from them literally hundreds of times. Try the chicken eggplant, it's my fav!\nIt looks to be a decent place to sit and eat, although I've never stayed, only take-out. The staff is always friendly.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Haven't been here since 2011 and I'm not sure why. Came here for lunch with some friends on a Sunday. It was pretty empty from what I remembered. I think we were the 3rd party in there.\n\nThe lunch deal is so worth it!! You get to choose an entree for 8$ and it comes with rice and soup/salad There's also an option to choose 2 entrees for 9$ too. I went with the green curry with chicken and some tofu vegetarian dish that the server recommended with rice and the Tom Yum soup! SUPER FILLING and SUPER WORTH IT!\n\nI highly recommend coming here for lunch. Biggest bang for your buck!", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "I went here for lunch and had the Pad Karee with a side salad. The service was really excellent and the side salad was fresh with a light, simple dressing, but the main course was pretty bland. There wasn't anything particularly bad about it, and I had no problem eating the whole thing, but I was hoping for a little more flavor.", "author": "AJ P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-07", "description": "We went in on a Sunday afternoon and it was busy but people were leaving and about 3 table opened up.  There was only one waitress working the dining room and she never said 'it'll be a couple minutes...'   We were completely ignored.  After about 15 mins of trying to be patient - we walked out.   I blame it on the owners as they have to staff properly.  At least have one waitress/waiter and one busboy person.  \n\nThe food may be good and I love supporting local businesses, but I have to draw the line, if I'm not even acknowledged as a customer.  It's unfortunate.", "author": "n y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Been coming here for years and it's still our regular spot for lunch (sometimes dinner) because it's close by our house. The food and service are both good. I like their lunch special combination. I also love their tofu eggplant and papaya salad. Today I ordered tofu Sam Rod and garlic pork and they're both very good. I took off one star because I think there is another Thai restaurant on Judah is a little better than this one.", "author": "Tien L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-23", "description": "The service and quality of this restaurant has gone downhill quite a bit. We used to come here alot since we live a few blocks away. Last friday, me and two friends came in on a friday at 7:10pm and ordered our food. We knew something was wrong when the waitress insisted on us ordering something to drink when we said we were ready to order our food. \n\nWe got three dishes, Pineapple Fried rice, Pad See Ew, and Chicken Curry Noodles. Our friend's Pineapple Fried Rice came 25 minutes after ordering. The two noodle dishes never came until we got up and left at 7:55pm. We waited over 45 minutes at this establishment for our food. We asked two different waitresses where our food was, and they said it's coming. When one of us said, \"we're leaving\" the waitress had the gal to say that our food was cooking in the back. After telling us that, 10 minutes the food still hadn't come out and so we said we weren't paying for the unserved dishes and demanded our check come in right there and then. \n\nWe also watched people come in, order, eat, and pay for the check well after we came in. There was an elderly couple next to us who stated that they got the wrong dishes, but the waitress bullied them into believing that those were the dishes they ordered. Also no less than 5 take-out orders were given before our friend's plate was given.\n\nAs we left they handed us our noodles and said that they were sorry. Too little too late. To give a time table on how quickly I can actually make those noodle dishes, is 10 minutes. I'm not a cook by any means, but Pad See Ew only takes a few minutes to make. The curry chicken only needs the curry powder and noodles and takes even less time to make. All in all, the people running the place last friday don't know how to run a restaurant. \n\nI'm never coming back here again.", "author": "Clinton L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Their garlic prawns is what keeps me coming back! Thai food is one of my favorite cuisines and I've been to a lot of other Thai places in the city. This spot is one of the few that have it on the menu and that does it well every time. Just do it", "author": "C M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "9 months later, let's hope this place didn't take a dump in the sunset. Ocean beach is dirty enough as it is now. Where to start off...when you think of Thai food. Probably one of the first thing you would think of getting on a sunny day is Thai ice Tea\n\n The Thai ice tea here: Much better than quickly of course but doesn't quite stand out when you compare it to King of Thais variant. That could be a good or bad thing. I guess it just depends on whether you're a fan of sweet teas or not.\n\nPineapple fried rice: Huge chunks of pineapple pieces in the fried rice, but out side of the little bits of fruit in it, the rice turned out pretty bland, even with the combination fried rice option. of course my appetite requires the removal of onions but still, maybe im not used to the thai version perhaps? but i still think the pineapple fried rice from Banana Island kicks this one in the crotch.\n\nOverall Result:\n-Thai Tea - Pass. (+1)\n-Pineapple fried Rice - Fail (Lack of flavoring rather than screwed up) (-1)\n-Service: Pass, they were on point. (+1)....a whole lot better than the clusterf*ck i had to deal with last time\n-Bathroom- Cleanish...pass (+1)\n\nVerdict:Would go back if in the area and if i wasnt feeling chinese food. but not the at the top of my list.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "Good thai food.  But I'm not a fan of the curry.  Have tried the Duck Curry and Green Curry which tasted too sweet for me, possibly too much coconut milk?  \nHowever, I've liked the other dishes I've gotten here.  The Pad Ma Keur was tasty, not oily like I've seen at other places.  The Crab Fried Rice is also good, with plenty of crab pieces.\nIt's a great quiet place for dinner, with great service.  Can't complain.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "I just knew that they've special every month & this month is a roti ice cream. It was awesome. The roti was crispy and the coconut ice cream is good as usual. I's really enjoy the time here.", "author": "Fan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "I finally gave this place another chance and it's pretty awesome. Where the food is actually spicy! Now addicted to their drunk noodles! Recently updated their menu and the service has improved immensely. It's now a regular stop for me after work. They do a lot of carry out and delivery so service can be a touch slow if you're here during a prime time.", "author": "Kayleen R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-01", "description": "Totally disgusted. I can pick up my entire container of pad see ew with my chopsticks. The flavor is unbelievably wrong. I have a metal flavor stuck in my mouth from this. I've ordered from Vanida Thai before and the food is ok but today, this is completely unacceptable. Also ordered garlic pork and they forgot the green sauce that makes the dish! Won't be ordering from here anymore.", "author": "Katrice S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "After a few years, with friends in town, decided to give it another shot. Walked in and every empty table was stacked with dirty dishes. They cleared off a table, and we ordered soup to start. After 40 minutes, we weren't served, not even sure the incompetent wait staff had even entered the order, we left. Never to come back again.", "author": "Scott R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "I love this place! Great ambiance, friendly staff, great Thai food. Be sure to try the garlic pork with the green sauce!", "author": "Angie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Garlic pork..with house green sauce is to die for...Thai iced tea is super strong...yum", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-17", "description": "(Review for take-out)\nThis is Thai food for people who really don't like Thai food. The dishes were bland and overpriced. I've traveled extensively and repeatedly in Thailand, and have eaten at countless Thai restaurants in the USA. Vanida's green curry had almost no basil. The Pad Thai was a solid lump of overcooked and unflavored rice noodles. The seafood eggplant was tasteless.", "author": "Phil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "Order takeout twice so far when I'm craving Pad Thai. Pretty good place. Will come back again.", "author": "La G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-29", "description": "Pretty rude service for takeout! My boyfriend just wanted to let them know he's in the area, server rolled his eyes and sais to him\" tsk\" it a not ready.\" I went to pick up the food 15 mins later and the server was rude, just was like here ..and the food is sitting on the table. In the car I noticed they didn't give me any u utensils or napkins. Seriously am I suppose To eat with my hands and wipe my mouth on my shirt. The only reason this place got two stars is because the food was half decent better then average I would say, but that rude service interaction has me think twice . You can get so much better service elsewhere.", "author": "Susan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Great service. My yellow curry on point.  Friday night's dinner service and take out was served in 15 minutes. Perhaps an exceptional experience? Nonetheless, made my night, my week and maybe even my year.", "author": "Angela F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "This is one of my favorite Thai food restaurants in the city. The service is amazing and the food is delicious. They also have free delivery! \n\nSome of my personal favorites include the curry puffs, Thai fried rice, tom khan soup with coconut milk. They have tons of vegetarian options which I love. \n\nThis is a good spot if you are in outer sunset and want some Thai food.", "author": "Little E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "Had the pad eww see noodles.. it wasn't bad. The wait times weren't so good but they throw in some salad and Tom yum soup to go. I wish they did t box everything up in a box so it's like a cube of food. The noodles were fresh however.", "author": "Selby C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-09", "description": "Dishes ordered: \n\nCombination Fried Rice.-\nOne of my biggest, biggest, BIGGEST annoyances is when Thai restaurants use chinese rice for fried rice. I LOATHE chinese food and in particular their fried rice, which is why I ordered Thai. My fried rice dish tasted like sub par chinese fried rice, absolutely zero seasoning. I do not recommend it unless you like rice mush. Pros: a lot of fake frozen squid, which I am ok with cos I like it, a lot of chicken.\n\nYellow Curry(beef)- I am not sure how much sugar one is supposed to put in Yellow Curry, but this tasted like yellow curry ice cream soup with beef. Pros: there was plenty of beef and cutely cut potato. \n\nCurry Puff- Vanida claims this is their famous known appetizer on their menu on Postmates. This was the highlight of the meal. And by highlight I mean doughy, pasty filling with a tad of flavour. No dipping sauce so used some soy and sriracha I had here at home.\n\nPrice: $35.54 not counting tip.\nThis was my first time trying Vanida and I'm good, I'll stick with Sri Thai from now on.", "author": "emma g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Food was very good and we enjoyed ourselves. We had a large group and they were able to accommodate us.", "author": "Regina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "I ordered the seafood eggplant today. It was good and I would order it again, but I'm going to request not spicy or mild next time. The default option of medium was way too spicy for me. I could hardly eat it.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "This is probably one of the best Thai food in San Francisco. Their best dish here is the garlic pork! The taste is on point and the green sauce is very unique and delicious. My partner is vegetarian and he really loves the tofu dishes. We always go here since my partner's office it's just A few blocks so when I have the day off I will pick him up to have a lunch here. Anyway, A few downside that I can say is I actually like the grilled chicken but it's a hit and miss. Sometimes I will get like a\"re-heated\" or maybe old grilled chicken. Pls be consistent and I'll give this a place 5 stars. And for God's sakes just fill up the Thai iced coffee, what is a few more ounces of coffee poured in the mason jars???", "author": "Range B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "The restaurant is clean, decent food. I'm writing this review for June, a server there, who provided us with excellent service. She was very courteous, patient, willing to answer questions and customize the order. I asked for a soup they were willing to make spicy for my preference. On arrival I found it to be too spicy and so she graciously accepted to let me cancel that order without in the least making me feel bad for it. Smiling and happy server- such rarity these days. Always be like this June!", "author": "Nutcrackin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "We live in the neighborhood and sadly, it has taken us far too long to try Vanida. After both dining in the restaurant and ordering delivery (a few times), Vanida is now our go-to, neighborhood Thai restaurant.  I highly recommend the papaya salad. I have tried it at various spice levels (a 5 was a mouth killer!) and settled on a 3 or 4 for a good kickback which doesn't knock you out.  Great service, clean restaurant and quick delivery service.", "author": "Johanna W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-23", "description": "Never coming back...never eating food from here again.\n\nThat said and done, I guess you can tell that I am not happy with this place tonight.  After a long day, stopped off here to get my usual order and a side of steamed rice to go.  Got it home and when I dumped the box of steamed rice out onto a proper plate, there was all kinds of dark, odd foreign objects disbursed throughout my box of, what should have been clean white, steamed rice.\n\nAlmost went back, but I think it's quite obvious what has happened here.  For decades, I've heard nasty rumors about asian restaurants re-using old leftover rice from tables and have always tried to put it to the back of my mind.  Not sure if that's what happened here or if someone used a dirty spatula to put it into the box, but the damage is done.  I initially tried isolating the offending bad part, but got pissed off that it was so nicely distributed throughout the whole box.  \n\nNot sure what happened...not sure I really want to know.  Anyway, I took a bunch of pictures and posted a couple here in the photo section.  BTW, as you might notice, the amount of rice on the plate, relative to the box is quite less...the reason is that I got so mad that I started throwing away the worst parts before I realized I should take a picture.  Regardless, these pictures should suffice.\n\nIn all fairness, I guess I could have gone back and they probably would have replaced it, but to be honest, why should I?  Why should I have to drive allllllll the way back there and also why should I even have to deal with this BS?  Once the trust is violated, I see no point in ever going back.\n\nBought a replacement box of steamed white rice to use as an accompaniment from another restaurant in another neighborhood close to home.  It may have been cheap, low grade rice, but it was hot, fresh, white, and clean...hell, it was like the Cadillac of white steamed rice tonight after the other rice that I got at Vanida.\n\nFood didn't quite taste the same tonight either.  Front staff was different from who we usually see too...did they sell the place?  I have no idea.  Sorry guys, I referred a bunch of people to you in the past, but you won't see me in here anymore.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-24", "description": "If I can give them 5 stars based solely on how nice the staff is, I would, but, unfortunately, that was the only bright spot of the meal.\n\nThe prices are about average to any other Thai restaurant in the Sunset area. The taste is nothing extraordinary. The portions for the entrees in this place are small, however, which makes the average price seem like a fortune.\n\nMaybe I ordered the wrong thing, but my entree was very stingy. Ordered the garlic shrimp and out comes a plate covered in a bed of lettuce and on top are 9 (yes, I counted) shrimp tossed with some garlic sauce. And these weren't big shrimp, but the size of shrimp that are served in bulk at buffets. This comes down to $1 a shrimp for this entree!\n\nGreat staff, but not worth the price. Still willing to give them a shot later on (ordering something else of course), but definitely not when I'm super hungry (just in case).", "author": "Zeia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-08", "description": "Had a late night carry out and went with their Drunken Noodle. It's one of my usuals at Thai places and hard to mess up. While I came on a Friday night towards closing, one could see the staff trying to rush (more so because of the limited staff and several people trying to get food). The gal was very friends and polite. When I finally tried the drunken noodles there was a strange alight sour odor. Wasn't sure exactly what it was and the over all dish seems really pale/light. They didn't put in enough sauce which you could tell when there were blotches of noodles still untouched by anything. The chicken was great though and overall meal wasn't too bad. Definitely not the best or standard I've had.", "author": "James L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-06", "description": "New chef? I have been eating at Vanida for 12 years or more! And I have really noticed a major change in the last few visits this past month. I like that when you ask for spicy they are going for it with Thai hot meaning lots and lots of Thai bird chilis chopped up in a multitude of color. I like the heat but I'm also noticing less flavor in the spice and herb category. Be it pad Thai, Prig Khing, drunken noodles, and Ga Prow. The green papaya salad has been on point! The veggie Tim yum is full of a wide variety of veg but has gotten way way too sweet. \n\nThe quality of the produce and meat is fantastic that has remained. The service is the same seems like sweet shy family members. King of Thai doesn't feel clean and I don't think they wash the produce before prepping and Marnee is far from this neighborhood.\n\nI will keep going back.", "author": "Carey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "I am a pick-up order regular here. I love this place. I am a forgetful & tired person so I forget they dont take amex and i forget to check my bank acct before I pick up or bring cash and had to walk back home to find an alternative payment method twice so far haha. The staff were so accommodating and were very nice about my slip-ups. I promise I'll bring the right payment next time lol!\n\nSo obviously the staff gets a 5/5 for being really chill and patient.\n\nThe food is fantastic here. They do a great brown rice, and I usually get yellow curry with chicken (5/5)  to eat with it. The yellow curry is a little spicy and I dig that. \n\n I also recommend the garlic pork (5/5). the pork and the green sauce that comes with it are both delicious. get it with rice. \n\nangel wings (4/5)  are nice and crispy. \n\nPad ma keur (eggpant) also gets a 5/5. w/rice\n\nIf you come here at lunch, you can get several choices with a side of salad and rice or pad thai for like 8-10 dollars or so (I think).\n\ncute place for a date, good lunch deals, and pickup time is usually 10 minutes!", "author": "Rose M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-06", "description": "they used to be really good, but the meals have been not so good lately.  Recently, we got a mango rice dish (thats normally good) and it looked a little rancid, it was gross.  Sometimes our dishes were burned, and they seem to be skimping out on varies things now....unfortunate, this place used to be pretty good.\n\nThe hostess/waiting staff is really good though.", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "I come here often and the food is always solid. Love the pad kee mao and the curries are excellent. Don't forget to use the check in offer for free ice cream!", "author": "Edward H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-05", "description": "The red curry was awful. It tasted like it had sand in it and the flavor was super off. I ordered a red curry with tofu, side of rice, and side of veggies and all of it was tasteless with the most obscured textures. Save yourself the hassle and hit Thai Cottage down the street.", "author": "Lindsay K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "Ok, I live very close to Vanida Thai Kitchen so I've had the opportunity to come here a few times and finally give my impressions.\n\nThe interior of the restaurant is nice and comfortable, a fairly small interior but nicely lighted and decorated. Clean feeling. The wait staff is also friendly.\n\nSome interesting dishes include the Mee Krob (crispy sweet noodles with prawns). Although I'm not a big fan of sweet appetizers, it was still interesting and something I've never had before. I am a fan of tofu, so I also enjoyed their Tofu Tod. Thai French Fries were also worth trying.\n\nTheir curries and noodles are also all tasty, and portions are generous as well. Everything's plated nicely, and they offer delivery too which is convenient. All ingredients taste fresh as well. I've yet to order anything that was straight up bad.\n\nAll in all, great experiences here so far. Definitely an above average Thai restaurant.", "author": "Melody S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "Thai French Fries, ordered from the vegetarian appetizers part of the menu, were made from wedges of yam in a light batter coating and served with sweet peanut sauce. The yam was done perfectly - firm yet soft. Of course, the sweet peanut sauce was just the right combination of sweet and sour. The menu states they only use healthy oil without trans fat and just slightly saturated. So, I didn't feel any guilt eating all the Thai fries. \n\nReminiscing about my favorite adventure writer, Jack London, I decided to order the duck curry. It was a great choice. There was an unusually generous portion of duck in the curry and every bite of the fatty meat was delectable. Combined with the brown rice to soak up all the curry, I didn't leave a morsel for any mouse.\n\nWhen I ordered a glass of cabernet sauvignon, the waitress thought I said curry noodle! I gave her a very punctuated English lesson about cabernet sometimes being referred to as \"cab\" like a taxi. I think she sincerely appreciated it. I was worried that the cab was going to be from a stale bottle, but it was fresh and a generous serving.", "author": "Ken R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "This place is under-rated and not too many people that I have talked to know about this place. I only have been here about three times but if I could I would go everyday especially since they offer a sort of happy hour type deal until 3. They have really good deals where you can order two things from the menu as a combo and still get a soup and a scoop of rice. I really liked their eggplant basil and crispy rolls. The soup was ok, I think too creamy for my taste buds. The server was pretty nice and was very mindful about checking to see if I had enough water. All in all, I will be back again.", "author": "Desiree C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "Food was hot when we got it. Good service. We ordered the Chicken Satay, Yellow curry and Pad Thai.  Yellow curry has good coconut favorite, a little sweet for my taste.  Pad Thai has good favor. Will come again.", "author": "Christin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Had the roasted duck noodle soup for lunch. Broth is flavorful and duck pieces are delicious. As expected in a traditional Asian restaurant the duck does have some fat and skin. Waitress was very pleasant.", "author": "Raul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "This is one of my favorite Thai restaurants! I usually only eat here during lunch and there is never a wait. I always order the lunch special for $8.50, which comes with soup or salad and a choice of two different entrees. The portions are good enough to fill me up and most of the items on the menu that I tried, I enjoyed. The ground chicken ga prow is a favorite of mine that I get literally every single time I eat here. The pad thai is also one of my favorites here.", "author": "Andy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "This is a nice little place.  They have good vegetarian options, if that matters to you.  Pleasant atmosphere, courteous service.", "author": "jonny s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Something has changed.  Prices are 20% more... Food portion looks smaller.   Thank God it is still tasty.", "author": "william f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-12", "description": "My buddy and I needed a place to grab some grub after getting our drink on at the Yelp event in Potrero Hill.  We had originally planned to eat at Vanida Thai in the sunset before the event and decided to stick with the plan afterward.\n\nI ordered the lunch special with 2 items and got the green curry with chicken and peanut sauce beef.  The meal started off with a cup of their creamy tom kha soup with chicken and I found it to be pleasantly extra creamy but didn't really like the sliced onions in it.  The entrees were a decent size and I enjoyed their peanut sauce.  I got a really big piece of cartilage in my beef though and the curry came out really spicy but kind of bland and I would pass on it next time.\n\nOverall I wasn't all that impressed with Vanida.  The food was mostly meh and the service was very rushed since I guess they were wrapping up for lunch and I ended up paying for our meal in the middle of it.  I might have come at a bad time, but for my money I will go with King of Thai Noodles next time.\n\nFood: 4/10\n\nService: 5/10\n\nPrice: $\n\nAtmosphere: 5/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-17", "description": "Too lazy to cook and too lazy to eat out, I ordered take-out from Vanida Thai Kitchen.\n\nThe minimum purchase of $17 for free delivery was not bad. However, we waited 50 minutes for our food to arrive. We were starving!\n\nThai French Fries (http://www.yelp.com/biz_photos/uauHhqLPVP0ug-_qCzzT9Q?select=4Krzl021-bYj2gbMcpAzHA): $6.50. Deep fried yam in coconut butter, served with spicy sweet and sour sauce. I imagined the yam in the form of fries, but instead it looked like tempura. Nicely battered and fried, the yam was soft and sweet. The sauce was not needed, but added tanginess to the yam.\n\nDuck Curry (http://www.yelp.com/biz_photos/uauHhqLPVP0ug-_qCzzT9Q?select=T_t3gQ_NR528f_WEICYDyg): $8.95. Boneless roast duck in spicy red curry with tomato, pineapple, bell pepper, zucchini and basil. Being that my mom cannot handle spicy foods, the mildness of the curry was perfect for her. For me, it was disappointing since it did not taste spicy at all. The portion was quite small and the curry was thin. Despite all that, the curry was the best dish of the night.\n\nPad See Ew (http://www.yelp.com/biz_photos/uauHhqLPVP0ug-_qCzzT9Q?select=g80-9doI2fHnCMndcQPKGg): $7.95. Stir-fried rice noodle with chicken, egg, Chinese broccoli in soy sauce. A simple dish, yet this one came out extremely dry and bland. There were only pieces of chicken, and hardly any egg in sight. \n\nTotal came out to $29 with tax and tip. More than I'd like to pay for small portions, decent flavors and a long wait.", "author": "Marti L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-10", "description": "Came here cause we could not find parking near out first choice restaurant.  The servers were very nice and we got seated quickly.  Ordered the tom kha for 2, pad see ew with beef, yellow curry with chicken, Thai iced tea and 2 scoops of rice.\n\nThe thai iced tea came with a cute little rose made of the wrapper, nice presentation.  You really cannot mess up thai tea and their was nice and strong.  The soup was yummy and just enough to start dinner on a good note.  The other two dishes were not too great.  The yellow curry was way too spicy.  We ordered the yellow curry so we could feed our toddler but it was too spicy for even us.  Every other restaurant I've been to, the yellow curry was nice and mild.  Also, the potatoes were undercooked which is a no-no.  The pad see ew was lacking flavor and the beef and chinese broccoli was undercooked.  \n\nI would try them again for the lunch special and maybe order other things that people are raving about like the garlic pork...", "author": "Maria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "Vanida Thai Kitchen is a great option for Thai food. The outside looks dated but inside is a clean, modern, cozy restaurant. For couples or small groups, it's a nice place to eat-in, or pick-up is fine too which is what I did. The surrounding area is generally residential so just drive around and you'll be able to find some parking. I picked up: \n\n- Tom Yum Gai: A let down! The soup had all the right tom yum fixins but it lacked that sour heat element. I like tom yum soup that makes my mouth pucker and no puckering here.\n\n- Pad Kee Mao (Drunken Noodles) with beef: Delicious. The noodles were a bit thinner than those I've had in pad kee mao dishes but the flavor was spot on. \n\n- Garlic Pork: They nailed the garlic flavor. The meat is tender and the Vanida green sauce is like a Thai chimichurri. It's herby, citrusy, salty, a little sweet and with some spiciness. It's the bombdotcom, and trust, I was dipping my beef from the pad kee mao into the sauce. \n\n- Duck Curry: The curry was flavorful and had a good spice level. There were ample pieces of duck (skin included...yumm!) but the dish had a little too much pineapple. It surprisingly wasn't overly sweet because of the pineapple. Still a good option if you want curry.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "I love this place! This place always amazes me! Great food, awesome service and never had to wait for a table. \n\nEvery single dish is full of delicious spices . The curry, fried rice, chicken dishes....omg, they are finger lickin good! \n\nParking sucks so you're better off just ordering take out.", "author": "Annette F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Nice neighborhood Thai restaurant. Order delivery from Yelp often and they offer excellent customer service. Forgot to pack my Thai iced tea one night when I picked up my order and they offered to deliver it to my house. Would recommend the angel wings, pad see yew (Thai spicy), and any of their curry dishes.", "author": "Sophia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "The service was friendly and I really like that they have a lunch combo for a really fair price (two items for like 7 bucks). Also comes with your choice of a salad or soup. I had the chicken yellow curry and the garlic pork. The curry could have had a bit more flavor for my liking and I really enjoyed the garlic pork, especially the green sauce that it comes with. I think I'll come back to try some of their items in the near future.", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-17", "description": "Good thai food.\n\nTom Yum noodle soup was yummy. Wasn't too sour like other places.\n\nFried calamari was good. It was seasoned and lightly battered. \n\nPad thai was well made. Meat was cooked perfectly, I hate it when I get super over cooked meat in my pad thai. \n\n\nService was very polite. \n\nI always forget about this location becase it's a bit out of the way.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Very friendly staff, reasonable price, place was clean and comfortable, food was good.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "This was my local Thai restaurant and wanted to give this place a try because of that. The place was small and the restroom was inconveniently placed. They squeezed so many tables together that one is bound to hit the table next to the which one is sitting when sitting down or getting up. \n\nThe food is pretty good, just need to know what to order. I would stay away from the seafood. The seafood that I had ordered tasted more like fried tofu than fish. And there were a couple other plates that could had been better.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Vanida is delicious and affordable. (One time I was in there and they gave me a free bottle of wine!)", "author": "Kyle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Vanida is delicious and affordable.  One time I was in there and they gave me a free bottle of wine!", "author": "Laura P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "Ordered an array of lunch items through Caviar for a business lunch--\nFood was for the most part edible-- but the veges in the Tom Kha soup ( 8.50) \nwere spoiled ( baby corn) and  broccoli had quite a bit of yellow. I didn't realize corn was spoiled until I wasmore than half way through soup, as I usually save the baby corn for last -- and now my tummy is feeling terrible-- I am afraid it spoiled the broth ..... This was a tofu and vege soup and there was about 4 small pieces of tofu-- so in short-- not good and too much money for what I got. When a place serves spoiled food that's the end for me --", "author": "Alexandra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "This place is delicious. My boss orders from here each time we have a work event/meeting. It is the highlight of my day each time.\n\nThe Pineapple fried rice is the best I've had. I usually go to Marnee Thai and it's great there too, but something about the texture and the soft clumps of rice that just work for me, every time! That usually gets devoured the most I also enjoyed the Pad Sew (not sure what it was called). It's tasty here, wish I would've known about it sooner!\n\nParking isn't bad, it's street parking but since it's in closer to the beach, it's not overcrowded like how it would be in other parts of the city.\n\nHappy eating!", "author": "Sweets N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Good Thai food, nice staff, and decent prices. Knocked one star off bc of recent experiences. One time, I chose a side of soup but received a salad instead. The waitress insisted I ordered the salad even though I specifically asked about the kind of soup they had and never even said the word \"salad.\" Another time I had dinner with a friend and ordered pad see ew. \"Chicken?\" asked the waiter. \"No, tofu,\" I said. Pad see ew came with chicken anyway. The waiter first said he wouldn't charge us for that order due to their mistake, but ended up just giving us a complimentary dessert (totally fine). And just last night, I ordered food to be delivered - pork eggplant, but AGAIN got chicken. A little frustrating!", "author": "Krizia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-21", "description": "This place is so far only the people that live close by would eat here.  Nothing special but the service was good.  I would not drive here for this though even though it's more cost efficient than Osha.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "Most of the dishes on the menu are only average but have you seen the prices. Lunch at a Thai place staring at $6.50 is hard to beat plus it is close to my house. \n\nAs you might have guessed my family ordered a few lunch combinations: \n\nGa Prow - my favorite; I wanted to eat the entire dish but decided to be generous and share \n\nRed Curry with Chicken - not great\n\nPra Ram - least favorite of the family\n\nGai Yang - chicken was tender and liked the spicy sweet & sour sauce\n\nPad Ma-Kuer - not great but we needed some veggies\n\nAll of that to feed a family of five with a couple boxes of leftover. This place is affordable and have a couple decent dishes.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "Just a great little place in the little \"Restaurant Row\" of the dear little Outer Sunset.\n\nEvery dish the wife and I have ever had there has been fantastic. We can only opine on the vegetarian options.\n\n* Curry Puffs, which are deep fried taro, are rightly renowed. Yummy and very satisfying.\n\n* Papaya salad: Just terric, though the excessive dressing forms the South China Sea at the bottom of the serving plate.\n\n* Tofu Satay: Nice job of getting char marks and grill flavor on skewered tofu cubes. Good peanut sauce.\n\n* Thai French Fries. Like the Curry Puffs, this deep fried dish is deeply satisfying, the kind of dish you can really sink your teeth into. The coating is fresh and crisp, like well made tempura. Yummy sweet dipping sauce.\n\nThe service is warm and efficient, and the atmosphere is simple, pleasing, and relaxing.\n\nA winnah!!!", "author": "Duke E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "TL;DR: solid choice for a mellow, intimate meal with fresh ingredients, traditional fare and  good service. Too bad they close early during!\n\nBeen here for dinner and really liked the salmon panaang. Went for lunch today. LOVE the lunch specials. 2 item combo for $8.95 and added $1 for brown rice, which includes tom yum or coconut soup. \n\n\nI got the shrimp and tofu. Well spiced, flavorful and authentic tasting. Ingredients seem fresh, incl the veggies. Good portions. Service on point and never had to flag down server (big in my book when they're proactive).", "author": "Jason N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-16", "description": "I have never written a review for a restaurant before, but I feel compelled to write a review over the treatment that Vanida gave myself and friends. My girlfriend and I have lived in San Fran for about 3 years, and we have been ordering from Vanida occasionally, totalling about a couple dozen times. The food is good, the delivery time is reasonable. \n\nFor my birthday, we decided to get Vanida for delivery. We ordered two curries, one mild and one medium spicy. We also ordered drunken noodle, which is not supposed to be spicy at all. There was no indication on the menu that it was spicy. We also ordered the drunken noodle from their restaurant several times before, and it was never spicy. When we got the food, EVERYTHING WAS LAVA HOT SPICY. My girlfriend and I like spicy food, so spicy is not normally a problem for us. But our friend could not eat spicy at all, and she was the one who ordered the drunken noodle. We could not even eat the drunken noodle, it was pure fire.\n\nOf course we call to complain since our friend could not even eat the food that she paid for. The staff was extremely unapologetic. I believe they said, \"Other people ordered these dishes, and they didnt complain it was too spicy!\" After talking for a couple minutes (really arguing and defending), they finally redelivered the food about an hour later... with the condition that we return all the previous food that was too spicy. The delivery driver was also on the band wagon that it was all our fault. When he delivered the food, he insisted that \"next time, ask for not spicy at all\".\n\nSo remember Vanida customers: If you do not want your food to be inedibly spicy, you MUST ask for non spicy. Even if you like spicy food normally. Even if you the menu says that it is not spicy. Even if you had ordered it several time before and it was not spicy.\n\nI worked in a restuarant for seven years, so I know the standard operating procedure when it comes to dealing with customer complaints. The way that they got so butt hurt about it leaves a bad taste in my mouth (pun intended). Will not be ordering from them again (good job Vanida!)", "author": "Neville B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-20", "description": "I used to come here 20 years ago- it was my initial delving into Thai food. Unfortunately, the place has changed over time - probably a rotation in staff - and we won't be returning. My favorite had always been the corn cakes (Tod Mun J) but they've changed the recipe over time and it's no longer outstanding. The entrees were acceptable, but the service was highly inattentive, even though there was only one other party in the place. We waited for everything, all the way to waiting for the bill. It was like being in a bad Chinese food restaurant. It did not have the pride of a family restaurant - it seemed like they'd much rather be doing something else. With the tone of other reviews here, they may get that opportunity. Such a loss.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "Good Thai food. Fresh & tasty ingredients. Prompt and friendly service. Lots of take out orders wandered through while I was eating my dinner. \n\nQuiet, except for the top 40 radio station (ugh)\n\nI will eat here again if I'm in the neighborhood.", "author": "K H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "This place is pretty decent for something that's literally right across the street from where I live. Idk why I never gave this place a try until this year! \n\nI like that they have a vegetarian menu. My mom goes on her vegan streaks from time to time and this is a really nice place to go to when we have our dinner dates. \n\n-  Calamari is delicious. It has a nice crisp to it and it's served along side a sweet and sour sauce. \n\n- I absolutely love Tom Yum soup. I get the Tom Yum Goong which is with prawns.\n\n- I don't eat curry much, but when I do, I always order the yellow curry. I specifically order the Tofu Curry from the vegetarian menu just because I love love love tofu :)  i'm also not a big fan of having chicken or prawns in my curry anyway because its usually very dry, which I don't like.\n\n- I ordered the Duck Basil before which is duck sautéed with chili, garlic, bell pepper and basil. It was good, but the whole dish consisted mainly of bell peppers and not so much of the duck. \n\n- Pad Thai and Pad See-Ew are also great dishes. Nothing special, but these are usually the dishes i order when i eat with more than two people. \n\n- The Pineapple Fried Rice is the dish i ALWAYS get for myself when i'm here =] I think i have a little obsession with pineapple...haha! they definitely don't skimp on the pineapples in this dish. Super sweet chunks of goodness! \n\nOverall, i definitely see myself coming back here to eat every now and then for as long as i still live across the street from it!(: Service here is very quick and the waitresses are very sweet.", "author": "Anh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "Yums: tom yum soup, pad thai, spicy ginger tofu. \n\nCould be yums-ier: the lunch salad.\n\nService is fast. Small place, but I liked how clean it was and that the music playing in the kitchen was fun and audible in the dining area. \n\nI'd go back fo' sho'!", "author": "Monica D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-11", "description": "On all other occasions I would have given this place 4 stars, but I had the unpleasant experience of finding a long black hair in my sticky rice. I can't think of anything worse than paying for food and getting all the way home only to find your food completely inedible. \n\nWhen you pay money for food, you expect and trust that it is sanitary and you shouldn't have to fear that there will be hairs in it. I'm truly disgusted. Sadly, despite enjoying my other visits to Vanida Thai, I will not be returning. \n\nClearly the food Gods hate me, because this same experience happened at Chipotle. Sigh.", "author": "Justine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-26", "description": "Vanida used to be my to go spot for Thai food but over the years their quality has been slowly declining. Their flavored just aren't as robust as they used to be and lack that special touch they used to have... They have also become more and more skimpy, I used to be able to be full off of one entree but now I need one and a half.", "author": "Allen Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-12", "description": "This place is pretty good flavorful dishes and inexpensive lunch special. Will def be returning since its way better King of Thai that I usually go to for Thai food in the neighborhood", "author": "Theresia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "This place is a small, cute Thai restaurant in the Sunset. Yes, parking is always a problem here as is anywhere else in the city. The inside is colorfully decorated with lots of things to look at. I always love looking at the things hung up in restaurants. Guilty pleasure perhaps?\n\nWe were seated right away. I was surprised that it wasn't that busy on a Friday night, but that's okay since I was hungry! Our waiter was very nice and helpful to some of the people in my group who hadn't eaten Thai food before. However, there was a waitress there who seemed really irritated with every little question we asked her. (Rolling eyes, just a very 'I don't want to be here' attitude, etc) \n\nThe food here was good Thai food. I tried a little bit of everything: pad thai, baby corn chicken, eggplant something??, yellow curry, and sticky rice with mango. Wasn't disappointed at all; it was all really good! The pad thai was a little drier than I've had before, but it wasn't that big of a change to make me not like it. The sticky rice and mango was a delight! Such a refreshing dessert, hands down one of my favorites. At Vanida, it was decent as in it hit the spot and I was satisfied but not the best I've ever had. \n\nOverall, other than that one waitress, it was good dining experience.", "author": "Priyam D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-19", "description": "Tom Yum Goong Soup was horrible! It was way too salty, too salty to eat :/ I ordered it spicy and it was barely spiced. Good fried rice though. Disappointing place. I hope you have better luck with your delivery.", "author": "Aditya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Ok, this place has turned around.   \nThe food is back to the quality that it used to be.   \nThis is a must go Thai spot.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-17", "description": "My friend and I were in the neighborhood yesterday and decided to give Vanida a go! We Yelped this place before hand, and it seemed to be a relatively good place, however we were quite disappointed with our experience! \n\nWe arrived around 6pm on a Tuesday, with only 2 other parties there, just before the dinner crowd. The decor is very cute, ethnic paintings are displayed on a burgandy and cream wall. \n\nI ordered the Pad Thai and substituted the prawns for beef, and requested it to be \"medium-spicy\" and an iced Thai tea. My friend ordered the Pad Thai (as is) and the Yellow Curry with chicken. By now, almost all of the tables in the restuarant were full! \n\nMy Pad Thai was eloquantly garnished, however the taste was underwhelming. It was under-seasoned, and needed more salt. I was very disappointed that there was no spiciness at all whatsoever. My friend agreed that the Pad Thai wasn't the best, however I must say that the Yellow Curry was flavorul and spicy. \n\nAs for the prices for dinner, I was very surprised how small the portion was for the price! The Pad Thai was $7.95 and the curry was $7.78. NOTE: the curry does not come with rice!!!! You must purchase rice on the side for $1.25 per person! I found that to be very odd, usually curry comes with some rice on the side. \n\nOverall, I had high hopes for this place, however was very disappointed with the quality and quantity of food provided. For a $10 dinner, I could have gone to Panda Express and ordered much more food! \n\ntl;dr - If you're going to order a curry dish, you need to purchase rice on the side! It does not come with it!", "author": "Alissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-14", "description": "Phone ordering is problematic. They stopped accepting web orders long ago. \n\nLong time loyal customer, loved Vanida. Used to order almost weekly. \n\nAs of December, I can't get an order through. The person who now answers the phone doesn't understand me (not a problem in the past 3 years) and hangs up on me, or leaves the phone on the counter for minutes at a time without a word.\n\nBizarre, but I now have to find a new Thai restaurant, despite the delicious food. \n\nVanida, your phone problems are costing you a long time customer.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-20", "description": "With decent reviews and close by, the boy said we should try a new place for Thai food- so we stopped by here. How this place has such high ratings, I don't know.\n\nWe started with the Thai French fries which were not fries at all. They were round slices of yam, some cut so thick that it still seemed raw. Batter used seemed more like tempura.. More fritter like than fries. False advertising! \n\nWe then shared the Pra ram with the mixed veggies and a vegetarian pad Thai.  Pra ram sauce was chunky and okay.. veggies in the dish were not fully cooked and was hard to eat. As for pad Thai, same undercooked veggies and the sauce was just bland. as the boy put it, maybe we just ordered their worst 3 dishes. Who knows.\n\nThe interior is very nice and service was good, but food was straight up disappointing. I expected a lot more based on reviews. Will not be coming back.", "author": "Katrina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-18", "description": "So just got some food to go. After looking at a few of the pictures and reviews from everyone. Garlic pork looked amazing, so I went for that, some soup, and angel wings. Wings were good (marnee thais do kick their butts a bit though) and the garlic pork does not look anything like the pictures on here, which were all juicey/saucey looking. It was; tastey, but only the slightest garlic flavor. Just not what I thought it was going to be. I'll give them another go.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "Haven't actually been to the restaurant but I get Vavida for take out and it's delicious. The pineapple fried rice is bomb but could use more pineapple. Chicken wings are okay and pad Thai is pretty good. Good Thai food of you're looking for it in the sunset.", "author": "Anastasia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "Cute lil' Thai restaurant in the Outer Sunset that I just found out about through Yelp! My boyfriend is a vegetarian & we were needed more veggie-friendly options. They have a whole section for vegetarians! Yay! \n\nFood & service was great. The restaurant was going to close within an hour, but the servers were still friendly & allowing people to come in (some places give you dirty looks). I had the Tom Yum Noodle Soup. It was delicious, but only had 2 shrimps & it wasn't that spicy. My boyfriend has the Tofu Cashew Nut with veggies & it was delicious as well. The sauce was on-point & I kept eating his food. \n\nServers checked in with his and did not rush us. Decor was nice & parking was easy (well maybe it's because it was at night). \n\nI'd come back again!", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Prices were good. Especially considering the plates were very tasty! The $1.50 Tea was BOMB, and free refills. Overall this spot really gives you more bang for your buck, and you'll leave not regretting anything.", "author": "Dayne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "I went to Vanida Thai for lunch, there weren't that many people around so we were seated quickly.  \n\nI had the curry noodles with chicken.  The food arrived long before we would start wondering where it was.  The curry noodles tasted great, nicely spiced without too much curry.  My only complaint was that the portion size was rather small.  I could have eaten a lot more.", "author": "The Bottomless Pi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "The best Thai Restaurant!!! I get sad when the food is not good... But this restaurant is the bomb!!! The Garlic Pork with the house green sauce, pad see ew, pork yellow curry, and chicken basil. The best that I've had!!! Hmmm...hmmm!!! I will definitely go back!!!", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-26", "description": "4.5 stars! Overall great taste, cute decor, good service. Nice. \n\nWe ordered the Chicken Eggplant, and Yellow Curry with Prawns. The flavor was yummy and the ingredients were fresh. Presentation was good, but not fancy extraordinary. Nonetheless, I love this little place. \n\nFor dessert, we had the deep fried banana with honey! YUM! exactly what i was craving! However, I've had better at another thai place, probably because they cut the banana at an angle so the ratio tasted better at the other place, but here they cut it horizontally. But those are just my quirks.\n\nThe only thing is that the bill came out larger than I had expected. Still relatively cheap though.", "author": "Josie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-07", "description": "Vanida Thai Kitchen is the only option for good Thai food around this area and thank God this place is absolutely a gem. Along the lone restaurant row of lower Taravel St. This place is the it place if you need a family owned good Thai joint, on the outside it looks like the rest but in the inside with clean decor, minimalist yet inviting tables it is a perfect place for a date or with good friends. \n\nThe food is awsome!  Lunch special is a must for the local Sunset folks .. next best option may be to go either to King of Thai for street food style up on 28th Ave. or Sloat, but why bother when the perfect place is right here. \n\nThey have good mix of the usual Thai fare, from Pad Thai, Yellow, Green, Curries and specials include Salmon and interesting coconut concoction. Vanida Thai is spot on for good, comfort Thai food. You never know a gem in the middle of residential Sunset area until you go in.", "author": "Eui O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "When I'm lazy and don't want to leave the house for dinner. I always grubhub.com VTK for delivery. Items I have ordered:\n\ntom yum noodle soup- yum\npad see ew with chicken- yum\ngarlic pork- so good especially with the dipping sauce\npad thai- meh\npineapple fried rice-bland\nchicken satay- moist\negg rolls- it's usually good but the last time was doughy (under cooked maybe)\nfish cake- yum\nangel wings-yum\npapaya salad- fresh and light (get the dressing on the side unless you like it drenched in it)\n\nAs for service...I've never dined in at the restaurant but the delivery guy is always friendly.", "author": "Jo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-22", "description": "I've eaten here for lunch and dinner and the food is decent.\n\nI never had any issues with waiting because every time I've been here, there were always tables available.\n\nService is decent. They check in on you to make sure you're satisfied with the food.\n\nMy recommendations:\n- Lunch combinations: you can choose 1 or 2 entrees along with rice and soup/salad. Some of the entrees have an additional $1 charge.\n- Tom Kha soup: this restaurant does a good job on making my favorite Thai soup!\n\nOverall this restaurant is pretty good and I would come again to try out more of their dishes. However, I do have other Thai restaurants that I prefer to go to more.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "I love this place. They have great lunch specials and generous portions. The only thing I would comment on is that some of the curries are not always consistent and there always seems to be new staff who don't know the menu well but don't let that discourage you from eating here! It's great!", "author": "Natasha D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-27", "description": "I've lived a couple blocks from this place for years but I don't know why I've never tried it. \n\nMy aunt and I randomly came here for lunch and was pleasantly surprised at how nice and clean it looked on the inside. The lunch menu deal was so cheap! 6.95 for 1 item or 7.50 for 2 items. Both with either a salad or soup and rice. \n\nI got the fried eggrolls and pad thai. They gave me 2 eggrolls cut in half and they were pretty good. The pad thai was alright. Kind of dry for me and for a pad thai with shrimp, it only had one shrimp but then again this is pretty cheap...\n\nOne of the favorite thing was how they fold the wrapper of the straw into a rose. It was such a cute touch. They even do it for the to go thai teas. And the thai tea was really good, not too sweet or bland. \n\nOverall, I would come back if I'm craving thai food and don't feel like venturing too far. Probably won't get their pad thai but hopefully their other stuff is better. I saw that they have free delivery which seems pretty awesome on a lazy rainy day.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "Great food, prices and service. Parking is usually good but this is the City. \n\nI'm in a mixed marriage, vegan and omnivore, and we are both happy here. I can't recall a bad meal in the dozens of times we've been here. Even the one street crazy was entertaining. I'm a very satisfied diner.", "author": "Art R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-18", "description": "Yeah, seriously, wow.\n\nI lived right down the street from here, a good three blocks away. To be honest, it was the best Thai food I've ever had. The Pad Thai was fantastic, and the peanut sauce is remarkable. \nThe restaurant has a nice aesthetic, they provide generous portions, with very good food. Definitely check it out. \n\nAnd yes, vegan friendly,\n\nEnjoy it, and as always, think before you eat.", "author": "Travis J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "Vanida offers very good - if somewhat pedestrian - Thai food. I should begin with the note that I'm a bit spoiled, having previously lived in the Thai Town neighborhood of LA, and experiencing some of the best, authentic Thai food around. That said, Vanida does a great job at what they do.\n\nAnd what they do is a slightly more accessible Thai offering. You can get the standards - Tom Yum or Tom Khai soup, curries, Pad Thai, sticky rice and the such. They do all of these items well - very tasty, high quality ingredients. \n\nThe restaurant has a nice ambiance, and their delivery time is pretty decent. Friendly staff makes the experience good, too.\n\nI'd add an extra star if they added more of the adventurous Thai items to the menu, and also if they amped up the spiciness. But it's a good place that I frequent often, check it out.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "3.5 stars (4 for service and cleanliness. 3 for food) I came here for lunch after staying at a friends house. We wanted something good, but not too hearty so we decided to go here for the lunch specials.\n\nThe lunch special prices were very reasonable. I opted for the 2 selection combos so I can try more one thing since we weren't doing the typical family style. I got the pad thai and the garlic pork, which was served alongside with rice and an option of soup (tom kha or tom yum) or house salad. The plates are pretty big. I was only able to finish half of my order. My friend ordered the satay chicken, and her portion was as big as ours. I really enjoyed my garlic pork. It was marinated very well and was accompanied with a cilantro/lime type of dipping sauce. The pad thai was good, but I'd had better. I felt that the noodles were slightly overcooked, so it stuck a lot more. \n\nService was great though. The waitress was really friendly and always kept our waters filled, which is really appreciated after a night out. Overall quality of food and prices, I'd recommend this place.", "author": "Vi L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-16", "description": "I stopped in here after work completely starving. I ordered the Pad Thai but there was no peanut sauce or peanuts in sight (or taste). All I got was a big clump of noodles left over from the bottom of the pot with a side of cabbage and bean sprouts. The noodles had almost no flavor and I could pick up the whole clump with my fork. Should have gotten a burrito on my home instead!", "author": "Manuela R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-25", "description": "It's a high 3. Very close to making it to 4 but it lacked a bit of punch that I am accustomed to at a Thai place. The food came out very mild even when ordered Thai hot.\n\nWe ordered \nMiang Kum ( 4stars) \nroasted sweet coconut, sliced lime, red onion, ginger and cashew nut, all served on a spinach leaf with a side of tamarind-Ginger syrup\nRed curry Tofu\nThai Fried Rice\nA beer and an Iced tea.\n\nAll tasted pretty good but nothing extraordinary. They have a huge selection of veggie appetizers...definitely will go to this place when I am in the neighborhood.", "author": "Ravi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "Love these guys!\n\nNot calling anyone a liar, but I when I read some of the recent negative reviews they seem like they must be talking about another place. The inside of this little place is very clean and charming, and every time I call to order takeout the person who answers gets my order right, and doesn't even hesitate when I ask for \"No fish sauce\". Also, a note for fellow picky eaters like me: Many Thai recipes traditionally feature fish sauce so if it kind of grosses you out (or you want to be able to keep left overs in the fridge) you can order it without and these guys won't sneer!\n\nI usually order lunch to go from Vanida, their lunch specials are all around $7 I think and are pretty generous portions for that. My personal fave is Chicken Cashew, amazing! I have definitely had weeks where I had Chicken Cashew from Vanida 4 days in a row, too tasty and too good of a deal. \n\nBottom line: If you are in the Sunset and hankering for some tasty lunch for less than $10, check these guys out!", "author": "Jon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "Just got my order via Eat24. This place is fantastic! Chicken and beef satey was juicy and tender. Portions very generous too. Rice, Pad Thai, and my Tom soup were superb. And delivery in 39 min or so. I think I will be ordering a lot from this place.", "author": "Laurie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-16", "description": "This place was mediocre at best before...Mostly came for the low prices. I really enjoyed the Tom Yum Gai- until I just so happened to find a cockroach in it! Luckily I looked at my spoon before my bite!  So sad because I really liked that soup. Got my \"meal\" for free and left feeling hungry and disappointed... And pretty grossed out. Come on Vanida! I was rootin for ya!", "author": "Nicole K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "get the mango curry\nvery high quality food\nnot full of grease floating at top\nalways come here!", "author": "Aditi A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-25", "description": "Vanida was to be really good a year ago. But now, it gets worse and worse... we even got sick for the last two times after having dinner there.", "author": "June F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Most underrated thai restaurant in the city. Service is on point, atmosphere doesn't get better, and the food...unmatched. I've lived a block away from this establishment for 4 years and I haven't been let down once. The menu is updated frequently and it's always a pleasant surprise when I try the new items. Recommendations: vegetarian food. Drunken noodle is to die for and the thai french fries are innovative and delicious. You won't be disappointed. 5 stars.", "author": "Cameron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-03", "description": "This has been one of my neighborhood restaurants for a long time and I never ate here (or maybe did one time long ago). Recently I was reading their reviews here on Yelp and saw people write positive things about their lunch special, so I decided to check it out.\n\nIndeed it was pretty good, and it's served on weekends also. You can choose a one-item combo for $6.50 or two items for $7.50, and included is a choice of a side salad or a cup of tom yum soup.  I believe there were 23 items for you to choose from. I chose the Thai barbecue chicken and the red curry beef. For a solo diner like me, it's a good opportunity to sample extra Thsi food items on the same plate without ordering whole entrees.\n\nThe decor is very nice and so was the young lady working as the staff yesterday afternoon. It's definitely worthwhile to consider returning.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "Wow - this place rocks - the food is delicious and the people are so gracious. I've eaten here many times, it's a favorite of my favorite people. \n\nSo their daughter set up a surprise party for my favorite couple and they did a buffet style meal w/ appetizers, curries, meat on a stick (obviously I don't know what anything is called) and it was all delicious. they had this seafood in a ramekin thing that was awesome. \n\nI also really like the ambiance in this place, nice warm colors in the room, solid cherry wood chairs, table cloths - it's a great find and really affordable.", "author": "Rew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-03", "description": "I've lived in the Sunset almost my whole life and I pass by this place ALL the time.  My BF and I wanted something Mediterranean but we couldn't think of a place close with parking.  \n\nWe decided on coming here based on the yelp reviews.  We ordered the chicken satay and that got the thumbs up.  The curry puffs were also good and I was drawn to them because of the taro ingredient.  I couldn't get past the curry to taste the taro though.  And last we got the yellow curry with chicken.  Curry sauce was good but the chicken was a little tough from being over cooked.\n\nThe service was friendly but we did have to wait a little at the end to get our check.  I grabbed a to-go menu because it was good enough to eat again but next time I think I will have it delivered.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Love this place. Lunch special is awesome and incredibly cheap. Pork is phenomenal here.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "I tried Vanida for the first time today. In the past i'd go to King of Thai on Sloat but I haven't been having good experiences there. \n\nThe service is way better at Vanida. They were friendly and always refilling my hot tea. I ordered the yellow curry, which was good and you get a huge bowl. The rice is sold separately, which is unusual, but I think the amount of curry you get makes up for it.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "Why is it so hard to find good Thai in SF?  There's a ton of options, but in the last 2 years since I've moved back I've managed to stumble on a series of overpriced, small portions, no flavor, dime-a-dozen Thai joints.  Incredibly disappointing.\n\nNOT ANYMORE!  I love this place.\n\n1. Great food!  So fresh, great portions, great price.  Granted, I do admit it seemed to take awhile to get our food out... but worth the wait.\n\n2. Great service!  The staff was super friendly.  Always kept my water full and checked in often to make sure we were okay.\n\n3. Convenient!  No wait to sit down on a Wednesday evening.  Easy to park (!!!).\n\nWill definitely come back.  We were super satisfied with our order:\n\nChicken Larb appetizer- No lettuce wraps here!  Almost all larb... almost too much so!\nPineapple Fried Rice- I am a sucker for this.  Maybe it's the big pieces of shrimp, perfectly cooked chicken, cashews, or pineapple... but I love it!\nChicken Green Curry- Plenty of chicken, zucchini, thai basil goodness.  A little runnier than I like my curry, but still great and flavorful.\n\nTotaled about $25 before tip.  \n\nYUM!  Will definitely be back!", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "Me and my husband are often having lunch and dinner here. The place is nice and clean. The service is good too.\n\nFor lunch time, I always order the lunch combo: Garlic Prawn and my husband order GaYang Chicken + Garlic Prawn. \nThe lunch combo served with Tom Yum (Sour) or Tom Kha (with coconut milk), you can choose either one. And they're all have a good taste.\nI once tasted the Pad Thai, but I think the taste was so so.\nFor dessert, we always have Fried Banana with Ice Cream. yummy!\n\nFor dinner time, they serve the a la carte menu. We tried their Sweet and Sour Fish Fillet and Crispy Calamary, The fish was good, but the calamary was not as crispy as the name :)\n\noverall, it's good food and good place.", "author": "Joice K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "Vanida is walking distance from the crib. Bonus for me! Cuzzo J. and bf both love this place too so that's another plus. It's a nice little neighborhood restaurant. Very cozy and clean inside. Simple decor, nothing too cheesy like some other Thai places. Last time, bf and I wanted to have a light dinner so we just got the Yum Yai (salad) and Drunken Noodle. It was more than enough for both of us but we managed to polish them off bc both dishes were so yummy! Everything was fresh and flavorful. We like tons of basil in our noodles and they delivered. Service was accommodating as usual. Great for take out too!", "author": "Liv A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Came here with the boyfriend for lunch and ordered off their lunch menu--which I might add is semi-reasonably priced (depending on what you order)\n\nService was okay. Nothing too memorable. Considering we were the only people there during lunch time, they would have been more attentive. We got our drink orders in (both of us had Thai iced teas), and I, in boredom, proceeded to watch our server make them. It put me off a little to watch him get large ice chunks from a bag of ice (the type you buy from a grocery store), and fill it to the rim with ice. It always leaves a bad taste in my mouth to see so much ice put into a drink. Oh well. When he brought them to our table, my bf got stuck with a large iceberg piece of ice floating in his drink. The drinks looked lighter than usual (perhaps all the ice?), but taste wise it was alright. I've had better thai teas.\n\nNow onto the meal...Whenever I go to any Thai restaurant I find myself ordering the same Pad kee mao (with chicken or shrimp). I was a bit disappointed to see my plate set in front of me. I thought the portion was small, despite knowing it was a \"lunch menu item\". However, by the end of the meal I clearly had a case of \"eyes bigger than my stomach\" and I was filled, which my bf eating the leftover. The taste was yummy, so I was pleased with that. I thought this dish was reasonably priced.\n\nBoyfriend had some two item combo with garlic shrimp and tofu with peanut sauce. I can see why he likes this place. The garlic shrimp was great, and the tofu as well, however the portions seemed kinda small and I don't see how it could have filled my voracious eater of a bf.\n\nOn a happy note, they gave us a complimentary dessert of sticky rice and mango (maybe cause the bf knows the owner who wasn't there?). I've ALWAYS wanted to try it at other restaurants, but always been put off by my slight picky-ness for mangoes. I was pleasantly surprised, and I will definitely find myself ordering dessert more often. Overall, I would come back here for great lunch deals.", "author": "Jenna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "Probably my favorite spot to go to for Pad Thai pak. It's a perfect environment to have dinner talk with some friends.", "author": "Alicia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Great lunch specials especialy for take out! Very affordable and quality food. Love the garlic pork!", "author": "Casey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-20", "description": "I had a few friends with me and we decided to try Vanida's.  We ordered  Pad Thai, fish cakes, sweet and sour Tom Yum, and a chicken yellow curry.\nIt was pretty busy there. The service sucked, it took a while before we were seated and then once we were seated it even took more time.  Once our food got to the table the server hurried to serve the soup . . . spilling and clanking dishes around.  Out of all the dishes the soup was the best.  The yellow curry was rather sweet and not so curryish, the fish cakes were okay, nothing special, and the Pad Thai was good but nothing that really hit me. Overall the service sucked and the food was just okay. I was quite disappointed esp. checking out the Yelp reviews. I Won't be back.", "author": "D M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-24", "description": "I was excited to see the reviews for this place and that they delivered.  We ordered Tom Yum Soup, Fish Cake, BBQ Beef, Garlic Pork, Pad See Eww, Panang Chicken, and Thai Iced Tea.  Total was $44 plus a $5 tip.\n\nThe soup lacked flaver, the fish cake was okay.  I didn't like their pad see eww, and their meat was tough.  The thai iced tea was good.   And I did like the flavor of the pork...but not the texture.\n\nTheir delivery time was right on.  And when I got their menu they were 1/2 full during dinner time.  But yea.... I tried.", "author": "Sheenie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "I had the chicken red curry lunch special and Thai iced tea. The tea was delicious. Not overwhelmingly sweet nor too creamy. At $2, it's cheaper than most other restaurants.\n\nI chose tom yum (hot and sour soup) with my meal and it was alright. Instead of getting chicken I got vegetable tom yum so I found out that they put the vegetables in the soup base instead of having a separate pot of vegetable tom yum and chicken tom yum. The vegetables in the soup were crunchy which I can see why people may not like it, but I'd rather have fresh slightly crisp vegetables than soft vegetables that lost all of their flavor and nutrition. The soup wasn't very spicy, just okay. \n\nThe curry tasted just like my mom's. I should add that she's from Thailand. A+! Unlike King of Thai, Vanida's has a less viscous curry with more coconut milk. It's more homemade and has simple flavors than all the stuff wt King of Thai I have no idea what they put in it. There's lots of chicken and just the right amount of rice on the side. The only downside was that the rice was really moist. Usually I like rice a little sticky, but with curry dryer rice soaks up the curry better. However I'd rather have the rice moist than dry and thinking that it's old. \n\nAdditional info: One of the workers/owners is really funny. He loves singing. Very friendly staff. :)", "author": "Stacy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "Ordered these items\n\nNuer Yang (BBQ beef)- Great seasoning. 5 Stars\n\nPineapple Fried Rice- The dish was really small. It costs nothing to add a little more rice right?  Family and I also were expecting the dish to be served with a real pineapple. Anyway, we didn't get that strong flavor of pineapple from the rice. A little disappointed. 3 stars\n\nTom Yum Noodle Soup. This is supposed to be spicy. We even told the waiter to make it as spicy as they can. It's tom yum! It supposed to make us cry and sweat like crazy! Anyway, I will not order this again. 3 stars\n\nYellow Curry- Really Really Good! 5 stars!\n\nDrunken Noodle- The best dish we had. A must try. This is basically a dish like Dry-fried beef ho fun. But they add some special seasoning. Pretty good indeed. 6 stars\n\nThai Iced Tea- 4 stars. I think it's $2.50. A little expensive. \n\nMy dad found his plate to be a little dirty when we first sat down at the table. The owner gladly changed a new plate for him. No big deal. Would definitely come back to this place. Customer Service was great! But I never include customer service as part of my rating.", "author": "Ka N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Tried it once, and loved it!\nI understand now why people like Thai food and Vanidas, it clearly makes the food worth the delivery wait!", "author": "Khaloud D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "Food is so unique and fresh. Try the coconut soup and taro puffs. Yum!", "author": "Bree G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-07", "description": "I feel bad being a downer amidst a sea of good reviews. Here goes anyway.\n\nThe menu was obnoxiously long. Intimidatingly long. It was like, 100 items. This is a personal pet peeve of mine. I don't have time to try all those. But I won't dock them because, luckily, there was a sheet on the front for chef's favorites. So I took one of those -  the lamb curry. It was not very good. The lamb was hard and chewy. It was really more like a soup than a solid meal. And honestly, I felt like it shouldn't have been an entree. It would be a great side dish, but on it's own it was just not something you'd want to eat a whole meal of. \n\nI think I may have just made the wrong decision. A lot of my friends' food looked better than mine - pad thai especially. But why would lamb curry be the chef's favorite then? Put something better on the chef's list. The curry just wasn't very good.", "author": "Grant M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-27", "description": "I miss this place. I frequented it when I lived in SF. Delivery is fast, prices are low, and the food is delicioussss. I dream about the peanut sauce.\n\nI highly highly suggest Tofu Pra Ram and the chicken wings.\n\nI can't wait to visit SF again to go to Vanida. Georgia's thai food is NOT happenin'", "author": "Brittany B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-10", "description": "Vanida Thai Kitchen is a gem in the Outer Sunset. I stumbled upon this restaurant and it has quickly become my one-stop-shop for Thai. Not only is their food terrific, but the décor and ambiance are great whether you're on a date or having some bromantic time. Their staff is friendly and didn't mind us hanging around talking after dinner. What I really appreciate about this place is the cleanliness. I've been to some dingy Thai places and it really detracts from the experience for me.  \n\nI'm a fan of their pad thai. It's been consistently tasty and my go-to dish. The pineapple fried rice was surprisingly good (who knew pineapples and rice could go so well together?). I've heard great things about their curry dishes too. Don't miss out on their desserts. The fried banana is worth saving room for.\n\nMy tummy gives Vanida Thai Kitchen...5 Stars!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Absolutely delicious everything we tried!!! Will be back again!  The crispy coconut with lime and spinach was my favorite.", "author": "Iuliia Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-21", "description": "Our family of 4 were nearby Taraval, decided to eat some thai food.\n\nSearching for Thai food on yelp, we found this little place call Vanida, \nthe picture on yelp is probably old, they have recently did some renovation.\nThe food is decent, however...\n\nI am not a big eater, so does my two kids. Come On!!!  The curry dishes are so small, I mean less than half of a bowl, it's not a big bowl either, I end up getting two order of rice, the curry was like $9.95 and two order of rice was $3.  I had to eat wife's portion of rice, lol.\n\nThere are much much better Thai place out there.", "author": "Tiger L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "I can't believe I just discovered this place. \nI live, like, 5 blocks away, or something and I've always just gone to Marnee Thai..\nHowever, no more. \nI think this will be my go-to spot for Thai. \nI haven't tired much there, \nbut I'll totally vouch for the garlic pork. MMmmMMmmMmm", "author": "Garland W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-30", "description": "The delivery was timely, but the food was terrible! Way overpriced for the tiny portions. The beef noodle soup was just pretty much just broth, and the seafood salad was way too small for $11.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "The food was good. The reason I'm giving the place a low score-- and the reason I won't go back-- is that when I picked up my take out order and the waiter ran my card, he gave himself a tip.  Not acceptable, esp as little ole me doesn't qualify as a party of 6. When I commented on it, he sort of giggled his way through it.", "author": "Elvis P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-11", "description": "Food was OK... Empty place.\n\nWe ordered angel wings, red curry, and pad see eew...\n\nAngel wings tasted like they were deep fried then drowned in sweet chili sauce... Nothing special and didn't taste marinated.\nCurry was soupy and bland for curry.\nPad see eew was OK. vegetables were cooked perfectly where it was still crunchy, noodles were soft and not bad. The beef was terribly chewy...", "author": "aaron t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "This place has good lunch deals, but for dinner, it's not as worth it.\n\nMy favorite are the noodles with egg, but the portion is not large. The portions here are not large in general.\n\nWe also got the basil chicken which was fine. You have to pay for side orders of rice though; otherwise you have nothing to eat it with.\n\nYellow curry is okay.\n\nFried banana w/ ice cream is fine and I would get it again.\n\nThe inside is nice and clean. It's very small and I haven't seen it really busy before. Last time I went for dinner, they took a while to get our dishes out because they wanted to serve them all at the same time.\n\nUsually, it is a toss-up for me with this place and King of Thai. For lunch, I would also pick here. For dinner, I would prefer going to Lakeshore Plaza's King of Thai for their $18 deal (if they still have it).", "author": "Derek M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-03", "description": "I first started coming here just because of the proximity to my school. It's nice that the nearest MUNI stop is at the corner also. \n\nOverall, I've had good experiences. Actually, I've only had one bad experience here. I usually come during lunch time, & the service is great. My one bad experience was when I came for dinner. It was PACKED. There was a 30 minute wait for a table. My party (a party of about 8) waited more than two hours to get all of our food. It was absolutely ridiculous. This was the one and only time I've been there for dinner, and I won't ever do that again. But lunch is great! They're supper fast.\n\nI suppose I'm boring, as whenever I go to any Thai restaurant I always get Pad Se Yew. It's my absolute favorite, and they make it really well here. Not greasy at all, and the Chinese broccoli is cooked just right. Though I must say that sometimes they run out of the flat rice noodles (bummer...) When they do, they always tell you and ask if you would like to substitute with another kind of noodle.\n\nThe Tom Kha (coconut milk soup) is also very good here. An the prices are amazing; you can't beat a thai food lunch for less than $7!!", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-22", "description": "This place is OK at best.  It's nice if you're in the area and are craving Thai food BUT if you're picky with your Thai food it's probably a waste of time. Their tomyum goong is too sweet. Forget asking for your food to be spicy because that request just gets lost into outer-space. Their prawn salad is really good. Pumpkin curry is my favorite thing that I get there. Everything else is alright. Nothing too exciting. \nThey do have very good service. (aside from the complete disregard for the spicy request) \nAll in all, A-OK", "author": "Janu A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-09", "description": "I have been here a few times and finally I am going to yelp it.  \n\nFood is ok.  Clean, which is important. \n\nMy problem with this place is that the staff slacks on the portions, contrary to other reviews, portions are not suitable for sharing even if you order from the dinner menu/a la carte...esp. if you order soup for dinner.  I was surprised to find a very small container of soup for 5 people.  For the garlic pork, chicken or even beef, I'm not expecting a to-go carton full of food, but let's not \"fill\" in the container with shredded cabbage.  C'mon now.  \n\nLooks like if I'm hungry and don't want to drive/cook, I can check out the other restaurants next door.  And at least they are cheaper", "author": "John Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-20", "description": "I must have a bias because I feel like I always give out 4 or 5 stars...\n\nAnyway, I first tried Vanida at a Sunset fair many years ago. It was one of my first ever Pad Thai experiences. \n\nI think their lunch specials are the best...you can order Pad thai and an entree, which is perfect because I always get Pad thai at Thai restaurants...\n\nInside is pretty fancy as well.", "author": "Alison N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "The location is great.  Has street parking and on the L-Taraval line.  Get off on MUNI on the L-line at 40th and Taraval, and walk 1/2 a block to restaurant.  Also reasonable street parking.  Great location..\n\nFood is great.  Went there for lunch, and the food was delicious.  The prices for lunch special was good too, and reasonable.  Nothing to complain about the service either.  \n\nWould go back again.", "author": "A M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-28", "description": "Perhaps I'm being a harsh judge because it was takeout and we didn't get to it for an hour or so... but I thought it was mediocre across the board, and the serving sizes were smaller than anywhere I've gotten takeout in the Bay Area.\n\nThe beef satay was flavorful but a little tough. The yellow curry was milder than I like it (ordered spicy), and the soup was a bit watery. That being said, nothing was BAD either. Just definitely middle-of-the-road across the board.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "Great Yelp find, esp for delivery! This place is so good if you're craving Thai food, best part is that they even deliver! The food was delivered quickly, efficiently, and was still steaming hot! The driver deserved a tip. \n\n#26 Tom Kha Gai - so good! I love soups with coconut base, but this wasn't too coconut-y. T'was nice and smooth with my favorite - mushrooms. SO good. Yum. Very generous serving.\n\n#57 Chicken Eggplant - wasn't too spicy. LOVED how the eggplant was cooked.\n\nPanang Salmon - exactly what it was. Juicy salmon filet, sauteed in thicker red curry sauce. \n\nSo THANK YOU Vanida, if I ever feel so lazy and am craving Thai food count on me for calling you guys!", "author": "Christine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "Chicken satay yummy, and the cashew chicken was super flavorful!\ngarlic pork! yum!", "author": "Alicia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "Don't let the outside fool you; inside is a really nice, cozy, neighborhood restaurant.  Parking can be difficult at times..but where there's a will, there's a way!\n\nBest pad thai I've had to date; I was not disappointed with sticking with my usual pad thai instead of getting another noodle dish...though I hear that pad see yew is also very tasty.  I also had a taste of my bf's order of Thai fried rice which was flavorful & not plain like other places I've tried.  I've also had in the past the peanut sauce chicken & bbq chicken.  Both had yummy accompanying sauces & were cooked perfectly.  They don't skimp on the portions either.  Ohhh, & you must get the fried banana with ice cream...yes, fried makes everything better!  On my last visit the fried bananas were sprinkled with what looked like toasted sesame seeds making it different then other places, but a pleasant surprise.\n\nGreat food, affordable prices, & friendly & prompt service puts a yummy in my tummy & a smile on my face!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "The yellow curry was bland, only dry thin strips of chicken with potato and onion.  I only ate here because I had 30 mins to kill waiting for the L Muni to come.  The owner was very nice, but I wouldn't come back unless I were in the area.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-19", "description": "When i want to thai one on, i go here. I love the pineapple fried rice or the garlic chicken. Its all good, and three blocks from home. Staff kills it, and its cheap.", "author": "dave d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "Seriously amazing food\nThe chef has a great pallet.\nCan't wait to have time to drop by to discover another amazing dish oh and all food is cooked without MSG", "author": "M. B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "Had some food to go from Vanida and while the food was good with medium sized portions (smaller is always  better when you put noodles in front of me), the really friendly service we received wile drinking our warm teas and waiting for our food, was lovely! This place is so close the the Muni it's fantastic, not to mention the decor is pretty nice in this place. I imagine it having a pleasant dinner atmosphere.\n\nPlus, the pad see ew and pad thai were enjoyed heartily when we took it home.", "author": "Tanya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-24", "description": "I just went to a private party (graduation, SF State) at Vanida this afternoon. And I've gotta say, this place is wonderful. \n\nWe will be back again and again. (Of course, the fact that Himself-the-Spouse works at SF State makes dining here after work quite feasible. )\n\nWe loved the staff, who worked tireless behind the scenes. \n\nWe loved the food, which was fresh, savory and authentic.\n\nWe loved the company...which consisted of family and friends of the graduating SF State student...marvelously diverse in every sense of the word. Each one more erudite, witty and charming than the next.\n\nYou won't find our dining companions at Vanida in all likelihood. But you will fine good food, nice staff and a cozy little place to eat. \n\nParadise enow.", "author": "Dorothy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-05", "description": "I was helping my Aunt with some errands (she doesn't drive). Afterward, she treated me to lunch at Vanida Thai Kitchen. \n\nI have not been to a Thai restaurant in quite a while. There are so many restaurants to choose from these days that none seem very special to me, not even the local restaurant in my own neighborhood. So I was not expecting much at this outer Sunset location.\n\nWe selected from their lunch combination menu. I had the garlic pork and vegetable green curry with white rice. My aunt ordered the Gai Yang (marinated broiled chicken) and Poh-Pia J (deep fried spring rolls). Our lunch included steamed rice and our choice of soups or salad. We both chose soup. I had vegetable Tom Yum, my aunt had chicken Tom Kha. I also had their Thai iced tea. \n\nThe iced tea was nice, not syrupy or too sweet. The food was fresh and delicious. The Tom Yum was nicely balanced with the salt/sweet/sour. The only thing I felt it lacked was a bit of heat - it was quite mild.\n\nMy garlic pork had a nice char and was quite tasty. There was a green dipping sauce that tasted of vinegar, mint and cilantro - very herby. The vegetable green curry had a bit of heat to it, but still mild by my standards. Maybe I could have ordered it a little spicier, but they didn't offer and I didn't inquire.\n\nI had a bite of one of my Aunt's spring rolls. It was made well, the spring roll skin had a nice crunch and was not greasy. But the filling could have been seasoned a little bit more, I thought it was a touch bland for my taste. But maybe that's what the dipping sauce is for. I finished my curry and took home the rest of my pork to enjoy later.\n\nTheir prices are very reasonable and they have generous portions. Our wait person was friendly and efficient, the dining room is clean and comfortable. Judging from the other reviews, it appears to be a popular place for take away in the neighborhood. The next time I head to the Sunset to help my Aunt out with errands and she says \"let's get something to eat\", I'd definitely suggest going back to Vanida.", "author": "IM M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "Man, it's hard to write a review when you're eating leftovers from the restaurant you are reviewing... but I will charge forward with mouthful of curry. \n\nMy gf and I came here because shes been craving Tom Yum soup. We found this place on Yelp and headed out there since we live in the area. The first order of Tom Yum soup was too spicy for her, so we ordered another serving without spices. The soup was ok, but i'm not a huge fan of Tom Yun. We ordered a side order of sticky and jasmine rice. The sticky rice is really good and I highly recommend it if you like to use it as a sink sponge on your dish. I ordered the Pa Nang chicken curry, which was awesome. The sauce was so awesome, I felt guilty for gulping this stuff. I wanted to bathe in it.\n\n We also ordered the vegetarian yellow curry, which was ok, but didn't blow my mind like Pa Nang.\n\nThe flavors here are great and the dishes are paired up with equally fresh ingredients. I like my sauce so much that when I got home with my leftovers, I joked that the waitress had stolen some of my Pa Nang sauce cause I swear there was more!\n\nOverall, the prices are good, we walked out of there for under $38 for 2 peeps and full bellies.", "author": "Wil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "Excellent Chicken Basil, Pad See Ew, and BBQ Pork. Service is always friendly.", "author": "Aaron I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "I've been here twice so far, once for dinner and once for lunch, and I've had good experiences both times. The place is clean and the servers are friendly. I got a pad see ew and a Thai iced tea and found the portion sizes to be good and fairly priced.", "author": "Johnathan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-27", "description": "Maybe my palatte has been spoiled by my move to the inner richmond.  When I lived out by the ocean I thought this place was one of the better Thai places.  I had to re visit over the weekend while dog sitting in the area.  Sadly, I was not impressed.  Nothing stood out.  I ordered take out and some of the dishes seemed to have been sitting out for too long.  It was all very average.  I would not go back.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-28", "description": "This place is the go to place for Thai Food. The lunch specials are really at a great price. They offer a 1 item lunch special, but for another dollar or two you can get another item depending on what it is. I like to order the garlic pork with the curry chicken. The garlic pork is not fatty at all and comes with a green sweet and sour sauce that makes it taste even better. The curry chicken is very tasty, the chicken is all white meat and tender and no fat with it. My girlfriend and I usually go here if there isnt any other places to go to eat because we know we get great value in the money we spend and the amount of food we get. This place can get busy, but it is rare because I usually go during lunch time. Check this place out it really is good food.", "author": "robin b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "Some real good cookin' going on here.  The girlfriend and I just accidentally came upon this place so we decided to give it a shot.\n\nThe inside was nice and cozy, not too big.  The waitresses were dressed in traditional Thai clothing which gave the place a nice vibe to it.\n\nWe ordered:\n\nThai French Fries:  Nothing special, just deep fried yams with a nice coconut batter.\n\nGarlic Pork:  Some finger licking goodness.  Had a NICE garlic aroma which wasn't too strong.  Perfectly cooked and tender.\n\nGreen Curry with Chicken:  Not too bad, wish it was more spicy though.  Your average Thai curry.\n\nDefinitely a spot to check out if you have not.", "author": "Chai S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "The food and service are still up to par... Although, I haven't really had any problems with ordering take-out from here (I'll be real--we just did on Friday lol), I prefer to go sit and eat here.  Putting this yummy food in a chinese take-out box kinda seems like a disservice to it's deliciousness... ha  (not that there's anything wrong with chinese food!)\n\nMust try:  calimari, yellow curry, chicken pra ram, goong pong karee", "author": "Olivia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "I just tried Vanida for the first time (their delivery service)\n\nDelivery was quick! 25 mins on a Saturday night!\nOrdered:\nTom Kha Pak soup- spicy, coconut milky, savory and better than I've had, delicious!\nPad Ma Keur- An eggplant/ tofu chili stir fry, light and tasty but could have been a touch more flavorful- still good.\nCoconut Ice Cream :)\n\nThe soup was hot when it arrived and the ice cream still unmelted, everyone from the girl on the phone to the guy who delivered the order was friendly and professional!\n\nDefinitely to become a staple for late night term paper chow", "author": "Brittany T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-20", "description": "Worst Pad Thai I've had...NO flavor in the noodles at all. They charge almost $20 for delivery and this is what I got... I will not order from them again.", "author": "Simone A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "Love Thai food and have tried several in the neighborhood. This is the best so far! Great take out and delivery. The Pad Thai was excellent. Service was good and will go back again. Visited several times before leaving a review.... Small place, but very good so far.", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Vanida is a little hidden gem in the depths of the Outer Sunset. They serve a good amount of vegetarian dishes with crunchy, fresh produce. I especially love their tofu & veggie curry and the Miang Kum. \n\nWhat is Miang Kum?-- picture this.... \na raw spinach leave delicately filled with roasted coconut, lime, red onion, ginger, cashew nuts, and lightly drizzled with secret sauce. Refreshing deliciousness!! \n\nA few other perks-they have free delivery, are timely, when the food comes it is packed neatly in recyclable containers. \nDid I mention that two of us can get dinner for around $30!", "author": "Kimber M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "I have never actually been into the restaurant but I order from here any time I want some good thai food delivery. \n\nI recommend the garlic pork (yum!), and tom kha gai soup. You can't go wrong. This place is yummy!", "author": "Gabriela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-26", "description": "San Francisco...home of so many dives and so many obscure ethnic cuisines, and yet, kind of hard to find a Thai place.  In fact, up till now the only one I'd been to is the rather trendy and expensive Grand Pu Bah.  But I knew the Outer Sunset wouldn't let me down, and sure enough, Vanida makes a great haven for Thai lovers.  Apparently some Thai food magazine ranked them in the top 100 nationwide.  I don't know about that, but I do know the duck curry was delicious.  Pad Thai was serviceable, but then, I'm not a huge fan of it so you should try it for yourself.  They clearly specialize in curries though.  And bonus points for having a pumpkin curry special!  Unfortunately the wife was sick of my pumpkin obsession so I didn't get a chance to try it.\n\nDecor is pretty standard Outer Sunset shoebox.  Indeed, I have a hard time differentiating it from, say, Old Mandarin Islamic.  Service could be a bit better; they brought the food out before the drinks and had to be reminded that we ordered rice.  But overall, this should definitely be on your Thai short list, especially since in SF it's a short list to begin with.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "I ordered for take out; called ahead of time and ordered the chicken yellow curry, chicken drunken noodles, and mango and sticky rice. I'm so glad I did, it was so so sooo delicious! I can't wait to go here again!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "Came here with a friend and each ordered a 2 item lunch special. I ordered the chicken in yellow curry and sautéed vegetables. The curry tasted way too sweet, with no other flavors cutting through. The vegetables were alright, if a bit reminiscent of typical Chinese food. However, the options were plentiful and thr portion sizes were very good for the price.", "author": "Lindy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "The ambiance, food, and staff were all very nice here.  The place is decorated with many warm colors and a Thai theme without going overboard.  I came here with a friend and they seated the two of us at a 4 person table, which is better for dinner than the \"two person\" tables.  I would recommend this place for a relaxed night or a date.\n\nWe had roti which came with a sweet cucumber salad and a yellow curry paste, the eggplant and pork, and the yellow curry with jasmine rice.  Everything was delicious.  I Especially like sweet things, so I really enjoyed the cucumber salad that came with the roti appetizer.  The eggplant was just right, not to mushy, not to raw, and the accompanying pork not too dry and full of flavor.  I would have liked a little more sweetness and coconut flavor in the curry, but this is personal preference and the curry was still good as prepared.  The appetizer and two dishes was more than enough to fill two females and we had extras to take home.\n\nThe staff was very friendly, although I felt they checked on us a little too often.  Perhaps this is because we were there at a time when the place wasn't too busy? We came on a Tuesday night.  Regardless, they made sure that we were enjoying our food and would come by very often to remove empty plates and refill our water.  It was a bit awkward though that we were often not finished with a plate before they came to remove it.  This probably wouldn't be a problem for people who don't finish their food to the last drop.\n\nIn summary, this is a great place for good food, friendly staff, and a pleasant ambiance.", "author": "Stella T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-07", "description": "When you find a good thing, you stick with it.\nThis is our favorite Thai in The City.  \nOur first try was picking up a 'to go' order.  Even though they were busy,\nthey graciously allowed us a table to wait at and poured us tea, even making sure to not let our cups get below half.  This type of service is rarely seen in restaurants of this price range in The City and very refreshing.\nThe food was fantastic.\nNowadays we usually do delivery.  They do a great job of getting your food to you immaculately, fresh and hot.\nThis in no way means we are avoiding dining in the restaurant.  It's a relaxing place to enjoy a great Thai meal.\nbut...\nGreat food and delivery too?\nWhen you find a good thing, you stick with it.", "author": "Barry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "Amazing larb drunken noodles and mee krob!  Best tom yum soup ive ever had.", "author": "Ani J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-01", "description": "I ordered the pad kee mao with tofu for lunch. There were 3-4 other tables and only 1 server so the wait was surprisingly longer than expected. The food tasted really bland. I like the tofu more than the flat noodles, which needed more soy sauce and flavoring. Even with chili powder, nothing could save the lack of flavor. The portion size is a little smaller than the more popular Thai restaurants but luckily I felt full afterward.", "author": "Dominic T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-01", "description": "I came here for lunch on a Saturday. I was skeptical about this place since the place was empty. \n\nThe place has cheap lunch combinations. They are about 7.50 with soup or salad, and rice. The Tom Yum soup was flavorful. My basil chicken entree was good, the portion was a lot for lunch. I took half of it home for leftovers. All my friends (group of 6) liked their food too.\n\nI'm surprised this place wasn't more crowded.  Maybe it'll be one of those secret good places that are on the low", "author": "Kristina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-03", "description": "First off great service.  Staff was attentive and always there to fill your water.  Tom Kah pak soup was very nice and the beef sayta was tender and delicious. Green curry was very nice just the right amount of heat and the vegetables  were tender.  Pad Thai was adequate nothing special and the red curry had an off taste. Certainly worth a try.", "author": "Craig V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-03", "description": "portions are small! kind of pricey.\n\nduck curry- tiny container, but goood flavor and lots of things in it.\ngarlic pork- rave reviews and it was really good, presentation was not that great...if I just looked at it....doesn't look too great.\nthai fried rice- didn't even fill the to-go box! average taste\nfried tofu- meh.\n\nif the portions were bigger perhaps! but no thank you! maybe for a lunch combo or something", "author": "Christine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-28", "description": "Three stars but really closer to four.  I've only had a couple dishes, but I'll try it a couple more times and make a final decision.  Call me crazy, but I have to adhere to the integrity of my reviews.\n\nAll that being said . . . \n\nThis place stands between two other restaurants on a street  I call restaurant row.  That reminds me, I have to write a review on North Beach Pizza since it's at the corner of that street.  And it calls itself the hidden Thai jewel in the outer Sunset, and I'd have to agree.\n\nIt's a tiny place.  Clean.  Friendly wait staff.  Good food.  Good prices.  They also serve their lunch menu on Saturday.  Kudos.\n\nI love the kick in their food.  The menu says mild, so I'm thinking Lame.  Wrong.  Some places will water down their spices to make their food more mainstream, but why?  No pulling punches here.  Their Mild might be considered Hot in other places.  I can't wait to try their meaning of Medium.\n\nThere's this green sauce they serve with the roast or grilled pork that will blow your mind.  Curry has a nice balance of spice and coconut milk.  And the fried tofu with eggplant was fresh.\n\nMaybe I should just give place four stars already, but . . . just gotta wait.\n\nlove spicy yelp", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-03", "description": "Ohies, I'm so full right now so it's hard for me to type...\n\nWe had the...\n\nAngel Wings topped with spicy sweet & sour sauce and crispy basil.  Very yummy with lots of meat and crispy skin.  The sauce had tons of minced garlic...SO GOOD.  I ended up slathering it all over my unsweetened sticky rice...hehe.  You shouldn't waste food.\n\nYellow Curry with roasted duck, tomato, pineapple, bell pepper, zucchini, and basil.  It was really good, not too spicy. It was obvious that both my bf and I were trying to get as many pineapple pieces as possible.  Love the sweetness of the fruit with the creaminess of the curry. I did like my sticky rice, but I must say it didn't really go with the curry.  Should have also gotten an order of regular rice.\n\nBeef eggplant with garlic, basil, and bell pepper.  Can't go wrong with this dish.  I absolutely love eggplant and garlic together.  But out of the three dishes it was my least favorite.\n\nI think they recently remodeled...so it looks more modern. The waitresses are very nice and pleasant and look super cute in their Thai attire.  A nice alternative to King of Thai if you are looking for Thai food on Taraval.", "author": "Rose J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-27", "description": "The satay was good.\nThe vegetarian dishes made with fresh tofu are great.\n\nThe beef, however, is very, very poor quality.  Tough, grisly, chewy...  the tendons and fat weren't sliced off, so I end up with at least 3 completely inedible bites.  Ugh.\n\nSo, I would go back, but I would order vegetarian.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "I've lived in the sunset district practically my entire life and have lived REALLY close to Vanida for about half a year but I hadn't noticed it until I pulled out my phone and yelped restaurants around my house. I was pleasantly surprised to see that there was a thai place deep in the avenues with great reviews. I knew about the block it was on, but I guess I just get distracted with the other chinese restaurants next to it.\n\nRegardless, this place was pretty damn good. We got there around 9:45 - close to their closing time - so we decided to order takeout after sitting at a table. They were accommodating enough and let us sit there with water while we waited. \n\nI ordered the pad thai pak and really enjoyed it. I'm  usually a carnivore but I LOVED this dish. Usually, when you order a veggie dish at a restaurant, it comes with one or two different types of veggies, but this dish had at least four or five. The vegetables were cooked perfectly, not too soggy nor too undercooked; it had the perfect crunch and it absorbed the right amount of flavor. I rarely find veggie dishes this satiating, but I could eat this dish all day.\n\nThe boy got pad see ew. We practically order this dish at any thai restaurant we go to - it's like a test for the restaurant. The dish came out flavorful but not super greasy like other places (ahem King of Thai). The chicken was cooked well, not overdone and still tender. There was a great ratio of veggies:meat:noodles. Personally, I might not order this dish but it's definitely a lot better than other places' pad see ew.\n\nThe atmosphere of the restaurant is great - something unexpected after seeing the atmospheres of the surrounding restaurants (North Beach Pizza, Wing's). Overall, this is a great restaurant and they deliver too! I'll have to try the lunch special, seems like a great deal.", "author": "Christina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-29", "description": "They really do receive 4 stars plus, but I am basing this review from what Thai food should be and it should not  be refined. This place is great for anyone, but not those who seek authenticity. But Vanida did not mention anything about authentic Thai cuisine, so good for them. Okay, lets start with what we had for dinner.\nSeafood salad- It was good, I actually did like this dish.\n\nPapaya salad- Okay, we made a request for the papaya salad, we wanted it to be the dirty style with all the black goodness and fishyness. Right when we mention that request the waitress jumped back and said we don't do that here, as if we ask her is they sold cocaine in the back. So we settled for their regular salad and asked for SPICY, but when the dish came out it was sweet at first and maybe a tiny kick at the end of the bite. When we want spicy and when we say SPICY, we expect to be dripping sweat and scratching our heads.\n\nTom Kha soup- Too much coconut milk, almost tasted like a dessert. \n\nAngel wings- okay someone specify what Angel wings are, because in every Thai restaurant it is different. Some places it is stuffed chicken wings and here it is just fried wings tossed in a mild honey basil sauce. But it was good!\n\nPad kee mao and Pad see ew- were rated okay!!\n\noverall this place is nice, food is beautifully presented, taste varies on what you think Thai food should taste like. All I know is I went next door and got me a slice of pizza.", "author": "tony y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-11", "description": "This place is totally legit!\n\nThis place gets a 5 star review from me for its delivery (which thus tells you this is based on a semi different standard than a sit down).\n\nFree delivery was a great bonus. Got 3 dishes for $30 (including a $3 tip).\n\nOrdered the bbq chicken, the red curry with pork, and the duck basil.\n\nLet me just say all the food was really amazing. 35 minutes from order to delivery was not bad at all, and the food came relatively hot still. It doesn't look like a whole lot of food, I admit; but really I'd take their quality over quantity any day of the food.\n\nThe BBQ chicken here really is it. Smoky, tangy, sweet, delicious. I admit the small pieces (breast maybe) were dry, but the legs and thigh were amazing. A must have!\n\nThe red curry was really good, coconut flavor came through, nice and rich, but not too thick.\n\nThe duck. Man was it good. The basil hint is subtle, and just enough, and the duck itself is spicy and well seasoned. Veggies are solid too!\n\nPros: Fast delivery, great food, hot food, well priced!\n\nCons: Smaller portions than one normally expects, but hey this is quality we're going for!", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "I ordered angel wings and beef ga prow. I'm a big fan of thai food so I always get foods there. I like it there. I like yellow curry there too.", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-05", "description": "fast service for lunch, decent food, 8 bucks for 2 sides plus rice and soup", "author": "Long C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "3 1/2?  It's not the best thai food, but I enjoy it better than King of Thai so we come here because it's close to home for us.\n\nI always get the pad see ew with tofu.  It comes with chinese broccoli which most other ones don't.  The boyfriend thinks it's weird, I think it's fabulous!  He always gets the yellow chicken curry. I guess it must be good since he always gets it.\n\nOverall, it's sufficient.  It fills the thai food craving, but it doesn't make me crave THEIR thai food.", "author": "Quynh-An P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "Craved Thai and decided to check out Vanida Thai since it was close to the house. We decided on the duck curry and the curry noodles. Curry noodles was lightly seasoned with curry..almost too dry. However the duck curry was good. Guy friend polished it off with the quickness. Thai coffee was excellent. Dine in was comfortable. No wait for a table. Will have to try a different noodle dish next time.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-13", "description": "Vanida recently went through a facelift in terms of its physicality. It was just okay before, but I think after the changes, it is warm and inviting. There is only one block on Taraval west of Sunset that is entirely occupied by small businesses, and Vanida is one of them. (Walgreens is across the street). So although it is street parking only, it is not difficult to find a parking spot in this mainly residential area. \n\nI went last Friday evening around 7:30 with my two sisters and my 5 year old daughter.  There were other families in there, including a larger party who was celebrating \"Grandma's\" birthday.  We started with the papaya salad. Yum. For entrees we ordered the yellow curry with chicken, pad see ewe (spelling?) with beef, and the charbroiled chicken which came with a sweet and spicy honey dressing on the side. At the end of dinner we ordered sticky rice with mango, which was a perfect amount of subtle sweetness. The entire bill for all these items including steamed rice was $40! We even had left over to bring home.\n\nThe service was good. More than one waitress came by to bring our food and check in from time to time. Good Thai food AND it is a block from my home? I'll be coming back.", "author": "Lani S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-19", "description": "I've never sent a dish back at a restaurant. That being said, here, I did. First, the lamb was almost 95% fat. The other 5% was bone. It was inedible. I ordered a basil chicken as a replacement and the chicken was RAW! What a joke.", "author": "Kayla C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-20", "description": "Well... I've been a couch potato lately and crashing on various couches. Vanida Thai is particularly close to one couch that my ass has become very accustomed to. I had takeout from this spot the other night (because my ass wouldn't get off the couch). I had the papaya salad and pad thai pak. The papaya salad was your standard fare EXCEPT for the fact that I kept spitting out chunks of lime with the peel on and everything. I know lime juice is used but really, CHUNKS of lime?! in the salad?? I tried to just eat around the chunks of lime but I grew tired of picking at it and went for the pad thai pak instead. It had a good amount of veggies (i don't eat meat too often) but this was seriously lacking in flavor. I didn't each much of this and went back to the papaya salad. The next day I tried to finish off the pad thai but it was lacking so bad I wanted hot sauce.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-17", "description": "wow - I'm shocked at the rating for this restaurant.  I am not a thai expert, but I'm rarely disappointed with some basic dishes.  The Tom Ka Gai was missing the thai flavors!  The lemon grass or something - this tasted like super sweet coconut soup with no flavor!\n\nThe vegis were all really over cooked.\n\nThe yellow curry had no flavor either - totally bland.\n\nI like my food fairly bland, but I don't order thai food for no flavor.\n\nMy husband did like the basil tofu, so I gave two stars.", "author": "r t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "A pretty good non-chinese spot in the hinterlands of the Sunset.\nThe five of us all thought it was fine, nothing to complain about. Up to our usually high standards for asian food (aren't all us san franciscans food snobs?). I had pad thai - a little too sticky, but good. A little skimpy on the shrimp. The thai eggplant chicken was very good. Pad see gaw was good. You won't be surprised by greatness, but you'll leave happy.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "Vanida is my favorite place for Thai delivery because it's consistently good and incredibly fast. I'm always caught off guard by how quickly they get to my house after ordering. I've eaten a wide variety of different dishes and I've always been satisfied with the taste and quality. I will admit that the portion sizes could be larger so you might want to add an appetizer if you have a big appetite.", "author": "Albert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-03", "description": "The chicken wings are awesome.  All the dishes we had tasted good.  But they keep raising their prices.", "author": "Benny A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Tom Yum soup full of chicken came with garlic pork & brown rice $8.50. Delicious lunch and great value. Friendly server.", "author": "lauren c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "Wow, you must have the mango salad!  Curry dishes are superb.  Always a treat to enjoy great food and in a warm and friendly atmostphere.", "author": "Lynn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "Ate here on a late Sunday afternoon (around 2pm) and it was wonderful. The place was full when we arrived. We waited approximately 10 minutes and then had a lovely table at the window. This is essential San Francisco with the MUNI train running up and down Taraval in front of you. The place is very plain and ordinary, but the food was really good for the price. The lunch special for $7.95 included soup or salad, and two different choices from their extensive menu. I had the yellow chicken curry with potatoes and their deep fried vegetarian roll. Perfect amount of food and friendly service. I also had their Thai Ice Tea and it was perfect. I will return and I recommend this wonderful neighborhood gem.", "author": "Deb B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-24", "description": "Great place for dinner. Inside is very nice and their service is good. This is my go to Thai restaurant. They have great food and its so convenient since I live few blocks away.  I love their Pad Thai, Angel Wings, and the Yellow Curry!", "author": "Ana Alicia D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-09", "description": "I don't know what happened to this place, either the cook changed or they just stopped caring about their food. We used to order delivery from them all the time but slowly their food quality plummeted! Just last night we ordered delivery and we felt like we totally wasted our money! I could've cooked it better and trust me, I'm no cook.\nFirst of all, their Tom yum goong was the absolute WORST I've every tasted! No lemon grass or spice flavor but just tasted like tomato soup with some chili! Second, the beef salad was so dry and the meat was so tough it was hard to chew. And it also seemed like they decreased their portion sizes too. Third, the papaya salad was tolerable but definitely had not to the spice level we asked for... Lastly, the pad Thai was so dry, nard and flavorless that it seemed like someone had left it in the fridge for a while and heated it up in the microwave before bringing it to us.\nThe only reason they get 2 stars instead of 1is because they do have decent service. We're never coming back here again.", "author": "Lydia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "Their garlic pork is definitely worth trying when you're dining here.", "author": "Chad B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-19", "description": "Greasy and lacking flavor. Wish this place was better but it seriously is not.", "author": "Brett P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Small, intimate seating. I ordered the pad-see-ew . It was delicious. Excellent service. I love this spot and would go back for sure!", "author": "M H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-24", "description": "Horrible service waitress served me my salad half way through my meal garlic shrimp was undercooked i had ask for salad twice hole in the wall place with hole in the service", "author": "Eric V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "There are so many thai places to visit in the city. I had never heard of Vanida and a friend suggested that we go. I was a little skeptical about his rants and raves because in my experience a lot of thai places in SF taste the same.\nI immediately liked Vanida because it was small and modern inside and there were lots of sunset locals dining. The servers are very nice and professional and although you will pay more than king of thai noodle it is SO worth it. \nFor apps we had the thai fries- which are sweet potatoes- and spicy chicken wings topped with fried basil. Both plates were licked clean!\nThe main course was yellow and green curries- both perfectly executed and served with fresh crunchy veggies. I had a thai beer to compliment.\nWe were stuffed and even had some leftovers for the next day.\nI think that you can get comparable food at other thai places but with the location and ambiance- its a great spot to have good conversation and a relaxing meal and then walk to your car because there is also tons of free parking.", "author": "M K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "Damn son, a Thai place that does delivery!\n\nForget Dominos pizza you lazy bum and wait for some REAL food to reach your doors.  Or you can go directly to their brick & mortar establishment if you're spending under $17...\n\nSatay was good.\nPapaya salad was spicy...and good.\nDuck curry was really good\n\nThis place is run by some very nice individuals.  very friendly and helpful my first time here and i've been ordering delivery from them ever since whenever its too cold to step outside or whenever outer sunset's gas prices go past $3/gal.  oh well", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "I was in the neighborhood for a job and got hungry. Booted up yelp and discovered this place. Safe to say I am not disappointed. Food was very well priced, and pretty good. The coconut milk soup was fantastic. The curry was light. and not overpowering. Pretty good for the price. I recommend this place if you are in the area and looking for a cheap lunch.", "author": "Gilbert L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-02", "description": "Over-spiced beyond belief.   I like spicy food and even I thought this was too spicy.   I cannot bring my friends to this restaurant because their concept of 'mild' is to eat fire.   They have a nice selection of vegetarian plates, but it is not worth the trip to eat there when the cook does not really know how to flavor the different dishes.  They all taste the same with cayenne and chili", "author": "Axa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-19", "description": "I ordered delivery. I got the Pad Thai, Garlic Pork, and the pork yellow curry.\n\nthe Pad thai was gross. It was all stuck to the bottom of the to go box and it had absolutely no flavor. I ate 2 bites and threw it away because it's disgusting. \n\nThe yellow curry was alright. It's different than I had before because it had potatoes and you could tell they were cooked a long time because there was a lot of potato particles in the curry.\n\nthe Garlic pork was honestly the best. It's sweet savory and comes with a cilantro dipping sauce that is pretty good.", "author": "Jeffrey M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-26", "description": "Absolutely horrible.  Ordered Pineapple Fried Rice, Pad Woon Sen, Pad Karee, Garlic prawns and Beef Pra Ram.  I knew I should have avoided ordering from here when I saw another reviewer say that all of her dishes tasted bland.  She was right.  But I figured it couldn't be that bad.  I was wrong.  Nothing had any flavor to it.  I actually had to add salt!  The only thing that tasted right was the Diet Coke.  Very disappointing meal and pissed that I spent money here.", "author": "Gordon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "So how can i put this in words??? Hah,  AH-MAY-SINGGGGG\n\nThe place is so friendly, and private.  Seriously, why it's still so quite??\nThe food is fantastic. Plus, so much privacy for you to enjoy.\n\nEven though the place is a bit tiny, but don't get fool by the size of this little tiny restaurant. The potion is surprisingly huge. Ohh, and it's yummy.\n\nPS. One of the severs is pretty adorable to. Yeah, you know who you are.\n\nI would say that they have the best peanut sauce in the bay. It's so good. They don't try to americanise the food so much too. They stay straight up thai.  I mean the food can be pretty spicy , but in a good way though.\n\nThis is one of those hole in the wall places in San Francisco for sure, because i think most of their customers must be in the neighborhood, or some hardcore fan that lucky to stumble in to the heaven of cheap awesome thai place", "author": "tim t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-13", "description": "Ordered take out last night from Vanida's.  LOOVE their food.  Especially love their Pra Ram and crispy tofu.  Their soup dishes are also to die for.  It definitely is a secret, but with continued good reviews it won't be.", "author": "Vespa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "I went here for the first time last week for lunch and it was really good. For 10 dollars with tip and tax I got the lunch special which came with soup, rice, and 2 half orders. ( you can pay a dollar extra if you want to get two different items versus just one) this was perfect for me since I couldn't decide what I wanted to eat! \n\nI really don't have anything bad to say about the place. It was clean, the food was good, and the staff was friendly. This is def going to be my new go to place when I am in the  sunset.", "author": "Sangeeta L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "Someone took me here for a working lunch and I thought that the food was pretty good. A really reasonable price (less than $8) for a ton of food in the lunch special.\n\nHowever, ordering in is not the way to go here. The Tom Ka Gai was totally flavorless! Uch!\n\nHowever, they get one star for quick service and their papaya salad.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "Vanida Thai Kitchen recently updated their restaurant and I liked it before, but now I would eat there instead of just take-out.  The people who work here are very friendly, and dress so cute.  \n\nGet the Salad Vanida because even though it's an appetizer it is enough for one, and very healthy for Thai food.  Comes with fried tofu and peanut sauce.  The curry puffs are really good, but are fried so not so healthy.  We also like the spinach, tofu, and peanut sauce dish over rice.  Their Tom Yum isn't as good as King of Thai (but only because the broth is not as rich and spicy).  We also love their sweet potato fries and yellow curry.  \n\nYou should definitely go here for a quiet night out or get take-out or delivery for a quiet night in =).", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-22", "description": "Sorry guys, but this place was awful.  The ambiance is completely dull with droning music and awful service.  I had the worst Pad Thai I have ever had, literally. I love ALL Pad Thai and I would not even have a second taste of it, even after I had to send it back because I asked for the vegetarian version and mine came with prawns, yet was still charged the extra $1.00 for the prawns (!)  I guess you could say their lunch special is a good deal, but if that means the curries were good, that isn't a great measure as curries are always good, they are almost impossible to get wrong!  The Thai Iced tea was WAY too sweet again, couldn't have more than a sip.\n\nSorry, but with a plethora of amazing cuisine in the city, this is the last place to end up.", "author": "Britt X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-10", "description": "It seems that a lot of the reviews are for delivery, but my friends and I ate at Vanida.  I don't know their overall opinions, but I thought it was just okay.  \n\nI had one of the specials on the board, Ginger Salmon, which essentially was over-cooked salmon messily mixed in with 3 kinds of mushrooms, bell peppers, onions and long strips of ginger, flooded with a rather bland sauce.  When I say mixed in, I mean it, the presentation was very messy, although the taste was okay, nothing special.\n\nI also had a bite of my date's Pad See Yew, but it was pretty bland, the only saving grace in my opinion was the perfectly cooked, crunch chinese broccoli.  He did say he thought it was a bit sweet.\n\nI also tried the \"sauce\" from the Garlic Prawns, and I haven't figured out how a sauce made of garlic, pepper and cilantro can be so bland.  And, speaking of bland, another friend got the Combo Noodle Soup, which looked like pho, but apparently didn't have much flavor, he said it was pretty bland, but okay.  The last friend got the Squid Salad, which he said was also okay, but he'd had better.\n\nThe Hot Thai Tea was nice, basically the same thing in the Thai Iced Tea, but without the condensed milk.\n\nI should mention that service was nice, pretty relaxed but attentive.  Our water and tea would usually get topped off when half was gone.  The only glitch was that we were not eating family style, but all of our dishes came out seperately, about 10+ minutes between the first and last dish to arrive.\n\nWas Vanida good?  To use the same thing throughout my review, it was okay.  Will I go to Vanida again? Probably not, even if I'm in the area.", "author": "Crystal B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-25", "description": "This is my go-to Thai place in my neighborhood when I want better quality Thai food than King of Thai. The food is pretty good; my favorite is the duck curry and the noodles are good here too. One thing that I don't like about the food is that when you get curry, you always have to order the rice separately. At King of Thai, rice is included in the price of curry!\n\nI've never eaten in and have always order to-go. I'm a little irked this time because I recently placed an order over the phone and was told it would be ready in 20 minutes (a little longer than the other times I've ordered to-go). Anyways, I showed up 20 minutes later and double parked because I thought I'd be in and out like I usually am. I ended up waiting an extra 15 minutes which made me really antsy and annoyed.", "author": "Jess H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-09", "description": "I love this place. I always take the bus past this place, and I've always wanted to try it. So one day, I walked in and took a look at the menu. Lunch special?! OH BOY. You choose two items, and as I recall, it's pretty cheap. Less than $10 cheap. So yeah, it's pretty frking awesome.\n\nAlrightey, so I had the garlic pork with vanida's green sauce and deep fried tofu. The garlic pork was delicious. It was cooked to perfection, and the sauce was tangy but not too sour. I love the sauce!! The fried tofu was good as well. It was in a thick peanut sauce that I was worried would be too heavy. Actually, it was perfect. It was on a bed of spinach, and surprisingly, I ate the spinach. Usually, I hate spinach. The sauce was so good that I ate the spinach!!! :D\n\nI've had the pad thai, and I approve! It is veeery very good. Don't wait too long to eat it if you get takeout though. The noodles will start to stick together. The one time I came with the boyfriend, we decided to try to curry. It was the curry with duck I believe. It was awesome! Usually, I'm not a big fan of curry unless they're curry fish balls. I love curry fish balls. I really liked the duck though. It wasn't too spicy, but it had a nice kick. I even had leftovers for the next day & it was still great.\n\nI had the beef once, but I didn't like it. It was overly chewy, which is a NO NO for me.\n\nAnyways, everything else is pretty much AWESOME. I recommend.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "5 stars because I love love love this place! Lunch specials are the best. Two items for $7.50 and I always get the green curry with chicken and the garlic pork. Best local Thai food in my opinion.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-31", "description": "Very clean and new looking interior\n\nGood service\n\nLow prices\n\nDecent size portions\n\nAbout 14 small tables. 2 other couples there around 7pm Easter so not much business at that time.\n\nHad Tom Kha Gai soup and lamb currie. Soup OK. Sauce tasty but not gourmet. Lamb was tough. Asked and they said use just a little MSG.\n\nI would go back because it is close by and the food is decent for the price.", "author": "Ross W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-15", "description": "overall, i found everything at vanida mediocre.\n\nyellow curry tofu...good sauce, although a bit runny. potatoes a bit undercooked.\n\npra ram pak...tofu was very dry/overcooked. about half the veggies in the carton were cabbage, which seemed like they were just being cheap. i did like that they served the sauce on the side for takeout, which avoided the tofu getting overly soggy while in transit.\n\nbrown rice...was a little dry. what thai place doesn't get the rice right??\n\nin terms of \"greeness\" this place gets 1 star. the takeout packaging was overly excessive...plastic bags around any container with sauce on it. while i understand this is to prevent leakage, it seems they would be better off getting better quality plastic containers and skipping the plastic bags, like other places do. so now in addition to being a bit undersatisfied with my meal, i'm also feeling the guilt of all the waste that went into packaging said meal.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-05", "description": "We were in the mood for noodles, and came here since it had good reviews on Yelp. It was pretty empty when we arrived, and the service was quick and friendly. We ordered two chicken dishes that really weren't very flavorful. Both were covered in what tasted like chicken gravy, and tasted exactly alike. On the plus side though, the portions were quite generous. Once we finished our meal were then offered some complimentary sliced melon, which really was delicious. \n\nOverall, this isn't the best Thai place we have been to, and I doubt we will be returning in the future.", "author": "Sami R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "From the outside, this place doesn't look like much, but once inside you feel like you're in a nice restaurant. The food is good and can cost less than a meal at Carl's Junior or Subway. Our server was very polite.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "We drove all the way here after a bad chinese restaurant service we walked out from.\n\nThis place was the other extreme. This place is excellent! Food, service, decor, cleanliness, ambiance, noise level - excellent.", "author": "Aneru t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-16", "description": "Just ordered the yellow curry with chicken and I gotta say I wish there was a little more chicken and a little less potato. Especially because the potatoes were huge chunks that were difficult to eat. The flavor was on point though.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-26", "description": "Vanida's like the first time you fall in love. You're 14 all over again, writing love notes in class, kissing in the halls, being jealous of anyone from the opposite sex talking with your (enter pet name). Then something happens because you're too young and naive and someone gets jealous and maybe throws a shoe. Before you know it your mending your broken heart of some mint chip ice cream, beers and your girlfriends. As they say time heals all wounds and before you know it you're back on your feet. \n\nA year or two goes by and you somehow end up seeing you them. Heart starts racing and a rush of old feelings comes back to you, like you once had. After a few drinks you end up tyring to rekindle that old flame you once had. Sad thing is, some things are never what they may seem. You grow older and change. The things you once thought were good are no longer good to you now. It's just not the same. \n\nIt will never be the same. \n\nVanida was my first love of Thai. But since the remodel everything has changed. It's just not what it use to be. Sad to say but I will not be going back anytime soon. Only thing still good is the Thai french fries.", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-08", "description": "I've been here twice so I'm pretty sure you can't say it's just inconsistency...\nTheir curry noodles are pretty good, if you ignore the fact that the lettuce in the dish seems completely random. Their pineapple fried rice is pretty good, if you ignore the dryness of the chicken and the soggy cashews. Their seafood pumpkin curry is pretty good, if you don't mind only getting one and a half scallops. Their Tom Yum Goong...it is not pretty good. King of Thai Noodle does most of this stuff better, also faster and cheaper. The portions are smaller so if you order family style be prepared to order one or two dishes more than the number of people eating. I was also annoyed by the n00b chef  who couldn't cut the chicken in consistent (as in able to fit in one's mouth) sizes.", "author": "Skye L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-24", "description": "I ordered the appetizer Mee Krob which is described on the menu as crispy sweet needles with grilled shrimp and bean sprouts.   When I got it home 5 minutes later and opened container it was a sticky mess of brown \"something\"s that couldn't be easily separated  AND there were only 2 shriveled \"grilled shrimp\".  When I called to complain I was told by the man that answered \"that's the way it's supposed to be.  The noodles are the main part of the dish.\"  When I pointed out that all the other appetizers with the shrimp, which are the same price, which he confirmed, \"yes there are many more in the other appetizers\" he made no effort to try and make things right.  He just said, \"that's it\".  I would have expected that a restaurant that wants to maintain customers and build a good reputation would have at least offered a free side of sticky rice the next time I came in.   I'm not going back.  There's too many other good Thai restaurants in this area.  Vanida, learn how to treat your customers. You blew it! OH, and I think you should add to the description of this dish, 2 over cooked shrimp ONLY.", "author": "Paula C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-16", "description": "I came here on a foggy summer Monday night. It was one of those \"I don't know where to go\" nights. I think we came when it was just remodeled, so it was pretty empty. Parking in the Sunset at night is rather easy, I found a spot right around the corner. Park on the avenues, there's guaranteed spots. I did not use the bathroom, so my review was based on the food. I would assume the bathroom's nice, since the restaurant looked more presentable than most Thai places.\n\nWe ordered two entrees. I think we ordered a yellow curry with chicken and some beef skewers with peanut sauce. The peanut sauce was awesome, and the yellow curry was better than most places (with a slightly larger portion). I REGRET not trying the Pad Thai, I do not know what I was thinking. I will be back one day, I promise.", "author": "Glen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-31", "description": "My parents like to frequent this place whenever my mom doesn't feel like cooking and wants her Thai. The place is small and cramped but there are hardly ever more than 3 tables full so that's ok. \n\nThe food is pretty good, not exceptional, but I really do like their Tom Yum Noodle Soup. It's the best I've had in this city. The soup is a bit tart with a bit of savoriness from the chicken broth and some kick to it from the chili. \n\nI've had their pad kee mao and I must say it's hit or miss. On certain days it'll blow your mind as to how good it is. There's a lot of \"breath of wok\" or \"wok hei\" in it. Essentially the way I describe it is \"the essence of the flavor in the smell of the food,\" (Sounded a bit like Confucius there). And basically the way you experience it is, when one eats, one breathes, either through his or her mouth or through their nose. So when eating, with food in your mouth, especially when the food is piping-fresh-from-the-wok hot, you inhale through your mouth slightly to cool the food down. Well the scent from the food, travels to the back of your mouth, and some of it goes up into your olfactory sensors. And you know how they say that 80% of the taste of food is in its scent. That's where you get the essence!\n\nOk Biology lesson aside, yeah the Pad Kee Mao is hit or miss. Sometimes I get that great flavor and taste and sometimes its just mush. \n\nThe kitchen doesn't seem to have a good ventilation system because I always leave here smelling like my dinner.", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "3 stars just because it's Thai food, all of the regular dishes (which means super tasty, duh, it's Thai food) at the exact same degree of deliciousness that any good Thai restaurant has.  I wouldn't travel too far to go here, but Vanida is close to me so I will continue to eat here at least once weekly.\n\n+1 extra star for having Praram and making it exactly how I want it to taste, and also having a few additional dishes that I haven't had before that are delicious.  Really every dish I've had here has been perfect.\n\n+1 star for having incredible service.  Always really friendly, nice, and attentive.  On my first visit, I met the chef when he came out and asked if I enjoyed my meal (I wouldn't expect that though, I don't eat at 12 and 6 like most people so it was slow when I was there, I'd imagine it gets busy during normal dinner hours)", "author": "Greg J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "I can't think of any other Thai place in the city that has the portion size, the price and the over all good food Vanida has. The people are chill, the atmosphere looks fancy without the fancy price tag. \n\nI would really recommend this place  to anybody who wants a break from other Thai restaurants , or anyone who wants a good meal in general.", "author": "Cristhian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Went last night. Got the Tofu Pra Ram. My lady bird got the Garlic Tofu. Both dishes were extremely delicious. The restaurant itself was quaint and homely, it's very ambient. We will be frequenting this place often.", "author": "Cove C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-22", "description": "Not sure why this restaurant could get 4 stars. Was there on sat for lunch a few weeks ago. The restaurant was packed but there's only 1 server. Waited a long time to order and of course our food as well. The server wasn't friendly at all and she didn't even get us water. The free tom yum soup is salty. Doesn't have any taste of spices you usually find in regular tom yum soup at all. I ordered a beef and it was cold, not even warm which is odd. My husband ordered yellow curry and 2/3 of the tiny little bowl was curry sauce only. The only thing hot was the rice. We had to order an extra bowl of rice. Both food and service are terrible.", "author": "Bethany Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-26", "description": "I've always loved this restaurant. I've been to a lot of thai restaurants in the city from khan toke to king of thai, and Vanida's always in a league of it's own compared to others.\n\nThe menu is extensive and offers a variety of dishes, many of which I have yet to try, but will eventually get to in the future. But of the dishes I have tried, I LOVED every one of them. I recommend getting the garlic prawns or the chicken and peanut sauce mmmmmmmmm. And all the dishes were reasonably priced.\n\nService is always excellent when i come here, waitresses are attentive, nice, and you can tell they care about their customers.  In fact I remember a few times when I was dining with a friend, I overhear one of the waitresses talk to another customer and the tone of the conversation is always friendly as if they knew each other for years.\n\nParking is kind of limited since it's in the middle of a residential area, however the MUNI L Train stops by there so it's still easy to get to.\n\nOverall I've never had a bad experience here, the food and service is awesome, and won't hurt your wallet. I highly recommend this restaurant to any Thai food lovers out there. \n\n\n\n\n\n\nOh yeah if you go make sure you get the fried banana and ice cream!", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "The pork wasn't charred, but it was tasty. We Had four things and they were all good. I would come here again. It's also close to the zoo.", "author": "dave c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "I was known, for a thai-ime (har har) as the tofu todd dude. What that means is essentially i came in here, ordered the dish several times and they remembered me. To be remembered is a good thing, but better is this bomb thai food.\n Lunch specials with choices and it includes soup and rice. The garlic pork is supreme.\n\n Dinner, all is good, all is delicious, the curry fantastic, the pra ram delightful. This is a good place to explore new options too.\n\n Come check it out!", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "Great food and service! Love all the vegetarian options. The yellow curry is the best we've had in or out of Thailand!", "author": "Veg V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-24", "description": "I came here when I really wanted to try this place out. The waitress seated me with a menu and shortly after brought me an iced water. I was craving some pumpkin curry but it wasn't on the menu. The waiter told me they have it and it comes with chicken in it. I was looking through the menu and he suggested that it should be enough. Okay, but later on I was craving some barbeque chicken so I ordered that as well. The curry came within 10 minutes of ordering and the same with the barbeque chicken. The pumpkin in the curry tasted like it was cooked just right but I prefer it to be cooked a little longer because it is kind of hard. The same goes for the bell peppers. I thought that the dish wasn't cooked thoroughly enough. After that my barbeque chicken came smelling oh so delicious. I thought they gave me some low quality pieces of chicken though -the pieces were small and mainly bones. I noticed they used some kind of sauce or oil that had this neon yellow color to it which made it taste very good. Both dishes were pretty average and same goes for the prices. Except for the pumpkin curry which was kind of expensive for such a small portion and not as good quality.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "We have been going to Vanida for over 20 years.  It is a wonderful little family-run restaurant in the Outer Sunset.  The food is consistently delicious.  Three of our favorites are the green curry (best ever), Yum Yai (a green bean dish with meat, shrimp and nuts) and fried calamari.  Service is friendly and efficient.  Prices are extremely reasonable.   We love their food so much that last week they catered our wedding reception.  They did a great job and everyone went home raving about the food and the staff.  Selfishly, I don't want to let the word get out about how great they are.  (It's a small space and I never want to have to worry about getting a table.)  But owners, Paul and Bangon, well deserve the recognition.", "author": "Anne Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "I must say, I was pleasantly surprised. Always passing this place by and seeing how depressingly empty it was, I would always either go to either one of the other restaurants instead of this place. But today, my brother wanted to get some thai food and suggested this place. I think this is the last place that I haven't tried in this area of the 'hood. He wanted a chicken pad thai and ordered a shrimp pad kee mao. The only difference I could tell is mine was spicier and did not have the tofu and tamarind sauce that is used sometimes in the pad thai...Or whatever sauce they use...\n\nAnyways, I ordered and waited. Not that long later, the food was ready and I was ready to go. Freaking touched the bottom of the bag and got scorched! It was freaking hot! Usually some places let it cool a little. This place is heat and pack! I love that! How can you not like it when a place is concerned about cold noodles? Freaking awesome! \n\nSo when I got home, I started eating. I liked the flavors and the shrimp. It wasn't over cooked like other places usually do theirs. The noodles weren't all that clumpy. Only when it started cooling down did it start to clump together. The one thing, though, was the amount of oil that was used. Dear God, I could have stir fried another order with the oil that had settled on the bottom of the box. Maybe to keep the noodles from clumping...Still, too much oil. That's my only gripe.\n\n\nSo, seeing as how this is my first time here, I need more excursions for more research. But at this moment, the four star rating stands. I shall update this when I get a chance.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "This is a review from a vegetarian!\nGreat food, tons of vegetarian options. Their lunch combo specials are super worth it and super-filling. Rice, veggies and soup..wow!\nThe staff is friendly and efficient.\nThe interiors were simple and nice, not overly done up or cluttered like other Thai places. We got parking across the street on a Sunday afternoon.", "author": "Soniya R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "I get delivery from Vanida and occasionally eat at the restaurant.  Food is good and the service is good.  Garlic Pork is a favorite as well as beef salad.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Garlic pork way yummy. Angel wings nicely tasty, very flavorful. Eggplant with chicken nearly perfect. Fish fillet with ginger a delight with bell peppers, onions and lovely sauce. Quick, friendly, reasonably priced. Love it, again.", "author": "Eos d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-07", "description": "My quest to explore more Thai restaurants continues and that is why I ended up here.I have heard about this place from several people and of course here on yelp reading the reviews.I thought to give try Vanida out.\n\nLocated in the Outer Sunset on Taraval btw 40/41st avenue Vanida is not that large,but just enough room to have a decent crowd.You walk in and there are tables on the right and left.Interesting decor I must say.\n\nSo,moving on we decided to go with the lunch special which means you can make a choice of one selection of about $6 or 2 selections for about $7,of course w/tax.\n\nWe decided on:\n\nGa Prow-  w/chicken,chili,garlic,bell pepper and basil.This dish had an amazing taste.Quite good and flavorful(heck,I am no expect on Thai) to me.\n\nGarlic Prawn- w/garlic,pepper and cilantro.Another filled with seasons and Pad See-ew- w/chicken,which we thought was decent.The Pad See-ew was not part of the lunch special.\n\nI have a habit or ordering the same things,but I must say they have a really good menu to make plenty selections from.\n\nLunch special(I recommend)\nLunch combo(vegetarian selections)\nOver rice selections\nStir-fried noodles\nSoup Noodles,curries,seafood and desserts.\n\nI must say that I will be back to try the Pa-nang curry,Prig Sod and much more.\n\nFriendly service.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "I recently moved to the neighborhood and was happy to find a Thai place so close.  I have gotten take out a few times now, and it has been good (and consistent) each time.  \n\nI know it is completely unneccesary, but I love it when they give you tea while you wait for your food.  This place does just that and it is super yummy.  The food comes out so quickly though, that I barely have time to let it cool enough to drink it...and thats a good thing (makes take-out just a little too easy...oops).  \n\nI haven't eaten there yet, but the ambiance is very nice.  Pretty small place, but it is never too crowded.\n\nSo, why just 4 stars?...I compare every thai food place to Marnee, and never find one just as good.  This comes closer than most though :)", "author": "Corrie F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-21", "description": "I'm torn between giving Vanida a great review or just a so-so one.  The reason being is that they are one of the few Thai restaurants that deliver.  I feel that I should rate them based on the food quality more than the fact that I live in the boonies of SF.  Well . . . read on for the review:\n\nI ordered the pad see-ew and all the noodles were broken up.  How weird!  I've never had pad see-ew with completely broken noodles.  You should definitely this dessert they have.  It's the fried plantain with coconut ice cream.  OMG, it's so good.  Sadly, the dessert was better than the entree!  \n\nLike I rated, I've experienced better . . . much better.", "author": "Manton R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-18", "description": "This is horrid Thai food.  I ordered the Pad See Ew, Pad Thai, and Soup and what I got was bland or uncooked noodles.  The delivery was fast but the food is not even decent.  I was starving and even then, I couldn't finish my dish.", "author": "Markus D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-09", "description": "I've only come here once (May 08) but everything we ordered was OUTSTANDING.  Even as take-out, the texture and flavor integrity was not lost in the neatly packed boxes.  Spice levels perfect, veggie accents crisp and fresh.  Toasted coconut palpable.  This is one of the few restaurants in SF that I will fast for days in advance so that I can grub out on extra entrees.\n\nI learned from my last visit the best way to roll in here is in 3-5 group and share more plates.  Like me you will probably want to order about 90% of what is on the menu, it's that good.", "author": "Molasses C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-05", "description": "Vanida Thai is amazing! My fiance and I are vegan and Vanida is super accommodating. I recommend the Crispy Basil Tofu and the yellow curry with potatoes and veggies. If you like curry spicy, you have to ask for it extra spicy; it usually comes pretty mild. They can pretty much make anything on the menu vegan for you, just ask : )", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-23", "description": "A little undiscovered treasure....have only been there twice but everything has been good....tod mun, red curry, basil chicken, pork and eggplant, green curry, green beans with prawns....very reasonable prices and attentive staff, parking is always easy!\n\nOn my first visit, we were being slightly harassed by a seemingly crazy lady in the next table. she must be a regular because the staff very slyly offerred to seat us at a bigger table, far away from her comments!", "author": "Amina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "We had dinner here with he girlfriend and her family.  It's been a restaurant they have frequented often in the past and now I know why.\n\nTheir food is very reasonably priced, portions are good and most importantly tastes great.  Their coconut soup is unique and also very good.  We had the lamb and beef satays which were flavorful and grilled to perfection.  Yellow curry with chicken was good, but the potatoes seemed under cook. Beef salad wasn't all that. \n\nCome hungry, leave happy!\n\nIf this place had ladyboys hanging out inside and sex show clubs next door you would think you were in Thailand.\n\nSa Waa Dee Kup", "author": "Sun-Kai P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-18", "description": "2 stars for the dry-as-dust, chuck-full-of-bones bbq chicken I ordered last night! Boo.\n\nI will never order that again, and didn't even come with sauce...I'll just stick with their grilled pork with green sauce!", "author": "Jade B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-31", "description": "I totally love the hot tea they serve, most excellent indeed, my good man.  It's a deep orange almost sandalwood flavored affair, something the waitress insists is called \"Thai tea\" ah, quite interesting.\n\nAnyhow... I went here alone one day for lunch and it was pretty decent.  DEFINITELY one of these places where I ask for spicy food and am brought something significantly less than spicy, but the flavors were on at least, and this so-called \"Thai tea\" was tasty.\n\nI went back with my roommate a couple nights ago and it was a much different experience.  He got Cashew chicken, which was tasty but greasy, I mean like orange rainbows all over the bottom of the plate, all pooling up, staring back at us like an ocean of shame and despair.  Shucks.  I got red curry with tofu and chicken and not only was it NOT spicy, it was totally bland.  Completely bogus, I was really pulling for this little place.\n\nInsult to injury came when the bill read $6.00 for brown rice.  Double you tee eff?  SRSLY?  \n\nSo, you tell me... if you have THIS exchange with your waitress:\n\n- would you like white rice?\n- do you have brown rice?\n- yes.\n- okay, we'll have brown rice.\n\nAre you going to be expecting a six DOLLAR charge for it?\n\nNeedless to say, it's tempting to leave an embarrassingly small tip when something like that happens.  She could have at least said SOMETHING.", "author": "Blake C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-05", "description": "Don't be fooled by the exterior. One of the best thai places in bay area. Clean inside and great service. The food was really good, flavorful without being overpowering.  i'll definitely come back the next time i'm in the neighborhood.  the family still is talking about how they're craving thai food from this place", "author": "Andres A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-05", "description": "papaya salad is very good.\npass on the mango sticky rice, rice is hard.", "author": "Sydney L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-30", "description": "so after searching for a place that had good reviews and delivered for 20 mins we decided to go with this place.  We were really disappointed.  We ordered pad thai and satay and garlic chicken.\n\nthe pad thai was really sticky it pretty much came in the shape of the box, only had 3 shrimp and had no flavor.\n\nThe satay was ok, it was a little tough and sauce was not that eventful\n\nthe garlic chicken was ok.  It reminded me of ground italian sausage.\n\nI hope this is not what we have to look forward to in thai takeout", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-11", "description": "The only thing good here was the Singha beer and of course they can't take much credit for that, other than keeping it nicely chilled. The Tom Yum soup was inedible, and the chicken bits in it were particularly cardboard-like. I ordered a particular fish dish and didn't get what I ordered. I was too hungry to complain, so I just ate it, though they did offer to correct it, I just couldn't be bothered to wait longer. The fish itself was awful, had that old fishy taste that low quality or old fish often has. They did give me the beer for free to apologize for the order mix-up, but sadly, the food just wasn't good, so the only honest review is that which I'm giving here.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "Since Silver Spoon closed down in West Portal, this is the only Thai place in Parkside I want to order from. They are extremely friendly and obliging and the food arrives literally in 10 minutes. Don't know how they can do that.", "author": "p v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-14", "description": "Vanida how I love you.\n\nYour Pad Thai is to die for.  And I think I would murder someone for your Thai French Fries.\n\nBut I do not like that you have raised your prices.  Especially when you were already overpriced to begin with.\n\nOh, and I really hated that time that I tried calling you for like an hour and half and your phone line was busy.  The entire time.  I now had my heart set on Vanida so I took the  Muni down to you to get something to go.  Before I ordered i asked you what was wrong with your phone because i had been calling forever and it was just busy.  You then looked down at the phone and realized it was actually on.  This whole time you had the phone laying face down while on the hook.  And you didn't even notice.  For shame.", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-18", "description": "I went here a few nights ago with a friend to meet up for dinner. It was excellent all around. The thai food here is OUTSTANDING. I ordered the vanida salad (which came with yummy peanut sauce) and the red curry with tofu. Delicious.", "author": "Regina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-06", "description": "You cannot beat this place for lunch. $6.95 for a two item lunch with yummy chicken coconut soup!\n\nI highly recommend the Garlic Prawns, the Red curry Beef and the Garlic Pork. Everything I have tried has been delicious and affordable.", "author": "Hank T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-06", "description": "I like this place. Last night the kind server gave us complimentary tea as we awaited our takeout.  \n \nThe vegetarian yellow curry was rich and delicious. Even when the veggies ran out, we couldn't bear to let the curry go to waste -- my brother-in-law poured it on his rice and ate it sans vegetables.  If he hadn't done that, someone else probably would've just drank it.  Yeah it's good curry. \n \nThe crispy tofu with crispy basil was sticky and very sweet. I liked it, but after a while the sweetness was just too much. Definitely a dish for sharing.", "author": "angela n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-11", "description": "There's nothing wrong with pizza until you eat it for what seems to be 24/7, like me. And then to \"switch it up a bit,\" you opt for spaghetti or hamburgers? Eh. I beg to differ. I have found that my palate needs a wide variety of eclectic and interesting cuisine. After ordering Brothers' Pizza for the 52nd time since moving here, I practically begged the man who pays for my meals to order something different. Different, as in, not pizza. Or hamburgers. Or tacos with JUST meat and cheese. My tastebuds were craving something a bit more exotic. Mr. Meat and Potatoes, himself, blew me away with his suggestion of ordering Thai.\n\nI love Thai food, so I was ecstatic. \n\nI had the Red Curry and that other guy I was talking about ordered the BBQ chicken (don't remember the Thai name for it) and everything was delicious. I normally order Thai as hot/Thai hot, (depending on my mood), but however they make it without any special requests was fine with me. It was more than satisfying. \n\nMy one complaint: they didn't give us enough rice. It was good. And I wanted more of it.  And I'd appreciate it if it was complimentary. But you know, the prices are fair, so I guess I shouldn't be complaining.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "If you're Asian or dating an Asian continue to read on. Anything else go ahead and eat here if you like. \n\nI went here based on the yelp ratings but I should have read multiple reviews further down. My family and I went here late on a Saturday night and the place was dead. I thought to myself \"score\". I have been to Thailand which doesn't make me a Thai food expert but I know what's good at least. BTW in Thailand, Thai food is just called food and Thai tea is just tea. They also had a picture of the king and queen on the back wall, the Thais love their royalty so I thought I was in the right place.  \n\nWe sat down immediately and questioned the waitress about the menu. She was the nicest person. We first asked about the papaya salad in which my wife had a craving for. Come to learn that it was the water down 'American' version and they did not have the ingredients to create the original Thai version, which if you're white and still reading this, order it this way, It will change your life, kind of like reading Fight Club or V for Vendetta. First rule of ordering papaya salad, order authentic. So no go on the original and she seemed to be offended that we would ask for something so horrific but in her nice way.  Then we asked for it spicy. No questions about spicyness but I think spicyness is really subjective because my level 4 spicy and your level 2 spicy is probably the same thing. She didn't ask what level like how some restaurants ask but she should know spicy. When she placed the order my over heard the waitress and the cook confirming the level of heat in the dish. We also had the angle wings and tom ka coconut soup. The wings come to find out are just wings. Every Thai place I have ever been to stuff their angle wings with some kind of chicken concoction and deep fry the crap of it. The Thais love their deep frying methods and I love them for this. But this was plain wings. When the papaya salad came out it was spicy at all. Again a water down interpretation of the salad revered by the people who created their own version of donkey show which includes a ping pong. \n\nThe tom ka soup had to much coconut it which made it too creamy and was almost a dessert soup. Weird I know. And it used too many onions as a filler making seem like the soup was more hearty than it actually was. I hate large slivers of onion in anything. Someone else made the same comment but it was too late. I gave them a 3 out of 5 because the quality of the food was great and the wait staff was attentive and really nice. \n\nI'm glad to see that no where do they refer to their food as authentic because it is not and they need to take down the picture of the king and queen because if they came to eat here, he would slap her for not going on Yelp and reading my review. If you like to be catered to by really nice people but could care less about having mediocre food, this is the place to go. If you want to have good food by the worse people then go to king of Thai noodles. I hate King of Thai Noodles but their food is so delicious! Damn you insensitive artisans", "author": "Paul T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-26", "description": "This is a reasonably priced Thai place - but what makes it great is the quality of the food.\n\nThe chicken satay appetizer was great - the peanut sauce was very tasty, and the chicken was juicy and well seasoned.  I had Pad Thai Pak for my entree, and it was the best Pad Thai I've had since moving to the city last year.  My partner had the red curry, which I shared, and it was also very good.\n\nThe portions are generous, especially for the price, and the wait staff was extremely friendly and helpful.\n\nThe only downside I saw is that since they don't have a soda fountain, there's no free refills on soda drinks.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-28", "description": "Me and my buddy tried out Vanida a few weeks back.  We decided to try most of the nights special displayed on the board in the back wall.  They had an appetizer combo special and pumpkin curry with chicken special.\n\nThe soup we ordered really threw us for a loop.  I ordered the creamy corn soup, which I thought was going to be brothy.  In fact, the soup was sweet and heavy on tofu; very much resembling the chinese dessert, dofu fa. So, the soup was quite peculiar to start off our meal.\n\nThen came the combo appetizer platter consisting of egg rolls, shrimp rolls, curry puffs and fish cakes.  It was nice that they had a different dipping sauce to accompany each item.  But none of the appetizers really stood out.\n\nFor our main course we got the pumpkin curry and Nuer Yang (BBQ ), charbroiled marinated beef; served with Vanida green sauce.  The pumpkin curry was a little too runny.  It was spicy and had a kick to it though.  The curry was actually better the next day.  I thickened it up a bit and added some heavy cream.... yum.  Now, that was good stuff.\n\nThe beef was really tough and chewy.  For some reason I haven't had much luck with grilled meat at Thai restaurants so far.\n\nBased on the reviews for this place, we probably hit Vanida on an off night and probably ordered the wrong items.  Its a pretty nice spot in the Outer Sunset and the prices are good.  Perhaps another time Vanida.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-06", "description": "If you're not keeping an eye out, Vanida's a place that can be easily missed.  An unassuming, homey Thai restaurant in the outer reaches of the Sunset, Vanida offers the usual Thai fixins, with fast service from friendly staff.  Even though portions are smaller than usual, their lunch specials are still worth taking advantage of.  \n\nCheck out their website; just don't expect the ambience and decor to be quite as nicely designed as their site.  But the food measures up, and that's what really counts.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "I ordered their food over the p hone through delivery! I enjoyed the Thai tea and the BBQ chicken. :-)", "author": "Ronnel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "Loved the food here, but the proportions they give you vs. the price isn't really fair. I think if they gave you more servings it will be better. The outside of the restaurant looks very dirty and such, which was my first impression, but right when I went it I got wowed by it's creativity. There was lovely decorations everywhere which captured the scenario that your in Thailand, or something like that. I'd recommend this if only it was a bit cheaper.", "author": "Jeffy Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-14", "description": "We wish there was a 3.5 stars because that's what we would've given them.  However, if we give Marnee Thai a four, it can only be fair to give Vanida Thai a very full 3 stars.\n\nWe've only eaten here once, so this review may change as time progresses.  However, in the one time that we visited this place, we were very pleased.  We had their Pad See Ew and spicy pork.  The Pad See Ew  had a lot of chicken and vegetables and this was the one time that we actually preferred to eat more noodles and get less for our money.  But that shouldn't be a knock against them for providing good value.  As for the spicy pork, it was good, but not memorable-- it tasted similar to other spicy pork dishes in Thai restaurants.\n\nWhat people say is true-- VT is in the boonies of the Sunset.  We live several blocks from here but if it weren't for a friend's recommendation, we would've never found the place. \n\nParking is adequate, as it is in a residential area.  If you're ever stuck around 40th and Taraval, looking for a place to eat, we hope you consider Vanida Thai.", "author": "Kel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-11", "description": "great people & great food.\n\nall the food we get is yum!!!\n\ni nominate the following dishes:\n\nyellow curry\ngarlic pork (the cilanro dipping sauce is killer)\ntofu basil\npad that\nduck noodle soup\n\n\nmmmmm.............", "author": "Tiger Lily .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-06", "description": "Red Curry -$7.75 with Brown Rice-$2.25.\nFresh,very tasty, and satisfying.\nThe waitresses there are Thai and wear traditional dress.\nVery good and prompt service.", "author": "Mag N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "3 1/2 Stars.\n\nI've been here a couple of times now... It's really close to my house, so I kind of have no choice when I have nothing to eat... Haha.\n\nWell, the ambiance of this place is very nice. It's nice and cozy in this place. Definitely a plus.\n\nThe service here is okay/ pretty good. When I come in to get take out, they always greet me really nice. But sometimes, they seem a bit off. Yesterday, I came in during lunchtime, and the waitress, though very nice, seemed quite nervous. Her smile was a bit off and a little fake... But the service otherwise is good. A while back, I came in for lunch and I wasn't feeling all that great. I was a little sick, and when I couldn't finish my food, the waitress asked if there was anything wrong with the food and if I was okay. i felt like that was a bold move and I considered it good customer service. Also, when I ask for their opinion on what to get, they are very honest on what they recommend and don't, which is another plus.\n\nAnyways, the food here is pretty good. I consider this restaurant a little fancier than most Thai restaurants.\n\nYesterday, I got the lunch special. The special includes one ($6.50) or two ($7.50) picks of entrees, a big scoop of rice, and your choice of soup or salad. I ordered two things: Pad Thai (+$1) & Red Curry with Beef. I also get the Tom Yum here, so I decided to get the Tom Kha Gai (coconut milk soup) I also had a Thai Iced Tea. The first thing that came was the Thai Iced Tea. This place has, arguably, the best Thai Iced Tea. The soup came next, and I was surprised. I usually dislike things that have coconut in it, but the soup was amazingly good. The chicken in the soup melted in my mouth. The whole entree came next. The Pad Thai didn't have much flavor. I didn't enjoy it that much. But the Red Curry was delicious. It had beef, zucchini, string beans, bamboos, and basil. It was a little spicy, which I like a lot. I expected the beef to be overcooked, but it was soft and tender, which made the meal pretty good.\n\nI've had many other things here. Fish cakes, Garlic Pork, and BBQ Chicken are all really good. I've also had the Tom Yum Noodle Soup, which is very good also. The calamari and Pad See Ew are things I'd skip. They're both OKAY, but nothing special. And the one complaint I have about all these dishes? The portions are kinda small and the price is a little more than other Thai places. When I ate the Tom Yum Noodle Soup, I drank it down til there was not a drop left of it, and I felt like I ate almost nothing... I mean, c'mon...\n\nOverall, I really like this place. I will come back here time after time to try more things, but I really think they need to have bigger portions. I think it's only fully worth it during lunchtime. And when they do give big portions, I'll give them a full 4 stars.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-28", "description": "I love Thai food and just moved to the area, so when I saw there was a Thai restaurant a few blocks from my house, I felt obligated to check it out. When I went to Vanida, I was the only person in the restaurant, primarily because it was in the middle of the week and they had just opened for dinner five minutes earlier. Every other time I've passed by, they've always had a full house. In any case, service was great: quick, friendly, helpful. Decor was relaxing and very clean feeling. The food was fresh and delicious. Much lighter and cripser than a lot of other Thai food I've had (and Thai tends to be pretty light to begin with). I ordered the tom kha gai soup and there was so much of it that I had to take my yellow curry chicken and jasmine rice home. Everything was very inexpensive and well worth it. They do delivery with a $17 minimum. Can't wait to go back.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "Vanida means 'beautiful lady.\" \nThere were about a half dozen things on the menu that fought for first meal status. I'm not sure why I never stopped in here before, but now that I have, I will be a regular. Only a couple blocks from my house, and open until 9:30, this little well-made-over Thai restaurant looks like it has been around a while from the signs outside, but the interior looks recently remodeled. I like that they carried the wood flooring up onto walls, benches and window sills. \nWe started with hot tea and appetizers of lamb satay, and the Thai French Fries. Yam fried in cocoa butter - not on my diet, but very tasty! \nI ordered the duck curry with brown rice, and was thrilled at the medium spicy taste. The duck was tender for the most part, and the veggies seemed fresh. The by-the-glass merlot was reasonable. \nMy bf ordered the Nuer Beef, that came with a green sauce that went amazingly well with the pineapple chunks from my curry. The beef was tender overall, and well cooked. \nThey offer an unsweetened Thai Iced Tea, which is on my list to try next time.\nPresentation was lovely on square and trapezoidal service. \nThe acoustics are, well, let's just say you should keep your voice down if you want to have a private conversation. The smooth ceiling bounces every sound across the room. \nA table of biologists chatted about turtles and manatee across from us, and a couple of regulars ate quietly. I'm not sure what the couple next to us did, but they refused a free entree from the staff laughingly saying, \"You gave us a free one last time. We WANT to pay!\" \nThe impression overall was that the hipster grandkids of the original owners have redone the place and contemporized it. Still feels family, but everyone behind the counter was under 30, and the music was a local radio station playing what is probably called 'adult contemporary.'\nThe dinner prices are very reasonable. We got out of there under $50 for two appetizers, wine, tea, and two entrees. \nLunch specials look really good and fairly priced. \nClosed Sunday!", "author": "Char Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "I have lived in the neighborhood for a few years now and have been here about 4 times and ordered delivery twice. \n\nI had lunch there today and enjoyed it very much. I wanted to have Tom Yum soup and a good Thai salad, but they don't seem to serve salad for lunch or dinner. Except for one papaya salad appetizer for dinner. Oh well, I would rather they not serve it at all if they can't make it fresh and well. \n\nI had Gai Yang which is Charbroiled marinated chicken with a Sweet and sour sauce on the side. This came with house salad or Tom Yum. So I ordered the vegi Tom Yum and loved it. The chicken dish was a first for me, the skin was left on, so I removed it. I did taste it and it was delicious, spiced and crispy. I would have eaten it if I were not trying to eat healthy. \n\nThe new deco was way nicer than before, the place was more than 1/2 full at 2:00 an a Wednesday. The server was nice and prompt, the food came out timely and hot. \n\nMy only recommendations for improvement are...1. Take out has something to be desired. I don't know what exactly, but by the time it is delivered it seems the timing, temperature and textures are off. 2. Play something other than modern pop music, the ambiance would have encouraged me to stay longer and perhaps order more and 3. when seating a party of one say \"lunch or dinner for one?\" instead of \"all by yourself? \" Some people are sensitive about eating alone. \n\nA lady had her lap top and was drinking a glass of wine. This led me to believe that they are OK with you hanging around for awhile and catching up on work which was cool. \n\nI will be back, with my lap top.\n\nI have a new favorite dish. The yum green bean. Its a salad of green beans with cashews, lime jice, chiles, toasted coconut. Super yummy!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-23", "description": "Good food, especially if you live in the Outer Sunset where choices are somewhat limited.\n\nIs it worth a trek crosstown? I dunno...", "author": "Stanley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-23", "description": "Came here one night for dinner with my cousin craving some thai food, and boy did we go to the right place. We were seated immediately. We came on a weekday so the place wasnt packed. The service was very nice and patient.\n\nThe food was great. We had the chicken Pad Thai, Chicken with peanut sauce, and 2 sides of white rice. All very good.\n\nA great alternative to King of Thai if you're in the neighborhood, otherwise it can be a bit far. Parking was not too bad, but I hear it can be difficult.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "I love this place only been there twice but each time the food has been great.  the fried tofu and eggplant is a favorite and last night I had their special which was mango curry...it was soooo delicious!  The prices are super reasonable...the décor nothing special but it is clean and really I am there for the food.  My roommate has ordered take out a few time from there and she said they delivery time is super fast.", "author": "Shawn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-10", "description": "I've been there twice, once dine in, and once take out - food was only ok, but BAD service! I don't care how busy or under staffed they are, you don't just collect the $$$ and walk away. No greeting, no smile, and the worst part? The food was ready, sitting on a table, I had to ask to find that out, and all she did was pointed at the box! Really?? That's how you guys treat your customers in this economy? Well good luck. For sure I won't go back. I'd rather go a little further to Marnee Thai on Irving, who has better food and way better service.", "author": "Kai Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-31", "description": "i came here for lunch with my boyfriend, because it was near my work. we both ordered lunch specials - they came with a soup. mine was a vegetarian one and his was the chicken. his soup had nice big chunks of chicken, mine had some tiny but obvious pieces of chicken. \n\nthe rest of our food was ok but a little greasy. \n\nvegetarians beware!!!", "author": "huong n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-17", "description": "Gotta love delivery in 30 minutes that arrives in about 12 minutes (well, we do live 3 blocks away).  Must have been slow on a Sunday night.  Eggplant with pork, duck curry and musamun (sp?) chicken were all good.  My daughter chowed down on beef noodle soup (since she is a full on noodle junkie).   No leftovers so that should say enough.", "author": "Glenn L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-15", "description": "Honestly the food wasnt that bad . . . but still below average.  Servings were on the small side, we order a side of brown rice for 2.25 and it was only enough for one person . . . . prices defiantly dont match the serving size.  Also delivery was late.\n\nLast time we go through them, sorry Vanida.", "author": "vanessa f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-27", "description": "This place is helllllla good yo.\n\nI had the yellow curry chicken and some of the (not really) spicy prawns with rice for a lunch combo, with the chicken coconut soup. Plus, a delish Thai iced tea and some fried banana with coconut ice cream for dessert. IT WAS SO FREAKING GOOD and I was really full at the end. The yellow curry was exactly what I was craving for - Something spicy yet mostly on the sweeter side. The Thai iced tea was one of the best that I've had! Extremely affordable, and VTK's been remodeled recently so it looks lovely! You definitely want to come here. 5 stars! YAYYYYY", "author": "M J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-06", "description": "Vanida thai is awesome! \n\nFresh dishes, well balanced curries with yummy rices. Seafood eggplant is delicious and so is the pumpkin curry. They have a very unique cashew chicken and if you can get past the abundance of oil, it is a treat. (I just strain the dish:)\n\nTheir green sauce adds great flavor to anything and is a must add!\n\nYou truly cannot go wrong with this restaurant. Oh, and they deliver...usually in a flash!", "author": "Kim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-10", "description": "Excellent value with excellent food.  Just the way I like it.  Cheap and good.  Went for lunch.  My son got the Chicken Satay, Wife - Chicken Pad Thai and Red curry, Sister - Yellow Curry and I got the Panang.  The Pad Thai was great, the red curry and panang were pretty similar, did need a little salt.  Yellow curry was good and my son devoured the Satay.  Would definitely go there again!", "author": "Andrew O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-12", "description": "Vanida is a good place to go. It is small, modern, authentic, and yummy. Pad Thai is about 6/7 dollars. The curries are tasteful, the dinner plates are pretty good. Vanida is a nice Thai restaurant to check out! \nAnd they accept Credit cards!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-19", "description": "O, what an ingrate am I, not having given Vanida Thai Kitchen a proper review after the excellent dinner I had here several months ago. \n\nMy uncle and his family were in town, and the onus was on me to find a suitable venue for our dinner. Luckily, I remembered that my friend from work has a restaurant - well, his parents have a restaurant - and I thought it would impress my uncle, who is always upstaging me with stories of his latest exploits with Jack Johnson (yes, THE Jack Johnson.)  Now,  of course, on a par with knowing a famous singer/guitarist, having a friend whose parents own a good Thai restaurant is, well, not much to brag about. Still, thanks to Vanida Thai Kitchen, I feel somewhat redeemed.  We had an excellent dinner in a relaxed, yet stylish setting; and, the staff/owners were extremely accomodating and hospitable. \n\nOf course, I am willing to admit that some of the royal treatment was owing to my friendship with the owners' son, but collegial kindness notwithstanding, the food was excellent, the service was friendly, and the location exactly what was needed for this occasion. There were five of us adults and one baby, and so the restaurant boasted the perfect combination of style and relaxation that is needed when dining out with a little tyke. They even brought us a baby spoon to share the dessert! \n\nAs it was some time ago, I don't recall exactly what we ordered, but I know we did have some chicken satay, curries, Thai beer, dessert, and pad Thai. As I've stated in other reviews, I am in no way an expert on Thai cuisine, but when the experience is pleasant and the food is good, that is enough for me to be happy. Oh, and the price was extremely reasonable for the size of our party.\n\nIt may be out of the way to trek all the way out to the end of the city to come here, but there is always parking, and of course the Muni. Or with the money you save by not eating at an overpriced \"Thai\" restaurant on, say, Fillmore street, you might even have money to take a taxi home.  My uncle and aunt, who were initially a bit confused by the location ( as visitors to the city, they were surprised that it was in such an out-of-the-way place) but they did end up enjoying the meal. It may not be on par with having a rock star be your friend, but hey, at least you know that you can have a good meal in a nice restaurant that is owned by people you know!", "author": "eliz s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-23", "description": "Food: Not bad. I tried the Bbq chicken and my friend had the pad thai. She liked hers, mine was just okay.\n\nPrice: I used a coupon from the Entertainment book so dinner was very cheap.\n\nService: Fine\n\nLocation: All the way down on Taraval, parking available at meters.\n\nAtmosphere: A nice small sized restaurant.", "author": "Miss H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-08", "description": "Mmmm!  Just thinking about this place gets me salivating! :)\nI've never tried Thai food until I came here (thanks to some friends), and since then I've been hooked!  I live in Santa Cruz, but none of their Thai restaurants (or anywhere else, actually) can compare to Vanida.  You can bet I make the trip up just to eat here.\nLocated in quaint Sunset district, a bit hidden, everything they offer is just absolutely delicious! \nTotally friendly and attentive staff too!  A definite must-try!", "author": "Crys L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-28", "description": "I've walk by Vanida Thai Kitchen every day on my way home from work and I've been eager to try it for a while now.  My recent new found love for Thai food finally got me to try Vanida last night.  I ordered a few dishes because the prices were decent and I wanted to try different tastes to get a more tested feel for the restaurant.  \n\nI started with the Spring Rolls.  These were great because they were free!  Any order over $20, you get a free order of Spring Rolls.  They were nice and crispy but I didn't care very much for the accompanying sauce.  Being a spicy fiend, I ended up using the chili sauce for my spring rolls, which did the trick.  I was pretty satisfied with the mix of flavorful vegetables along with the oily and crispy outer shell.\n\nMy next appetizer was the Angel Wings, in which I was thoroughly dissatisfied with.  I suppose I was spoiled by being recently introduced to the angel wings at Marnee Thai, which puts all other chicken wings to shame.  The angel wings at Vanida were comparatively pretty puny and not very crispy.  I only ate 3 of the 10 or so.\n\nOne of my staples when I have Thai is Pad See Eww (I'm not quite sure how to spell it, it seems like it's spelled differently at every restaurant!)  Like the Angel Wings I wasn't impressed with this dish.  Compared to Osha Thai and Marnee, Vanida's Pad See Eww tasted rather bland and unremarkable.  I'm not saying it tasted bad per say, it just didn't overwhelm me with a plethora of amazing spices and flavors like the other two restaurants I mentioned.\n\nMy last dish was green curry with shrimp which did justice for the disappointing angel wings and Pad See Eww.  The curry was a little thin, not much body to it, but it had a wonderful flavor.  It gave off a nice kick (I ordered it spicy) and definitely made me want to keep eating, although I was full.  \n\nSo I had two good dishes and two not so good dishes at Vanida Thai Kitchen.  The prices were very cheap compared to other Thai restaurants I've tried, and the free spring rolls were definitely a great treat.  I'm giving it three stars, however they're really close to four.  I will assuredly eat there again; perhaps another decent experience will give it the extra bump for an additional star.", "author": "Timothy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-01", "description": "Now, I LOVE thai food.. I've gone to plenty of thai restaurants around the bay area, and Vanida has to be one of the best. Not only do you get HUGE plates of food, but the prices are amazing, ESPECIALLY with the lunch special. The spinach, tofu and peanut sauce deal is to die for. Seriously, I've never gone there and had a bad experience or still felt hungry or unsatisfied. best best thai food ever. love it.  \n\nIt's a nice quiet place, you can have a good meal and not be harassed with the waitresses asking you if you need more water/tea anything. Everyone is so polite, the food is always hot and delicious, and really, no complaints. You always feel welcomed coming in and leave happy!", "author": "Diana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-30", "description": "Wow. Over by the new TLC home. This place is a gem.", "author": "Seth W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "I was surprised by the shop's presentation and decor. The restaurant looked very nice from the outside, much like a 4 star place. The interior feels very Thai-like with the colors they picked out with the red and cream colored walls. They also have plants scattered throughout the shop which is a nice little touch. I like how they made the counter near the kitchen into a tiki style bar. I went in for lunch and they had a bunch of lunch specials for under $8, steal! I opted for the yellow curry with chicken and garlic pork. The lunch specials also came with a choice of soup or salad and I got the hot and sour soup. It was not that great, it pretty much tasted like flavored water. The food came out reasonably quick and it was delish. The curry was perfect, it had great flavor and not too spicy. The curry also had good texture where it was not too watery or too thick.The garlic pork was good too, not too salty or sweet. The portion size was pretty filling for the price. Overall, the quality of food here is definitely worth the price. I only docked off a star for the soup otherwise this place is highly recommended. Oh, I almost forgot this is a nice place to take your date, it has the perfect setting anyone could ask for.", "author": "Gary T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "Tasty tasty. First, they have these awesome lunch specials - on the weekend! You choose two - yes two dishes -  and it comes with soup. Yes, of course they're sized accordingly, but we did end up taking some home.\n\nSo my wife and I ordered four different plates and the two soups so that we could try as much as possible. Everything was great, but I have to give a special mention to the Coconut Milk soup - so good!\n\nWe tried a yellow curry with chicken and a red curry with beef. Both hit the spot and then some.\n\nThen we had the garlic prawns (for garlic lovers!), they don't skimp on the garlic. Also very tasty. And finally the garlic pork in the Vanida sauce that I've seen others raving about. Very nice.\n\nParking was easy on a Sunday out there in the avenues. We had lunch and went to Ocean Beach for a walk. Very nice combo.", "author": "ISAAC C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-01", "description": "This place is pretty good - small, very nice atmosphere.\nGreat neighborhood restaurant.\n\nThe food is good, prices are right and the service is attentive and very friendly. \n\nI liked the red curry and pad thai. The chicken is high quality and they give a generous amount. Definitely recommend it.", "author": "Chili B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-11", "description": "I live not far from Vanida Thai, but don't eat there that often, as I generally go to Chaaba on Irving (near 22nd Ave).\n\nJust over a week ago, we decided to get take-out from Vanida because of their proximity. We kept it simple and ordered three pad thais, three cocanut/shrimp soups, and plain white rice for two.\n\nWhen the food arrived, we were charged about $49 for the order. The price seemed rather high...especially as the food was mostly cheap noodles and rice, but I didn't raise the point to the driver. Instead I referenced one of the many Vanida Thai menus we have as well as their current online menu. What I found was the the total should have been about $40. I called the restaurant to inquire about the discrepancy, and they said their prices has recently gone up and they hadn't had time to update their online menu. That was over a week ago, and they still have not updated the prices on their menu. How long does it take to update online menu prices....30 minutes at the most.\n\nStrike 1: false advertising\n\n\nNow on to the food. The pad thai was so-so. About the quality of a $4 pad thai plate at a mall food court. The soup was a letdown. First of all, I have no problem with paying $3.75 for a soup, but to pay that and get it in a single 8 oz container is ridiculous. Furthermore, the shrimp in the soup was very dry. In a city like SF...being served what tasted like shrimp which had been frozen for months is not excusable.\n\nStrike 2: tiny portions\nStrike 3: ingredients not fresh\n\n\nFor the life of me, I don't get what people see in Vanida Thai. Unadvertised high prices (probably to pay for their renovation) for small portions of food that is not fresh.\n\nYour far better off at Chaaba...although the parking is much worse there.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-15", "description": "Having spent a good part of my life in the Outer Sunset, I was surprised to come across this little place the other afternoon.  Clean, modern interior and lunch specials that included rice, Tom Kha or Tom Yum soup, and an entree for $6.50.  The Tom Kha soup didn't have as much of a kick as I prefer, but the yellow curry was good as was the pad thai.  Nice to be able to eat at a decent, modern, clean little Thai place so far out.", "author": "Toni C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-20", "description": "The people who work here are very kind and always have a smile. The food is always fresh, and very good.  I have never had anything there that I didn't like, and I go a lot!\nIt's decently priced too.\nThe only thing I have to complain about was one time I found a rubber band in my dish.  The of course apologized profusely, and remade the dish, no questions asked.  I believe the rubber band was from around vegetables. \n\nThis has not stopped me from going back at all.  One not too bad experience can not compare to dozens of great experiences.\nThey have a $10 credit card min.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "I would give it five stars for 'as good as it gets', but I havent had a lot of Thai food so I don't have much to compare it to.  I live close by to here and I have had it ordered and it was pretty good.  The other day my friend Zach and I walked here for lunch.  We had great service and great food!  I love the thai french fries with that really tangy sauce.  I had the cashew chicken and Zach had some spring roll type things and the chicken skewers with peanut sauce.  Everything was great.  I also came here with my boyfriend and his family and we had a GREAT dinner.  Im actually planning on taking Ace for lunch on v-day/chinese new year!", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "Vanida Thai is always me and my sister's go-to for Thai; then again, she lives in the Sunset so there's also a huge convenience factor. She always gets the beef noodle soup for the savory broth that reminds her of home (we're actually Taiwanese, but that's irrelevant). I've always been impartial towards meat and poultry so I always get a tofu dish. Their tofu is usually extra firm and triangular, definitely fried. They're really lenient with substituting tofu for meat in any of their dishes, which I love. Their curries are pretty good, although I don't order them as often as I do stir-fried dishes with eggplant. Prices are relatively cheap, and seating is ample. Interior is very clean and modern, same with the restrooms. I always accompany my food with their delicious thai iced tea although I've noticed as of late that they started filling up the cups with a LOT more ice. Definitely recommend if you're feeling \"asian tonight\" and you're in the area!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-04", "description": "This is a quaint little Jewel of a restaurant hidden out in the avenues. 40Th and Taraval isn't the likely spot to find some of the best Thai food in the city but there it is, Vanida Thai. It's a great spot for a quick bite, or bring the family and stay a while. It's also perfect for a quite date. After my trip to Thailand it's hard to match the quality of food I got over there but Vanida does it, the set up is quaint the staff are friendly and the service is quick. \n\nIf you like Thai food and spicy food try there Green Curry it's the Best in the city!!", "author": "Ariona E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "I know there are not many reasons to like the sunset but ... you now have at least one reason to head out there. Forget about the fog/mist/lack of sunshine/wind.\nVanida Thai is the real deal! \nI have eaten thier food twice now and it consistently comes through in a big way.\nThis place is very reasonably priced, they DELIVER, the menu is extensive but not too large and now we get into the food.\nThe curries are rich, creamy and aromatic...\nThe Tom Kah soup is tangy and satisfying .... \nThe cashew chicken is different than any other I have ever had and I mean that in the best way possible.....tons of veggies, medium spicy, not dry, lots of drippy,lght-sauce \nThe pad see ew ranks right up there .... not skimpy on the chicken either... \nI have nothing but great things to say about Vanida\nIt's in my top 3 thai spots now in S.F.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-27", "description": "My BF and i learned about this place on yelp. we were really hung over and wanted some kind of delivery. When we found a Thai place that delivered and on my side of town (sunset) were jumped at the opportunity to try something new. THE FOOD IS PHENOMENAL. Every time we order something different and never have we gotten something that we didn't like. The cashew chicken is my fav. it's not like Chinese cashew chicken. they have their own spin on it and it's sooo good and spicy. The soup that we ordered was also really good. Like i said nothing that we have order has ever been a disappointment. \n\nI have never actually been inside the place but now that they have remodeled i am looking forward to going to see the place that satisfies my every this food need. I will update my review when i do so", "author": "Diana Elena B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-19", "description": "I ordered the pad thai and I've never had pad thai I wasn't crazy about, until tonight. I went here because of the high ratings on yelp but as far as the pad thai... I have seriously had better. It was dry and not very flavorful. Maybe try other things at this place.", "author": "Olivia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "I am definitely a fan of this place. Only done delivery so far, and every time it comes hot and so good. I always get the drunken noodle with beef and man does that punch me in the gut every time. So spicy and delicious. Also love the fact that they say 40 minutes and it's here in 35", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-20", "description": "I really want to give them 4 stars but they made a noob mistake of not de-vaining the shrimp or doing a bad job of it. \n\nthat aside the food was quite good, the prices are reasonable, and delivery was as quoted.\n\nI thought the pad thai was good and the yellow curry was amazing, the spring rolls were decent too.\n\nI'll for sure be back, but next time I'm asking for chicken to be substituted for shrimp.", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "This is the best Thai food restaurant I have been to in the city. They cater very well to vegetarians and cook their tofu perfectly. The Pad Thai is exactly how I like it with thinner rice noodles some veggies, tofu and bean sprouts (egg optional). However, my favorite dish is any thing Pra Ram, I go for the pra ram pak which is vegetables and peanut sauce, but the pra ram tofu and pra ram meats are just as good, it's all about the sauce! If you can get to the area you should definitely check it out!", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "Vanida Thai Kitchen is cute! I ordered the drunken noodles and it was so satisfying! The prices are good, the food portions are just enough to fill you up, and the service is excellent. It may not look like it from the outside, but the appearance and ambiance inside is pretty. Vanida is a small restaurant, so there's definitely not a lot of seating and I'm not aware of how busy it usually gets, but it was nice and cozy when I was dining there. This place beats King of Thai!", "author": "Bets Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-20", "description": "Just moved to the neighborhood, craving Thai, thought we'd give this place a whirl. What a pleasant surprise! Lovely space + delish/fresh food + reasonable prices = food happiness.\n\nWe've been twice now. First time we got yum yai salad, garlic prawn, and sticky rice with mango for dessert. Second time: papaya salad, goong ga prow, and chicken cashew nut. (Don't you just love how half the dishes use the English words and half use the Thai on the menu?)\n\nAll of the dishes were first-rate -- hot, fresh, light, flavorful, completely satisfying. The prawn dishes were particularly outstanding. \n\nAnd the service is wonderful. Judging by what other yelpers have said, it sounds like it's better to eat in than take out or get delivery.\n\nHaven't tried any curries or noodle dishes yet, but we'll be back...", "author": "Val P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-24", "description": "Beef Gra Prow is excellent.\n\nTry their online ordering service for delivery.", "author": "china s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "Solid traditional Thai food. This is our \"go to\" place in the lake merced/outer sunset area. Great for takeout. Top marks for their pad-sew-ew, green curry, and the quality of the chicken they use. There are probably 5 or 6 other restaurants that are just as good or better than Vanida. This being the closest to me makes it my new favorite. Oh yeah, free delivery baby!", "author": "Asa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-31", "description": "I really love going here\n\n-It's quiet, even when it's busy\n-Super friendly service\n-Inexpensive\n-Easy parking, right off the L train too. \n-Awesome Thai Iced Tea\n-Portions seem small, but fill you up. And they always give us extra rice for leftovers if we need it.", "author": "Mat O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-24", "description": "I got the curry noodles which were decent . The Thai iced tea was decent but a total rip off !! It was like half the size of what a thai tea looked like in all other Thai restaurants !! How stingy of them !! I really think they deserve a 2.5 stars but obviously I can't do that .. so I'm just going to give them 3 stars to be fair . Even though they are stingy , their food was decent after all ..", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-20", "description": "The food is freaking horrible.  Today I got spring rolls, tom yum goong and flat noodles with chinese brokoli.  The spring rolls tasted like mold.  The soup just tasted like water, not flavor whatsoever.  The noodle is okay.  Don't know if the cook has changed, but the food used to taste okay.  And it's freaking Saturday usually Asian restaurants cook the food better than on weekdays.  I can't imagine what the food is taste like.  I have been to Thailand several times and the food at Vanida taste nothing like the real Thai food.  Not even that, there are far and much more better Thai restaurant that Vanida.  I would never come back again.  Better take a little far drive to King Thai Noodles for better food or elsewhere.", "author": "Jasmijn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-26", "description": "Well........... First of all thai food is my least favorite food so yeah. LOL My best friends wanted to go eat thai here because it was only a few blocks away from the house we were hanging out at and we were starving from taking the ACTs. It wasn't a long wait for us to get a seat and the service was pretty nice. I ordered the yellow curry with the sour&spicy soup. I really liked the soup(: The yellow curry ........ eh I had better curry but I still liked it, espicially since it had tofu lol (: Overall its good and I would come back if I'm ever around (:", "author": "Didi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "I'm with Tiffany Y. on this one.  Vanida Thai used to be a 5 star for me, but something's just not the same with the food since the remodeling.  The new decor is gorgeous, and it's still one of the better Thai places.  The service remains incredible.  I just hope they bring back the quality of food that they had before the remodeling. *fingers crossed*", "author": "Christena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "Vanida is great!! The service is amazing. From the minute you walk in they are very attentive and offer you jasmine tea.  The prices are reasonable and the portion size large.  My only gripe they don't have fresh spring rolls which seems weird for a Thai restaurant. Their Tom Yum soup is quite tasty.  I have only sampled a couple of the curries which were good. Well spiced food.  Its a nice little treasure in the outer sunset.", "author": "Halima T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "curry is good. tom kha is great. pad thai uses thin noodles and tons of tamarind and vinegar. yumm. \n\nthere's never a wait, and your drinks come with little origami roses on the straws.", "author": "Lizzie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "This is a cozy lil spot in the outer sunset where you are greeted by lovely waitresses in traditional Thai outfits with smiles on their faces.  I went wit the boys for late dinner and found it to be pretty empty. I ordered the Pad Sai Rong which is thin noodles with chicken and many assorted veggies. It was yummy and the portion size was decent. I would like to come back before I can give them a better or worst rating depending on the other food I try. After you start exploring different thai restaurants and get away from King of Thai it makes the eating experience in a Thai restaurant even better because King of Thai is too commercialized for me now. I rather go to smaller places because the quality of the food is much better.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "Delicious!  It's my neighborhood Thai place, and never disappoints.  Great service and food.  I almost always get the coconut soup with chicken and the pad see yew noodles.  The pad thai is also good, naturally.  Yummy!!", "author": "Nicholle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-18", "description": "Beautiful restaurant, friendly service, very reasonable prices. I wish I lived closer to Vanida. I'd go all the time.", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "Just moved to the neighborhood 2 months ago and I have eaten here many times. I enjoy the lunch specials over dinner service. The food is always good and sometimes great. I wanted to give them 5 stars but chose 4 because they aren't as consistant as I would like. The garlic pork is one of my favorite dishes. The curry puffs are an awesome appetizer. Quality and consistency of the curry dishes is where I've been disappointed before - some days these are great and some days just average. I've also been a little disappointed with lunch when one option was hot and fresh and it was obvious the other had sat around for a few minutes and was not hot (lunch specials give you the option to try two main dishes for $1 extra.) Service is always prompt, efficient, and courteous. The dining area is always clean, although the inspection score leaves room for improvement in the kitchen and storage areas, apparently. Of the several casual Thai restaurants I've tried this is easily the best.", "author": "Jayson H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "Primo Thai!...  always good...  soooo glad i learned of the Thai food when I came to the bay area...  think  this is the beginning of a great relationship...  =)~", "author": "Anthony Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-22", "description": "Om nom nom nom! The lunch specials offer large, satisfying portions, with good selections for both meat-eaters and vegetarians alike. Kick ass curry. Savory coconut soup. Luscious Thai iced tea. Lunch for two comes out to less than $20! Easy parking. And it's a short walk to the beach, so you can have your post-lunch constitutional with a view.", "author": "Melinda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-04", "description": "This place is what King of Thai used to be:  good prices, decent amount of food, and good tastes. They have a killer 2-item lunch special that is even available on Saturdays.  The food is good...but I hear this may be hit or miss; my 3 trips have been identical in terms of taste and quality.  The place is clean (ever since the facelift) and welcoming for being a hidden gem in the lower Sunset.  The place is never crowded and this is no the kind of place where you have to wait for an hour to get a table.  Wait staff is super friendly and they do a good job at making themselves available.  With your bill comes some chocolate breath mints....I'll keep going back here for my Sunset Thai food.", "author": "Jonnathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "Best thai restaurant in the area. Flavorful curry dishes and good woon sen soup!  Angel wings are good but a bit greasy.  Only complaint I have is that they never give me any plastic utensils with my take out orders. Getting takeout means I don't have to cook and I don't want to clean either", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-31", "description": "Yes, I agree with other yelpers, nice renovation...the place looks great and service is still awesome but the food is no longer as good as it used to be. I went into the city craving their food and was surprised when I ordered my usual there, it's just not the same. It seems like they changed their chef. The yellow curry isn't what it used to be and the tom kha gai isn't as tasty as it once was. What happened? I mean it wasn't bad but it wasn't super fantastic like it once was before the change. Oh Vanida Thai...you have fallen from grace.", "author": "nancy l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "lightning speed and soooooo delicioso~ i crave vanida!", "author": "Christine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-24", "description": "My roommate is kinda addicted to this place and I like it too.  It's a super hole-in-the-wall place, but it seems really clean and the food is really good.", "author": "Tara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-30", "description": "I really like this quaint thai place, hidden away in the Sunset not too far from the ocean.  I've been several times now and have always been pleased with the good food, friendly service, and family home feel.  I'll be coming again soon!", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-28", "description": "Vanita thai kitchen is right down the street from our house, so i'm sure i'll be there many times again. it's a nice little place with a very friendly waitress. the thai iced tea was good but a little watery. i had sweet n sour tofu, which was yummy, with tomatoes and pineapples. my friend had a good ginger chicken and my other friend had chicken eggplant, which i thought was delicious, although he felt a little sick. it wasn't the best place, but still good...", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-30", "description": "my friends and I tried the lunch combinations, and they were actually pretty valuable and delicious.\n\nthe restaurant is pretty small and not easy to find from outside.\n\nit is very clean and small, but still comfortable to enjoy our food.\nThe service is VERY good and fast.\n\nWe tried the green curry, pad thai, ga prow, and pad tofu, and they were unexpectedly amazing...they were so authentic that we kept eating until we couldn't consume any more \n\nWe are so satisfied and left.    \n(Delivery only for DINNER)", "author": "Sue S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-05", "description": "I ate here last night with my crazy drunk friends. The waitresses was so nice and accomodating. I requested that every plate we ordered be split into 2 and placed on each side of the table since there was 9 of us. She did. The food is pretty good and decent sized. When we were paying the bill, i realized that they didn't factor in the tip. So if you decide to eat here, make sure you tip these nice peoples :)", "author": "Dao C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-30", "description": "First came here a couple years ago, and the foods been consistently good since then. Nice quiet place, friendly (not overly perky) service.", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "I was going to Win's Restaurant, and they were CLOSED! aww buggah! I was too hungry to get back in the car and drive somewhere else. Luckily there was a Thai restaurant right next door. Vanida Thai Kitchen to the rescue! Delicious water to start while my bf and I were looking at the menus. We ordered the yellow curry with chicken, and pad see yew with beef. MMMMMMMMMM sooo good I'm still food chomatosing.", "author": "Stefanie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-11", "description": "Great service, and its a great little place considering its in the outter sunset. You'll have to try the woon sun soup. It is the best if you are feeling under the weather. Clear chicken broth soup, with glass noodle inside.", "author": "Gilbert D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-18", "description": "This is a great neighborhood-y place with friendly service and very good food. It's a bit of a trek for me, but I'd go back - it's like a trip out of town - or if I happened to be in the area. I was impressed by the number and variety of vegetarian appetizers. I had a bit of the spring rolls but was saving room for FBI (fried bananas and ice cream). My vegetables and tofu with peanut sauce were very good, and my dining companion enjoyed his beef dish. The FBI was great! Look carefully between the 3 Chinese restaurants and pizza place to find it.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-11", "description": "Greatest kept secret in the sunset. This place is never really full and I don't know why. The pad thai is great plus I don't think I've ever spent more then 25 for two people here or 45 for 4 people. Great tea! Try the chicken skewers. Really good service too.", "author": "kArlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-16", "description": "This place has great lunch prices. Two item combos with rice and your choice of soup or salad is about 7.50. My faves are the marinated bbq chicken and chicken or steamed veggies/tofu pra ram (peanut sauce).  They can get busy in the evening and service can be slow. Their fried rice is good but the onions are ridiculously large in size. I'm not a fan of the pad thai because it taste too much like fish sauce. If you live in the 'Set or are in the hood, you have to try this place at least once.", "author": "Jenniflava R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-27", "description": "I love Vanida, and I usually am not the biggest fan of Thai food. It's the epitome of the hole in the wall, family-run, authentic, sweet little restaurant that serves up such amazingly delicious food that you don't want to share the place's whereabouts with other people. If you're in the area, definitely make a stop here. You'll love it; I promise.\n\nBTW: Anything with \"Panang Curry\" is legit. Also, their mango with sticky rice is a must.", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-30", "description": "This place is hit or miss. The Lunch deals are great... i think $6.50 for a two item combo with rice and soup... problem is sometimes the soup is great and sometimes it tastes watered down.", "author": "Noah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "Amazing Thai in a foggy, forgettable Sunset business strip. The Pad Thai was pretty good, with nice but not overpowering nuttiness and tasty shrimp, but the chicken satay blew me away. Best I've ever had, bar none. Cheap, too- about $7-8 an entree. Apparently they have homemade coconut fried ice cream, too, which is kind of exciting.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-16", "description": "Food is very tasty and delicious. Small and cozy place. Get the Garlic Pork with the Vanida green sauce. That green sauce is the bomb! I think it contains lemon, lime, salt, pepper, cilantro. That's the only thing I order when I go there.", "author": "Roger C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "go go green sauce.....yummy. my fav. We go just for that. Nice staff.The place is really fancy now. Prices are still good.", "author": "Freaky T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-01", "description": "Observed the facelift this place got, wondered what affect that may have on the food? Well, the food is still sagging in flair and flavor. Nothing spectacular, I would rather travel the 10 blocks to King of Thai Noodle. The squid salad smelt like the marina, dead fish...don't order it. The Pad Se-Ew was decent, soft and delicate with a nice balance of seasoning, I'd order it again. As yellow curries go this one was average with a bit too much sweetness and too raw of chili.  The most notable theme was the music, a subliminal blend of Madonna and Taylor Dane, took my mind off the stinky squid at the table. The tofu was fresh as was the grilled chicken. I'd go and try something different next time.", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-09", "description": "Vanida is my new favorite Thai place. \n\nI like the hole-in-the-wall feeling of the place and the low-key service.\n\nMost of all, I dig the food. I've always been there with guests, and they're always blown away. It's just simple, family-style Thai food, but the flavors are rich and complex. \n\nIt's a pain to get all the way out there, but worth it. In fact, the spouse & I have become so spoiled by Vanida, we refuse to go to any of the five Thai places that are within a few blocks of our flat. Better to hop on the L Taraval and have some real Thai food...", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "What more could ask for in a Thai place? Good service, free delivery, and excellent food. Tofu ga prow is my stand-by, and with all the thai in the sunset, vanida stands out. And super cheap too!!", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-11", "description": "I ate here for the first time tonight and I really enjoyed it.  The portions were just enough and the food was flavorful.  I will come again!", "author": "Mieke V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-14", "description": "Brilliant. The food is cooked fresh- I happened to go to the bathroom and came saw the chefs peacefully debating on the flavours of the freshly cooked dishes that we had ordered and you could really taste their perfection in the food. \n\nI recommend Miang Kum (number 18 on the menu), it is really flavourful and starts the eating experience off perfectly.\n\nThe staff are friendly and attentive (we always had full water).\n\nCheck it out, you will not be sorry.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-16", "description": "had takeout from this restaurant.  ordered from the lunch combo menu (which is offered every day) comes with 2 items, rice, salad or soup for $7.50....well worth it!  food was excellent.  yellow curry sauce is so authentic.  ga prow was prepared perfectly.  basil is super yummy.  Salad dressing is very light and salad was very fresh.  ordered pad thai separately...it was good, served with all ingredients separately and you mix it yourself, so if you like your spouts on the soft side, this isn't the place to buy the pad thai to go.  ordered thai tea and it held up very well, mixed it at home.  strong and sweet, perfect.  Overall a great deal for the price and good quality of food.  would definately go back.  convenient location.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-11", "description": "The food is mediocre.  Delivery lately has been one bad experience after another.  They told us that it would take 45 minutes.  But the last few times it's taken over an hour even up to an hour and a half.  The delivery really soured me on ordering from them again.", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "Vanida Thai Kitchen's Garlic Pork (#3 and #43 on the lunch and dinner menus, respectively) is shouldering the bulk of the 4 stars for this review because it was the unexpected highlight of my lunch. It could have used more charbroiling but their refreshing (a hint of lime juice?), vinegar-based green sauce really elevated the meat's flavor profile. I had so much leftover rice--they could've plated more pork frankly--that I drenched it with the remaining green sauce and then topped it with the unremarkable Yellow Curry Chicken (#2 lunch; #38 dinner) that I got with the lunch combo. The Tom Kha soup was alright; there was some acidity/sourness found similarly in Tom Yum soup. I also ordered their over-hyped, seven-piece Angel Wings (#12 dinner-appetizer). Sure, I enjoyed the spicy sweet & sour sauce on the wings' skin but the un-marinated chicken wings lacked flavor in the meat and were horribly overcooked and not juicy. Ironically, there appeared to be more meat from this appetizer than the Garlic Pork to fill me up.", "author": "Cliff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-03", "description": "had dinner here last night with my sister, the trout special was really good.  the ginger pork was ok.", "author": "pochini m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-05", "description": "Terrible PadThai....all the noodles stuck together as one big lump.  Red curry is tasteless and the soup was too hot to consume.  4 tiny egg rolls for $6.00???  All the prices in the on line menu is not updated....... We got carry out using the on line menu and when we picked up the food, it was a big wopping $10.00 difference.  The stick rice and Mango desert was stale with brown Mango. We were craving so much for some authentic Thai and what we got was anything but.........", "author": "Mel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "Love this place!  Have been here for lunch only but would be happy to go for dinner too.  The lunch special is a great deal and tasty.  Two dishes plus some good soup for $7.50.  The place is clean, parking is easy, staff is friendly, dishes all taste fresh and authentic.  A great find in the outer Sunset/Parkside.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "Nothing transcendent, but all quiet good.  I only get takeout here, but the service is very fast and consistent.  The food is not too greasy, which I like.  Obviously, living in San Francisco, there are plenty of excellent Thai places.  So, I wouldn't expect people to drive across the city to come here.  I have had a number of things on the menu and have been happy with all of it.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-06", "description": "Best Thai food in town. I used to live next door to a King of Thai Noodle, which is ok Thai food, but now my go-to Thai place is Vanida. I've been there three times and each time the food and service have been amazing. The curry is delicious! The atmosphere is clean and inviting. I highly recommend this restaurant to anyone looking for an alternative to King of Thai Noodle.", "author": "A S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "Good food, great prices for lunch. I can pick up a two item combo with soup for less than $8. That's not too bad, and it's usually my to-go spot when I work from home.", "author": "Jeremy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-05", "description": "great small thai restaurant.. their combo appertizer consists of fish cakes,  curry puff ( which taste like potato mixed with curry), egg rolls and shrimp rolls, theur pumpkin curry chicken is spicy but just right. when we order a pint of rice, it is more than a pint.. their fried banana with homemade coconut ice cream which delicious and it hitted that spOt.. i would recommend great for dates and friends and can share.", "author": "Lily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-23", "description": "mm i always order the Tofu Ga Prow which is stir fried tofu with peppers. its not too spicy and not too sweet with a slice of watermelon on the side=) yumm. the waitresses are friendly and will refill your water when its low. the restaurant doesn't get too crowded.. maybe cuz i go there in the early afternoon..and they give u chocolate breath mints with your bill=) its pretty cheap ..around 6 dollars per person.", "author": "christy w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "This is place is a hidden gem. It is a residential neighborhood, and doesn't look inviting from outside. But the food is pretty good. The quantity is just right, and not too much as at most places. I go every once, in a while, and am satisfied.", "author": "Kuldeep T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "Still on the delivery mission for the Sunset.  We live out by SFSU, and delivery/food in general is a little sketchy after ten years of delivery abundance in the Mission and Haight.  Vanida was, happily, great.  Delivery was relatively quick, prices were decent, and the food was tasty.  BF had the angel wings, which he loved.  We shared vegetarian pad thai, which was very tamarind-y and improved very easily with the (included) squeeze of lime.  All the vegetables were beautiful and very fresh.  I also ordered a red curry which was spicy and flavorful.  Tom kha (coconut milk, lemongrass, ginger) soup was kinda on the sweet side but fantastic the next day when I added my red curry to it.  Thinking on it now I could have added the lime squeeze to that too and probably done away with the sweetness.  In (real) Thai cuisine there is a balance of flavors so possibly I threw off the balance by leaving the lime out.  Either way, yum!  \nI will definitely order from here again.", "author": "nicole p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-18", "description": "This place is awesome! I'm not Thai, but whenever I'm looking for some comfort food, Vanida always tops the list.  The food always tastes home cooked and amazingly fresh.  My favorites are definitely the vegetarian pad thai, Tom Yum Gai, the egg rolls and the chicken curry.  Writing this is making me hungry...", "author": "Diesel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-23", "description": "Yummy food, cozy place, friendly people! It's a place we normally go when we want authentic Thai food. There's no holes on the wall, but definitely a mom-n-pa shop type of family owned restaurant. In fact, the mom is the chef!! We can't wait to go back there again!", "author": "J.K D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-11", "description": "I went to this place after reading all the raving reviews posted....I was sadly disappointed.....The only thing that was true of the reviews was about the price......The quantity was really less and nothing tasted good.....I have been to several thai places before and I would rate each one of them better than this one......To add to our annoyance of the mediocre dishes, the waitress even had the audacity of giggle in front of us when we asked her to pack the leftovers eventually leaving us with an extremely bad dining experience.......I am not sure if we caught it on an off day but I cannot believe that every single one of the en tree's we ordered was wrong...The appetizers were not too bad......I wouldn't venture to this place again...The only saving grace was the trip to beach which is so close......", "author": "Smita K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-20", "description": "I've eaten at dozens of Thai places all over the Bay Area and this is one of my favorites (top 5).  The chicken red curry has great kick, but it's the prawns that are the best.  The freshest I've ever tasted anywhere.  The pad thai could use some improvement.  The portion is huge (box must weigh over a pound) but the flavor isn't as nutty and rich as I like but its still ok.", "author": "kim h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-12", "description": "My fav place for Thai! I've been there about 4 times and the service is always as great as the food.", "author": "Mandi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-21", "description": "Small local place, usually not too crowded, but its getting more popular as people find out.  Good food, easy takeout, quick delivery - every once in a while the service is a little slow, bust mostly this place is great, and one of my favorite SF thai joints.", "author": "dontdoit d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "This place certainly screams value.  Anytime you can get an above average meal for a below average price, you're left feeling pretty good.  Nothing beats a little hole in the wall neighborhood restaurant that serves delicious meals.  If you're looking for an upscale dining area with all the amenities, this isn't the place for you.  If you're looking to be pampered by busboys, valet parking attendants, and waiters who wear suits, this isn't the place for you.  Yet, if you're looking for authentic Thai food which tastes great and doesn't take a large chunk out of your wallet, this is the place for you.  VALUE at its finest.", "author": "Rex J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-02", "description": "mmmm, delicious! one of the best kept secrets in the outer sunset. lunch is an especially goood deal. choose from one or two combination plates, i recommend a sauteed something with a curried selection. all for about 8 bucks. it also includes a soup...get the coconut milk soup...to die for! a glass of wine is about $5. and the service is superb. i usually dine for lunch solo here, as it is a comfortable quiet place. i believe it is family owned and operated. always a pleasure.", "author": "punk l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-03", "description": "this is the BEST place to go for thai food!!! this is a small family restaurant and the family has always been good to me whenever i visit. all the servers are super friendly and the food is amazing. i try to order different things whenever i come here, and there hasn't been one thing i didn't like. they remodeled a couple months ago and it looks amazing!! the other thai restaurants cannot match up to vanida!!", "author": "Tiff L."}
