{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "I traveled all though Italy eating bruschetta, and this bruschetta was as good, or even better, than one I had there.\nWe got the ravioli of the day which was cheese ravioli with pesto, and it was delicious and very al dente (which I loved, but my dad felt like it was too undercooked).\nOnly complaint was that the pasta of the day didn't have a price next to it, and it ended up being like $5 more than all the other pastas on the menu.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "Every time I pass by this restaurant it looks lively and smells amazing, so when I finally had a chance to stop in, I was very excited. My roommates and I came around 8pm on a weeknight and there were a couple of large groups as well as a few smaller parties - clearly a go-to spot for many.\n\nWe ordered a bruschetta to start with, and then decided to share the Fettuccini Alfredo and Gnocchi Alla Sorrentina. The bruschetta was pretty standard and made for a great appetizer. The gnocchi was a little too chewy for my taste and the sauce was watery and didn't seem to blend very well with the dish. The fettuccini, however, was perfect. The noodles were al dente, and the sauce was just buttery enough. Most restaurant alfredo sauce is too heavy and creamy, but this one was light and authentic and felt like comfort food. I would come back just for that.\n\nThe atmosphere is bright and relaxing, and the place, while classy, has a family-friendly vibe that makes it comfortable.", "author": "Apoorva A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Just moved to the neighborhood and came to this spot with my husband because we could smell the food from outside and it was intoxicating.\n\nThe service was amazing, the food was SO good (linguine alfredo with prawns... mouthwatering), great atmosphere for a totally reasonable price. \n\nWill definitely be back!", "author": "Kat B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-16", "description": "Food: 3/5\nService: 3/5\nAmbiance: 3.5/5\nOverall: a standard no frills pasta place. \n\nThe extended review...\n\nFood:\n\nSpaghetti al gamberi - the pasta was cooked well and the shrimp was rich with flavor.  Not a bad dish at all but not mind blowing in my opinion.\n\nService: The service was slow.  Seemed like there were maybe 3 people working the front line amongst a packed restaurant.  Took a while for us to get water refills. \n\nAmbiance: a neighborhood joint.  Pretty quaint and not claustrophobic.", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Was recommended this restaurant while visiting San Fran and was not disappointed at all. Best Italian food I have ever had. Great experience all around! When I was there, there were only two people working the whole restaurant yet service was still amazing! Next time we're in the area we will definitely return!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Went here for lunch today. What a pleasant experience! The owner is really kind and provides excellent service. I really enjoyed the cooked garlic that came in the olive oil with the bread! It's the simple things that makes meals so much more enjoyable! I've lived in the area for about a year and I can't believe I've never noticed this place before. Happy to have a yummy Italian restaurant in the neighborhood. Will be coming back :).", "author": "Uriae W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Been wanting to try this charming restaurant since I moved to the neighborhood 2 years ago, and finally went last night-- I'm mad at myself for not going sooner.\n\nFrom the wine to the garlic olive oil to dip your bread in, it was all amazing! My boyfriend and I split two specials: the lobster ravioli in a cream sauce topped with bay shrimp and asparagus & the rack of lamb with veggies and potatoes. The food was as good as it gets, including the poached pear dessert (and I don't even like pears). \n\nThere was a bit of a wait to get the check, but the food and experience cancelled that out. Would highly recommend to anyone looking for a solid Italian meal in a comfortable quaint atmosphere!", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "A great pasta spot! The service was impeccable; everyone was so nice and friendly, it made you want to come back just for the sweet staff! Additionally, the bathrooms come with a dual locking system, ensuring absolute safety. \nNow, for the part you've been waiting for: the gnocchi in cream sauce was delectable, especially with the obvious addition of Parmesan. The bread provided was a delight and a half, and perfect for soaking in the extra cream sauce at the end of the meal. It is a great date spot, but also a family-oriented restaurant located in a cute area in SF.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "Service was friendly and prompt but the food was rather disappointing. I ordered the Risotto of the Day, which was a Portobello Mushroom Risotto topped with Parmesan.  The flavor was incredible and I love mushroom risotto in general. It also included some asparagus pieces, which I appreciated, since I felt a little lacking in vegetables. But, it was utterly disappointing that the risotto was not cooked completely through. I understand that sometimes people cook risotto more al dente. But, this did not qualify as al dente.  The arborio rice was hard at the core and almost crunchy. It clearly did not have enough time to break down and give you the right creamy and smooth risotto quality. I know risotto is hard to do, but for an Italian restaurant that called this dish one of the specials of the day, I was very disappointed.", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "My FAVORITE Italian restaurant in SF. If you like to feel at home at your neighborhood restaurant then this is your spot! There's not a trip to SF where I don't go by for at least one meal during my time there. Mossimo (the owner) is awesome and always makes us feel like family when we walk in. I have literally tried everything on the menu and am never disappointed. I took my dad there for his bday dinner last night because it has become his favorite restaurant as well. Mossimo went above and beyond to sing happy birthday and bringing out my dads favorite dessert (the stuffed pear). We need more restaurant owners like mossimo!", "author": "Monique L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "I often go to this quiet charming Italian restaurant. \nI found it simply because I lived near by but even though I live in another part of SF I still visit. \n\nThe food is classic Italian meals. It's the kind of food that makes you feel good and the portions are pretty good size. The owner (or who I think is the owner) is a nice older gentleman who's always running around taking orders, greeting people. It's a very cute experience to be there. \n\nThis is probably the only restaurant in the world where I called to place a take out order and a customer at the bar picked up and took my order because the host was busy. When I arrived 15 minutes later the food was ready.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "I proposed to my spouse here, in the back patio area, with an empty restaurant, over lunch one day..... so I'm biased. Will always think of Via Veneto in a positive way....", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "I was in San Fransisco for work/pleasure and was in hunt of a good Italian restaurant to celebrate my friend's birthday at.\n\nVia Veneto was recommended by my hotel's concierge, so off we went. Via Veneto is nestled away between rows of condos and apartments about a mily from the hustle and bustle of Union Square. It provides a quite intimate setting that separates you from the noise of downtown SF. When you initally walk in thre is a small upstairs seating area and open kitchen. When you decend down a rather steep staircase, you find yourself in the main dinning room, which is dimly lit with white table clothes an old Italian decor. \n\nWe were seated right away and our waiter greeted us with fresh bread and oil and vinegar dipping sauce. \n\nWe decided to share a few things. Below is what we tried\n\n-Soup of the day. Creamy tomato bisue-This was excellent. Creamy and rich\n-Beet Salad- Very good. Beets can be a bit overpowering, but this salad was great. \n-Caesar Salad- Tradition Caesar.\n-Traditional pasta with tomato cream sauce-I cannot remember the name of the exact dish, and endless menu searches didn't ring a bell. The best I can do is describe it as a traditional pasta noodles in a tomato cream sauce with spices. It was very good with tons of flavor.\n-Margarita Pizza- Very good, and just the right size to share\n-Tiremusi- Excellent and home made\n-Salted Carmel Gelato with espresso and biscotti-Probably one of the best desserts I have had to date\n\nOur waiter was friendly and attentive and provided excellent service all around. He comped our desserts and corkage fee when he found out we were celebrating a birthday. Not necessary but very nice of him to do, \n\nOverall I really enjoyed dinning here and would definitely recommend.", "author": "Jenn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Small restaurant, seemed to need another waiter. Very friendly.  Ordered drinks and apps.  The bruschetta, eggplant and calamari were delicious and great portions. \nWe ordered our main course,Veal saltimboca, frutti di mare, ricotta gnocchi, and fettuccine alfredo.\nIt was a bit of a wait but well worth it. Every dish prepared to perfection, word of caution the gnocchi plate is very hot. Nothing left when we finished but still managed to split desserts. \nA great recommendation from our hotel while we are on vacation in San Francisco. Would come back the next time in SF.", "author": "Fred P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Great Italian food right on Fillmore. We all had different pasta dishes that were to die for! The servings are huge so you will have leftovers or leave very very full. We met the owner who is helping bus tables and taking orders. They also have a nice patio that not many people we're using so it would be great for a private dinner. Highly recommend checking this place out! Also $15 corkage", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Yelp says they open at 11:30 and no one is here and the lights are off and no one is answering the phone so we drove here and paid for parking for no reason with no indication or sign pointing out the correct hours.", "author": "Christie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "This is a wonderful restaurant catering mostly to locals and serving excellent authentic Italian food at very reasonable prices. Great atmosphere with a very welcoming staff on a great Fillmore street location. \n\nService always attentive. Make  sure to ask about the several specials they offer every day.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "First time here and am impressed with the menu. They have an extensive wine list as well. \nToday for lunch I'm having Gnocchi alla Florentino. Gnocchi in white sauce with Gorgonzola. Awesome aroma and flavor!  This is a definite yes !", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "This is some of the best Italian food I've had in my life. The appetizers (mozzarella and caprese salad and minestrone soup) were amazing, and the bread was warm. This is a great place for vegetarians! The entrees were perfect as well, with good flavored sauces and well-cooked vegetables. Please eat here!", "author": "Amish S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Fabulous food...consistent and filling (great Italian comfort food!) I've been going here for over 20 years now and it's still as good as ever. The usual clientele have become like old friends since we run into each other there often. I highly recommend giving this place a try!", "author": "L H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Honestly whole experience coming here was awesome.\nCame in at 5 and sat immediately, waiter is kind, patient and hard working.\nFood was amazing,\nSure the bread might not be warm but it was fresh and I couldn't stop eating it.\nWill come back here 100% when I return to the city.", "author": "Savannah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Charming place. Great food. Love the veal scaloppini. Pastas are good too. The ambiance is like being transported to Italy for lunch.", "author": "Ruth C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-30", "description": "Every time I come here, there's a comfort in the air from the welcoming owner to other patrons. While the ambiance is good, their food is better! Dishes are always authentic and fresh. The only reason I give 3 stars is for service. We had to ask for more water several times and the place wasn't overly crowded.", "author": "Valerie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "I went to Via Veneto on New Years Eve with my father in law and the rest of the family. He worked there 25 years ago when my wife was just born and he would always talk to us about it. Food was amazing I can't tell you all the food that we ate but best believe it was all amazing and also the service. If I ever go back to the Bay I will be returning. Thank you so much.", "author": "Miguel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-20", "description": "Our first meal here will also be our last. The service and ambience were both pleasant, but every dish we had was lacking in one way or another. \n\nBread brought to the table was fresh, but not even slightly warm. \nThe brushchetta was flavorful, but served on cold, untoasted slices of bread. \nThe calamari fritti were underdone and served with what seemed to be Russian dressing (!). \nThe chicken sorrentina was fine but nothing special. \nThe baked gnocchi were chewy and starchy, rather than light and tender. \n\nWe didn't bother with dessert, as we thought it would likely just continue the trend. \n\nThere are better places to eat in this neighborhood.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Quick Review: Authentic Italian, fast, great staff. SF is all about the trendy spots, don't let the decor or crowd fool you. The food is great and a must try.\n\nFood: App- Calamari with Shrimp ($12); Entres - Gamberi Al Vino Bianco ($19) instead of steamed veggies asked for Tortellini (+$2) \nAmbiance: traditional Italian\nCustomer Service: Excellent, owner is friendly and they are quick! \n\nI love this place!  I have been here a few times before but mainly for business lunches. It was date night again and It was funny first walking in because we were definitely the youngest people there. We got there around 8 and it was only a 10 minute wait to be seated, then slowly younger parties started strolling in. \n\nI typically order the same things after I know what I like but this time I wanted to try something new. Our server was great at recommending the seafood dishes. I was torn between the Gamberi and tortellini and our server said I could combine them without a problem! I wasn't sure how much it would cost but it was only $2 more. Great deal! The calamari with shrimp was also very good. I also really liked the bread because it's not the typical oil and balsamic, they do roasted garlic. My bf got the Sacottino (large pasta pouches filled with lobster) and shrimp and asparagus. His was good but I liked mine better. I like using the garlic as a spread and dipping it in the oil. I definitely recommend you try this place!", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-19", "description": "For a restaurant in an upscale part of town, this one really disappointed. On a Friday evening, there was no wait for a table and the restaurant was half full. It's a small place and they had just one server attending to all the tables. That server was either drunk or ambivalent. He was huffing and puffing as he bused tables. Throwing bread here, a glass there, and  in general, completely in disarray. We had to wait a long time to be attended to and getting his attention was near impossible. The waiter who helped with water seemed disinterested in helping us when we wanted a second glass of wine and we could not get our server's attention. Our glasses remained empty for a long time. Perhaps the worse thing was that he served one of our friends a soda drink that had expired!! It tasted really bad and off and when we checked the date and informed the server, he seemed nonchalant about it, claiming that that was not the expiration date in reality. No apologies were offered. No drinks on the house as a way of customer service. If the food had been top notch, I think I would have forgiven all the above. But the food reminded me of olive garden. And I have nothing against olive garden. But there the prices match the food. Here, we are paying for prime real estate. \nAll in all, avoid. There are some fantastic Italian places to eat in SF very close by. Our fav is Bella Trattoria on geary. You won't be disappointed there!!", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "This charming little Italian restaurant in Pac Heights manages to do the impossible - it is both sophisticated and unpretentious. Even rarer are the reasonable prices in this upscale setting. I've enjoyed the scallopini and the calamari on separate occasions.", "author": "Deborah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "This is a nice Italian Restaurant. During my visits, I  tried several items. The waitstaff was very friendly and efficient. Their spinach salad (Insalata Di Spinaci) was good.   Their pasta dishes were good.  The noodles had the right amount of al dente.  Linguine Del Pescatore and Spaghetti Al Gamberi were both good.  Pescatore had a lot of seafood in it. Scaloppine Saltimbocca (the veal and prosciutto dish) was excellent. I also liked their desserts.  Their Tiramisu and Crepes Dello Chef (which looked like a espresso flavored ice cream burrito) were very good. The Pera Arlecchina was also good.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "First time dining at \"Via Veneto\" on Wednesday 11/16/16...\nNo reservations...\n\"Carlos\" was our wait staff, very impressive...He provided with great food recommendations and was totally attentive to us...Their \"Crown Royal\" pour was shy but other than that a very \ngood experience...\"Veal\" dish was excellent and was their \"Beef Lasagna\" ....\nWe would totally go back", "author": "Judy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Privately owned by the nicest Italian man who lives above his restaurant and waits on his customers. Nice mix of regulars and first time visiting patrons. \n\nPortions are moderate to large, and well-priced. You can get a massive bowl of pasta for $19. Wine menu is not overly expansive and they do have wines by the glass. I ordered a gin and tonic. The glass was 80% gin and was served alongside a small bottle of Mediterranean tonic, a nice touch!\n\nWe ordered:\n\nBeef carpaccio. Beef was so thin and so delicious. generously topped with fresh grated parmesan and capers. We put a little garlic olive oil served with our bread on it for further flavor augmentation.\n\nShrimp with marsala wine, mushrooms, tomatoes, and green onions. Served alongside a vegetable medley and well cooked flash fried potatoes. A lighter dish, but very good. Shrimp were very slightly overcooked but large and fresh tasting.\n\nThe Chilean sea bass special. So good. Fish was so soft. You dont need a butter knife or a fork to cut it. You could use something as dull as a rolling pin and you'd still cut it perfectly. The sauce was lemon,garlic, white wine but very light. Not thick in texture or super buttery. \n\nCreme Brûlée. Pretty good but you could tell it was prepared in the morning. Great vanilla flavor but a little custardy.\n\nWith a glass of wine, that gin with a side of tonic and all the food above, we escaped for just $85. I know it seems to be on par with other Italian restaurants in SF, but the personalized service made it very special. Would be happy to return and recommend this restaurant to friends.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-03", "description": "It's like those Snickers commercials - you're simply not at your best when you're hungry.  Immediate seating (and a former coworker's recommendation) is a reason to eat at a restaurant, but not necessarily the best one.  I should have known better considering hardly any of my Yelp friends have reviewed this place! \n\nIn terms of ambiance, Via Veneto seems to fit the Pac Heights neighborhood rather well.  The décor is fairly nice and the dinner crowd seemed to be a little more well to do (probably from the area).  At the same time, it wasn't a formal, stuffy sort of place given that a lot of people (including us) were dressed a bit more casual.\n\n- GAMBERI E CALAMARI FRITTI - Deep fried Shrimp and Calamari...$11.50\n(http://www.yelp.com/biz_photos/via-veneto-san-francisco?select=mROok9JZx19AwvOJlI8FHQ#exauMW9svUldi7GeV0uUcQ)\nIt was better than my entrée (which isn't saying much), but it was just okay overall.  The aioli wasn't bad and I thought the shrimp were actually pretty good.  However, the calamari was small, overcooked, and bland.\n\n- RISOTTO DEL GIORNO (Risotto of the Day with Bay Scallops, Sun Dried Tomatoes, Mushrooms, and Green Onions...A.Q. ($18.95)\n(http://www.yelp.com/biz_photos/via-veneto-san-francisco?select=mROok9JZx19AwvOJlI8FHQ#w-QtN9Kvlta-4RXzRkI0jw)\nHearing \"risotto and scallops\" had me sold, but I missed the part about all of the sun dried tomatoes - so overwhelming!  While there was a decent amount of scallops, the risotto had a sort of mealy texture and the taste of the dish as a whole was a bit off.\n\nMuch like how the food looked good but ultimately missed the mark, the service was more of the same.  Although the manager (owner?) was quite friendly, it took a while for them to take our order and we weren't given water glasses until our food was about to arrive.  Nothing heinous, but worth noting.\n\nI've seen the desserts recommended a few times, but to be honest, if it's anything like my entrée, I'm glad I didn't bother finding out.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Two nights ago was my 3rd times dining at this restaurant.\nI had the same thing 3 times in a row I've been here: Fettuccini Alfredo with mushroom and chicken and we split the calamari.\nNever failed food is always good the owner is alway nice and friendly and the stuff too.\nThe price is good too. I don't care about the decor the food is good, price is good the people are friendly that's all matter.", "author": "Ty N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-20", "description": "Good food, slow service.\n\nAmbiance---quaint Italian restaurant in Fillmore Street; comfortable but got pretty noisy\n\nFood---very good! Fresh, well prepared, visually pleasing, not too expensive \n\nService---very slow; the restaurant is understaffed with one waiter, who doubled as a busboy, for 25 people. He did his best while the owner sort of stood around", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "I've never been able to figure out why Via Veneto doesn't have a higher rating on Yelp but it is right at that 3.5 mark some places on Yelp have that are in fact great but for some reason they seem to have a few lower ratings holding them down. My family is Italian and we have spent countless 2-3 hour dinners at Italian restaurants over the years. We have a big chaotic family and everyone likes to talk... luckily most Italian restaurants get it and never try to hurry us. My family does \"Sunday Dinner\" but when I moved up to San Francisco I found myself missing our weekly family dinners and wanting to still go out for some comfort food on Sunday nights even if without them. \n\nI had walked by Via Veneto numerous times and it's charm had appealed to me. It doesn't have the \"trendy/modern\" decor of most San Francisco restaurants, in the best way. It's authentic, home-y, and truly Italian. So one night, with some pushing & encouragement over text from my brother, I decided to venture out to Via Veneto all by myself. I had never really dined by myself but I put my Kindle in my purse and walked into the restaurant trying to hide how petrified and nervous I felt for this new social experience. They instantly made me feel at home with their Italian accents and warm, gracious greetings. [Huge sigh of relief from me.] I think they could sense my nervousness and when asked what table I wanted, he jokingly offered to put me right in the window. I requested a small table in the back and he took me right to the table. Now is the point at which I learned going out to eat by yourself as a woman is great- the best service you will ever get! :) \n\nI always get the gnocchi (my favorite!) and have also had good wine here. The bruschetta is delicious as is the tiramisu. The tiramisu is perfectly fresh and light as it should be, not soggy. My family can be quite critical of Italian desserts and Via Veneto is authentic.\n\nI have since been back many times including take out and am always greeted with the same warmth. I hadn't been there in a while recently and when I stopped in they were so happy to see me, asked where I had been, and took care of me while I waited for my order. I always get the sense that most of the other customers are longtime regulars and this is a gem in the neighborhood.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Great Sunday dinner here about a week and a half ago.  Massimo, thanks for a memorable evening to you and staff!", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Dinner is wonderful; you will be personally welcomed by long-time owner Massimo. No corporate franchise this! Via Veneto is also a serendipitous spot to lunch, best appreciated if one is not rushed.\n\nYou might also espy one of the Supreme's dining on the premises on a Sunday evening. I have!", "author": "Claudia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Happened to be browsing restaurants area in Pac Heights and randomly walked past this place. The ambience is nice, a lighter painted place with pretty art painted into the wall. The crowd seemed there seemed more mature. We were greeted by at the door and seated within 5 minutes. The staff here serving the table are very knowledgeable about their menu. We must have asked the staff about 10 different dishes and they described them perfectly. Our waiter said he had been working at the restaurant for 12 years which was pretty impressive. We asked what he recommended. He gave us a few dishes. I ended up getting lobster sacottino, one of the special dishes of the night, and my lady friend ended up getting the Gamberi Al Diavolo. My dish was a lighter dish. Came with a wine butter sauce which was not bad and was topped with shrimp. Inside the noodle pouches was a lobster spread. Was good but not my dish of preference. I'll probably go back and try something with a cream sauce next time. My lady friends dish was a little more tasty. She asked for tortellini instead of vegetables. Definitely liked her dish more. Before that we ordered and appetizer of shrimp and calamari. That dish was really good. It came with an orange zesty sauce, a lemon slice, and the breading on the dish was really good. \n\nOverall I liked my experience here and would come back. Adding photos to give you a better idea of the dishes we tried.", "author": "Arias D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Ohmygosh, the food is just amazingly fresh!!!  Love this place!  Sitting outside and it is awesome.  A rare SF nite!", "author": "Jan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "This restaurant was a good surprise. We are very exigent about Italian food and VV didn't disappointed us.", "author": "Emanuelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "My daughter and I enjoyed our dinner at Via Veneto. The place is nice decorated and the food is good and fast. Fast is good with a hungry teen. We both had pasta and desert. Everything was well presented and the service was great. The little girl wants to come back on her next visit.", "author": "Scott K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "We were recommended to this restaurant by locals.  It was a true find!  The food and service were superb . We would definitely return.", "author": "Ellen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Some of my favorite Italian restaurants closed up and my husband and I were trying to find our \"new place.\" We came across Via Venuto from a friend recommendation and I'm happy to say it has now become our go to when we want Italian. Best tiramisu and Cioppino by far!", "author": "andrea B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-09", "description": "Ended up here after a couple reservation cancellations owing to a debate of sorts over what type of Italian was desired by my parents visiting from out of town. They wanted simple, straightforward Italian dishes and this place does fit the bill - plus they could accommodate us at 8:45 on a Saturday night. Hint: being 1/2-full on a Saturday night when you're located right on Fillmore isn't a good sign...  \n\nIt took over 10 minutes until anyone even came over to fill our water glasses and bring us bread - and the bread by the way was cold, stale, and personality-less. Another 10 until my dad's drink was brought (in a pink and purple paint-penned \"birthday girl\" martini glass, no joke) and our order was taken. \n\nService aside, I've had better food at Olive Gardens. The salads had bland, watery dressings and were served with hard, tasteless tomatoes (ok, I'll take some heat for ordering tomatoes in the winter - but if you're going to put them on your menu, at least ensure they're ripened before serving). My parents ordered linguine with clam sauce; the clams were fine; the sauce was a thin, flavorless broth. My lasagna was drowning in a creamy tomato sauce that wasn't worth the calories.\n\nAs for people claiming that it's reasonably priced, sure it's not expensive, but you can get infinitely better dishes of pasta for the ~$20/plate they charge. My overall take: I'd be embarrassed to be a native Italian (which the owner is) serving such mediocre Italian food.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "The owner and the waiter were super hospitable. I dont think i have ever had any restaurant cater to me as they have. I was treated as family. We tried the shrimp and calamari it was delicious. I ordered the fish special which was just okay the waiter noticed i was not so thrilled he came over and apologized then offered dessert on him. I thought that gesture is going above and beyond. The dessert was fabulous!", "author": "Maria N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "OMG Via Veneto was so tasty! It's a typical traditional Italian joint (in Pac Heights, I think?). Our group of 4 shared the eggplant appetizer, bread with garlic and olive oil, and 2 bottles of wine. \n\nI ordered the linguine pescatore, which was past with mussels, a prawn, and calimari in a red sauce. Perfect mix of seafood and a red sauce.\n\nWe didn't get dessert, but I wish we had. The creme brûlée looked excellent, but none of the other girls appeared hungry so I didn't want to be the fatass who ordered a final course.\n\nPrices are reasonable, service is definitely slow but also charming, and the food was on point. I'd come back.", "author": "Allison R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Stopped for dinner last night while shopping on Fillmore. Love the quaint, neighborhood feel. It's a sit down, cloth napkin, chef kind of place. Not a cafe or pub, so that was nice. Service was excellent. Wine was excellent. Food was excellent. Tables are a bit close together so if you don't like the family feel of that you might want to sit more to the back. We loved it! Hubby and I both had the lobster stuffed ravioli and friend had the chicken and salmon specials.", "author": "Gwen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "This restaurant has the best Italian food! It's is so good and the portions are the perfect size!  It is located in a cute part of town with lots of shops and bars.   The service was very slow but otherwise it was a great experience!   The gnocchi with the red sauce is the best I ever had!", "author": "T C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "This place is just lovely. The owner is a character, the food is lovely and the ambience is perfect.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "After viewing the other good reviews, my wife and I decided to give Via Veneto a try while we visited San Francisco. We were so happy that we did!\n\nThe service was great and the food came fast. I enjoyed the bruschetta; the bread slices were toasted, but remained easy to eat (not all dried out and crumbly). When the entrees arrived, they were piping hot and the taste was exquisite. \n\nIf you're in the neighborhood, give it a try.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-31", "description": "The glasses were dirty, food was pricey for its quality for once I can say that I don't recommend this place.", "author": "Florent M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-21", "description": "I'm only giving this 2 stars because the gnocchi my friend ordered was good and the busboy was really on top of his s**t. \n5 out of the 8 of us that ate got some form of food poisoning. The only one that had NO symptoms was the gnocchi eater. She didn't try any of the seafood items. \nBesides making us sick, it also tasted gross. I got the seafood linguini and it was incredibly fishy tasting. I did not finish it.\nThe service was also terrible (except for the busboy). We were ignored most of the night and when we asked about a wine, he brought us a more expensive wine, saying it was better. \nI will NOT be returning.", "author": "Katey W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-29", "description": "Via Veneto is very old-school Italiano. You expect a face-lifted society matron wrapped in mink to come in with a gigolo named Paolo. Yeah, it has that Dean Martin feel about it, especially with the unctuously congenial waiter and the unadventurous menu. I came here with my friend Maggie who lives in Pac Heights, and she loves the place. I can see why since the food is very nicely presented, but I have to admit I left something less than satisfied. The ho-humness must have gotten to me after all. \n\nMaggie ordered the $15 Spaghetti al Gamberi, which was tossed with fresh prawns, a little garlic and plenty of olive oil (see photo). I had a taste of it, and it was good enough, just kinda boring. I went for the equally somnambulant Scalloppine al Limone ($16.50), which were veal medallions sauteed in white wine, lemon, capers and garlic. The veal was certainly tender enough, and it was not too lemony, the downfall of many a family-run trattoria. But the blandness factor was setting in, and I started thinking why a restaurant so dedicated to presenting traditional cuisine couldn't take more of a risk in the execution. \n\nThe one surprise was actually the $10 Insalata Caesar for Two, which promised a \"tangy\" dressing (see photo for one serving). It actually was because it was not turned into the creamy globbiness one expects at a restaurant. Instead, the zinginess of the lemon made for a lighter taste that was most welcome after a hefty bread basket. The place gets crowded quickly, and they do squeeze as many tables as possible together, so watch those elbows. By the time the meal ended, I have to admit I was somewhat relieved to be out of the place. The irony is that they didn't do anything wrong. They just didn't bother to delight me. \n\nFOOD - 3 stars...traditional Italian fare done well and with next to no surprises except that Caesar salad \nAMBIANCE - 3 stars...Dean Martin would be here every night if he wasn't dead \nSERVICE - 3 stars...unctuous and perfunctory but with an accent \nTOTAL - 3 stars...I think it's back to North Beach for me", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "Came here last night after seeing a movie at the clay theater. I ordered the gnocchi w/ tomato sauce but had vodka sauce substituted and it was fabulous. The sauce tasted so fresh and the dumplings were delicious! Our waiter was very kind and accommodating of our requests. We were seated promptly and had a great experience.", "author": "J L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-20", "description": "It's not like I've never been here before, but for Yelp purposes, I feel that one should know my most recent experience here.\n\nWe came here for a debriefing work lunch and I was excited just to eat. Forget the ambience, I already know this place is considered foofy, but I don't go for the atmosphere, I go for my palate!\n\nBefore lunch, I looked at the menu online because I needed to watch my calories. Ha, go figure. So I get there fantasizing of a caprese salad and I copy one of the doctor's entree and end up ordering  a grilled salmon with tomato slices and basil. My mouth is watering. \n\nIt was beautiful when it arrived. I had to take a picture. I mean, yeah, we all know what a nice salmon looks like, but come on, it was for Yelp purposes. It looked so beautiful paired up with the bright red tomato slices and the rich, green basil leaves, accented with a nice pop of yellow lemon! I squeezed the hell outta that lemon onto my whole dish, sprinkled some salt on those bad boys and ate like a sophisticated woman, all dainty and *ish because I needed to be professional.\n\nIt was so nice taking in all the flavors of the fish and the vegetables. It was delectable. It took most of my energy not to scarf it all down, that plus there were only a few slices of tomato. If I were at home, those tomatoes would be gone in a split second.\n\nIt was excellent; salmon was moist and beautifully seasoned. Heathy and delicious. Ah, I'm so proud of myself. \n\nThe service that everyone talks about on Yelp (being that it's crappy and stuff), I didn't experience today. I was on radar for it because that's all I read on the reviews. Then again, the dental school is a major patron of the restaurant and since we had a reservation, perhaps we got special treatment? Whatever, doesn't matter to me. The food was good and I left happy!", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-30", "description": "I am giving this place two stars instead of one star because the hostess and the waiters were friendly. Unfortunately, the food was horribly subpar. I ordered the Insalata Della Casa and the dressing, the mustard vinaigrette, was watery and tasted like it came out of a bottle.\n\nMy niece and I ordered the same entrée, Gnocchi Alla Sorrentina. We agreed that the gnocchi was a little rubbery and the sauce tasted canned, kind of like Chef Boyardee. We left more than half of our plate untouched.\n\nI've been to Italy several times and I lived in New York City all my life except the past five years--I have tasted great Italian food but this is sadly subpar and it was so disappointing. I would strongly suggest going elsewhere.", "author": "Lola B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "This place was a great find by accident. A friend and I were craving a good glass of wine so we stopped to read the outside menu. We were immediately charmed by the  decor and the owner who came out to greet us. Once inside, our server was quick to approach and get our orders in. The owner stopped by a few times to make sure the food was to our liking. \n\nWe tried the Fettuccine Alfredo, Tortellini, Bruschetta, House Salad and White Whine. All food and wine was delicious! This restaurant has been there for 23 years, which doesn't surprise me after the wonderful experience we had. Go try it!", "author": "Monika K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Fantastic honest Italian food. Bruschetta on point as well as mussels and lobster ravioli. Found it by chance while waiting for another restaurant.  Fantastic service as well. Massimo will make you smile.", "author": "Jennifer E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-20", "description": "20pp in the Restaurant And only 1 Waiter? I feel really bad for the Waiter. Dont know who runs this Restaurant but you need To learn how to run one. \nYou're cooks are watching the server run around like crazy trying to keep people from leaving. No teamwork effort. \nThe only reason you get 2 stars is because your server is a rockstar.", "author": "Alejandro S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-26", "description": "My girlfriend and I were searching for a late night last minute dinner spot and stumbled upon Via Veneto. I have been once before but could not remember my experience. I will summarize the experience:\n\n1. Slow service: Waited at least 5-10 minutes before we even had a server over to take drinks.\n2. Food was bland and portions small: Fettuccine Alfredo was bland - Pasta in straight cream and nothing else. Scaloppine Saltimbocca Veal - Meat was okay but was served with 4 potato quarters and 2 tablespoons of veg, not much for a growing man.\n\nNot great Italian, will most likely not go back in a rush. Much better Italian food to be found in the city (North Beach).", "author": "Nick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Had dinner here for the first time after a movie at the Clay. Good thing I walked in before and made a reservation: when I got there at 6:30 it was packed.\nFood was excellent: I had the carpaccio (thinly sliced-nice) and the shrimp al diavolo (ingredients very fresh). My glass of wine was good and pour not stingy as is the case in some restaurants. Service was very competent and pleasant especially given how crowded it was. Looks like there are a lot of regulars. I understand why. I'll definitely be back.", "author": "Francoise F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "Last unpretentious refuge on upper Fillmore.  There's only a couple of places like this left round these parts: tasty, friendly, reasonably priced and not part of the scene.\n\nMassimo owns the place, he and his restaurant have been there for thousands of years.  Among the understated decorations are some huge wine bottles and, in the back, a U.S. flag that was flown over the capitol accompanied by a plaque signed by a unit of Marines.  Somewhere hidden behind the bar is a photo with Massimo and Robert De Niro - not being served, not eating; just hanging out.\n\nIt took about two months before girlfriend and I were sick of Fillmore Street's other options: uninspired Mexican, gourmet Vientameese street food, \"free range, grass fed, sun tanned, oxygen treated, humanely fried, organically slaughtered, omega-3\" CONSTANTLY OVERCOOKED PIZZA (yeah, I'm looking at you, Del Fina on California Street).  Blah, blah, blah.  Just give me a thoughtfully prepared cream sauce with fresh ingredients and portions large enough to pack a small snack for later.\n\nRecommended specials: Lobster ravioli or lamb shanks (I think it was in a sherry reduction).  Start with an insalata Via Veneto (they are generous w/ the dressing so order it on the side if you want it light) and split the calamari with someone.  It's pan fried so lightly you can still taste the squid - most places dry them so deep you might as well be serving french fries.", "author": "Conrad F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "My friend and I were in a hurry to get to a movie across the street.   Our waiter was fantastic!  He took our order immediately and made sure we were done and paid in time to get to the movie.  Plus the good was perfect!  Delicious!   Highly recommend!", "author": "Betty G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Had a great last minute date night meal here. Had avoided them for years due to poor reviews on Yelp. Guess that's one problem with Yelp. I ordered the shrimp scampi and my wife had the gnocchi. Both dishes were awesome. One relatively small thing I judge Italian restaurants by is their bread. Via Veneto's bread was crunchy sour dough--which was fresh and BEST best. Perfect for dipping in olive oil and the sauce in my dish. Yes I literally had a cleaned plate when we were done. Can now safely say Via Veneto's we'll be neighborhood regulars. Far better than Jackson Fillmore--which we think is over rated. And the bathrooms were disgusting. But that's for another review. :)", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Lovely restaurant with a welcoming and friendly staff.  After dinner take a stroll around the neighborhood-- it's a very lively place!", "author": "Adrienne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "Not a bad Italian restaurant. The portions are huge. \n\nI ordered the gnocchi because of all the Yelp suggestions. It ended up being super rich, so you have to have a hearty appetite to finish it. \n\nThe ambiance was fine. Nothing fancy, but still very reminiscent of establishments in Italy. They serve you olive oil and garlic opposed to balsamic vinegar which we thought was odd. Must be a regional thing?\n\nIn general, I'd return. It doesn't go out of your way to WOW you on Fillmore, but if you're just craving quick Italian - might as well come here.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "I have been going to Massimo's restaurants since he was in North Beach.  Always a good choice.  Food and service are exceptionally good.  Keep up the good work!", "author": "Allan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-04", "description": "After reading a bunch of mediocre reviews about Via Veneto on yelp, I was slightly discouraged. Luckily I didn't take them to heart, or I would have missed out on a fantastic meal. My boyfriend and I both ordered the Lobster Saccottini in a cream sauce with asparagus, baby shrimp, and tomatoes. It was the most amazing pasta I had ever eaten in my life. \n\nThe meal consisted of 3 saccottini purses - at first glance I thought it was a rip off, but I had a hard time finishing the 3rd one. They were so rich and filling, and the pasta was tender, it almost melted in my mouth. We didn't have an appetizer or any dessert, so I can't speak for any of that. They had a special NYE 2013 menu, so we are definitely going back on a regular night to see what the rest of their food tastes like.\n\n\nDon't let the rest of the yelp reviews fool you, Via Veneto has amazing service, great decor, and even better food. I would highly recommend going here for an unforgettable meal.", "author": "T M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "Easy to get a table on a Friday night... The food was good..\nStuffed mushrooms were pretty awesome, Gorgonzola Gnocchi also very good...but its pretty heavy, best to share. \nI had Chicken, eggplant, red sauce.... The chicken could have been fresher/better and a more healthy slice of eggplant would have really helped out.\n\nService was awesome... I would definitely come back and try some new items... The specials sounded great.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "OMG this place is legit. Good food. Good vibes. Good costumer service . Thank you fish!", "author": "Gustavo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Favorite Italian on Fillmore. Food great, deserts amazing and great for families that want something other than pizzas or burgers.", "author": "Sal F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-11", "description": "Good wine; pleasing interior.  As for the food (I had gnocchi with basil & mozzarella & tomato sauce, my son had a seafood pasta, the other two had carbonara and veal)-- I felt like I could buy the same things in plastic microwaveable containers at Safeway down the street.  Sorry.", "author": "Alan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "This place was so great! Good Food, excellent service! I will add this to my list of restaurants to visit on my next visit!", "author": "Liza P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "Via Veneto has been a local favorite of ours for many years.  The very welcoming owner has kept the restaurant consistent over the years, making it a nice choice for a variety of occasions.  Many of the 'standard' Italian dishes such as capreses, carpaccio, etc can be found, as well as many unique creations.  Some favorite entree dishes of mine are their sole dishes (consumed on my most recent visit), veal dishes, and their fresh pasta specials.  Crepes for dessert are always a winner.  Compares favorably to a number of small Italian restaurants in the area such as Capannina, Ristorante Milano, Pane e Vino, Seven Hills, Jackson Fillmore and others.  The prices are quite reasonable for the value of the food, and I will surely return.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "One of my favorite Italian restaurant in San Francisco. Everything I've tried have really enjoyed. The minestrone soup is excellent! The owner is very nice and they are so welcoming to our family, especially our daughter. I always look forward to dinners there.", "author": "Caroline U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "We happened to pass by after a concert this afternoon, read their menu and thought we would give it a try.  We are glad we did!!  The place is very nice and ample.  The service could be a little better but it is nice and personal and we were not in a rush.  The stuffed mushroom appetizer was delicious.  One of us had the risotto of the day and it was the best I have tried. We also had the penne and the tortelini.  Both were excellent!\n\nThe wine list is very reasonably priced.  We were too full to try dessert.  We will just have to go back!  \n\nMassimo was great, as the rest of the staff.", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-03", "description": "Don't be fooled. The aesthetics of this restaurant are pleasant, I will admit. However, the food is less than underwhelming. It is disappointing. And they don't do the little things right! The bread was hard and cold and it came out only after we asked about it. The soup was watery and prompted us to ask whether it came from a can. We're talking Chef Boyardee.. The pasta had an imbalance of flavor and the meat tasted like a stack of paper. The one bright spot was the waiter. He had just the right amount of charm and concern. But that cannot be the only thing that is good in a restaurant. This is a poor decision if you end up here with a date, friend, or with your family. And it's much more expensive than it should be. But then again, I feel that it should be in the range of $0-$5 per entree.", "author": "Daniel O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-18", "description": "Excellent Italian food. Atmosphere is a little bit starchy, but if you're eating during the day and the weather is nice I recommend eating in the back outside. You won't be disappointed in general, good food.", "author": "Danny O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "Thankfully, we did not read the earlier Yelp! reviews before we sat down to eat here.  From the street, the place looks great.  There is some sidewalk seating, and a nice patio in back as well.  So, aesthetically, yes, the place looks great Daniel O.\nWe took some time ordering.  The menu does not contain the all-too-common over-whelming number of dishes.  There were several dishes in each category, and all were described with some detail.\nMy spinich salad was exactly what I expected from the menu; fresh spinach (not wilted), healthy amount of walnuts and gorgonzola, and just enough dressing to know it was there (hate those drowning salads).\nMy seafood dish was outstanding.  Prawns, shrimp, clams, and calamari.  Red sauce was not oily, and had a nice zesty flavor. \nWine pours were very generous, and at around $9/glass (for almost everything) a great deal.  Many glasses of wine by the glass are available.\nThe fifth star was withheld because the seating was a bit awkward, and the sun right in my eyes for half the meal (need some kind of shade).\nWill return.  This place is a great value, and feels very authentic.", "author": "Russell R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "Had a great time at Via Veneto tonight. Thank you Massimo for the complimentary limoncello, thanks Carlos for your great service!", "author": "Carissa Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-22", "description": "Ordered the fettuccine with seafood... Mussels clam octopus. Didn't taste fresh. Very strong seafood smell, like a fish market on a warm day. Pasta was good texture but sauce not spectacular. Bread was hard as a rock and stale with too much crust. With tons of options in fillmore area, would not come back here again.", "author": "Lars B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-20", "description": "We were in a mood for some Italian food. After almost 2 years we hadn't tried any of the Italian restaurants in our neighborhood so we decided to start with via veneto.\n\nWe had the calamari, the pasta gamberini and the linguine del pescatore. I have to say I was very disappointed.\n\nI have to point out before I describe the dishes that the service was outstanding. The waiters were attemptive and the service was fast.\n\nNow to the food:\n\nThey started by bringing the traditional olive oil and bread, the olive oil had added buttered garlic (sending my mouth to watering state upon sight), once I dipped the bread in the olive oil I immediately regretted my choice for the main dish. The olive oil had no flavor at all, it was weird, i almost felt like it was watered down with canola oil.\n\nMy pasta dish had an olive oil based sauce so, again I faced the same problem with the flavor, I was also surprised that the gamberini pasta had a grand total of 4 prawns and 4 small tomato cubes. I the end, it was just a huge stack of spaghetti.\n\nBf's pasta was much tastier but there were two huge issues, every single bit of seafood was from frozen source making them very chewy, almost like rubber and there were little bits of grain (or sand) in the mussels ) you could feel it between your teeth crunching away.\n\nwe decided not to have dessert. I was just average, and the bill was too big for what we had in the plate (think about how much half a box of spaghetti, 4 prawns, and two table spoons of olive oil would cost you, not even close to the 15 bucks we payed.", "author": "Bea L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Excellent food, drinks, and service.  We have been coming here for a number of years now whenever we feel like real Italian food.  Their clamari fritti is crisp but tender and fresh, the best in the Bay area.  Also, their calamari salad is fresh, succulent, and delicious.  We always get those for appetizers.  The last time we were there last week, we had their specials - rack of lamb and haddock.  They were excellent - the rack of lamb was rare as requested, and very tasty sauce.  The haddock my wife had was also outstanding and succulent.  In addition, steamed mussles and veal saltimboca, their menu items, are excellent.\nThis is also one of the very few restaurants that knows how to make an East Coast style dry martini (ironic in that martini originated in SF and named after Martinez).  Massimo, the owner, is gregarious but friendly and keeps the restaurant in shape and flourishing.  The only downside is that this restaurant is not on Open Table (the Via Veneto's on Open Table are in Chicago or Los Angeles), and you have to call to make reservations", "author": "Hoyle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "My husband loved his expensive ravioli in tomato cream sauce. My dish however was not so good. The prawns in lemon garlic cream sauce - all 5 of them were dry and tough while the potato pieces were over cooked and mushy. The presentation was quite unappetizing. The prawns were dumped in one space, the potatoes dumped in another space, and the zucchini was dumped in a third space. Our salads were good. The bread was stale. The daughter of the owner seemed depressed and tired. Sad. This was a restaurant I loved years ago. BTW, the vegies were very tasty on my dish. So for $61, I had a few slices of yummy zukes. Well, my husband loved his meal. And so the 3 stars.", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Went with my fiancé for the first time last night and we loved it!   We sat at the bar and were treated so well.  The wild boar over penne was awesome!  We will be back.", "author": "Clark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "I've been here many times. IF you'd like to have some great Italian food at Via Veneto order pollo al marsala, fantastic!, pollo con spinaci, rack of lamb or new york strip steak when they have these as specials. All are excellent, as are fish of the day specials. All the fish are perfectly cooked. I've tasted the veal scallopini and its superb. All the vegetables are perfect, as with any really good Italian restaurant. Try bruschetta, mozarella capressi as antipasti.  You won't be disappointed. My favorite pasta dishes are Linguine Alle Vongole, Fettuccine Alfredo or Penne All' Amatriciana.\nAs for the service, they seem to be a little shorthanded sometimes, but its worth the wait! One of my favorite restaurants!", "author": "K V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Ordered the gnocchi with mozzarella and red sauce- best melted cheese experience of my LIFE.\n\nAmazing service as well.  Very cute place.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "I have been coming here for at least 25 years.  Regularly except for a  couple of 5 year periods here and there.  This is what it is, and it is unique.  \n\nReasons to come here:  It is old school--no trendy phony pandering to the jerks bullshit.  An eccentric, wonderful, cranky owner. Pleasant late 1980's decor. Wait staff is mostly friendly, sometimes uneven, but ultimately, professionalism reigns.  It is rarely loud (weekends excepted) and one can be an individual human being here. Alone or with a group. There is no annoying canned music. You can get carpaccio.  The food is dependable.  I repeat.  The food is  98% dependable. I didn't say it will make the top 100 restaurants in SF.  If you order right, it's good. The strongest items are fish specials and traditional bologneses, meat balls, lasagna, sometimes ravioli.   Don't expect pizza. And it is reasonably priced.  You pay  a fair price for what you get.  All ages and various walks of life come here, though it is preferred by the over 50 set.  \n\nThe minestrone has saved me, body and soul, more times than I care to think.  It's simple.\nThe wines are at least decent, always.  Not spectacular, though perhaps by the bottle, and there is a substantial wine list.  Which is kind of all around how it is--not spectacular, but wonderful in its own way which is a minor miracle in this recently benighted  town.  \n\nReasons not to come here: the reasons not  to come here might be the same reasons  for others  to come here. This is not a top tier gastronomic experience, so don't expect that. Americans rush rush rush at meals and Europeans do not. A number of reviews complain about slow service here, but I don't find that a problem at all, since I can't stand America.  But you might.    The menu hasn't changed in 20 years, and some ingredients are on the cheap-ish side.   Which you may like or not like.  As far as authentic, well, the owner is Italian, so in a sense the food is authentic, but as an example, at times quick rice rather than arborio is used for the risotto, so if you are a stickler snob about Italian food, nota bene.  Lovely olive oil and garlic, but so so bread. Vegetables are uninspired.  Tomatoes always under-ripe.  Personally, I wouldn't come here  for a special night out--but I come here for daily fare.  New customers or certain favored  regulars seem to be treated with more consideration at times, by some unique formula.  If you want to be coddled by wait staff, forget it. \n\nVia Veneto is either your kind of place or it's not. It is my kind of  place, most of the time.", "author": "harmonia b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "Via Veneto is a gem in the city. The owner Massimo is a fantastic host. He will make you smile and make sure you have a fantastic dining experience. He has a great wine selection and specials everyday. As a New York Italian guy I can tell you this food is as authentic as it comes. \n\nI often go in and just sit at the bar. I tell Massimo to surprise me with a salad, main course and pasta. Always delicious. I've never been disappointed. For dessert don't miss the profiteroles with chocolate.\n\nGreat food, service and people. Enjoy!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "From the seafood to the pasta it is perfect, I have been coming here since before I can remember. Authentic Italian with upscale causal atmosphere that's perfect for lunch or dinner.", "author": "Alison R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "Second time, I eat there, and I will be going back again. This is a little bit of real Italy, loud, crowded, not super friendly, but real. ITALIAN. Food is excellent, wine and cocktails are awesome. There is no push, I you need something, they responde quickly. Prices are in the reality. Compare it to other Pacific Height places, and you will be a regular in this restaurant. I am serious.", "author": "Aleks V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Recently, my three girlfriends and I were in the mood for some local Italian food.  Our normal go-to spot, Jackson-Fillmore, was completely booked.  Luckily, I remembered that there was another Italian restaurant just a few blocks down.  We walked in and were immediately greeted with open arms by the boisterous owner (I wish I could remember his name).\n\nHe sat us at the large corner table and personally waited on us.  He asked all about us, where we were from, what we did, etc.  A very bold man, if you will.  He made us feel like regulars.\n\nThe bruschetta was great, as were the stuffed mushrooms which were complimentary since we were first-timers.  The Gorgonzola Gnocchi was out of this world.  Light, airy dumplings covered in a rich coating of gorgonzola cream.  One of the best pasta dishes I have had in some time.  The wine list is pretty extensive as well, but our trusty new friend made the appropriate selections.\n\nWhen we returned a few weeks later, he knew exactly who we were, what we had ordered prior, and where we sat.  I still can't believe that it's not jam-packed every night!  But don't base your opinions of the restaurant on the crowds...Via Veneto is a must-see!", "author": "Judy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "Amazing food! Amazing service! Amazing experience! 100% satisfaction! Great great great! Me and my girlfriend ordered appetizers, two pasta dishes two desserts, and it was under $75.00 with a 18% tip. But it tasted like a million dollars.", "author": "Trevor S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-29", "description": "Good food, awful service! I had a reservation for my husband's bday they didn't even reserve a table. No recommend especially for a special day.", "author": "Ceren B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-11", "description": "Was already reviewed by Sara L. We are the parents. The menu looked appealing and the reviews good. I was stunned by the quality of the food  and service. Bread was stale. Caesar salad with no anchovy or appropriate seasonings. Tasteless linguine with clam sauce.  The lasagna was literally swimming in a bland creme sauce. I cannot understand the disparity of reviews to food quality.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "I had to try this restaurant because my esthetician's husband owns it. I was visiting Pacific Heights, and decided to stop in. The food is fresh, and cooked in a very homestyle fashion. The atmosphere is casual and friendly, often getting more noisy into the late evening hours (7pm-9pm). When I was seated, I was given some bruschetta--which was fresh and flavorful. I ordered the veal with lemon, which was yummy. On my second visit, I ordered the lobster ravioli. I recommend the lobster ravioli since it is served with a rich cream sauce and calamari. The wine selection is great, and Massimo is a wonderful host. During my second visit, I brought the chefs some of my homemade Tiramisu. In return, I was given a glass of Limoncello. If you get a chance, have David make you a cappucino...it's wonderful! If you are looking for great service and homestyle Italian food, give Via Veneto a visit.", "author": "Anastacia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "I was surprisingly impressed.\n\nWent for an early dinner with coworkers, who started with glasses of wine in the back patio before I got there. I had a bite of the bruschetta (yum!) before joining them.  Wines by the glass were $9-10, and I had a good malbec.\n\nOn a random Thursday night ~6pm, the restaurant was pretty empty but it made for easier conversation. Service was fairly attentive, and they start you off with good bread with a super yummy garlic oil dipping sauce!\n\nPrices are VERY reasonable for Fillmore -- $12ish for pasta, closer to $20 for the entrees.  \n\nI had the special of the day - porcini mushroom ravioli ($15), served in a gravy-like sauce with bits of asparagus and mushroom. It was SO good, I couldn't stop eating! I appreciated how the portion was sizable, unlike other Italian places were sometimes you just get one or two ravioli (sometimes I joke that it should be singular - just raviolus).  There were probably 7-8 large (maybe 2in x 2in) raviolis on my plate, and of course I ate it all (MOO!).  My coworkers had the special risotto of the day with prawns (also looked very good) and halibut special (served in a red sauce).\n\nOverall, it was a great meal, good service, and fairly reasonably priced for the area.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-01", "description": "A highly disappointing experience. It's been a while since I had eaten here and decided to take a friend from out of town for a nice dinner. IT was bustling to start with and we were shown seats right at the very back, inspite of making reservations. The place was chaotic and nobody showed up to take orders for a long time, while we sat sipping iced water.\n\nWe ordered stuffed mushrooms for starters which lacked flavor. My friend ordered the Prawn Risotto and I ordered the mushroom Ravioli with asparagus in white wine sauce (also on the specials). Frankly, it was horrible. The Ravioli seemd something made from the instant super-market packet and the white wine sauce was watery and thin. My friend's Risotto was dry and he felt he could make better Risotto himself.\n\nWe skipped dessert and ordered espressos. When the arrived, my friend who is a coffee connoisseur was aghast that they lacked the brown film (which I learnt is essential to good espresso). We sent it back and they came back with the \"real\" version.\n\nAll in all - major disappointment in every possible way. Wouldn't eat there if it were the last Italian place left in SF.", "author": "Kris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "This is such a cute little place.  Fun atmosphere, nice wine list, good food.  It could be a romantic date spot, but I think it's more of a good group or \"just friends\" place.  (Maybe it's lit just a tad too brightly for full on romance factor.)  All the staff are super friendly and they make you feel like they are there just for you.  (I've observed this interaction with the other tables too.)", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-22", "description": "Wow.  Could they use more processed, canned, and artificial ingredients in their entrees?  This is faux Italian food.  Good thing that the fine residents of Pacific Heights don't know the difference.\n\nWealth != taste and class", "author": "Mike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "This is a nice neighborhood restaurant that's been around for a few decades, so I really want to like it more than I did.  The service is friendly and good; the decor is pleasant, and their prices are very reasonable for the neighborhood.\n\nThe food, however, could be improved upon.  I am vegetarian and have tried most of their veggie pasta dishes, which tasted OK but are invariably too salty, creamy and/or oily.  In fact, recently I had their gnocchi all florentina, which had way too much cream sauce, as well as their fettucine alla norma, which was drowning in oil.  Both dishes were too salty as well.  I hope they would make their pasta dishes a bit more healthy, as I like the place and would like to visit more frequently.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-17", "description": "Food: Some items better then chain Italian but nothing amazing. Calimari, lasagna and fish of the day were cooked perfectly. The tomatoes in the caprese salad were flat and lifeless. Gnocchi undercooked.\n\nAmbiance: Just dropped in on a Friday night around 8pm and there was no wait. Decor is kind of funky and late 90's. Fairly crowded mix of people from a family with kids to young and older couples.\n\nService: Quick and efficent. They were good about refilling water and wine. \n\nPrice: About $2-3 too high for the quality of the food.\n\nOverall: If you're on upper Fillmore and looking for some Italian food, Via Veneto is worth a try.", "author": "Binh D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-08", "description": "Out of sheer desperation, we settled for Via Veneto - yes, it's our mistake for not making dinner reservations on the busiest weekend in SF but I can still complain lol...anyway, since this restaurant was not even on our radar for the night - I had no real expectations, but am writing this review for the sake of those who may....\nThe restaurant needs a major uplift - it's dull and lifeless.  With stiff competition from restaurants like Fresca and Troya around the corner, the least they can do is make the ambiance more inviting.  \nAs for the food, flavors weren't bad but was lacking that taste that you get when good fresh ingredients are used...\nWe tried the lamb shank - tasted fine but the meat didn't fall off the bone or melt in your mouth like it should...\nThe lobster ravioli was a major fail - the ravioli was still tough and the lobster seemed like it had been taken out of a freezer bag...\nThe Italian sausage risotto was fairly decent, but nothing spectacular\nI don't even care to mention about the appetizers (bruschetta, squid salad, caprese salad) as they were far from memorable....\n\nObviously, I won't be back.....", "author": "Bhavnak K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Best Italian I ever had. The family who owns it had incredible hospitality and genuinely cared about our dining experience and how we enjoyed the meal. Even brought us complimentary samples, definitely coming back and would recommend to anyone!", "author": "Patricia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-20", "description": "My wife and I have passed this place for several years in our neighborhood, but never felt the need to try it. It always looks kind of empty or dull to us. We did finally try it and though the service was just ok (waiter kept sticking his butt in my face she waited the table next to us) Other then that the service is ok I guess. The food is ok, when in a pinch and we don't ant to walk far. The owner is very nice and greats us with a smile. I would recommend it!", "author": "Kirk M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-25", "description": "There's tons of places to choose from along this area so Via Veneto has stiff competition. Their best dish is the gnocchi with a creamy gorgonzola sauce. It's comparable to Aldo's gnocchi dish, which is where we always compare every gnocchi dish to. The risotto and spaghetti marinara dishes were adequate but not very memorable.", "author": "Chi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "This place is delicious!!! Super savory and filling! I recommend the gnocchi with spinach it is the best gnocchi I've ever had! Definitely would recommend this place. It's so empty and quiet I don't understand why it isn't packed the food is so good!!", "author": "Brebre R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-18", "description": "This was supposed to be a fairly upscale Italian restaurant in a vibrant neighborhood of San Francisco.  I've had much, much better meals at Olive Garden restaurants.  The minestrone soup was colorful but very watery, the bread was stale and plain and almost impossible to break apart, and the gnocchi mediocre.  Noise level was close to unbearable.  But the worst part was the service.  Our server was friendly and ran around a lot, but he would only check in with us every 20 minutes.  He dropped off the dessert menu.  20 minutes later he came back.  We ordered.  Desserts arrived 20 minutes later (40 minutes after we got the dessert menus).  Then another 20 minutes to get our check, despite my frequent attempts to get his attention.  I didn't complain because I was dining with old friends and we were in a sparking conversation the whole night, but this restaurant was a big disappointment.", "author": "Dan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "Came here for a Saturday lunch with the hubby. It had a great atmosphere (we sat on the sunny back patio) and excellent service. It isn't the best or most unique Italian food in town, but it's good, solid food. I will say the mozzarella in the caprese salad and the feta in my main salad were both wonderful!", "author": "Katie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-01", "description": "Had to say it was pretty good, not the best Italian I've had but still good.  It wasn't too busy and we were attended to pretty quickly.  Sat outside in the patio and enjoyed the nice evening weather, only wished the patio was a tad more put together.  Putting chairs up randomly on top tables is not exactly classy.  \n\nI had the special of the night, a meat lasagna and my buddy and had the clam linguine.  Both dishes were great just wished they served were with more than just bread.  I think the lasagna was a tad bit salty for my taste. The wine recommendations though were on par.  \n\nI would recommend this place and might actually come back again.", "author": "Jubi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Went here for dessert. It was great. We had the gelato dusted with cocoa powder and the poached pear with ice cream. Both were delicious.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-29", "description": "I really like this place; It's a lot more quiet since its far away from all the busy streets in Union Square so its quite a cute little place to settle in to grab a bite to eat.\n\nIt's casual but good, so it's def. good for any occasion, even something quick or even for a good dinner.\n\nLots of pastas, the owner's a nice Italian guy... \n\nAnd of course, how to tell when places are authentic? You need to order a shot of espresso at the end. If it's like Tilly or Lavazza and very strong, you've come to a true Italian restaurant.\n\nRecs: the gorgonzola gnocchi (Gnocchi alla Fiorentina), carpaccio", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-13", "description": "On a Saturday night at 8pm, they're about 60% full.  Service was interesting as the waiters were very \"Italian\".  I loved the chatty, exaggerative atmosphere and they brought a vase with two roses to our table after being seated.  Portions were pretty generous.  My husband had the daily ravioli special (ravioli with lobster topped with asparagus and shrimp) which was decent.  I had the spaghetti with prawns and that prawn was so fresh I exclaimed 4 stars review considered how picky I am with my seafood.\n\nI spoke too soon.  Ordered the creme brulee and they just didn't heat it up (or torch it) enough.  We couldn't even crack the top.  The edges and bottom were quite cold.  \n\nIf I'm in the neighborhood again, I may revisit and avoid the dessert.", "author": "Yvonne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "I visited for the first time last Friday on a whim and I wasn't disappointed. In a restaurant where Italian restaurants are easy to come by, it's been difficult to impress my Italian boyfriend, but this place did. \n\nWe started off with wine & stuffed mushrooms. I was expecting a bit more spice, but the mushrooms were good, not great but good. \n\nI had the tortellini in tomato sauce with prosciutto & peas (delish!) and my boyfriend had the linguine dish spicy. He said it was the best he's had in the city and we've been to quite a few Italian restaurants! \n\nService was good...the waitstaff is friendly and helpful and really makes the place a lot of fun.  I must say there was a couple seated next to us that left before ordering, but you never know if it was the service or something else.  I do know that the owner did not look happy!  We found it to be a good experience and we'll be back.  There's also countertop service for those singletons looking for a place to dine.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "Went back for dinner this week, and I'm definitely bumping them up a star for outstanding service and food.\n\nTo start we had the bruschetta, which was simple- not like A16 bruschetta. But it suited me fine- the tomatoes were fresh and seasoned with sweet basil, served on well toasted bread. For a main, this time I got the linguini with seafood (fresh, steamed, mussels, squid, clams, and shrimp). It comes with a red herb sauce, but they gladly let me have it with a white wine sauce instead. The noodles were perfect- not al dente- and there was so much seafood! \n\nOur waiters were excellent, again. They turned off the air conditioning in the place when I suggested it was cold, and between dinner and our dessert drinks, they escorted us to a pleasant back patio when we told them we would just be stepping outside for a cigarette. As we were smoking, they even brought us our dessert drinks so we could enjoy them while hanging out back.\n\nThe patio is being renovated, and I can't wait until this summer warms up to go back and dine in the sun.\n\nFor the price point, the food is very good and the atmosphere is relaxing with great customer service. It's an excellent neighborhood discovery!", "author": "Raquel C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-17", "description": "There wasnt anything technically wrong  But It was overpriced for mediocre food! If the Olive Garden tastes better there is a problem lol", "author": "Lala N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "I recently had the Pasta Primavera here and it was just the best I ever tasted.  Fresh ingredients and tasteful preparation would describe every dish I have tried here. I was very happy with the service, food and ambiance.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "The quality of food was good, but it wasn't special. Service was so-so. But I'm not complaining. :)", "author": "Krisna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "I came here on a Friday night so I was expecting a long wait and was pleasantly surprised when the waitress offered us bruschetta and seats at the bar while we waited for a table.  The service here is terrific.  Also, the chianti wine and gnocchi with gorgonzola cheese and spinach were delicious.  I'm definitely coming here again.", "author": "M. N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-28", "description": "Came here once for lunch.\n\nDecor: nice\nService: friendly\nFood: I've only tried their salmon sandwich and it was tasty!", "author": "linh d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-30", "description": "We found this place by accident, but we were pleasantly surprised. The interior is cozy and contemporary.  My wife and I both ordered fish for lunch. Both meals featured very fresh ingredients, were well prepared and attractively presented. The service was excellent. And for San Francisco, it was reasonably priced.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "I had the ravioli of the day, lobster filled in a tomato and cream sauce. Heavenly!  One of my companions had the pasta with clams in white wine sauce and it was also very, very good. \n\nTook a little while to get the waiter's attention, but once we did he treated us like family. I'll be back!", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-22", "description": "In the neighborhood, I pass this place, like alllllll the time. \n\nI suggested it to my date, because it was slightly cheaper than V down the street. The food and service were 'a-ok.' Nothing special, nothing great. \n\nWe had the stuffed mushrooms to start--what were those? Not what I imagined.\n\nI had the risotto del giorno...came with prawns and tomatoes. I like my risotto more creamy than the way it was presented. He had the fettuccine with clams, equally unexciting. We skipped dessert. \n\nSo, I'm glad I finally tried this place, and now I know that I don't need to rush back anytime soon.", "author": "Misha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-02", "description": "I really enjoyed the pastas -- penne with Italian bacon and tomato sauce and the lobster ravioli was wonderful. The wine list however was disappointing. Overall it was a pleasant dining experience. I loved the atmosphere and the service was solid. Not a bad neighborhood Italian place.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-17", "description": "I agree with most of the reviews that talk about average food and not very fresh ingredients.  I gave a star for server, he was attentive and pleasant.  Another star for the soups which were comforting and yummy.  The lunch was nice with my mom (who is 80) and my daughter.  But the experience ended on a very sour note when my mom lost her jacket.  We thought we may have left it in the restaurant. The owner was very rude and insulting assuming my extra looking was suggesting his restaurant had stolen it.  I kept saying we thought it was last seen there and trying to retrace or steps.  I could not believe how angry he was with us when we were merely trying to think back and jog our memories'.  We won't return for many reasons now and we will tell all our friends.  Too many better choices and feeling like your treated respectfully and with care.", "author": "Cheryl G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-29", "description": "I should have known from the tasteless bruschetta they served us when we sat down. The linguine alle vongole was by far the worse I have ever had the misfortune of eating. The sauce was supposed to be white wine and herbs-simple enough but instead the pasta sat in a pool of olive oil,salt and water. Half of the clams had crushed shells which made me think they were forced open and not edible. Service was extremely slow. In a city filled to the brim with the best restaurants-this one misses the mark by thousands of miles. Never again.", "author": "Smiley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "A great experience! We wanted to watch a movie across the street and only had 45min. We told the waiter. He promised it would be ok and it was. Service was prompt and nice. But the most important: The food was great! My Gnocchi were just the way they would be in Italy. I loved it!", "author": "Bettina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-19", "description": "Friendly staff and great Italian food. I went there with a group of friends and we all enjoyed the food,ambiance and service was great!", "author": "Kajal P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "I went here with a group to have an informal meeting/dinner. We went on a Monday night so it wasn't crowded. I have to say the service was good, as was the food. The bread was fresh. I had one of the specials that night, ravioli stuffed with lobster meat. I wish it was hotter when it came to the table but it tasted quite good. \n\nOverall it was a good, solid meal, with perfect proportion sizes. Everyone at my table was happy with their meal. I'd definitely go back again.", "author": "Lori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "Have I mentioned my paralyzing anxiety that comes and goes without any warning? I haven't? Well, it's there. Unfortunately, the one and only time I was at Via Veneto (for...wait for it...boyfriend's mom's birthday...), I was seized with anxiety and in the throes of a panic attack for the duration of what ended up being about a three hour meal, including appetizers and dessert. If you're not well-versed in the specifics of social anxiety disorders, you may not know that when one is gripped with fear and anxiety for no apparent reason at all, one finds it hard to salivate, let alone eat. Your mouth more or less dries up, your tongue shrivels to the back of your throat, and even getting down the beloved Jesus Juice becomes more a chore than a joy. \n\nThat said, I still give Via Veneto 4 stars. I know it's been a Boyfriend Family favorite (or at least Frequent) for some time and the little food I was able to force down and keep in was quite good. In fact, writing this has me jonesing for a repeat visit. The service is gracious, the prices are very reasonable, and everything from the appetizers to entrees to desserts was well presented. I just love the frilly, girly low-lit interior (this is the antithesis of hip and your mother will love it). Wine list is decent and markups aren't over the top. For a restaurant on Fillmore, this place has a lot going for it. The chances that I will up my rating to 5 stars after I actually eat more here is good.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-25", "description": "From the first time we set foot inside Via Veneto - we felt like we'd been going for years. Massimo (the host & owner) always greeted us with a big smile. No matter how long it had been - he treated us like royalty.\n\nWe read a few reviews that this place had an \"old\" crowd ... what exactly does that mean? It's not hoping with loud music and drinking rowdies? Fine by me! \n\nWe definitely wouldn't describe the atmosphere as old ... more fresh and romantic. They have fun painting on the walls of birds & cherubs playing with pasta. The colors are light and airy. It's lovely.\n\nThere's also not the pretentiousness of many of the restaurants in that area. You can wear jeans and a tshirt and receive the same level of service as if you were in a tux. We actually went there every year we lived there for Valentines Day. And when we made our \"reservations\" early and Massimo forgot ... he made room for us even when they were overbooked. Gotta love that!\n\nThe food is amazing of course. It's not the BEST italian food in the world -- but it's definitely up there in the top 5. Being fish-eating vegetarians - we were always impressed with their fish of the day selection and their raviolis (esp the lobster). \n\nGood food ... good service ... BELLISSIMO!", "author": "Tabitha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-01", "description": "Food was good.  I got the ravioli of the day, a mushroom one with \"Italian bacon\" and tomatoes and a light cream sauce.  The calamari salad was fine, although there was some extra taste in the dressing that made it not so good.  Desserts looked good - at least one person said, \"this is really good ice cream.\"  And the half carafe of wine was pretty huge...three people had some, and there was still some left over.\n\nHowever, the service was slow, slow, SLOW.  \n\nAND, I asked for decaf coffee, yet I'm sitting here reviewing this place at 1:41am...coincidence?  I think not.", "author": "Kerrie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "Quite possibly the best Artichoke ravioli I have ever had in my life...and the Tiramisu was excellent!!", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "This is a great place. Cute inside and out. The staff are friendly and the atmosphere is calm and inviting. Food has been fantastic.", "author": "Molly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-09", "description": "Totally decent. \n\nA non-pretentious spot on Fillmore. Pasta dishes run around $11-13. Pasta is a good 'al dente', but the sauces (we tried the Gnocchi Florentine and Penne all' Amatriciana) left a little to be desired. Good, but just lacked that quality that made me want to eat more. \n\nI was happy to run across Via Veneto on a cold foggy day in the Fillmore, but I'm not sure I would go out of my way to get there again.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-18", "description": "There is nothing really special about this place. I can't say it was bad, but it was just kind of boring. It didn't help that the service was pretty slow, and not very streamlined. \n\nI don't know... I'm over paying inflated prices for mediocre Italian food by people who think they are better than I am. If I wanted that I'd just go have Persian food. At least those people speak my language.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-03", "description": "Bottom line - not very good. \nNot bad, but not good. \nGnocchi was NOT homemade, it was the same mushy, tasteless stuff you can buy at Safeway. And, it was overcooked with a bland sauce.\n\nI moved back to SF in April and living in Pacific Heights I have passed by Via Veneto several times. A few weeks back I walked in with my partner on a Saturday night at 9pm and was asked if I had reservations. It never occurred to me to make reservations at what seems like a neighborhood Italian joint, so we promptly left smirking and went to Jitlada for Thai. Last night we decided to try Via Veneto again since the bridge was closed for Labor Day and I figured they would be hurting for business. \n\nIt was empty. We were promptly seated by an unfriendly older waiter who spoke Italian to another older man. First thought - they're speaking Italian, this is going to be good.\n\nWrong. It was bland and unremarkable. The minestrone soup was decent, not great. The gnocchi was obviously not homemade and was over cooked. My little Italian grandmother made the world's best gnocchi, so I am something of a snob when it comes to this dish, but I expect it to be at least homemade and it should be firm, not mush. My partner had the mussels appetizer which was very fresh and the pasta puttanesca which was overly salty and a very small portion.\n\nHalf a carafe of wine for 12 dollars was a good deal, but I would not recommend this restaurant and will not go back. We should have gone to Jitlada again last night.", "author": "Marcia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-09", "description": "The minute you enter Via Veneto you feel like you have been transported to Italy. The environment is chatty, the staff is friendly and the food is simply delicious. \n\nThe first time I walked by the place, I just stop to practice my rusty italian with the owner. I didn't even eat there, just stopped to talk and my experience was so nice that the following week I went back to eat. \n\nA week later, I just stopped for a glass of wine with my Italian friends. It turned into appetizers and later into a full meal. Later I took my mom, an Italian food snob, and she loved it too.\n\nOpposite to most comments, my service has always been speedy, although I admit that they are not rushing it as they are more concerned about making you feel right at home.\n\nWhat to eat? The capresse salad and bruschetta are a good way to start.  The penne matriciana is amazing. The sword fish in a wine/lemon/caper sauce is to die for. The pasta with boar ragu is strong and tasty. But as Massimo pointed out, their specialty is the fish, so make sure to order one of the many seafood options.\n\nAs a tip, their house red wine is outstanding and you can order it by the half or full carafe. And yes, the pear dessert is as unforgettable as everybody says.\n\nIn conclusion, the service is like in Italy, if you demand it, you'll get it. The feeling is local, you will find a lot of regulars (me included) and the food is authentic and fairly price. If you are looking for a quiet place where to catch a bite before a movie, go somewhere else. But if you want authentic Italian food in a low key lively environment, you won't be disappointed at Via Veneto.", "author": "Gabriela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "There's no substitute for a friendly Italian owner.  He always goes out of his way to make sure every guest is having a superb time in his restaurant.  The food is great too. I've had something different every time I've been there and I've never been disappointed. \n\nAnd if you want to embarrass a birthday girl or boy, this is certainly the place to take him/her.  You'll have to go in and find out what happens for yourself, but just trust me on this.", "author": "Zoe K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-02", "description": "So its a Friday night and i'm feeling like some Indian food, and since i live in the Mission, my first thought is Dosa, and being that it is Friday the wait is an hour. I was willingly to wait the hour, i mean its valencia st and there are a millions things to do to past the time, but my friends thought otherwise. \n\nNow we had to decide what we wanted to eat, so we spent 20mins sitting in the car debating where we should go next. If we had put ourselves on the waiting list at Dosa we could have been 20mins closer to eating at Dosa!\n\nSo we decided to head to the fillmore/pacific heights area, we parked and began our walk up fillmore street. Everyone was hungry and indecisive so i made an executive decision, the first place i saw that i thought would be good, and then i saw this place, looked pretty nice, wasn't too crowded and but it wasn't dead, and the wait....was non-existent.\n\nMy thoughts at first were..hmm...thats funny the cook is winking his eye at me and blowing me a kiss...i should be flattered..strangely i don't think i was, but moving on.\n\nWe were seated at this table in a corner but i was nice, my friend, Nicole and i said we felt like we were in a buffet at a vegas hotel because of the paintings on the wall. The Waiter was cool, not great, the owner was much cooler. It did surprise me though that they didn't have garlic bread, but maybe that just an americanized idea of Italian, that they all should serve garlic bread. We did however get some wonderful french bread.......hmm...with garlic and oil...so i guess thats kind of Italian.\n\nAnyway we order our food i order the Chicken Marasala, with this very tasty spinach and i hate spinach,but i loved that spinach, could it be it was drenched in garlic..i love garlic...so anything drenched in garlic, is a winner for me. My friend whom ordered the same thing wasn't the biggest fan. My other friend wayne got some oysters or mussels , something that had shells and he was not impressed,so i don't know if i would recommend those. \n\nSo as we are eating and in a walks a very strange looking made in a black trench coat, and all the sudden, i feel like i did when i first walked in the cook blew me a kiss,and winked at me, that feeling very-uneasy.And thats when the owner walked up to the table and any uneasiness i felt disappeared! \n\nThe owner makes you feel as though you are right home with his family back in his native Italy. He greets us with a grand hello in his thick Italy accent and a huge smile, He joked with us and was so grateful that we are there. \n\nI thought the food was good, but not exceptional, the service was ok,and the wait for a check was pretty long, the desert wasn't very good. I'm big on customer service so when the owner themselves comes to your table to greet its always a plus. True i would have preferred Dosa but i'm glad i checked this place out, i can't say  i'll be very soon, but i can say i will return at some point if i'm in that neighborhood.\n\nI'll just hope the cook doesn't recognize me, if and when i do return. There is just something about the cook blowing a kiss and winking at you that makes you feel like you are at a cafe in the middle of nowhere, in one of those campy b-movies where the teenagers get stranded.", "author": "Nia W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-04", "description": "It's never a good sign when you spend most of your time chuckling in an incredulous fashion.  We were seated, but then it took about 10 minutes for anyone to notice us.  Odd, since the place was only about a quarter full and there were two waiters who were just wandering around the restaurant, doing nothing at all.  After we finally got seated, I noticed that pretty much everyone in the place was drunk, including some of the staff! Solo patrons downing a bottle of wine each, a drunk woman going in and out of the restaurant with a full, then less full wine glass and then conversing loudly with those seated near her.  The owner seemed kinda sauced as well, amusing.  Between ordering and receiving appetizers, the staffer who seated us asked if we'd like dessert menus.. haha...what?  \n\nI'm not a restauranteur, but I don't think that spaghetti + 4 shrimp + a little olive oil, black pepper, and rosemary should cost 15 bucks unless it's amazing.  And this dish was among the most amateur looking and tasting items I've ever had in any restaurant.  Pile o'bland, oily noodles, 4 overcooked shrimp, room temperature.  My girlfriend's chicken was pretty sub-par as well, and the vegetables accompanying the dish were a joke straight out of your grocer's frozen foods aisle.  Decided to spare them of any more of my money, got the hell out at that point.  If cousin Tony from Italy visits, I'd rather take him to the Olive Garden.  Che peccato!", "author": "Karthi X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-06", "description": "Via Veneto has been here for years; It doesn't have the buzz of SPQR, the foodie street cred of Vivande or the cult status of Jackson Fillmore. It doesn't have the hippest, coolest decor.\n\nWhat Via Veneto DOES have is consistently good food in the Northern Italian vein. Great appetizers (including a yummy fried calamari), delicious pastas and secondi. The desserts are especially good -- profiteroles, poached pears with ice cream and fruit sauce.\n\nLast time I ate here, it was a Friday night impromptu dinner for five. We got in easily when there was at least an hour wait at the restaurants noted above. I'm glad we didn't get into the other ones. We had a long, leisurely dinner with two bottles of wine, and almost closed the place down. No pressure to get up so they can turn a table.", "author": "Gary B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "I had a very romantic and tasty dinner at Via Veneto the other night. I had tried to get in over at SPQR, but was not prepared to wait an hour and a half, so off we went looking for a place to eat. We walked in and were quickly greeted and shown to a table in the front. The place is pretty small, so the tables are close, but everyone around us appeared to be having a great dinner.\nWe started with the spinach salad and it was great. We ordered one to share, and two huge plates came to our table. The wine list was also very nice and reasonable. For dinner, I had the Chicken Marsala and my husband had the veal. Both were excellent and I was very happy with both the price and the portion. We did not have room for dessert this time, but I will be back!!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-04", "description": "Shockingly bad food.  The minestrone soup was undercooked and no aromatics were used in the prep. Watery Tomato  base and an over abundance of carrots thrown in for color made for a sharp acid base overlaid with a cloying sweetness-got to wonder how this place stays in business. Surprising that such a mediocre (at best) restaurant  could survive in such an upscale neighborhood-Alas,  all that money and no taste. I ordered the  scaloppini (another Italian classic) but their version swam in a thick greasy gravy that was sharpened  by caper brine.\nThe coffee was so bad as to be undrinkable.", "author": "Ann P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-01", "description": "I work right up the street and I used to eat here at least once a week. It got rather boring until they open up the patio in the Summer months. The menu could use a revision. There is not too much on it besides pasta. Where is the scallopini or piccata?\n\nThe staff is attentive and sometimes gives you a few Bruschettas on the house. \n\nIt is still cold out so I think it will be a few months until I return to Via Veneto.", "author": "Jeannine V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "My favorite Italian place by my house. Every time I ate there,  I had to be rolled out. The owner is always warm, welcoming and hooks us up with free bruschetta. The best appetizer is the eggplant with mozzarella. All my friends who have been fortunate to dine with me here have loved it. We also enjoyed the carpaccio. The Cesar salad portion is huge and  could be shared by two to three people.\n\nMy favorite pasta dish is the linguine with clams. I don't recall the names of the other dishes my friends have had, but they were all very good.Last time we were there, the special ravioli was raved by the customers sitting at the bar. We usually get great recommendations on wine pairings with our pasta and my friend visiting from NY loved one so much, she wrote it down to purchase. At the end of our meal, we were served a shot of limoncello. It tasted like lemon vodka.\n\nOverall, this is my \"IT\" place if I am too lazy to travel for Italian. On a warm day, you can sit in the back patio, drink wine, and relax with your friends. It's laid back, the service is great, and the food is excellent.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "Went here on a fluke with a couple of girlfriends.  The waiters were very welcoming when we walked in.  We decided to split a few dishes since we couldn't make up our minds.  \n\nTo start we had the caprese and another type of tomato salad.  The caprese salad was a little bland but the other salad was excellent. They even brought it out on individual plates already split for us. \n\nEntree wise we had the gnocchi with the cream sauce which was really tasty and we also shared the prawn spaghetti which was good and loaded with garlic.   \n\nThey were even so kind when my friend knocked over her water glass.   Nothing that they couldn't throw a little salt on....which was interesting.\n\nNot an extensive wine list, but there were some decent choices.  It was a good experience, and good food.  I would go back again!", "author": "Shelley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-25", "description": "I have always liked this spot since moving to Pac Heights and have been a few times.  My favorite is definitely the gnocchi alla sorrentina.. it is baked with a tasty tomato sauce.  They had a sea bass special last week which was amazingly juicy.  Don't you think that I didn't have the chocolate gelato last visit because that would just be silly.  It is good, but nothing close to the gelato found in Italia.. I don't know what it is.. the cream.. the water.. the feeling I get in Italy.. just not the same.", "author": "Gregg K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "Love this place. I've eaten there four times and each time had delicious food and exceptional service.  A little upscale without any sticker shock - beats a two-bus dinner in north beach easily.", "author": "Jwl s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-28", "description": "I enjoy coming to this place for its ambiance and savory food.  Every dish I have ordered here has tasted superb, and the servers are all affable.  It hosts an intimate setting and there is rarely a wait.   If you're looking for a pleasant place to dine, with authentic food and without a crowd and exorbitant prices, visit Via Veneto.  \n\nDivertiti!", "author": "Alexa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "After living in Pacific Heights for 7 years we finally were able to get a table after seeing a movie.  \n\nIt is a nice place.  The hostess was very engaging.  The waiter was attentive.  We enjoyed the ambiance.  \n\nThe food was quite good.  Loved the garlic and olive oil mix that came with the bread.  The veal marsala was different than I have ever had but quite tasty.  The fish was delicious according to my husband.  \n\nDefinitely worth a try.  Most of the time you will need reservations.", "author": "Karen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "After seeing \"Black Swan\" Saturday evening at the Kabuki, my husband and I thought we'd hang around Fillmore for a meal instead of heading to a favorite spot. We walked up Fillmore and all the usual places were packed---Delfina Pizza, SPQR--even the lesser places too. We're not 25 anymore so we wanted less of a scene. On we walked until hitting Via Veneto. Yeah, it looked a little cheesy from the street but we tried it anyway. Nice Caeser salad, very good Pinot Noir ofr $8 and my mushroom ravioli with asparagus and other veggies was good too. Was it the best pasta I've ever eaten? No. But I hate going to places where you feel totally ripped off by high prices or disappointed that the meal was not at all adequate. This was a very comfortable place to be, the other customers seemed quite happy too, and some I noticed were regulars.", "author": "M F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-22", "description": "I must add that Massimo's minestrone is a lifesaver if you're feeling under the weather like the rest of SF'ers.  Come here for speedy recovery and excellent convo w/my man Massimo.\n=====================================================\nI've been eating here since I was 12.   Every time I go to Via Veneto I feel like I'm home.  Massimo is my man....I call and within 10 minutes take-out for 10 is ready.\n\nI am not a big dessert person...in fact I hate chocolate....but I love the poached pear!  I cannot put in words how incredible it is.  The balance of the pear poached in cinnamon, filled with mascarpone (okay it may be whipped cream) and raspberry coulee (how do you spell that?) is perfection.\n\nI always start with the insalata via veneto, which is like a light Greek salad, and follow with chicken milanese or veal picata.  \n\nThe food is consistently good.  Having eaten here over a hundred times I can vouch for this.  Don't come here expecting a Michelin experience, but take it for what it is...a good neighborhood restaurant.  Oh yeah, and it's right across the street from the Clay Street theater.", "author": "debbie h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "I've been here a couple times now. The food's pretty good, and they have a decent wine selection. The house wine is pretty good too.\n\nStandard-issue caprese -- nothing to write home about. I've tried the gnocchi in white sauce -- creamy and pretty filling; porcini mushroom ravioli (I think it was a special?); one of my friends tried the chicken in marsala sauce. End with some tiramisu and some coffee. Good.\n\nEveryone enjoyed their meals.\n\nNothing really stands out, but I still like this place. I'd go back again. Helps that Massimo is quite the Italian host.", "author": "Premshree P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "I love Via Veneto! This restaurant looks beautiful both inside and outside. I can feel Italian atmosphere. Also, I love customer services here. The food is nice too.", "author": "Palmy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-31", "description": "My parents were visiting a couple of weeks ago and we were in pacific heights hoping to get a last minute table at Fresca.  After being told we couldn't get in until 10 there, we were literally picked off the street by the manager of Via Vento.  I took this as a bad sign, but my dad was starving so we decided to give it a go.  \n\nIf i had to describe this place in a word, I'd go with bland.  I was not impressed by the decor (far too white and bright).  The food was all okay, but not great or even really good.  There were 5 of us so we ordered a variety of dishes but almost everything tasted like we could have thrown it together ourselves for a fraction of the cost.  My boyfriend's alfredo was worse that most grocery store jar pasta sauce I've had.  \n\nWould I tell people to avoid it?  Probably not.  But for the cost I'd say there are probably 100 better places to eat in the city.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "I love this place... \nThe food is excellent! the prices are high, but it is worthy. \nAlso, really nice place. I felt comfortable inside (I usually do not like fancy places). \nThe service was also good.", "author": "jaime b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-20", "description": "Service: very friendly and attentive\nDecor: a little strange but ok.\nFood: completely unmemorable.  Not bad at all, but I really do not remember what I ate.  I do remember thinking it was average as I ate it.  I guess if you live in the neighborhood and really don't feel like cooking this may be the mid-week place for you.  Another one of our neighborhood restaurants that is sadly under-whelming.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-02", "description": "Ate here after the Jazz Festival, I thought it was a cute little place, very sunny and nice atmosphere. The service was prompt, but I wouldn't say particularly friendly. My husband and I are a little younger and were dressed fairly casually plus we didn't feel like an appetizer or wine so that might have added to the lack of loquaciousness (alliteration is fun).\n\nThe food was okay. It was definitely not bad, but it could have been better. However, the prices were really good so I would probably come back for the atmosphere.", "author": "Katy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "A girlfriend & I had dinner last week at Via Veneto.  It is great to see this restaurant still around in the Fillmore District, especially since the rest of the area has become so expensive. Food, atmosphere & service is still excellent!  Big plus still reasonably priced for the amount, quality of food you receive. The hostess greeted us right away.  The server came with very nice focaccia w/balsamic & vinegar dip. We both had the grilled chicken breast which consisted of 2 perfectly done breasts on top of sautéed spinach, & with roasted potatoes. For dessert we ordered 2 wonderful cream desserts:  One was a chocolate ball that consisted of a layer of chocolate cream & gelato that had a sponge cake center, surrounded by a dark chocolate sauce & sliced strawberries.  The second was a wedge of vanilla gelato that had candied fruit &  chocolate bits in it, coated with dark chocolate, & a layer of vanilla cream also surrounded by the dark chocolate & strawberries.  We look forward to going again; only next time in warm weather so we can enjoy the beautiful outdoor patio.", "author": "Pam R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-20", "description": "We stopped into Via Veneto on a Monday night (perhaps not the wisest choice as that can often be the head chef's night off).  The restaurant is bathed in white and is very appealing both from the street and once you enter.  The menu is pretty standard italian fare and our dishes weren't very good.  Ron had a tortellini dish where the sauce was wayyyyyy too heavy, bordering on dry and the who things was pretty flavorless too.  Liz's pasta dish was bland and uneventful.  Staff seemed a bit disconnected and only really warmed up when it was time to take the check.  The fact that this really seems to be a neighborhood restaurant may explain some of the disconnection, but that said, it's still important to turn out a good product and Via Veneto just missed on all counts.  The best thing we had were the biscotti served with our check.\nBummer.   -Ron & Liz", "author": "Ron T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "The flavors are right on. They have one of my top 5 appetizers ever- the eggplant mozzarella! \n\nService is slow, yet I would say tryyyyy it.", "author": "Lee M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-29", "description": "I've been here three times and each time I've been very happy with my food. \n\n My boyfriend and I randomly went last night as we were in the area and I was craving pasta with tomato sauce.  I don't remember the name of what I had, but it was fettuccine with tomato sauce, eggplant and ricotta salata.  It was exactly the flavor I was craving and I was totally satiated.  \n\nMy boyfriend ordered the meat ravioli with tomato cream sauce, ham and peas.  He loved it and so did it.  Think: Pasta wrapped in bacon.  It's a beautiful thing. \n\nWe both ordered a really good pinot by the glass, but then lamented the fact that we didn't get a bottle, since we drank many glasses of it.\nI read other reviews that said the service wasn't good.  All the times that I've been the service has been impeccable.  The bus boys, the server even the owner came by to check on us. \n\nThe Clay Theater is across the street, so it seems like a good place for dinner and movie.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "My first meal in SF in several years was at this restaurant with my good friend a couple weekends ago.  It's rather small and intimate, but you don't really notice so much.  \n\nYes, the place is romantical, but it was also a little noisy, which I like because it gives me carte blanch to raise my voice.  I had the veal, which was delish and well-proportioned to my hunger.", "author": "Khurram N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "i'm bumping up one star!  was here for a friend's bday dinner.  they actually stopped the music for the entire restaurant to play a festive happy birthday song as they brought out a candle and dessert for my friend.  \n\nwe all felt very special at that moment  :)", "author": "Sammi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-04", "description": "They start you off with a complimentary bruschetta topped with a garlicky onion tomato basil mixture on a slightly grilled round of bread..I think it was the best part of the meal. Nice and not very memorable salad. Very good bread  on the table with delicious fruity olive oil for dipping. OK ravioli stuffed with porcini mushrooms. I took most of it home and enjoyed it more the next day. Enjoyed the glass of verdicchio. Nice host.", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-16", "description": "Massimo is a fun host.   He's a character, very italian, very gracious.  Relax and enjoy your stay.  He raised his voice at some rude, arrogant customer's which was very much in character.  Service isn't quick, but it's kind of like being in Italy.\n\nGood food and wine.", "author": "Berne F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "True Italian. The food has always been amazing and it's been my best friend's and my \"default\" restaurant for over a year now. My girlfriend is really picky and they are always very sweet in accommodating her requests and always get it right. I highly recommend the carpaccio, the brusectta and all of their pastas. This is the place to go if you want a nice long dining experience the Italian way. If you're not a diner and you're trying eat and leave relatively quickly then this is not the place for you. I am not a diner myself but I found it very relaxing and enjoyable to embrace the Italian dining experience.", "author": "D K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-18", "description": "For a place that *should* reek of authenticity, \"V-squared\" really disappointed me. A buddy of mine thinks it is the greatest place ever, but I was really underwhelmed -- not only with my entree but also by the painfully slow service. It's not like the restaurant was crowded or anything, so I still can't figure out why that old cat who reminds me of Geppetto couldn't be more attentive. I might give them another try someday, but it's probably gonna take some serious 'Eye-talian' coaxing.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "This is a good overall Italian Restaurant.  The ambiance was a bit bright, but I looked at the plates of food on tables and it looked great.  The food was very good, and the portions just right.  The prices were also very good.  If I lived here, I'd come back.  It's on a nice part of Fillmore, easy to get to and a nice overall experience.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-28", "description": "I loved this place.  We were almost not going to go but there really isn't anything around Fillmore so we checked this place out (thankfully so).  The owner was very cool in fitting us in san reservation.  Service was excellent and our dishes were great.  I would definitely go back.", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "Really cute little neighborhood spot.  They had a lot of options on the menu that were very reasonably priced.  I ordered a pasta and my boyfriend ordered the risotto of the day -- both were very good and filled with lots of seafood.  Am also a big fan of the house montepulciano -- a half carafe is only $12 -- great deal!", "author": "Mitzi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "I have been going to Via Veneto (emphasis on FIRST syllable, not middle one) for many years. I continue to be impressed and satisfied with the class, quality and service of this restaurant. The owner/main waiter/sometimes bartender moves quickly through the ample dining room and bar, and the other person at the bar helps on the floor when needed. The food is wonderful. Last night, I had the special-salmon and halibut, with mixed vegetables and potatoes. The fish was poached and so tender and perfectly cooked. Although I've had the tiramisu on other occasions there, I passed on dessert this time around as I was contentedly full. My partner requested a dish not on the menu, which was a sort of variation of a dish on the menu. The owner/waiter was happy to accomodate, which is unusual in restaurants. I had a couple of glasses of wonderful Italian Barbera with my dinner, and my partner had the Chianti, both very nice representatives of the varietals they are made from. All in all, a fantastic experience which I am recommending to you for your pleasure. Located up on Fillmore Street across from the Clay Theatre, it's easy to get to as well.", "author": "daniel k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-08", "description": "3.5 stars, actually.  Food was pretty good.  I thoroughly enjoyed my tortellini.  The stuffed mushroom appetizer kind of had an odd flavor to it.  I was expecting a more garlic-butter flavor.  My chocolate gelato was HUGE and it was delicious!  The atmosphere is pleasant, and the owner was really warm and gracious.", "author": "Eileen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-13", "description": "I've been back to this place a few more times since my last review and I would like to bump them up to 4 stars because every time we've been there the food has been quite good but I just can't seem to bring myself to because the thing is...which is very off-putting to me...the waiter (same one every time) is so obviously inattentive to us and I'm not sure why! We're nice people! We're not hideous to look at! Yes, we have come in the company of an older person who uses a walker every time we've been there and no, we don't drink a lot of alcoholic beverages but hey, it's lunch hour and the place isn't exactly hopping... I recommend to the owner or manager to talk to his staff to learn some simple manners and that will take him and his business a long way!", "author": "Mimi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "Great neighborhood joint. We've been going for years. Good place to feed your craving for some hearty italian food. My faves are the seafood pastas - all tasty. The meat dishes are full of flavor and usually cooked to perfection - try the veal picatta or pork chop special.\nThe service is friendly and accommodating, with a personal touch if you're a regular.\nLove the wine suggestions from the owner.", "author": "Kimmie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-01", "description": "Picture this - a warm, sunny back patio, coffee, omelet and marscapone-stuffed french toast.  I spent Sunday brunch on the tiny but pretty back patio at Via and had a wonderful time.  We arrived right as it opened, so things were a bit chaotic (no menus, had to ask for napkins), but the waiter and owner were both so warm and friendly it wasn't a big deal.  As mentioned by other reviewers, the owner takes a personal interest in your comfort and satisfaction.  The coffee was good, the food was nice (if a bit bland - my omelet needed salt) and the service was the best.  The price was nice, too, with our party averaging $12-13 for entree and coffee.  There's no people watching, but if you want a nice meal in relaxing (i.e. you don't have to shout to your seatmates) surroundings, try Via next Sunday.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-07", "description": "When my husband and I lived in Pac Heights, it took us a while to go to Via Veneto.  It always looked fancy, and we rarely saw young people dining.  I'm so glad we tried it one night. It's our favorite Italian restaurant now.  The staff is so friendly, we rarely have to wait for a table, and the food couldn't be better.  Some of our favorites are: Scallopini Saltimbocca, Tortellini, Gnocchi (cream sauce), and Torta di Gelato al Cafe (coffee cheesecake).  I'm getting hungry just thinking about it.  This is some serious comfort food.  Nothing like a great neighborhood restaurant.", "author": "angela t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-29", "description": "We were hoping to find a neighborhood haunt but were disappointed by the mediocre food. Service was adequate, slow to start but definitely more attentive towards the end. Unfortunately, it could not make up for the food. 2 stars only for the beef carpaccio and piping hot linguine pescadore. They got the temperature right on the pasta but the seafood was lackluster,  mussels tasted kinda bad so I  was too afraid to finish them.  Calamari was chewy and and consisted of only the 'rings'--i.e. frozen disaster. My search for great neighborhood Italian goes on...", "author": "Linda Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-25", "description": "After reading all the reviews, had high hopes. Ambience was nice and the service was excellent. Our waiter was very helpful and let us all 3 of us taste multiple wines before ordering a bottle.\n\nThe entrees, unfortunately, were not impressive. My friend's penne was *extremely* salty. My grilled salmon was totally bland, served with zero seasoning and some veggies / potatoes... and my gf's lobster ravioli was OK.\n\nDespite the below average entrees, we decided to gamble on dessert. I'm glad we did. The crepe with vanilla ice cream and espresso sauce was great as was the Tiramisu.\n\nReally wanted to like this place, but the entrees were just not up to par. Despite that, I think I'd actually give this place another chance... I'm hoping that we just had bad luck on our choices. We'll see.", "author": "Nithin R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-16", "description": "The food is consistent here, but nothing that blew my mind so that I would even remember what I ate.  It is nice inside if you get a window seat, but I find the atmosphere very bland.  Also, the tables are so tightly packed you can hear all the conversations around you- and they can hear yours.  This isn't too big a deal, unless your companion is having some issues and starts repeating the same conversation like 6 times.  For serious, I was wondering if the lady was on medication.", "author": "CAKE E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-26", "description": "Very good Italian and reasonably priced.  Jared was pretty much spot on with his review.  The owner/manager definitely takes a hands-on approach to making sure everyone is happy - he could be seen pacing all over the restaurant with a watchful eye.  I had a linguine w/seafood dish which was excellent.  My friend had calamari in a rich tomato sauce and that was very good as well.  The bruschetta was well done...I hate oily or too-garlicy bruschetta and this was just right.  We were there early in the evening so it was pretty empty but I have seen the place fill up.  The atmosphere was great.  A good place to take a gf or parents when you want to have a nice but not expensive dinner.  I have to give 5 stars because of the value.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-12", "description": "When we moved to Pac Heights we stumbled on Via Veneto quickly and we instantly knew this would be our new go-to dinner spot. The ambiance is light and sunny and very very friendly. The owner and wait-staff remember everyone in the neighborhood and they are always excited to see you and joke around with you. The food is amazing and the pasta always tastes incredibly fresh and well made. I have never been disappointed.", "author": "Meg M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-01", "description": "There's a reason Via Veneto is relatively empty around dinner time on Saturday nights. The prices are decent for Fillmore Street, but I've had much better food and the service is painful. It's one thing to allow conversation and flow, but it's another for me to have to stare you down for 20 minutes in order to get something ordered when there are only 4 other groups in the restaurant.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "We came here one night with a group, we were all hungry. I can remember it taking a while for our table to get ready but then came the food and all was forgotten. This is such a delicious place. If you like authentic Italian food, you'll like this place!", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "You know, I saw one reviewer say service at Via Veneto is painfully slow.  I would have to disagree because I've been at this restaurant three times, including last night.  I find the service pretty good, even during busy times.   \n\nI've had Gnocchi before and it's seriously tasty with the melted cheese that comes with it.  Also, you should save enough room for dessert and try the strawberry ice cream cheesecake with white chocolate.  I  don't remember how it's labeled on the menu but you will see it and it's to die for.  I don't recall ever having a more interesting dessert in a long time.  Just the thought of combining ice cream and cheesecake.  That's delicious.  :)\n\nI will admit Via Veneto does have a typically older crowd so it may not be the most hip and romantic place in the world but it's well-organized, at a nice location and has pretty good food.", "author": "M B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-07", "description": "Via veneto was sloppy seconds.  We originally wanted to go to the Fillmore Grill, but apparently it's now closed.  So, Via Veneto it was.  Italian food is always good, right?  Wrong.  They burned the garlic in my friend's dinner and it tasted gross.  My salmon risotto made me sick.  The service was so so.  All in all it was a disappointing meal.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "We are new in town and we are looking for good places to eat. We read the reviews in yelp and we were not dissapointed. The food was excellent and the service was good too. This place was what we were looking for. A small, quiet place were we could feel almost at home. The prices was also right. We willbe back!!", "author": "Sandra F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-03", "description": "Came here for lunch with a group of friends. I got the gnocchi Florentine. It was really good. Good potions too. The waiter was really nice but a little on the slow side. All the other dishes looked really delicious too.. Can't wait to go back to try them.", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "I've been here twice.  Once for lunch and once for dinner.  By chance, I took my wife here for her birthday dinner.  We like Via Veneto and will be back again.  The food is good to very good, the service is fast and very friendly, the prices reasonable.  If you're looking for an above average Italian restaurant, give Via Veneto a try.  You'll be glad you did.", "author": "Brad P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-28", "description": "Ok, this is more of a 3.7 review so I rounded up. The food was very good- my gnocchi was excellent, and my Italian grandmother was famous for her's so I'm picky.  Large portions and a reasonably priced wine list. The service was very slow, but the management handled it well- free brushchetta and port. I was definitely a happy camper.", "author": "Noelle Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "First time at Via Veneto although I've wondered about it and walked past it for years.  I had a really lovely evening. The service was relaxed and friendly.  The food was very good (I had fettuccini alfredo and my partner had gnocchi.)  About half way through our meal a fellow picked up a guitar and started belting out Italian songs in the front of the house.  That was fun, though I'm glad I was in the back where I could still carry on a conversation. We had plenty of time on our hands and stayed for dessert (tiramisu) which was lovely.  I'm looking forward to my next visit.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-01", "description": "My mom and I popped in this place while walking on Fillmore last night. I am super picky about my Italian so I will say it was good, but nothing special. You will find your typically antipasti (caldi and freddi), bread was average, but the service was great. Wine list needs some work particularly by the glass section. Gnocchi was decent and didn't get a chance to try dessert. Expect good but not extraordinary food.", "author": "Theresa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "The prosciutto sandwich here was outstanding served with an ok side of salad.  Seems with the mediocre reviews here that the sandwich is a good option.  Also, a good price at right under $10.  I would go back just for the sandwich alone.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-26", "description": "Great food, good wine.  And a nice atmosphere, and the regulars give it a nice community vibe.  My friend and I shared some risotte and gnocchi, with some anti-pasti.  It was all excellent, although the gnocchi was a tad chewy.  The wine was excellent.  I tend to lean towards French wine, but having the Italian house wine was a nice touch.", "author": "masa s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-16", "description": "This is my favorite Italian restaurant in my old neighborhood. Consistently great pasta (I typically get gnocchi) and the owners seem to know a lot of the (older) neighbors who come in so there's always a homey feel when I come here. They also have fabulous lemon cello so that's a must-have as your after-dinner drink. But I must confess the the real reason I come here is for their profiteroles...so rich, decadent and yums! I know - lemons and chocolate don't mix...but I make it work! :p", "author": "Nina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-10", "description": "It's almost impossible to find a place to grab a bite on Fillmore after 9:00 on a a Sunday night. We showed up around 9:45 and even though they were scheduled to close just a few minutes later, they were very accomodating. \n\nSkip the dry bread and save the carbs for the pasta. I was debating between the prawns and the spaghetti with prawns. The waiter suggested the latter and I took his advice, which turned out to be a mistake. It was inedibly boring and only had 4 shrimp, but the other people in my dinner party made better choices. Both the fettucine with eggplant and the gnocchi were delicious.", "author": "Cher E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-30", "description": "I was surprised to see the relatively low prices on the menu outside the door given that Via Veneto looks like a pretty upscale place. Well, let's just say you pay for what you get. I'd even say we overpaid for what we got - the food just wasn't that good - pretty bland and nothing very interesting in terms of ingredients or preparation. Probably won't go back.", "author": "Sydney L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-01", "description": "Good food, nice wine choice, will for sure be back.", "author": "Laurie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-30", "description": "not the best italian ever. Nice names, but not so tasty.", "author": "armelle p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-18", "description": "Several neighbors raved about Via, so my friend and I decided to give it a try one night (we live a block away.) Their speciality is a rendition of Venetian cuisine that's a little different than your typical Italian place. They have several veal, chicken, and seafood choices - but no beef, pork, game, etc.\nThe attitude of the hostess was snobby - but we're kind of used to this living in Pacific Heights.\nWe kept hearing about what a great value Via is. Well, that is all relative. Yes, it's reasonable for the neighborhood. However, it's not especially cheap for Italian. The appetizers are in the $10 range, pastas run about $15-$17, entrees around $20.\nI had the clam and mussel appetizer in a simple white wine butter sauce. Excellent - some of the best I've had in SF. My friend had the Carpaccio and it was a HUGE disappointment. Yes, it's hard to imagine bad Carpaccio - but this tasted like it was shaved right off a frozen piece of beef. It had a disagreeable icy texture and bland flavor that really ruined what is usually a treat.\nThe pastas were very decent. They use a lot of garlic, which I don't consider a negative. I had a spaghetti with chopped , shrimp, and garlic in an olive oil sauce. My friend had the pasta with pancetta and ham in a tomato sauce. Both were flavorful and thankfully cooked perfectly al dente. The portions were sufficient, but on the smallish side for Italian. Without the appetizers we may have gone away hungry, which should never be the case in an Italian place! And especially at $15+ for pasta.The service was a bit rushed but acceptable. The decor seems like it was trying a little to hard to be \"playful\" and verged almost on tacky. The place was way too bright! The halogen lights made me feel like I was eating in a department store. The small space on Fillmore calls out for candles. Overall it was OK, but I wouldn't make a special trip if I didn't live in the neighborhood. The clam mussel appetizer and glass of wine would make a decent lunch", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-11", "description": "Just ate there for the first time and am looking forward to the next time.  Excellent food and wine.  The lobster ravioli with crab meat sauce was amazing.  Very large portions, reasonable prices.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-23", "description": "Whenever I am in the city I always head for Via Veneto ~ Massimo greets you like family with a ready smile, and will accomodate your every wish. I have tried many things on the menu but I am always drawn toward their veal, no matter how it is prepared it is consistently delicious.", "author": "Trip C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-31", "description": "First and foremost, the service was outstanding.  The maitre'd offered us some bruschetta while waiting for our table and kept us constantly informed of our table's status.  The specials of the day were delicious, and the prices were pretty reasonable.  The staff was very friendly, professional, and knowledgeable.  They made the extra effort to connect with the customer.", "author": "Aggie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-01", "description": "I really really like the fettucine alfredo here, hence the 4 star rating for that alone.  Others i have dined with have enjoyed their dishes as well. Its a very charming and quaint italian place, service is good.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "I've been going to Via Veneto for about ten years now and even worked as the hostess for about two and a half years.  It has been my restaurant of choice for every big birthday and graduation celebration as well as the more low-key evenings when I just want great food for a reasonable price.  The owner and staff are all very friendly and the food is incredible.  Whenever I'm in the mood for great italian food in a comfortable and inviting setting, Via is always my first choice!", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "Food is tasty, service is comfortable, never rushed, easy to drop-in for a casual dinner that is consistently very good.", "author": "Howard R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-17", "description": "pretty fantastic service, especially when it's less crowded (or you're the only younger customers)\n\nthe owner goes around and meets everyone, sometimes treats you a little, makes sure everyone's happy. very warm and cozy place :) very kind of old school, traditional italian\n\nthe food's pretty good too, but to be honest, we were so happy with the service, it didn't matter.", "author": "M M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-02", "description": "I've been there twice-the first time it was decent.  Decent service, decent food, decent atmosphere.  That's why I give 2 stars.  But this last time it was absolutely awful-the place was clearly understaffed and the waiters rushing around in a panic ruined the atmosphere.  The service was horrendous.  We had to ask to order wine, ask to order an appetizer, and ask to order dinner-and we definitely waited a good 15 minutes in between each-we weren't in any rush.  The waiter i assume was one of the owners, since he stopped to give a pat on the back to each \"regular\" and offered everyone around us free limoncello at the end of their meals...except us.  Also, they never once refilled our water or our wine glasses.\n\nThe food was ok.  The bread wasn't warm.  The lobster ravioli seemed mushy-like a tuna fish consistency inside.  The linguine with seafood was completely average...and came with a stomachache.  The spinach salad was good, not the best I've had, but it was good.  Needless to say, we won't be going back.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-29", "description": "My sister and I decided on a whim to go here since we were starving after shopping on Fillmore. It looked nice and clean and the menu looked decent. I had some kind of chicken breast that was very dry, I couldn't finish it (don't remember what sis had, but she liked it more than mine). Also, service was insanely slow, and it wasn't even a busy night.  Won't be returning here.", "author": "Heather I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-12", "description": "Wow - I'm surprised I'm the first on this.  Via Veneto looks like most Fillmore digs, kinda snobby, full of fillmore crowd, and done up for people who like to look good but know nothing about food - it turns out that it's NOTHING like that at all.  Wear jeans and a polo or some T because you'll want to be comfy.  Everyone there is so nice and friendly and EVERYONE is local.  The food is good and the owner works almost every night to ensure quality control.  We went on a saturday night and only had to wait 15 minutes - they gave us complimentary bruschetta for our wait, and during the wait, we struck up conversation with those waiting with us.  After sitting, we were welcomed into two other tables conversations as all parties looked at each other's plates with envy and commented.  I sort of felt like I went with a group as the tables next to us would lean over and ask what we ordered, how it tasted, what we were doing later, etc.  It was a GREAT atmosphere, and I'd say a really easy and fun place to take a date.  Not too loud and not silent by any means.  The stuffed mushrooms were good but kinda small and at $8 for 6 caps, I'd pick a different appetizer.  The bruschetta was excellent with plenty to share for 2.  I'm still in search of a 1200 calorie cesar salad in this town, but Via's was closer to 200 using a fresh olive oil base - a very good spring salad version of a cesar but not my type - it was sorta Zuni Cafesque.  The linguine with clams was to die for in a light white wine and lemon sauce.  Our neighbors ordered the poched pear stuffed with vanilla ice cream in strawberry and creme fraiche sauce which, just for the description, sounded amazing.  No need for reservations!", "author": "Jared F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-07", "description": "Our family's favorite Italian restaurant for at least 15 years! Do not know why it is never in the Zagat Book!! Amazing, authentic Italian food, plus grilled specialties. No pizza. Involtini, eggplant rolled around mozzarel and topped with perfect marinara sauce a great appetizer. Via Veneto Sald, excellent. Penne Amatriciana, YUM!", "author": "Linda K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-19", "description": "Via Veneto is a very solid choice.  I live around the corner and go here all the time.  The food is great and the prices are reasonable.  Moreover, the service is very friendly.", "author": "Patrick D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-26", "description": "We entered Via Vento tonight at 5:30 and, given the early hour and the relative emptiness of the restaurant, were surprised when the greeter told us a table we asked for was \"Reserved\".   We are polite, well-dressed people and could see no logic in this: it seemed oddly  \"random\".  That was just the first sign we had innocently stumbled into the Twilight Zone to dine.  A man with a deafening air of stereotypyed  Italianness told us the specials.  One was crabmeat ravioli.  I selected that and a salad to follow.   He bulldozed me with \"No!  Salad comes first\", as if he were correcting some rube.  Of course in classic Italian cuisine, salad comes after the main course.  The appetizer comes first and is seldom something so ordinary as a small house salad.  But I felt myself in the presence of an overbearing ass, so---noblesse oblige--- just let him make my order HIS way.  (Made me yearn for my high school days dining at Burger King.  At least they knew how to do it MY way!)    Moments later a server arrived at the table to tell me \"No crabmeat ravioli.  Porcini.\"  I changed my order to Chicken Sorrentino, a decent chicken dish.  My companion had chicken marsala, also okay.   Nothing, please believe me, nothing special here, though we had fun later laughing at the Bunuelian sequence of events, many not reported here, at Via Veneto.  Go for a laugh and no other reason.  The ghost of Rod Serling just may make an appearance.  If you happen to be a stoner, Via Veneto rates a must-do experience.  In summation: Feh!", "author": "x v."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-09", "description": "I tried this place on a recommendation of a neighboring business, so I thought it HAD to be good, right?  Well...  I ordered the Mussels and Clams appetizer.  When the waiter set the bowl in front of me I got the distinct odor of fish!  Not the good kind!  That kind of shocked me and I looked at all of the shellfish carefully to make sure all were open, etc.  They were so I thought OK, let's try it.  The mussels were varying sizes, some were really BIG.  The clams were smallish.  And there was some definite grit going on.  The broth is what ruined the dish for me.  It just had an \"off\" flavor to it.  I usually like to dip my bread in it (which you have to because it is so tough!) and finish it off, but I couldn't.  Where was the garlic bread that usually comes with it at other places I've tried?  The mozzarella and tomato salad I ordered came WAY after the mussels and was served with olive oil and basil leaves.  I asked for balsamic vinegar because I prefer it that way.  The mozzarella was dry and the tomatoes appeared to be the hot house variety and had no flavor.  The balsamic was runny and weak tasting.  But the basil was good.  Fresh cracked pepper would have been nice also.  And I was surprised at how slow the service was considering they weren't even busy!  The host IS very friendly and nice, but I probably will not go back for the food which is a shame because I live only a few blocks away and I did meet a nice person to talk with while I ate. \"-0", "author": "Paula W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-10", "description": "I couldn't rate the food, as we left after waiting 15 minutes at the bar, and couldn't even get someone to get us a drink, bread or an appetizer (after 3 tries).  The 'service' bordered somewhere between rude and dis-engaged, and there are far too many options for what I remember to be a pricey restaurant with only average Italian fare from a few years back.", "author": "Larry M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-26", "description": "I was late, very late making dinner reservations for Valentines Day.  To my surprise, the gentleman who answered the phone at Via Veneto was more than accommodating with my dinner request for two.  After informing me that they were booked until 10PM he asked \"When would you like to eat?\"  I answered with 7:30 and he responded \"How about 7:45?\" OK!!!  \nSo... so far so good... but then we had to eat.  Upon arriving at the restaurant, it didn't appear to be that busy.  The menu was not fixed and was pleased to see several solid options.  I ordered the rib-eye (which I never would order unless at a steakhouse - but the waiter insisted it was their best item) and my date ordered the fish.  My rib-eye was overcooked and tough - her fish was dry and bland...  \nOverall, the place itself is cute - staff is helpful - the meal was moderately priced... but I would have been happy to pay more for a decent meal.  I would pass on this one if you have an alternative.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "This restaurant kept catching my eye since I'm a huge Italian food fan and well, I walk by it on my way to the bus everyday.  The menu seemed very reasonably priced so we finally decided to check it out last Friday night; just the two of us.  If it weren't for the service, I would have given this place 5 stars but just as many other Yelpers have said, this is where they're lacking.  As soon as we walked in, the host said he could seat us now, just give him a minute.  We weren't in any rush, so we stood there patiently with another group of 3.  Basically, there was a lot of going back and forth, more confusion and about 3 more \"just a minute\"s.  Again, we weren't in any hurry but we just wanted to know what was going on!  The group of 3 ended up leaving which caused the host to chase them down on the sidewalk and bring them back, only for them to continue waiting.  I don't know what was going on there but whatever, the host seated us a few minutes after that.  Our server greeted us and we asked to hear the specials...there were quite a few and I'm pretty sure they sounded awesome but they were rattled off so quickly, I wasn't able to catch most of them.  I would recommend they have a separate list of just specials since they have so many.  Anyways, I decided to give the basics a try: Bruschetta and the Fettuccine Alfredo (my fav food in the whole world).  Bruschetta was very decent and came with 6 pieces for $5!!!!  Amazing!  Usually, I pay around $7 for 3.  So I was eager to try my main dish.  I'd heard excellent things about the Fettuccine Alfredo here and it didn't disappoint!  Perfectly al dente, rich and creamy sauce, good consistency with a touch of nutmeg!  5 stars alone for this!  And only $10.50?!?!  Did I read that right?  YES!  Yes, I did!  Bottom line, I will be returning if only to enjoy that dish again...oooh, better idea...I'll get it to go.  I hope they do take-out!", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-02", "description": "I had a late night dinner (9:30-10 pm) on a Wednesday night and have to say this was among my worst dining experiences. Nothing was right - the atmosphere was tense, the owner (or someone \"in charge\") was arguing with patrons, the service was really slow and the food itself was very disappointing. In my opinon, it's hard to do Italian poorly, but Via Veneto does. I will never go back there again.", "author": "c c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-07", "description": "This place is amazing. And I'm not just talking about the hospitality you recieve from the moment you enter the threshold of this authentic and charming nook. I love all the collector magnum bottles of wine around the kitchen... talk about gettin' a party started! Seriously though, the wine list is very impressive.  Every dish I have tried is delicious.  Lobster ravioli is so good, as is the scaloppine de funghetto. GREAT date spot. I also really enjoy the intriguing murals on the walls. Mossimo and the entire team at Via Veneto are top notch and they will make you and your stomach very happy :)", "author": "Zachary D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-24", "description": "My gal-pal and I went here for dunch (that is, a late lunch that becomes dinner) on a Saturday after strolling about the Marina and Pac Heights.  Based on appearance and the vast menu of Italian faves like calamari, scallopine, and marsala, Via Veneto looked like it could be a winner and at 5pm we knew we would receive impeccable service.  The ambiance is charming...green vines and faux frescoes.  There is also a quaint patio in the back for those sunnier days. The house red was great...Montepulciano. ummmmm.  We shared a half carafe for $11.  What a deal!  I sensed it was going to be a good meal by the freshness of the table bread and whole roasted garlic clove-infused oil.  We started with the beef carpaccio.  Paper thin quality beef served w/ oo, capers, parm, and lemon wedges.  Tasssssty!  My dunch-mate ordered the gnocci with gorgonzola cream sauce and I ate like an animal.  I went from raw beef to a big fat pork chop.  (hey-i need my protein).  It was one of the specials...pork chop stuffed with prosciutto and gorgonzola served with mixed veg and roasted potatoes.  This was one tasty hunk of meat and I'll have to admit the veggies weren't mixed, but the veggie sure was good.  We think it was chard, but I forgot to ask.  My gal-pal said the gnocci was authentic and scrumptuous.  We talked our way well into the dinner rush and finally dessert.  What's an Italian dinner without the Tiramisu?  Man, am i glad we splurged.  It wasn't too soggy, nor to creamy, it was just right and the fresh raspberries were the perfect touch. Wine, premium app, two entrees, and dessert...for $60.  That is a serious steal for a quality meal in SF and even more so in Pac Heights.", "author": "Regan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-20", "description": "I love this place (obviously others tend not to agree)!  They have an awesome special of lobster ravioli which you can order when it's not even on the menu.  The service is great if you want a chilll meal (not if you're in a rush).  Massimo was very friendly with great wine suggestions.  I recommend the poached pear for dessert!  A great meal!", "author": "Jaclyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-03", "description": "Great service, wonderful menu (I had their veal), and definitely personalized service.  My girfriends and I had a wonderful dinner at Via Veneto and I have been wanting to take my husband there for quite some time.  Highly recommended.", "author": "Tarina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "This place is great for a group/family dinner. The staff are very friendly and the place feels genuinely Italian. The waiter was quick to take our order and there is a good selection of wines and main courses to choose from. The stuffed mushrooms and bruscetta were really tasty, very fresh tomatoes and nicely toasted bread. Everyone enjoyed the main courses, with the lobster ravioli and sea bass being the stand out dishes. Overall, we had a really enjoyable dinner - the service was great and while the food isn't anything that will blow you away, it's simple and tasty - just how Italian food should be. If there's anything negative at all, the decor and lighting is too bright for me so if you're looking for a super trendy place or a cozy romantic restaurant, this isn't it. But if you're looking for a friendly Italian spot with good food then you should definitely consider going here.", "author": "Andy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-31", "description": "if i have to start with the flecks of something floating around in my water glass then,so be it. i started to say something to the waiter but i noticed that anna and adrienne also had them in their glass so i just chalked it up to authentic italian water.  the oil and garlic that they serve up with their bread made me feel greasy. and not in a good,i just got laid kinda way. i'd ask if you 'feel me' but thats a tangent thats best for another forum.  i ordered the bruschetta.pasta pomodoro makes it better.sadly. i got the potato gnocchi with gorgonzola sauce. it was decent. it didnt stick to my teeth. the sauce was nice. the service was kind of (really)slow. our waiter who may have been massimo kept looking and talking to other tables while he was taking our order.im pretty boring. and i look like rocky from mask so i can understand the reluctance to look at me but hey, i got money now. and im ordering food in your establishment. maybe if i took my panties off i would have gotten better service? anna's food looked like i might have made it. and im no cook.adrienne's pasta tasted okay. nothing special.lots of old people and people who didnt want to wait anywhere else (like us). the profiteroles were soggy and i think someone may have sucked the custard out of the ones we ordered.  we had to get the check from the water guy. it looks like alot of people like this place. i dont get it. and i hope its not contagious.", "author": "Jim M."}
