{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Seems like people love or hate this place- I'm in the love crowd.\n\nIt's the fastest and most affordable (yet still tasty) lunch in the area. I always order the veggie super burrito or the mushroom and egg burrito with jalapeños. The spicy kick takes it to the next level. Sometimes I'll come for breakfast and get the chilaquiles or huevos rancheros. Their house salsas are great. The back patio area is cute too. Overall everything I've had here is good and service is consistent. The woman who rings you up will always without a doubt greet you with a hola guapa/o which completes the experience.\n\nCheese enchiladas are also good if you're having a cheat day. Rents in this part of town is pricey which explains their prices-don't blame them. With the other restaurant next door closing I'm afraid this will be next if we don't keep dining here. Keep small businesses alive!", "author": "Stine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "When some folks talk nonstop about how \"good\" a certain eatery is, I can't help but raise an eyebrow. Coming from a person who's guilty of overhyping mediocre restaurants, I know too well the need to have some skepticism. \n\nSure, I've come across a lot of places worthy of infinite praise (https://yelp.to/qTKq/gji3wdyUCP). But more often than not, I've found plenty of sour apples as well.\n\nThe most recent example comes from Victor's, a VERY popular Mexican eatery in the Mission Bay Area part of San Francisco. Despite a negative review from my girlfriend, I reluctantly stopped by a few days ago since I needed to pick up quick food after a volunteer shift. Long story short, I should've just gotten something outside my office at Focaccia...\n\nLocated on 3rd and Townsend Street, Victor's is essentially your standard Mexican food stop. This place served burritos, chimichangas, tacos, nachos, quesadillas, and several plates - all with the usual types of meat such as al pastor and carnitas. The interesting thing about Victor's, however, is that customers have some flexibility in the ingredients that go into each order. Kinda like with Chipotle, you can pick your salsa as well as the type of beans (if any). In terms of cost, I found this place to be pretty average; most items hovered around $8-$10 and for burritos specifically, they charged around an extra dollar for a super (has guac, sour cream, and cheese).\n\nWhen I stopped by, I picked up a Regular Carnitas Burrito with Black Beans and Spicy Salsa. Boy, I really wish I could get back my $10 because the experience was much different from what a lot of my friends had glamorized. First off, I felt like the ratio of ingredients was pretty unbalanced. They gave me a whole bunch of beans and rice, but very little salsa and pork. Secondly, the burrito felt really bland without any sauce. I would've appreciated getting guac or sour cream without paying extra. And most importantly, the pork carnitas was SO LACKING. Although the outsides were sort of crispy, I hated the fact that they came in such large chunks. I really didn't like that one of the cooks half-heartedly cut up the meat. And the flavor just wasn't all the way there, probably since the pork had been sitting there a while (they don't cook it in front of you). In a nutshell, it was more of a Chipotle experience than anything else. \n\nBeyond the bleh food, I can only think of two reasons why I'd have the heart to recommend Victor's to other people. The first being that the location was quite convenient. I mean there's literally nothing else nearby my office/Mission Bay except food trucks and chains (e.g. Tender Greens and Taco Hell). Furthermore, the service was quite genuine, amicable, and heartwarming. I loved that they had a bowl of chips and salsa at the counter where you could nibble on while waiting for your food, and they packed some with each order. Plus, the cashier was VERY friendly! She went on and on talking about her wonderful grandchildren. \n\nTl;dr Victor's to me is a place I'd go to if I had absolutely no other option in the area. It's not bad per say, but among all the Mexican eateries I've had this ranks pretty low. Meh food, but good service so I'd give it a \"Tolerable, sufficient for sustenance\" rating.\n\nEat well and prosper,", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Food is great! Meat is seasoned perfectly, salsa bomd as hell. And most of all the customer service is amazing I feel at home here. A need to stop and eat location whenever I come to. SF", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "If only there were more seating! Great, fresh food and mama will make you feel right at home. While we decided what to order she had us try mild and spicy salsa and guacamole. We got a shrimp burrito, fish tacos, and chips and guacamole. Would definitely come back here.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "If you look real hard you can still find a few remnants of old SF. Not the best Mexican food you'll ever eat. But neither is much of the real Mex. food in Mex. Since 1985!\n\n6- Stars for sincerity and friendliness \n6- Stars for quaintness. \n4 - Stars for food \n\nKeep walking past Taco Bell and get in here!", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "HOLAAA GUAPA! \n\nThis is my favorite place to come when I'm having a bad day at work! For two reasons: \n1) The woman who runs this place is awesome and will definitely put a smile on your face!\n2) The food is amazing and is my ideal type of \"comfort food\" \n\nPROS: \n(+) Quick Service \n(+) Great Food (I always get the Shrimp Burrito.. super, with hot sauce)\n(+) Even better service \n(+) Larger than average portions\n\nCONS: \n(-) Kind of expensive for a burrito ($10+ with tax) \n\nDefinitely prefer this place over Taco Bell (across the street). Would definitely recommend if you are in the area and craving a burrito!", "author": "Natalie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "Kinda small and stuff but amazing mouthwatering food!", "author": "Rumaisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Get a super chorizo breakfast burrito, you will not be disappointed. I'm addicted to it at this point; it's a real problem. I come here for the food, the nice back patio, but I stay for the owner yelling at me. She's amazing.", "author": "Jim L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "I was sort of surprised of the service I just got at Victor's because in the past I hadn't ever had a negative experience. So I just went to Victor's and ordered Pozole which was today special and it was advertised at $8.50 on a white board out front. After being handed my order I was told it was $10. I didn't argue nor say anything because after all this is a mom and pop establishment so $1.50 wasn't going to break me. So then I get home getting ready to eat my food but it is cold like it was just given to me out of the refrigerator. Also, where is the tortillas? I know last time I ordered the same thing it had tortillas and it came hot. Very very disappointed!!!!  I work right across the street and go to Victor's often but now I may have to rethink that. What a shame Victor's.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Basic Mexican food.  Fast service.  $10.44 for a Chicken 'Super' Burrito.\n\nNice to have a remnant of the neighborhood remain.\n\n-1 star for the obnoxiously loud greeting upon entry.", "author": "Tiger S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Definitely a favorite option near the ballpark. Dirt cheap but excellent food, love the Burritos and Juevos Rancheros.\n\nAs many others have pointed out, the owner is EXTREMELY outgoing and personable, you will likely know a great deal about her family and the history of the business by the time you finish ordering.\n\nBe sure to check out the back \"patio\" dining area, very nice!", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "\"Hola Guapo!\" Whenever you see the owner, this is how she'll greet you. This is a hole-in-the-wall independently owned restaurant and she's one of the main reason why I always enjoy coming here, as she's very friendly and enjoys talking to her customers.\n\nThis restaurant is walking distance from AT&T Park and they're a great alternative to get lunch at before a game or grabbing food to-go when you go to the ballpark. If you're going to be there on a Weekend, they are closed earlier on Saturdays and they are closed all-day on Sundays. \n\nTheir prices have gone up quite a bit over the years, but that's SF for you. I always get their super burrito, which is a decent size and includes their chips. There's very limited seating inside, but plenty of seating outside in the back of their restaurant. Even though it's outdoors, it's completely covered from any wind or rain.\n\nTheir food is average and they're decently priced for San Francisco; but I really do enjoy their service & owner. 3 stars for the price & food, but I'll round up for the friendliness and the quality of their service. It always feels good to support the independently owned businesses, especially when the owner and their employees are very friendly to their customers.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Authentic mexican food, portions are very descent. Personal favorite: carne asada enchiladas", "author": "Eugenia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-26", "description": "Warm greetings aside, the food was only ok, and I'm not sure I would return.  \n\nI stopped by here with 15 minutes to spare before my Caltrain.  Service was really fast and I had plenty of time to board my train.\n\nThe salsas are good and the chicken in the burrito was flavorful, but I felt like everything on the menu was just a dollar or two too expensive.  With tax, a burrito comes out to just shy of $10.  \n\nI do appreciate that they take credit cards though!", "author": "Alison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "I had a shrimp burrito, flavor was on point.  Definitely a place I'd keep coming back to.\nWhat made it even better, was the service.\nThe lady that works there made my experience there an awesome one. She greets everyone in an energetic manner and keeps a positive environment.\nIf you like to support small local businesses, make it a point to come check them out.", "author": "Mauricio Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "Good as any place in the Mission and much closer to my casa. Good seating in the enclosed patio out back. I had the huevos rancheros, the burritos looked good too.", "author": "Tony E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-20", "description": "Is this the worst restaurant in San Francisco? I ordered \"Huevos Rancheros.\" I'm not sure the guy had made eggs before, no one washed their hands between handling money and food, and after over-frying my eggs the guy stuck my plate in the microwave for two minutes! Everyone hardy spoke English and I had to ask them to bring out my girlfriend's food as well -- for some reason they made one dish \"to go\" and the other \"for here,\" and then I had to ask them for napkins and forks/knives as well. Completely unbelievable.", "author": "Andre W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Just like a classic Mission-style taqueria; many choices of meats; burritos; enchiladas, etc.; add sandwiches. I got a burrito with stewed chicken that they typically serve as soup. Nice young gal made it EXACTLY to my specifications. Quite good. I'd go back.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Favorite Taqueria in town.  The owners is the magic behind this place with her warm Guapo/Guapa greeting.  The staff is also friendly and the food is solid.  Favorite things are the crispy tacos, and their soups(Pasolé  and Chicken Tortilla).", "author": "Todd H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-07", "description": "Victor's is a amazing Hispanic Resturant!!!! Delicious food, and awesome customer service! The staff are very welcoming and polite. However, they never seem to be ready to serve when the doors open.... easy fix to this problem. Either change the hours of operation to a later opening time or have the opening staff show up early to give themselves time to be ready to serve when the doors open. Punctuality is very important to me, if it wasn't for that minor issue I'd give this place five stars!!", "author": "Edward R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "\"Hola Guapa!!\"-  I love Victors! This is a true SF staple. The same woman has owned this place for years. \n\nThe food is consistently good, the service is wonderful and they are very efficient, even during the lunch rush. The prices are VERY reasonable compared to other dining in the area, I say that knowing what rent prices are like on this side of the city. \n\nI can always count on a great burrito from Victor's", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "Came here on the hottest Saturday but still appreciated the food.  We had super burritos but probably could have shared one burrito.  Family owned operation!  The woman who appears to be the owner talked us into taking the hot salsa and she was right.  More of a light burn hot sauce.  I like how they put tortilla chips into the burrito bags as a freebie.  This place is now a definite stop on the way to AT&T Park.", "author": "Glenn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "I love coming to Victor's before a Giants game.  Food is awesome and employees are always friendly as ever.  Eat in the restaurant or take a burrito with you to the game!", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Amazing staff who is very welcoming with every visit, and takes car in preparing the made to order food exactly how you want it. Every time.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Owner is super nice, servers are nice too. Spicy salsa tastes great. They got cute little backyard. Definitely coming back.", "author": "Saran D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-27", "description": "Aye okay tacos and burritos.  \n\nThis place is lacking a salsa bar, which I love in taqueria places - especially the pico de gallo. \n\nThey have seating area.\n\nIt's just not the best taqueria spot in this neighborhood.  Good grab for lunch, I guess.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "The people here work hard, they greet you in a peculiar way, the food is tasty and not so expensive.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "WHAT! Why does this place have such bad reviews? I liked it!! They liked Mochi! There's a back patio for seating!! whywhywhy??\n\nCame here for a super burrito (steak) and B for a shrimp super burrito. The homemade salsa was AWESOME SAUCE (literally)..and the burritos were WONDERFUL! This is my go-to spot for burritos in SOMA. Hands down.\n\nSuper great service -- they're so incredibly friendly and patient! They came outside when I was staring at the menu through the window just to welcome me in! \n\nDefinitely will be back for their breakfast burritos too!!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "A solid 3 stars...\n\nI will definitely be giving this place another shot. I think they have a lot of potential to be my new Mexican spot in the area. Apparently when I decided to go they had just gotten a large phone order of 16 burritos. On top of that there were already 6 people in line in front of me. That's usually a great sign. Lots of people waiting patiently for their awesome food.\n\nThe workers were going back and forth in between filling line orders and that large phone order, so it actually took a really long time for me to finally get served. I ordered the pastor torta. I was excited because it looked huge and it's just what I was craving! I was even more excited when I picked up my bag to go and felt how heavy it was.\n\nNow, I'm no expert but I am almost certain that they gave me carnitas instead of pastor. Boo. They bread was really soggy by the time I got back to work which is only about a block and a half. But don't get me wrong. It was still decent and I ate the hell out of it!\n\nI will be giving this place another try. I am pretty sure I just ordered the wrong thing. I must try the burrito next time!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "For anyone craving a classic grubby taqueria experience, this is definitely your spot. The menu (burritos, chimis, tortas, street tacos etc.) are pretty much standard Mexican- no fusion-y alterations. The staff also is very sweet, and you can tell they want your business. They also have a really cool backyard dining area that's a little quieter on off-peak weekday lunch hours.", "author": "Deuce B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-25", "description": "Ordered for a steak quesadilla, it was eh. Portion was small for $8 and didn't have good salsa, but steak was good.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-26", "description": "Came here today for lunch and got the super burrito with Chile Verde Chicken. It's not bad at just over $9 after tax. The line moved pretty fast, and I got to see them putting on the cheese and plopping the burrito on the grill for a few seconds too. I'm a little concerned about how sanitary everything is just because there were three ladies back there bumping into each other. Overall the burrito was pretty good. Comes with tortilla chips which are pretty thick and very deep fried, and the salsa is pretty bland. There's not much seating inside but they have an outside area with tables and seats for maybe 25 people or so. Unfortunately, it's like a greenhouse in there because the ceiling is this clear plastic/glass material and there's no ventilation.\n\nOverall I'd probably come again for the burrito, but try to sit inside or take back to work.", "author": "Willis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "I don't work around the corner anymore, but I still drop by occasionally for the \"HOLA GUAPA!\" and the excellent burritos (carnitas with spicy salsa for me, always). Sit on the covered patio out back and watch cheeky little birds swoop down hoping to catch a nacho crumb or two. \n\nVictor's is deservedly popular with the lunch crowd and you may have to get in a long line, but service is always quick and friendly and the price is right!", "author": "Vicky W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Loved this place. My beef/black beans/spicy super burrito was one of the best burritos I have ever had. The owner was extremely friendly, cheerful, expressive, intense enthusiastic and charming. My order was ready in like 2 minutes. Amazing place!\nDefinitely going to visit Victor's again. And again. And again.", "author": "Evgenii G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "The ladies that work there are Definitely a Good vibe, funny and Genuine!.  I just wanted a Quesadilla and ended up with a full stomach, laughs and the want to return during their lunch and see what other funny antics these ladies have to give and say.  It was delicious enough for me.  Bless them!", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "I eat at Victor's for lunch about once a week.  They are one block from my office.  The food is about what you would expect from a walk up - stand in line - made to order Mexican joint.  The prices are okay .. expect to spend about $12 on lunch.  You will get full, \n\nThe nice part, and what keeps me coming back is the theme of the place, set by the owner.  I enjoy walking in and she always shouts :HHHOOOOLLAAA GUUAAAPPOO\" ... to every person who enters.  Its a signature of the place.  It makes everyone smile and its really cool.   \n\nGo to Victor's.  :)", "author": "Paul R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Amazing Burritos. I Eat here at least 2 a week. Super Secret back porch is very warm and welcoming even on the coldest of days.\nMy recomendation:\nChicken Verde Super Burrtio \nHalf Mild Half Spicy\nBlack Beans", "author": "Mason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Victor's is awesome. The same woman has owned this place for 30 years and she loves her customers. The food is great and consistently tastey.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Great stuff!  the people are nice, the super burrito is good, and it's a fantastic value.  Will be back for sure.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "HOLA GUAPO! \n\nGracie is a sweetheart, great food , reasonable prices for the area ( it's expensive in Mission Bay and SMB's have to survive too) \n\nDef favorite lunch spot near my office.", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Bogged down with a cold, I was walking back from getting a haircut today and saw a sign in front of a small Mexican joint that said \"Special: Adobo Soup\". Thinking it might help me feel better I went inside. \n\nAfter receiving a very friendly greeting, I ordered the soup, which came with fresh sliced avocado, diced jalapenos (on request), a lime wedge, some tortilla chips and some fresh corn tortillas. I sat down a proceeded to enjoy THEE BEST Adobo Soup EVER! It was like a Mexican version of Matzah Ball soup, with 3-4 large spiced balls of chicken and chiles in chicken stock, with fresh vegetables and rice. Perfectly flavored, hearty and spicy. I finished every morsel and drop. It also made me feel a lot better, probably because the jalapenos raised my temp by 30 degrees. \n\nI haven't had anything else at Victor's, and as long as they're serving that soup, I may not have anything else, but one thing's for sure...I'LL BE BACK SOON!", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Absolutely loved this place! The women in the front were not only welcoming, but funny as well! There's a beautiful seating area in the back where it's serene! The service was a 5, the food was a 5, everything was a 5. I'd even go back for the \"¡Hola Guapa!\" whether or not I was hungry.... I'd probably still eat there if I wasn't. \n\nIf you're feeling Latin food, you can't go wrong with Victor's!", "author": "Menat E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "\"Holaaa guapo, what would you like?\"\nAw shucks, are you talking to me?\n\nBut leave it to yelp to make me realize she calls everyone guapo/guapa (handsome/pretty). I see they even have a sign with that greeting now. \n\nHaving said that, I don't want the rest of this to come across as the words of a jilted lover. So first off as other reviews have pointed out about occasional cash register shenaningans, I also noticed interesting rounding time to time. Which is fine I guess, since I just alter the tip jar contribution by the same so it works out. What's not fine is that this attitude of shortcuts makes me worry if they take shortcuts in the cooking:\n-Beef and chicken burritos are okay, if not dry and a little salty\n-Tortas, bit boring, especially in the context of a city full of good ones\n-Soups, I'd go for it on colder months only", "author": "Erik L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "Every Friday my entire company goes to lunch together. This las Friday we decided to go to Victor's. We were greeted as soon as we walked in the door with a friendly \"HOLA!\" The line was pretty long, but it moved pretty quickly. I had a really hard time decided what I wanted to eat, everything that was being made looked and smelled amazing. I was leaning toward a torta, but was hesitant based on the experience I had at Tres two weeks before with their horrible torta...\n\nIn the end I decided that I wanted to give Victor's torta a try. I ordered the carnitas torta, it came with a heaping pile of carnitas, lettuce, tomato, cheese, and avocado. It was probably like 3million times better than the Tres torta, the meat was tender and flavorful, and the bread was soft and freshly baked. I will be back to Victor's to try some of their other menu options.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Being from Los Angeles, I have not many San Francisco burritos, but the chorizo & egg burrito here for Breakfast was terrific and made fresh. Ordered it with everything, so it included rice, sour cream and guacamole. Choice of black beans or refried - I chose refried. Very tasty. The chorizo was hot but not too hot.\n\nIt has a patio but Sat morning it was not necessary to be there. Good place to stop when you are near the Cal Train Station.", "author": "Alan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-11", "description": "Don't let the loud HOLA Mamma/Papa cries when you enter fool you, turns out that is misleading. The food is sub-par and the only thing this shrewd business woman cares about is your Pesos.  \n\n\nHere my experience: \n\n1st visit: Ordered Super Burrito - Instead of being able to watch it made, I was called to the register to pay, by the time that was done, my burrito was too and sadly when I got to my desk, a disappointed, small, run of the mill burrito revealed itself. \n\n\n\n2nd visit: Ordered same thing.  I didn't leave the assembly line and watched my SBurrito made, since this is my favorite Mexican food meal, I have had Burritos from many different places. The chicken in red sauce I ordered must be a favorite because she had to sift thru the sauce to find pieces. When it was not a lot, I asked the server to ad a little. Moving down, towards the cream etc..  I asked for some lettuce sprinkled inside my burrito (in all fairness, its not listed on the menu as included, nor as an extra ingredient) and when the owner, got my burrito, she actually remarked nice and loud.. \"Thats a BIG burrito, YOU can have TWO lunches, better SHARE that with someone\" Not once, but twice!! Seriously? trying to make me feel bad for getting, what a regular Super Burrito should look like? I have to admit, she got to me and I walked away feeling pretty bad about my food.\n\n\n\n3rd visit: This time, I figured, everyone deserves a 2nd chance. I will simply seek the owner out to talk to her. I got in line and curiously observed three gentlemen's, super burrito's assembly. Much to my surprise, theirs was nice and loaded with goodies. (The way it really should be), none of them had to ask to have some more ingredients added). This made me wonder, is this because I am a woman? \n\nThen its my turn and instead of getting the same treatment, I get the opposite. Near half the amount of rice and refried beans to start with and it continued from there on. I made a small remark about making mine the same as the gentleman before me, but then gave up since the server looked at me confused and irritated. On to the register, here is my chance... \n\nI figured I talk to the owner and the last visit's remark will turn out to be just a big misunderstanding, perhaps an apology, other explanation.. and if not, at least to have her let me talk and listen?\nBoy was I wrong! Here she is raises her voice. (and my burrito) \"THIS is a BIG Burrito\" holding it up like a trophy and facing the crowd behind me. Then she continues on with her rant, not letting me even get a word in and ends with. \"I feel sorry for you\", \"We dont need customers like you\" ,\"bye, bye\". Oh the theatrics! \n\n\nOverall, this somewhat dingy hole in the wall hosts a very dominant, proud, rude and loud owner peddling her overpriced, small Super Burritos.", "author": "Beatrix F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Stopped here for a breakfast burrito around 10am on a Sat. and will definitely go back for more! The ingredients tasted fresh and quality made. The salsa was spicy and had great flavor. This place is a little run down looking, but it was part of the experience. The kitchen looked clean and the food tasted great - and that's what mattered most. It was nice sitting outside on the covered patio in the back as well. As a heads up, the only drinks they have are bottled and refrigerated drinks including some beer, water, and juices.", "author": "Sirena F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "Even if this place lacks in the looks and ambiance department, it scores high in character. Every time I walk through the door, I'm greeted with an enthusiastic \"¡Hola papi!\" or \"¡Hola guapo!\" It's the little touches like this that will keep me coming back for more.\n\nThe only thing I've tried here so far are the burritos with chicken chile verde. They've got their hooks into me with the chicken chile verde, that's definitely something I haven't encountered on a taqueria menu before. \n\nOne word of caution, if you're a bit of a spice wuss like me, be careful with the salsas they have out on the tables. One comes in a squeezy bottle and the other is in a jar. Both of these make me break into a sweat and my glasses start to fog up! \n\nThe food is decent, the people behind the counter crack me up, and everything is crazy spicy. I'm glad my company just moved into a new space down the street, because even the best taquerias downtown weren't as good as this.  Now off to my post-lunch burrito coma....", "author": "Nate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-24", "description": "I'm a big fan of anything with nopales.\n\nThat's cactus for you gringos : - D \n\nYes, I'm a guera, but I know my espanol, gracias ; - )\n\nI'm also a fan of cheap, good food.\n\nThus, I'm a fan of Victor's.\n\nI came here with a group of male developers, all who were hungry. They began ordering burritos, tacos, and large portions, oh my!\n\nMy eye landed on the cheapest thing on the menu: Quesadilla with Nopales.\n\nSi, senor!\n\nIt's definitely not the best Mexican food, but it's the best for a low price. Got it? If you want something a bit more flavorful, but pricier, head over to Mexico au Parc (http://www.yelp.com/biz/mexico-au-parc-san-francisco#hrid:IzpX7Bm7eOW2AWCAIC3C9g)\n\nThis is simply prepared food, yes, but when you add cheese + salsa (mild and hot) + guacamole + nopales, it equals a tasty, decent-sized meal.\n\nTake it to go and enjoy!", "author": "Diana V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Love this place! Affordable, delicious mexican food which is hard to come by in this part of San Francisco!", "author": "Sydney T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Hola guapo.\n\nJudging from the sign on the counter this is a greeting they give everyone. Still a nice touch. Felt the same way towards my delicious torta.\n\nSo much broiled chili green chicken (bit spicy), black beans, lettuce, tomato and avocado inside always outstanding bolillo bread. $7.50 also includes cheese.\n\nCould have been two meals. Late hour and a growing hunger made it one.\n\nDo go say hello.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-25", "description": "I haven't yet been completely disappointed by the food here. It's your run of the mill local taqueria with salsa that's a little on the hot side.\n\nThe locals around here know the biggest draw at Victor's is the persona of the lady behind the register who greets everyone who walks in with a loud, \"Hola Guapo(a)!\"  She has a very warm motherly feel to her, she can multitask like no ones business too and she makes you feel very welcome...\n\n...that is until another visit. She was in a rush multitasking between myself and two other customers when she asked me something quickly about the San Francisco Giants baseball team. \n\n\"Wah wlah wah waaah SF Giants?\", is all I heard. To my ears it registered like Charlie Brown's school teacher talking amongst all the commotion going on around us. So I politely leaned in and asked her, \"I'm sorry, what?\". And then she made this dejected face while resuming to pack my take out while saying, \"El Stupido\", towards the bag. \n\nWell I completely understood THAT. I'm sorry that she takes great offense when people can't understand her. Perhaps phonetic articulation with a louder inflection is in order? I'm honestly very disappointed in her to have experienced that and my lunch buddies and I have since crossed this lunch option off our list.", "author": "Terry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Lady greeted me as I walked in, AND al pastor burrito was delish! What else can you ask for?", "author": "Brian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-13", "description": "Sorry Victors, YOU'VE BEEN CHOPPED.  Super chicken mole burrito.   Team take-out lunch... drumroll... no mole sauce in the mole burrito.  Doh!   You just can't win without all the basket ingredients.\n\nThe rest of the burrito was OK, but the texture of the chicken made me wonder about its provenance.  None of the good burrito purveyors in La Mision need worry.\n\nThe salsa was smokey with a little heat.  Nice.... there's a star!\n\nNot in any hurry to try again.  If I have to, will I have a better chance getting all the ingredients if I just order a cheese quesadilla?", "author": "Bob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "I love this place.  My coworkers and I have been coming here at least once a week for 5 years.  By the second year they had our orders memorized.  Even if the line is out the door, stay in line.  It is worth the wait, and they move thru the orders very quickly.\n\nI think I have only ordered the Carnitas Super Burrito since day one.  But, when I find a good thing, I stick with it.  I order mine with no rice, but they fill it up with extra beans and meat, so it never feels skimpy.  It is a full meal, and a lot of work to finish it off, but I am always up to the task.\n\nAlso, being called Guapa once a week never hurt anyone's ego.", "author": "Rayne K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-06", "description": "Is this the only Mexican option in SoMa?\nIf so, someone come please and help these people out. \n\nIn my touring of SF one burrito at a time...I have to say....ehhhhhh?\n\nMaybe there's something I'm missing. Am I supposed to be more enchanted at being called Mami? I can walk down the street in the 'hood I grew up in back in NYC and have that.\n\nToo much sour cream. Too little spice. Beans too watery. Shrimp way overcooked. \n\nHoney if this was from a cart on a street corner, maybe. But, inside? I need something a little bit better.  I feel mean saying this but Taco Bell has more flavor.\n\nAnd the service was sllllloowwwwwwwwwwwwww. But, I think the girl who served me that day might have been new. \n\nMaybe I caught a bad day. Or maybe this business thrives on being one of the only options in the area. You decide.", "author": "Liss T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "The food is great and the owner is really friendly and funny greeting everyone with a Hola Mamma. Great place", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Little shop a block or so from the famed AT&T Ballpark in beautiful downtown San Francisco. Had lunch here in the afternoon and traffic was hectic, which made our meal even more special. I enjoyed the pozole and had two servings, look forward to having the same item every time I visit this area. Very friendly family run business and reasonable prices! Would definitely return again and bring more family with me!", "author": "J L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "The owner. That's what this place is all about. Go just for the experience of her shouting at you and calling you \"guapo\"! \n\nGenerally a pretty trafficed spot, but for good reason. Quality meats and tasty specials almost every day.", "author": "Milan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "Tuesday special of tortilla soup is the best. They sell out so go before lunch. I was feeling under the weather and went to get something warm, spicy and delicious. This soup really hit the soup with its homemade everything. See you there on a Tuesday!", "author": "Katelyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "I'm a local in SOMA.  I stumbled in here on a Saturday morning around 10:30am.  I was welcomed by a friendly worker at the restaurant with, \"Hola Guapo!\"  This means, \"hello handsome\" in Spanish.  What better way to be greeted?  It definitely made me smile, as this is how they greet everyone who steps foot in their restaurant.\n\nI ordered the Chorizo Breakfast burrito.  It had all of the main ingredients as normal breakfast burritos do.  One thing that was unique is that they really blended the scrambled egg and chorizo extremely well.  The burrito wasn't too heavy either, which is really good.  The burrito was about $7.50.\n\nI passed by this spot every week and never thought to stop by.  This is one of the great hidden gems in SOMA, especially for Mexican food, which seems scarce here.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "Legit Mexican food! \n\nVibe and atmosphere does it for me. Super friendly ladies and the owner (presumably) is always energetic. \"Papi!\" Is the first thing you hear walking in at lunch time.  \n\nVisited many many many times before reviewing. They Never disappoints!", "author": "Alvin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-12", "description": "Staff is very friendly, was greeted right when we stepped into the door.\n\nI ordered a pastor super burrito, and the pastor was surprisingly good. I really was expecting an average, decent, forgettable Mexican restaurant when I came in, but turns out it was actually rather good. Would definitely stop by again sometime in the future for lunch or breakfast.", "author": "Victor X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Best lunch place in soma. Cheap delicious food that comes quick and with a smile. Line moves very quickly and there is a cool covered patio in the back.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-07", "description": "Had the burrito and horchata. Everything was average, I've had better. Patio seating was nice =)", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-10", "description": "Great Customer Service.\n\nGood Food (esp. their tortilla soup) at a reasonable price.", "author": "Emil D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "Went here for lunch today. Good al pastor burrito made to order (I'm really picky about portions of beans, rice, etc.)  The amazing customer service and people is above and beyond. Greeting you when you walk in, which is always nice.  But the kicker was there was a problem with the credit card machine and for those without cash she said to pay next time. That was it, simply \"pay next time, okay?\" and the customers said okay and she gave them their food.  You'd think they only do this for regulars but she said it to anyone, including my coworker (who is not a regular) and she said \"pay next time\" before he offered cash.  It's nice to have a local spot with charm.  I hope they don't get screwed by any customers.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "Place is cute. The staff is super fun. Burritos are standard, the al pastor was surprisingly decent, I have low expectations for al pastor in SF so one up for victors. Shout out to Chinos in the Richmond district. Gracie, I think, is the lady baggin chips, start a conversation with her, you'll be happy you did. The have a nice patio in the back but it doesn't have ventilation so it can get pretty hot.", "author": "Elton F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Love victors - las mujeres son muy lindas! Every time I go they make me feel super welcome. Adela y Gracie son fantasticas!", "author": "Stephen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-22", "description": "This place was a few steps away from my old place of work, but I only ate there once.\n\nBland, overly watery Chicken Tortilla Soup with barely any chicken. My friend who SWEARS by their tortilla soup insists it's authentic, which leads me to believe I might just not be a fan of truly authentic chicken tortilla soup. Or generally flavorless soup.\n\nThe carne asada burrito was A-OK. You can customize the proportions of the ingredients in your burrito, so I was able to make sure there was very little rice, extra beans, lots of jalapenos, etc. The meat itself was alright.", "author": "Asha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "Place is pretty tasty! Got the carne asada chimichanga, and would def go back. Service was super friendly. Lady running the place has been there 32 years! Old school San Fran", "author": "tony b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "If it is one thing we lament staying in Greenvale, it is the deficit of good Mexican.  Often times the local charm of Americana is enough, but far is it from a fine salsa lining a meaty burrito.  Not even Thomas can do one justice, can he Zach? Fond memories of our trips to San Francisco remind us of Victor's - a true hole in the wall that can very easily leave a hole in your wallet if you aren't careful.\n\nVictor's charm lies in its simplicity.  Pick the physical form of your lunch, and fill in the blanks as your configuration passes by all of the possible ingredients on the line.  It isn't much different from a Chipotle or Qdoba, is it Zach?  But as any good agent would know, the devil is in the details.  A spicy, succulent devil.\n\nOn our last visit, we chose a burrito adorned with diced beef, pico de gallo, lime and a bit of tomatillo - just enough to cleanse our sinuses as we ate.  The spice factor for both salsas was just right.  The onions dance liberally in the pico de gallo, creating an intriguing twinge.  Why San Francisco can do this so well, and Washington so poorly, is truly a matter worth investigating, right Zach?  But that wasn't all.  The tomatillo proved to be an appropriate delivery agent for the fine beef.  The lime we opted into adding completed the full workup of our taste palette.\n\nPerhaps the enjoyment of this burrito was further enhanced with the friendly demeanor of the food crafters.  The end of our purchase was met with a \"thank you, guapo\", which may be a cheap pleasantry to give your customer.  But it more than worked and brought on a smile.  Nothing about this was suspect, was it Zach?\n\nPerhaps we should stop daydreaming on the subject and get back to the case.  I'm starting to wonder what those red seeds taste like applied to a hearty queso...", "author": "Francis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-18", "description": "Burrito's all day everyday. This place is the bomb. \n\nAs soon as you walk in you're greeted by 'mama' and called either guapo if you're a guy or mamacita if you're a woman. You'll have to place your order quickly.  The ladies their work fast but you won't be disappointed. \n\nI usually order the SUPER steak burrito with black beans. They also have a great tortilla soup and coke in the bottle! Moderately priced. \n\nMy recommendation: burritos DUH!", "author": "Heather H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-22", "description": "The food is ok - not bad but nothing special. However...WARNING!!!\n\nWATCH THE CASHIER!!! Every single time, I catch her adding between $0.25 - $0.75 to EVERY SINGLE PATRON'S TAB!! I kid you not.\n\nI told a few co-workers who were going to keep an eye on her. They laughed me off and gave me the, \"whatever dude\" look. They come back to the office and run over to my desk explaining that they witnessed her add the extra change on to every single person's tab. \n\nWhen one buddy confronted her, this was her response, \"Mijo - my kids go to private schools and their books are very expensive!\" (With a sheepish grin) The guy behind them in line said that he's known about her shenanigans for yrs, but didn't want a confrontation.\n\nSo not only does she admit to it, she tried to legitimize her actions with that excuse - UNBELIEVABLE! \n\nIf you need tghe extra money - just raise the prices. It's not the money at all, but the fact that she's so damn blatant about it.", "author": "Rick P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "I love this place! The food is fabulous and the way they great you is so friendly and makes you feel good. It is a bit hard to hear them sometimes but that's not a big deal when their food is so good.", "author": "GIna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "It was my first time in San Francisco, so naturally I had to get a burrito. Had some of my buddies take me to their favorite spot, and we ended up at Victors. My buddy suggested the pork chile verde burrito, and lemme tell us it was so fire. One of the best burritos I have ever had with question. A must stop next time in that city.", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "I work right around the corner and have always been curious about this place. The lines are always long, so somethings got to be going right. I finally managed to slide in and give them a try. Right off the bat, you are greeted loudly by the wonderful lady behind the register. It's a great way to start the experience. I ordered a chorizo and eggs super burrito and was not disappointed. I'm quite particular about the ratio of the various ingredients in a burrito and I was quite pleased at the proportions. The pico was fresh and tasty.\n\nI will definitely be going back and give  a try to the other items on the menu, in particular the tortas. And, I wouldn't mind being loudly welcomed every now and then.", "author": "Steve R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-29", "description": "Very affordable, decent Mexican spot for SOMA. Line's a little slow but there's a sassy woman at the cash register telling you to \"come on, lazy!\" and giving you salsa even when you don't want it. All in good nature though, she was really friendly and loved my co-worker's chihuahua. \n\n* Carnitas dinner platter ($8-$9) - Rice a little soggy, you get your choice of everything (beans, sour cream guac, salsa, lettuce). Meat was pretty good, tender and hearty, just a tiny tiny bit dry. If you ever have a piece by itself, it's WAY over-salted, so always make sure to mix it with rice or whatever. They also fry some onions for you and heat up 3 soft taco shells. Pretty good deal.\n\nOnly about $6 for even a super burrito! Good deal.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "I love a casual Mexican food shop where I can get a burrito and go. The chicken had a really great grilled flavor, and the salsa was super fresh and flavorful.\nI loved that the ladies working there kept calling me \"mamacita\". So much wonderful local happiness.", "author": "Megan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "This is my go-to lunch place in SOMA. Starting from Gracie greeting you at the door (Who doesn't like to be called beautiful, when they're about to down a massive burrito?) to the amazing food, you can't go wrong with Victor's!\n\nMy favorite items are the Chorizo & Egg burrito (Super, with guac), the flautas a la carte. The spicy salsa is delicious, so be sure to ask for an extra cup if you're to-go!", "author": "Steph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "I've had 2 burritos in SOMA.  1 from Iron Cactus, and 1 from Victor's (both walking distance from my office in China Basin).  Iron cactus was whatever.  Victor's was much better, so the 4 stars could be based strictly on the fact that Iron Cactus was not so great.  But the Ladies at Victor's were so pleasant and friendly too!  I'll be coming back to get my burrito fix.  ~$8.50 for a super burrito + chips, and super quick service!", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-26", "description": "I've had better.\n\nIThe staff is great! The ladies call every guy guapo! But that's the best part. I ordered a chilaquiles plate one morning, and I couldn't eat it. The chilaquiles were ok, but I felt the sauce needed more flavor and spice, and definitely salt. The rice had to have been microwaved from the night before, and was bland. Beans are hard to mess up, but they did ok there. Their burritos are whatevers as well, but for the price, one can do better!", "author": "Alan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Nice Mexican, a bit confusing (in a good way), there is so much going on there and the woman working the counter is talking with basically everyone at the same time. I would recommend going here on a Thursday and try the chicken mole, they seem to have some special version only on Thursdays. It was very tasty.\n\nThere is a small outside area in the back that is much nicer to sit in, compared to the area in the front.", "author": "Magnus W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-22", "description": "Nice broad selection on the menu.  All the various meats are good.  The wet style burrito with sauce and cheese on top of your burrito is well worth the buck-fifty extra.  Lines can be long at lunch rush hour.  Extra seating in back patio is nice in the summer.", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "Solid Mexican food by the ballpark   ...and my office.\n\nAs everyone else says, if you hit lunch hour you'll get a loud welcome from the proprietor (guaaappooo or papicita).  You'll also get yelled at if you take too long to order or ask for the wrong thing.  I like that--Mexican food with the east-coast edge.\n\nBurrito's are a little pricier than elsewhere in the city, but hey, if I wanted a cheap one, I could ride my bike over to the mission.\n\nThey taste pretty good and the hot salsa is nice and hot.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "HOLA GUAPO!!!!!!!!!!!!!!!!!!!!\n\nI'm giving this place 3 stars for the food and an extra star for the friendliness. I come here almost once a week since my work is so close to it. When you come in, the owner greets in a very joyous tone and so do all the ladies behind the counter. Everyone is referred to as 'guapo(a)' which I believe means handsome/beautiful. It's pretty funny and just makes you feel so welcome. All the food here is decently priced and taste wise is not bad. I've yet to have a bad experience. There are chips and salsa as you wait in line which is nice. If you are around the area then I recommend coming here at least once since the lady is soo nice. She's a hoot.", "author": "edward k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "good food, good price, nice patio, good salsa. very popular place and it's my go-to for mexican in the area", "author": "Cara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "I'm currently working a job assignment two blocks down and was recommended to try this place. I was pleasantly surprised by the look/layout of the place;there is a nice back patio that you wouldn't ever guess existed from the street view (small entranceway). They've been in business since 1985 and it looks like they haven't changed a bit since then - I like that in a taqueria, keep it old school, nay on the polish, stream-lined look of a chain. Highly recommend their breakfast burritos; I got the mushroom and scrambled egg with salsa, beans, and rice and I loved it. Can't wait to try the rest of the menu.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "Excellent.  I wasn't aware of a good burrito shop in this neighborhood...this isn't going to help with my burrito addiction \"problem\".", "author": "Michael G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-30", "description": "Had better carnitas burritos. Lack individual flavors or uniqueness. The chips are hard to bite on.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Best Mexican food in the area near my job, great customer service and great tasting food so authentic and perfectly seasoned to the taste. I can stand in there line any day its worth the wait, seriously.", "author": "M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "The owner was very nice. Said they've been there for 31 one years. We had the chimichangas. Great vegetarian options. The food and salsa were excellent. Definitely will go back next time I'm in the City.", "author": "Sonya S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-10", "description": "For your review of: Victor's\n\nIf you don't get why people go their and eat the same great food you must be a retard its good genius\n\n\nIn response to this comment from someone that doesn't even YELP:\nYeah, I am still not a fan (sorry), I really did try multiple times but it just doesn't do it for me.  Also, A+ vocabulary, especially using the word \"retard\".  Gold star for you.", "author": "Jacquelynne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "My favorite place in SoMa. I would drive far out of my way for one of their breakfast burritos or just for the ambience of a real Mexican spot. I LOVE the women who work here. They can call my boyfriend guapo, papi, or whatever they want in those cute little accents.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "Hola guapo!\n\nThis place is legit! Love their breakfast and lunch burritos. Owners and staff are really friendly, makes me want to come back again and again.\n\nOnly gripe is that it isnt open for dinner and on Sundays since I live right there and would probably eat every meal there if I could.", "author": "Aditya J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "Customer Service: 5 stars, \"Guapo!\" They do a great job of making you feel special here. Even if everyone is a guapo or guapa. I think it's a nice little touch. \n\nFood: 3 stars, the burritos here are good. I like the shrimp burrito because they cook the shrimp right after you order it. \n\nLocation: 4 stars, great location. Sadly, there are no better burrito options in the neighborhood.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-28", "description": "HOLA PAPITO! That's my greeting every single time I walk into Victor's. Those women are the sweetest. They have the best carnitas I've ever had, so be sure to order it in a Super Burrito. \n\nChips while you wait, plenty of seating room and a great place to grab lunch.", "author": "Tyler H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Love the Nopales (cactus) Breakfast burrito!!  So tasty and delicious. Great service and line moves fast!", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Good food freshly made friendly helpful staff owner boss lady is a hoot love the carne Asda chips are great salsas are the bomb. I have been going here for 15 years and finally got on yelp to review", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "Having lived in Mexico for a few years, I really miss having a good Pozole Soup as you don't often find it on menus in the US.\n\nAt Victor's they only make it on Fridays.  You get a large bowl of Red Pozole (Hominy Corn with Pork) and all the traditional condiments (onion, lime, radish, and oregano) for $7.\n\nAfter asking to taste it, I knew the dish and broth was on point.  I was told that the cook was from the Mexican State of Michoacan.\n\nI can't speak for the other items on the menu; but, I'll definitely be returning for the Pozole on Fridays.", "author": "Roy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-23", "description": "horrible service and burrito, 20 minute wait... And I didn't even get what I ordered. There was only one person in front of me, (who also didn't get his order)...wts\n\nI really don't know what went wrong, and how it was so difficult to make our food. I ordered my bacon burrito, and just watched as all these burritos were being made wrong. She added things which myself and the person in front of me didn't want, while forgetting things which we had asked for. This wasn't happening all at once, I watched as she messed up his order, and it was my turn, and I was so fed up I just let her make what ever, I was expecting to get a burrito made I less than 5 min, and it literally took 20, and I was late already. \n\nReturn? No thanks, I will take my business elsewhere.", "author": "Nye T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "Good burritos, great variety, friendly staff. Reasonable prices...and they're open for breakfast. What's not to like?", "author": "Dan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "This place should not be called Victor's, more like Guapa's! Unless Victor is hiding because he is too guapo to be seen. It's a small and authentic family run Mexican restaurant that has been in the same spot for almost 25 years now. You walk in and the first thing you hear is a very loud: \"YELLOOW GUAPA(O)! How ju doin tuday?\" \n\nI started to feel special that I was always called guapa and giggle to myself, but sometimes you see some really fugly people walk in, come on now, realistically, they are Fea(o), but no no no, everyone in victors is Guapa and Guapo forever. \n\nThere are usually 2-3 cooks who are super quick and sound like nice parrots repeating guacamole guapa? Salsa guapa? Cheez Guapa? guapa, guapa, guapa, guapa...Yes, I would like a quesadilla with carne asada please. \n\nWhen it came time to pay, you see the owner with those old cash registers, that 70s hairdo, and all the religious candles and pictures behind her. \"Alright, les see, guapa, ju wan dat for hir or tu go?\" Me: \"Me gustaria para llevar porfavor.\" She would say \" GUAAAT, ju speak spanish! Where ju from?\" And I said Nicaragua. She says: \"Ohh wooow dat iz wonderful, ju want a coke? Me: \"No, no\". Her: It will be $8. As I pass her the debit card, she says \"OH NO, minimum iz $10, get one sodaaaa!\", me: oh then I will get a coke. Her: \"oh goodness, dis machine no work, ok ok sign here guapa.\" Me: \"Gracias!\", Her: \"Sankiu, have a very very good day\"! \n\nSince then, I have had to take a Victor Vacation, but I do miss the quesadillas and the ladies. The tacos and burritos were alright, but I will definitely return sometime!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-04", "description": "We go here all the time because its right next to work. The lady in the front is great she makes me laugh every time. I always have a great time speaking with her, she usually sneaks me extra chips haha. Super burrito for the win! \n\nSeating is pretty nice in the back I would recommend it if you have time to sit and eat. There is usually a fairly long line around lunch time but the staff works very quickly and the will have you on your way asap.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "I had to get past the loud \"hola guapo\" when I entered which clearly all the other patrons were used to but after that I settled down and ordered a Fajita plate and two soft tacos. I agree with the other reviewers that said this is the best Mexican food south of  Market. It is small and I see why people don't mind the short wait. The food is excellent and the owner is really a \"kick.\" Listen, this place makes great food, has terrific portions and they act like they really want your business. I will return soon!", "author": "Chocoolate I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "Me and my staff are usually too busy to go out and get lunch, so we try to place our orders in as much as we can so we can just get to lunch and eat.\n\nToday, we tired Victor's for the first time, and I loved it!\n\nWe called in to ask some questions about their food, and they were very busy, but the woman on the phone was still happy and very kind, even though she talked fast and hung up quickly.\n\nWhen we called back to placed the order, she was still rushed, but she was no less kind or happy about it. Even though they were busy and I could tell, I did not feel rushed or pushed.\n\nBest of all... the food was so GOOD! BEST mexican food I have had in SF! We WILL be back and it will be soon :)\n\nHad to go back for a second round. The good was just as good today and the owner, Graciela, is really wonderful. She's even nicer in person than she was on the phone. I found my new lunch place in SF.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Amazing burrito. Best burrito I have ever had. Chicken mole was superb. And they sure were generous with the cheese which I love. I can't even start on how great the service is the girls behind the counter talked to me about the giants which was great. I had a super burrito and a Mexican coke for ten bucks which is a cheap lunch. Victors is my favorite burrito and the best burrito.", "author": "Ryland P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "To the lady at the front: you had me at \"guapa\"\n\nI love the lady at the front. Her quirky personality makes this place even more awesome!\n\nFor the past 3 months, all I heard about, was their amazing chicken tortilla soup. They only serve it once a week (I think). Sometimes when our cravings hit, we went there around 1pm, and they were all sold out. Today, we realllly wanted our chicken tortilla soup, so we called ahead of time and had them reserve our soup for us. :)\n\nAnd oh boy. It was delicious! Some say that it's too spicy for them, but I felt like it was just right.", "author": "Sahana U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-22", "description": "I've been here a couple times now and haven't been impressed. It's the best Mexican food in the immediate area but not THAT good. I really didn't like the burrito I got here, and the enchiladas lacked flavor and were hard to eat. The price is to be expected for South of Market. The service is my real issue though, every time I've been there I've felt like I had to jump up and down for attention, even though I never go at busy times. They're always babbling amongst each other or other customers. I don't speak Spanish but I know enough to understand one of them saying \"oh she doesn't speak Spanish\" with a laugh, referring to me, which I didn't appreciate. I'd recommend this place with hesitation.", "author": "Allison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "Ready to be assaulted as you walk in the door with a hearty \"Hola Guapa(o)?\" Well, get ready. I've not walked in once without being greeted with extreme intensity. The lady working the cash drawer pumps personality into every square inch of air within that dig. \n\nThe food ain't half bad either, a little pricier than I'd think for lunch time Mexican plates. Last time two chicken tacos and a soda cost me nearly $10, but it's super fresh, so good, always accompanied by chips and salsa, and freakin' delish. \n\nTry any of the chicken plates, and Pozole on Fridays. It's fantabulous. \n\nAlways a line at lunch time, but it moves with some sense of urgency, if they don't the madam up front claps her hands and asks what the hold up is.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "Great authentic Mexican food with a very friendly staff.  They love the spice so be careful, it can burn. . . . twice.", "author": "Marc R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Amazing place I ever went..... Love the burritos and of course everything... The cashier as the ability to make ur day more than happy...... And the ladies on the counter are the best... Their so friendly calling you guapo/guapa (Spanish) they made my day...", "author": "Jose G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Love this place! Gracie, the owner was so nice and welcoming, and I haven't had a better experience anywhere. She gave us free guac...and hugs on our way out! Plus they have a patio so you can eat \"outside.\"\n\nWe all ordered bacon breakfast burritos. It's probably one of the most authentic breakfast burritos I've ever had in San Francisco. That's saying a lot because I've eaten a lot of breakfast (and regular) burritos having lived in San Diego. \n\nThank you Gracie! We will definitely be back, can't wait to to try everything else!", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-21", "description": "Carnitas = YES.\nChili Verde = YES.\nAl Pastor = not really.\n\nThis is a solid quick lunch spot around the corner from my office.  Super effecient, very nice staff.  The assembly line burritos are quite tasty although I'm not a big fan of the Al Pastor here.  They have simple rice/beans/salsa/guac/cheese to put in your burrito, but I'd also like some more veggie options.  I roll here about once a week for a lunch burrito fix.", "author": "Nicholas N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-29", "description": "I know my own needs....Soft Corinthian Leather....\nhttp://video.google.com/videoplay?docid=-57593845419909571\n...OK OK, this has nothing to do with Victor's except I keep picturing the owner to look like Ricardo Montalban and telling his staff...\"Smiles, everyone...smiles!\" \n\nNext door to Primo Patio is this unassuming tacqueria run with alarming efficiency by two friendly women. I only came upon it because Jamie W. and I were looking for a quick bite before sitting in the Antarctic Circle that was AT&T last night when they showed a live performance of the SF Opera's \"Samson and Delilah\" on the jumbotron.\n\nI saw one of the women grilling a sandwich and knew that was for me. The $5.60 Carne Asada Torta was a taste treat. Normally, the pull-away pork found in burritos and tacos was placed neatly between two sides of a grilled French roll. With fresh jalapenos and a slathering of salsa, it's like a barbecue pork sandwich without the heavy sauce. Gee I liked it a lot.\n\nOtherwise nothing much to report here. The decor is standard formica lunchroom, and the restroom doesn't have a lock (so do make a lot of noise to avoid unseemly encounters). But the the seat cushion of the chair feels like...could it be soft Corinthian leather?\n\nFOOD - 4 stars...no-frills torta was pretty yummy\nAMBIANCE - 2.5 stars...roadside lunchroom vibe\nSERVICE - 4 stars...fast with no fuss\nTOTAL - 4 stars...not really a destination place but a bargain place to eat before the ballpark", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-13", "description": "Rather keep on walking and find a taco truck in SOMA somewhere.  The burritos are awful! They are nice people though.", "author": "Demanding T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "Best Mexican food in SOMA. The owner who works the register greets everybody with an enthusiastic, \"Hola Guapo, Hola Guapa!\" Victor's is a quick service restaurant where you order at the counter. \n\nThe food is extremely fresh, tasty, and authentic. Best of all, it's extremely cheap.", "author": "Steve V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-18", "description": "Agree with some of the other reviewers. Watch the cash register! The owner will distract you by yelling \"guapo\" while she slyly overcharges you.", "author": "Martin P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-25", "description": "Having lived in southern california I guess I'm a little spoiled by awesome mexican food for cheap. This place is mediocre at best. They serve one of the wettest normal burritos that you'll find. I had to use three paper towels to clean up the drippings from the burrito. You'll probably also need to ask for extras when ordering your food as they tend to be rather skimpy. The chips always end up going in the compost as this place uses thick tortillas which are hard and inedible once cold.\nBest thing bout the place is the lady running the register yelling \"hola guapo\"", "author": "Eric N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-16", "description": "The burritos are good, but I'm giving my overall rating based on value, atmosphere (nice to be called guapo 14 times in 3 minutes).\n\nIf you want some affordable quick mexican that's pretty good - I'd recommend this spot.", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "Hola Mama!  Gracie is always welcoming no matter how crowded it is.  Wonderful food, fit for meat eaters and vegans alike (my husband loves the cactus burrito and I love the carnitas).  You can never go wrong with the food and the constantly upbeat atmosphere.  Good prices, and it's worth going out of your way for.", "author": "Maureen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-13", "description": "I come here pretty often with my brother for lunch since it's close to work, but I wouldn't say it's the best mexican food restaurant ever. It's a cute little place with a nice owner who always strikes up random topic conversations with us (seriously, she talks about the most randomest things ever). She's the one who's always greeting everyone at the door with a \"Hey Guapo(a)!\" and giving you extra chips with your order. Not that you can't get enough of it already since they usually have a sombrero of chips and dip on the counter to munch on while you wait. The food is pretty decent and reasonably priced. The salsa they have out on the tables really helps flavor the food because i find that the food tastes pretty bland without it.  \n\nMy favorite is the chilorio (shredded pork) chimichanga super with jalapeños. I usually get it without the beans so they fill it up more with the pork and rice. oh and they toast it so it's nice and crunchy on the outside while soft and juicy on the inside. yum! when you order anything \"super\", your order comes topped with sour cream, salsa and guacamole. and if you get your order to-go, don't forget to ask for extra salsa. it's good and adds some kick to the food. :D", "author": "Christine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "Have you ever eaten at Victors when there is some event at the Moscone Center using Hispanic workers (who don't speak much English)? There are a ton of inexpensive places to get a quick bite. Somehow they know to migrate all the way down to 3rd and Townsend to eat. That alone speaks volumes to its authenticity to down home Mexican food.\n\nNo one is saying Victors is upscale, gourmet or hip . If you want frills and interesting options, go up a few blocks to Chevy's. Though it is not on the menu, ask for grilled veggies next time on your veggie tacos. They will grill up some mushrooms, green peppers, onion and tomato and add it to your tacos. It costs a bit more, but worth it. Victor's is solid, no frills comforting Mexican fare I have missed since moving to the bay area.", "author": "Ginger K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Good Mexican food, friendly staff, fast, price is good/ok. Great spot to grab a burrito on the go. I buy the Mexican Salad which is really good. The salsa drives the flavor in the food.", "author": "Kyle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-08", "description": "HOLLA GUAPO!!!\n\nHands down, cannot beat the service.  She is ridiculously friendly and is always willing to strike up a conversation about anything.  A very good time to practice my broken spanish.\n\nSuper Chile Relleno Burrito on a spinach tortilla pleasseeeee.  You know she likes you when she gives you extra chips.  I ALWAYS get extra chips :)\n\nYou can sit outside in the patio and enjoy the wonderful day while dousing your burrito in their homemade hot sauce. \n\nAnd don't forget to snack on the chips while in line to whet your appetite!", "author": "Paran Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-07", "description": "Best Mexican in the Area, eat up and enjoy lots farting later.", "author": "Mack T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "Great Mexican food for a reasonable price. The staff was super friendly and really informative. I wasn't sure what I wanted and they gave me some suggestions and they were great choices. I will be coming back for sure.", "author": "Jeffery H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "Hola! \ncreo que soy lo suficientemente inteligente como para escribir esto..\nI used to really really like big, turgid, tubes of meat.  It used to really turn me on.  The reason why I liked burritos over gyros and other middle eastern alternatives is because of the turgid factor.  Heh.  Turgid.  Burritos are turgid and moist.  \n\nI've now become a bit more sophisticated.  I like burritos because of their turgid-ness.  And I also like quesadilla super suiza carne asada!  Power up.  Although the format of the quasadilla is floppy, there is some extra skin here and there, especially at the business end, it is super moist.  The tortilla is grilled on that awesome grill which I hope has never been washed.  \n\nAnd I hate beans.  I just don't like it.  Is that unamerican of me?  I don't like beans and I don't like peanut butter.  Some days the legume can be more tolerable, which is why I still pledge undying love to the burrito.  But now I have a vibrational alternative that has no beans: quesadilla super suiza carne asada, power up!\n\nI love the salsa here.  There is only 3 kinda, but it gets the trick done.  Today, it was a little watery.  I like to mix the salsa fresca with the deep red one.  It has that burn and scalp tingle, sometimes mistaken for indigestion.  But it's the peppers.  \n\nToday, I saw a not-homeless looking woman come in here, fill a drinking cup full of the pickled jalapenos, cover the cup with a napkin and walk out of here as proud as Mary Poppins.  Without buying anything else.  As Pretty Woman would have said, Snack?\n\nThe bottom line here...... weather you like beans or not......  Eat at VICTORS!", "author": "Yelp-a-holi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "My people!\n\nI am Mexican. I know real Mexican when I eat it. Whether it comes from Oaxaca, Chiapas, Sonora, Tijuana, Aguascalientes, Rosarito, D.F., San Diego (yes), from the east to the west - I know Mexican!\n\nThis.is.real.Mexican.\n\nIf you don't like it, go away! Nobody cares! This is real Mexican and for those of you craving a real Mexican meal served by real Mexicans with that oh-so-real authentic taste that your grandma used to cook and your mom never mastered. This is Mexican.\n\nNow - rant of authenticity aside. This is not a restaurant, it's more like a to-go side restaurant with real Mexican to go. \n\nMy favorites:\n\n- Carnitas tostada\n- Carne asada tacos con cilantro y cebolla (like the street vendors do)\n\nStaples of authenticity: Tortilla soup, sopes, and Milanesa. I had their Milanesa two years ago when I first discovered them, it was the first thing I ordered from them. I remember being content.\n (Side note: This was on a wonderful sunny SF morning after my car was broken into and I took my car to the then-body shop now-turned parking lot on Ritch & townsend, of which I am a happy patron!)\n\nI love Victor's, I look forward to their weekly meal. A good taco, burrito (for you guerro's), some chips, and an enthusiastic \"HOLA GUAPO!\" - Victor's gets my hearty vote (and lunch money).", "author": "Roxy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "In my opinion, this is the best Mexican joint in the area. It's not Mission, but it's pretty solid. Steak super burrito is good, salsa is good. One of the employees gives a great \"Hola Guapo (or Guapa)\" to you when you enter, which brightens your afternoon!", "author": "Thuan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-21", "description": "Also known as \"Guapo's\" around our office.\n\nMany of the other reviews have it down pat.  Above average burritos in taste, but not in size.  Not as good or as cheap as the Mission places, but then again, you go in expecting that.\nPastor and carnitas are, IMO, the two best burritos here.\n\nDecent chips, but you usually don't get free salsa unless you're a regular.  Their \"hot\" salsa is pretty darn hot, especially compared to the mild.\n\nMany people have not noticed that in addition to the few tables in the front, there is a backyard patio, which is really nice on sunny days like we had today.\n\n4 stars considering it's the best we've got in this area, but I'd give it 3.5 if I could.", "author": "dan s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-20", "description": "We went on a Saturday at noon, and the place had just been bum rushed by a construction crew. The two ladies working could barely keep up. The place was a little on the dirty side and there was an abundance of Giants regalia throughout. \n\nThe super burrito was good, but only because it was Pearly Cactus, and a cactus burrito is hard to come by. Consider it a novelty factor. The salsa was moderately fresh, but the chicken quesadadillas were weak.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Tuesday's Tortilla soup is the best tortilla soup I have ever had... EVER.  Just going in there is a trip, check it out and see how you get greeted walking in.  It's a riot!  Everyone is super friendly and everything they make is nothing less than delicious.  I'm telling you... Tortilla Soup Tuesday is the only way to go if you are in the area - but get there before 1pm because it is that good, they will sell out.", "author": "Marisa-Lee C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "This place is fairly good but nothing stands out. It seemed a bit bland and boring when I went and the service is pretty slow. I was hungover so maybe I was just out of it, but the food was just average. The prices and location were nice though and they do have chips and salsa just chillin on the counter. It kind of seems like it would be riddled with bacteria after so many gross people touching it and stuff.", "author": "Gus S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "Friendly staff but considering how many comments \"The Lady\" gets in Yelp reviews, I expected something more than what I got. No floor show. No hilarity. She's a character, to be sure, but is San Francisco so lacking in characters that this one deserves so much notice? \n\nThe tacos were A-OK, hence the three stars.", "author": "Will R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "This has been one of my favorite lunch spot for almost 5 years (while working in SOMA). Great to sit outside in the little courtyard at the back, eat chips with salsa while you wait in line to place your order and chat with the owner.", "author": "Stéphanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "Really tempted to give 'em 5 stars but in a city full of burrito joints, they're damn good but not the best in town. \n\nThe upsides are numerous. They do breakfast. There's a kickass patio out back which is great for fine weather. They greet you warmly. The food is tasty and their salsas are excellent. \n\nI usually get a burrito of some sort and they're dependably good and reasonably priced, as are the tortas. They're pretty efficient too, so don't let a long line scare you away. \n\nIn an area full of good, moderately priced lunch locations, this is one of my go-to spots.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "This is the only authentic mex place in the neighborhood, so props for that.\n\nI go here almost exclusively for the soup, so that's what my review is based on. The chicken tortilla and pork pozole soup specials are both fantastic, especially with all the toppings (ripe avocado, cilantro, cabbage, fresh jalapenos, tortillas, onions, etc). They are brothy the way they should be. Pro tip: always ask for the pickled jalapenos and carrots in yo soup! \n\nI am not a big fan of their style of guacamole - it has a blended texture (as opposed to mashed) and it usually tastes like there were some unripe avo's in there. \n\nThe whole staff is really friendly. Love going there and love the unpretentious atmosphere with pots of salsa on every table.\n\n$7.50 minimum credit card order.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-27", "description": "Amazing Mexican food......I had Nopalitos con huevo (cactus w/egg) tacos for breaksfast and they were amazing!!!\n\nGreat food for not too much money. They have all the Mexican essentials.....\n\nEnjoy!!!", "author": "Lupe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "Continuing in my journey to eat at every restaurant in SoMa, Victor's was definitely a delight. From the boisterous greeting of the woman behind the counter to the friendly service and delicious food, Victor's did not disappoint. Very reasonably priced, at least as far as this area goes. Overall, I was pretty happy. The wet-style super burrito was just what I needed! Great fresh meats and salsas too!", "author": "Lance H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-08", "description": "Oh hello Victor's whose meat used to make my friend sick and whose vegetarian burrito was as bland as chalk; you have another very welcome option! \n\nIt is not on the menu, but if you ask for a vegetarian burrito \"with vegetables\" they will cook them up right there for you.  For realz, on a grill and everything!  It has been awhile since I have been to a Mexican joint that actually grills the veggies on request. But, you have to say it RIGHT AWAY, because it takes them an extra couple of minutes to make it and if we don't follow the rules and keep it easy for them, we are going to see our would-be-grilled-veggies under a hot lamp... Know what I am sayin'?  \n\nI was so happy to have onions, peppers and mushrooms delight my senses today, and may I say again, it is most welcome.", "author": "Hayley W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "Love this place. they are fun, food is great, and above all else, they are very friendly! Everyone walking is is greeted Hola Guapo and Guapa!(Forgive if I spell wrong on those words) and the same as you leave you are greeted and thanked. If you walk by and see it full in the seating area, or a long line don't fret, yes the line goes out the door and the seating gets full but the line moves very quickly even when out the door you will be done in under 10 minutes with food in hand and there is actually a patio in the back with a ton of seating so almost always plenty of room to sit and enjoy your food.", "author": "Wil A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "There are some things you can fake easily... good mexican can't be done. I'd rather have turkey bacon for the rest of my life than eat fake-axican..such as a place down the street from Victors that I have previously reviewed (:\n\nLas chicas from Victors are amazing, but charm gets you no where with me in regards to lunch. I knew something was special about this place... and one thing the state of Michocan is famous for is, woman who can cook (ie;..ahem myself). I didn't take the easy test of this place and play a safe card of a chicken burrito or quesadilla. I went straight to the gut. First I tried the Torta de Milanesa, asked for jalepenos and queso fresco..and yep, just like the best ones I've had in TJ and Mex... heart won. THEN, I was fighting a cold and tried their Posole, no tough feat but they have mastered that too. \n\nI would pass on all the lame carne asada stuff and go for the tasty treats you can't always get at La Taqueria or Pancho Villa.. (the only other places worthy of 3-4 stars in the city).\n\nso.. felicidades muchachas!! they have won my Mexican food seeking heart.", "author": "Gen O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Hola Guapa!! As soon as you enter the owner make sure to let you feel welcome and notice. Service was decent but I feel like the salsa wasn't really that good, I usually prefer the salsa to be a little more textured then all mushy. Chips are little bit too thick for my taste and the burrito is just average.", "author": "Johnny Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-06", "description": "Decent Mexican food in SOMA.\n\nQuick lunch, lots of options, decent burrito.  The meat is not the highest quality, but it's not bad.  The staff is friendly.  And I always get Coca Cola Mexico :)", "author": "Ben B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Hola Guapo!\n\nI eat here all the time cuz I work a block away. It ain't El Farolito, but it's pretty darn good food and mama takes care of her customers like family. Give it a shot, you'll probably end up with a smile on your face and a very full belly. My favs: The burritos (breakfast or regular). Both are huge and tasty!", "author": "Bill F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-27", "description": "I once was blind but now I see. \n\nSeriously, what was I thinking? (maybe I was in denial since I'm such a huge Mexican food lover and this was the only place within walking distance to work). Having worked 2 blocks from this place for over 4 years I feel I've given this place plenty of chances to impress me. No such luck.\n\nTheir very questionable meat has made me sick more times that I care to think about and though they have very friendly service and great outdoor seating I will no longer be eating at Victors. So sad...can we please get a decent Mexican place in this area....please!!", "author": "Kristy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "Best Super Tacos I have had in awhile. \n\nI work around the ballpark, and Victor's is one of two spots that you can consider me a regular at.  (the other being HRD)", "author": "Joe E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "hi mama.  hi papa.  hi mamacita.  hola papi.  how are you today?\n\neven though the burritos are not as good as what you'd find in the mission (home sweet home), the greeting when you walk in the door might be enough reason to go to victor's.  the main woman (maybe she owns the joint) is usually the one hollering hello to you ask you walk in but all of the employees here will refer to you as papa / mama / guapo / guapa / mamacita / etc.\n\nthe burritos are decent.  and that's all i've ever had.  the size of the burrito is pretty good for how much you're paying... but, i think a burrito + chips + a tamarind soda for just over $10 feels like a titch too much.  but i'll still get burritos here if i'm super jonesin' for one during the workday.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "Oh man, do I love a Victor's Burrito when I know I'm going to need some real food to get me through a challenging day. Veggie super with black beans is my usual order, and the blends of flavors and spices are perfect.  Did I mention their spicy salsa is to die for?  \n\nThe woman running the register is like a hilarious Auntie you never had, accosting everyone as \"guapa/o\"  and shouting things like \"mild salsa is for wimps!\"  \n\nI think if they had homemade guacamole that wasn't so runny, I'd give them five stars.", "author": "Emily P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "I really, really liked this place! Great burritos custom made. So good!!great counter staff who say all their customers are good looking (Hey Guapa!).", "author": "Junie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Great service and kick ass breakfast burritos.", "author": "Sn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-14", "description": "PROs:\n+Very friendly staff\n+Line moves Quickly\n+Pretty tasty food\n+They'll do grilled veggies on top of nachos (I think I was the first one to get this there... they all looked at me like I was kind of crazy, but the owner lady looked at them and said \"That's going to be delicious!\" And she was correct.)\n\nCONs:\n+I wish they served beer\n+The hot sauce was alright, but just alright.", "author": "Dalton C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "I would give this place 3 stars for the taste, but I gave it an extra star because the lady always calls me \"guapo\" here (which means good looking in spanish) even though I know I am the ugliest person in the store usually.  I think that the lady wants to get it on with me.  Honestly though, that's the only reason I go here, otherwise i'd be going to Chipothole.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "So I've lived in this city for a whole year now and still don't know how to read the menu at a Mexican restaurant.  Thankfully it doesn't matter much at a place like Victor's, because you really can't go wrong.\n\nI had this thing called a \"carnitas super burrito,\" a sort of rolled-up sandwich with pork and beans and rice.  It also had some sort of avocado-based spread inside.   Delicious, all of it.  Compared to other \"burritos\" I have had, this one was rolled well enough to not come unravelled upon eating, and the flat bread was sufficiently thick to not develop any weak spots or holes during my meal.  This is especially important for me as my job as a cultural sensitivity trainer requires one to be well-dressed and stain-free at all times.  The triangle-chips were thicker than most and supported the tomatoes and cilantro readily.\n\nI will be frequenting this restaurant in the future.", "author": "Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "This is my new burrito spot. I've been there twice this week. I love the warm \"Guapo/a!\" welcome and the fact that it is a block away from my office. And of course, I love it mostly because the burritos are awesome. I can get exactly what I want on it, it's made by a very friendly staff person and it is cheap.\n\nI hope to try the nachos, tacos and tortas someday soon. I assume all the options are delicious. Your tummy will definitely be satisfied after a stop at Victor's.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-01", "description": "From my office it's a bit of a walk but well worth it and definitely above-quality and better on price than Mexico au Parc (which is a shorter walk). When you walk in you're greeted \"HOLA PAPITO\" by the woman owner/operator and everyone is guapo. Excellent service, selection and prices. Highly recommend the carnitas. A coworker swears by the seafood items.", "author": "Brandon P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-07", "description": "Service: Very very friendly lady at the front and super quick service.\n\nFood: Tasty and authentic but not as good as carambas.\n\nPrice: A veggie chimichanga and soda came out to nearly $10.  Pretty over priced IMO.", "author": "Mack D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-18", "description": "This place is just OK for me.  I hold La Tapatia (in SSF) as my standard for burritos and Victor's doesn't quite match that standard (although they do serve tortilla chips made by La Tapatia...I've seen the bags).  The chicken burrito I had was very bland, bland enough for me to stop eating it...the extra salsa couldn't even save it.  Because of that bad experience, I do not order burritos from Victor's anymore.\n\nHowever, the hard shell tacos are tasty...it's hard to mess up a taco.  For this reason, I continue to patronize Victor's.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-09", "description": "My boss brought me a breakfast burrito from here a few weeks ago. \nIt had chorizo, eggs and beans. So amazing. \nToday I went in thinking tacos but ended up with the chicken enchiladas. It was so satisfying. I picked up the large lunch that came with beans, rice, guac, sour cream and salsa. \nHorchata was fresh and delicious. Lovely hints of cinnamon. \nAnd just around the corner from my office.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "Hey, guapo. Nes een line, nes een line. \n\nWhat kind of beans, guapo?\n\nIt is what it is - value-based Mexifornian comfort food. The fourth star is for the staff - always smiling, always welcoming, always happy to see you. There's better food out there, but not better food for the price. In quick-serve burritos, I'm looking for something that's robust and tasty, and that I'm 99.5% certain won't give me food poisoning. \n\nMission accomplished.", "author": "West R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "This is like the best little mexican secret in town.  They know me by first name here.  I love this place and it's all about the \"Carnitas Super Burrito\" folks... It's ridiculous.  EHHHH GUAPO!!!!", "author": "Tyler L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-01", "description": "\"Hey guapo\"\n\nI've been going here for years (work in the area), and I didn't know what the hell they were calling me.   If the staff was cussing me out, they were doing it with a smile. =:-)\n\nThe food is good, but I lowered my grade because the last time I went there I found a hair in my super burrito.....and I know I didn't ask for it.\n\n\nGood luck in finding parking\nThe staff is very friendly\nThey open at 7am", "author": "Steve K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "True, I wouldn't go out of my way for this taqueria, but I work around here, and it's just the best. That's not a totally honest statement. Some days it's the best (see my review of Mexico au Parc).\n\nBut they treat you well. Never been called \"guapo/a\"? Come to Victor's. Never tasted chips and delicious salsa while waiting for a burrito? Come to Victor's? Never had a burrito while in Soma? Come to Victor's.\n\nTypical menu, lackluster eating area, but each ingredient is solidly good. The non-fire-roasted salsa is amazing. They could stand to give more chips with a to-go burrito, and the prices are, well, South Beachian.\n\nStill, Victor's has a place in my heart.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-21", "description": "I've only been here once. And it wasn't bad. I'm a little upset though I haven't had the pleasure of being greeted with \"guapa\"... I guess I'm not cute enough.\n\nThe hot spicy sauce is soo great. Personally, it could be hotter, but I won't complain. \n\nSuper enjoy the veggie burrito soo tasty. \n\nAnd the price is super cheap. I enjoy it. I'll come back.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "A car assembly line. That's what I thought when I first walked into Victor's. That's how smoothly the staff there move and of course, the woman at the register is the \"conductor\". \n\nPROS:\n1. Really good Mexican food and its not greasy and not super highly priced\n2. Their menu is simple and you don't have to wade through a menu that resembles a telephone directory\n3. If you like your salsa HOT - Victor's has it\n4. Their burritos are just the right size... not the \"super size, bean splitting, salsa dripping, tortilla ripping\" kind\n5. Service is fast and moves along even during lunch and its entertainment watching how quickly the line moves\n6. They have a nice back patio so check that out for sure\n\nCONS:\n1. The woman at the register does remind me of my Grandma (is that a con? not really) but I tend to tremble a bit when in front of her almost half wishing I had brushed my hair, polished my shoes and straightened my tie!\n\nAlso, if you're paying with a card, its a $10 minimum.\n\nGood place to try out. Good food, good folks.", "author": "Amit S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-26", "description": "I'm known as guapo chino, even though I'm japanese.  Love the patio, love the free salsa, love the fact that they have chips and salsa at the counter while  you wait in line.  \n\nDear offspring of the guapo/guapa lady,\n\nYour mom tells me you read these reviews and you're embarrassed by the fact that she calls every soul that walks in guapo or guapa.  I haven't been called handsome by that many people except your mom and my mom.  It makes my day, and whenever I feel a bit down and im craving a burrito, I hit up victors.  I'm sure other people feel the same way, so lay off your mom :)", "author": "Tomo S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "So my office just moved down by the ball park from the Financial District, and I was looking for a place to grab lunch, I came across Victors and I was pleasantly surprised.  It does not look like much but the food was good.\n\nFairly typical menu selection for a Mexican restaurant.\n\nDefinitely would go back next time I am looking for a burrito.", "author": "Rod O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-14", "description": "When you're in South Beach and craving a burrito, this is a good place to stop.  They have tasty enchiladas and burritos and outdoor seating in the back.  Their hot sauce is actually spicy and the ladies behind the counter are really sweet.", "author": "Nina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-18", "description": "This place has exactly what I want on any given day.\n\nIf you're looking for gourmet food, consistently impeccable customer service, and an cultured, attentive wait staff, you will be disappointed in Victors.\n\nIf you want the kind of Mexican food that tastes delightful and makes you feel roughly like you ate a bag of concrete, this is your place.  They will make pretty much anything you ask, and they have that sort of rustic charm that only comes from people too busy earning a living to devote time to the pomp and circumstance that you find at more \"civilized\" restaurants.\n\nIf you're the kind of person that goes somewhere looking for what's wrong with it, don't go here.  You'll find something you don't like, I'm sure.  If you measure a restaurant in terms of the things to enjoy, Victor's is full of flavor, options, and ethnic charm.", "author": "Jayson V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "I visited SF for the UCLA bowl game and needed a good meal to soak up the drinks from the night before. Although unintentional, Victor's ended up being the perfect spot. I had yelped the place next door but it was closed. Thus going to Victor's was part of our destiny. The food was great and good quality at good prices. Each item was made with love by two hard working women. The spot is small and can't really accommodate parties over 4, which is what we had. Overall, loved it. Great way to start my morning and NYE.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "I liked my burrito and I was genuinely excited to eat the leftovers that evening. That said, I am very easy to please when it comes to fried tortilla, refried beans, and cheese (yes, I had the chimichanga). I'm veggie, so I can't comment on the meat.\n\nI've finally come up with a consistent yelp grading rubric that will help me dole out stars fairly.\n1 stars - Both my boyfriend and I are grossed out by something about the food or restaurant.\n2 stars - I cannot stomach the food, but my boyfriend eats it\n3 stars - We both finish our food, and will come back for convenience, but wouldn't recommend the place as a place someone has to try or go out of our way to eat the food\n4 stars - Solidly good food that I will happily eat multiple times\n5 stars - Amazing food and value that induces a sense of longing or craving when I think about it\n\nSo, now you know where I stand :)", "author": "Corinne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-14", "description": "I have to say my favorite thing about this restaurant is the lady who greets me at the front door with a lusty \"Hey Guapo!\" and a smile. \n\nHowever, I'm a huge fan of the carnitas and mushrooms quesadillas and their light-colored NO CILANTRO salsa makes me sooooo very happy. Plus they have nice thick-cut salty tortilla chips. Yay salt.\n\nI'm also a big fan of their guacamole. Again, NO CILANTRO.\n\nLove them.", "author": "SisterMable S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "Easily the best burrito in town from the friendliest staff. If they were open longer, I would have a burrito for breakfast, lunch, and dinner.", "author": "Craig B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "(3.5 stars) Guapo's, as it is called in my office, is actually decent for a work lunch.  Why do we call it Guapos?   Because the lady who greets everyone at the door calls all customers Guapo.  \n\nI used to think it was just for me, and right when I started to feel special, a really ugly guy right behind me got called Guapo also.   I knew it was too good to be true, but the food turned out to be pretty good, so I come back.  \n\nThe salsa here is good.  You can test it on some chips while you wait in line.  After that, if you eat there, you can have more at the table.  The place has a wide variety of tortillas, meats, and for you enthusiasts, they heat your tortilla on the grill, not in a steamer.\n\nWhat ever you do, don't get lettuce (I mean you can, but why...there is better stuff to put in there)  Adios Guapo!, or should I save that for the greeter lady?", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-11", "description": "Hello Guapo - if you are not greeted by these words then you might be in the wrong place.  The staff here is friendly, providing burritos made to your specifications and offering positive affirmation for the insecure lunch goer (I mean I know I'm a guapo, but it still feels nice to hear it).  The convenient location from work makes it an easy choice if I have a hankering for a burrito for lunch.  \n\nWhether you want to eat away from work in the outdoor patio in the back or take it back to your office, Victor's comes through with tasty above average burritos, delicious horchata, and some extra hot sauce by request (mmm, hot sauce).", "author": "Drew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "Pretty good, decently priced and such a quaint little island-type restaurant in San Francisco. Sit on the patio, it reminded me of Puerto Rico. Nice spot.", "author": "Angelic S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-27", "description": "You know what I love? I love a taqueria where I walk in and the hostess immediately greets me, calling me 'Handsome'. The hostess may refer to every man that walks through those doors as handsome, but that doesn't phase me. I know that I've got a special place in her heart...\n\nAmidst the bullshit Starbucks, Borders, and other franchises that seem to thrive in the soulless condominium hives of SOMA, Victor's stands like any other respectable taqueria does, a little greasy and a lot good.\n\nCarnitas in any form- burritos, tacos, etc.- is always good. I prefer this place to South Park's Mexico Au Parc.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "Dear Victor's Guapa Lady and the nice ladies who make the food,\n\nI am the most finicky Mexican food eater you will ever meet. I was raised with Mexican food from SoCal. I will never adjust to any 'super burrito' no matter how long I have lived here, so I just usually don't ever order burritos. Please don't take offense. \n\nHowever, the corn quesadillas (with meat of your choice) are sublime: with salsa, guac and dripping with grease, they really hit the spot. The horchata is not bad, the Mexican sodas are a treat. If you offered churros or Menudo, I could die and go to Heaven.\n\nThank you for opening on Saturdays; I need my SoMa Mex food fix and don't feel like trekking to the Mission.\n\nLove,\n\nGuapa", "author": "Akasha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "This place provides a better than average burrito at a good price. It is pretty much what I would expect from a hole in the wall Mexican joint. I have been searching my neighbor hood for a good lunch burrito and finally found it. The service is quite friendly and the ingredients seem a little more fresh than you would expect from this kind of establishment.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-18", "description": "I'm always trying to diversify my lunch routine, so I tried Victor's the other day. My tostada was flavorless and soggy, but I almost don't care. This place is run by Mexican mothers who greet everyone coming in the door with a iHola Guapo/a! They are truly the sweetest. I'm probably going to come back the next time I've had a bad morning at work just for the pick-me-up factor.", "author": "K M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-11", "description": "There is something strangely appealing about being called \"guapo\" every time I go here. \n\nThis place is your very typical Mexican burrito bar that populate the Mission by the dozens. The food is well worth stopping in for, if you are in a burrito sort of mood, and the salsa samples while you wait give this place an extra star for going the extra mile (even for a burrito place). \n\nMy personal favorite is the shrimp burrito on a spinach tortilla, but they have all the basic options of steak, chicken, pork, and stewed something or other. \n\nGood prices, good burrito to go, fast and very friendly service. Hard to argue too much.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "I get lunch from Victor's once or twice a week.\n\nTheir burritos are delish, and fully customizable*.  They're sometimes stingy with portions of certain ingredients.  Back when I drank Coke, I appreciated that they always had Mexican Coke in stock (real sugar, no HFCS!)\n\nIt's a pretty slow process during the height of the lunch hour, but no more so than at most sandwich places.\n\n\n*If you get a burrito, make sure you tell them to heat it up on the grill rather than the steamer.  Who wants a pre-soggy burrito?  Maniacs, that's who.  And you're not a maniac, are you?  Of course not.", "author": "Erik R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "It's okay. They make it for you quite fast and even though it was lunch time, they still let me order a breakfast burrito - it was good! The price is also pretty decent.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-23", "description": "A truly disappointing burrito experience.  A couple of my co-workers touted Victor's as a very good burrito place.  They must have been drinking on the job again.  The prices at Victor's are slightly lower than at my regular burrito eateries Luna and La Corneta.  Unfortunately the taste, the size and the quality are much lower.  The super burrito was smaller than most regular burritos, and they skimp on the rice, the meat and on the guacamole.  If you want fresh salsa on your burrito that's an additional charge for what amounted to two teaspoons.  If you like lots of beans you might like Victor's.  Too bad the black beans were cold and apparently the meat was only warm.  Why bother wrapping it in foil?  Three minutes after I bought it I bit into a cold burrito.  Ugh!  The oily house-made chips were good if you don't mind crunching on plain chips with no salsa.  Service is friendly.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-20", "description": "\"Eey, Guapo... you wan' that for here or to go?\"\r\n\r\nYes, here, I'm guapo. At Victor's, every guy is guapo, and every girl guapa - and why not? In here, life is beautiful! The girls are beautiful! Even the orchestra is beautiful!\r\n\r\nPractically a South Beach institution, Victor's serves up better-than-average tacos, burritos and quesadillas. The flavor of the pork is possibly the best in the neighborhood: the carnitas, al pastor and chile verde are all top notch and distinctly flavored. Considering that they have Mexico au Parc, Los Socios/3rd Street Grill, Tres Agaves and an on-again/off-again taco truck parked in the Limn parking lot to compete with, the fact that Victor's is always packed while Los Socios/3rd Street Grill has had to cancel their dinner service is a testament to them delivering what the neighborhood wants. Plus, they're open on Saturdays, something our neighborhood desperately needs.\r\n\r\nA super burrito or quesadilla runs between $5 and $5.50 - and with a Jarritos fruit or a mexican Coke or Squirt (grapefruit) soda thrown in, we're still well shy of $8.\r\n\r\nIf I could do half stars, Victor's would get 3.5 stars. Compared to other taquerias, the food is 4.5 stars. I would knock a half point off for not being open for dinner, and another half point for their tortillas, which are prone to tearing when stuffed full with burrito goodness. However, since I can't do half stars, the staff's warm personality and fast service are enough to have me round them up to a full four stars.\r\n\r\nOk, Guapo?", "author": "Avery G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "The food is ok. Just standard old school mexican food if you want a quick bite. Mediocre. Small portions. Be prepared to be encouraged to spend more on extras or getting the bigger size. If you resist, they will find a way to charge you. Each time I've been there the workers have tried to squeeze some extra money out of me. For instance, I ordered a small tostada, the first worker reached for the larger shell. I had to tell her again I wanted a small. I ordered the standard ingredients. When I got to the register, the loud woman said rang it up as a medium because her worker decided to put more ingredients on the tortilla (which wasn't even on the menu). That's not what I asked for. I know the neighborhood has gotten pricey since they started and rent may be high but I really wish they would charge what they really want to charge instead of making me feel jipped each time. I gave them many chances and never again. There are better places nearby.", "author": "Robbie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-25", "description": "You had me at Guapo (handsome)!  Victor's is average to good for burritos but where else can you go where you are guaranteed a \"Hello Guapo\" greeting every time you enter the place?\n\nInitially, you'll probably feel real good about yourself when you order a burrito from the Guapo Women behind the counter, and you get a chorus of \"Hello Guapo.\" After, you might even start wearing a suit or tuxedo to work just to get a more emphatic guapo or guapa at lunch but you'll soon realize that it's not really necessary.  They think everyone is handsome.\n\nForget to comb your hair?  Have a ravioli stain on your shirt?  Look like you haven't had a shower in months?  It doesn't matter.  The Guapo Ladies think everyone is handsome. You might even get annoyed when that person behind you in line, who looks like he just rolled around in the dumpster outside, also gets a \"Hello Guapo\" greeting but realize that the Guapo Women are equal opportunity guapoers and the loose use of guapo is for the greater good.  Everyone deserves a guapo greeting sometime.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-24", "description": "THE best burrito south of market. Period. \n\nYou're greeted with a smile at Victor's, the super burritos are perfectly proportioned and delicious. Not too much rice, not too much beans - a manageable meal that leaves you satisfied but not bloated. The courtyard in back is perfect for a few beers or a casual lunch. This is my go-to spot in the neighborhood, it blows the doors off Mexico Au Park. Stop in before a Giants games or on your lunch break. Nothing fancy here, but this is a family run joint which does a few things right and sometimes that's all that counts.", "author": "Vincent C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-18", "description": "Hola Guapo(a)!\n\nYou are greeted thusly every time you enter Victor's -- the friendly matron is always kind and inviting.  A small SOMA neighborhood Mexican dive, I've been here countless times for work day lunches.  The food is not of the highest quality, but it's very solid for the price and convenience.  Recommend the tortas & the large plate lunches.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-21", "description": "So from the front Victor's looks like a tiny taqueria. But once you walk in, you notice that there is a kind of hidden seating area off to the left. Then you go to the hidden seating are, and you see a corridor leading out to a very cool semi-hidden sermi-open air eating area in the back. It's super nice on a bright day, and they somehow manage to keep it warm even on the fiercest, chilly SOMA day.\n\nSo my Al Pastor burrito kind of sucked. The pork was bland and unflavored. That said, everyone else at my table loved their lunch. There was an order of a super Egg and Chorizo burrito, a veggie burrito, and a fish taco. \n\nNo beer :(", "author": "Nikhil B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-11", "description": "UPDATE!!!\n\nOkay, so I was desperate for a breakfast burrito and came back here against my better judgment.  I'm as easy-going as a roach when it comes to the mere appearance of a place, but when my iron stomach talks about the quality of food, y'all best listen.  The breakfast burrito made me throw-up.  As I ate it, I could tell the taste was off. Was it the bacon? Eggs? Was the cooking grease rancid? Were the preparer's bare hands dirty? I couldn't place my finger on it.  An hour and a half later, I'm spewing beans and cilantro into the toilet.  I could taste the grease on its way up.  It was off. Way off.\n\nPrevious review:\nNo amount of \"guapa\" will get me to eat here again.\nI LOVE Mexican food, and tortas and Al Pastor hold a special place in my heart.\nAt Victor's, a torta Al Pastor costs over $6 which is totally unheard of at other taquerias.  The moment I bit into mine, I realized they charge that much so no one will order it! The Al Pastor is a joke of stewed meat in watered-down sauce.  The bread was stale and doughy and they only filled it with about 1/8-cup of meat. LAME.\n\nI want to go back and try the mole, (even though someone in line called it \"mild\"--as if that's a good thing!), but even the salsa here sucked.  The tomatoes tasted canned, though I've been told otherwise. If they use fresh tomatoes, then my salsa fresca had been sitting in the fridge for a long while. I probably won't be back. On top of that, the lady assemblin' my samich used her bare finger to wipe the rim of the refried beans container and dropped what got on her finger back into the mix.  Why did I have to see that? (See my review of Truly Mediterranean for a similarly gross experience). Yuck!\n\nBetter Mexican in the area can be had on South Park. Go there.", "author": "N. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "I really don't know how you can not love this place. Ok, so the portions aren't HUGE, but with the way that burritos have been expanding lately, my waist-line thanks a restaurant that keeps the quantity of food to a reasonable LARGE. \n\nThe service really is, as everyone says, personal.  The wonderful women might only know me as \"guapa\" but they also know that I like my super burrito with camarones with 1/2 spicy salsa, 1/2 mild and that I don't like to speak Spanish but that I understand it. \n\nVictor's takes care of my Mexican food cravings during long work days far from the Mission. Best of all~  the cleanliness standards seem to far surpass those of most taquerias.", "author": "Kiira M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Good peeps who work here.  Burritos are alright not the best and not the worst but good enough to eat when in a mood for a burrito.  But lately I have been getting their tortilla soup and this is one of the bets soups in the world.  So much flavor and is perfect when you have a cold or just feel  miserable from the cold.  It is a family recipe of the owners and it is delicous.  I love the avocado, cilantro and onions added.  SO MUCH FLAVOR.  Great people here and delicious soup.  I am a big fan of Victors", "author": "Harry E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "Best burrito in SOMA.  \nI love this place and appreciate the great selection of meats (especially the Al Pastor).\n\nAlso, this is one of the few places I've seen Nachos on the menu.  Don't think of these as appetizer nachos as you get a full styrofoam container full of chips and all of the additional goodness.\n\nPrices are reasonable (~$6 for a super burrito).  \n\nDefinitely one of the top places for cheap eats in SOMA.  If you want to mix it up, try Primo Patio next door.", "author": "Joshua J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-13", "description": "She said I was number 23 on People magazine's \"most guapo\" list. Kind of a backhanded compliment...", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-04", "description": "Friendly service, decent Mexican less than 2 blocks from work. Definitely not up to Mission standards, but hey, for $5 for a veggie tostada the size of a bowling ball I'll take it.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-06", "description": "When you walk into Victor's, 98% of the time, you will be hearing, \"Hola Guapa/o!\" For someone who grew up in a Spanish-speaking home--it is a comforting touch to this little taqueria in the SOMA district (not to mention a little marketing genius--it definitely makes them stand out from the crowd). \nThe bad part is that I wish their food was a little better. That is not to say it is bad--it's fine--but that is it--just average. You could do just as well at any other taqueria. But when I went there, I did so because a) it was close to my job, b) i love salsa and mexican food (not in that order) and c) why not go to a place where they greet you so warmly. They are one charming place.", "author": "Lale G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "The woman who owns this restaurant really knows how to make you feel welcome. I also like that the burrito's are not gigantic. I had the chicken verde with black beans and it was tasty.\n\nOn a nice day, I highly recommend enjoying your meal on their covered back patio.", "author": "Nici G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-10", "description": "OK, some serious issues with Victor's. I'll cut to the chase: the reasons they get two stars and not one is because of the Guapo lady and the quite nice spicy salsa. Their major sins: the burritos are girl-sized, and the ingredients are all about room-temperature.\n\nI once dated a girl who liked Victor's because the burritos were \"girl-sized\". I am man-sized, and so what I get for the money is sub-par. The temperature of the ingredients does not make me feel confident I won't get the gastric equivalent of the 1906 earthquake, though I haven't been able to pin anything on Victor's. All in all, you can do much better somewhere else.\n\nSorry, Guapo lady. I do like you. Pity the food isn't better.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "Fish taco was one of the tastiest I've ever had, prepared as \"guapo lady\" suggested with nearly no sauce.  Quite surprising, really.  Shrimp was good but not as noteworthy.\n\nThe line down the street for lunch appears to be justified.", "author": "Hans G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-10", "description": "The running joke my husband and I have with this place is that we have to go when it's open - because it's NEVER open!  I don't know what it is.  Can our luck with this place be so bad that any time of day, any day of the week, it's always closed?\n\nOf the few times we've actually be able to eat there, their nachos with carne asada aren't bad.  My husband usually gets a burrito or quesadilla.  It's not the best, but it satisfies the Mexican food craving.  The ladies behind the counter are nice, but usually don't smile.  \n\nThis place is on my list of 'quick hits' for a fast meal.  We would go their more often, but it would help if they actually followed the business hours they have on their door.\n\nI'm guessing they're open during lunch hours on weekdays - but of course, that's not when my husband and I would normally go.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-08", "description": "So my boyfriend and I broke up this weekend (YES I AM REALLY SAD ABOUT IT THANKS FOR ASKING) and I was (half) joking that the one upside is that grief makes me lose my appetite so in the healing process I might end up being an even more mega-babe than I am (we all have to cope somehow.)\n\nANYHEY, This afternoon I was feeling like maybe getting a burrito and actually had a bit o' the ol' hunger (thank you monthly cycle! (TMI)), so I went to Victor's and got a veggie burrito.  The burritos come in two different sizes - regular and super.  I got a regular and it ended up being a bit smaller than your typical burrito, which I would have actually appreciated, especially given my grief-shrunken tumtum, but $5 seemed a bit exorbitant for a downsized version of beans+rice+guac+salsa+tortilla.  PLUS when I got it back to my office (which is only about 3 minutes away) the whole thing was lukewarm at best.\n\nBut I'll go ahead and give it 3 stars because even though my burrito was kind of lukewarm and a bit expensive for what I got, it DID taste fresh and the flavor was good (even if the \"spicy\" salsa was kind of embarrassingly mild.)\n\nOh.  And also because it was actually really helpful being called \"guapa\" today.  I might just keep going in there just to feel better about my loveless existence.  :'(  *cue music*", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-21", "description": "I love this little place. The burritos never let me down. They aren't the biggest burritos I've ever consumed, but they are totally filling for what they are. They're also cheap!! I especially love to come here in the morning before work and get the Veggie burrito on a wheat tortilla w/ extra salsa. Yum. Best breakfast! I think the burritos here are much better than any of the other Mexican places I've tried around this area, which makes sense considering it's a little hole in the wall. Everyone that works there is also incredibly friendly and they make a point of treating you like a person, not just another faceless customer. Like I said, I love it!", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-04", "description": "HI GUAPA!\n\neveryone is addressed as \"guapo\" or \"guapa\" here. which means handsome or pretty in spanish. i didn't even think i looked pretty today at all. in fact, i've had waaaay better days.. but she called me guapa. so for the next few days, until i'm tired of burritos, i'll be eating here to get my quick \"food in a tube\" spinach tortilla burrito with black beans and fresh avocado and a little ego boost. gracias guapa!  \n\nBYE GUAPO!", "author": "Renae C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "I love Victor's!! The owner, Guapa lady, is so charismatic!  She reminds me of the lady from Modern Family.  Anyways, I am a huge fan of the vegetarian burrito and spoil myself silly  by making it a point to eat here a little more often than I should.  The salsa is YUMMY!", "author": "Sonia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "what i had was pretty bland , the woman screams as you walk in lol but its a cool place.", "author": "Ashana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-18", "description": "This can turn the beat around the morning after a drinking session. And God bless the lady at the till who calls me 'guapa' with  yesterday's mascara and bed sheet marks on my face! The chili rellenos and a Mexican Coke (that magical elixir) takes me off the obituaries and back onto the front page. \n\nOK, well maybe the couch.", "author": "Cheryl M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-17", "description": "Well i was rolling thru the neighborhood doing my routes and i noticed people waliking into this place as my truck was getting unloaded across the street. so i decided to check out this mexican food place called victors. \n\nman , did i strike gold. the had sopes, which i could never find at too many places. and man the pork was off the hook . this place has by far the best pork . not sure what the secret recipe is,the guapa didnt want to tell me. \n\nbut i had a great meal at a great price and now i have found a great place to eat on my route. i highly recommened it to anybody looking for a great deal on some great food. try the pork for sure. and the salsa and chips on the counter while i waited for my food was great\n\n\nnice place. will be back for sure", "author": "miguel f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "Tasty food, and friendly staff. How can you not like being called 'guapo' every time you visit?", "author": "J. R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "The real standard for a good Mexican restaurant is if they have coke in a bottle imported from Mexico. I think they put crack in that stuff. \n\nI go to Victor's for the al pastor torta. It's a spicy, savory indulgence, much like myself.", "author": "Ricky J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-02", "description": "uno regular beef burrito...no beans por favor..mucho rice....spicy...$5.64....what better time to write a review than now..while eating a victor's burrito as i type....first bite...seasoned well...(tad bit salty, but still good)....the tiny chucks of jalepenos brings some heat to this burrito....burrito is a bit dry....and beef is bit tough...i saw the sign \"hot sauce $1.00\"...maybe i should have gotten it to moisten up the burrito a bit more....next time.....oh...i have thick crunchy tortilla chips in the bottom of my brown bag...mm...where the heck is the salsa?....oh well...\r\n\r\nprobably one of the most ghetto burrito joints in the city (more than the mission)....and this is south beach~!....they offer regular or super....(i'm starting to think this is a norcal burrito joint thing).....\"regular or super?\"...haha...anyways....it's an okay burrito joint", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "I love breakfast burritos and they're good from this place, but haven't tried anything else.  I always get the chorizo & eggs, complete with rice, refried beans (or pinto if you'd like) and the works minus the guacamole for me.  Check 'em out.", "author": "Emy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "Victor's is my home away from home, where everyone knows my name (it's \"Guapo\"). They are the benchmark I use to decide where to have lunch, because any alternative has to be more compelling. Victor's is a trifecta of fast, good, and cheap. I love Victor's so much I have to limit the number of times I eat there!", "author": "Ian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-28", "description": "Hola guapo! I've been coming here for years now. Top-notch burritos and friendly staff. Things are a little expensive, but hey, I get it - you're two blocks from AT&T park.", "author": "Jon M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-04", "description": "Having lived in both socal & mexico, i guess ive developed quite a good sense of what REAL mexican food is. First of all, you can tell a good mexican food joint by their salsa & im almost positive there's is mild pace picante sauce! A true burrito doesnt consist of 50% beans and rice, but being from north of the border we're used to that. Even so, why was the brown bag in which my burrito came, sopping wet with beanjuice?? I used a good 10 napkins cleaning up. I give this place 2 stars bc the owner means well & is bonita with her \"hola guapa!!\". All in all, SOMA should work on some better mexican food joints.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "hola guapa!\n\nI love the fact that they remember that I order extra sour cream on EVERYTHING.  and they don't skimp.  that alone warrants 4 stars.\n\nUPDATE*\nBreakfast burrito.  Get it.  Grub it.  Love it.  I know I do.  So clutch on a slow morning at the office.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-28", "description": "Ingredients to good Mexican restaurant: \n1. Bossy Mexican woman speaking Spanish..... check \n2.Everything from Chilaquiles to Huevos Rancheros... check \n3. Hot is HOT when you ask for it... check \n4.Hangover brunch for 2 within $20... check. \n5.Decent salsa... check\n\nIs there anything I am missing? I think Victors has all of the above :)", "author": "Pooja S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "The fourth star is for longevity.  And shorter lines -they are so damn fast these days.  And for the outside seating.  And the big friendly smiles.  \n\nThe chicken mole is consistently better than the grilled chicken which can get dryyy.  If you want spicy, say *extra* spicy  as they make it - you won't regret it.  Hotter still are the lovely double condiments offered on each of the tables.  Salsa and thin red hot sauce.  \n\nThe one bad thing that ever happened to me here (since 1987) was that the carton of milk was bad in spite of the expiration date being days away, not their fault!", "author": ".Hazel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-19", "description": "Hola Guapa! You can feel the love at this place as soon as you walk in. The owner is super nice and funny. I'm a regular here and the lovely ladies behind the counter always know what I want. My only complaint (and this is recent) is the newest employee who doesn't know how to properly wrap a burrito. I try to play stupid when it's my turn to let someone else go ahead of me, but I guess other people have caught on that she can't make a proper burrito.", "author": "Adelina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-10", "description": "I visited Victor's yesterday after wandering down The Embarcadero (then King St.) to get my hair cut at SuperCuts.  As I sunk my teeth into the chille verde chicken burrito with black beans, rice, avocado, sour cream, mild salsa, cheese, and other goodies, I was in burrito heaven.  \n\nI used to eat here weekly when I worked for a nearby company. There food is very fresh, not much grease (not enough to complain about), and friendly service make this one of the top taquerias for this guapo.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "I LOVE this place.\nI work in the area, so it's great to be able to get a very decent (and I think huge) burrito or a killer salad.\nIt's totally Americanized Mexican food, but it's far from Taco Bell!\nTruth be told, I could eat here everyday, and I'd also weigh 1'000 pounds!!!", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "You go there and they call you guapo.  You order your burrito, it's fast and it's cheap.  Did I mention they will call you guapo?\n\nWhat else could you want then to get a decent burrito and a compliment all in one go?", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-29", "description": "Who doesn't want to be called \"guapa\" 30 times in 10 minutes?  I wanted to take the lady at the counter with me when I left - such an ego boost! \n\nSeriously, though - the food is pretty standard - nothing too extraordinary but good...but the service is what makes you want to come back. Cheap prices too. And they carry Jarritos...btw - you can't claim to be an authentic burrito joint if you don't have Tutti Fruitti Jarritos. You just can't. So yay for Victor's!", "author": "Kate S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-20", "description": "The staff is very friendly, as well as enthusiastic.\nThe prices are a little high, but most things are in SOMA.\nA burrito runs you about $8.00 depending on if you want all the fixins.\n\nI think the taste is pretty good,  but grab a napkin cause they tend to goo out on you.", "author": "C B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-20", "description": "I love Victor's. They're so friendly - they call everyone guapa & guapo.\n\nI used to work in China Basin/Mission Bay so I was a regular here for a while but now I'm not, I miss it.\n\nI just went back and I had a really good quesadilla. I usually get burritos and I wanted something lighter. I'm sure it was lighter but it wasn't light so I was still stuffed.", "author": "Glenn G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-21", "description": "Guapo, guapo, guapo.\n\nShoot me.\n\nI'm starting an anti-Victor's faction. We will get our burritos exclusively from Mexico au Parc, which is nearby and, to my handsome palate, much tastier.", "author": "robin s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-25", "description": "This place has decent food (but for some reason, my coworkers swear by it).  3 stars for the food alone.  But as has been said, the service is amazing - very friendly, if not a bit hard to understand at times (and I speak a little Spanish).  Plus, you can't beat a \"Hecho en Mexico\" Coke - pure cane sugar rather than high fructose corn syrup.  They get the extra star on personality and good, quality food provided consistently.\n\nIf you order a burrito, get it \"super\" for sour cream and guacamole.  Also, try the salsa (in a ceramic hat dish, surrounded by chips as you're going through line), which you can ask for more of if you're staying, or pay to have some to-go - it's quality stuff.\n\nThe covered \"outdoor\" seating is a nice option for some diffused sunlight without wind, rain, or snow.  Enjoy, guapo!", "author": "Nate L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-03", "description": "I've been faithfully going to this place for a while because they are nice but they have disappointed me for the last time. Their food is kinda expensive! I ordered breakfast burrito with eggs, ham, extra: nopales. What did I get? An egg nopales and rice burrito. Who puts rice on a breakfast burrito? And WTF is my HAM! Not the first time they've messed up my order. I don't think I will go there anymore--disappointed me for the last time!", "author": "Mayra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "I am a fan because SOMA lacks good Mexican and I NEED good Mexican. My company took me there for lunch and I was so happy to find a hole in the wall in such a new part of the city. The woman working the register always greets the customers with \"Hola Guapas (or Guapos)\", making you feel like you just walked into your grandma's kitchen (or maybe just mine). The food is priced well, so I can't complain. I keep it pretty simple,  with a bean and cheese burrito. While in line to order they always have chips and salsa to hold you over- Mucho gracias! \nMy favorite is the outside patio. It is a nice escape from the surrounding park-less neighborhood.", "author": "Allison B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-28", "description": "The people who work here are ultra friendly.  \r\n\r\nI recommend paying an extra $1 for extra hot sauce.  Definitely worth it.", "author": "Suzanne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "They say that the quality of a burrito is inversely proportional to the sanitary condition of the establishment it is prepared in.\n\nIf this is the case, this place has really good hard tacos.\n\nThis is the case and the service is friendly.", "author": "George M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-30", "description": "This is probably my favorite burrito in the city.  Its so good that even after my office location moved from just down the street on Townsend to the FiDi, we still make trips across the city for these burritos.  My entire team turns in to teenage girls at a Bieber concert when I announce in the morning that I will be making the mid-day trip.  What makes these burritos so special?  It is the salsa.  They make this hot salsa that I could eat in buckets.  In fact this time we asked for a large container and they gave did give us a small bucket which my team devoured in minutes. Everything I have ever had there seems fresh and I have never been disappointed. The lines can get long but move fairly quickly, and you can call ahead and pick up. They also have a nice enclosed patio area that is great for nice days.", "author": "Heidi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-01", "description": "I love it here! The warm feeling being inside and the best Choncha ever!!! Chili Verde is off the hook here too. Great to bring to a Giants game!", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-21", "description": "The food is delicious and the service is friendly.  The owner greeted me with an \"Hola, Guapa!\" and checked in with me several times to make sure I had everything I needed and my meal was satisfactory.\n\nI am a big fan of tortas, and was not disappointed by this one.  I got the Torta de Milanesa de Pollo with jalapenos and everything else, lettuce, tomato, onions, cheese and avocado.  The bread was fresh and the chicken was on point.  \n\nCan not wait to go back and try other items on the menu!", "author": "Frances R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-09", "description": "Great little burrito joint a block away from SBC Park.  I always stick to the burritos, so I can't talk much to other menu items.  Burritos are the best that I've found in the city and I love their salsa verde.  \n\nThere are a couple drawbacks though.  The lunch line can be a bit intimidating, but it does move pretty quickly.  They charge for sides ($.75) of the salsa.  They say it's for the container and I find that a little chinsy.  They are closed on Sundays.  Still my favorite and love that it's close to home.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-27", "description": "I've been getting the grilled chicken burrito at Victor's for about seven years now--although not as regularly after their renovation. I love that they chop up the chicken breast right in front of you. It's smaller than your regular Mission burrito, but that's probably what's so great about it--because you can eat all the way down to the butt of the burrito and not feel like you're going to barf!\n\nOutdoor seating is always a plus in this city!", "author": "sarah s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-03", "description": "Feeling a bit low on self-esteem and looking for an indulgent, guilty-pleasure to soften the blow of the drudgery of your workday?\n\nVictors offers an antidote... Lard laden burritos and tacos with plenty of sour, cream, guacamole and rustic style chips all served by hustling staff who refer to customers as guappo or guappa. Side effects include: close to terminal food coma, and a brick-like feeling in your lower intestines, and a sense of shame you haven't felt since your last confession.\n\nOn your first visit, you may get the impression that the hostess truly believes you are \"el guappissimo\", but soon you catch on that everyone is guappo at Victors, at least in the proprietor's eyes. \n\nIts a cheap trick, but an effective pick me up for your ego considering you are about to tack another inch on your waistline with this run of the mill Mexican fare.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-02", "description": "Went to Victor's for a quick bite because I know I can always count on a solid burrito.  If parking weren't an issue, I'd be there more often.  But anytime i'm on my way out of downtown near lunchtime I find a way to get in here, specifically for the carnitas.  Slightly crispy on the edges and relatively lean, it's the perfect burro filler.  The super friendly guapa at the register makes sure you're greeted with Hola Guapo(a) and feel at home.  Only downside is atmosphere, but the place is clean enough.  Glad to see mijita hasn't taken a bite out of the business.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-28", "description": "5 stars for nachos but 3 stars overall considering the finery of SF eateries. I loooove Victor's. The staff has never been anything but friendly and nice to us, and the admonishments to keep moving are 100% appreciated by anyone in line behind you. \n\nI can't stop loving the nachos. The hot sauce is excellent, the beans are salty, the chips are substantial and stand up to whatever you order, and they will load up the jalapenos if you ask them.  Yum!  \n\nEating in the back seating area reminds of of being in Mexico. It's no garden and the seats are rickety, but it's authentic.  The drinks in the cooler are lukewarm. This is quintessential SF uniqueness.", "author": "Paris E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-15", "description": "As much as I like the way Victor's is set up with the ladies there running the line, calling everyone \"guapo\" and the line moving decently fast, its only an ok place. Sure, the service is nice and they greet you right away. But, the burritos there are average to below average, not as tasty as other places. Sometimes its not as hot as it should be and afterwards I often ask \"why did I pay so much...\".\n\nIf you need to get out of the office, there is seating available. Overall, Victor's is just best a quick stop for a short lunch, but nothing more.", "author": "Ivan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-23", "description": "I've had the burrito and fish taco.\n\nBoth were OK, but if you can't make it down to the mission this place will do.", "author": "Po L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-16", "description": "Most tasteless chimichanga I've ever had, and I'm including the microwavable ones you can get at 7-11.", "author": "Mason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "The people are super friendly here and welcoming. They always greet you with a \"Hola Guapa/Guapo!\" There are a lot of options, but I usually just get a couple of tacos and I get extra chips. :) \n\nThey have indoor seating as well as an outside covered patio, which is great on a nice day. Unfortunately, after sitting there and eating the great food, I usually feel like taking a nap right after. \n\nThe only disappointing thing is probably just the long line, but it is well worth the wait.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-06", "description": "Very much a takeout place to grab a quick bite for lunch - I quite enjoyed my chicken burrito although it did start to fall apart dude to a little too much soggyness.  The salsa was really tasty and had actual chillies in it which gave it an awesome kick.\n\nGenerally I thought this place was good and quick, wouldn't say it's the best mexican I've ever had but tasty nontheless.", "author": "Planet K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "Don't pay any attention to the bad reviews, I love their burritos!\nThe staff is super friendly and always happy and up beat.  They have a spicy roasted salsa that is killer and their food is cheap and good.\n\nWhenever I have the chance I stop in and chow down.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-17", "description": "Hola Guapo!  This place has the best burritos that we have found in San Francisco and we have looked all over.  They will serve your burrito with straight avocado if you don't want guacamole which is a huge plus.  The chicken is very good quaity.  I think I could eat it every day.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-20", "description": "Not the best burrito and they are very small too. The customer service is hilarious because they call everyone \"guapo!\" but thats where the fun stops. They use costco-bought guacamole, which is a crying shame in a city like SF. I'd go here if I was in a hurry and starving before a Giant's game, but that's about it.", "author": "Darius T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Hola Guapo! One of my favorite places to eat at lunch. They give me anything I want, the tacos are tasty and fresh, and service is quick. Can't go wrong here.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "Friendliest place around! One of my favorite places to go for lunch - affordable, authentic, fresh, and delicious. Service is always with a smile and they remember their repeat customers.", "author": "Lina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-19", "description": "Nice people and good service but the food is somewhere between average and below-average.\n\nI have yet to order the cheese enchiladas and receive them with anything but cold, unmelted cheese in the center.\n\nIf you like mild Mexican food, you will probably like Victor's.  \n\nThe only reason I am not giving them one star is because I realize taste is subjective.", "author": "james b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "With the less than stellar number of food options down here for lunch, I find myself going here a good amount.  Of course it is the closest burrito joint to my office so that makes sense for a guapo such as myself.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "Growing up in SoCal, I'm very picky about my Mexican Food and this place is great. I really dig their Torta. They have fantastic food, and the have a perfect food safety score (100).", "author": "Cory C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "hey they have pretty darn good carnitas (that's my gold standard) and the fish tacos?cooked to order! really good fish tacos. They aren't the so-cal style of breaded fish, though. The fish is sauteed with garlic and stuff. Deeelish.", "author": "Dana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-19", "description": "The food is cheap. The ingredients are cheaper!  At least they keep the cost down.  A $4 burrito is worth what you are paying for it at Victors.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-20", "description": "Decent tacos (one soft, one hard) with Carnitas which were nicely cooked and even had some crispy edges. Besides the friendly service, the backyard patio is another great reason to come here and enjoy some sunshine during lunch...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "Hola Guapo! This is a beautiful way to be greeted every time you walk into a place!  Alright, after the ego boost lets get down to food.  I eat at his place at least 2-3 times a month because its near the office.  This place has really good, cheap Mexican food - no fuss and no frills.  If you want some better ambience and don't care about the food, go to the Mexican place the Creamery just opened.  If you want authentic, street food come here, grab a seat, grab a bowl of salsa, sit down and eat!\n\nThe only reason they didn't get the last star - their salsa is good not great, for great Salsa go to Chavez also in the Mission.\n\nAdios Guapo!", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-26", "description": "Excellent mexican food at great prices.  This is an especially great place for lunch.  The owner greets everyone and sets a welcoming, friendly mood.  The hot salsa is especially good - ask for extras if you are getting an order to go.  By default the food is not very spicy, which seems to turn a lot of reviewers off.", "author": "Justin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-29", "description": "The food here is absolutely revolting. I used to work around the corner from here and had a breakfast burrito with a co-worker one morning. It was not a fun day stomach-wise after that. I've never had a kidney stone, but I think the digestive experience after eating at Victors might compare. Also I've never seen anywhere else charge for Salsa. With all the mexican food options, why would you eat here?", "author": "Jay S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-13", "description": "Great tortas and steak burritos=)  Good when you're on the go and want some authentic mexican food.", "author": "Joella A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "Victor's has great food - and they're very friendly, too.  If you don't know what \"guapo\" means, go to Victor's, and the owner will make you feel right at home.  She calls everyone \"guapo\" or \"guapa\" (good-looking), and before long you think it's your name.  Nice patio in the back for sunny days.  The indoor seating area is simple, but nice.  Pricing is what you would expect given commercial rents in SOMA - the food is as good as the Mission, but the rent is higher, so the food is too.  But reasonable.", "author": "Chad H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-29", "description": "super nopales burrito (no rice/hot salsa) on a tomato tortilla = mana from heaven.\n\nmost definately the best non-Papalote burritos in town I'd say. I work not too far from Victor's, and the neighborhood joints pale in comparison. no rice is key, as you can actually ingest an entire burrito without falling deep into a food coma afterwards.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-16", "description": "I wandered in here for lunch with a girl friend one day when Primo's (next door) was closed.  My disappointment quickly melted.  Great food and don't overlook the warm, sunny, covered patio.  I got the chicken enchilada plate and ate every bite.  The lady at the register was just charming.  \"Hey Guapa! It's comin' up!\"  I'll be back!", "author": "Amy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-22", "description": "Very disappointing, I must say. I paid $5.25 for a super burrito that was smaller than most regular burritos (not that I need to eat that much, but we are talking about value here!). It would have been okay if the burrito was very good, but it wasn't. It wasn't terrible, just not good. I miss the $3 SuperTaq burritos from San Jose! I guess I'll just have to trek over to Mission to get good burritos.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-21", "description": "Victor's is a solid Mexican eatery.  Nothing over the top but they make a good Al Pastor burrito and it's handed to you by a woman who calls you \"Guapo\" like she's your mother.  Not much of a place to hang out and eat so much as a really good pit stop.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-24", "description": "todos son guapos en victor's!\n\nguapos and guapas wait in line, sampling the chips (which are sometimes a little stale) and salsa.  most people order meals to go, but there is an outdoor seating area to take advantage of if you choose to dine in on a nice day.\n\nthe posole is decent, and the chorizo and egg burrito is ok.\nthe torta is the best out of all that i've tried, but i've definitely had better.", "author": "Ting A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-22", "description": "other than the signature greeting everyone receives here, victor's is an establishment i visit really only because i work in soma and have no other mexican options without a walk to mexico au parc in south park. sometimes i'm just too busy for that, because i'm an important man with places to go and people to see!\n\nwhen i go to a burrito joint, i don't need all the nonsense on their menu other than burritos and tacos. and when it comes to tacos, i want those little soft ones, not the taco bell sized tacos - that's just not right. victor's does do this right, but my biggest complaint, other than being yelled at to \"keep moving\" by the owner/register woman, is that, because victor's is in soma, they feel the requirement to charge lambroghini prices for ford quality. that's right, i just compared mexican food to italian supercars.. in her defense, though, the more you frequent this place, the less she yells at you, if that is any sort of motivation to return.\n\np.s. don't drink the horchata. they can't seem to get it right.", "author": "Jeremiah W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-16", "description": "Decent Mexican food, mostly takeout fare.  Seems to cater mostly to the lunch takeout crowd, and tends to be busy around that time.  Try their burritos, and they have good chips and salsa.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-13", "description": "This place has delicious breakfast burritos, but the rest of the food is average.  I give it an extra star for the friendly and entertaining owner who enthusiastically greets all her customers.", "author": "Patrick N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-18", "description": "Nothing special other than it's the spot to hit up for a quick burrito fix, since this seems to be the only taqueria in the area. I could do without the chips and the salsa they charge 50c for. It seems to get really busy during the lunch hour. I must know what they're ordering!", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-16", "description": "I like it!  I like how many varieties they have on the menu (cactus burrito!)  I like how fast the service is and how lively the staff is.  BIG HAPPY FACE.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-28", "description": "I like a nice clean and tasty chicken taco. Victor's place has the best Tacos in all of SOMA.  This is my weekly lunch go to when I need some comfort food and a real cocoa cola. Cute lil patio to boot - which makes it an excellent get the hell out of the office for lunch excuse. Friendly if not sassy service.", "author": "JJ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "When my coworkers and I want a quick lunch or can't think of anywhere else to go, Victor's seems to be the default choice. Don't be deceived by the line - it moves quickly and you'll have your food within 10 minutes, even when the neighborhood is overrun with baseball fans. Prices are reasonable for the area and the patio is nice.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-31", "description": "i went in during lunch time, when the food is supposed to be the best.... but\n\ni had a super salty grilled chicken super burrito and super stale chips. everything was runny and their salsa is suuuuuuuper hot. \n\none star for being fast\none star for being overly happy- guapa!", "author": "Heidi J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-21", "description": "Awesome cheap Mexican food. Very quick, excellent service, and mmmmm tasty!  Gets busy for lunch, and the patio gets hot in hot days, but the burritos are awesome!", "author": "Iggy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-14", "description": "I've been coming to Victor's for 8 years now!!! Best burrito in town. Not as big as most others in SF but it has a very special place in my heart. Try their spicy salsa...and you'll be hooked for life. I should probably get a plaque on the wall or something for my loyalty. I must have spent (not hundreds) thousands at this place.", "author": "Gustaf A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "My #1 reason for liking this place is the fact that the lady who runs the joint yells, \"Guapa!\" when you walk in.  Heck yes I'm gonna be partial to any place that calls me purty!!!  It's near my office, so it's muy convenient.  I loves me some nachos!!!!", "author": "Charlene E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-24", "description": "Well, I guess I had to try it once.  Thoroughly uninspiring burrito dive whose super burrito occupies one tortilla, is served up stale, and the chips are very hard.  Can't think of a reason I'd come back.", "author": "Apollo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-13", "description": "Great service and bountiful portions at around $6.  This place will get you in and out in 5 minutes no matter how intimidating the line might be.  Enjoy... but beware the inevitable afternoon crash after such a feast.", "author": "Ryder M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-25", "description": "Not the best burrito in town but decent enough to satisy your craving. The staff is very nice always smiling and they have outside seating.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "3.5 stars for the amazing artisan-quality salsa roja.  I love both the mild and hot varieties.  Never found anything quite like it anywhere else.  The rest is your standard SF-style burritos and stuff, but served up with comfortingly consistency and always amicable, speedy attention and reasonable prices.  In fact I don't know that I've ever ordered anything here besides burritos, so don't get all mad and shit if their tacos aren't up to snuff.  Because I wouldn't know.  I live in the Mission so there's not much reason for me to hit up Victor's anymore, but when in SOMA, I do make a point to stop in and say hi.  The line can get long but moves quick.  They also offer nopales (cactus) as a topping, which a lot of places do not.  Kind of an acquired taste, great in burritos.  And yes they love to dole out terms of endearment to their loyal customer base.", "author": "Molasses C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "Yummy, fast, cheap, friendly! Definitely a great find. They should really put a better sign up on the oustside perhaps something that sticks out off the building. The only bad thing about this place is that it's not open late.", "author": "Frequent D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-04", "description": "i am sure the owners of victors are lovely people, and they probably work very hard. However, this does not make me like the food any better. The one time i was there, they were very nice. but i was not happy with the nachos i ordered. i wouldn't order them again.", "author": "Violet C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-21", "description": "people who work in soma usually prefer their burritos from one of two places, victor's or taqueria el parque.  i love the restaurants of south park, but growing up mexican, i grew up eating in banged in the wall taquerias, from taco trucks, and sometimes from the mercado, not some chi-chi joint.  so naturally victor's holds some nostalgia for me and the ladies are super friendly (hola guapo/a!)  while at el parque, they are just there making your burrito-no connection.\n\nwhat makes victor's even better?  i work at 7am and sometimes i want a breakfast burrito or chilaquiles or chorizo con huevo for breakfast.  i called just before 8 today to ask when they opened up because i didn't want to intrude like an impatient commuter.  SIX THIRTY AM!  i am so happy to know that i can now get off of muni and grab my burrito and head into the office.  victor's . . . i love you!", "author": "Wendolyn A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-21", "description": "Victor's offers basic, decent Mexican fare. I enjoyed my veggie burrito. It wasn't overfilled to the point of attacking me, but it was just a basic burrito. No special fixins here, and the prices are more expensive than you'd expect. Be prepared- the ladies behind the counter will refer to you as guapa/guapo!", "author": "Bee H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-21", "description": "The food taste like it's a couple of days old.  It's expensive for canned food.  They also charge for salsa.  Go to Mexico Au Parc.  Everything is fresh and their horchata is really good.  It's not from a powder.", "author": "B A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-29", "description": "The best burritos in this SOMA area, but they don't have very stiff competition.  This place gets crowded during lunch and the line often goes out the door.  Much better than Mexico Au Parc, however.", "author": "mark l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-14", "description": "very friendly staff, but terrible food.  I am from the central valley of california where there is mexican food in abundance, and this place doesn't cut it at all.  overpriced, watery guacamole, barely spicy, beans have been cold everytime. any taco truck you can find anywhere is better.  I have been there for lunch a few times and breakfast too trying all different things here because it is right next to my office, but there is nothing in here that was any good.", "author": "jason t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-07", "description": "Great place to grab a quick bite. I only wish they stayed open later and were open on Sundays. And who doesn't love to be called guapo?!", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-06", "description": "Friendly, fresh and fantastic. This place is low key, hole in the wall, not pretentious, and serves fresh food prepared with love. Everyone is so friendly. I love Victors. You should go...", "author": "rebecca p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-11", "description": "This place sucks. The only reason I give it two stars is for the chorizo breakfast burrito (with potatoes!) and the friendly service. Really, I'd prefer good food over friendly service. The burritos here are bland and chalky in texture. They are cheap, but you get what you pay for as they are tiny. The chips are like burnt cardboard, and they charge for sides of salsa. To top it off, the lines are often out the door. I can't really understand the positive reviews, but each to their own I guess.", "author": "Josh T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-04", "description": "no wonder they are so nice here, what a rip off.\ni leave wondering what i just paid 6 bucks for everytime. i bet its a dollar for every \"guapo\" i get. i'd gladly exchange the guapo for some salsa with my chips.", "author": "schitzen h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-19", "description": "Unsanitary. Server making burritos did not use any gloves, or wash hands after handling cash. Old, dried out chicken used in burrito. Soupy guacamole. \n\nOn the plus side, the service was friendly and prompt.", "author": "Robert K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-23", "description": "Victors has great service and a friendly atmosphere - HEY GUAPO!\n\nThe food is just your average Mexican fast food - nothing special. One time I got my burrito back to the office and it was soggy and soaked through the tortilla! Nothing could be worse! \n\nHey have a good selection of fillings and four kinds of tortillas. The place seems reasonably clean.", "author": "Darren B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-12", "description": "The staff was very enthusiastic about their food, but honestly, it was slightly below average.  I ordered a burrito and the meat was not that great.  The burrito as a whole seemed to be dry.  With all the taco trucks in the area, I wouldn't return here!", "author": "Nick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "Victor's is easily the best Mexican place near the ballpark (although the Crispy Tacos truck is giving it a run for the money) -- very straightforward, reliable food at a good price.  And it always boosts my self-esteem to have all of the ladies call me \"Guapo\" -- even better than Cafe Gratitude.  Highly recommended!", "author": "Ed K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "Best Chicken Mole burrito I've ever had.  I LOVE their beans.  Lot's of flavor.  I've tried the carne asada, chicken mole and the grilled chicken.  All very good.  My friend always gets the chicken enchilada meal and really enjoys it.  I don't know what people are looking for in a Mexican restaurant, for me it's all about the beans, rice and chicken and these guys have that DOWN.  I will say that I wish they'd upgrade their pico de gallo but other than that this is one of my favorite Mexican joints in the bay area.  I've been coming here since AT&T Park was built.  It's just as good now as it was (Good Lord!) ten years ago!  I love being called Guapo!  The owners are always cheerful and fun to talk to.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "This is across the street from my office and I go about once a week. It's quick, inexpensive and delicious. My standard order is the pork chili verde super burrito. It comes with great homemade chips. Mmmmmm...", "author": "Zach S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-29", "description": "Definitely not worth it.  The burritos are small and the price is not that great.  The burrito was bland and the rice was greasy.  I will not be returning.", "author": "Sheeva G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-04", "description": "Terrible. Worst burritos ever and bad service. I can't believe people actually wait in line for this slop. Chavo's is down the street and is cheaper and tastier and the service is great there. Do yourself a favor and walk down the street.", "author": "Saikat P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-02", "description": "Victor's is a marginal taqueria at best. Most recently I ordered a grilled chicken tostada. They use a tortilla bowl, which is fine, but it tasted like cardboard soaked in grease. After filling the greasy shell with less than adequate portions of beans, meat, lettuce and cheese the lady asked me if I wanted sour cream and guacamole. All other taqueria's that make tostadas this style usually include those two things in the price. Here they are a dollar extra. Had I known, I would not have ordered it, not to mention the guacamole looked like green soup. The burritos are only slightly better. Really the only reason I think people go to Victor's is because of the lack of taqueria's in the SOMA/Southbeach area. Also, the proprietor is one of the most annoying people you will ever meet. Expect to hear her call everyone in line \"guapo\" at least 5 times and then bark an order at the next person in line. At any given visit you will most like hear the word \"guapo\" yelled 50 times or more. You may think the guapo thing is sweet the first time you go there but trust me, it gets real old real fast. I don't think I will be going back here again despite how close it is to my office. If you are looking for a good taqueria go to the mission or take a trip down to San Mateo.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-08", "description": "5 stars for the homemade horchata, perfect tortilla chips, and quick but charming service.\n\nno complaints about my super veggie burrito habit either.", "author": "katulka r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-08", "description": "I work in SOMA, and must say this is one of my favorite spots for lunch in the area (it's a hit at my company too). LOVE the staff, and just overall dig the vibe of the place. The price for a regular old burrito isn't to bad either. Granted I've had better burritos in my day, but thats okay, this place gets an A in my book.", "author": "Tony H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-03", "description": "Ordered a chicken mole burrito and got boiled chicken instead.  The cashier tried to convince me that it was a different kind of mole but there didn't appear to be any sauce on the chicken at all.  Perhaps it was a different kind of mole, but in the end it was either terrible service or bad food", "author": "Nathan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-29", "description": "I would like to say this place is the shit. I work in San Francisco and all of our employees order all together and everytime we order the food is great. Not only is it great but we A CTUALLY get everything we order. I really recommend this place.", "author": "No Need T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-20", "description": "i think this is the best taqueria, the  burritos are delicius and the nachos the best, plus is no that grease food like other taquerias  and the costumer service is  the best", "author": "Beatriz I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-26", "description": "The only time I ever go to Victor's is if the line is too long at Primo's next door.  I agree with others that Victor's is a quick fix for Mexican food.  I think someone summed it up well...\"it is mediocre at best.\"  What compelled me to write a review was an incident on my last trip to Victor's.  It was late afternoon and I was starving.  For some reason I craved for a burrito with all the trimmings and other places were closed.  When I entered Victor's, the lunch crowd was obviously gone as there were only two women behind the counter.  Both were cleaning vigorously as I guess they were in a hurry to go home.   I asked for a super chicken burrito and one of them sprung to action in preparing my meal.  She tossed the old rag aside and proceeded to cut up strips of chicken and heated up the tortilla....all with her bare hands.  She did not wash her hands nor did she put on gloves.  She continued with the cheese, lettuce, and salsa.  I kept thinking that my stomach is pretty resilient so I should be okay.  Besides, I was really starved.  When she finished wrapping my burrito, she took my money and gave me back change....again with her bare hands.  How much money did she handled prior to making my food?  I walked back to my office anxiously waiting to feast.  When I unwrapped the foil, I took the first bite with some hesitation.  I couldn't believe that I would actually take such a risk to overcome hunger.  I got angry at that point....not so much at Victor's but at myself for allowing it to happen.  I stormed back to Victor's and demanded that I get my money back.  The woman had a poker face and refunded my money without protest after my brief venting.  I vowed never to go again.  However, if you must, make sure your food is prepared with clean hands.", "author": "Paul C."}
