{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Although not super inviting from the outside, we loved this place. Our server was kind and the fresh rose on each table was cute. We loved everything we ordered and will definitely come again. We tried the medium and medium to spicy, and I think we would prefer all our dishes medium to spicy next time. Naan was soft and crunchy, perfect.\n\nPrawn vindaloo 5/5\nChicken korma 5/5\nSaag Paneer 5/5\nGarlic Naan 5/5", "author": "Nicole J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-08", "description": "I ordered for delivery the chicken 65 and matter paneer. \n\nThe food was hot and cooked perfectly, but ZERO spice. It was as mild as baby or hospital food. If I wanted bland food, I would certainly not have ordered South Indian. And I never will again from them. \n\nSpice it up for your next customers!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "VEGETARIAN REVIEW\n\nWow, this took me back to when I had the best naan of my life in Kerela a couple years ago. This place has Goanese style food with the thin style naan that blows North Indian naan out of the water in my opinion.\n\nI also ordered the bangan bartha and paneer tikka masala. \n\nB.B. was different, lots of peas and nice and light! The paneer tikka masala was yummy. \n\nSolid experience, I'd come back to try more food!\n\n\nPs. I tried the pesto paneer tikka once before too and I loved it!!", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Had some excitement happen during our visit...\n\nMy boyfriend and I made it to the restaurant a few minutes to 3pm, and the waiter welcomed us in and told us to get plates and help ourselves at the buffet. He advised they close from 3-5 to get ready for dinner service. No problem, we were happy they served us so close to 3.   They brought fresh, hot naan and drinks.  Although they were technically \"closed\" at that point, We never felt rushed and the food was delicious. Here's where it gets weird...\n\nThis guy comes in (at least 3:15at this point), the waiter politely tells the customer that they are closed between three and five. The customer sits down at the table and demands to be served. He shouts something like \"All these other people are eating!\"  He is advised the few people left were here before 3pm and now the buffet is closed.  The guy is totally loud and belligerent demanding water and to be served. He takes out his phone and starts recording the whole event as if they were discriminating against him for some reason. He was ridiculous.  \n\nDude. You missed lunch, accept it an move on. Sheesh. \n\nAnyway, back in the land of sanity, the waiter and manager remained calm and professional. Eventually the guy left.  All the patrons left in the restaurant agreed that guy was totally out of line, and the staff handled it well. \n\nGreat lunch buffet, clean restaurant and friendly staff. Will go back for dinner! \n\n...", "author": "Christine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "This place is near where I am staying. I have been twice over the last couple of months. Really good food and they are very nice. Prices are good, too. I knocked off a star because it's not inviting from the outside. The decor inside is sparse. It doesn't have a lot of charm. They do a buffet for lunch. I'm sure I'll go back.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "I don't recall the last time i had Goan food, maybe when I was in Goa eons ago. Had the chicken tikka masala, fish curry and naan. Decent food.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "I could smell the deliciousness blocks away! I did a quick Yelp search and found this great Indian Buffet lunch! At a great price!", "author": "courtney m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-08", "description": "Great affordable lunch buffet for a quick work outing. Attentive service and many options.", "author": "Tanya W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Viva Goa is our go to Indian spot! We order delivery or pickup regularly, and especially love the fact that they offer brown rice! We especially like the Karachi chicken, and everything is always the right amount of spicy (we ask for medium spice). We will continue to order from this gem.", "author": "Bailey D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-23", "description": "I have had Goan food in India lots of times. However, this was my first time having Goan food in a restaurant in the US.\nThis is a hidden gem. Restaurant was in a great location, and spacious.\nThe pomfret dish was excellent, great balance of spices and flavor! Fish tasted very fresh.\nIt is possible to order sorpital, off the menu. It is a well-known Goan dish made of pork. \nThe roti was very good as well.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Worst service ever. The server was rude when we ordered the buffet. We were made to wait for so long for naans and I'd not recommend anyone just due to bad service.", "author": "Alok U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "Bottom line: Fine spot for Indian food.\n\nContext: Visited a number of times for lunch buffet, for dinner, and for takeout.\n\nService: Friendly\n\nFavorite: Samosas for takeout", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Good food, slow service!\nWe tried the chicken lollipops(appetiser). Chicken was tender and the gravy was good as well. \nChicken Vindaloo and Garlic Naan were on point too! We like spicy food so when we asked for it they were happy to customise the recipe accordingly. \n\nDont order Gulabjamun for dessert.", "author": "Saket K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "In my travels and sojourn through Asia, I have become rather familiar with the varying cuisines. In India, for instance, there was a distinct difference between Indian cuisine and Goan cuisine. The latter cuisine, it appears, took the Indian cuisine a step further by adding unique hand ground spices, coconut vinegar and coconut milk (thanks to the Portuguese influence) resulting in an altogether original cuisine.\n\nViva Goa restaurant, having opted for that name, ought to have focussed wholly on providing traditional Goan dishes instead of conflicting the menu with Indian dishes. There are plentiful Indian restaurants which are more qualified in serving savory Indian specialty dishes to their customers. \n\nAnother comment: Don't ever expect to savor the same mouth watering dish created in the country of origin and replicated elsewhere. It doesn't work that way. Therefore, expect the expected disappointment. If you crave for true Goan dishes, book a flight to Goa.\n\nAdditionally, we live in an age where demand exceeds natural production. If some reviewers are bitter about the curries served here that appear to have no coconut milk incorprated, guess what? Who in this day and age has the time to grate a coconut and extract the milk to favor you with a curry made with authentic coconut milk? As for the ready made coconut milk which comes in cans, do the math. Most of the canned coconut milk comes from Thailand, and these too by the millions. How many coconut trees are there in Thailand to feed the world's demand for coconut milk? The result? You guessed it: synthetic coconut milk which make most curries at restaurants taste like they were not made with coconut milk.", "author": "D M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "the restaurant do not make authetic Goan food. If you order Chicken goan style, there is no coconut in it. It is basically a North Indian style.\nNon-Indians don't know what is authetic Goan food. \nWe ordered fish Vindaloo and it turned out to be full of kind of tomato ketchup. It is supposed to be full of indian spices. \nWe can't be fooled.", "author": "Pia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "This is a go to restaurant for us. We have liked all the food though recently found a daal dish a little lacking in texture as it was too liquid. We will go back though. They seem to mostly serve delivery food.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Best Indian food I've had, bar none.  I'm usually a heavy spice and lamb or chicken guy but tonight we got fish curry and an eggplant dish that were INCREDIBLE!  and don't miss the vegetable samosas...  Vegetarians may be on to something.  Well Done!!", "author": "Robert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "My journey to find the best Chicken Tikka Marsala (CTM) in SF continues. This place gets close but doesn't quite hit the mark. The CTM sauce was superb--lighter color, good taste and texture, and creaminess--not too sweet, not too spicy. Just right. The chicken itself however wasn't tender enough and didn't hit the spot the way I had hoped.  Also, they could work on improving their rice and naan. The former wasn't a good batch (not fluffy enough) and the bread didn't taste fresh out of the oven and was too thin. \n\nStill, this is a solid option to satisfy that CTM craving. The sauce alone is a winner for me.", "author": "Behnam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "3.5 STARS\n\nThe roommate wasn't sure what he wanted for lunch and I had some drinks the night before. Since he let me choose, I picked my favorite comfort food after a night of drinking: Indian! We got delivery for lunch last Sunday, June 5th through DoorDash. We placed the order at 11:44am and it arrived at 12:36pm. I live in Outer Richmond.\n\n*Vegetable Samosas: Potatoes and green peas with mixed Indian spices and wrapped in a golden crispy pastry ($5)\n*Butter Chicken: Tandoori chicken cooked with a blended mild tomato base cream sauce, Very Spicy ($11.99)\n*Chicken Tikka Masala: Oven roasted chicken breast cooked with tomato and onion base cream sauce, Very Spicy ($11.99)\n*Onion Naan: Naan stuffed with onion and herbs ($3.49)\n*Garlic Naan: Naan topped with chopped garlic ($3.49) x2\n\nI adored the curries. They were both rich and creamy with a good amount of spice. I liked the tikka masala more than the butter chicken, but that's more of a flavor preference on my part. I liked the creaminess and heat of it more. The garlic naan was a great tool to sop up the curry. Soft, chewy and with great garlic flavor. The roomie always orders onion naan and seemed to enjoy this. I'd recommend staying away from the samosas. They were overly hard and salty. They resisted and crumbled when I tried to break them in half. Not good at all.\n\nOverall, good chicken tikka masala and garlic naan. Just stay away from the samosas. So bad!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Authentic Goan food. Love love love it!!! This brings back childhood memories for me. If you like spicy food and coconut, this place is for you. The staff is also wonderful. A++", "author": "Foram D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Wow, what a restaurant! From the waiters to the meal, everything was exceptional. My boyfriend and I searched Yelp craving Indian food and we found Viva Goa. We came here and for a week day we were a bit surprised to be the only ones here at 8 p.m. Eventually, a few more late night diners came in.\n\nOur waiter was extremely friendly and helpful going through the menu. We ordered chicken tikka masala and butter chicken. All I can say is the butter chicken knocked me on the floor. YOU MUST GET when you come here. \n\nNicholas out did himself and I have zero complaints whatsoever. 100% coming back. Thank you Viva Goa!!", "author": "Ariana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "Brought an Indian friend here. Intimate but pretty popular. We got a table quickly but the place filled up not long after and got pretty noisy. \nWe ordered from the vegetarian menu and enjoyed EVERYTHING we got. (Vegetable Caldin, Navrattan Korma, rice, garlic naan, Kingfisher beer, and mango and pistachio kulfi.)\nThe only downside was that they only had two waiters--when the place got packed we had to wait longer than usual for our orders.\nLooking forward to my next visit so I can try more of their veg and dessert offerings! Hopefully they'll have more wait staff!", "author": "Eduardo E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "Very disappointing to see the terrible food safety score as this used to be my absolute favorite Indian restaurant ever.\n\nHopefully management will take the inspection seriously and post exactly what improvements and changes they've made to address being \"in the bottom 5% of local food scores\"\n\nHeartbreaking news, but I wouldn't recommend anybody eat anywhere with the lowest food safety scores in the entire city. There's just no excuse for that.", "author": "Marky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "So this place looks like a lil divey Indian restaurant from the outside but a fancy cloth napkin dim light romantic spot  on the inside. My mom and I found it on a whim and we were so delighted. She has never had Indian so we literally picked random food to try. \nRoti (wheat nan), chicken tandoori, and lamb Karman and curry mussels! Every bite was absolutely amazing! The service was stellar as well! \nGreat hidden gem of SF!", "author": "Tracy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "Note: This is a Goan restaurant (i.e. serves Portuguese-Indian food). So if you order dishes PLEASE do not order tandooris, tikka masalas, karachi chicken, naan, etc. (These are NOT Goan dishes and do not represent the ethnicity of this restaurant).\n\nI LOVED the Goan dishes. The only drawback being the selection (and freshness) of fish... one simply does not have the same options as in Goa.\n\nThe staff is very friendly and nice.\n\nOnly reason for giving it 3 stars is the DREADFUL food safety rating (60 at the time of writing, probably the dirtiest restaurant in the city). How can you guys be so disgusting???\n\nPlease fix your hygiene and food handling. Until then, I am staying away.", "author": "T S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Came here for dinner on a Friday night and there were plenty of tables available. \n\nAll of the food was really good. I had the vegetable samosas, chicken saag, and lamb xacruti. Everything was cooked well and extremely flavorful. Make sure to get some naan! The pesto naan was great. \n\nFor drinks, I would recommend the mango lassi. Service here is above average. Viva Goa is a bit on the pricey side but it's well worth it for authentic Indian food. \n\nFood: 5/5\nValue: 3.75/5\nService: 4/5\nOverall: 4.5/5", "author": "Brian G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "I'm so said to say dat it's a Goan restaurant \nI'm a Goan \nI'm from Vegas N i n my 2 friends had come to meet a frd who was working on a cruise ship we had lunch in des restaurant n went to d zoo \nWe came bk at 5:15pm n ordered food to go but v dint get what v ordered", "author": "Edrich Jasson P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Viva goa.. The name reflected as if it would have a sea food speciality... Huge Disappointment... \nThe only thing that saved the cause \" Lombard street\"\nRating 1.5*", "author": "Ameya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "The best Indian food we've found in SF. Excellent cuisine and thoughtful staff. The food is authentic and memorably tasty. \n\nTop dishes we've found:\n - Ambit tik (fish; spicy)\n - Tikka masala (chicken)\n - Curry Xacuti (prawn)\n - Korma (lamb)\n \nAdd in some garlic naan and Kingfishers and you're in heaven. Having traveled to India, this food is the real deal. You can ignore the antiquated \"warnings\" - we asked to meet the chef and they took us back in the kitchen and it was cleaner than my kitchen. \n\nThe gf and I probably go there once/week. Ambiance is modest / dimly lit. Highly recommend.", "author": "Luke D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-20", "description": "The food tastes good but my wife and I had a really bad food poisoning... Stay away from this place.", "author": "Julien R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "This restaurant was clean and well organized. The food was great and filled with plenty of flavors.", "author": "Tommy Gun Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Hubby was craving Goan/ Mangalorian cuisine. This place has authentic food. To top it all they do have gluten dairy and soy free options. To read more visit my page.\n\nhttps://www.facebook.com/CookHealNourish/posts/330901890668985", "author": "Reshma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "One of our favorite Indian restaurants in NorCal and probably the most unique. Fish masala fry is best Indian fish dish ever.  We've ordered it a dozen times and always super.\n\nCalamari is also very unique.  Chicken xacuti is very good. Mango chutney is the magic touch.  Servers also are excellent", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "The restaurant will greet you with a cozy decor. Authentic and great style, small quaint, awesome satisfactory and worth every dollars.", "author": "Audrey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "One of the best around. Owners/employees nice. Food good and a tad different bc of the Goan roots. Decor dive like but endearing. Total winner. We eat here almost 1x/week.", "author": "T B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Great food for the rate. Restaurant could use a little more ambiance, but it's a hot for the food!", "author": "Faye M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "If there's one country that has the Goan spices, it's India, and that's when Viva Goa has finally made it here in SF with the rest of the other Indian restaurants.  This restaurant is the reason I go there, to try the authentic Goan spices!  I'm glad walk-ins are acceptable, so I can find a table just for me.  I got a free glass of water and I first ordered the Indian Tea (Chai with milk).  One sip of Chai in a ceramic cup, bold but not spicy, and it's good for me without adding sugar.\n\nThe atmosphere isn't bad at all with those dim lights everywhere.  The smell of various kinds of spices didn't just come from their plates, the lunch buffet area is where all the spices come from.  But I came here to try the best dish in the restaurant.  Thus, I savor the lunch buffet on my next future visit.  I was getting my waiter's attention so I ordered the following: Vegetable Caldin, Aloo Paratha, and Raita.  Oh, and I chose the Basmati Rice.  It's nice to talk to other patrons sitting in their respective tables, even while waiting for the food.  I asked one of the three men from my right side, saying \"how's your food?\".  Then he said \"it taste good\".  Many people enjoy their food straight from the lunch buffet while talking.  Me, I enjoyed observing most of the people here.  After waiting for twenty minutes, my food has arrived, and almost filled my whole table.  One of the three men I talked to said I'm a \"happy camper\".  Great!  Time for my feast.\n\nA bread basket of Aloo Paratha looked fried to the deep crisp.  The first piece of naan bread tasted crispy on the outside with rich chunky potatoes on the inside.  Tasted so good with and without the Goan spices, I couldn't stop wolfing all the pieces, until I came to the point of slowing down.\n\nThen I got to the Vegetable Caldin.  I wasn't fooled by its small size.  I knew there's more vegetables on the bottom with green herbs on the top.  And the yellow part that dominate the entire bowl, could be squash or turmeric with hints of coconut water.  With cumin, coriander, and the Goan spices, made a very warm bowl altogether.\n\nI know I couldn't easily finished the Basmati Rice.  I only finished some of its lengthy whites and all the green peas.  Raita was the last one I finished.  Taste like yogurt dip with strips of carrots and cucumbers.  Just a few spoonful sips, and it eased my digestion.\n\nI managed to finish most of the meal.  No homemade ice cream for me.  I was all good.  The food was good too.  And so are the very friendly waiters.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Best place we have found in San Francisco that tastes like homemade Indian food! Great vegetarian options like the Caldin, Saag Paneer, Chana Xacuti etc. I order in from Viva Goa when I'm craving good tasty Indian food and especially when I'm sick and unable cook at home, eating from here makes me feel so good plus it's nutritious and healthy (very little oil compared to standard Indian restaurants)! Do give it a try!", "author": "Divya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Great Indian food. My favorites are the butter chicken, mattar paneer, veg biryani and garlic naan.", "author": "Marwan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "The ambience was good. Service was great too! It was disappointing to not see Sol Kadhi served at a place which has \"Goa\" in its name. The food was decent, not extra ordinary.", "author": "Tejashree M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "It has a very good ambience food is up to the mark very good friendly service and I just look forward to go back again viva Goa.", "author": "Dominic F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "A real gem. The food is delicious and a little different that typical Indian restaurant - which is refreshing and so delicious.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Very nice place. Clean, good kitchen\n Friendly staff. Made as buffet, but has meet, rice, salads, fruits, and also some sweets. Relaximg music. \n\nIf will travel to San Francisco definetly will stop by again", "author": "Anya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Very small but nice place. Me and my friend went for a lunch buffet. They didn't have much varieties but let me tell you this - every single item they had was delicious. The flavors were good and food felt fresh.\n\nThere tandoori chicken is a must try and also goan chicken curry. There vegetables dishes were also very tasty. \n\nNot an expensive place either.", "author": "Avi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Best Indian food I ever had in San Francisco. Love this place, gives you real Goa feel. Malai kofta and biryani is best", "author": "Abhishek P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "If you need a vindaloo, go to a place with Goa in the name (that's where this dish comes from).  \n\nOrdered to chicken vindaloo and told them to make it spicy. Food showed up pronto and was delicious. Didn't think it was spicy enough at start, but the heat grows (like it's supposed to). Overall and very good curry and highly recommended for takeout. The dining room experience is a throw back to the 1970's, but the grub is pukka.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "Great lunch spot! Me being from India, I am always hesitant on going to Indian restaurants because I get better tasting food at home. But this is a awesome little restaurant- and especially for lunch. i work near by and will definitely be going again! Not over the top spicy or creamy food (usually they do that in buffets to fill quantity).", "author": "Ankit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "I love Indian food and this is a top spot. The best Indian restaurant in SF.  Authentic food, lovely location and quick local delivery. Friendly and very attentive team. I highly recommend North India Restaurant!", "author": "Tsegi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "First time tasted the authentic Goan curry I am originally from India for all you folks who want to have a scrumptious meal buffet for $12 weekdays is a steal deal.\n Come with ur loved ones enjoy the meal ur gonna cheers and come back for more and wonder I wish I could eat more but my stomach is full \n  Pls call and check the menu of the day and the buffet", "author": "Sabah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "i lahhvvvv this place. the service is great the vibe is romantic i mean it's not super fancy but what i adore about this place is i've liked  everything i've ever ordered thus far. i've been here 7+ times and this place does not disappoint !! reasonably priced too for marina !! their soup is bomb like seriously who says that about an indian restaurant even their SOUP is good on top of their curries being amazing. and fyi if you say spicy it's spicy yo. a boy might argue with me and say ehh their spicy ain't spicy it's like mild spicy but to my girlie ass its spicy. have water in hand. street parking is easy except on weekends when it's sunny as eff pls lord baby jesus do not drive", "author": "Reese A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-31", "description": "Ordered takeout from Via Goa last night and was delivered a cockroach with the meal... the entire full body roach complete with legs and antennas came inside my rice. We have been here a bunch in the past but this is not acceptable at all. I would be careful going or ordering from here for if they have roaches in the delivery they have roaches in the in house meals too. This was the nastiest thing I ever saw.", "author": "Russell R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "As far as Indian buffets go, Viva Goa is right up there for variety with a couple of unique dishes that are distinctly Goan. Plus at $8.99 on weekdays, it's an absolute lunchtime steal.  \n\nSeafood is an integral part of Goan cuisine and at this buffet, you get some Goan fish curry to soak up that fluffy basmati rice. The curry is pretty light but I appreciate that it's a dish not typically found in other Indian buffets. Vegetarians will also appreciate that this buffet has a wide spread of vegetarian dishes ranging from a mixed vegetable vindaloo to samosas to sag paneer and lots more. I especially love the Goan salad. It's bright with a nice mix of pickled veggies and chickpeas - very refreshing counterpoint to the various curries. As with all other Indian buffets, expect the usual chicken tandoori and chicken tikka masala. All in all, a hearty and fulfilling meal with mild spices for those dreary SF afternoons. \n\nIt's a little dark inside and the décor is a little  dated but service is attentive especially when it comes to keeping your water glass full. Indian food isn't what comes first to mind when you mention the Marina but Viva Goa is pretty legit and probably one of the best lunchtime values in the neighborhood.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "My husband and I went to dinner with our friends, who are Indian food aficionados.  As expected, it was an absolutely delicious meal.  We ate a wide variety of meat and vegetable dishes and every single one was exquisite.  I have passed by their sign on Lombard whenever I've been in the city, but wasn't sure what kind of cuisine it was.  Now that I have been, we will be returning often!  Highly recommend for a delicious meal!", "author": "Lizzie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Love this place! Usually order take out a few times a week. I love Indian food, but can't handle the spice, and they are sooooo good about making it mild for me.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "No 1. Restorent  very clean service 1 \nNiclos joe  the best the very nice  person  thy are from Viva GOA fell like home Monday lunch Buffet only$10.99. ASh from SF", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Super good! I order the tiki masala and the butter chicken for dinner , both excellent ! Recommend ;)", "author": "Celeste B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "Most underwhelming Indian food I ever ate. The naan was soggy. And butter chicken was pretty tasteless.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Great Indian Food, very consistent delicious recipes and fast delivery service. My favorite dishes are chicken breast marinated in yogurt and baked in clay oven and also I tried the fish last night and it was amazing. Highly recommend it!", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Always come here when i visit golden gate bridge!  I consider myself a regular visitor because of that. I prefer their menu food over the buffet since they dont have many Goan dishes in buffet.", "author": "Abey M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "Extremely slow service. Waiters will not deign to replenish your water. Food is definitely not authentic Goan cuisine. Everything we ordered came drenched in cheap, sour tomato paste.", "author": "Athena A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "We used to live in the neighborhood and this was a staple for us. When we arrived, we never had a problem securing a seat and also the delivery is very quick indeed. The items we recommend would be the butter chicken, by far the best we have ever had. Additionally, I would suggest you order the samosas. They are huge and could be a meal on their own, perfectly seasoned and go really well with the tamarind sauce. Also, on the appetizer side, check out the garlic naan, fresh fired and soft while also nicely charred for flavor.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "What they do deliver is delicious . Especially the lamb dishes and vegetable pakora .\nExcellent .", "author": "Denise D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "Ordered bunch of samosas from here yesterday, they were bad. Fried in reused oil and salty.", "author": "Zoheb M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Incredible food and service. You honestly can't go wrong on the menu. My favorite is the Navrattan Korma. Reasonably priced and really high quality - it's honestly a hidden gem.", "author": "Alex J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Absolutely LOVE this place! This spot is now my go to spot for Indian food. The place is very nice, the food is delicious! I tried literally EVERYTHING at the lunch special buffet and I loved it all! I would definitely recommend stopping by from 12-3pm Monday-Friday which is their buffet special. Try the mango lassi (mango yogurt drink). The service is also exceptional. You wont regret coming here!", "author": "J P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-30", "description": "Mediocre Indian food, have been to better Indian restaurants in SF like Gajalee (unfortunately closed now) and DOSA.\nAlthough the ambience was good, but the food was just not good enough, service not upto the mark, not worth the money spent.", "author": "Rashmi A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "We wanted to try something different so we chose this place. There was a lunch buffet. They didn't have a lot of options. There was nothing Goan. That wasn't an issue for us though. \nWe were not happy with the food. Non Veg curries were average at best. Fish curry was not good(tasted like tomato soup).\n\nVeg item were fine though. I will give them that.", "author": "Vic A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "San Francisco's best kept secret.\n\nThis place is amazing! I've never actually been IN the restaurant, but instead have always ordered it for takeout. I am convinced that it makes the best tikka masala in the city. I always order the lamb (Viva Goa: source organic chicken and I'll order from you every night), which is good, although you need a knife to cut up the chunks.", "author": "Christine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "If you want some delicious, warm, flavorful comfort Indian food, come here! \n\nClassics like butter chicken, chicken tikka masala are so very delicious. Their goan macaroni soup was a pleasant surprise that I ordered while sick once, and now can't help but get now every time I order from here!\n\nAlso, the staff is always so pleasant, friendly, and quick", "author": "Brette B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Hands down, the best chicken korma in the city! Everything I've had from Viva Goa has been excellent and the service is great. Very friendly group.", "author": "Barry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Love their Lunch Buffet - lovely assortment of different dishes.  Nice service.  The naan isn't as good as others but overall - DEFINTELY the best cost effective Indian Lunch Buffet in city.", "author": "C. Dianne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "We've order to go or for delivery from this neighborhood Indian restaurant several times and the food is good, on time, no complaints!", "author": "P S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Tasty catered lunch!\n\nThe chicken tikka masala was extremely yummy, and I like how the chicken xacuti was very tender :)\n\nThe sauce was amazing with rice and the soft naan. \n\nI also enjoyed the aloo gobhi very much. \n\nDefinitely recommended!", "author": "Christina N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-20", "description": "It was very disappointing to know that they have the lowest food safety score.Their launch buffet was kind of ok. But half of them taste like frozen food. I like their naan. It's a casual place to have Indian food.", "author": "Rajna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "Amazing Goan cuisine .. which is hard to find.\n\nWe have had Indian all over the world, this place measures up.  Not a lot to look at as far as interior decorations but who cares... the food was outstanding. Best Vindaloo in a while.", "author": "Seth C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-07", "description": "BEWARE! I have eaten here twice. The bald waiter tried to tamper with the bill and added 2 extra dishes. Even after telling him to fix the bill he came back with another extra charge on the bill.\n\nAlso there chicken isn't fresh. It was chewy and low quality. Avoid this place at all costs", "author": "Swapnil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Delicious spicy chicken xacuti with thin naan , the naans were the best because they weren't thick . The pork sorpatel was average. Good service. Definitely recommend this place.", "author": "Dev B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "I've been here several times over the last few months for their weekend buffet.   It's always excellent!  Nice friendly service.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Viva Goa is our go-to spot for Indian food in the city! The food is always fantastic, the service attentive, the staff friendly, and the prices reasonable. \n\nWhile we typically opt for the chicken tikka masala, navrattan korma, and saag chana, we've sampled many other dishes and they're all delicious: chana xacutti, bengan bertha, saag aloo, raita, vegetable samosas, chai, etc. Dishes can be adjusted to your acceptable level of spiciness too (mild, medium, hot), which is great. \n\nI love taking friends and family here when they're in town because the food is great, the prices aren't bad, and it's always easy to get a spot, no matter the size of your group. It may not look like much from the outside, but the interior of the restaurant is cozy with booths and tables, white tablecloths, and traditional Indian music always on the play list. Nicholas, Joseph, and the rest of the team are always happy to see us, helpful, attentive, and interested in how we've been - can't beat feeling like a regular!\n\nDelivery is also super quick (which may be because we live nearby); if they quote us 40 minutes it usually arrives in 20-25, which is always a welcomed surprise. \n\nCannot recommend Viva Goa highly enough!", "author": "Brendan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "Food selection is great.  Carpet needs to be replaced as I can smell the trapped dirt or dust from being old. Other than that the food is very good. Everything was good. The gulab jamon was fresh and yummy.price for the buffet isn't bad.", "author": "Tess A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "When my princess GF forgot to order rice with our order hey we're very accommodating. The food is wonderful. Everything I wanted from delivery Indian food.", "author": "Elan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "This is a review for the lunch buffet.\n\nI went a few times during the past month and the quality is consistant. You get fresh nan bread, a few salad options, a veggie korma dish, with tandoori chicken as well as a chicken tikka and seafood tikka dish to pick from along with pakoras and a few other items. Not a bad value for $8-9.\n\nThat being said , the seasoning for everything is \"white bread\" mild, I don't blame them for that since the buffet needs to cater to a wide range of customers. I wouldn't mind trying their dinner menu and turn the heat up a bit.", "author": "Kurt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "After an overly-long walk up/down the Presidio beach-y area searching for an event we never found (SF, you get on my last nerve), we yelped something near-ish for Indian food and found Viva Goa ranked highly among Yelpers.  I was a little nervous since I'm a big punjab-style fan and have never really taken to souther-style Indian food (seriously not a fan), and I wasn't sure what to expect with \"Goan\" style Indian.  I'm so glad we took the chance, because Viva Goa was simply delicious!  \n\nThey have lots of northern-Indian/Punjabi style favorites, so you can order good ol' standbys if you want (paneer, korma, tiki masala, etc.), We had the navratan korma, which was our \"just in case\" dish, and it was REALLY wonderful-- fresh, well spiced, very delicious.  But I'd highly recommend you try the Goa regional specialties (they have a little tree logo next to them), which are super well-flavored and really delicious.  We had the vegetarian caldin, which was light and tangy, while still rich in flavor/style.  Wonderful!  Also had their samosas, which were *very* flavorful (there are a shocking number of Indian restaurants who serve crap samosas-- why God, why?!?!).  We'll come here again next time we cross the bridge and venture into SF.\n\nTons of vegetarian options among the many meaty options, so vegetarians should have ZERO fear.  They also note that they can make many dishes vegan, so bring your crunchy friends with you ;)", "author": "Tarah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "After a long day of hiking/walking in the Presidio, my girlfriend and I were craving Indian food nearby and this place came up on Yelp. Dinner highlights:\n\nChicken Xacuti - one of their signature Goan dishes. Unique flavor with just the right amount of kick. Perfect with rice and naan... this is a must try!!\nMango Lassi - refreshing and not overly sweet.\n\nWe also ordered garlic naan, basmati rice and a seafood masala which were all delicious. Portions were just right and the staff was very polite and friendly. I was surprised at how empty it was for a Saturday night - we practically had the whole restaurant to ourselves. Parking was very easy to find on Lombard.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "This place is great. Good service and tasty food.\n\nThey also have free delivery with orders over $25 from Eat24. You almost exactly hit the minimum with two entrees, naan, and rice. \n\nI'd recommend the Chicken Korma if you don't want something spicy.", "author": "Jared R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "I live in the area and tend to dismiss anything on Lombard as serving crap tourists want and won't have time to complain about. Viva Goa is a major exception.\n\nWe get delivery for dinners and frequent the lunch buffet a few times a month. My husband and I like to do family meetings here over the delicious spread of Indian dishes. I love that they serve fresh naan with each buffet order and love the price and quality.\n\nThe staff is warm and attentive. We especially like Simon who greets our family by name when we come in.\n\nThe decor could use a little updating but then the prices wouldn't be as great. Not a bad compromise.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-09", "description": "Had the prawn xacuti, lamb rogan josh, naan and rice.\n\nThe prawns were cooked right, although the xacuti was not my thing (was recommended by our hotel manager), friend loved the rogan josh, the basmati was the winner for me.\n\nService was good, they forgot to charge me for my king fisher (nice light beer) and thanked me profusely for being honest (isn't everybody?)\n\nI'd go back to try the all you can eat lunch buffet, seems like a good price, and if you're in the area, it's a solid place.", "author": "Mira T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Good food.. We had buffet and it was worth it!! The fish curry was the best ... Very good option if you looking for both veg and non veg food at one place...", "author": "Nazneen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "First time I came for the all you can eat, I wasn't very impressed. Let's just leave at that. This time around! Super impressed! Everything looked, smelled, and tasted fresh and good! I seriously tried everything due to how fresh everything was. Hopefully my many more visit will give me the same experience. Fantastic job nonetheless.", "author": "Jackie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "We started with Viva's famous Muligatawani Soup, which is essentially a Delicately blended spiced lentil soup (which they make themselves), and truly remarkable, perfectly cooked. My friend and I shared one order, which consisted of six full spoons yummy soup. We certainly could have shared a second order, but moved on to main course. \n\nFor the main course, I decided to go with Viva's chicken Biryani which has well popular in India especially in Hyderabad. The flavor of the chicken and bright colors of the ingredients peeking through the thin rice paper made it a feast for the eyes as well as the stomach. My friend ordered white rice with Dal fry , which consisted of Yellow lentils seasoned in mild spices and cooked with garlic, ginger and onions. The meal was served perfectly. There were a few drinks, but we ordered for a beer to accompanied with the meal.", "author": "Narendra G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "I love this place!!! Get the Fish Masala Fry and you'll become a regular here like me. The buffet is also awesome if you like having a lot of bites of things. I love this place so much I'm going to Goa because I just love Goan seafood and want more of it! The owners are so sweet and take such good care of you, too. This place is never crowded. You can come in with friends and have a long leisurely dinner without your waiter giving you the stink eye.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "Awesome restaurant with Goan food on the buffet along with other Indian dishes in the Marina district of San Francisco\n\nGoa is a region of India that has great food influenced by the Portuguese during their colonization of Goa.  Goa has no comparison anywhere on earth for the food, the music, the friendliest and most laid back people and some of the best beaches on earth.\n\nWe came for the lunch buffet, so I wont bother with the review except to say the buffet has at least 2 goan dishes, focus on these.\n\nI suggest you come back for dinner and only order Goan seafood dishes as per your taste profile. you will definitely not regret it if you can eat a bit of spicy food.\n\nYou might go thinking this is any indian restaurant, but you will discover the cuisine of Goa and then life will never be the same again", "author": "Oculus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Favorite indian restaurant in the city.  They use fresh quality ingredients.  The seafood curry in particular seems to be their speciality - loved the fish curry and the fact that my toddler son gobbled it all up (he's quite the picky eater).  Been to the restaurant but also started to get delivery from here.  It seems like SF residents haven't quite discovered this place.  Used to hit up Little Delhi delivery quite a bit but this place is better.", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "The Chicken or Lamb Korma is fantastic. One of the best Indian places in the city.", "author": "Sara P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Wow& wow. I' m Indian and I avoided this place for a long time given that it was located on the the tourist/ motel strip of Lombard St. However, we went for it last night and this is a diamond in the rough. I ordered from the menu but I hear the buffet is good too. Granted I can only eat so much but me and my boyfriend covered a few classics. \nKnown for it's seafood we went for it. Prawn xacuti, tandoori fish and channa saag. \nThe curry had ' flavour'! The fish was cooked to perfection- sole. Then the icing on the cake, for me, and I know my Indian desserts... The Rasmalai. I've grown up on that stuff in the UK and theirs was home made and flavourful enough for me to come back if only for dessert!!\nThere are definitely more classic dishes to try but the food and service here overall warrant my return... Soon", "author": "sup d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "A friend introduced us to this place and from the first time we dined here, we were sold. As meat lovers, there's plenty of options and we have never been disappointed with the food. \nThe Fish Masala fry is to die for, we also tried the different lamb curries - the lamb meat was cooked to perfection. Other good things on the menu - Chicken vindaloo, their goan dessert - Bebinca, and also their mango lassi and masala chai.\nThis is the closest to authentic Goan food that I've ever had, and I'm so glad it is right here in San Francisco!", "author": "Soumya G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Delicious  food and friendly staffs. Goan  flavors are mouth watering and we loved everything about the restaurant.", "author": "Kalyan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Ordered for pickup. Everything was delicious and perfect temp to eat when arriving home. \n\nFish curry. Light buttery fish in coconut curry sauce. I could eat this forever.  I have NEVER had a fish curry that I enjoyed. I'm not even a big fish fan...but this, you must try this. Tasted caught this morning fresh. Garlic Nan, very garlic-y and soft, thin, delicious. On the smaller side, one order of nan per person small. \nChicken Tikka Masala. Great, tasty, lots of chicken pieces.\n\nThere are cheaper Indian spots in the city sure, but you get what you pay for. I've also been to much more expensive places, and I'd go to this place over all but one of those.", "author": "Alize A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "My mom is native Goan and we all thought the food was fantastic! The mussels, fish masala fry and prawns ambot tik all impressed us. Quality service, a nice atmosphere, and a wonderful dinner. If I could give it more stars I would!", "author": "Meghana N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "If you are not from Goa and do not understand what spicy means over there, I'd recommend asking for mild.  If you eat a lot of spicy Indian food, ask for medium.  \n\nXacutis are reasonably authentic and the food is great, with side of Kingfisher.", "author": "Vipul V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "Wonderful service. Great and friendly staff. Feel free to ask them about the history of the place and about Goa.", "author": "Oliver L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-01", "description": "I did not like the food... firstly the fish cutlets is actually tuna cake with a really bad taste... we ordered variety of stuff like chicken lamb and fish... and there was nothing u could say yummmy to...", "author": "Pritika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-06", "description": "Pros\n\n$9.99 lunch buffet\nDope Mango lasse\nFresh naan\n\nCons\n\nNo Indian music?\nLimited options (inc bland chicken)\nCockroaches\n\nThis venue appears to be converted from another restaurant because it lacks any Americanized (or non) Indian styled location I've ever seen. It is really nice though. All my above comments are based on a buffet visit. So if you're looking for more sit down related reviews: skip.", "author": "David W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-28", "description": "Terrible place! The staff is extremely rude, the man behind the counter is mean and their food does not justify such bad attitude at all...", "author": "DVolt B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "hated the food. Dont even know where to start. The quantity is fine but the taste and quality are meh.", "author": "Bhavya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Free delivery was convenient, order was delivered on time and with a smile. Prices were reasonable as was the selection and most importantly food was great. Would definately order again", "author": "Cedncal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "The place looks a bit like a dive from the outside and a bit of the same way from the inside. The bathroom is semi-clean and it looks like a 5th grader piece together the toilet and the sink. However, the food was very good and the staff were very good also. The portions are deceptive. They look small but they are very, very filling. This is the third time we have eaten here and we will continue to return. On a side note, we brought our daughter-in-law with us who is also Indian. She is from a different area of India but also found the food very much to her liking. I would highly recommend that people come check this out", "author": "John Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "04.27.14 etc. | bookmarked 11.11.10\n\nI LOVE this place. It's my go to Indian place. To eat in or take out.\n\nSignature dish: paneer tikka masala. Onion naan. Garlic naan.\n\nDone.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-08", "description": "Didnt like it..not at all authentic goan food .. i was so excited when v visited sf bcz f goan sea food but disapponited .. fish and prawns wer fresh but i wish they ll make some improvement with their goan curries ...", "author": "Siddhi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "Found this place on Yelp the outside I was kind of iffy about it but when we went in it was decent looking and we were immediately greeted and seated. My dad asked how much was for my toddlers 1 and 2 he said free and my motto is \"If it's FREE that's ME\"  Great customer services, great waiters, and great food", "author": "Princess V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Tried Goan dishes that we are used to and were satisfied with the overall taste and quality of food. We had been to Gajalee in SF before and really liked the food but wanted the Goan twist :)\nThe Bombay to Goa in Sunnyvale was a really massive disappointment in both taste and quality, so we were really happy to finally find this place .", "author": "Dhaval L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "For some reason, all my closest Indian friends are South Indian. Through our foodie adventures, I have developed quite an obsession with the cuisines of this region. When I discovered the existence of Viva Goa, I was determined to make the several-mile trek up to the Marina because it had been ages since I'd had Goan food (and I've gotten kind of sick of the same old Westernized North Indian dishes).\n\nMy friend and I came here for lunch. She opted for the lunch buffet, but I decided to go a la carte because the buffet only had 2 Goan dishes (both of which weren't terribly exciting) and I wanted something authentically and uniquely Goan that I wouldn't be able to find at other Indian restaurants. \n\nAfter some consultation with the very friendly Goan owner, I chose the Prawn Xacutti. If you only have room in your brain to remember one Goan dish, let it be Xacutti, the definitive curry of Goa. It differs from other curries by having poppy seeds as part of its flavoring. I chose the prawn version because Goa, which is right on the coast, is famous for its wide variety of seafood dishes (particularly fish and shellfish). The xacutti was thick and tasty, with a complex multi-layered variety of spices, and the prawns were large, succulent and perfectly cooked. Combined with a generous portion of basmati rice and freshly baked, piping hot naan, and this meal could have easily fed two. \n\nI also tried some of my friend's Goan Fish Curry (one of the two Goan dishes at the buffet). The fish (some kind of white fish) was very tender, reminiscent of the way Chinese people cook fish, but the curry was rather watery and the flavors seemed diluted. For dessert, my friend and I split the Bebinca, a traditional Goan dessert made with flour, sugar, ghee and coconut milk (which gives it most of its flavor). Bebinca reminds me a lot of Chinese Thousand-Layered Cake, my favorite dim sum sweet. Both desserts are traditionally baked in layers. Viva Goa's Bebinca was very thick, with an almost paste-like consistency, and had the delicious flavor of coconut mixed with caramel. It was served with whipped cream. We both really liked it, but couldn't finish more than half because it was so rich.\n\nThere are no shortage of great restaurants in the Marina, but if you're looking for something off the beaten path, might I suggest Viva Goa?", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "For $11 all you can eat it's serves its purpose.  The food was warm or hot, place was clean, and servers were friendly.  For $11 what more can you ask for in the city?", "author": "Michael I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "Had their lunch buffet and it was a decent set menu. Coming originally from Goa, I must say these guys have done a good job with the authenticity not just in the food but also in the ambience. \nThe two stars I deducted are for the cold pakoras I got and the not so well made potato. It tasted as if the vegetable was burnt. The Goan fish curry is worth a try and so is the chicken vindaloo! However one thing I truly missed as a Goan was the solkadhi.. They should think about including it in their buffet!", "author": "Kimaya K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "I came here for the lunch buffet with a few friends and we all really enjoyed the food. My best friend is a sucker for naan and he must have eaten two or three basketfuls while we were there. I'm not particularly familiar with Indian cuisine on the details, but as a newbie I can say that I tried a little bit of everything and really enjoyed it all. \n\nThe ambiance is pretty nice and the waitstaff was really attentive, asking how things were doing, and we were probably asked a few times if we wanted to order something besides water to drink.", "author": "Maureen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Absolutely loved the lunch buffet. Every dish i tried (most of the hot dishes on offer) was delicious. The included fresh naan was great too (we had two orders :) If i had one tiny grievance, it's that they were slow to refill dishes - i gave up on waiting for more fish curry, which i wanted (but certainly didn't need) more of!", "author": "Erica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "I randomly found this restaurant while walking around Lombard St. and I was very pleased with everything that I ate.  I had the Lamb Korma, Garlic Naan and Mango Lassi.  They were delicious and the service was excellent.  I would definitely recommend this restaurant to anyone looking for awesome Indian cuisine down in the Marina District.  Their menu is very extensive.", "author": "Ricardo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Amazing good reasonably priced and great service. The samosas and naan are to die for.", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "I don't yelp a lot. I don't hand out 5 stars a lot. But when I'm not drinking beer, I go to Viva Goa. This place won me over big time--hands down best indian food in the city.\n\nSuch flavors.\nThe Goan special shrimp appetizer...I cleaned the plate. That sauce was amazing.\nThe chicken korma was exactly how a korma should be. Thick, delicous creamy sweet sauce. \nGarlic Naan is average at most places, theirs was definitely above average in taste. Could have been a bit fluffier. On the thin side for naan.\n\nI love this place and will be coming here once a week and ordering extras for lunch. Viva Goa for sure.", "author": "Parker K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-19", "description": "Goa....the Costa Brava, the Ibiza, the coastal vacation spot and getaway of India!\n\nFirst time here a few Fridays ago.... I'd say a fair 2.7 for dining experience and 3.2 for the food.\n\nWas just disapponted with my experience there overall. We had rez for 2030. A dinner of one onion naan (which came out so flattened, we were both in disbelief a bit)...\n\nPrawns sungttam were tasty... bit overcooked though. Enjoyed the flavor. \n\nThe spiced sole fish xacuti entree and the Goan lamb masala dish. I agree with Natalie S' review... better than average, but just not good enough for my palate...lamb was overcooked. And even though my fish wasn't, the spices were a bit confused, overlapping one another, and wasn't bowled over. \n\nToo many elements were missing to have tacked on an 18% auto gratuity for a place in disrepair and oft-neglected in ambience. This considering the prices they charge.\n\nNot sure i could muster a re-visit here, although our servers (both Goan) were friendly and courteous. Mess up on a few things ordered (i.e. a Taj, not a Kingfisher)....\n\nPS Near the Super 8 on north side of busy Lombard.", "author": "Jana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "Viva Goa has great food. Don't let the exterior, or interior for that matter, deter you. The service is very friendly although my interaction with them is primarily over the phone for delivery or briefly in person for take out. \n\nThey have very tasty Goan dishes that range from super spicy to mild.\n\nI really like the tandori chicken tikka, vindaloo (although it is really tasty, its too spicy for me), the saag paneer and the lamb and veggie Biryanis are also a go to dish.  Love the samosas too!\n\nMy only negative thing I can say is their fairly small delivery radius.  I live in South Beach which is understandably not the closest to this place so I have to encourage friends who live nearby to order when we decide to eat in or just go pick it up if I'm in the area.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "Food is descent but they do not use fresh ingredients, using  frozen vegetables in their dishes, the naan tastes like it is from the freezer and the samosas are covered in salt.", "author": "Nick G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-15", "description": "I geniuanly enjoyed this spot - if I could give it a 3.5, I would. I didn't go for the lunch buffet so I can't speak to that but the dinner was a good experience overall. The service was perfect - our server was attentive, nice and comical. My three star rating is simply because of the food quality for the price - it was good but not something I would go out of my way to have.", "author": "Chelsea A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "We live a few blocks away from Viva-Goa and love it. The staff is friendly, the food is yummy, and prices are great too. I highly recommend going in for a buffet on a weekend or even during the week because you'll get to sample the various Goan dishes. \n\nIf you're not a buffet-kind of person, then any of their Xacutis and Vindaloos are a good choice, and do get their Naan. Their Naan's are soft and thin, unlike the Naans at North Indian/Pakistani restaurant - that's because they don't add eggs to their Naan dough. \n\nGoan food isn't very readily available in the bay area (or in the US in general), and so we are lucky to have one such restaurant in our neighborhood.", "author": "Amit J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Simple but enchanting and quiet atmosphere with delicious food, great service and reasonable prices. Spiciness to taste, they really know how to gauge it! Can't wait to go back!", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-30", "description": "Not sure about other times but buffet was very average. Not sure who gave this place 4??? Average food!\nVery limited variety of food and they were taking forever to replenish the dishes even though it wasn't even busy.", "author": "R K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "This is not the typical Indian restaurant you find everywhere... which I love as well.\n\nNever had Goan Indian Food (Portuguese influenced)... very yummy!\nBut the Goan spices are unique and a welcome change.\n\nService here was good, and the place is filled with takeout call in service.\nMango lassi drink was thick milkshake like with good mango taste, good quality.\nGarlic Naan could be more garlicky for those true garlic lovers.\nVery reasonably priced for the quality.\n\nFish platter was most excellent.\n\nI will be back (1st time here)", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-17", "description": "The food is really good and delicious I really enjoy it.Although,the customer service I recieved was not as good.The food is super tasty,but I would not count on the service as much..", "author": "Jenny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "Good food, service is really, really nice. You feel like you at a restaurant. Decor is a little dated but it can be charming too. A lot of people take carry out.", "author": "Natalya V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "This is my go to place for yummy Indian food. The curries are flavorful without being too greasy. The samosa were also tasty but top salty. Mango lassi a bit too sweet for me. Definitely coming back!", "author": "Margaret H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Great food (I had the lamb xacuti, my husband had the lamb vindaloo and my friend had a chicken tikka). My husband's vindaloo nearly blew my head off (the spice is off the charts even for me and I love spicy food). But it is crazy hot so be sure to ask about the level of spice in the food especially if you are not used to it. Very reasonably priced and something a little different given how touristy Lombard Street is.", "author": "Dawn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Viva Goa is a good Indian restaurant that could use the services of a restaurant consultant. What I like about this place is that you feel kind of like you're sitting in a family living room. The service is friendly and unpolished, and you can enjoy your meal without worrying about putting your elbows on the table. The food is above average Indian cuisine, with yummy chicken tikka masala, naan, jasmine rice, and other staples.\n\nThe reason I take off one star is because of the delivery procedure. Since this is one of the few restaurants that delivers to my house, I order from them a lot, sometimes twice in a week. I've been doing that for months, and yet each time the guy who takes orders picks up the phone, it's as if I'm a brand new person he's never met before. I literally order the same thing every time and yet he still brings me through the same 6 scripted questions (I can recite them) and then makes me spell my name and address. Often he will misspell the name of my street (\"Pilbert Street?\"), which, aside from the fact that I've spelled it for him 80 times, is located 2 blocks away from his restaurant. Sometimes I feel like shouting into the phone \"Dear God, man!  Where has your memory gone?? Lay off the ganja pipe for a while!\"\n\nViva Goa: please get a computer. It's 2014. They have some great technology out now.\n\nThis restaurant needs to take a page out of Escape from New York Pizza's book. When I call, their caller ID links me to my address. They ask me what I want, confirm my address, and I am literally off the phone within 30 seconds.", "author": "Evan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-11", "description": "We took uber and went and saw closed board written on paper with pen on Tuesday afternoon, really disappointing. Finally ate at curry leaf , Indian restaurant very good food and friendly staff.", "author": "capriconrulez c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-18", "description": "I've eaten at Viva Goa and had delivery from them a few times. Mostly it's been pretty good but we had a delivery last weekend that was so bad I have to post a review.\n\nMaybe the main chef was off for the day or something but the quality took a major nosedive. The tandoori fish was some kind of cheap spongy fish and really tasteless. The Vindaloo tasted as if it had ketchup in it. Overall the flavors just weren't there and the quality of the ingredients seems to have dropped considerably.\n\nHope they improve again soon.\n\nPS. the \"pickle\" and mango \"chutney\" were a watery insult to the palate.", "author": "Dilbo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "I ordered vegetable vindaloo. They really make it Goan style. This is one reason whenever I visit California I come eat this item. I am having hard time finding veg vindaloo in other places. Although garlic naan was little chewy and not soft. I will come back again.", "author": "Kunal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "Fellow goenkars,\n\nIf you're looking for a place to introduce the chicken-tikka-masala eating masses to authentic cuisine from the homeland, Viva Goa is the place to do it.  My eyeballs nearly popped out when I saw sorportel on the menu!  Delicious chicken xacuti, pork vindaloo, and the seafood platter are all winners in my book.\n\nFor the uninitiated,\n\nPut down that naan and rogan josh.  Set aside the daals, the saag paneer.  For gods sake, stop eating that samosa.  Goa is known for its seafood, its coconut-based dishes, its spicy cuisine, so take full advantage of these strengths.  Help yourselves to the Goenchim Sungttam (a prawn appetizer) or the chicken lollipops.  If you're down with heat, order up the pork vindaloo, otherwise the Chicken Xacuti can serve as a flavor-bomb alternative.  I personally haven't had the Rechado Pomfret Fish or the Chicken Cafreal here, but those are both super super good if done well, as is the sorportel.\n\nI'll be back, fo sho.  And hopefully they'll have feni and limca on the cocktail list :)", "author": "Raoul C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-20", "description": "I always hesitate upon entering empty restaurants. We sauntered in here one evening on our way back from Marin on a freezing cold day when we were craving hot, homely goodness.\n\nAh, chai and Indian coffee to the rescue! Even better with fresh vegetable pakoras! Amazing start to the meal.\n\nFor the main course, we decided to stick with Goan specialties, being in a Goan restaurant. We ordered the fish curry and the chicken xacuti, accompanied with plain naan. The fish curry was slightly bland for my taste and the curry element slightly thinned-out and translucent. I'm not sure if that is the intended preparation, but it definitely could've used a tad bit more masala. Overall though, the fish was fresh and didn't leave an aftertaste. The chicken xacuti was plenty flavorful. Similar to a standard Indian chicken curry, it included a few nontraditional spices.\n\nOverall, a nice place to dine and friendly customer service. I can definitely see this being a regular spot for residents in the neighborhood. It seems like a chunk of the business is delivery, hence the quiet restaurant.", "author": "Mansi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "I had the lunch buffet on a Sunday and it was superb. Tasted very fresh. The rice was perfect. I tried goat for the first time and it was delicious.\n\nService was prompt and friendly.\n\nI completely recommend this place.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Pretty nice indian place  for lunch , tasty tikka masala , rise is normal , samosa is not very tasty , bread is awesome . Lunch for two came out extremely cheap from buffet 25 dol", "author": "Maria O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Marina Beach.\n\nTraveled to Goa for this: https://www.youtube.com/watch?v=mqMy3fpzlb8\n\nTraveled to the Marina for this: Clay oven cooked Goan special platter of assorted seafood, chicken and veggies. Impressive quantity. Really impressive flavor.\n\nBarely a hint of oil like this two star disappointment: http://www.yelp.com/biz/great-india-restaurant-san-francisco#hrid:BuQAn0ZTcm4rS6Gfp6XgDA\n\nOnly additive was a squeeze of lemon and their assorted sauces as everything was placed in freshly baked roti and enthusiastically enjoyed. No need for anything else.\n\nService was friendly and attentive, prices reasonable at $14.99 + tax/tip. Atmosphere didn't stand out but everything else certainly did.\n\nBoth the music and the food were well worth the trip.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "There was nothing decent in the lunch buffet. The food felt stale and the drinks were subpar .", "author": "Anupam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Delicious lunch buffet w/Goan specialties as well as more traditional Indian dishes. The selection is always changing. The fresh naan is brought right to your table and the staff is very friendly.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "If wish there would be more stars to give! I ordered my foot via Eat24. It was delivered very promptly and it was simply amazing! Very juicy pieces of chicken in a Tikka Massala and Saag that melt in your mouth. Tandoori Chiken was great too. Fluffy rice! Yummy samosas.  I am impressed by the quality of this food. I hope it never changes.", "author": "Laurie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "Got delivery from them.  Pretty great!\nCan't believe half the indian joints in SF don't serve raita, but this one does and it is great and comes complimentary I think.\n\nHighly recommend.", "author": "Alex A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-06", "description": "This place was so good. The rice was perfect, the samosas were quite possibly the best I have ever had and my saag paneer was solid. Naan was not the puffiest that I've ever had but it was fine. Service was impeccable, speed was fantastic and the atmosphere was quiet. Wish I lived next door...well...maybe not because then I would be ten thousand pounds.", "author": "Christina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "Whenever I have a craving for indian food, Viva Goa is my go to. My favorite items are the Butter Chicken, Malai Kofta, and Chicken Tikka Kebabs. The flavor is great and if you like spicy (which I don't) they can definitely spice it up for you upon request. Their naan isn't the greatest. It's a little chewy and thin, but that's about the only bad thing I've experienced with them. Delivery is usually prompt and quick so no issues there. Average pricing for an Indian restaurant, for my wife and I it usually ends up costing around $40-$50 for food, but it lasts us a few meals so kind of evens out in the end. Highly recommend.", "author": "Amit P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "The chicken lollipops here are awesome and  so is the prawn xacuti and the goenchim sungttam and Goan chicken masala. The chicken cafreal lacks a little bit of spice and the paneer pakora seemed just a little bland.  We had the bebinca for dessert, but pretty much all 12 of us didn't like it - doesn't mean it's not authentic, just that the taste didn't do it for us. \n\nThe service was excellent and the staff was very accommodating to us, despite a getting there very late and then staying past the restaurant closing hours.", "author": "Archit L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "After a exhausting long bike ride over the bridge we were starving and wanted to eat quick and super close. This place was right next to our hotel. It was so delicious! Amazing tandoori chicken and the best chicken masala! The samosas were so good as well as perfectly delicious garlic naan. Service was excellent and food taste very fresh! I would definitely come back", "author": "Sheena O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Very home style food \nJust what we needed after a long flight in from Boston, beaten tired and HUNGRY\n\nThe chicken tikka masala gravy, the dal fry, the stir fry cabbage vegetable -- not too greasy, perfectly and authentically spiced - not made insipid to suit international palette. Just right. Bibingka dessert was heavy but good. Skip the gulab jamun. Price is right!!", "author": "Mridu D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Used to be frequently in this neighborhood but never stopped in this restaurant. My loss! The place is fantastic. Some of the best Indian food I have ever had. The family also loved their selections and for San Francisco this was not a bad price either. The service was friendly and prompt.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Amazing Indian food! Totally loved the buffet! Chicken Tandoori and Fish Curry are highlights! Service is exceptional!", "author": "Daya sagar N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "I had our food delivered and it arrived Hot & Delicious!  Everything we ordered was amazing--I would defiantly order from this restaurant again. I'm now a fan!", "author": "Lucillia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "This is by far one of better Indian especially Goan place I visited outside India. Being from west part of India, I can confirm place is very authentic when it comes to Goan flavor. Nice music, no added soda, perfect spice and aroma, hot and fresh ingredients and vey friendly staff. Whenever I am in the city I will come to this place time and again.", "author": "Adi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-10", "description": "Came here after a Yelp event around the corner since I was craving Indian food. The food was not that impressive considering this place has a solid 4 stars rating. It's a nice white tablecloth, somewhat romantic place. Service was nice, but the food just didn't wow me.\n\n- Mulgatawni Soup: not bad, lots of spices, and not too chunky\n- Tandoori Chicken: dry, lacked flavor\n- Goan Lamb Masala: good, flavorful, big chunks of meat\n- Garlic Naan: good and chewy texture", "author": "Linda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "I came while they were offering the lunch buffet. There were only two other people eating there, though admittedly they had just opened maybe twenty minutes prior. The buffet had things like veggie pakora, mattar paneer, aloo gobi, channa, gulab jamun...there were also a couple meat dishes, one Goan specialty too, so there is plenty for vegetarians and non vegetarians alike.\n\nThe staff were very warm, friendly, and attentive. There's parking on the street if you can find a spot.\n\nI recommend it for lunch, and would like to go back during non-buffet hours to see what else they have.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-27", "description": "San Francisco's best kept secret. Best place to try out goan cuisine. I recommend the the pork sorpotel, goenchim sungtam, chicken cafreal, and the prawn xacuti. Awesome fare. I wish somebody had told me about this place earlier.\n\nThe server patiently answered all our questions and helped us decide what to get.\n\nHere are a few tips if you are new to Goan or Indian cuisine:\nDon't order  dishes from other parts of India like tandoori or paneer  dishes. Ask the server to help you choose Goan dishes. (the same way you wouldn't order Italian at a Portuguese restaurant)\n\nIf you are a vegetarian, you may not have too many Goan options.\n\nGoan food is influenced by Portuguese cuisine and so some dishes like the vindaloo have a sweet and sour taste\n\nFor dessert, try the bebinca - 1 plate is enough for about 2-3 folks.", "author": "Sanjay V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-05", "description": "My Favorite Neighborhood Indian joint! Been here a dozen times with family and friends to celebrate everything from law school graduation to birthdays.\n\nFOOD:\nThis is not your typical Indian restaurant. Their specialty is Seafood and Goan curries with coconut or fish in it. They also have specialty dishes like Chicken Xacuti which are worth a try. The lunch buffet is great and gives you a chance to try a nice variety for under $15/person.\n*They used to have these amazing chicken and veggie wraps but they're not on the menu anymore. :( Bring them back!!\n\nSERVICE:\nThe service is not terribly slow but the owners here are so friendly and kind and a pleasure to chat with every time I dine here or pick up food!\n\nAMBIENCE:\nIt's a bit dark in here but spacious and comfortable.\n\n-Hungry Hungry Pongy\n\n*keep up the great work, Nicholas and Joseph and see you soon!", "author": "Sangita A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Amazing food!! I went to this one because the usual sea food restaurant Gajalee had closed for good.. But i found a better replacement now:)\nIf you love sea food goan style.. A definite visit! \nThe staff was nice and polite too.", "author": "Viddhesh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Loved the food. Ate here four times. First time xacuti chana and dal fry. Chicken lolipop is amazing and the best part are the cheese pakoras. Buffet is good for people who want to try all. I tried lamb bhunna fry. The lamb was not cooked. But the gravy was amazing. So if u want to try it. Just tell them to cook it little more. Service is excellent staff is great. Do try the navratan koorma. Only thing is the vindaloo they make isn't authentic vindaloo. Its more of a spicy tomato curry but still tastes good. I would recommend this over any other indian restaurant in bay area. Cheese tikka are also great for vegetarian people. The lamb chops are amazing here. All Goan restaurants make these dishes amazing. Just like my mom did.", "author": "Jake L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Authentic goan prawn curry. Good ambience. The buffet option is also great.. Great value for money..", "author": "Siddhesh R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Awesome place. Feels like a really expensive restaurant but prices are mostly ~$15. Waiters are super nice.", "author": "Marlon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "I've never been to Goa, but if this restaurant is anything to go by, I love Goan food.", "author": "ramesh g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-14", "description": "My friend had picked this place through Yelp and from the outside, it looked casual but once you walk in, the setting is romantic and clean for an Indian restaurant (probably because they just opened for 7 months now) The waiters were in proper attire (black dress shirt and tie). We were the first customers since we got there when they had just opened for dinner so I could not tell if it was a popular restaurant til an hour later, more people arrived. \n\nI had the Mango Lassi (Best ever! Must have!), Beef cutlets (in Goa they dip with ketchup) and Paneer Tikka Masala. Prices were reasonable and not only was the food presentation nice (Tikka Masalas come in clay pots) it was Delicious! I have to say it is the Best Indian/Goan restaurant ever! And I had not heard of Goa before so it was nice to learn. Menu also has many choices! Waiter also gave us Rice pudding on the house!", "author": "Sylvia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "Food:   5\nValue:   5+\nService:   5\nAmbiance:  3\n\nViva Goa is incredibly consistent in the high quality of delicious food, warm service, and unbeatable value. \n\nIn two years of living in the Marina, Viva Goa has become one of my favorite go to restaurants of any type.  They are worth a journey to visit.", "author": "Duke K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-29", "description": "I hate this restaurant so much , first they never take a shower , they are always greasy and just with looking at their greasy hair , I loose my appetite , I used to go with my friend , because she likes the food ( she never had indian food anywhere else , so she had no idea about good food ) . I once ordered chicken biryani , and they brought me cold rice from their fridge  , when I told them they got mad at me , so when we went there next time , they gave me attitude .\nanother time , my friend was going to use buffet for lunch , but I wanted to order food from menu , so he told me that I can't have any bread from the one he already brought to our table , and he kept checking on me at our table to make sure that I am not having anything from my friend's food who was actually using they buffet , it was SO SO SO SO RUDE , they are very rude people , their food is just ok . WILL NEVER GO THERE AGAIN .", "author": "Mellany A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "I really don't know much about Goa other than rumor of it's gorgeous beaches and that I need to visit someday.  What do I know about Goan cusine?  Again, nothing, really, but if the food at Viva Goa is representative of the actual place, then I'm sold!\n\nAs compared to the usual Indian/Pakistani haunts, the menu here contains a lot more seafood, some pork, some coconut based items, and quite a few dishes I'd never heard of.  Awesome. \n\nChicken tikka masala- my favorite standby, delicious.  Garlic naan was on par with my favorite Tenderloin restaurant's.  Samosas-  standard, but not at all in a bad way.  And one Goan dish-  vegetable xacuti - lots of spicy deliciousness in there. \n\nDefinitely trying this place again, and probably going for some seafood dishes too.  \n\nThey offer free delivery-  wait time was about an hour.  I can't tell you how glad we are to now have this place on our short list for delivery options in the city.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-10", "description": "When I saw that at least half the buffet was your usual Punjab fare, channa masala, allo gobi, mattar pander, etc. I was bummed. I mean, hell, it says GOA on the sign! \n\nAt least, it was good. In fact, I loved the okra masala. Excellent, attentive service. Reasonable price for lunch. I want to come back for dinner and try some dishes from the restaurant's namesake Indian state, Goa. Until then, three stars. Hoping for more!", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "We visited this restaurant to taste some authentic home style dishes from Goa. The food was great. Service was also very courteous especially since we landed at the restaurant about 15 min prior to closing. If you do go here, try the pork sorpotel. This is by far the best preparation I have had in a restaurant.", "author": "E G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "This is an amazing Indian restaurant. I have been there many times, for buffet, dinner or ordering delivery.  The butter chicken is great. The xacuti is excellent. If you like Indian food, this is a the place. Also note that this is a...Goan place and that they have a couple of beef dishes to check out. Service is fantastic and they are so friendly.  The location is not fancy but the food speaks for itself.  I am an Indian food fanatic and know all the best places in the Bay Area. This is top of my list. Watch out Amber India.", "author": "Christophe B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-29", "description": "What their actual Goan food may be like, I don't know, but their lunch buffet is your basic Indian stuff with some tasty curries (one with green beans, one with fish being the most unusual).  This was on the weekend so the price was more ($11), and hence the selection possibly better than during the week.  It wasn't the restaurant's fault that a large table of young women were having conversational fun so piercingly loudly that even at the far end of the room the noise was unbearable.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "We've been here a couple of times and I have to say I really like their curries. It's the closest to the curries I was used to living in the UK, which of course is renowned for having some of the best curries outside of India.\n\nThe service is top notch too!\n\nOne downfall of the restaurant is that they don't seem to be able to make proper fluffy Naan Breads. If they could improve that then I would definitely give them a five star rating!", "author": "Carl F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "My sister and I came here a few days ago and we were very impressed by the food and the customer service. I ordered the Vegetable Caldin and my sister ordered the Vegetable Xacuti, which is a curry that is from Goa, India. \n\nWe also ordered sides of rice, naan, and roti. We sampled each others' dishes and I prefer the caldin over the xacuti. It was DELICIOUS. This was some of the best Indian food I have ever had. \n\nThe waiters and hosts were very kind and frequently made rounds to see if we needed anything throughout the duration of our meal. There was also a buffet going when we got there which looked like it had a lot of variety. \n\nMy only problem with the place was that it was really stuffy and hot. When we left the restaurant and were hit with wind and fresh air I wondered why the heck the heat was on in there!", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "This place is awesome.  For the quality, the prices are more than reasonable.  Also, the owners are really friendly and will happily make your dish spicier if you request it.  \n\nRecommended: Fish Curry, Chicken Tikka, Prawn Xacuti, Fish Ambot Tik \n\n(I'd add more but those are the only dishes we've tried so far.)", "author": "Dagmar H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-26", "description": "This is a review of their lunch buffet only. Was around on a Friday to eat and saw that they had a $9.99 lunch buffet. Was a little disappointed when walking in because it wasn't that large of a selection of items as well as not as tasty as I have had before. First, a couple of the dishes were not heated properly, the tandoori chicken was a little cold. The honey/milk/rice balls were warm. Only5 other dishes that were fairly standard but not impressive. There was no butter chicken or curry option other than a chicken tikka masala. Maybe I will come back to try the dinner selections and will be more impressed, then edit my review.", "author": "Lei A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "i defiantly recommend this place for those who love Indian food, this place is a very calm place to eat customer service is excellent. they have buffet during lunch hour, also nick the owner is very friendly and do care for there customers im planing to bring my wife there for a dinner thank you for the service.", "author": "Sod F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "This place is astoundingly delicious. We tried it for the first time tonight and the food melts in your mouth. I special ordered a fish tikka masala and it's the best I've ever had in my entire life. Whoa! I'm so pleased to know this places exists. We also got the chana masala, the baigan bhartha, and the saag paneer. Soooo good! I can't tell you enough how scrumptious this meal has been. If there were ten stars on Yelp, this place would get it!", "author": "Mei F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Incredibly tasty saag channa and papadam! Very attentive courteous staff. Excellent quick service. The level of spice was ok, but the spicy seemed to be more of a hotter medium.", "author": "Noel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "I have been to this restaurant a couple of times but this time I could not resist myself to write about them. I went to Viva Goa with my friends on Sunday night. Ambience of this restaurant is really good with rose and candle on the table. I went with two vegetarian and one non- vegetarian friend. After entering the restaurant all the staff members and owner as well greeted us with smile. We were suggested to try vegetable caldin and paneer tikka masala in veg and fish masala fry, chicken xacuti. Trust me best Indian food I ate so far. We were served with rice and garlic nan. Rice was aromatic and nan was crispy. After eating this much my friends were craving for some dessert. We decided to try pistachio kulfi and bibinca. Kulfi is milky Indian ice cream. And bibinca was traditional Goan sweet. Really enjoyed our dinner in Viva Goa. Overall best service, best food and best ambience. I will highly recommend Viva Goa to anyone looking for best Indian food in Bay Area. I know I will certainly be returning soon. Cheers", "author": "Roshan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Viva Goa is consistently good. It's our go to take out place and pretty much go to for Indian food. Every once in awhile we will actually eat at the restaurant. The staff is always pleasant and attentive. One of theses days I will make it to their lunch buffet.", "author": "Tiffany G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-28", "description": "The 2 stars go for the good food I've had in the past. \nThe missed three stars for the way you treated me today!\n\nI am starving, call the restaurant to place a pick up order, guy takes my number and name and says he'll call back. Waited and waited and no call. I AM STARVING!!!!\n\nAnyway, he calls while I was picking up food from another restaurant. \n\nThanks a lot! You just lost one loyal and local customer who comes there often. Whatever it was you were doing or talking to was more important than attending to your customers.", "author": "E_sg I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "My friend and I came here on Saturday after deciding on the cuisine and because of the sum of stars on Yelp. \n\nWe were seated immediately and food came out pretty expediently.  My friend urged me to try something different, so I selected at his behest, the chicken vindaloo (medium), he the lamb basmati.  Holy SPICY! Apparently, I should've ordered mine mild! Spicy or not though it was sooooooooo very good. I then ordered the chicken tikka masala (what I usually order).  Don't look at me like that.  I didn't eat ALL of it! It was pretty tasty - but at comparing both sides of the fence, the grass was greener on the vindaloo side.  Don't get me wrong - the tikka masa was very good. \n\nThe Garlic naan was some of the best I've encountered.\n\nWe left full (I'm sure you're shocked!) and happy.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-23", "description": "As usual, when I have a wonderful dining experience I like to write a review about the restaurant here on Yelp.  Sadly, as much as I enjoyed the dishes we tasted at Viva Goa, I am going forego the review about our meal and rather write about my disappointment as they OVER CHARGED us for our meal and added a 30% gratuity to boot.  In addition, we had a $55 groupon for a pre-fix meal for two and although they honored the groupon, they did not have a pre-fix menu.  ???\n\nWhat we ordered:\n2 Veggie Simosa at $3.50 each\n1 Goan Mussels at $7.99\n1 Lamb Vindaloo at $10.99\n1 Goan Chicken Masala at $9.99\n1 Basmati Rice at $1.99\n1 Raita at $2.50\n1  Naan at $1.99\n1 Garlic Naan at $2.99\n1  Bottle of Wine at $18.99\n\nTotal should have been = $64.43 (I can add)\n\nWhen it came time for our bill, we received an invoice that read\n\n$55 \n1 Basmati Rice\n1Raita\n1 Naan \n1Garlic Naan \nGratuity $18.33\nTotal    $96.76\n-$55.00\nDue  $41.76\n\nNow if our meal was a total of $64.43 + .05% health tax at $3.22 + .085% at $5.48, our total bill should be $73.13\n\nAdding a 20% gratuity (WHICH AGAIN IS NOT MANDATORY AND IS ONLY A GESTURE) should have been $14.63\n\nWhich brings us to a grand ole total of $87.76\n\nNOT $96.76\n\nSo why did we pay an additional $9.00; I do not know - it is a mystery to me. \n\nIn closing, I'd like to say . . .\n\nDear sirs of Viva Goa - next time be prepared to honor what you solicit...  that is, if you offer a pre-fix meal for 2, HAVE A PRE-FIX MENU.\n\nIf not, then ITEMIZE YOUR BILLING INVOICE; do not just write a number and expect people to pay it.\n\nLastly, tipping is not, I repeat NOT MANDATORY and it should be to the discretion of your dining guest to decide what they feel is appropriate for tipping -which could be anywhere from 10%, 15% or 20%  \n\nNOT 30% which is what you put on our bill!  Shame on you.  \n\nI wanted to like you - but I will not return based simply on bad business practices.", "author": "Cris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "I WISH I COULD GIVE IT A 5! But the food wasn't spicy enough! Even though we ordered it super spicy. I'll admit my taste buds like it hotter than most peeps, but this was seriously nothing...not a single drop of sweat!\n\nThe service was superb! Always there for refills :) Very attentive! Always checking up on us, & giving great recommendations.\n\nMy bf and I went after going to the Exploratorium. We were a bit skeptical because the place was DEAD when we passed by. But, when I come to think of it...it was only 5 pm. It gets dark so quickly! Tricks my tummy into thinking it's dinner time! Lol. As soon as we were seated a bunch of parties came in! The place was popping!\n\nThe venue was nice - well lit [dim/diffused] - comfortable - & definitely spacious enough. All of the servers were very nice! Always checking up on us every time they passed by with big smiles on their faces. :] \n\nAs an appetizer we ordered vegetable mimosas! They were ABSOLUTELY DELICIOUS! By far my favorite part of the meal. I'm sure I'm going to have cravings for these when I get back home to Hawaii. Crunch crispy goodness, with a hint of spice. \n\nWe also ordered regular nan and rice - to go with our yummy chicken vindaloo! The sauce was a bit more saucey (versus being thicker) but it was still packed with a lot of spices. The dish was full of a lot of flavor! Just a bit more spicy and it would've been perfect. The tandoori chicken was good too, it was cooked in an oven - but the chicken was similar to BBQ chicken. Seasoning was good.  \n\nThe indian food wasn't as traditional - a little bit more of a modern spin. But overall I loved! VEGETABLE SAMOSAS ARE A MUST!!!!\n\nI heard there is LUNCH BUFFET!!! Toooo bad. Next trip, I'm definitely trying it.", "author": "Megan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "Good stuff! Just might be my favorite Indian restaurant in SF (for the food, ambience is okay but I did a pick up to go order).  Malai Kofta and Chicken Tikka Masala were excellent and they understood what \"spicy\" meant.\n\nOnly negative is that the Mango lassi was a bit strong on the fake syrup so it was a wired orange color.  Still tasted like a typical restaurant mango lassi, so it was okay I guess but definitely not the place to go if you're hoping for an authentic fresh mango lassi.", "author": "Buddha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "Just stopped in for lunch, and I was very impressed.  Goan Indian food is distinctive from other regions because of the spices and the fish.  We had the lunch buffet, and were glad to have the staples of Indian food (samosas, dal and chicken tikka marsala) as well as some Goan specialties like the white fish and the spicy vegetables.  Ate to my heart's content, and had some tea to finish.  \nThe owners and wait staff were friendly, happy, and helpful.", "author": "UnitedStudios S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "This is the best Indian restaurant in the city. My husband always orders the chicken tikka masala and I get the malai kofta. We ask for spicy and they are always spot on with the spice. The flavorings are amazing, probably some of the best Indian food I've ever had. Our relatives also love the fish dishes here.", "author": "Chital S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-18", "description": "I wasn't sure what to expect after reading some of the reviews but after a drink at Balboa, my beau and I decided to fill my insatiable appetite for Indian food here.  \n\nAWESOME.  The BEST Indian food I've had in a while and I don't know what the other yelpers are talking about but the service was great!  I ordered Plain, Garlic and Paneer Na'an and they were really good.  We had all three of our curries medium hot to hot and it was just enough to break a sweat.  \n \nYou have to try the mango ice cream like thing for dessert.  It's like a frozen mango lassi but better.  We were stuffed to the brim with three curries, three na'ans and rice for two people but we found room for it at the end.  \n\nDELICIOUS, REASONABLY PRICE, FAST AND DID I MENTION DELICIOUS?  I'm not Indian nor have I been to India but owning a hotel makes me an honorary Indian since that is all we eat at our corporate meetings.  It's good.", "author": "Suz L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "Let me start off by saying that the service is absolutely first class. \n\nI had already eaten lunch, but I came here with my friend and ate a second lunch. This has been a reoccurring theme in my reviews. Ugh, even yoga can't save me now.\n\nWe had their all you can eat lunch buffet. For $8.99, you can't go wrong. It's not one of those horrible buffets where you get lettuce, soggy, nasty whatever have you, but it all seemed to be pretty legit dishes.  I can't even remember all the dishes, but the Goan fish curry stood out to me as the sauce was flavorful and the fish was uber juicy, if you can even describe fish as such.  I also really enjoyed this Chicken Mi---- (the name eludes me).  The garlic naan was piping hot fresh and crispy. MMmmmm!\n\nDesserts--\nWe had this traditional Goan dessert: Bebinca, soo yum! It's made of refined flour, coconut milk, and egg yolk. Kind of reminds me of bread pudding, but better and layered. \n\nWe also had their homemade pistachio ice cream. It's so frozen, but so creamy at the same time. How does that happen?\n\nDid you know - one of the owners personally delivers food to your door if you order with them? That's pretty rare for an owner to do, so kudos to them!\n\nBottom line: I had no idea what or where Goa was, but I got a small history lesson, culinary lesson, and really great food.", "author": "Dolores L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Hi ,Viva Goa Boys, I like to appreciate for your good food & service especially my wife like your Tandoori chicken & Recheado pompano fish, flavors were good and fish ,chicken was fresh & food was really good test ,thank you.", "author": "Francis F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "I have the luxury of having my office cater my lunches everyday. It's really awesome because they bring in local restaurants and then I can try foods and then take my awesome boyfriend to these places at a later date. Unfortunately my guy is not a fan of Indian food, so whenever the office sends out an email saying were bringing in Indian Food, I get extra happy because I can get my fix in. \n\nToday was that kind of day, and I was fortunate to try Viva Goa. While I never had Goan food before, I was definitely open to it as it seems similar to what I have eaten at other Indian restaurants.\n\nThis place has awesome food. The spice in it was perfect for me (and I am a big fan of spicy food) and the flavors complimented the spice so well. They brought us the following: Vegetable Samosas, Goan Chicken Masala, Vegetable Caldin, Chana Masala, and Naan. I tried it all and loved everything. The Samosas definitely had more of a kick to them than anything so if you aren't down with spice, I would recommend opting out of them. \n\nI am not sure I will actually go and visit the restaurant considering it's in the Marina, and I live in the Sunset, and the boy isn't a fan of Indian Food, but that shouldn't stop you! If I can find an Indian Food buddy I will definitely make the trek out there. At least I can look forward to the next time my company sends an email telling me Viva Goa is catering lunch.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "VERY good chicken tikka masala. Service was excellent. Restaurant and bathroom very clean. Good prices.", "author": "Julio L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-16", "description": "Forget it!  Damn, I am so tired of the lack of service and communication.  On numerous occasions, buddies and I would call in an order for delivery and always have issues with the person on the phone.  They could never hear us on the phone and act as if it was the customers fault.  So tired of this crap! \n\nI do have to say the Samosas and butter chicken entrees were good, but the lack of service when ordering for delivery kills it.   To the owner - We will never order from you again!", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "I never write reviews, but had to for this place. Everything about this meal was perfect. The staff is incredibly attentive, quick, and their recommendations off of the menu were fabulous. Shrimp appetizer, chicken lollipops and lamb vindaloo were all out of this world. We've also done takeout from here and that's been great as well.", "author": "Neda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "Pretty solid Indian spot in the Marina.  Everything we had was excellent and very reasonably priced.  They also deliver which is a plus!  I will also say the service was excellent which only added to the experience.  This is definitely a place I will be back to without a doubt.  I recommend the Samosas, the Tandoori chicken and the garlic naan.  My sister had the Chicken Masala and that was very tasty as well.", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-14", "description": "Worst Service EVER!!!!!!!!\n\nThe servers are ultimate RUDE and impolite!!! \n\nTalked to us very badly and not just one server....two!\n\nWent in to celebrate Mothers day! Food came in so late......just because we wanted another table ( cause we had a toddler)..... They got so openly irritated! they did not change the table sheet, no fresh glasses, no silverware....had to ask for every single thing!...\n\nWE WILL NEVER GO THERE AGAIN...n Will NEVER recommend it to anyone!\n\nDID not enjoy the food cause of the service! such a horrible 'celebration' !", "author": "sindu m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-04", "description": "Was looking for a food joint near exploratorium in sf and found this one on yelp with I think 4 stars ... Well I have never been so dissatisfied and disappointed by yelp reviews.\n\nThey took at least 15 mins to take our order and another 30 mins to bring it out and to top it all the food sucked \n \nWould not recommend this place to anyone", "author": "kungfupanda l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "Definitely a come-back place. Three of us shared Fish Ambot Tik (a \"spicy and sour\" Goan dish), Chicken Vindaloo, and Lamb Saag. Accompaniments: onion naan and garlic naan, and basmati rice. Each dish was unique and delicious, with lively spicing and plenty of sauce to sop up with naan. The naan was made in the tandoori oven and was beautifully crisped and hot - much better than any other Indian restaurant I have eaten in (and there have been many). The service was attentive, friendly and unobtrusive. The restaurant has a neighborhood feel, not overly upscale but nicely decorated and quiet. I highly recommend it.", "author": "Mari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "It was recommended by a friend, and he was right the food is really good..indian-portugese cuisine.. Now my turn to pass the invitation to anyone who likes good curry and meaty food..", "author": "Marnie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-02", "description": "I have both discovered Goan food, and some of the best Indian I've found in SF.\n\nExcellent seafood dishes, the spices are amazing and the service is fantastic.\n\nI would go back here in a heartbeat :)", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "We consider ourselves pretty knowledgeable about Indian cuisine and have had more than our fair share of Indian restaurants - Viva Goa had a beachside twist to it, many seafood dishes here you wouldn't normally see... prawns and fish and things, we didn't order any of those. We had an average waiter who was nice, but too pushy with suggesting the Goan dishes and dessert at the end. Thankfully, the food made up for it. We ordered three vegetarian dishes: saag panner, the Goan chickpea dish, and the dark thakar dal. Also the cherry-nut stuffed naan, the potato stuffed naan, and mango pudding. Everything was completely delicious. Must-go!", "author": "Meralyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "This is the place if you crave Indian food but do not want to be seen in yet another Chicken Tikka Masala factory.\n\nThis place is different, Goa different. The servers are authentic Goans, relaxed attitude, pony-tails and all. The menu has a smattering of exotic sounding foods ('Xacuti', 'Ambot Tik' anyone?) embedded in enough comfort Indian fare for those little less adventurous. It is easy to spot the Goan cuisine, they are the ones with an appropriate green Coconut tree clump icon on the menu. Perhaps green mary jane leaves would have served as well.\n\nFood is yummy. Have no fear and order your Xacutis, Goan curries, Ambot Tiks or Vindaloos.\n\nTips: You can order the Ambot Tik with shrimps instead of fish off the menu. Do not, I repeat, absolutely do not, pass on the dessert, and order the Bebinca, it's nothing like you would get inside or outside an Indian restaurant. Remember to ask for some extra whipped cream with it, you will need that.", "author": "Sujoy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Just moved to SF and tried a bunch of Indian places in the city.  Nothing has compared to Viva Goa.  Probably some of the best Indian food of any state.  By far the best garlic naan and mango lassi I've had.  And the prices are affordable.  For $43 we were able to satiate two adults and couldn't even finish the cheese masala!", "author": "Emmanuel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-18", "description": "Loved the ambiance of the place - small and intimate restaurant with white table cloths with red napkins and red roses, waiters wearing red shirts and black slacks. The staff was beyond nice and the food was incredible.", "author": "Magda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Excellent food. Homey little family restaurant on Lombard. Excellent for families early.", "author": "Joshua J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-18", "description": "Dear Viva Goa,\n\nThank you for making me Paneer Tikka Masala, a most delicious dish.\nYour prices are reasonable and you deliver to my door. I feel our relationship will only grow and flourish from henceforth.\n\nWarmest regards,\nRachel", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "Excellent, bit different and healthier than usual Indian fare.  Staff were very friendly.    Lots of vegetarian options.   Worth going of of your way for!!", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "Just came from lunch - the buffet is still very good (tasty, wide variety, fresh), the service good/friendly and the facilities/tables (each still with a fresh rose, which shows a certain level of care and pride) clean. Glad to know they're still around and are on top of their game. A very worthy unpretentious alternative to the more \"upscale\" places on Chestnut and Union where no real ethnic eats are to be found.", "author": "Es E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-28", "description": "lots of cream, not too healthy. good if you have a few bites but tummy will be hurting after.  good they deliver though.", "author": "Ethan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "The only unpleasant part of my experience at Viva Goa was having to listen to my fiance audibly moan in pleasure as she ate their food.   I haven't seen her that satisfied since the first few weeks of our relationship, when we both gave a shit.  \n\nSeriously fantastic food, and spectacular service at a fair price.", "author": "Mr. Papshmir .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "This is out go-to Indian takeout!\n\nHighlights: garlic naan, butter chicken, and chicken tikka masala\n\nTo know: They \"spice down\" so if you can handle \"medium spice\" level at other Indian spots - ask for \"spicy!\n\nDine-in: Nicely decorated and very helpful staff - but parking is tricky because it's Lombard St so plan ahead or bus there.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-06", "description": "I thought I wasn't going to be able to find delicious, authentic Indian food in the Marina, but boy was I happy I was wrong!\n\nThis place is awesome! The dishes are flavorful without being too greasy or too heavy. Try the tikka masala (curry chicken), saag aloo (spinach and potatoes), or baingan bharta (eggplant curry) with a bit of tandoori shrimp and you've got a complete, tasty meal. \n\nThe service is great, too. Say hello to Joseph, Mark, or Nicholas next time you're in there. Tell them John and Cat sent you and they will take good care of you.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-21", "description": "We ordered the chicken cafreal and the fish xacuti. For desert we had the bibinca (?). The fish was great, a bit on the spicy side but that's what we ordered. The chicken cafreal was very very over cooked and chewey. The salted lassi was too thick but the bibinca was very nice.", "author": "RP K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "Great Indian food however they did over charge us as well!! That is why I am sadly giving them three stars, the food was amazing and I would recommend it however I dont enjoy having to have an awkward conversation with the waiter about how he was trying to overcharge us! I'm glad I read yelp reviews prior to going bc I may have over looked the bill ( it was a $10 overcharge)", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "This was my second time here, first time for the buffet and it was great! The food was amazing across the board.\n\nMango pudding with pineapple, Goan salad, vegetable samosas, mushroom mattar, vegetable vindaloo.. the list goes on and it was all delicious!\n\nAlmost the entire buffet was vegetarian as well, which was nice to see.\n\nI won't hesitate to go back.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "This is excellent Goan food (basically Indian food with a seafood/coastal twist). I really like most things on the menu, but the main issue here is the location. When Chestnut and Union are only a couple blocks away, it is so difficult to want to go to Lombard. There is something nice about getting out of dinner and walking on a nice street, and Lombard--let's face it, it literally *is* highway 101 (look at a map if you don't believe me). That makes it scary. \n\nViva Goa, I hope you move to another street one day so I can bask in your culinary greatness.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-07", "description": "The best indian buffet in the bay area bar none!\nThe best 10 dollars you can spend on food in SF in my opinion.\nI spent over 3 years in india and consider myself a connisseur, and let me tell you these guys do truly unique regional cuisine of goa which incorporates more seafood and coconut generally....\nso good.", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "Ate here once with my husband since he works close, and have been thinking about it ever since! \n\nThe place offers a wonderful lunch buffet, not a million options, but the point is, what they do have are the RIGHT options.. Everything I really love and they do it all VERY well. \n\nThe service is beyond amazing. They make sure you are pleased with your food and are very kind. I can't wait to go back!", "author": "Clair C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "This has been my go to spot for Indian food since I moved to the city a year ago.  The food is delicious, and they are good about asking how spicy you want your food...in my case medium is usually safe from here - I can handle spicy food, but eastern foods seem to have a different scale.\n\nI am writing a review today, specifically, because we ordered delivery last night and it took an hour and a half despite them telling me it would only take 45 minutes.  I complained to the manager about it because by the time the food arrived at 8:15 it was way past the time I wanted to eat dinner, as I was planning to going to bed shortly thereafter.  The manager apologized profusely and made it right.  Because of how he handled it I will continue to frequent Viva Goa and recommend it to friends and fellow yelpers.", "author": "Tony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "If you've never had Goan food before, PLEASE do yourself a favor and stay clear of stuff you'd normally see on a typical indian menu like the chicken tikka masala and such. Goan restaurants are not all that common and more so rare are good ones!\n\nGoan food is highly fish-centric so I'd suggest the shrimp or fish curries. They have a slight spice to them without being overwhelming or killing the tate of the food. I think they definitely hit the mark on authenticity.\n\nThe waiter also was very helpful and explained all the dishes to us (and I'm indian--didnt make me feel like a fool for not knowing).\n\nThe loss of the star comes from the decor; a little bland. Something more fun would be nice but I think for a casual lunch or dinner it wont matter.", "author": "Ash S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-12", "description": "I wish I could say good things about this place but I was left quite disappointed after my first and probably last meal here. I am from Mangalore, which is an Indian city not too far from Goa, and both these places have a LOT of common elements in their cuisines. I was extremely happy to find this place reviewed so highly on Yelp! and convinced my fiance to take me there when I was visiting last weekend. We tried the following dishes from their menu:\n\nFish cutlets - These were decent; there were 2 big patty portions coated with semolina (rava) which gave them that extra crunch. I wish they served them with some other condiment than plain old tomato ketchup!\n\nPrawn Xacuti with rice - My Goan friend in Chicago made chicken xacuti the other day and it was SOOOO GOOD, I can almost smell and taste the curry in my head!! Unfortunately, Viva Goa's offering was a terrible let down. The xacuti masala didn't seem fresh at all. The dish felt like it was just stored away in the freezer, taken out, reheated and served to us.\n\nSeafood Biryani - The rice grains were well cooked and long. I think the seafood consisted of calamari, scallops and crab meat (or was it fish? I don't remember). This dish was passable but nothing to brag about.\n\nPork Vindaloo - This one fared the worst! We ordered this after making sure that there were no big pieces of pork fat in the gravy. The gravy looked like something you'd get at a Chinese restaurant - red, soupy, thick. It tasted horrid and I felt like there was tomato ketchup mixed in it. The Goan \"vindaloo\" is very similar to the Mangalorean \"indaad\". This dish did not come anywhere close to what I have been eating all this while in India.\n\nBebinca - My favorite Goan sweet of all times! I had to have this for dessert. What they served us was 4 decent sized pieces. The bebinca was a bit dense but this could probably be because it was not freshly made (the cooking process is quite long and tedious) and was stored in the refrigerator. I still enjoyed the dish!\n\nAll in all, this experience was a disappointment! I will have to rely on my friend to satisfy my Goan food cravings until my next trip back home :) Her mum's prawn balchao and mole are A-W-E-S-O-M-E!!!", "author": "Raquel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "I can't say anything except this place is simply delicious.  We've ordered several times from here (always getting something new) and are never disappointed.  If you like Indian and have never tried Goan cuisine...you have to give this a go.", "author": "Zoran L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "I recommend this place to anyone! Delicious Indian food, and outstanding customer service. I mentioned that I had never tried Indian dessert, and our server brought us some for free. Great place-I'm definitely going back!", "author": "Jenelle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-08", "description": "This place is wonderful!\nA lot of Goan dishes layered on top of your traditional Indian dishes.\nThe service is very friendly. One of the owners was there and was helping all the tables choose their dishes. \nWe got-\nGoan Mussels: interesting mussels on a half shell covered with a red paste. Very flavorful.\nRechardo Pomfret Fish: n entire fish stufed with curry. Very tastey and tranditional Goan cuisine.\nLamb Xacuti: another Goan specialty. Taste similar to lamb curry but the coconut adds a nice layer.\nVegetable Caldin: love the coconut flavor!\nNaan\nRoti\nBebinca: this apprently takes a long time to make and is usually saved for special occasions. I didn't like it so much :)\n\nAll in all you must try this place and go for the traditional Goan dishes.\nThey also have a lunch buffet where on Sundays they serve goat!\nCannot wait to go back for the buffet on Sundays!!", "author": "A S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "Great food! Nice ambience. The service is unobtrusive but at the same time attentive. \n\nMy only complaint is that the okra in our veggie dish arrived overcooked. But the accompanying sauce was fantastic! \n\nWe had an onion naan that was hearty and generous with the onions. The skin of the naan had that crisp chewiness to it that all good naans have. \n\nWhen they ask you the spice level and you say \"mild\", it doesn't come spicy at all. I think they err on the side of caution with the levels of spiciness so if you like heat in your food, ask your server to describe their different levels of spiciness.", "author": "Daniel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "Get the butter chicken and garlic naan -- that's all you really need because it's AMAZING!! Best butter chicken and garlic naan I have ever had! The prices are totally reasonably, the food is incredibly delicious, and the service is attentive, polite, and warm. We went with a group of 7, shared everything family style, and had a delicious meal.", "author": "Jamie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "Delicious food, loved it. Without knowing or reading reviews about this restaurant just we ended up here for Lunch buffet, while walking around the city this week. It was worth it. Just 9$ for full meal lunch, perfect. They had Veg as well as non-veg options. I had only vegetarian food. For buffet, they had two Salads, papaya, Mango keer, 3 types of chutney, Samosa and Veg Pakoras, Mushroom-Paneer-Mutter curry, Aloo-Gobi (potato - Cauliflower), Daal, Rice, Channa Masala (Chick peas curry), Naan (Indian flat bread) and Gulab jamun for dessert. \n\nWe would definitely go again to \"Viva Goa\"", "author": "Subbu R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "Had a couple really good dishes here, pork sorpotel and prawn xacutti. Perfectly cooked proteins (stood up to delivery), with complex curries and sauces. The sweet and sour sauce on the sorpotel was particularly nice, not the standard chinese style cloying sauce, but well balanced and interesting.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-01", "description": "A place in the heart of SF in the Marina district....newly opened..you would think they would come up with a new concept.\nThis place does not fit the Marina style....hole in the wall...poor decor, which has kept it's cost down so that's still ok \nFood....TERRIBLE!!! It's the same generic food that you get in the other cheap indian restaurants that survive just on buffets. \nFish curry was horrible.....nothing fresh about it. Curry is the same with fish or shrimp or lamb thrown in according to your order. It did not have any freshness. Tomatoes in the curry were likely out of a can....it's california...how hard is it get fresh tomatoes and spices?????\n1 star is for the customer service....everyone was very nice!\nFor a city known for the best foods in the world ...this definitely is not even close to the other new restaurants coming up here!!", "author": "Justyna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "Being a mangalorean christian I LOVED THIS PLACE. We were worried after reading the reviews and thought we should try the buffet to be safe. The fish curry(mild spice) was spot on and so was goat curry and chicken tandoori (perfect), we are not found of spicy food that kills your taste buds, but tasty flavourful food and Viva Goa delivered. Looking at the menu I could not resist but order Pork Sorpotel(traditional goan/mangalorean pork dish - not for the faint of heart it has pig intestive, tongue, heart, stomach and meat) and fell in love with it (this dish is meant to be eaten the next day) so I got the left overs to go and enjoyed it the next day and the day after.\n\nNOTE: Good Indian food is not traditionally spicy.", "author": "Charel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "The best chicken 65 I ever had in USA. It's been so long that I got the taste of food which was a lot more similar to the food in India. I can say that this is the best authentic indian restaurant. I strongly recommend to all of u guys. The service is super fast and great.", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "I'm really glad there is good Indian food in the neighborhood.  Love the samoas, naan, and chicken tikki masala.\n\nI thought the service was great too. \n\nCan't wait for my next trip to try additional items.  I'll have to try out delivery too.", "author": "Shelly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "I've eaten at a lot of Indian restaurants in the Bay Area and I have now found my spot.  Viva Goa is a great little restaurant that has some of the best Indian food around.  Quality food and exceptional service are hard to find but this place delivers.  \nI do feel that they are understaffed as the food can take a while but I am never complaining once it arrives.  \nI used to go to Tandoori Mahal all the time, but I won't go back there now that I have found this great restaurant.  \nMy girlfriend and I always get the Chicken Tikka Masal and Chana Masala with rice and garlic naan.  With Chai tea, the bill comes out to about $35.  More reasonable than Tandoori Mahal.  \nViva Goa!", "author": "Devin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-30", "description": "Really good Indian food on Lombard St/ Downtown SF. \nAuthentic taste! \nJust wish their servers could smile a bit more! :) \nThey generally came across as cold and serious. \nBut we had a superb meal after a couple of food tragedies in nearby Indian restaurants..", "author": "Shishir S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "There are no cheap foods in the Marina.  But you can find great value!  \n\nViva Goa is one block from my shop.  Their bright and colorful sidewalk sign is what got me to give them a try.  I've been here about four times.  $8.99 for all you can eat Indian buffet lunch in the Marina is too tough to pass up.  \n\nThe buffet is pretty standard. Unlimited fresh and hot nan is served.  Traditional dishes such as butter chicken, chicken masala, tandoori chicken, curry vegetables and curry fish is served alongside basmati rice, samosa, fresh salad, chutney, and desserts such as bread soaked in syrup and rice pudding.  The food is delicious.  Everything tastes fresh even though it is buffet-style.  The staff is friendly.  The price is right.  I enjoy dining here.", "author": "Gloria Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "A decent indian place near my house! Yes!\n\nThe service was friendly and attentive, although the latter may have been helped by the place being half empty. The food was also good. We had the chicken biryani, the fish masala and the garlic naan. The chicken biryani was pretty good (the portion was large enough that we took home half of it as leftovers). The fish masala was tasty and went quite well with the garlic naan and some rice.\n\nI'll have to try out more of the menu later.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "OK so i already wrote a 5 star review, but i am writing an update to really get my point across:  THIS FOOD IS DELICIOUS!  On average I get dinner delivered from Viva Goa once every week and a half or so.  Before discovering Viva Goa, Indian food did not happen for me very often, as there is a serious shortage of decent indian spots in this part of town.  Needless to say, I have turned into a one-woman PR machine for this place, telling everyone who will listen to go there because i want to make sure they stay in business to feed my addiction.\n\nAdmittedly, my experience with the menu is limited because I am having a hard time branching away from the Chicken Tikka Masala because it is amazing!  (and just spicy enough to make me sweat a little when prepared \"medium\").  But why fix it if it aint broken, right?  I recently traded in the vegetable biryani for the Aloo Gobhi in an attempt to cut down on the rice (although potato and cauliflower instead is not much of a carb cut).  The Aloo Gobhi- although i am sure I am pronouncing it wrong, is a great addition to my dinner routine.  I highly reccomend the food at Viva Goa, and the people are awesome as well.", "author": "Kari P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-13", "description": "I like chicken xacuti, vindaloo. Malai/paneer kofta is delicious but paneer makhni is ok ok. Breads are fresh.  The staff is attentive but little slow.", "author": "Astha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-24", "description": "They have a lunch buffet for $8.99 and it was pretty crowded on a Saturday afternoon. They had about 5-6 main courses, rice, salad and samosas to pick from. They also had several dipping sauces including raita. The food was good, but not stellar. \n\nService was great and we got our naan refilled very quickly.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "My favorite Indian restaurant not just in San Francisco, but Bay Area! I've been looking for a great Butter Chicken ever since Nawab closed in San Mateo. This was even better. I was impressed with quality of food in all other dishes as well. Well balanced flavor with hint of spice. Major Yammmm!!!", "author": "alex c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-18", "description": "Pretty solid, standard Indian food. I wasn't terribly impressed, but for the price, it was good. They had a relatively quick delivery. I noticed quite a bit of grease on top of each dish - something to be expected amongst lower quality Indian food, but still, I dislike it. \n\nI have a bunch of friends who go here regularly. I've never actually been inside, so I can't speak of the interior. Their food is good enough for me to have them as my first call for relatively cheap Indian. If I want something a bit better, I'll go to Helman's Palace on Van Ness.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "Fantastic Indian food, great service, totally fair price. Try the Samosas and Pakoras. Simply delicious !", "author": "Yaniv D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "Not your traditional north indian restaurant.  Be adventurous and try the traditional \"goa\" dishes - indicated on the menu by a green palm tree to the left of the item.  We have tried their chicken xacuti, fish masala fry and the vegetable caldin - all were excellent - we also tried a dessert called bebinca which is like a bread pudding - worth the try.  Wait staff is excellent and pay attention.  It is kid friendly.  Can't wait to try more dishes next time.\nYou may be tempted to travel to Goa after eating here - check it out - http://en.wikipedia.org/wiki/Goa\nBeautiful architecture, history, beaches, culture and food.", "author": "Ketan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "Good food, friendly service.  I recommend the Goan Lamb Masala and Chicken Lollipops.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "My first experience with Goan cuisine and I must say I quite liked it.\nWe went early on a recent evening and it was quite empty inside(shame really). The owners were very friendly and helpful.\nWe selected a really nice Pinot Noir which went well with the food.\nDishes :Bengan Bertha ( baked mashed eggplant ) and one order of Roti\nOne of my favorite dishes.\nFish Curry was equally delicious.\nChicken Xacuti and Lamb Vindaloo came in second.\nI usually don't eat rice but theirs is very nice with shredded carrots and peas.\nI was quite full but my friends were up to dessert.\nGulab Jamun:milk balls w.syrup\nBebinca: flour and milk cakes\nI did not try them but they disappeared and my friends liked them.\nIce cream was home made pistachio and mango , very decent.\n\nI really recommend this place for an inexpensive, great Indian-Goan\ndining experience. Hope many more people will discover it.\nI will be back to try some more vegetarian dishes.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "I really loved the Goan style food here.  The Ambot Tik was the best seafood dish I've ever had in an Indian restaurant.  They use a white fish that our waiter said was solefish (sp?).  Whatever it was, it was delicious.\n\nThe okra was great too.  If you say spicy they will really bring the spice.  \n\nMy only warnings are do not order wine by the glass or the green salad.  The malbec had not been stored properly and was on the edge of going bad, and the salad was bleh.  But it's an indian restaurant, so I'm rating them on their indian food which is five star.  \n\nGreat service as well.  Highly recommended!", "author": "Carlton W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "My favorite Indian restaurant in the city! Although technically Goan-their Chicken Tikka Masala is the best. I try one dish with the Masala each time I go and so far I haven't found another to rave as high about (although reading other ratings about Sag paneer and samosas- I will need to order those next time). Either way I enjoy this place and it is my go-to when I'm in the mood for Indian!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "Probably the BEST place for Goan food, just amazing. The story of how I discovered this place was, of course, Yelp. Took my guardians there because I felt like eating Indian, but Goan was close enough, so we drove there, sat down with good service, and went out as happy people.\n\nFood was amazing; couldn't come out happier. I had the Chicken Biryani, my guardians had the Chicken Tikka Masala and I forgot what the other had, but some really nice lamb/meat that looked like meatballs, but of course weren't meatballs. The Biryani was a mountain for me, huge amounts of rice and it was just wonderful, we shared each other's food and the curry was beautifully thick and creamy with the right amount of spices, and the lamb/meat was spiced and cooked extremely well.\n\nThe service is good; caring people, I suppose. Asked if the food is good and how everything is, just like any waiter would. Nothing bad about them, just good people.\n\nThe place is not bad, only been there twice and every time we get there there's always a place for us to sit at, just the three of us. It's not a place were it gets deserted all the time, people pile up as time goes by, and the good thing about it is that a reservation doesn't seem to be necessary... hopefully I'm right but we've never called for a reservation and we've always had spots open for us.\n\nOverall: I would come back here anytime, and take my friends along if they were foodies like me. If you can't finish the food, the best thing to do is take it home, and I mean it. Like what the waiter said to us, \"Here is you late night snack!\" He just read my mind.", "author": "Bryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "I as lucky enough to get a Bloomspot deal for this place.  I've only been there once, this last Saturday, arriving 30 minutes before closing.\n\nI will be back for sure.  This place hit all the bases: excellent food, fast and friendly service, a good overall value, very clean, surprisingly good music, a simple yet effective wine menu...\n\nSee you again soon Viva Goa!", "author": "D N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "Great food. Great friendly service. Low prices.\n\nTheir tikka massala is awesome. The chicken lollipops are also the bomb.\n\nEvery Indian restaurant should be like this. Also, the guys are incredibly friendly.\n\nI'm always craving to go back!", "author": "Jose S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "I went to Viva Goa for the lunch buffet, and I was not disappointed! Had an array of popular Indian dishes (even though it was close to closing) and we were in and out of there in about 30 minutes. They were not pushy or frustrated that we showed up a half hour to close. The rice pudding and spinach cream sauce was delicious. My husband was a fan of a fish dish that we hadn't seen at Indian restaurants before. Although they didn't have naan available at the buffet, we simply asked for some, and they happily made some for us - free of charge. Maybe it is usually available at the buffet but we got there too late?! Anyway, it was garlic flavored and yummy. Looking forward to returning for a quick and inexpensive lunch.", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "The hidden jewel of the Marina! Fantastic authentic Indian food with a relaxing romantic atmosphere.  This is a great first date or have a great convo with your friends kind of place!  I always get the tandori fish, naan, amazing rice, vegetable samosas, and a mango lassi.  The chicken tiki masala is great too.  It has a relaxing Goan atmosphere and all the waiters are top notch!  It's a great restaurant and they deliver quickly if you're in the area.  This is my go to place when my parents come in town too.  Want good food, authentic conversation, and a relaxing atmosphere, this has the essence of that perfect combo.", "author": "Janet G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-10", "description": "Epic Yelp Rating FAIL. Quick Tip: There's an IHOP down the block. It'll be better, trust me. \n\n- Thin Lassi\n- Watery Lentil Soup\n- Flavorless Chicken Dish", "author": "Janett R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "This is my first experience with Goan cuisine but I can guarantee I'm goan back! Great food, helpful service, and good prices! The waiter recommended the Vegetable Caldin and I found the spices really delicious.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Because it is on Lombard street and not Chestnut street, it is not crowded.  Don't let the fact it's not full dissuade you.  The food is as good as I've ever had.  Everything we had was great.  Try it you'll like it.", "author": "Jeffrey P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-11", "description": "Ordered samosas for starters. Bland, saltless potato returned. Then, I ordered okra masala. It was raw at first. When I asked for a refry, it came back sweet.\n\nNone of my non-veg eating friends were happy with their dishes as well.", "author": "Connoisseur D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-03", "description": "So me and my 3 friends were starving after spending the day at the Bluegrass Festival in Golden Gate Park, we decided on Indian food so I checked YELP for some suggestions and decided to Viva Goa.\n\nWe got there at 7:30 and were not served our food until about 8:45-9:00. Unbelievable that it took sooo long to deliver a table of 4, 5 entrees. We even had to ask for our drinks after ordering them 20 minutes prior. \n\nThe food was delicious (only reason the got a 2nd star) but it really didn't make up for how long we had to wait. We were then handed the check and not even offered dessert. We felt the wait staff could have been a lot more courteous to let us know about the wait and to provide us a refill of the the lentil wafer or something, but they just let us sit there and starve.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-21", "description": "This place is legit!  Have ordered delivery here 4 times in the past 7 days! Its that good. Authentic Goan (Former Portuguese colony in India) food. Great service and no minimum delivery charge! They in fact delivered just 1 chicken dish to me yesterday and they never whine about it. \nThe food is fresh and tasty. So far tried the Pomfret, Xacuti, Cafreal, Vege Caldin. All were authentic Goan. Will try out the buffet and dine in soon.", "author": "Karthick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-11", "description": "Christian & I had a nice lunch-one of our favorite places here in Marina District, definitely our favorite Indian Restaurant here in SF! Love their Lunch Buffet-great variety, complimentary Naan Bread and delicious food! Especially their Goa Fish We love their Chicken Tikka Masala, Mushroom    Paneer Masala and Variety of Naan Breads at Dinner too! Always Provide Wonderful Service! Feel Right at home! Thanks!", "author": "Christina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Yes, still love it. The vegetable pakoras are addicting.  I'm being picky, but we always note to call the cell because our building buzzer is broken. And every time, they try to ring the building. Fortunately we are near the door so we can hear it. We even bet if they'll call or try to buzz. It's losing it's fun because they always buzz :-).", "author": "Brie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-04", "description": "I normally don't go to the Marina district, but my housemate and I were feeling a bit adventurous today and decided to drive out there. So I took out my new phone and typed in Indian food on Yelp and this was one of the first places to come up  on the list.\n\nSo we ordered the Goan Chicken Masala and the Chicken Tikka Masala with some rice and it was simply amazing. The taste on both of these dishes were out of this world, especially the Chicken Tikka Masala. This particular dish is the one I always get at Indian restaurants as a comparison piece to see how it stacks up to the competition. And let's just say this was one of the best ones I've ever had. I can't wait to go back again and try some of their other specialty dishes.\n\nLet's go go goa, to Viva Goa!!!", "author": "Gajan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "Food tastes good and arrives as quoted. Love the paneer tikka masala... I know it's not traditional Goan, but it tastes good. Would recommend.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "Tried this place out based on the Yelp reviews and looking for something \"different\". So worth it. Lunch buffet is a steal at $8.99! A moderate assortment of dishes but all of it was delicious. Service was great! My wife and I compared it to the popular Amber India's buffet where there might be a greater selection but the food here was just as good if not better.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-23", "description": "Very good!!\n\nI saw the place as i drove by on Lombard. We used to vacation in Goa as children so I took my wife there as a Stewart's date night.  I had the mulgatawni soup it was very very good warming, delicious. For my entree i had the pork vindaloo with rice. This was also very good with lots of flavor of sweetness, cardamon and cloves very southern Indian. I tried also the salted lassi which was a drink I had not tasted since living in India as a punka walla. Then my wife had the sizzling chicken tika with a massala sauce on the side. It was spiced subtlety and dryer then the normal gee coated rubbish other \"authentic\" places serve. We had the mango kulfi and bebinca for desert. The bebinca takes forever to make so there is no Indian restaurant that I know of that has it on the menu. It is really delicious with lots of coconut and sugar as i remember it as a child.\n\nThey have a buffet during the day that changes every day. I cant wait to try these delights!!", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "The lunch buffet is great value for money. The food was yummy and probably the best indian food I have has in the SF.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Awesome food. Awesome service. People are very friendly. The fish curry was yummy with the light coconut sauce. The buffet was a normal menu but everything tasted good.", "author": "Kruthika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "I come during the lunch buffet hours & always enjoy the food. They have plenty of choices & the best nan to accompany their dishes! Staff is always friendly. Very reasonable price for such a yummy lunch buffet. This is a great hidden treasure of delicious Indian food!!", "author": "Sfgal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "Yum yum! Viva Goa had been on our list for a while so I was very excited to finally try Goan food here!\n\nI quite enjoyed the large crispy chip that we were given. It is served with two sauces, one green and one red. The red sauce is sort of fruity and interesting but I much preferred the green, spicy one. \n\nWe asked our server for an appetizer recommendation. He suggested either the chicken lollipops or the shrimp. We decided to get the shrimp because I was a little wary of the \"Szechuan sauce\" that the chicken lollipops are served with. Sounds really cute though, I mean, lollipops? Maybe next time. The shrimp was good. They're hot, not cold.\n\nFor our entrees, we got the Fish Curry and the Lamb Xacuti. Also an order of rice and an order of naan. Loved the fish curry! Medium is the perfect amount of spicy and the curry complemented the fish very well. My favorite thing about the fish (aside from the wonderful taste) was the heat retention in the center of each piece of fish. Mmm...\n\nThe lamb xacuti was good as well! The lamb is cooked well and the sauce is not too overwhelming with lamb flavor. Just right. I really enjoyed the two dishes that we got because they were quite different and gave us a great dining experience. \n\nGlad that Viva Goa did not disappoint and I definitely want to come back to try more items on the menu!", "author": "Lydia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "Very impressive! I was hesitant when i first entered, since the outside of the place, and actually even the inside were very simple. But this rating is based entirely on the food not the appearance.\n\nI wish i could remember the name of the dishes that we had, but one that i could remember was Chicken 65, this was just amazing! Enough said.\nThe other dish that I couldn't believe was even better than the Chicken 65 was this beef with potatoes spices and CINNAMON! Yes that is right cinnamon, and not just a hint of cinnamon like i expected, but rather enough that you can taste and smell it within the bounty of other flavors that explode all over your tongue as you take your first bite. Oh also this place does not mess around with the level of spicy. If you ask for spicy you get spicy! I mentioned to the server, \"Extra spicy\" since i'm used to being at places that laugh at you when you ask for spicy food (Often rightfully so). Well i can say... this was one spicy dish, but not too spicy that it wasn't pure deliciousness.\n\nI am happy to add to the many 5 star reviews of this place. Our entire meal was less than $30 for 2 people with one large beer (enough for 2), and it was one of the best dining experiences i have had in the Marina.\n\nThe ONLY negative feedback that i have is that it took a while for the check to come once our meal was complete, and when it did arrive i was in the restroom. This almost allowed my date to pay for the meal!\nAside from this slight error, Bravo Viva Goa!", "author": "Brian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-02", "description": "Let's be clear - the Marina does not do Indian.  And depending where you are on the learning curve, it arguably does not have anything *really* great.  As with the clientele, lots of restaurants are good (yes, that includes Mamacitas), reasonably healthy, fair-to-over-priced.\n\nThat said, I lived in the Marina for 5 years craving easy Indian.  My laziest alternative was in Pac Heights and mediocre at best.  When Viva Goa moved into the old Tibetan spot on Lombard, I was not expecting much - but I could smell their concoctions percolating through the neighborhood.\n\nBecause of my earlier-stated laziness, I checked out Yelp and saw positive reviews in the first week despite the awkward location.  Knowing nothing about Goan food, I decided to check it out and was amazed how accurate the reviews were - great flavor, even tender fish curry.  I NEVER eat fish in the buffets, much less in curry.  Overall the buffet is reasonably small, but very well rounded with the requisite chicken dishes, some good veggie and always something interesting like fish, lamb or goat.  Yeah baby - goat!\n\nTo wrap up, these guys do a great job for Marina and Pac Heights.  Good flavors and some sort of Goan influence, that I hear is unique.  Besides being tasty and cheap - the most important thing is these guys are super nice and hospitable.  Go get your fix and blow off the Grove or the Shitty Pig.", "author": "DaPlayer A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-17", "description": "I was excited based on the reviews. The chicken saag was so-so. Chicken  was on the slimy side. I request mild and it was medium. All in all it was fine. Nice service. And the menu had some different options from the norm. So I'll go back to try the buffet or one of those unique dishes, but I won't rush...", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-15", "description": "The buffet was delicious and spicy, the naan was really good, excellent samosa, and they even had goose berry pickle.  This is how an Indian buffet should be like and taste.", "author": "Liji J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-12", "description": "Nice place. Reasonable prices and very nice wait staff. Free parking on street in front kn evening. \n\nFood is generally good but somewhat bland. Had high hopes but a tad disappointed. I eat in many indian restaurants and have even had Goan food from a Goan acquaintance. \n\nBest was chai tea (with refills!), fish curry, basmati rice. Avoid Mulgatawni soup (most bland I have ever eaten - no Indian spice at all) and aloo paratha ( dry and hard). \n\nI wish they would improve because I really wanted to give them the highest rating.", "author": "G M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "I went the 4th day it opened and placed an order for the chicken lollypop. It was really good! Pretty much everything I've had here since (chicken 65,fish curry..) has been nothing short of excellent.\nFood A+\nService A+", "author": "Sunil P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-10", "description": "Used to order fairly regularly through Seamless, never had a problem.  Then over the past several months, we've experienced worse & worse service.  Twice now they've \"never received\" orders from us through Seamless despite receiving a confirmation email, & several times they have \"got the wrong number\" when sending food, despite nothing in my records having changed.\n\nThis time around, we called after an hour (estimated had said 30-45 minutes) to check on the status of our order.  We were assured it was \"on its way\" and would \"be there shortly\".  Another 40 minutes went by, & still no food - finally we called back, only to have my name & number asked over and over (literally 5 times in a row).  They couldn't seem to even remember my name in the 10-15 seconds between asking it.  Finally they informed me that no order had ever been received - despite the fact that they had assured us 40 minutes prior that it was \"on its way\".  When I pointed this out, the man on the phone told me to \"shut up\" & \"take it up with Seamless\", at which point he promptly hung up.\n\nAnyway, if you want to be disrespected & forgotten, this place is likely to deliver.  If you want it to *actually* deliver real food, you'd best try someplace else.", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "Feel in love with this place when i first got it for take out. Now I take all my friends and we're all in love. Great traditional Indian food that is priced really well. If i had a go to, I'd get the Butter Chicken! Its amazing!", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "Sandy M and I went here to try out some Indian masala goodness. But we were swayed by the big Daily Lunch Buffet sign out of the doorway...dang...$8.99....sigh...such a buffet whore.\n\nFirst thing we tried was the chicken tandoori (I know that it's got to be more tender and juicy right out of the kitchen instead of sitting on burner for hours), which turned out to be too dry. The vegetable samosas were filled with carrots and potatoes...I liked it even better with their mango chutney sauce poured all over (I'm all about the sweet and savory). The naan was excellent. Very hot and crispy, almost like a cracker! The Goan Chicken Masala had excellent flavors and the chicken was really tender. \nThe Goan Goat Masala had a gamey flavor but then most goat dishes do.\n\nMy favorite is the vegetarian dish Channa Masala (Garbanzo cooked with onion, tomato, fresh herbs & spices)..all Sandy said was, \"it has peas and tofu in it. How good could it be?\"  Hello? It was hella good...the sauce with naan made it wayyy worth the trip back again for seconds.\n\nFor dessert, we grabbed the sweet cantaloupes, and I had the rice pudding which had real rice in it...I was thinking of the creamy milk based mushy type but the rice actually was cooked and sitting in minty herbal flavorings...slightly sweet.  I tried the Gulab Jamun (milky fried balls soaked in flavored syrup), they were not as sweet as I thought and really delicious.\n\nIf you're here, definitely get an order of Mango Lassi. Both Sandy M and I agree Viva made the best one we've ever had...so thick with mangos and chilled perfectly.\n\nI think I'll come back here next time and do a la carte. That way I can defintely get the taste of flavors fresh from their kitchens.", "author": "Pauline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-30", "description": "Love this place!  Have visited twice so far.  Enjoyed their chicken saag and Nan with fruit and nuts.  Service is excellent and very generous with special offerings.", "author": "Debra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-03", "description": "I didn't know anything about Goan cuisine before Viva Goa.  Nicholas the owner told me all about it; his is Indian food with Portuguese influence.  I've only been for the lunch buffet so far and highly recommend that you try everything, especially the Goan dishes (vegetable caldin with coconut milk, the fish dishes.)  \n\nGo.  Trust me, you'll love it.", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "Great food. Must try the Sungatts (Prawns), Fish Ambot Tik and Chicken Xacuti. Ambience is a bittoo dark for my liking. We had strange people in the restaurant the other day, a couple of ladies trying to hurl comments at us in broken hindi and abusing themselves with choicest words. Management didnt throw them out. I am cutting 2 stars, one for ambience, 1 for not throwing out unruly people", "author": "Sushant T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-11", "description": "This place certainly doesn't deserve the 4 stars that it has. We were here for lunch today, the mussels were really bad- fishy and rubbery, all signs that the fish wasn't fresh. We also ordered a tandoori fish and fried pompfret, both of which were below average. The staff was courteous and took the mussels off the check. This is a nice gesture but doesn't do it for me to come back for the food. The 2 stars is only for the staff.", "author": "Ashwini S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "We just returned home after having a wonderful meal at Viva Goa.  We were a party of six and rather than share a dish, each of us ordered separately.  Because of the reviews, we did order only the Goan items - Chicken Vindaloo, Prawn Xacutti; Goan Chicken Masala and Goan Special Mix Platter.  In addition, we ordered Vegetable Pakoras and Baigan Bertha to share.  Without fail, each person loved his/her dish and the Pakoras and Baigan were special.  We did order the Bebinca and were not terribly impressed but that is a matter of taste, I expect.  The Kulfi (ice cream) would probably have been a better choice.  \n\nThe service was excellent and the staff answered all questions and helped with our choices.  The beer drinkers tried two different Indian beers and preferred the Taj.  We will definitely be back!", "author": "Sue B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Delicious food; great, friendly service; clean; and affordable! They graciously accommodate vegans, even when the buffet didn't have as many vegan choices. We'll definitely be going back. They deliver, too!", "author": "D. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "Amazing buffet and service! Really nice people here and the buffet lunch is great :) get the chicken masala and you will be in heaven ... If you like Indian cuisine! Definitely coming back :)", "author": "Joseph P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-18", "description": "Let me start off by saying \"Free Delivery\" with no minimum order! This is key on a rainy, cold night when the last thing you want to do is cook OR go out for dinner.\n\nI ordered the chicken tikka masala (hot) with some lovely jasmine rice. The portions were large and plenty left-over for another meal. The tikka masala was perfectly spiced and have definitely ordered from them a few more times since writing this review...and no disappointments.", "author": "Dianna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "celebrated my birthday on the 11th of November here.\n\nThis place has a chef who has come from india and provides you with an authentic taste of goan food.\n\nThe goan food has portugeese heritage and this was evident with the dishes we ordered.\n\nordered the :\nLamb Xacuti - good.\nFish / Shrimp / Scallop Masala - good\n\n\nAs it was my birthday I got a complimentary orange kulfi .\nThey had real orange peels which had the orange kulfi.\nIt was amazing and it tasted like real oranges, literally.\n\nThanks Gurpreet, Francis and Mikhail for the bday treat.", "author": "Utsav M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-03", "description": "Lunch buffets usually aren't too great but this place rocks - excellent, well priced buffet with fresh fish, not fried or battered in anyway... Look forward to eating here again.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-23", "description": "Good food,fast & friendly service. I tried tandoori fish and fish curry. The food was good, but the curry had obviously been tailored to suit a larger international audience. The fish tasted fresh - not smelly etc. \nThe menu doesn't seem to have too many 'Goan' dishes besides the curry, Xacuti, Vindaloo, and Bebinca. The vegetarian section had mostly standard menu items one would find in any other Indian restaurant. Overall, it didn't live up to the hype of being a \"Goan food\" restaurant, for someone like me who's been exposed to Goan food growing up....but it's a good place to start if you've never tried any Goan food.", "author": "Shweta V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "Went here for dinner club with my friends- this place is great! There were 8 of us so we got to try a ton of different things. The chicken tandori was awesome and comes piping hot on sizzling plate. The Saag Aloo was pretty yummm too. I thought the butter chicken was a little different- very red rich thick sauce....and small peices of chicken. Naan is awesome and perfect size. I'd go again!", "author": "Ricquel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-17", "description": "this place is amazing, its very rare to find Goan food in the City. \nGreat Chicken Lollipops, Beef Cutlets , Lamb Xacuti.\n\nNOTE : Dont go there and have the Typical indian food and expect it to be great. THIS is a GOAN food restraunt, please try out those special dishes.\n\nIf you want to get more experimental ask the chef what he has in the kitchen.. they generally have dishes they dont put up on their menu and are deilicious.", "author": "Neil D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "Hands down best Goa Indian food ever!!! The staff is super friendly and attentive! Get the fish curry (sweet and sour)!!!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "I live in the Curry section of Murray Hill, and this spot certainly measures up.\n\nGreat lunch buffet with wide selection, attentive service, and low prices. Can't comment on authenticity as I am not very familiar with Goan cuisine, and the regular offerings seemed pretty pedestrian.\n\nOff menu sarapatel sp? is delcious btw.", "author": "Christian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "A Portuguese/Goan restaurant on the weird end of marina. I love the staff here. They are always warm and humorous. The food is consistently delicious and my wife and I try something new every time we come in.", "author": "Pete F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "My husband and I had been looking for a Goan/Konkani restaurant in Bay area for a long time. Then a friend took us to this place for dinner last weekend.. Very good food. Reminded me of food on my Goa trip 5-6 years back..\n\nWe had chicken xacuti, stuffed charred pomfret (with stuffing called Rashida), fish cutlet and a lamb preparation.. It was all spicy (they did ask for our preference on extent of spiciness) and delicious. Macaroni lentil soup was superb. Good prices, portions, service and taste.\n\nAt the end we were also offered a complimentary dessert - orange ice-cream - which was actual orange pieces stuffed with ice-cream - quite innovative.\n\nMust try to get a real taste of Goan food!", "author": "Mamta B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "They have a great lunch buffet. Great food and good variety. very friendly service too. That first taste of hot nan is amazing! Their chicken tikka is delish! I like the fish dish they have too. I'm glad they are right around the corner from our house.", "author": "Jade C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "Lovely ambiance. Very simple, yet not underdone. Plenty of seating space, and a very friendly staff. \nIf you cant handle spices, I'd recommend going mild, rather than medium. Medium was a bit hot for a few of my friends. \nThe appetizers were delectable. Just the right amount of spices in which the food was cooked. As a main course, the lamb was amazing. I havent had such tender lamb in the US before, it basically melted in your mouth. The chicken xacuti was lovely. It had a very different flavor to it, and not in a bad way at all! \n\nOverall, I'd definitely recommend this place.", "author": "Gurpreet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-08", "description": "As you can tell from most of the reviews on here, Viva Goa is a hit! While several Indian restaurants claim to serve dishes from Goa, including the ubiquitous Vindalho/Vindaloo, they are never able to represent the uniqueness of the cuisine from this part of the world. Because Viva Goa specializes in Goan cuisine and is run by Goans, the menu has several authentic dishes, including Chicken Cafreal, Sorpotel, and more.\n\nNot only is the food very tasty, the service is attentive, and the restaurant setting is pleasant. \n\nAs this is a new establishment, perhaps in time the owners might concentrate on the decor inside; the Konkanni music playing in the background is a nice touch, though. I wish the owners much success as it is very well deserved!", "author": "noit e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "I accidentally came across this restaurant while driving by.  It was a delight to find a restaurant that serves Goan cuisine and it surpassed my expectations.  I loved the authentic Goan food, which is rarity in the US.  Goan cuisine is a unique Indian cuisine influenced by its Indian origins infused with over four hundred years of Portuguese colonialism and cookery. I  strongly recommend ordering the Goan dishes from the à la carte menu.\n\nThe service was excellent which made a great dining experience and I strongly recommend it.", "author": "Sandman D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "Viva Goa is taaasty. The vindaloo was amazing, some fish cakes we had as a starter also stood out. Friendly service and also they don't charge enough. \n\nWe had to travel across town to get here, but we'll be back!", "author": "j r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-30", "description": "I really am Meh about this place. The food wasn't bad, but it wasn't great either. Normally that would merit a rice even 3 stars. While I distrust any food that comes to the table too fast after ordering, I also hold some reservations on food that takes too long, especially when it's not particularly busy.\n\nWe came here after work for dinner one night when I was upset that I had missed curry up now for lunch, and was craving some spice like no other. I had chosen the place because we had eaten some amazing paneer tandoori in Vancouver and had been searching for another restaurant that served it. Viva Goa was the first one we found, and I sort of wish we hadn't, the tandoori was beyond dry and tasteless.\n\nThere's also something to be said about conscientious waiters, if when the two of us order two rices, and you don't mention that one order of rice is generally portioned for 3 people, it's irritating. Not because I wasted a 1.99 on rice, but because it went straight into the trash untouched.\n\nAnyway, when it was all said in done, dinner took way too long, the food was dry and salty. Not horrible, but not particularly remarkable. I'd say it's worth a try, the bench seats are cute. but avoid the bathroom if you get claustrophobic.", "author": "Allyson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Great buffet! Was looking for a quick, warm meal in the marina area and found this place. Great service and the food was fantastic. Everything dish was delicious.", "author": "Allison C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-06", "description": "The Chicken Tikka Masala is amazing!  I've gotten tired of the usuals (Rotee and Spicy Bite) with their inconsistencies and Viva Goa is 2 for 2.  Really interesting dishes and I can't get enough of these Indian spiced dishes.   Big bonus they delivered to my house but I've ordered early each time since I know it's slightly far.  Here's to hoping they keep on delivering to me because it's D-LISH-ASS and TAST-AY.\n\nRecommended!", "author": "annie s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-12", "description": "Goan food or rather lack thereof has been the only hole in the cuisine available in the Bay Area.  So I've been salivating to go try this place.\n\nI'll say that I'm glad they made the attempt but the flavors fall short to authentic.   The three things which were pretty good were the sorpotel which the server offered me though it wasn't on the menu, the veggie caldin, and the chicken cafreal.    The vindaloo was ok - mostly chili, not the traditional flavor - it felt like they'd used rechado masala to make vindaloo.   I was most disappointed with the fish curry - it bears no resemblance at all to Goan fish curry.   I was also very disappointed that they had no bebinca available, the kulfi we had instead was ok.\n\nSo overall - the food is tasty and the service friendly, but it's not something that would make a Goan feel like home.", "author": "S C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "I have been to this place only once.. Love the ambience..warm and welcoming waiters.. Tried Soropotel(Goan delicacy) it was mind blowing.. Also had the home made pista kulfi for dessert which was very good", "author": "Net T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-21", "description": "We were looking for an Indian near the Marina and this hit the spot! The music inside was terrible, the service was quiet but attentive and the food was great!\n\nWe enjoyed Poppadoms, tandoori mixed platter, rice and a roti! $42 and we were full!", "author": "Jake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-27", "description": "Great atmosphere, large tables if you  like a  lot of room like me.  Food less spicy that most indian food,  Goan style .   service excellent.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "Went here for lunch.  Actually, I wasn't planning on it but saw the sign out front saying something to the fact of an Indian lunch buffet for $10 so decided why not.  I didn't even bother checking Yelp first.  Had I, that would have cinched the deal.\n\nGreat buffet-- got there early (around 11:30) so there was only one other table.  Lots of choices... very flavorful. I'm normally not a big buffet fan (usually prefer ordering off the menu) but this place won me over.\n\nIf you are in the area and like Indian food, it's worth a try.  Easy metered parking out front-- just make sure you have your stash of quarters handy.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-24", "description": "I was super excited to find a Goan restaurant in the US, but the place underwhelmed me. I wasn't expecting authentic food and the food met my expectations. Sorpatel and pomfret were pretty decent. What turned me and my friends off was the service. The waiters were downright rude to us, making snide comments, no smile on their faces..nothing. We had to keep signaling them to come to our table to take our order. One of the waiters, Sam, was great though..", "author": "Ro D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-13", "description": "I was craving something spicy and found this gem on Yelp near my BF's place so we headed out and a quick walk down the street lead us right into Viva Goa.\n\n++ For the fact that they do free delivery, but since the house had a dinner party going on we decided to go to the restaurant instead. I loved the food. We had the Chicken Xacuti and Lamb Masala with some garlic naan. It was so good ~ even with my tummy trying to fight the spice I kept eating.\n\nEven writing this review makes me hungry. Marina/Cow-Hollow - it can be hard to find some place that has great prices and good and Viva Goa seems to combine them all. It was quiet and much like the last reviewer, I really liked that it was quiet, but the staff was very nice and the food was really yummy so they deserved to be Yelp'd.", "author": "rei a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-29", "description": "This is a review for vegetarian food!\n\nWe went there today for lunch. Good service, but the food took a little long to show up. But the 8.95 buffet looked great for vegetariand (4 dishes plus dessrt, salad etc and rotis/rice and some meat dishes-wow)\n\nThe wraps were good, needed some more spice and these were really huge. \n\nThe veggie platter with paneer was a lot of broccoli and cauliflower...really ok. \n\nThe veg biryani was good, the veg caldim gravy was good...but i expected it to have more gravy in it.\n\nThey had Kingfisher beer to go with the papadums and chutneys-awesome! Overall good stuff, but I hope they spice things up! Glad that theres a Goan restaurant here!", "author": "Soniya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "the food here is just awsome ,you should try the goan food here and the serviced and the atmosphere here is just wonderful.it is great to go out for a family too.it is a must to try out this place when your are in  San Francisco", "author": "Pelcy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-20", "description": "Came here for the lunch buffet. Not bad if you don't like spicy indian food.  I would have preferred to have more spices in some of the curry dishes.  Their garlic nann were really good though! Hot and garlicky!!!  It was a bit warm in the restaurant though, not really sure if they turned on the A/C.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "I am an Indian food fanatic and I love this place. Also, they have a nice, quiet restaurant - for those of us who like to hear conversation at the table. And they deliver!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-19", "description": "My boyfriend and I LOVE Indian food. When we first moved to the area about a month ago, we had some delivery Indian that really disappointed. Not to be discouraged from ordering in our favorite cuisine, we decided to try Viva Goa after passing by. We ordered in and the delivery came pretty fast. It was also inexpensive! The garlic Naan was OK, which could have been because it was delivered instead of eaten fresh out of the oven. The food we had was beyond delicious and we will gladly go back again. I can't wait to go back and check out the lunch buffet! This is now our go-to neighborhood Indian place!", "author": "Holly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "First goan place in the city (maybe even in the bay area). We (4 of us) were  really excited. Here is what we ordered & what I thought \n\nMalabari Jinga :  too ketchupy. expected smaller shrimp since they used jinga in the name. however were larger shrimp.\n\nPomfret : didn't expect it to be the entitire fish... head and all. Heavily spiced in the center. fish itself tasted very fresh.\n\nFish curry : yummy.could taste the fresh coconut. \n\nPrawn curry : standard onion tomato base. nothing special. \n\nService was great. They were receptive to our feedback \nWished they also had sol kadhi (which is typically served with fish dishes). Will go back to try other items on their menu.", "author": "Nilofer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-29", "description": "Excellent food! Fair prices. Outstanding service!! Our waiters were extremely nice! Will definately be back again soon! Apparently the buffett is pretty legit too for lunch- real red roses and real candles on the tables as well - a very nice and rare touch these days :)", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-18", "description": "I went at lunch time on a Saturday afternoon, and was amazed first just at the price for their buffet--incredible value, lots of choices, plenty of vegetarian choices but chicken and fish too, and when we asked for naan--it arrived fresh and warm and  delicious. \n\nI went with an Indian friend who is a great cook and very critical. Her stamp of approval too, only added to my pleasure. \n\nThey do take-out too and it's a lovely family run business !", "author": "katharine k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-04", "description": "Worst food ever. \n\nThis food should not be compared to Goan food in any way. \n\nThe pomfret did not have salt in it.\n\nThe curries were over spicy and were in edible\n\n--- Update on 05/05/2011\n\nGot this email from Ricco Paul A.  who looks to be the owner i guess\n\n\"Looks like you are coming from Amazon who never ate in a plate.Keep it up jungee!\"\n\nTo reply, i speak for a party of 10 who ate here, from which 2 are originally from goa, and hated the food. \n\nI'm guessing the cook of this place had changed considering the older reviews i read", "author": "Varun S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "I've yet to find better Indian in SF for the price point. Worth coming in from the North Bay for sure. I've had it all, traditional northern Indian plus their Goan dishes. Everything is on point.", "author": "Josh C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-19", "description": "We found this restaurant just a block from our hotel on our 4th night and now wish we had known about it the first night in town as we would have eaten here at least 1 other time while visiting San Francisco. Yes that good. My boyf is Sinhalese and knows his Indian food and even he was excited about the food we received here.\n\nFirst its a quiet little place with nice ambiance. Staff were all very attentive and courteous.\n\nKeep in mind both my boyf and I love spicy so it was great to have a place that truly made things spicy  when asked to and not just what they think we can handle. I am very very fair but grew up eating jalapenos from the vine practically. But most people take one look at me and figure there is no way I can out spice my boyf but I do.\n\nWe started with the Goan Mussels cooked to perfection! Even tho spicy you could still taste the sweetness of the mussels. We also tried the Chicken Tikka Masala, Chicken 65, Goan Seafood Biryani, and garlic naan (there was something else in there too but I just cant remember it). All of it very good. But the biggest compliment comes from my boyf on the Biryani. He has yet to find in over a year in CA a Biryani that he would claim as good and this one he says is great.\n\nIf we are ever in San Fran you can be sure we will be back here again.", "author": "Leslie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "San Francisco is blessed to have a pretty good selection of Indian restaurants to choose from.  Even if some of them are roach fests (how do they keep getting away with it?!) there are enough decent ones to mostly satisfy even this British curry connoisseur.  Variety, though, is not their strong point, most of them offering a me-too menu selection.  Thankfully, Viva Goa is willing to go south on them all.\n\nMixed in with usual favourites like masalas and vindaloos (which are worth seeking out themselves) you'll find unique Goan treats like the Chicken 65 (the closest curry in the US to my favourite chicken pathia), Lamb Xacuti and Vegetable Caldin.  This place might even be good enough to unseat my current favourite, downtown's Mehfil Indian.", "author": "Stew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "Food is great, no question about that.  The service is good as most Indian places need time to prepare the food.  They are sometimes completely empty, but don't let that fool you.  This place will keep you happy and with a doggie bag, it is even better the following day.  It is expensive, and they do have take-out service.  We love it.", "author": "Craig A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-01", "description": "Solid buffet for $9.\n\n-The mushroom paneer, goan chicken, and mango puddding were all tasty\n\n-Skip the tandoori chicken; instead they should have Goan chicken lollipops,", "author": "Sanjiv P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "Love this place! They deliver, which is great, but dining in is very good too! They have great, attentive service, and quality food. I go there frequently and know that it is reliable to be good. Our favorites are the Navrattan Korma (veggie) and the Tikka Masala. I got the Xacuti once and was not fond of it, but maybe it's just not my style. This is the best I've found in the area!", "author": "Jessie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-30", "description": "I had  been wanting to try this place for a while so the Bloomspot deal presented a good opportunity. After one visit, I would say I  am not a fan. The naan was good. The samosas were smallish and fried too crisp for my tastes --I like it when a little doughiness remains. The seafood combo was fishy and salty and did  not exude freshness. The lamb was tough and chewy. It just wasn't very good.", "author": "m t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-14", "description": "ordered takeout via eat 24 based on the good reviews.  order was over 30 mins late (took over 1 1/2 hrs to arrive).  chicken lollipops arrived raw (complained and they removed the one item from the bill).  asked for some of the dishes spicy, and nothing had any spice to it.  pretty disappointed overall.  samosas were fairly tasty.  the rest was fairly blah.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "Viva goa is our favorite Indian restaurant in sf!  Great food and staff!", "author": "anand g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-08", "description": "After 7 years in London eating the best Indian food you can get outside of India, I was sorely let down by what SF has to offer.\n\nFinally found a restaurant that really gets the subtleties of spices and textures that make the cuisine so fab. I had Xacuti Chicken and Bengan Bharta - specified \"hot\" (it's American hot vs Indian hot - totally manageable). \n\nAlready looking forward to leftovers and what great flavors I'll enjoy in my next time ordering!", "author": "Maryann M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "This place is pretty good. Some things are standard Indian while others are traditional to the area of Goa. Both of them were above average. \n\nSimon is great, he's got long hair and is from the area of Goa so it makes it a little more authentic ;) \n\nAnyways, if you are looking for a go to Indian spot in the marina, this could be the place!", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "Ordered delivery from them last week. Everything came in the time frame stated, was hot, delicious and well packed. My new go to for Indian Delivery. Loved the Dal Makhni!", "author": "Janell H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Just had delivery from them for the first time and it was solid, but not great.  Probably 3.5 stars, but the fish tika was absolutely dry and one person said tasted like cat food (and I am thinking she meant that it tasted like she would expect cat food to taste.  But you never know).   Without the fish it would be a solid 4* since they delivered.\n\nEverything else was very good.  We will give it another try for sure.", "author": "michael d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "A few people have told me how much they love Viva Goa, so when my friend invited me the other night I went along to explore.  We used her bloomspot certificate (1 app, 2 entrees, 1 naan and 2 glasses of beer or wine) and I think it was a good way to try a number of different things on the menu which was nice because I am not too familiar with Indian food.  The staff was very helpful when it came to ordering.  They explained the menu items thoroughly and had a number of suggestions for us.  I liked the onion naan and my friend liked the Chicken Xacuti.  We enjoyed our meal, however I want to emphasize the professionalism and pleasantness of the staff.  They were wonderful.  Viva Goa!", "author": "Lily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "I guess I'm your average ignorant American who makes no distinction between Goan food and other Indian food. I didn't notice the part of the menu with Goan seafood specialties, and the waiter didn't say anything about it, so I just got the same stuff I usually get: Aloo gobhi, matter paneer, samosas, that sort of thing. Food was pretty standard, perfectly good but nothing to write home about. The fourth star is for the very friendly and attentive service. When our matter paneer came out, it had a garnish of slivered almonds in it (which was not mentioned in the menu); my girlfriend is highly allergic to tree nuts, and they took it back and quickly made a whole new batch. They were extremely nice about it and kept checking back to make sure everything was good. We left full and happy. If for some strange reason I stay in that neighborhood again, I would definitely go back.", "author": "Jon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "After one of  our friends suggested this place, we went here.. wow! the food was great! This is not a typical Indian restaurant.. If you would like to taste some Goan and Mangalorean food this is the place.. I am not sure how good is the \"typical\" food.. but what you need to order is at least the following:\n- Pork Sorpotel\n- Fish Ambot Tik (Sour & spicy) with some rice\n- Goenchim Sungttam (Prawns)\n\nWow! the food was as good as authentic Goan or Mangalorean food !\nIf you don't like too much spicy food, be sure to let them know when you order... I am definitely going back there again to eat 'Pork Sorpotel'\n\nI wish they had Idlies or Sanna (Idly or Sanna is another Goan or Mangalorean specialty to eat with pork curry) to eat with Pork Sorpotel.", "author": "V D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "My friend and I had a tasty dinner at this pretty little place;  the owners were very gracious. The only problem was we had a Bloomspot coupon and I feel we were overcharged at the end for the dinner - it was too confusing so I just paid it.", "author": "Noel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "I've heard the name of this place a few times recently. Ate there last night and it was SUPER TASTY. The staff were fun and friendly too. The bill was a little more than we expected, but the food was great and I'll be back for sure. The Masala Fish was the best thing on the table.", "author": "Bowen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "We wanted to eat Goan food and went for dinner the other day. Everything from appetizers to the main course was nice & delicious. We shall definitely visit again.", "author": "Sudhir N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "After hearing about Viva Goa through a Bloomspot offer, I've been back several times. The service is extremely attentive and genuine without being stuffy. The atmosphere is very low key, which is a nice change of pace in the Marina. The food is exceptional--authentic, spicy, and bursting with flavor.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-22", "description": "Basic tasty Indian food for a good price.  The place was pretty empty on a Wednesday night.  No frills decor and service.  Wine and beer only, no liquor.", "author": "Kiran M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Ordered take out after a long weekend camping. While we picked it up we found they would have delivered to us in Laurel Village. Food was awesome and well priced, I recommend the garlic naan and Chicken Tikka Masala. Only needed 1 order of rice, naan, papadam between us. Owner was very friendly - I like to support good businesses. Highly recommend this place.", "author": "craig s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "Delicious Chicken Tikka Masala, best I have had in the city. The sauce is amazing.  They also have really good onion naan and the basmati rice is always cooked perfectly. I also like how they can make things really spicy or mild. Best part is that they deliver! yay!", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "The fish masala was amazing - the fish was cooked perfectly! Order and one of the seafood dishes (Goan Indian food specializes in seafood). My go to Indian food delivery.", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-02", "description": "Viva was my latest Indian buffet adventure. The place is nice and clean and relatively good service. Selection was not that great and they were missing dishes like Chicken Tikka Masala. However, the quality of the food was not bad. I loved their fish curry with big chunks of fish cooked perfectly and not dry. The sauce did not overpower the delicate fish which was key. Other dishes I enjoyed was the Paneer and the mango soup dessert. For the price, this is a great deal.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "We were craving Goan food and there are not any Goan food restaurants in SF. This was the first time we tried this restaurant. The food was amazing. We had the Chicken Xacuti and Malabar Prawns. Both were amazing and tasted like the authentic thing!  The staff is really nice and friendly. They grind all the spices fresh right at the restaurant. Eat their Goan dishes that is why they are soo special. And they have a cake made of 8 layers called Bebenica which is a culinary delight.", "author": "Shaheen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "I signed up with Yelp today specifically to rate this restaurant.\n\nThis place is beyond awesome. If cat's wore pajamas, this would be their spot. There aren't enough stars on this site to bestow upon our waiter Mark and the rockstar team at Viva Goa. \n\nThe service, atmosphere, the food ....Chicken Tiki Marsala and lamb curry on a bed of fluffy white rice, served with hot onion baked nan and a cold beer ... \n\nStop reading any more reviews, no other Indian Restaurant stands a chance. Goa now.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "Probably THE ONLY place you can get great tasting, authentic Goan food on the west coast", "author": "Louisa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-10", "description": "This place is a fantastic addition to the Marina. I wish there were more restaurants with this vibe here. The first thing you notice is how warm the reception is when you walk in. Everyone that works here is quick to greet you with a smile and welcome you in. The service for this price point is top notch from start to finish. \nThe food:  It might not be accurate to compare this food to other Indian food because it is a regional Indian food from the southern Goa region. That said, it is the best Indian food I have ever had. I am not an Indian food expert, but I have dined at most of the city and Marin's notable Indian restaurants and it was the best I've had. The one dish all Indian restaurants have is Chicken Masala, usually I find it to have too much if one ingredient, usually cumin, that overpowers the flavor. Not here, this is as balanced as I have ever tasted it. All other dishes were things I was trying for the first time, and all were great. The white fish we had was the top dish, it is the signature Goan meal apparently, I highly recommend it. Enjoy!", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "This place rocks!  It is the best Indian food I've had in the City and what's better - they deliver! The garlic naan is amazing, as are their samosas and chicken tikka masala. The people who run the place are really friendly and the older gentleman who delivers our take-out every Friday night is so sweet.", "author": "J. N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "Chicken Xacuti is similar to one i had in goa , quite authentic wrt to the goan cuisine atleast.", "author": "Y U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-13", "description": "Maybe it was the fact that I had eaten a few hours before arriving here or the fact that we came in just before closing and experienced slow service, but be that as it may, I was not impressed.  However, I will state that the quantities were large enough that we had left overs of each item for our 5-person party.  I may have to give this place another shot on an empty stomach and with people who can handle the spice, since I live by the motto \"The hotter, the better\".", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-03", "description": "Such nice people, great service, fabulous food, very well priced. For two of us our total bill was $30 and we both had left overs.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "One of my new favorite Indian restaurants. I ordered the lamb vindaloo, chicken tikka masala and their palak aloo. The lamb vindaloo was excellent- spicy with robust flavors. And the lamb wasn't gamey or fatty, but was fork tender. Chicken tikka masala isn't usually something I order, as I'm not usually a fan of it(though everyone seems to love it). The sauce was wonderful- creamy, sweet with a light tomato taste, The chicken was a little overcooked though. But it was stiil delicious overall. And palak aloo, well even bad palak aloo is good, and this one was great. I can see myself coming here if it is inconvenient for me to get to Lahore downtown.", "author": "David D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-16", "description": "Oh my gosh - I think I just might not like Goan food. I absolutely love Indian food and was excited about trying something new. But almost everything that my table of 4 ordered was mediocre at best.  Maybe it was just a bad night....", "author": "Alph G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "Damn good Indian food.I love coming here for the Xacuti and the Sorpotel.The sorpotel is not on the menu yet but they will serve it if you ask.The service is excellent.Both the owners are very courteous and the chef consistently doles out excellent goan food!", "author": "Roshomon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-27", "description": "Love these guys! Great food and excellent service! Check out their lunch buffet for only $8.99, its a steal (especially in the marina)!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-06", "description": "This is some of the best Indian food I've had. The spices are uniquely goan compared to traditional Indian but a wonderful flavor experience that everyone should have. A real treat hidden behind a not entirely convincing exterior (very cozy inside). Staff are super friendly - ask them about goa! They're authentic. This is comparable to NYC indian, which is really saying something!", "author": "A G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-26", "description": "Went there with 3 friends and we all had delicious meals. The waiter was polite and prompt and the atmosphere was relaxed. We will return for sure!", "author": "JANET L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "We eat here often and have always had a superb meal.  I was in last week and saw that they had a 94 (out of 100) rating from the health department.  I have never seen a rating that high in the Marina.  I am not surprised.  The food is outstanding and the service wonderful.  I think we have tried almost everything on the menu and have never been disappointed.", "author": "Margaret K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "I went to this place expecting the old restaurant but was very glad we stayed to try it out. Had never heard of Goan food but we loved it. Great curries, Naan's and their veggie wrap was awesome and way bigger than we expected for $5. We had plenty left for lunch the next day. The staff was super friendly and it just felt so mellow. Like we were in a totally different country. I loved it.", "author": "Scott D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "The lunch buffet is super legit - just be warned, you may have to walk to nearby Chrissy Field to relieve being so stuffed. Each of the dishes I tried was excellent, and the samosas were some of the best I've ever had as each bite had the perfect pocket of spice. \n\nThe service staff people were friendly, gracious, attentive, and seemed eager to please.\n\nFinally, at just $9, with free buttery naan, you'd be hard pressed to beat the value.", "author": "Cedrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "This place is superb. I'm English, I grew up eating curry (we eat a lot more curry than we do fish and chips) and when I moved to the US I spent 12 years trying and failing to find a really good curry house in New York that wasn't ridiculously expensive. Viva Goa is THE best curry house I've been to, the service is great and the prices are very reasonable. Highly recommended.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "Went here for lunch with a friend  and had the Tikka Masala which was delicious - Very rich and full of flavor!  I always can tell how good an Indian restaurant is by that dish, and here they made it perfectly robust flavors.  Also, the people here are very friendly which is definitely a plus!  Dessert: try the ice cream in the pineapple!", "author": "Kristina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-02", "description": "Great food at a reasonable price considering the high quality.  The place was empty when I visited right at 5 p.m. on a Friday.  Wait staff was very attentive and helpful.  I will visit again when I am in the area.", "author": "M O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-07", "description": "This is definitely the best place for not only genuine traditional Indian dishes, but Goan dishes as well I especially love their variety of shrimp Xacuti, Lamb Korma, Chicken Masala, and my favorite: Kabuli Na an (which if you're not familiar, is naan bread with cherries and spices baked in). Their ambiance is always pleasant and the  servers always very nice.", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Amazing! We ordered delivery last night. Not only was it on time but it was flavorful, healthy & just the right amount of heat.", "author": "Brandy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-25", "description": "What a find. Good Indian food with really courteous service. I've been searching for a restaurant like this! The food was delicious, spicy and NOT greasy. I will definitely be going again.", "author": "Pamela Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "very delicious indian restaurant!! I have been to other indian restaurant which were better, but i guess this one is the best one in SF area. Their service was not that good, the \"NAAN\" is not very good like others!!", "author": "Ali A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "Amazing Food!!! I'm new to Indian food-- this place has set the bar high... I had the \"Chicken 65\" and it was so good. My wife had the \"Rogan Josh\" -- Also really good... they know what they are doing! Great atmosphere and curiousness waiters. Portions are big. I suggest getting some rice to help fight the heat and also \"Naan\" bread helped too. Prices are reasonable and worth every penny.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-14", "description": "Tried them out for home delivery this evening based on the reviews.  Delivery was faster than expected and the servings are generous.  \n\nI really enjoyed the chicken biryani (a rich rice dish with simmered chicken and blend of onion, garlic, ginger, turmeric, cumin, tomatoes - recipes vary from place to place but it's spicy).  I also had the palak paneer (spinach and paneer cheese in a curry sauce) and raita (yoghurt sauce mixed with cucumber, mint and other spices) that I love to mix in with the rice.\n\nI'll definitely check out the other items on the menu.", "author": "Mic D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-07", "description": "This place is my favorite Indian restaurant.  Appropriately priced, laid back, great service, and delicious food.  Lucky for me it's just around the corner.  This is a hidden gem in the Marina!", "author": "Karina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-16", "description": "This place has the most delicious indian food in SF at an inexpensive price. \n\nSome food in indian restaurants can be very greasy and upset your stomach. This is not one of those restaurants! Food tastes fresh and really hits the spot.\n\nGreat delivery place as well!", "author": "food y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-05", "description": "Surprisingly good food.  We came to this place with one thing in mind that this is the only goan cuisine around bay area. I did not really care about all the other 100 things they have that you get in any other Indian restaurant, rather I went there by keeping \"Xacuti\", \"Vindaloo\" in mind because these 2 things are Goa regional specialty. Chicken Xacuti 4 stars out of 5 , really really good, very flavorful. I love it. Vindaloo I would say 3 out of 5 , not bad but not too good either. Apart from these things we ordered usual things on the menu, they were average. In Appetizers Chicken Lolipop was pretty decent . Price wise 6 curries, 10  naans, couple of beers, couple of sodas came out to be $150 with tax + tip.\n\nI would recommend this place to people who are craving for some Maharastra Coastal / Good spicy food specially \"Xacuti\".\n\nyes they offered us free desert, orange ice cream very creatively prepared. 5 stars out of 5.", "author": "Rajesh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "Great good, great atmosphere--I'm very glad I went to Viva Goa. Had the butter chicken (of course); it was perfect. The beef vinadloo was also very good, and the naan gets five stars as well. Great service, plus a much classier feel than the typical Indian restaurant I frequent. I'll definitely be going again when I'm in town.", "author": "Courtney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "Wow...So glad I decided to stray from the usual local Indian restaurant tonight..Absolutely fantastic Indian food. We had the Veggie Samosas, Chicken Korma and Shrimp Marsala...everything was delivered hot and absolutely delicious. Fast Delivery", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "Best Indian food EVER!  My boyfriend and I stumbled across this place as we used to go to Taste of the Himalayas which was in the same space.  This place blows them out of the water.  My favorite dish was the Chicken Xacuti.  The Lamb Vinadaloo was good too, but next time I think I am going to order a different kind of meat since I am not a big lamb fan.  We also had the Chicken Lolipops which were to die for!\n\nThe service was awesome and the staff was very helpful and friendly.  We listened to their recommendations and were thrilled.  Joseph was our waiter and he totally rocked.  \n\nWe will be getting delivery soon and we will go back for sure!", "author": "Carolyn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "The veggie dishes were awesome - nice and spicy and lots of taste. The samosas were great too because they were not too oily which I think always ruins a samosa. Service was very good, The restaurant has a good vibe generally. It's a cool place, definitely worth checking out if you like the occasional quality Indian feed. Some of the deserts look really interesting but we were all too full at the end of our meal to round it out with deserts.", "author": "Phil L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-02", "description": "Chicken Tikka Masala - the best I have ever had.  The fish curry was good - but we had it delivered so I'm thinking that is a dish best served in the restaurant.  Garlic Naan, Samosas - both ddelicious.\n\nCan't wait to go back and try out the rest of the menu.", "author": "Andy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "We had lunch buffet $8.99 and their food was delish.  We had quite a few Indian buffet before but this place serves fish curry on the buffet table - which was really good. Service was excellent!  We'll be back!", "author": "Dasisters D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "Went to Viva Goa for the first time today.  Pleasantly surprised by the authentic Goan Indian cuisine.  I have eated Goan food back in India and this was definitely quite good. \n\nWould recommend the Malabar Jinga (Shrimp) appetizer, the Chicken 65 and the Vegetable Caldin.  The Pomphret Fish was so-so.  \n\nApart from the great food, the attentiveness of the crew was excellent\n\nWill definitely go back again", "author": "S K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-06", "description": "I really wanted to like Viva Goa because it is hard to find Goan food outside of Goa - other than the ubiquitous Vindaloo.  Unfortunately the only thing Goan about the food at Viva Goa was the names of the dishes.  I went to Viva Goa with a group of Goan friends and we all left disappointed with the food (except for the one non-Goan dish that we tried - chicken lollipops with Szechuan sauce) \n\nThe staff was great (hence the 2nd star) but that could not make up for the food.", "author": "Sancho P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-02", "description": "Decent  tasting curries, chicken curry was good. Some starters was oily and too much food color was added.dont try the shrimp one. sorry for not remembering the names. But once u see the menu u will know what I am referring  to. Their rotIs/naans were awesome.. Sorry for the typo- blame it on apple", "author": "Nifty G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-19", "description": "Great food, great price and great customer service. I crave their food once a week. The decoration is basic. If you like spicy food, you will love this place.", "author": "Maya J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "Came here with a party of 11 for a tour of Marina restaurants. The place was moderately busy and, of course, we were seated right off, since the hostess of our tour had made the reservations. Shrimps Malabar, Beef Cutlet and Chicken Curry with jasmine rice and fresh naan were exceptional. Recommend", "author": "La Gata M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "The food here is amazing!  I have only been in the restaurant once and the service was really good, but it was also very empty as we went early.  I usually order their food for delivery and I have never had a bad experience.  It always arrives quickly and tastes amazing.  I would strongly recommend trying this place!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-23", "description": "Being a person from Mumbai and someone who has been to Goa a lot, my standards for Goan food are really high.  Goan food is amazing, if you get the spices and masala right, and these guys do that so well, without compromising on the spices and masalas to adapt to American taste (which is what most Indian restaurants do in the U.S.)\n\nThe food is simply amazing with all the prime Goan dishes on the menu cooked and served perfectly.  The place is run by Goans from India which explains the authentic flavors and great hospitality.  The ambience is cozy and comfortable accentuated by wonderful Goan music on low volume.  If you have a taste for Goan beer and alcohol, you will find it here too!\n\nPretty reasonable for it's superior quality.  If I lived in the city, would be going here more often, at least once a week.  If you love Goan food, this is the place to go.  If you have never tried Goan food, and love Indian food, you will love the food here!", "author": "Rishi V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "Great food and selection. Yummy goan dishes to please an unsuspecting palette expecting the usual Indian fair. Look past the dated interior and you'll find a real tasty treat.", "author": "Ehab B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "Craving Indian food on a recent trip to the city, we yelped and came up with Viva Goa.  Once again, Yelp doesn't disappoint! \n\nBe warned, Saturday night is a tough time to be looking for parking in this area, it took us FOREVER to find a spot, so if this wasn't good I would have been pretty ticked off!  We got to the restaurant and briefly considered going to the Thai place down the street as the place only had a few other customers and I take that to be a bad sign most places.  BUT the customers inside were Indian, which is usually a good sign, so I'm glad we didn't leave and the place filled up as we ate.\n\nService was outstanding, though it had a flavor of A Christmas Story as there was Christmas music and all of the staff (all Indian) wearing bright holiday ties with their otherwise black attire!\n\nWe were given free papadam to wet the appetite and then ordered vegetable pakoras, Malai Kofta, and Matter Paneer.  They have Goan specialties, mostly revoling around fish, but we're non-fish eating vegetarians, so we went with some of our standard vegetarian favorites.  Everything was awesome and we left absolutely stuffed.  My husband even polished off the Malai Kofta an hour later, he couldn't wait any longer!", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-07", "description": "One thing I have always wondered about is the absence of Goan food in the bay area. Goan food is unique and distinguishes itself from the rest of the Indian cuisine by drawing influences from Portuguese - who colonized Goa for ~450 years -  while not losing its traditional Indian character,  'Viva Goa' fills the gap by presenting a decent Goan menu along with the standard Indian fare. \n\nOperated by 2 very friendly entrepreneurs, Viva Goa is a small and cozy restaurant with an ambiance not too heavy on your eyes. On our request, they even went out of their way to make a 'rava' (semolina) fried prawns. If you are curious, check out the Goan landscape wall hangings, listen to the Goan music while you devour the Goan Cafreal, Kalind, Vindaloo and the irresistible Xacuti. Enjoy with a chilled Indian beer and end with a slice of Bebinca. All at prices that won't hurt your wallet.\n\nI happened to spot it on the very second day after they opened, while returning from Napa and I'm glad I did. I've been there again and plan to certainly eat there when I visit San Francisco next.\n\nI'd recommend them to have a better collection of wines (including port wine) and add more Goan dishes.", "author": "S H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "Recently eat at this wonderful place Viva Goa. this is newly opened restaurant specializing in Goan food. wonderful sea food had shrimp masala in appetizer loved that very friendly staff and kids Friendly place. best tikka masala i have eaten in long time. in desert best desert specialy the pineapple ice cream in pineapplie shell.\nloved every thing i eat.", "author": "kamal b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-19", "description": "Been here twice and it was excellent both times! I grew up on this food and it's as good as home-made (and as close to heaven) as you can get! The pork sorpatel, butter chicken, prawn korma, and navrattan korma are the best I've ever had! The beef chops on the appetizer menu are amazing.  I think I will 10 of those the next time I go!! The only thing I would not get is the bibenca...not my favorite.", "author": "Jaz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-18", "description": "Viva Goa!  This is without any question the best Indian food in all of the Bay Area.  The guys that work here are the nicest and most welcoming of any you'll ever meet in a restaurant in SF.  And the food?  My fiance and I both love Indian and eat it quite a bit, and every dish here is phenomenal.  We now have dinner here about twice a week and take friends as often as we can.  Eat here, seriously.  You will not regret it.", "author": "Dana F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "I haven't dabbled much in Indian food, but was happily surprised by my experience with Viva Goa. My boyfriend and I ordered delivery around 9pm on a Sunday night. I was not only impressed that they were actually open and still delivery, but was pleased when the food came within 30 minutes. We didn't order an incredible amount of food, but what we chose was perfect for two. Basmati rice for one (it's enough for two), Roti (something like whole wheat Naan?), Goan Chicken Masala, Vegetable Caldin, and Baigan Bhartha.  The Chicken Masala dish was by far the best, but the vegetable dishes did not disappoint either. Had a great little meal mixing them together with the rice, trying different combos of the three entrees, and of course wrapping it all up with Roti! Because everything we ordered was sauce-like, I might also try a sizzler next time. Prices were decent and, for a lazy Sunday night super convenient that they deliver! Also looks like they have a pretty awesome lunch buffet, so I'll have to try dining in!", "author": "Julia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "Been here two times now. First time, had their lunch buffet which was good and only $8.99! Hard to beat that, especially in this neighborhood! Also went for dinner Saturday night around 8 and the place was about half full. I love that it never seems to get packed and it's quiet, the crowd is nothing like the people walking down Chestnut just one block away (more mature), and the servers are very polite. While we waited for our plates to come, our server brought us papadums and dip on the house! We had the \"Chicken Xacuti\" and the \"Beef Assado\" with garlic naan and plain basmati rice. The chicken dish is authetic of Goa and was tasty and saucy, not very different in taste from a curry. The beef dish is Portuguese, without any Indian influences, and was not good. It featured sauteed sliced beef with bland over-steamed sliced onions, green bell pepper, and zucchini and a side of rice. The dish lacked flavor and the beef was a bit tough. The naan was too thin; it didn't have enough doughiness to soak up sauce. Mango lassi was delicious and I think uniquely in that you could taste the tang of the yogurt. Chai is not free here like at casual Indian restaurants. Since this is a regionally different Indian restaurant, they also feature a couple of pork dishes. Also of note, all meats are boneless! I would go again for the lunch buffet, otherwise on a deal like Groupon since money's tight without a job.", "author": "Kimberly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "I enjoy Viva Goa. Having been here twice, I believe there is some consistency to write a review. The first time I frequented Viva Goa, it was late (9 PM) on a Saturday evening. My companion and I decided to take a chance on the place even though there weren't many people around. Overall, we were very pleased with our experience. We ordered the vegetable samosas to start, and the Aloo Gobi and Matar Paneer for the main course. Everything was rather tasty- my only criticism would be the Naan, which was pretty bland. Oh- and the nice waiters who have been there BOTH times I've visited were extremely helpful and attentive! The next time I visit Viva Goa, I'll be going for the lunch buffet, and will be trying a few traditional Goan dishes (which are their specialty, after all).", "author": "J L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-24", "description": "We are visitors from Southern California.  We come to SF once a year because we love the city so much. We used to take in one Indian food meal per trip near North Beach and really liked it there.  Then, somehow last year, I learned about Viva Goa.  The fact that is was Indian food from a different region than we were accustomed to, I convinced my husband to try something new.  It was so good last year that we came back this year and found it to be even better.  It helped that it was less crowded (we got there earlier) so had time to chat with the waiter (who is from Goa) about our choices.  The chicken vindaloo was the best we've ever had!  We also had the vegetable xiachu (not sure it's spelled correctly) and a Goan lamb dish.  Kudos all around but especially the chicken vindaloo (which incidentally originated in Goa and was taken up and dumbed down by other regions i.e. Punjab).  The waiter brought us a complimentary dessert, but we were too stuffed to enjoy it.  The prices were reasonable and we had enough to take home for another meal.  The ambiance was nice and I got a big glass of Kendall Jackson for $8, which is far cheaper than I've seen at other restaurants.  All in all, an enjoyable experience.  We'll be back.", "author": "Sally D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "This place is really good. The waiters were very attentive and the food did not disappoint. Everything we had on the menu was on point. We ordered a variety of meat and veggie dishes (there were some vegetarians in the group) and shared it family style. The tandori chicken, though a basic dish, was my favorite. The dessert menu, however, was a little disappointing. But who cares, you don't come here to eat dessert, you come here to eat some tasty indian food and that we definitely did!", "author": "Food L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-21", "description": "Have been dying for a Beef Vindaloo and finally found one on this menu.  Total disappointment. Beef was fatty and sauce watery with no bite. Skip this place.", "author": "Colleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "When we saw the 'grand opening' sign of Viva Goa, my wife immediately suggested to check them out and I was happy to say \"yes\"! We had our honeymoon in Goa and the cuisine there has clear differences to the neigboring places in India. We had an early dinner, not expecting too much but a new restaurant trying to get their system/food going. Happy to say that from the service to every item we tried, from lassi and roti to the chicken and fish dishes...everything was first class Goa. We wanted to stay there as long as we could and eat as much as we could since the simplicity and the ambience as well as our waiter and the food reminded us the Goa we've known and loved. When we finally went outside to Lombard st., it was an overcast, cold summer day in SF instead of the palm trees and sunshine we almost believed we'd have. For people who don't know the difference, this place is a perfect introduction to Goa as a distinctly different place/cuisine as India.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-16", "description": "The food and service were perfect.  Visited the restaurant with a Goan who knew how to order and rate the food....he loved it....I loved it...so delicious!!  The fish curry is amazing...I can't say there was a bad dish ordered, and we ordered several.  We are definitely repeat customers.", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "Ordered the lamb marsala, chicken xacuti, garlic naan, and rice. Got it spicy and was a great decision as it was spicy and not the crappy fusion spicy. Also had the bebinca for dessert. The food was great and so was the service. Why... Cause my water was always full....", "author": "joe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "Everything here -- from the mango drinks to the matter panneer (MY FAVORITE) -- was awesome.  The service was attentive but not overbearing, the garlic naan was hot and perfect, and the other dishes we ordered were great.  Everything had a bit of spice to it, but nothing too outrageous (as someone who isn't so into the spicy, I appreciate this).  I'm sure they could punch it up if requested.  Definitely recommend ordering family style as the portions are just right for sharing and getting to try a bit of everything.", "author": "Anna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "Went in for a late lunch and we were one of the first customers ever (they were just opening that day). The samosas were quite good and I had dish I had never seen in an indian restaurant before (can't remember what is was called though...Xachuti maybe?)...fantastic spices. The desert of pineapple frozen yogurt in pineapple skin was really good. All of the staff there was incredibly friendly!", "author": "Adrian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "I'm not a fan of buffets because I always tend to over eat even if the food is so-so just because the food is available and I want to eat enough to make my money worthwhile. I've never been to Goa so I can't say I'm an expert on how authentic the food is, but I can say that the buffet is truly fantastic and even if you don't stuff yourself, you're getting a bang for your buck because of the quality of the food. There's a fish curry where the fish is tender and flavorful (not dry like I've had at buffets in Vegas where you know the fish has been overcooked sitting under the head lamp). They do change their buffet items so you get a surprise each time but you can expect the tandoori chicken, which has always been super moist and lightly seasoned. I also love how the naan is actually brought your table fresh and crispy and you can always ask for more if you've finished the basket. The service has been great and the ambiance is simple and clean. Love it and rave about this place all the time to friends. Oh and the buffet is more than reasonably priced!", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "Really blown away the Tiki was awesome, as well as the service.  The value is great especially for the location right in Marina.   The Naan was AMAZING!!!!!", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "This is one of these places that makes me wish that my stomach would be three times its actual size just so that I could try more of their delicious dishes. The food is very good and a welcome change from the usual Indian cuisine. Very good service! The waiter was attentive and answered all our questions in a friendly, patient manner. I do like the setting, too. Clean, not heavy on the 'oriental ambient' but friendly colors and a beautiful photos. The music was very soothing and tasteful and at exactly the right volume. I will absolutely be back.", "author": "Rashke M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-05", "description": "Amazing food!! Loved loved loved the pomfret and the goat xacuti was pretty darn good.", "author": "Sunaina b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "Tried the Lunch Buffet $8.99.... Everything was delish.  Chicken Vindaloo & one Goan Lamb dish were Superb.  Very good and friendly service.  Had a conversation with the server and found out the Chef is actually from Goa and had worked for the Taj in Goa for years.  Good to know and will be back for dinner soon to try out more authentic Goan dishes for sure.", "author": "Mel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "Best Indian food you will find outside of traveling to dosa or amber India. Difference is they deliver and it is about half the cost. If you are getting indian delivery, there is no better option. Owners are great people. Have had probably ten different items, all great. Fish curry and fish masala are amazing, as are all of the ghoan lamb specialties.", "author": "Christian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-31", "description": "Checked out Viva Goa for the first time on Friday. I was super excited that an Indian place opened up in the neighborhood. I never really like the place that was there before. I also like the lunch buffet because it gives me a chance to try some new things and also makes for a quick lunch when you need it. I really liked the place. Everything seemed pretty fresh on the buffet. I don't consider myself and Indian food expert but one of the things that I really don't like is when the naan is already made and a part of the buffet. It just starts to get rubbery and not my favorite. So right away I give them thumbs up for making fresh naan and bringing it piping hot to my table. I also liked that they had some fresh fruit and salad. Sometimes it seems hard to find something fresh on an Indian buffet to mix in with all of the rich food. I plan to go back often and I hope that other people do too so this place will stick around.", "author": "Mike V."}
