{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Where do I even begin with this lovely neighborhood park. It's well maintained, not too crowded, and centrally located in North Beach by some great take-out spots, Italian delis, and liquor stores.\n\nI personally enjoy heading to the park after work to do some dog spotting. My GF and I have learned the names of a ton of the frequent puppers. We head out with our picnic blanket and accidentally set up camp near the group's of dogs. Inevitably, some excited puppers find their way over to us.\n\nThe only downside would be the homeless, the addicts, and the crazies. Unfortunately there's overlap between all three groups. Homeless folks setup camp in certain areas and basically take over, but they keep to themselves. The crazies are pretty scary, but there are enough people around that It's likely the biggest issue will be them yelling and ranting.\n\n5/5... I'm so happy I live nearby and that my GF and I can enjoy it. Weekends it even turns into a mini Dolores park, but with less obnoxious people.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "One of my good friends lived in an apartment on Union Street in Telegraph Hill which is a neighborhood within another neighborhood, North Beach, in northeast San Francisco. During my visits to see him for many years over the last decade, we would often walk by or through Washington Square Park. He lived less than two blocks away, up the hill. Washington Square always stuck out to me as a vibrant and busy park. It's popular among both locals and tourists.\n\nThis is a small, flat, urban park that takes up one city block. There are trees, bushes, benches, and the grass is green and lush. For a public park in a big, dense city, the landscaping and cleanliness is decent. There are two statues: one of Benjamin Franklin and one of two firefighters to commemorate the volunteer fire department of San Francisco in the mid-1800s (this is actually one of the city's first parks; it opened in 1847). The firefighter statue was erected in 1933 \"by bequest of Lillie Hitchcock Coit\" for whom the nearby Coit Tower was erected and named after. To the east, the park has a nice view of the tower. To the north is a great view of the beautiful Saints Peter and Paul Church which sits adjacent to the park.\n\nEven though Washington Square technically sits on the western edge of North Beach, it still serves, in many respects, as the \"center\" of the neighborhood. It regularly hosts community meetups, various local festivals, and other special events. And for those who don't know, North Beach is regarded as San Francisco's \"Little Italy\" (https://www.yelp.com/biz/north-beach-san-francisco) with many great hotels, shops, and restaurants either adjacent to the square or closeby. This is a great place to bring a blanket on a sunny day with a group of friends or family and eat pizza from Tony's Pizza Napoletana (https://www.yelp.com/biz/tonys-pizza-napoletana-san-francisco) or Golden Boy Pizza (https://www.yelp.com/biz/golden-boy-pizza-san-francisco) or gelato from Gelato Classico Italian (https://www.yelp.com/biz/gelato-classico-italian-san-francisco) while listening to the church bells chime as you watch dogs play and people relax.\n\nThe park is maintained by San Francisco Recreation and Parks. Gender-neutral restrooms are located on-site. Official park hours are 5am to midnight (they used to be 6am to midnight). For more information on this park and for permits and reservations, visit www.sfrecpark.org.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "This is a lovely little park right in the city. Lots of shade, benches and a children's play area.  Despite all the activity going on around here, it feels like you are a bit removed from it all. On a sunny day, it can be busy but it is much smaller, more relaxing and family friendly than say...Dolores Park. \n\nPack a lunch, a book and definitely a blanket (the soil is always soft and a little damp). I love the people watching and views of the cathedral (on a good day you might catch a wedding or other big event). It's also super dog-friendly, assuming they are on-leash. Thanks to its location lots of charming street cafes, pizza or coffee if you need a break from the park. However, street parking appears to be incredibly limited.", "author": "Tarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Metered street parking nearby if you are lucky. Fun and inspirational seniors practicing tai chi and dance. Makes me feel like I'd like to join them and simultaneously feel guilty that I'm in the Mama's line rather than exercising. Lol. \nExcellent view of Coit Tower, Telegraph Hill. Tony' s Pizza,  Molinari's deli, and Sotto Mare Family restaurant is nearby.", "author": "Lorene P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "This park really deserves a perfect 5-stars rating like most of the parks, beaches, hikes and other freebies given to the loving public. The history alone deserves 10-stars, but I just can't get past the one zillion pigeons that call Washington Square Park home. I digress it's more about the pigeon poo, or truckload, rather than the park.\n\nWashington Square Park is located between North Beach aka \"Little Italy\" & Chinatown, San Francisco. It is one of the oldest parks in the city established years before the California Gold Rush, in 1847. The surrounding areas include many independent cafes & coffee shops, including the famous Mama's and Liguria Bakery as well as the historic Saints Peter and Paul Catholic Church. The Square is a natural community gathering spot with a rich history. Festivals, free movie nights, and other special ethnic events can be seen throughout the year. \n\nWashington Square Park also saw the iconic \"secret\" wedding photo shoot of baseball legend, Joe DiMaggio & Hollywood Icon, Marilyn Monroe. The couple actually was married elsewhere but took their infamous photos on the steps of the historic Roman Catholic Church nearby. The scenic park, with unforgettable cityscape views, can also be seen in Clint Eastwood's \"Dirty Harry\" movies and Whoopi Goldberg's \"Sister Act\". San Franciscan, Robin Williams, with incognito baseball cap & jeans, could be seen strolling occasionally too. I'll have more on the Joe & Marilyn wedding in a future review;) \n\nYet, with all the history, local folklore, and the Benjamin Franklin Statue at the center... I just can't forgive all those homeless pigeons that actually outnumber the homeless humans here 100 to 1, but then again if the pigeons are pooping everywhere including on Benjamin's head then maybe it's more their home than us two-legged folk... \n\nGreat \"city\" park to enjoy if you can avoid the pigeons...", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "This is a classic San Francisco park! So many generations of locals and tourists have stepped foot in this park. I pass by a lot, sometimes I have sat in the park. It's near the church. It's near Columbus. It's near the busy part of North Beach. If you are visiting, if you are a Beatnik, if you are Italian, if you are Chinese, if you are in SF--you might be at this park. But keep it tidy and good for all.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "This is one of the more iconic open spaces in ye old north beach/telegraph hill/columbus ave area.\n\nParking? Yeah, no. There is street parking but in San Francisco that's more of a fantasy then a reality. Like most things in downtown SF you'll be wanting to get here some other way then driving. Luckily San Francisco is one of the most pedestrian and bike friendly cities on the entire planet. So that combined with an excellent mass transportation system will get you around just about anywhere, not least washington square park. \n\nIt's been said that this is like the city's living room with a small playground for kids, and that's not far off the mark. It's surrounded by picturesque cafes and Saint Peter & Paul's cathedral. It has a fair amount of green space, and a couple of statues. The central one is of Benjamin Franklin and there is a time capsule buried beneath it. There are trees, benches, some not worth your time bathrooms, birds, and at any given point of time a whole lot of people-locals or otherwise-enjoying the park, Great spot for yoga, tai chi, frisbee and whatnot. In the daytime it's a perfect place to mellow and watch people for a bit, and it's mostly safe at night. The vibe here is very different at night, and late night especially may not be the best place to hang out at, but it's a perfectly acceptable park in  daylight and shortly after sunset. \n\nAll in all it's a very nearly perfect public space in the city, great for people watching.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "What a little gem nestled in North Beach. We came across this park walking to a hole in the wall one night. What a great find! \n\nWe took a seat on one of the benches and watched our surroundings for quite some time. Even though it was late at night, there were friends having picnics, people walking dogs, other walking home or to their next destination, it was quite lovely. For being in a park so late, it felt really safe. You have a great view of the neighborhood and the beginning of North Beach restaurants and bars. Cute little Italian area. \n\nIt's even better during the day! So much to see and do. If you want a break away from the hustle and bustle, come here and relax.", "author": "Zoe F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "This park's a bit small, but it has great views of the cathedral and it was a nice place to sit and relax. I love the trees and lush green grass and it's a nice place for a picnic, dog walking, or people watching.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Figured I squeeze in a quick review before the start of 2017. Washington Square Park is a picturesque park nestled in the urban jungle of San Francisco. When exploring the city, my husband and I often walk past Washington Square Park on our way through Little Italy. There's an interesting church that serves as the focal point, but it's also a good people watching spot. As expected for a big city, there are some homeless individuals who haunt this spot, but don't let that deter you from visiting this park. Washington Square Park is a good stopping point for a breather when walking to either Chinatown or Fisherman's Wharf.\n\nYELP 100 CHALLENGE 2016: #84", "author": "Cassandra B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Having grown up in North Beach and gone to Sts. Peter's & Paul School, I took this Washington Square Park for granted. Now that I've seen and visited many other parks in the City, this open square block of grass named nestled in the busy North Beach neighborhood next to the majestic Sts. Peter & Paul church with a view of Coit Tower is an overlooked park in the City. \n\nThe park is a gathering place for neighborhoods residents to watch the hustle and bustle from the park benches, take their kids to play in the little playground at one corner of the park, do their group tai chi exercises, have a picnic with the great food choices in the area like pizza from Tony's and Golden Boy or sandwiches from Molinari's or simply chill out on the grass.\n\nWhen in the area, take a break, be a local and check Washington Square Park.", "author": "Al L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "Great place to sit and just relax given the weather permits. I sat here for about an hour watching people and enjoying the sun. There is park benches and plenty of grass to sit on. Located near the city, lots to see and walk to as well.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "The was a cute little park right outside of china town. It's a nice little walk. There are a ring of sculptures and neat architecture. Very green and lush.", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "This is the best park here in San Francisco. With a large space for tai chi, a morning jog or a stretch, you're at the right spot. A play structure here, it's a very good spot to take the kids along.\n\nNice spot to congregate, relax, take a walk or a jog.\n\nThere's plenty of eateries nearby so if you're hungry, then there are a lot of choices to choose from.\n\nFisherman's Wharf and Chinatown are both nearby. Also of convenience!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "This is not just any old park.\nThis park has a complete life of its own.\n\nIf a park could earn the equivalent of \"mother of the year,\" Washington Square Park would hold the title.\n\nEvery year.\n\nLet's take a look at her regular schedule, shall we?\n\nHer day starts bright & early.  Make that foggy & early.  This is San Francisco.  It's never bright at 6:00 am.\n\n6:00 AM.  Tai Chi.\n7:00 AM.  More Tai Chi.\n8:00 AM.  Even more Tai Chi.\nBasically, she's got Tai Chi from 6 to 10 every morning.\n\n8/9/10:00 AM.  Dog sitting. \nAnd walking.  And running.  This of course overlaps w Tai Chi, & can be quite entertaining.  \nDog sitting time goes on, intermittently, all day.  It tends to subside in the afternoon, but then gets pretty crazy after 5pm.  \n\nWedding pictures.  \nMainly on weekends, & can be in the morning, afternoon, or early evening, depending on the time of the wedding at Sts. Peter & Paul Church.  One of the most beautiful churches in the city, her iconic structure watches over WSP like a mother hen.  The two are basically synonymous.\n\nSports.\nDays vary, & weather permitting.\nVolleyball is seasonal, while soccer goes on every Sunday in summer.  Usually accompanied by reggae music.  \n\nArt shows.\nEvery single Sunday in late spring, summer, & early autumn.  Canvases set up for your perusing pleasure.  Take a stroll in the park, buy a painting.  Nice.\n\nThen there's the whole pigeon situation.  They like to hover & hang, but it's not WSP's fault.  She calls it an occupational hazard.  And she'd like to reiterate...please do NOT feed them!  Ever!\n\nSee that?  A day in the life of Washington Square Park is hardly...a walk in the park.\n\nAnd that's not even counting events like movie night or the annual festivals.  Or the local boys playing football every Thanksgiving Day.  \n\nWashington Square Park is perhaps the hardest working park in San Francisco.  \n\n5 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "There are a lot of great parks in the City, of various sizes and shapes. But for some reason I keep coming back to Washington Square Park.\n\nOk, part of the reason is that this is probably the best park for the mid-day drinking nap. Decently shaded, moderately crowded, dog friendly, central location, and with plenty of bars and restaurants nearby. \n\nDecently shaded - this isn't just an open field, there are trees in this park. The playground area is surrounded by pines, but the main park area has a few trees to lay under their shade.\n\nModerately crowded - On a nice weekend, you will usually find Delores Park a madhouse with barely a square foot of space. I have seen this park with painters, frisbee players, and others and there has always been plenty of space. Likewise the crowd is always laid back here.\n\nDog friendly - Yeah, I like dags. Dogs off leashes, catching toys and running around are common, and the clean up even more so.\n\nCentral location - You are in North Beach, a few minutes walk from Chinatown, Russian Hill, Embarcadero, Fishermans Wharf, etc. \n\nBars and restaurants - Rogue and Square Bar directly across the street. Tony's and Joe's directly across the street, as well as sushi, Thai, Greek, America, pastries, and spit in a direction and you'll hit Italian. I'd say picnic in the park, but you may not even need to take out.\n\nSaint Peter and Paul Church - Not a church guy, but hard to ignore this beautiful piece of architecture (that also rings).\n\nIt also has a bathroom, which is incredibly convenient if you've been day drinking.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "This park has become my go-to destination on sunny days.  I mean, how many places are this entertaining, gorgeous, and FREE in San Francisco?  \n\nSteps to having a good time at Washington Square Park:\n1.  Grab a blanket, a Frisbee, and/or your dog.  Make sure to pack a bottle opener and/or wine opener\n2.  Make a pit stop at Trader Joe's, S & S Grocery (Green & Union), or Little Vine (Grant between Union and Filbert)  for some snacks and/or booze.  You could also order a pizza for takeout from Tony's (some of the best pizza in California)\n3.  Enjoy!  Take in the scenery:  watch the Asian dancers, check out the artists, and gawk at the stoners\n\nBonus:  Make sure to take in the grandeur of Saints Peter and Paul Church.   Joe DiMaggio famously took his photograph with Marilyn Monroe there after marrying her at SF City Hall in 1954.  Joe grew up in North Beach.", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "This is a nice little park by a beautiful church.  It has lots of seating filled with locals and plenty of room for the kids to play.  Add how close it is to all the Italian bakeries.... Well you have all you need for a nice afternoon break.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "I love that SF is filled with tiny little parks like this. My favorite gelato spot is just up the block from this park, and I love to get some sorbet with friends and sit at this park and dog watch. Along with watching all the adorable dogs at play, you also get a pretty interesting mix of old people doing their daily stretches along and other colorful SF characters. It is still the perfect spot to take a break from spending all your money on the delicious food in the two block radius of this nice spot of green.", "author": "Sophia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "So much potential here.\nThe city needs to take a closer look at this small gem of an outdoor space in North Beach.\nIt needs an overhaul and a major clean-up!\n\nGreat for a quick break on one of the benches or an extended period of chatting with friends or just taking a moment for yourself.\nGreat views.\nWonderful mix of people.\n\nClean it up!!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "There's no question that this is one of the most wonderful parks in any city, any where.  I want to compare the experience to another place but it deserves recognition as being unique.  \n\nI feel like the lifestyle here is very low key.  The park feels like an old school Italian plaza.  It really is in the heart of the best City on the planet.  \n\nIf you visit SF, make sure to go to North Beach and visit Washington Square Park.", "author": "Claire H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "A smaller, more relaxed version of Dolores Park right in the middle of North Beach.  \n\nPerfect spot for people watching or a coffee break after a good day cruising around town.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-14", "description": "The park is wide open - no fences. The restrooms are pretty clean for being open to the public (i.e. homeless). The grass is in pretty good shape and there are lots of benches all over. Parking (as is most places in SF) is difficult.\n\nThere's a small play area for kids, though the park a couple blocks north on Columbus is 10x better.", "author": "Jason U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-06", "description": "You just have to love a park full of green grass surrounded by a city full of concrete and steep hills. It's fun to lounge in the Spring and Summer time while lounging on your blanket enjoying the sun rays. \n\n\n\nWatch out for homeless people and keep a close eye on your stuff while your in the zone mode.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Great place to hang out during a nice day. Bring your dog, a good book and a blanket! I just moved to SF so I'm not sure about open container laws, but people were openly enjoying a beer or glass of wine - my kind of place! The church nearby chimes every hour or so making it a neat environment to hang out in. \n\nThe park has public restrooms which were pretty clean for a city park. \n\nIf you want an afternoon treat, head to Victoria Pastry Company nearby. Superb Italian deserts like tiramisu and cannoli's.", "author": "Elaine Tiffany P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Great place to hang out and have a picnic on the weekends! There was a group of middle-aged chinese women dancing for hours and that was kind of entertaining.  We brought sandwiches (from Prime Dip sandwiches) and wine from TJs and chilled there for a few hours and one of our friends entertained us with super cheeeeezy jokes and games :DD  \n\nPros:\n- Not over-crowded\n- 2 blocks from Trader Joes to pick up snacks and wine\n- Across from Victoria pastry company in case you're craving sweets and lattes.\n- Parking isn't bad. Found metered parking in 10 mins. You can pay online if you're out of coins. (we just found that out!)\n- Tony's pizza across the street - Yum!!!!!!!\n\nCons: \n- There were 2 homeless people fighting.  What are we in Junior high?? This one guy swung his razor and almost hit one of us and the cops came after it ended.", "author": "Jennie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-06", "description": "It's nice until you come across the rats that scurry around at both the north and south ends of the park at night. Nasty! Hopefully they don't make their way into any of the restaurants nearby.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "Love the public park where people chill, sit down to relax, got restrooms prey they are clean, got everything you need can be used, open all day to the public, beautiful cathedral church, etc... the only thing don't like when walking in the park 3/10/2017 is some dogs got no leash on them and the owner don't know how to take care, hold back, and discipline their dogs. At least most of them do but this time when walking around the park minding my own business there's a miniature brown dog just kept on growling aggressively, barking, coming towards me, saying get away like it's his park/ territory which is not I told the Asian owner you need to put a leash on your dog before this happened she told the dog nicely in a playful way to come animal will not come this idiot owner doesn't know how to take charge discipline little thing, if your dog misbehave you don't talk in playful way of course they are not going to come and listen to you very irresponsible young age Asian lady owner later on when looked there were red body leash around brown dog next to green bench away from people still was growling bad non- disciplined manner.", "author": "Lorrie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-17", "description": "This is a mid sized lawn area in the middle of Little Italy area in North beach, so there's a nice city view with a lovely church across the street and restaurants and small businesses everywhere. There is no jungle gym or a kids area. This is a place mainly to take your dog for a walk or have a picnic, suntan, or just take a small break if you live around the area. There are some benches on the sidewalk. Overall, nice spot to catch some sun or hang out with family and friends.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "This is the place to indulge in some heavy duty people and dog watching. There were tons of locals with their pooches enjoying the beautiful weather. It would be great to grab a bite to eat from one of the many nearby eateries and enjoy a picnic in this perfect park. I can't wait to revisit this little gem!", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "GORGEOUS park! Plenty of space to take a blanket and lay out enjoying the sun like the locals do. You'll fee like you're in Spain, with the gorgeous cathedral there and all the people scattered on the lawn on sunny days. The walking path around the park is delightful, and offers benches in both the sun and the shade. \n\nGreat little cafe's around the square and located right next to Coit Tower!", "author": "Kate N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-07", "description": "Interesting little park that I came across while waiting for Tony's pizza across the street. Here during a weekday in the afternoon (during lunch time) and there is certainly a diversity to this park. Reading the other reviews, I probs didn't come across this park on a good day. There were some people doing tai chi at one of the perimeter's of the park and some people playing music. Cool little neighborhood spot!", "author": "Wing L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-06", "description": "What's not to love about this park?!  I don't know why it is called a square park because the path to walk around the park seems to me more like a circle than a square.  Unless, the city planners are trying to say that the park takes up the entire block...then that would be understandable, I guess, but wouldn't it be named Washington Block Park?\n\n...Besides that point, there are so many pleasant things to say about this park!\n\n+ Lounging on the grass or on the benches is so relaxing\n+ Great, enjoyable stroll on a warm day\n+ You can play with your dog here and play frisbee\n+ People watching is quite pleasant\n\nDefinitely, a breath of fresh air in the morning!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Dogs running around, church bells ringing, smell of the most delicious Tony's pizza!!!\n\nI can't ask for more, this place is perfect. Great food is near by AND you can chill with your dog. Plus it doesn't get too crowded. Even if it's a sunny weekend, it gets moderate ly crowded but it's really fun watching people and dogs too.", "author": "Yuki A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-20", "description": "Solid 3.5 stars\n\nSurprisingly....there so MANY PEOPLE on a Thursday afternoon at 2pm!!\n\nDo people not work and just lounge around parks? Either way, great park to coem visit on a great day in SF!\n\nBring a blanket and lounge if the weather permits.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "My favorite brake spot btw downtown SF and Fisherman's W. \nThe entire park is a great ,green outdoor spot to have a coffee at one of its benches,  and on a warm day,  picnic is a nice option too. Great spot to relax and spent some idle time. \n\nNext to it is a beautiful St. Peters and Pauls cathedral/church with the statue of the smaller replica of Micelangelo's masterpiece  \"Pieta\" inside. Although a historic spot this church is also known by many as the wedding spot of the movie star Marilyn Monroe and baseball player Joe DiMaggio.\n\nFor falks with kids - there is a tiny playground with the swings underneath the pine trees and slides in the sandy area. Public bathrooms on the spot. \n\nAwareness for the personal belongings is recommended.", "author": "Dani O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "There was shit alllll over the walls in the men's bathroom... had a good time here today :)", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-17", "description": "A nice expanse of grass in North Beach. \n\nFlanked by Sts. Peter and Paul church on Filbert St. \n\nSurrounded by Italian cafes and restaurants. \n\nA small playground on the northwest corner.\n\nPark benches surround the perimeter. \n\nWashington Square Park provided an excellent post-dinner activity: people watching. \n\nResidents catching the last rays of the day. \n\nDog walkers passing by.\n\nA rottweiler relieving himself 3 feet away from a pretty brunette.\n\nA baby less than a year old, taking her wobbly steps and finally, landing on the same spot where the rottweiler left its mark.\n\nMy friends, that is why I sit on a park bench.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-28", "description": "70 degree day in SF.  \nLaid on the grass (on top of the jacket chivalrously laid out for me).\nBasked in the glow of the sun (blasphemous I know).  \nEnlightening conversation. \nInnocent laughter. \nPerfect!", "author": "Zak R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "On a nice day, it's a'ight.  Bring a blanket, some friends, some 21st Amendment watermelon beer, sunglasses and cop a squat...  Not as crazy, busy or hipster-ish as Dolores park (which should earn a star in itself), but provides a great place to take a nap (I see the homeless do it all the time on the benches ---  See my profile photo of SUNDAZE in Washington Square park).  I would definitely be careful about laying in the grass since this also doubles as a pet playground....Last Sunday, I saw Sinbad slangin' some swords...and some steroid enhanced body-builder slangin' some weights and some artistes slangin' some paintings.  Totally RANDOM YO'.", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "Love this tiny park.  It has lots of tall trees that provide shade.  Lucious greens... It has plenty of benches, I love to watch people take their doggies here to poopie and frolick in the grassland.  The people here are always happy b/c their touring or doing some outdoors activity.  I love to eat lunch here on the bench b/c it's so comfortable with the breeze and all.  The benches looks clean enough to actually sit on, which is rare for the city.  Didn't know they have wifi but They do.  Sometimes people run around in circles for exercising.  There is also a pay toilet nearby.  A clinic near by, and Saint Peters Church right in front.  Plenty of restaurants around.  This park is great for people of all ages.  Lots of people with off leash dogs, sometimes people with strollers walking around, children/adults climbing on the trees around b/c they are a good height and size to climb, people basking in the sun, reading, listening to music etc... Overall a nice park", "author": "Juila L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "Located on Columbus street, Washington Square park is one of the most family friendly park's i know of im the city. It's the only park i feel safe in late at night as thier are so many are in the park late at night. Easily accessible by the 30, 45, and the 8x i think. Lot's of bar's and coffee shops in the area that add to that North Beach charm. The cathedral is beautiful day or night and it's not to far of a walk from the Coit Tower. It would be nice and smart if the city in vests in extending the central subway to North Beach and Fisherman's Wharf. It only make's sense .", "author": "Tj J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "Washington Square Park is kind of a mixed bag. On those wonderful weather days, it tends to be filled with a bad combination of tourists and gutter punks. Who can blame them. The former gets off on all the \"authentic\" Italian eateries and historic church (which I must admit is very cool), while the latter get off on the fact that tourists have money to burn.\n\nBut on overcast days, it's actually quite a nice place to hang out, people watch, and maybe enjoy some food from the nature stop (nearby on Grant.) If it is overcast, do be sure to bring a scarf because it gets very windy and brisk over here. Oh, and watch out for spare bullets...", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "In my younger years, I would watch the sunset at least once a week at the rocky cliffs along the edge of Ala Moana Beach Park in Hawaii. Being smaller and less worldly, the park was the edge of everything I knew. I would look out onto the horizon and wonder what was going on at the other side. \n\nI've since crossed that ocean and have found equally remarkable places here. One of these places is Washington Square Park. While it doesn't match the grandeur and awe that is a sunset in Hawaii, it's a favorite place of mine in San Francisco. At one end is the Saints Peter and Paul Church, majestically overlooking the square of green. A statue of Ben Franklin stands modestly amid the trees, as if to declare San Francisco's reputation for both free thought and ecological consciousness. Dogs play, pizza is eaten and old people speak in foreign languages...\n\nBut mostly it's just really pretty.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-26", "description": "Okay.  I will admit it right away.  I am totally biased.\n\nThis park can be great. Its a nice bright, grassy spot in the middle of North Beach.  It has festivals, and sunbathers, and all kinds of good stuff.\n\nBut, like I said, I am biased.\n\nA few weeks ago my little pup was attacked by another dog here.  She is fine, but it was scary.  She has had some close calls in the past, but I just want people to be aware that there are some scary dogs that come here.  So be careful!", "author": "Amy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-13", "description": "You should never knock a park no matter how grungy it can get due to human indifference. It provides the little pastoral element missing in our otherwise limited lives defined by concrete and steel. In fact, Washington Square Park is one such patch of greenery and so essential that I have to channel the Beach Boys to express my feelings....\nhttp://www.youtube.com/watch?v=G_2PHhgtV6Y&mode=related&search=\n\n\"Well...those Chinatown grannies are so hip\nI really dig how they wind their arms\nAnd the suburban moms with their screaming kids\nThey knock me out with their lack of charm\n\nThe tourists from Union Square really give me lots of gas\nWhile the Castro boys walk their dressed-up pups\nBefore they give their old boyfriends a free pass\n\nI wish they all could clean Washington Square\nI wish they all could clean Washington Square\nI wish they all could clean Washington Square Park\n\nGolden Gate Park gets all the press\nAnd the DeYoung gets all the buzz\nI dig a Golden Gate custard tart on a stroll\nAnd a slice of pizza on the grass just because...\n\nI been all around this great big world\nAnd I seen all kinds of parks\nYeah, but I couldn't wait to get back to ol' North Beach\nBack to the broken benches I just love\n\nI wish they all could be Washington Square\nI wish they all could be Washington Square\nI wish they all could be Washington Square Park...\"", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "The best part of this park was having a place to go while waiting an hour to get into Tony's pizza! It was great people watching! You could see people playing ball, watch a variety of dogs and there was even a street performer there. It's a nice place to cop a squat and have a picnic.", "author": "Christie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Though there are far more inspirational patches of green in the city - this park is still a lush welcoming sight in the city. Especially among the bustle of North Beach.\n\nFrom movies in the park, to the North Beach Festival, to mid-day lunch breaks - spent lounging on the grass with some take-out, to causal friends - throwing around the frisbee - Washington Square Park is What's Up.\n\nAn open stretch of grass - nestled amongst honking cars, bright flashing lights, lost tourists, and gregarious restaurant owners - beckoning you into their half full eateries - Washington Square Park offers a unique sense of beauty and inspiration to the area.\n\nThis park is often forgotten. Often overlooked. But next time you have a long work lunch - or happen to find yourself wandering around here on the weekend - bring a blanket and a packed lunch - sit down - and admire the city from a new perspective.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "I love this park, I grew up in SF (and Burlingame) and this is a small but beautiful park. People are happy and look like they are having fun.  You see people practicing tai chi, people walking their dogs and children playing. It's a great, fun park. It is also close to St. Peter and Paul church (beautiful) and a lot of cool restaurants and bars.", "author": "Heidi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "Gorgeous park, lots of people, pet friendly, and hello, centrally located to lots of districts within SF! Yes! This is a fantastic park!", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "I love this park and the serenity found here. This section of San Francisco is def my favorite as there is a lot to do here and this park is great for people watching. This place is surrounded by awesome restaurants and then there's the beautiful church right in the front of it. I highly recommend it. It's a good place to spend some time.", "author": "Betancourt E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "I'm conflicted is this place for humans or dogs because every owner in the area brings their dogs here and sitting on the grass is not an option because of the p!ss and sh!t. The benches are okay as long as your careful about where you sit. The best things are that it's right in North Beach and has free wifi.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "Scenes from a sunny Sunday at Washington Square Park:\n\nGood friends. Beer and mimosas. Willie making friends. Golden Boy run. Many, many trips to Coit Liquors. And unlike Dolores Park, ample space to spread out.\n\nPure bliss.", "author": "phil h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "This was a new gem in our treasure chest of San Francisco!  We were just out walking and came upon this park.  The day was sunny and the park was loaded with friends laid out on blankets talking and enjoying life.  Surrounding the park was an area with artist displaying their newest masterpieces and on the other side was a few Rastafarians playing island music as they danced with the Jamaican flag and dribbled a soccer ball.  It was quite the site and a very relaxing and peaceful place.  I only wish we had more time to enjoy the park.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Love this park. You can people watch, play frisbee, volleyball, or just hang out and drink some wine/beer. It's pretty clean (minus homeless people and pigeons, of which the former clear out on nice days), so bring a blanket and take a nap here for a while. It's pretty safe too, and it's right next to North Beach, the Marina, and Chinatown. The multitude of restaurants and cafes nearby are also a boon.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-22", "description": "One of my favorite parks in the city especially on a sunny day. It's so lively and has such a great atmosphere. Then there's the majestic church across the street that makes you feel like you're in France. There are people relaxing on the grass, playing frisbee, dog walking, playing with their kids....on a sunny day it's a great place to just sit, relax and people watch. \n\nThere are so many great places to eat in the surrounding area that you can easily buy your food and bring it to the park for a nice picnic. My bf and I had bought pizza from Golden Boy's down the street and brought it here to eat.", "author": "Queena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-17", "description": "The best part about hanging out in the city with so much hustle and bustle is being able to see a park FULL of people just relaxing and having fun!  \n\nI love that the people coming here are of all different ages and ethnicities coming together and making the city feel that much more personable.  It also is great that its nearby great eateries where you can pick up food and have a soft spot to sit on the green grass :)", "author": "Mary N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "During the freak weekend that it was in the 80's in the city, we camped out for a picnic with 2393289 other people on this great little spot. \n\nThe sun was shining, the people were lounging and laughing, and the random asian lady was asking for our glass/aluminum bottles. The perfect afternoon.", "author": "nicholas s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "Washington square park to me is the well behaved cousin of Dolores park lol.  Less drinking, less smoking and people are a bit quieter.   Have nothing to do on a sunny day come out here with a beach blanket some food and drag a friend to enjoy a nice day.\n\nWARNING:  Recently they posted signs on each corner of the park with a bunch of rules including in that are NO drinking.   Cops started giving out tickets for drinking at the park so make sure  you bring something to  stash it in or put in a different bottle if you see the cops run like a bandit because they will give you a ticket.  It but  Sucks I'm pretty sure this is because they don't wanted to become like Dolores due to all the tourists that visit north beach.", "author": "Manny R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "Surrounded by the city.\n\nHistoric restaurants. Soaring church. Iconic structures punctuating the skyline.\n\nThey all surround this beautiful and vibrant slice of North Beach. Bring a book. Enjoy some music. You'll be constantly distracted by the views.\n\nConsider it a reminder we live in the best place ever.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "I enjoy movies in the park...even if it's cold at night. I just have to make sure to bring blankets or else I will freeze to death. \n\nI watched Amelie, which for some reason, I can never remember the end / plot. At first, I thought it was going to be annoying to watch a foreign movie since you can't ever take your eyes off the screen or you have to squint to look at the screen. Well, I was wrong. I was totally absorbed and can finally say I like / know what Amelie is about. \n\nThe park isn't too large so even if you sit at the back you can easily see the screen. Also, there's a lot of restaurants nearby in case you need food / bathroom. There's also a free bathroom by the park, but I can get clogged. \n\nIt's hard to find parking so come early!", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "I Love this place...there is generally something for everyone here. Located in the middle of all the cool places in North Beach. Enjoy lunch at one of the many great restaurants around the square, then go for a walk through the park. Plenty of grass on a gentle knoll filled with folks taking in the views and the sun. Yes, proof you can catch some great sun rays in the middle of San Francisco. Columbus Street does literally cut through the park sectioning off a thin slice of the park so cross the street and say hello to the California Golden Bear. Along Columbus you will find a small play ground hidden amongst the trees for children to play. \nYou may be lucky to enjoy the bells ring at Saint Peter & Paul's Cathedral as I did. After wards while making my way across the park to Goorin Bros. there was a Scotsman playing the bagpipes on the sidewalk across the street. I love this place because there is something for almost anyone.", "author": "M...I Love This Place S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "Beautiful park! I have been living in this neighborhood for 15 years. This is the spot I usually go for excercising, walking, or hanging out with my friend. In front of this park, there is gorgeous church. This church services for wedding, serving food for homeless people etc. Because this park is inside the north beach which is we call Italian town, you can get a nice coffee or latte. The only thing I don't like this park is that some people like to smoke cigarettes and weeds there.", "author": "Mei Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-22", "description": "Some might call this the Living Room of North Beach. When Gayle and I walked by yesterday, there were lots of folks lounging around, some sort of Christian performance was going on, and some art on display. I also like watching the folks doing their Tai Chi in the morning and marveling at the view and activity emanating from the Saints Peter and Paul Church across the street. But at the same time, it's a wonderful little island of peace and quiet, as you watch the world go by.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "What's great about this park is the typical cross-section of SF life that it offers, sprawled across its green space.  People reading, walking, talking, throwing things around, arguing.  Fronted by a three-spire church, much like Jackson Square in lovely New Orleans, it's a great urban space.  It's convenient if you like to visit churches...Sts Peter and Paul is right there, St. Francis of Assisi is around the corner.", "author": "Stephen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "If you're writing reviews about north beach you must include Washington Park.. At the end of North Beach's \"Main Street\"- the roughly 6 blocks of Columbus lined with Italian reataurants, cafes, candy stores, fancy liquor stores, etc, sits a park exactly the size of a square city block. In front of the historic church across the street from popular establishments; Mama's, Original Joes, Tony's, and Park Tavern, the park is, always full of people.. People as varied as the languages spoken, from every social standing,  foreign and domestic tourists, yuppies, hipsters, dog walkers, business owners, and vagrants.. You are as likely to see a celebrity as you are to find a bike messenger at lunch, teenager sneaking sips of beer, old ladies chattering on benches, waiters smoking and counting tips, young couples hand in hand.. It is quintessential San Francisco as is everything about North Beach. And unlike any other park within city limits one will find more natives of SF than anywhere else. With all the tourists and visitors in North Beach there is a surprising number of people born and raised here, drawn to this neighborhood that changes at a slower pace than any other neighborhood or district. The park being the place where they all cross paths. On warm days the park is so full of people lounging on blankets that it appears to be a sandy beach during spring break, nearly impossible to find room to squeeze in.  \n      The perfect place to fly a kite, play fetch with Fido, read a romance novel, walk off the wine  before driving home, have a picnic, play chess, doze during your break, watch your kids play, sit with.your crush and hold hands...\n\nAlways one of my favorite city attractions.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-28", "description": "Today I felt like a bad \"mom\" because I left Ruggles' ball at home. Luckily it took other nice people and dogs only moments to start sharing their (toy!) balls and playing with him. He played happily for over an hour with other adorable dogs while I watched happily from a bench and consumed my hot & sour soup from Chef Jia's.\n\nI also love coming to Washington Square Park to tan over the summer, check out festivals and art shows, and drink beer. It's such a great spot and convenient too!!!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Stopped for some dinner...tried the cheeses burger and onion rings.. Very good, service is good ..I recommend and will return soon!", "author": "FRANK S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "Somehow always end up here in the late afternoon, when it's not dark yet, but already too cold to take off my sweater.  It's a nice patch of grass with bus stop along the southwest side.\n\nLots of off-leash dogs here, roaming free and bullying one another according to their \"fight\".  And plenty of people of all ages running or laying around in the grass as well as lovers sitting on benches, holding hands, staring away into the sky and reminiscing about... the last time they were there.\n\nP.S. what an address number for Saints Peter and Paul Church!", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "I admit, I always have a cheap bamboo roll-up in the trunk in case I find myself at a park or the beach and find the need to sit and enjoy the ambiance. This afternoon I ended up at Wash Square Park, tried to enjoy a chapter or 2 of my book but got distracted from people watching. Good people watching, sometimes better than sitting at a cafe. I marveled at the eclectic people that were doing the same:\n\n-Most people had dogs, but one fool insisted on taking his cat on a leash for a walk.  Nice.\n\n-Several shoe-less people here on an extended lunch trying to tan their unkissed feet, pretending to work on their laptops, one near me was even on a conference call. I've done marathon conference calls at non-office locations plenty of times before, so good for him.\n\n-A 1/2 done canvas of a very obviously stoned artist's rendition of Sts.Peter & Paul church.  I didn't think the church was ever or had blue or purple tones with polka dots but  I guess drugs make people see things funny.  Whatever tickles his pickle.\n\n- Old Asian women yelling at each other then breaking for some tree meds (mediatation) then back to yelling at each other.  Thats love.\n\n-Speaking of  meds -  Sure, there's plenty of people there enjoying their \"medical\" mary j.  They're harmless, they just want to befriend everyone.  Tourists are afraid, locals are undaunted.\n\n-No loud kids, just a bunch of jobless Harley riders because they kinda count as big kids.  This group had awful taste in both beer and music but at least they had very nice toys.\n\n-The ticker was seeing a priest (a real priest, not a costume) in really loud, out of character P Diddy shades.  He rolled his pants to his knees, cracked open a beer and was obviously happy be out of the church.  :)  imagine that.  \n\nSo Wash Square Park - a small, lovely area that's not always perfectly clean (so deal with it, it's a public space in a City). It's a neighborhood charmer in it's own right, filled with a nice taste of what makes SF so special. \n\nOver the years, a sunny day will sometimes find us in North Beach trying to find an outdoor seat at a cafe with sun.  Good luck - grab a Greco coffee to go, maybe some gelato if you're in the mood, or a slice of golden boy pizza & head to Wash Park.  Weekends usually are packed with arts/crafts, frisbee throwers, happy children, hapyp dogs, happy people, friendly drunks, & on occasion, random food vendors (nothing like Dolores Park).  If you insist on having lunch in this park, better bring a blanket and some cold ones.  You may be there a while.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Great park to hang out and sunbathe on a pleasant day.  There are dogs all about so be aware of the unfriendly ones (and their similarly nasty owners).", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "Lessons learned at Washington Square after last summer's fantastic outdoor film screenings:\n\n1) Don't carry a Marc Jacobs shopping bag to any showing lest pudgy female \"arthouse\" vegan bicyclists taunt you.\n  a) 8 1/2 is probably the only Fellini they've seen.\n  b) ...Meanies\n\n2) A huge tree branch in your line of sight does not preclude the fact that you need glasses.\n  a) See me squint, see me roar!\n  b) yay!\n\n3) Your bum will hurt after sitting on a protruding root for the duration of a two hour plus film.\n   a) It's worth it...\n   b) Or you can just move spots\n\n4) Sharing your wine with your sitting neighbors is nice.\n    a) Especially when they are adorable aging Chinese women...\n    b) Who don't mind drinking out of your old college mug.\n\nMany props to the SFFS; it's as refreshing as a grass stain on your fanny on a crystal SF summer night.", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-24", "description": "Resting.  What's to say, it's a nice little park to take a rest...if you can avoid the crazies who might randomly pick you to share their neurotic stories.  Welcome to SF.", "author": "Suzanne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-04", "description": "Anyone else notice the naked guy sitting with his legs spread opened, laying on the grass amidst 100 or so park goers on a sunny 4th of July afternoon? He was sitting there for about an hour before the wagon showed up.\n\nThat just cracks me up. \n\nAnyway, the park is home to many weirdos, bums, drug addicts and drunks. It is also one of the most well maintained parks I have ever used and I visit it often.\n\nHundreds of people use this park every week. You can have your lunch here. You can walk your dog here (and let them off leash even though it's not technically allowed but no one cares cuz where else are dogs supposed to run around?). \n\nYou can place soccer, volleyball, Frisbee... whatever you want! You can catch up with news, neighborhood gossip, have a beer, smoke a joint, play fetch with someone else's dog or have a heated political discussion.\n\nYou can also witness (as I have) many fights, violence, screaming children and hawks trying to swoop down on little puppies.\n\nAll-in-all, I love this park. If you are ever around on rainy afternoon, take a second to look around. It look so desolate, with the trees shooting up and the dark clouds rush in in over Russian Hill. There is something very sinister about it... How cool is that?!\n\nPS. Watch out for chicken bones if you do let your dog off leash. I can't tell you how many times I've pulled cooked bones out of dog's mouths.", "author": "Carla P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "This is a terrific place to soak up the sun and take in some classic San Francisco scenery. Coit Tower, Lillie Coit's famous homage to firefighters keeps watch from Telegraph Hill above, down the street the TransAmerica Pyramid gives a salute and across the street hymns spill from Saints Peter and Paul Church, a place that has provided the back drop for many a wedding scene in the movies. \n\nThe park boasts a nice compact playground making it easy to keep an eye on the kiddies. Positioned in the shade, there are no worries about sun heating up the slide in this playground and potentially burning young legs. And while it is certainly convenient to have a public restroom right next to the play structure, this one is disgusting! Use it only in an emergency! \n\nWashington Square Park is also home to the North Beach Jazz Festival, a great way to pass an afternoon in the city! Many classic North Beach eateries are a short walk from this park including North Beach Pizza, the Bocce Cafe and Rose Pistola.", "author": "Kristine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-16", "description": "Loved this park when I lived less than a block away. So did my dog, but it was also her toilet so why wouldn't she love it (FYI steer clear of the grassy patch as you first enter at stockton and union).\n\nI have so many memories of sun tanning, picnicing, jazz fests, crazy capture the flag game full of people all dressed as super heros and ninjas, and watching the Columbus Day Parade and Blue Angels with the mutt and husband, and the Italian guy who plays guitar and rocks out to Smashing Pumpkins \"Killer in Me\":\n\nThe keeeeeee-lar in me is the keeeelar in you.....\n\nI have two not so fun memories:\n\n1. homeless guy that poos in the bushes (and not in the bathrooms several feet away) who leads me to the discovery that my dog in fact will seek out and eat human poo.\n\n2. The weird marshal guy who stands in the corner watching us dog-owners for off-leash behavior and threatening to write tickets. The thing is dude, we leash our dogs as soon as we see you, and we unleash them right away when you leave, so keep up your watch if you need to, we're not gonna listen! Our well-behaved dogs (please ignore item one on this list) deserve a tiny bit of leg stretching.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "Although I've reviewed this place many times (and live just a few blocks away), I needed an hour of quiet away from technology, cars, and noise.  And I found it here, on our first day of September.\n\nSat at one of the few park benches basking in the setting sun and had a lovely and quiet time watching the dogs strut about and me eating my much needed snack and drink.   Found some peace and a bit of heaven in a field of green.  Breathed. Exhaled.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-09", "description": "As a tourist, my favorite thing about Washington Square Park was that it was handy to a few things that I wanted to do, so I could use it as a resting point more than once.  I came here and plunked down on a bench in the shade after the sweaty, ache-inducing trek up to Coit Tower.  Then later I returned after having lunch and a couple of beers nearby.  \n\nAs a park, it's not much more than a grassy open space with trees and benches around the perimeter.  I was lucky enough to find bench spots in the shade both times, because the park was quite active.  This was late last August when the weather was hot, and there were many lovely sunbathers out (always a nice addition to any city park).  I just sat on my bench, reading and people-watching.  A nice little piece of \"urban oasis.\"", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "Magic in a public space, Washington Square Park has something for everyone. That is if you as MR/MS Everyone like to do tai chi in the park, or like to play with your children, or have a picnic. Or if you like to see artists display their art or craft items. Do you like to walk your pet? Cats or dogs seen on leashes here. \n\nIf something is not going on, wait a few minutes, and your fancy will be tickled soon.", "author": "Drake F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "It was such a pleasant day that we picked up sandwiches and came here to have a tiny picnic. \n\nSitting on a bench in the shade of one of the trees on a warm, sunny day was wonderful. Our lunch was excellent and there were lots of people enjoying the sunshine and grass. \n\nThe park is quite popular and full of people lounging, picnicing, playing, or just walking their dogs.", "author": "Julia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "One of San Francisco's amazing features is all of these parks in the middle of seemingly hectic and busy areas in the city.  Washington Square Park is no exception.  It's a great place to grab a seat (either on a green park bench nearby or on the grass) and read a book, relax, or hang out with some friends.  I saw lots of families, friends hanging out, and even a small drum circle for part of the afternoon.  It was a great afternoon escape, and I'll definitely be back.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "Great place to frolic... smell the roses... have dinner ...let the kids burn some energy off! Def worth a visit... stroll on by!", "author": "Ann B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "Nice to walk around...my son had a great time here! Parking is a pain though...nonetheless, I enjoyed this park!", "author": "Jade D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-30", "description": "This place is great. I bring my dog here to poop all the time. Not much of a sun bather or Tai Chi-er, but its funny to watch people lay down on top of my dogs favorite poop spots. \n\nOh and I hope that my dog never eats one of your annoying little yapping rat dogs running off its leash trying to start shit with her. Seriously people. Control your animals.", "author": "Alfredo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-23", "description": "I drooled over my four-pack of mini cupcakes from Kingdom Cake, rushing toward Washington Square Park: the perfect place to eat them per a local's suggestion. The small green space's vibrance momentarily distracted me from dessert. At least four different types of trees dotted the grass: tall, skinny cypresses; others low and flat; some with weeping branches. \n\nThe diversity of vegetation matched the melange of people. One man spun something over his head--either a pizza crust or frisbee-shaped mass of clay--appearing to give another man a lesson. Lonesome brooders pondered life on blankets. A couple girls in nothing but bathing suits took advantage of the sunny day. An earthy type lightly strummed his guitar. Pigeons even mingled. \n\nAnd I, after staring at the gorgeous white spired Saints Peter and Paul Church in the distance, took my first bite of cupcake.", "author": "Bobbin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "Relaxing at its finest after a stroll through North Beach", "author": "Kimmy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "Great place to bring coffee or your lunch. Lots of people on sunny days. A fun place to play catch or fly a kite. Sundays are popular with the art fairs. Bring a blanket-- the grass is always wet.", "author": "Megan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-20", "description": "Best park I have ever been in.  Perfect place for sitting and chilling during nice weather.  I basically spent 2 hours just sitting here with friends and played with puppies.  Puppies just came out of nowhere and ran around us!  Many different types of puppies!!!!  And then there was also a really cute Asian baby that waved at me.  \nBest day of my life.  Ever.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "My perfect day = Washington Square Park + a jug of SPF 50 + a $4.99 bottle of Asti Spumante + food from any of the restaurants nearby.\n\nLe sigh.\n\nOne star off for the possibility of being nailed by a frisbee.", "author": "Eli B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-01", "description": "A really nice park to take in on a walk in the Union Street area.  Great!", "author": "Thomas H S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "Large grassy area for relaxing in the sun.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-03", "description": "As a local I definately love this park.  Great vibe, nice people and on a sunny day you just can't go wrong.\n\nWeekdays end quietly.  There's always a pretty big group of dog-walker folks that let the dogs run and play in the center of the grass.  Don't mind the tourists taking pictures of the church and you'll be fine.  There's always a bunch of homeless people, but they're friendly and don't really bite.\n\nWeekends on a sunny day and this park is AWESEOM!  pretty girls in bikini's, and people in general fill the shit out of it.  Greaaaat vibe.  \n\nEIther time you can most likely bring some beers/wine/champagne without fear of retribution from teh cops.  I've DEFINATELY had some drunken and hilarious moments here...\n\nCatch me here most early evenings playing my guitar!  I'm the slightly less creepy guy who tries to sing.... :)", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "Great place for people watching, hanging out or waiting on friends before going to a bar/restaurant in north beach", "author": "Helen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-31", "description": "Crossed the street to this park after a satisfying meal at Mama's. Joined some of the ladies for a round of Tai Chi, however, they decided to go with some sort of strange dance mix routine instead, mimicking another group not far away. I did my best to keep up; it's a lot harder to sync up than it looks. Also, a dog friendly park as well. It's a small patch, but very warm and welcoming.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-18", "description": "While Washington Square Park is a nice place for adults to do Tai Chi, play with their dogs, or just hang out on a lazy Sunday afternoon after brunch at Park Tavern,  the children's playground is in dire need for total re-construction. All the playground structures such as slides, swings etc. are extremely old, rusty and dirty. The sand is dirty and no one cleans any part of this playground .  Tall trees shade most of the playground area  and the city needs to trim them.  Also, the toilets immediately face the play structures and the entrances to the toilets reek with smells of urine whenever the doors open. This is very unsanitary.\n\nAnother unsafe playground in North Beach is the Joe DiMaggio children's playground . Only the swimming pool was remodeled. One fact regarding the safety of this playground is that the play structure contains arsenic! Yes, this is even posted on the fence .  Do not allow your children on this play structure.This area is widely used by young children afterschool and it's a shame that  the city (Park & Rec) neglects  these two playgrounds while other more affluent neighborhoods have safer and more updated  play structures as well as cleaner playgrounds and facilities for their children.", "author": "May C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-24", "description": "The square is clipped on the corner by Columbus but the loss is defrayed by the presence of artists baring their wares on spindly easels in the blustery winds gripping the ridge of the Nob-Russian Hill saddleback... dogs are bounding after plastic toys amongst the brave sun-chasers stretched amongst the blades of grass... observers sit on benches reading books or perhaps the sly social scene before them... the electronic chimes of Peter and Paul bing out the hours of the day while diners line up for pancakes and bacon nearby, just like Mama used to make.  \n\nWashington indeed is the tranquil nexus of the hither and non of NoBeach, sitting squarely between the yin of nightlife debauchery and the yang of beautiful San Francisco of postcard fame.  We revel in the scenery and being part of the scene, running out our bar tabs and pride with equal abandon.\n\nOur time is now, yesterday and whenever.  Grasp it as you may and enjoy the long hours of day and night at leisure, this Square was meant to be traversed so make the most of your laughter.", "author": "Jim W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-02", "description": "Love this place on a sunny afternoon! Though the pee smell I couldn't seem to escape tainted my experience somewhat...\n\nThere are so many restaurants, delis, and gelaterias around the park - get something to go and dine al fresco! Bring a blanket and join the sun bathers, pot heads, families with dogs and/or babies, and homeless people (maybe that's where the pee smell was coming from...)", "author": "Steph L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-19", "description": "Not the best park in San Francisco, but I was getting tired of the same scenery at Dolores Park and GG Park.\n\nCome here early enough on a warm and/or sunny day with good friends, a bottle (or two, or three) of wine, maybe even some cheese and crackers. It's quite simple and quaint here like that. Then, when you've tanked up on some wine and have a good swivel in your step, satisfy your drunchies with some food from an Italian restaurant or The Stinking Rose.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "This is a really beautiful park, it makes this area just that much more amazing. I wish it were alittle bigger but then again it is frisco...gets really crowded with people lying on the grass and crowding up all of the surrounding benches, beautiful though. Getting some gelato at Naia and coming here was perfect", "author": "Brittainie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Was in SF for a bachelorette party weekend. But during the day, me and 2 other girls decided to explore the city. We met our cab driver from the previous night at the park and people watched. Lots of dogs off the leash and tumbling over each other and lots of people with bean bag toss boards. The church across the street rings their bells every hour so you know what time it is. Its probably a 20 minute walk from union square, through the tunnel and crowded Chinatown but what a fun walk. There are also a lot of fun restaurants nearby. There are also lots of benches and seating everywhere, not too crowded either.", "author": "Mariko B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-14", "description": "This is an absolutely gorgeous part of San Francisco and North Beach. A sunny day and you should just skip work, school, or whatever and lounge with a book. Lots of interesting people make their way through and since there are good places to grab food close by, picnics are common. \n\nThere are some cops on patrol and occasionally break up larger sport matches (\"for the rest of the people\" they claim) but otherwise aren't too much of a nuisance.\n\nGreat views of the Church and plenty of people watching to be had. Make sure to come out!\n\n*note, much smaller and different than Dolores park (in a good way).", "author": "Niket D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-10", "description": "wild parrots, billowing trees, the beauties doing the tai chi dance, laughing children, strangely private for being small, my dog's favorite park, the smell of chocolate in the air, i love this park.\n\ni find myself laying in the grass often with no intention of being there, at times i feel i was transported from my bed to the park with no recollection of how i got there.  i'm drawn to this flat piece of land.  you can spend hours basking in the sun, i awoke recently with my dog on my back and one burned cheek, so bring sunblock.\n\nafter much fun, walk across the street and dine outside.", "author": "Noel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-22", "description": "This place makes me wish I brought my dog.  It's an open field with seating throughout the parameter of the park.  Locals frequently walk their dogs around here and bring their kids to romp around in the grass.  I would suspect that if it was a nice warm day more people would be out hanging around in the grass.", "author": "Lea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "After an interesting (to say the least) week, I needed a day of relaxation to get my mind off of my bruised ego. :/\n\nArmed with snacks, two bottles of classy vino (read: two-buck-chuck), and a buddy, I headed over to Washington Square Park to chill out (read: bitch about my week), people-watch, meet friendly pooches, watch toddlers run around the grass (read: stumble and fall), drink up, and carb out. The weather was just right, and the view of the church, gorgeous. Great way to spend a Sun(ny)day! Or hide under the shade of trees. When it got chilly, we popped into to the cafe across the street. (also so I could use the restroom)\n\nMinus one star for pigeons who can't make up their minds about which side of the park to stay on (please don't poop on me!) and locked up park bathrooms.. My bladder doesn't have weekends off you know! \n\nShout-out to the Scotts! *waves*", "author": "Donna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "What's better than knowing your going to see the Dark Knight... on IMAX?!?!?!  I know, hitting happy hour and Washington Square Park for tall cans of Tecate.  This really is a nice park, very open and it's fun to watch the dogs and the crazy... well not crazy, but ill go with unique people that spend time there.  I talked to a man for a while about politics although I'm not sure he was getting my drift.  \n\nIt's got beautiful sites, what more could you ask for besides another tall can?!?!?", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "After spending the day in the north beach. I went to molinaris and got getalo I decided to lay down here for a hour to relax! it was so nice. it makes me want to move to north beach. there was also a sax playing. I loved laying down there for about a hour on my day off enjoying the city!", "author": "Brian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-14", "description": "Close to my apartment, so my roommates and I stopped by one day and just had a mini-spur-of-the-moment strawberry picnic on the grass. it's a large park, with a lot of people lounging/casually drinking, and bordered by a couple busy streets, so you can car-watch.", "author": "Melody L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "I love this park! I is kitty corner from my brothers apartment. \n\nIn the morning you can watch the cute little Chinese women do their exercises....sometimes you will catch a little old man working out in his white boxers...\n\nThis park is in a great central location - lots of restaurants and shopping very close.  They also have festivals here - art shows....bands and beer!\n\nMy 2 year old nephew can never remember the name of this park so he has declared it \"Stuarts Park\"  (his own name). He tells us that we are going to go and play at Stuarts Park and the family finds it pretty funny.\n\nAlso - there are always cute dogs playing here..fun for people watching on a warm day in the bay...", "author": "Emily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-25", "description": "I love my neighborhood!! And one of the reasons is Washington Square Park. You can sit on a bench or on the grass and look around you: different people from all over the world hangs out here. In the early morning the Chinese practice Tai-Chi, during the day tourist from all over the world come to take picture of the Saints Peter and Paul church, also famous for Monroe/DiMaggio wedding. Locals, Italians, guitar players, capoeira, funny dogs with funnier owners, everything can happen to you.\nYesterday I was sitting there and next to me sat an old man (maybe 70) with his dog and start to talk to me about his life and his experiences in Alaska (he was a fisherman), the conversation was nice and he also took out a joint from his packet of cigarettes saying that that's the only thing that makes him feel better because he is taking antibiotics (???) and he offer me some, too bad it was 9.30 am and it was a little too early for me. But the man was really genuine and the love he has for his dog too. It is always nice to meet real people. We should all spend more time at the park and less online, sigh.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-05", "description": "What a great park to be close to. Love the church as a bookend.\n\nLove taking a blanket a six pack a couple mags and my ipod and just chill out or throw the ball around with the boys.\n\nMy only problems are the grass gets chewed up by the summer festivals and they have to rope off large parts. Couple that with the idiots who think the park is big enough to play volleyball and hit everyone with the balls after a killshot and it make it kind of tight.", "author": "Howie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-28", "description": "Urban iditarod.\nSantacon.\nNorth Beach Jazz Fest.\nThese all take place in Washington Square, or at least for a moment....makes for a great day.  Great for people watching..\nSanta raided a wedding across the street.  It was awesome.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-04", "description": "This park is the cornerstone of the neighborhood.  It's a true community park, where you come to get to know your neighbors.  Well, your dog-walkin' neighbors, anyway.  I know most of the dog-owners in the neighborhood because of this park.  Because of this park, people know me and speak to me on the street.  I LOVE THAT.  Well, actually, they know my dogs and speak to me.\n\nEarly-early mornings (when it's still dark), you run into the multiple elderly chinese people who are going for their morning stroll.  Plain old early mornings, you see them doing the Tai Chi.  Serious health nuts, these guys, they'll outlive us all.  One stroller looks at me, looks at my dog, then gives me a thumbs up, which is nice.\n\nIn the middle of the day in nice weather, the park is filled with sunbathers, volleyball players, kids, etc.  On the benches you have various hippies playing the guitar and drunks drinking out of brown bags. Sometimes the drunks are naked.  Sometimes they scream incoherently.  Often the parrots are screeching in the trees.\n\nIn the evening, everyone gets off work and brings their dogs to the park and we all stand around chatting about our dogs and things going on around the neighborhood.  Like I said, this park is a real community center and I love it.\n\nMinus one star for the hedges that line part of the park.  They house rats and human feces.  The city needs to get rid of the hedges.  No one uses hedges anymore in park planning because of the aforementioned nastiness.  The hedges only provide cover for those who want to poop here.  At least dog owners clean up!! Well, most of them do, at any rate.\n\nAlthough I do get a chuckle out of the idea of some high-rolling matron from Orinda eating at a window table in DiMaggio's and looking out the window to see what my husband recently witnessed: a man pull his pants down, take a crap in the hedges, then walk over to the garbage can (still with his pants down) and start rummaging around inside.  What a meal-capper.   Or meal CRAPPER.  Oh, I slay me.\n\nYou will notice that I only take away one star for the hedges.  The drunks, naked and screaming, do not merit taking away  a star. They're fine.  Just get rid of those hedges.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "Dogs running around, surrounded by tons of bars and restaurants.  Nice spot to chill at.  Not the biggest park and you see buildings and cars from all angles but it is what it is.", "author": "Duke B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "Great little park that isn't so much a park, but a glorified front lawn for the church that resides adjacent to it. No escape from the cars, the traffic, or the homeless.\n\nBut nevertheless, I had a great time this afternoon in Washington Square park after work unexpectedly ended early. With a good book, some sun glasses and a cup of gelato, I spend a good portion of my afternoon in the park. There are individuals sunbathing, workers on lunch break with sandwiches from molinari, people setting up booths for the Northbeach Jazz Festival this weekend, and the homeless who sell their papers for a bit of spare change or just relax in the sunshine also.\n\nI was serenaded with a very nice rendition of \"My Girl\" and gave the man 50 cents, which was all the change in my purse (anyone who knows me knows this is an AMAZING feat as I never give money to the homeless and I must have been in a great mood in order to do this).\n\nNot the greatest park, but I can never give lower than 4 stars to a park. It's just not something you do. Cozy and comfortable, I only wish it were bigger.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-05", "description": "it's a classic, enough said. Lucky to live next door.", "author": "Nate E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-07", "description": "Washington Square Park is North Beach's expansive living room.  Simple and cozy like worn velvet couches; the grass shows wear and tear at the most popular sitting spots.  Relatively flat, substantial amount of shady space, but that is the only shady thing about it.  From sun worshipers to baby boomers, this park is inhabited by many species of humans.\n\nTo alliterate the similarities between WSP and Dolores park, I would have to list brews, babies, books, bums, balls, and barking.  \n\nHit up a Saturday night movie in the park or grab a meal, coffee, or some gelato across the street and cozy up on a blanket for a variety of activities (or non-activity) and let the people-watching begin...just don't forget the stunna shades.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "A popular park for a Sunday afternoon but one my North Beach neighborhood comes to enjoy for good reason.  From kids, to old Chinese people, football or Frisbee throwers and magicians from Denver wearing a purple hat (true story) it runs the gamut for people watching in a city where it's already pretty varied.  I like to grab an espresso and a Pellegrino nearby and take a half-nap on the grass.", "author": "Taylor O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "A great park to sit and chat. Need a break after a large meal? Stop by and hang out! Don't go changin'.", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-10", "description": "This park is the meeting point in my hood for my group of friends. No matter if it it a night out on the town, casual drinks, dinner, a walk, or the farmers market we always meet at the park. The park has a lot to offer other than just a central location for my group of friends. On our occasional warm sunny days in SF it is a great plays to lay out and people watch. By people watch, I mean watch the chinese people do their weird exercises, frat boys toss bean bags and hipsters drink red stripes.", "author": "Kathleen E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-23", "description": "One sunny day, I was sitting on the grass in the park, watching some dogs play.  I was minding my own business when, all of a sudden, a disgusting, diseased, filthy pigeon WALKED ON MY HAND!  I yelled so loud that the little boy sitting near me started to cry.  People stared.  I ran home to sanitize my hand with scalding water and antibacterial soap.\n\nThat being said, it is a beautiful, gorgeous park.  I love to come here and people-watch after work, or grab a coffee in the evening an relax on one of the benches.", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-07", "description": "This is where you come to do your Tai Chi in the morning if you're over 65 and Chinese (apparently).  Roll by at 7-8AMish - It's cool to see...\n\nI dig this place - it seems to always get sun, its small and yet big enough for everybody.  Got benches and fairly soft grass.  It's sort of enclosed by trees and feels protected from busy Columbus which borders it to the West.  \n\nIt's a good spot to read the paper and wait for your table at Mama's to open up (you gotta grease the man with the list a bit, though.)\n\nThis is also where all the North Beach neighborhood 'events' go down - Jazz Fest, the Festival etc.\n\nIt loses one star for the sketchy homeless guys (who i've never had a problem with, but could potentially be troublesome I guess) and occasional dog poo problems.  Also, not really enough room to fully stretch out and throw the football around or have a picnic - a little too popular for all that.\n\nLittle known fact: DiMaggio & Dorothy Arnold were actually married elsewhere (City Hall I believe), but took their wedding photo in front of St. Pete & Paul.\n\nI'm going to have to go back and watch that Dirty Harry movie with the sniper again.  Although it might always be in the back of my mind from then on...\n\nNorf Bizzle fo' shizzle and that's the dizzle.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "This is one of my favorite parks in the city.  It's not hilly or lush or particularly beautiful, but it's smack dab in the middle of North Beach, and despite the busyness of its neighborhood, it's pretty peaceful.\n\nThis is a particularly good spot to go when you've got guests in town and just want to relax.  They'll be OK with it because you're still in touristy North Beach, and you'll be OK with it because it will give you that many more minutes to steel yourself to the horror--the horror!--of having to wait in line at the cable-car turnaround or walk through Fisherman's Wharf.\n\nIt's also a nice place to read and people watch.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "I love this park, it is just off center to the heart of Lil Italy but the center for me. It is a great place to chill, usually warm and always lovely. In moments you can be at restaurants, cafe's, galleries, shopping to bars and more. It really is a great location and always filled with people, dogs and a bench for you to sit at.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-24", "description": "I lived three blocks away from this park when I was young. I used to sit on the grass and watch wedding processions leave the church, wistfully dreaming of the day I could dress like a princess ( I was six, I thought that's what it was all about).\n\n\nA couple years ago I went to a screening of  \"The Maltese Falcon\" in the park, thus beggining my fetish for noir. There is some great art here on the weekends.\n\nThis park is awesome.", "author": "Trouble B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "A park full of regulars...you see the same dogs, the same homeless people, the same Tai Chi practice-ers, the same poets, the same yuppies, the same weirdos all in one park together. \nPerfect for some volleyball, some doggie exercise, some sunbathing, some relaxing, some people-watching.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "Though it's only one city block, it's a refreshing oasis in the middle of the city.  On those warm sunny days, it reminds you that there truly is no place like San Francisco.  On top of beautiful weather and surroundings, you'll see people from all walks of life hanging out.  Observe.....\n\n1.  Marina-types:  Easy to spot.  The women are usually lounging in skirts with Ugg boots (even though it's 90 degrees) and the guys will have their collars popped.  Baller.\n2.  Music Playing Hippies:  Another easy group to spot.  Usually sit around a few people playing guitar and rocking out to some obscure bluegrass song.  Shirts optional on the guys, dreadlocks a necessity.  May also be seen playing hacky-sack when not rocking out on the axe.\n3.  Homeless People:  I love when people get all uppity about homeless people ruining the park.  Sure they smell bad, but if you really think about it, this is their home.  So, we're kind of like guests at their place.  Try to be a little more polite....or at least not such a blatant asshole.\n4.  Hipsters:  Can their clothes be any tighter?  And what's the deal with the blazer?  It's sunny and 90 degrees outside!\n\nSo there you have it.  Washington Square Park.  Gorgeous surroundings, urban oasis, and fantastic people watching.", "author": "Norm U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "The only reason I give this park 4 stars instead of 5 is because the bathroom was really disgusting...other than that we had a great day at the park. Its so nice to get a cup of coffee and a blanket and just veg out in the grass. This park is great for everyone, close to restaurants so you can eat your lunch there and relax, lay in the grass, theres even a playground for the kids. Overall, its very nice. Avoid the restrooms though because they were very dirty, Hit up a restaurant or store for your potty needs, lol.", "author": "Maya L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-13", "description": "This is one of the best parks in the city.  My most favorite part of this park experience is getting to know all the crazy people who share in it with you.  \n\nLike the guy who walks around in the leather suit, pseudo-sheepishly telling you that he is, in fact, Santana's brother, and then offers to sing Santana songs to you for a nominal fee.  \n\nThen there is the lady with turret's syndrome who walks around the perimeter of the park screaming obscenities.  \n\nThen there is the little Chinese lady who just wants in on your game of whatever; could be soccer, volleyball, football...whatever.  She just wants in.  \n\nAnd then there is the vaudeville guy, dressed to the nines, who, when given your name, makes perverted songs about you and whoever you're sharing your blanket with.  \n\nThen there is the guy who walks around with the \"Tom Selek for Mayor\" t-shirt who says that he just can't trust his friends anymore since they turned the FBI on him.  Oh and he ALWAYS carries a football but never throws it.  \n\nAwesome.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-04", "description": "People watching.\nFrisbee throwing.\nLazy sunbathing.\nDog interaction.\n\nI can see the park from my window, and I still never know in advance what is going on down there during the weekend.  Two weeks ago I walk outside to see some Ferrari fest with over 20 of these sports cars crammed onto our lovely park's grass.  There is an art show every Saturday for those in the area.  Great place for a tourist to drink some coffee and get a taste of what our neighborhood is about.\n\n\nUpdate 11-?-06:\nOk, so there isn't an art show every Saturday.  But there is one at least once a month on Saturday and Sunday.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-13", "description": "I love Washington Square Park. I played here as a kid, i did acid here as a teen and I will come here as on old man to sit on the benches.\n\nI liked it better before they put the trees around the statue though.", "author": "Chris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-04", "description": "Adam Duritz wrote August and Everything After (the song, not the Album) here. Enough said.\n\nOh and I once fell asleep drunk here when I was 17. Bet none of you knew that.", "author": "Lee M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "This park is people-watching perfected: kids, dogs, hopelessly homeless bums, all kinds of tourists, neighborhood vets, crazy old ladies, more dogs, people playing lawn games, Falun Gong zombies, old shirtless men, suntanning beauties, hippie balladeers, etc.\n\nAll this under a darting flock of pigeons and the tolling bell of the cathedral across the street.", "author": "Dustin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-07", "description": "I like people watching but I don't like being harassed.  Every time I come here I get harassed without fail. This place could be so much better and has been so much better.  Sad.", "author": "Roger H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-27", "description": "I love its location, sun exposure, wide lawn space and plentiful benches.  It's the easiest park in the city to have an impromptu picnic supplied by all the delis, bakeries, cafes and wine shops nearby.  It's also home of the boisterous North Beach Festival in the summertime, which can become too Alpha Beta, Psi Chi, etc. for my taste.  But the rest of the time, I'm content on my lawn blanket in the sun, listening to the bells of the Cathedral.", "author": "M A N I K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-09", "description": "Top park in the city. \nSo much fun for one and all!\nGood on a first date, a little wine, little cheese, a little smoochin', a little lovin'.\n\nAll good people!", "author": "D. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-03", "description": "Oh park, I love you. I got to watch 8 1/2 during the Film Night in the park series  here while drinking smuggled whiskey, I've been on first dates here, I've been in grass fights with people here, you're really the best. Thank's for being so close to my house and full of shady trees.\n\nI wish you weren't losing all that grass in the middle though, it's sort of like a bald spot. Also, major props for the kids who filled up a kiddie pool with water when it was really hot a few weeks ago. I think you should all be my future ex boyfriend.", "author": "Maren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-10", "description": "With the North Beach view and beautiful church as a backdrop, Washington Square Park is one of my favorite places in the city. My ideal day would consist of a sandwich from La Spiaggia, a Mimosa supply, the rare 80 degree weather, and sunshine. Top it off with good company and big sunglasses, and you've got an event! They often feature events and artists- a few weeks ago we enjoyed our fruit gelato while sunbathing, followed by viewing local San Francisco artwork. It was a great sunny day :)", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-29", "description": "I love my neighborhood park...mostly to pass through while walking to Mama's, the post office, or on a jog. This past weekend there was a movie night in the park which was really lovely...good times with friends, what can beat that? \n\nYou have to catch the tai chi lessons happening in the mornings, it's a riot and also oddly interesting and makes you want to join in...but I wouldn't, I think those women might hurt you...though they're like 4'2\"....whatever, anyway...\n\nLoses 1 star for some of the \"interesting\" people that are usually hanging around during the day.", "author": "Diane S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-23", "description": "my favorite is riding the 30 at 6am, passing by the locals doing tai chi\n\ninspiring", "author": "tiff f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-20", "description": "Grab a cup of coffee nearby and go sit in the grass on a sunny day.  It's such a wonderful park!", "author": "Mason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-24", "description": "Cool park, walking distance to a lot of places in North Beach, nice playground set too.  Within walking distance to a lot of good places to eat and drink, and a stop on the Santacon pub crawl.  A good spot for dodgeball apparently...", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-22", "description": "A Benjamin Franklin statue in the park, but why is it named after George Washington.  Hmmm... I'll let you all ponder that for a second.  Ok, second's up!  Did you know that It was a cemetery before it became a park?  Interesting, huh? The park was designed by William Eddy and built in 1850.  \n\nLocated in the middle of North Beach with the beautiful Sts. Peter & Paul church and Coit Tower in view, surrounded by coffee shops, restaurants and bars (2 for 1 beer special at Columbus Cafe), spend a beautiful day on the bench shaded by poplar and evergreen trees -- a perfect way to people watch.  Friendly crowd, well-behaved dogs, clean green grassy area, and hot half-naked men sweating in the sun getting their tan on playing volleyball and throwing the football around.  \n\nI love this park.  I've only been living in North Beach for less than a month, but I've already spent a lot of my free time at the park.  Once a friend and I chillded at a a bench one sunny afternoon with a bottle of Hoogarden in a brown paper bag.  Another time, my roomies and I brought sandwiches to the park and enjoyed rich conversations while we watched all the good-looking men walk by.  Last Sunday, friends and I played a little game of baseball.  I hit two people and 1 dog with the ball when I was at-bat before we finally decided that playing in the park wasn't a good idea especially when it's crowded.  Even though our bat and ball was the Giants baseball set for kids, I guess it's still a bit scary to see a ball coming towards you while relaxing on the grass or walking around.  If you see an orange ball coming towards you, don't be afraid... the ball is really, really soft and it won't hurt you... I promise.  \n\nIf you ever want to see me on a nice sunny afternoon, look for me at the park with a beer in one hand and a cup of gelato from Naia in the other hand...", "author": "Celeste M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "Grab a sandwich at Molinari's, a beer at Coit Liqour then head to Washington Square to people watch and enjoy your lunch. Then finish off with gelato at Gelato Classico and you've had a great time in North Beach!", "author": "Thel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "very laid back park, great views of the city, russian and nob hill....great for just pulling up a blanket and relaxing on the grass!", "author": "Phillip J F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-08", "description": "not a bad place...\n\nwalked through here when I'm running around lil italy. nothing like getting some gelato ...\nhanging out in the park taking in the shine of the sun, \nthe smell of green \nand the beat of the city. \n\nand then head back down the street for more good food;. \nnothing quite like it....all in a stones throw from the park.", "author": "John-Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-06", "description": "so COOL. ever see Dirty Harry ? this is the park where psycho Scorpio scopes out a gay black guy through his rifle sights. I've been frightened to sit here ever since. but it's such a pretty park, and Sts. Peter & Paul across the way is so historical (boyfriend forever reminds me that Joltin' Joe DiMaggio married his first wife in this Church.) thank you, boyfriend, but I know my trivial history. I was frickin born in this city just like you", "author": "Prima D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "You feel as though all is right with the world as you lounge on the grass on a sunny day..", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "On a nice summer's day, this is a great place to hang out and people watch in the city.", "author": "Dave D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "My favorite park in the entire city.there are tons of great places to sit and watch the birds fly from corner to corner of the park.  The bathrooms are kinda gross, but that's with any park.  Grab some gellato or a sandwich and sit and enjoy!", "author": "Robin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-24", "description": "I love going here on a weekend when the weather is nice. It's a great place to people watch and have a sandwich and a beer. Went here for a movie in the park last summer and that rocked as well. Plus last time we were there a bum foretold us of the next big one (date passed so no worries) so we decided to make the church our meeting place when said quake happens.", "author": "Stephen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-18", "description": "This is the best park for people watching. And it will usually have nicer weather than say Golden Gate Park or something. Right in all the action of North Beach and full of activity I guarantee you will not be bored here. And if you are just take a walk to any of the cute cafes across the street.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-16", "description": "Fun for people watching and less dog poo than you'd think. At least I have yet to step in any doggie pies in the 3 years I've been coming here. Its a great place on a sunny day to eat a cup of gelato from the nearby Naia or Gelato Classico after brunch at Mama's, Cafe Divine, or WashBag. \nThere are always people playing volleyball, football, or throwing around softballs and Frisbees for you to watch and you can't forget about the requisite bums that accost you for food and/or cigarettes. The newest thing I've encountered is the little old Chinese lady hovering over me waiting for my empty coke can. Annoying. \nThe only other annoying factor happens to be \"that\" guy that comes up to you in the park thinking that because you are alone you need company. Does the fact that I am reading AND have an iPod stuck in my ears give you even the slightest clue that maybe I don't want to be bothered? Ahhh yes....I knew there was a disconnect somewhere. \nIf you don't mind the occasional pestering passer by then this park really can't be beat. Grab a coffee and a pannini and enjoy the weather and the free reality show.", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "sun. wine. picnic. bubbles. perfect sunday!", "author": "Anne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-26", "description": "People & dog watching at its finest. When the sun falls on this city, bask in it, & if you live nearby, do it at this park!", "author": "Melisser E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-16", "description": "3 stars for being in close proximity to Liguria Bakery, 2 stars for public events in the park like the movies they play in summer (last year, Fellini's 8 1/2).", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "I once saw this old Chinese man peeing in the bushes. Seemed out of place in such a picturesque park. Great people watching.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "so, while the petite bourgeoisie may be extending their coverage of the north end of the city past the marina green, padding (or cablecarring) down from russian hill and wandering up from the Embarcadero, you'll find the traditional north beach denizens on display in Washington Square Park (WSP) as well.   and by traditional, i mean the odd writers, artists, poets, and hippie bums.  WSP is mostly waspy on a bright, sunny day, and the same assholes who you would normally find playing beiruit (beer-pong, for the uninitiated) often times set up a kiddie pool, or some sort of odd mix between lawn bowling and horseshoes.  hate to reference colombia again, but they had a similar game there, except you were throwing into a pit filled with gunpowder.  maybe that's why i liked it there.  lots of explosions.  \n\nanyway, while looking around the park, you'll likely exclaim, \"damn, that's a lot of white people,\" but they are white people of different varieties, so it's more or less ok.  yes, there are the preppy assholes whose baseball caps have frayed along the brims, and who you can identify by their tribal tattoos and tramp stamps, readying themselves for a night of accidental procreation and VD passage by drinking beer in the sun.  but, at the same time there are others, with tattoos more tasteful and artistic, with dogs, with children, with books, frisbees, and soccer balls.  when it's sunny, this is where the neighborhood comes to pass away a lazy afternoon, doing whatever it is that they do.  you can find blond spa denizens in bikinis, dreadlocked hippies, impromptu four piece string bands, and completely insane shelter-challenged individuals engaging you in conversation, but oddly not asking for money.\n\nit's a sort of people's park, back when that wasn't just somewhere homeless people slept, and the people watching is fantastic.  still pales in comparison to dolores park, but what doesn't?  it is the reason i like north beach, in terms of how the space feels...", "author": "matt w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-07", "description": "Where I went the first time I found out San Francisco flips the bird to open container law... Thank you, San Francisco, for allowing me to sit in a park full of hippies and homeless drunk off my ass and not having to hide my booze in a paper bag or nalgene bottle.", "author": "Valerie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-14", "description": "if there is one thing i miss from the NB days, it is this crazy little park.  i've been serenaded by weirdos with guitars, attacked by puppies, sunburned and then frozen by the fog rolling in, read for hours/days, probably smacked with a soccer or volley ball a few times, probably been accosted by a mad pigeon or two, watched many an old-chinese-people-stretching-in-rings and parading in the early morn, heard many a conversation between homeless duos (and singles), recouperated my bored, anxious mind gazing at others and daydreaming about their differently bored or anxious minds, probably accumulated a lifetime of bad phone karma from forwarding naked pictures in someones lost cell phone to their entry for 'mom', and drank many a coffee and bubble tea.\n\nI was going to give 4 stars since i've been overcrowded out of the park and chased off by foul smelling, tanning hairy beasts (usually men, sometimes women), but maybe that's why i want to give it 5, too.  It's close, tension draws me back.  This is a great park to have in your neighborhood.  (and movie nights in the summer are a fun thing that many don't know about.)", "author": "Today Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "I love this park.  Tiny, very friendly, and extremely relaxing when you would like to nap on the grass under the sun.  You never know who you'll see.", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "wonderful place to sit in a sunny spot and people watch.  there's abit of everything to see - crazies and picniking hipsters and old asian ladies, lots of dogs and vigilant owners chasing them with plastic baggies.  Make a holiday of it and eat breakfast at Mama's first.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-04", "description": "While visiting San Fran recently my husband and I spent a couple leisurely hours digesting our huge Italian lunch here.  I've never seen so many weirdos in my life (and I live in DC)-- and weirdos from all different walks of life. But that said, it was pretty entertaining to spectate at all of the randomness going on around us, except for what I am sure was a group of drug dealers turning some major profits over the course of the afternoon. I would NOT recommend children here, considering dogs are running wild, drugs are being bought and sold but mainly smoked, and lots of homeless lurk.", "author": "Nina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-23", "description": "Wonderful park to lay out in the sun on a warm weekend day overlooking the beautiful St Peter and Paul's Church. Every summer, the North Beach Jazz festival is also held here and the North Beach Street fair also hosts the vendors in the surrounding park area.", "author": "Yan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-04", "description": "Great place to lie in the grass and chill out in the sun on a Saturday or Sunday afternoon.  While my boyfriend and I were there we saw a couple getting married - great place for it!  And great food and drinks are a stone's throw away.", "author": "nicole h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-13", "description": "This is a community park, there's never a dull moment here. The park is surrounded by tons of different restaurants that you can get some take out at & mosy on over to a nice spot in the sun (Molinari's, Divine Cafe, Melt). There's always a guitar strumming, puppies having their first walk on a leash, some fierce volleyball going on, some tossing of the old pig skin, friends having a laff... it's as perfect as it gets on a warm sunny day. Mix in some locals, some out of town visitors, folks from Chinatown & Telegraph hill and you have the Washington Square Park community.", "author": "flo t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-01", "description": "I know the vaudeville guy Lauren S. is talkign about, he came and visited me at the Rogue Brewery.  So not many outsiders to North Beach see the park in the morning, but the elderly Chinese come to do their Tai Chi.  At first I was put off by the whole activitiy, but now I've come to accept it as something special and really nice.  I just wish they didn't look at me so meanly when I have my dog.  On that note, the park is where my dog goes to the bathroom, most dogs in the neighborhood come to the park to go poo as well.  Don't sit on the outside perimeter of the park, these are most likely to be the pee and poo spots.  Watch out at night, it gets sketchy.  I love this place and see it as my haven.", "author": "Lindsay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-15", "description": "My friendly neighborhood park, and thank goodness for it.  People-watching, sun, volleyball...I have absolutely zero complaints about it.  Far fewer unleashed dogs than Dolores Park (only a good thing, in my opinion) and far less sketchy than Buena Vista or even GGP.  Come, sit, relax.  You just can't go wrong.", "author": "Sheila W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-12", "description": "Super place for a lunch date with someone who doesn't mind sitting on the grass. I wouldn't try it out on someone \"new\", but if you've got a tried-and-true beau or an easy-going boo, I suggest: Summertime (July-October), daytime, sandwiches at Molinari (I highly recommend anything with sopresatta, fresh morzarella, and sundried tomatoes), a nice spot in the grass where you can be a vicarious pet owner through other people's dogs, then end your lunch date with some gelatto (i like Naia). Do this, and your work week will become 85.6% more pleasurable.", "author": "kay v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-25", "description": "too many dogs, too close to a church.  but not a bad place to recover after breakfast at Mamas on wahington square (best breakfast in town)", "author": "kiki b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-20", "description": "this is one of the best places to spend a sunny weekend day. pick up a bomber at coit liquor and a north beach special sandwich from molinari's and hang here for the day. great people watching...", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "I am a big fan of this park, slightly due to the fact that it's a block away from the bf's apartment and right in front of the bus stop i use to get home. The only negative is that 1) it's in the middle of north beach, ie party city, so towards the end of the summer movie in the park there are tons of drunk people wandering around, yelling. and 2) it's so small that you can never really escape in this park. No matter where you go, there is the street, tons of cars parked on it and most likely a line of cars honking on Columbus Street. More reasons why I like it though? it's always crowded but not TOO crowded meaning you're not alone and creeped out but you can usually always find a good spot to camp out. We usually go there when we want to eat lunch outside (RIP Palermos) Otherwise its a good place to get some beers or a bottle of Belvedere in our case and hang out, get drunk then stumble home. FYI, there are always little asian women looking for cans and they can sometimes get annoying. We had a \"party\" here once complete with mini swimming pool and horseshoes and the women lurked around us the entire time. They even stood in our talking circles for some reason. Kind of odd. They were waiting to take our cans but geez, wait until we're done you know? That was the only downfall I could think of...well, that and those cars.", "author": "Sarah I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-04", "description": "great place to relax and watch awesome tai chi.", "author": "James B."}
