{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Seemingly one of the last burgers + fries for under $10.\n\nBeen going to this spot for 5+ years and the quality has not changed for the worse, which is pleasantly surprising!\n\nKeep doing what you guys are doing!", "author": "Dennis A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-14", "description": "Went here twice recently (both Oct 2018) and got food poisoning / diarrhea the second time. I know, so unlucky. I hate giving bad reviews, especially to places that are neighborhood institutions, so soon after moving to the mission. But they haven't even claimed their yelp page yet, after so many years of being in business, so I can only conclude they don't really care. \n\nThe food sure tasted good but I can't overlook the diarrhea I'm now dealing with which has kept me up half the night. To me it signals that something isn't quite right with their food preparation methods.\n\nI ordered the 1/4 lb junior burger with fries and a banana milkshake. Price wasn't bad at 12.75. Pay cash! \n\nCome here at your peril! You may be ripped off with weird credit card stuff, have your car towed or spend half the night sitting on the crapper.", "author": "Zoe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "High 3 stars. We walk by Whiz Burgers all the time and have always been curious - are they any good? How do they stay in business? (They always seem empty)\n\nTurns out they have pretty good burgers. Still unclear how they are still around, but turns out they are pretty historic and used to be a legit drive through (turned parking lot. Maybe that's how they stay afloat nowadays). \n\nOn top of the decent burger, there's also no wait, it's cheap, and they have a great banana shake. It's worth a stop by here to try it out!\n\nTHE FOOD:\n\n* Garlic Fries ($4.95) - 2.5 stars\nThe fries, while thick cut (which I like), were too dry. Also, this smelled strongly of garlic, but when we opened it, it looked like plain fries. Where was the garlic? We could taste it, but not as strongly as when the fries are covered with freshly chopped garlic. \n\n* Fresh Banana Shake ($4.70) - 4 stars\nUsually I avoid banana in any smoothie I get as I feel it's overpowering, but here it tasted great! Made fresh, nice thick texture.\n\n* Whiz Burger ($8.75) - 3.5 stars\nGood! This is the only burger that comes on a French Roll, which while more classy, makes for a drier/crunchier bread. Otherwise the ingredients are fresh, and they are nicely balanced. For the patty, I asked for \"medium rare\" and I think the guy chuckled.. not sure if they do that, and mine was pretty much a medium.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "I tried to place for the first time this past weekend and loved it. \n\nMind you I wouldn't say their burgers, shakes or fries are going to blow your mind. \n\nBUT it is good food. \n\nWaffle fries are obviously a must and they were perfectly cooked when I got them. I really wish they would add more picnic tables in the surrounding parking lot area and stay open late. Those two things with a combination of throwing up some string lights(this is key for millennials let's be honest) annnnnnd this place would be booming with late night business! There food is good, but I bet I would say it's incredible with a sufficient amount of alcohol in my system. Just some thoughts.", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Hello good hole in the wall old fashioned burger spot to eat at! I am not a sf local and I want to say based on the volume of customers it's more of a local place. You have the option to eat in your Car or at the benches .... bring wipes or napkins.  Ordered for my husband and kids ! I loveeee the criss cut fries ! You can taste the banana in the milkshake ! Not overpowering not to thick or runny ! We all ordered a bacon cheeseburger , nice big slices of bacon. You are able to actually smell\nYour food being prepared! So when they called out for our food it was straight from the grill nice and hot. I personally don't mind the location being that it's not a commercialized burger joint. Just bring wipes !", "author": "Adriana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-29", "description": "I had the combo meal here and it was okay. For about $7, and an additional 75 cents for cheese, this puts this meal at around the fast food price. But even with that, the food didn't really do any better.\n\nThe burger itself felt really boring, like something I would have gotten if I did a BBQ get together at home. The fries didn't taste that much better either, and they charge for every little thing (like ranch).\n\nOverall, will probably be a pass in the future.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "Came here by myself about a month ago.. perfect.  Nice day, sat outside, great burger and he even let me use the employee only restroom\n\nI bring my family since I enjoyed it last time and it was a whole different ball game.  First, I guess it's called \"the whiz\" for a reason... it smells like piss everywhere.  There are a lot of homeless in the area, I get it... but they need to hose the area down very, very often if that be the case because it's difficult to eat when you want to vomit from the smell.\n\nSecondly, they screwed up our order.  So I go back to get the water and fries they missed and he says \"he didn't charge me for the fries\"... okay, fine... so I hand him my credit card and he says all credit card charges are minimum $7...really??  I just spent $40 bucks on food!  my wife was livid.  Needless to say, I'll stick with In and Out Burgers... MUCH cheaper and MUCH better and friendlier customer service.", "author": "Bruno V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Just popped into this SF institution for the first time in about 30 years and I find myself thinking \"Why did I wait so long to come back?\"  Awesome burgers my gal got a single with american cheese, I got a double with swiss....They were delicious, and the prices were super fair for what we got.  We also got some onion rings to share and while they were great I gotta say I expected a larger portion for $4.75.\nSafe part of the Mission, private parking lot, what's not to love?\nWe're coming back soon Whiz Burgers.....Thanks much!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "4 stars for being practical(!) in a neighborhood where lines often exceed 30 minutes for what should be basic grub. So glad I didn't have to pine away-- ruminating over the nature of  hunger and the whims of human desire--to get this burger.\n\n*also, currently on keto, and when I asked for \"a bacon burger with everything but the bun\"--I got a solid protein style burger with plenty of lettuce, tomato, etc. \n\nA bit rough around the edges, but they deliver the goods.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "5 stars for the food, minus one star for the obvious.\nWith an outdoor eating area right in the Mission, yeah it's gonna be a little dirty.\nBut the burgers are damn good! Reminds me a bit of 5 Guys. Ingredients are fresh and delicious.\nParking usually isn't a problem, as they have their own lot around the stand.\nI have only come here for the burgers, fries, and onion rings, so I can't vouch for anything else, but when I want a burger in the Mission and don't feel like a huge Zeitgeist burger, Whiz is the place! \nOrder your food and bring it to the bar or eat it in your car if the eating area is that much of an issue for you. The food tastes the same no matter where you eat it :) \nThe guys working there are nice and make really good food. \nJust close your eyes and eat a really good cheeseburger!", "author": "Kat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "Good, greasy and inexpensive burgers.  I suggest calling in your order ahead of time.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "Food:\n\nPhillie cheese steak - this is what I usually get when I'm here.  It's not bad as an option in the neighborhood for lunch.  Pretty standard fair though.\n\nSeasoned fries - this is probably a must with any burger or cheese steak.  Waffle cut.   A little hit or miss on how over cooked they are.\n\nRoot beer float - these are good for sure.  Usually it's overflowing so kind of hard to transport on a rainy day.\n\nService: just ok.  \n\nAmbiance: well it's pretty hole in the wall but definitely has that drive in feeling.  Though the area itself does have a lot of homeless people.\n\nOverall:  I'd go back since it's an option in the area for lunch but pretty average.", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "Solid burgers! I really enjoyed the Whiz which is differentiated by having avocado slices and being wrapped in a lettuce bun.  Flavor was really good and much better than you would expect from a small stand with fast burgers.  While the prices are a little bit on the high side for a fast burger (probably about double In'N'Out pricing) it comes with the territory - specifically the territory of a small place without the purchasing power of a chain, renting in San Francisco.\n\nThe primary reason I give it 3* rather than 4 though is because I felt extremely lethargic after eating the burger.  That leaves me feeling the food is really not that fresh even if it is tasty.  The milkshakes and fries both lacked a depth of flavor which also indicates that they are not using fresh ingredients.\n\nI would definitely stop in if I was hungry in the area or if it is late night.  Would be a great late night drunk stop given the awesome flavor.  Late you won't mind the lethargy.  Might even help you....zzzzzzz", "author": "Tarek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "I moved back into the neighborhood after being gone for 20 years. A lot has changed, but this place stayed the same. Delicious as always", "author": "Vern S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "I drive miles to get this turkey burger! Best meal deals in the city, friendly workers, and great food. I've never been disappointed by any food that I've bought here. They are my favorite burger spot in the city. I'm taking away a star because one time I ordered on yelp drove over and they were out of turkey patties, make sure u check to ensure they have your food by calling. Other than that, I love whiz burgers.", "author": "Brandy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-12", "description": "I really want to like whiz... the burgers are like a whataburger (from the south) so that's cool for Cali... everything else on the menu is ehhh basic. This place would be a 4 star if most items were half the price. I got a chicken sandwich & philly cheese to try new items from menu last 2x I went here, thoroughly disappointed. \n\nLet's just be real, their location and parking lot is the only reason they are in business. Ok maaaaybe their history, but even historical spots close (see joes cable car on mission, R.I.P. with that food poisoning they gave me in its later years)", "author": "John O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Good sized tasty burgers.  Fries are good also.  Onion rings not worth it.  I got the Jr. burger which seems like the size of a whopper.   Next time will try the whiz burger", "author": "Dkac C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "The burger and onion rings that I had were so good. They were perfectly cooked and built. The bun fit the patty just right, and there was just the right amount of tomatoes and lettuce. I did find it odd that the assumed condiment was mustard. Luckily, I enjoy mustard on my burger. But people have pretty aggressive feelings about mustard and I could see someone being pretty disappointed if this amazing burger came to them with a large amount of mustard on it.\n\nI want to give this place five stars so badly, but it was pretty dirty. And I know it's a burger shack in the mission, but I don't know if that's an excuse for dead bugs on the counter, in the window, and on the menu. I am glad I came and I will be back, hopefully I can update this review.", "author": "Isabella G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Classic greasy burgers and fries. Go while you still can. You know this joint is being turned into condos sometime in the next few years. It's in evitable. And it will be sad, because this is a classic spot with old-school benches for seating. Next time I'm back I have to try their milkshake", "author": "David A R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "This is exactly what you think it is: an old-school, no-nonsense, mom and pop burger drive-in joint. The food is good, not great. The prices are appropriate for a non-chain operation. It mainly has its vibe going for it. I stop by if I'm in the neighborhood. \n\nI hope these places stay in business. They're just doing their own thing.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "Solid burgers with fresh ingredients.\n\nI also got the chili cheese fries, which were more chili than fries, but not bad.\n\nGlad this place is in the mission, great when you're in the mood for an old-fashioned burger, and they have an extensive menu that I'm curious to try.", "author": "Jade M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Love this place. They make a damn decent burger, one of the few good ones in the mission. I think some places like garahe best them yet, but it's certainly the best choice in the area. Way better than wezburger. \nIt's got a really fun old timey vibe, how it's an outdoor shack instead of a sit down place. \nI'm digging it but I wish their burgers with a bit messier juicer", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Ordered a mushroom burger, onion rings, espresso shake. Order totalled $17.34! I could have eaten at Hodad's for that so the food better be worth it, right? Fell short in flavor, but the food was cooked perfectly and fresh. Not sure I will want to visit here again, as it was just too expensive for a guy who's been spoiled by Nation's, Junkyard, Yak's and Hodad's for the same price. The outdoor seating leaves little to be desired with the homeless always nearby, begging, but there was a parking lot on the property which makes this place easy to get in/out of as this place does not have a drive thru as the name may otherwise insinuate.", "author": "Bill R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "First ate there in the 60's. It was great then and still is now. Enjoyed many a meal back then through high school and then while working @17th st & Potrero. Tried to eat there as often as I can since then. So I can say I've enjoyed great burgers,fries and shakes now for over 50 years. It's truly the last of the old time burger stands.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "For what it is it's so amazing.\nDrive-in style burger with all the fixings, greasy fries, and banana milk shake that is out of this freakin world. \nPlus you get to experience the drama of S Van Ness in all its glory. People running red lights, pretentious bike riders cursing at cars... And crazy people coming up to you giving lectures about how the military is all effed up and by the way can I have some change?\nFreakin glorious", "author": "Gillian K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-03", "description": "Not bad, but it's not Uncle Boys. \n\nSimple burgers are sometimes the best. Fries were good but I appreciate more salt/seasoning. The shake was to die for haha.\n\nThis is what we call a heart attack waiting to happen. A delicious one.", "author": "Alyssa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-11", "description": "Good food and really good service! Just don't call in to order the phone does not work well, i called in about 5 times, and they will mess up your order the regular day to day guy cashiers are really nice people i always leave them a good tip since they always get my order right. But today i called in and there was a young asian man who messed up on the order i called in and instead of giving me what i ordered he gave me something else and when i had told him thats not what i ordered he replied in a rude way with attitude instead of explaining what went wrong. so instead of waiting after i got unnecessary attitude  by the cashier i just left. I am a cashier as well and i understand there will be mistakes like that but thats no excuse to talk to a customer especially when i have been a frequent customer for 18 years i live down the street and after that incident i will not be coming back.", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "This place rocks! Best fries in the city!!!\n\nAs a Dutch person I am used to REALLY yummy\nFrench fries and other deep fried foods you can get everywhere at snackbars that are on every corner of every street (almost :p)\n\nBut the fries here are really yummy!! I mostly just come here to get the fries and the milkshake to take home :-) \n\nIf you like milkshakes this is the place To be!!! Fresh banana!!", "author": "Styn V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "Ok. I'd read that a prominent SF chef loves this place.\n\nI thought, if it's good enough for him, it's good enough for me.\n\nYes, it does have an overall decrepit look about it.\n\nThere's no denying that this joint could use some serious TLC.\n\nBut, we can all use a little, or a lot, of TLC, can't we?\n\nI saw that they have a perfect health score.  I found this reassuring.\n\nSo, crumbling facade aside, I focused on the food.  Meaning...the burger.\n\nHow surprised was I (very) when I took my first bite of the Whiz Burger.  It was fresh, it was tasty.  Simple & a little messy.  That's good.  A lot of previous reviewers have called it classic, & that's exactly what it is...\n\nA classic burger.\n\nIt's very reminiscent of an old school backyard burger from a prior era.  \n\nA burger that Edith would have made for Archie Bunker.\n\nIf it's good enough for Archie Bunker...\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "A very recognizable burger place on Van Ness--you definitely can't miss it as you drive by!\n\nTried this place out of curiosity, and I would say the food here is average. The food items seem cheap at first, but they charge you extra for cheese (huh?) and other items. In general the burgers are soft and just the right size, which kind of reminds me of Shake Shack from the east coast.\n\nIn general, I would say this is a pretty average burger joint--it looks much more exciting than the food it actually serves. Feel free to come by to try it once, but I doubt I will go back since there are plenty of food places in SF.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "I'm born and raised in The City, and I finally got to stop by for a burger, fries and a shake. Fries were great, as was the Mango Shake, burger was pretty damn good too ! Nice people working the counter too ! Hubby had a steak sandwich that was \"just okay\", (but he does get a little picky about steak hence the four star review vs. a five star review).", "author": "Lee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "ORDER THE BANANA SHAKE. It's made with fresh bananas and is one of the most delicious beverages in the Bay Area. Everything here is fine, if unexceptional. Order to go - unsavory characters like to loiter at the seating area.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "this is a heaven on earth. i mostly eat really healthy food, but every now and then i NEED my whiz.", "author": "Zelda S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-08", "description": ":( A bit of a disappointment.\nI stopped by to pick up 2 shakes. I chose chocolate & mango. The mango was decent but the chocolate was horrible. The wait was very long- in the time I waited I could have made the shake myself :/ . The chocolate shake tasted like it was made with Hershey's syrup :(:(:(.\nThe prices were very reasonable.\nI would come again to try the banana shake & burger & fries.\nIt would be really nice if they had an outside heat lamp for their customers.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "I love stepping back into history of this walk-up, drive-in looking place out of the 1950s. (Actually, it was built in 1950).   Living in SF for years, I stumbled upon this place once walking home from work, and enjoy visiting it whenever I'm back in the city.  \n\nOh, I almost forgot to mention the food -  typical greasy drive-in style burgers.   You're going mostly for the atmosphere, and get pleasantly surprised by the burgers and shakes.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "This place is amazing. Old school feel to it. Best burger in the mission, milk shakes to!", "author": "Mickey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Hell yeah! Burger had tons of flavor. Chili cheese fries were average, but still damn good!", "author": "Adidas W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "Walked home the wrong way and couldn't help but stop by this retro joint!\n\nIt looked promising, and the wait indicated that the food was fresh. The chicken wings were piping hot, crunchy, and packed with flavor. The fries bummed me out though. I ate two and threw the rest away. \n\nSolid strawberry milkshake as well. I'll come back for the shake, but prefer korean chicken wings over these dry ones.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Awesome burger been going here since I was a kid always cheers me up! The burger is built to perfection and has never let me down", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "I love this place!  The milkshakes are simply amazing, especially the coffee flavor.  For the price point they make a really good veggie burger and fries too.  Definitely give this one a go!", "author": "Paul V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Fast becoming my guilty pleasure...\n\nDriven by here for years, always grabbed my attention. Could it possibly be true? A fantastic, old school burger in SF? \n\nWhiz Burger, fries, Banana shake. Why, yes! Delicious!! The way the cheese melts around the bacon, sliced down the middle, wrapped like a gift! And those fries! As for the shake, I'm not really into bananas. Until now.\n\nI can feel the pounds packing on. And I just don't care.", "author": "Elizabeth Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-23", "description": "I think one of the previous reviews hit the nail on the head \"greasy, hot, fresh, disgusting, and perfect.\"\n\nWhiz Burger doesn't pretend to be anything it's not. Once you accept that, you will be happy. \n\nThis place is a hangover go-to. Garlic fries are greasy, soggy, mega garlicky, and delicious. Burgers are OK. Their shakes are legit. I do not recommend the cheese steak.", "author": "Marz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Three words: Fresh Banana Shake. It's amazing!!! I had my first one when I had terrible morning sickness and the only thing that even remotely sounded appealing was a milkshake. I'm now 8 months pregnant, and even after drinking several of these shakes over the months, I still love them! Not too thick but still creamy, with real banana blended in. Absolutely delicious -- definitely the best shake in town!", "author": "D. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Look at SF's top 10 burger places and Whiz is one of them! Don't let the looks put you off! The moment you open the brown bag with fries and you take a look at the perfectly crisped potato sticks, your heart starts beating faster! But it's only after you take the first bite into your burger that you let your guards fully down and admit to yourself that it's love at first bite! \nI had the quarter pound burger with added cheese and mushrooms and it was the best I'd had in loooong! Not a bit greasy as some others described it! It was really good, but hey! Don't expect a gourmet experience here! Am sure it's gonna be my go-to burger place when the craving hits again. Two thumbs up to Whiz!", "author": "Alek K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Great burgers  ! Love the fries they give you a big portion!!!  Wonderful service always get order right , parking lot easy parking for the mission that a super plus. I've been coming here for years . I would Recommend to all enjoy !", "author": "Mario G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Whiz Burger: It's just the best.\n\nThey have a veggie burger! You can add avocado!\n\nThe seasoned (waffle) fries are delicious. And the root beer float is a tall foamy classic at the lowest price in town.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Support small local businesses! :-)\nMy boyfriend and I were looking for a quick burger place to go to and came across Whiz Burgers on Yelp. We got good vibes all around from the place, the employee who took our order, as well as the other customers eating. I ordered the junior burger combo with garlic fries & my boyfriend ordered the bacon burger combo with crisscut fries. It was all super good! And they definitely overhand the fries, which was rad. The ranch was tasty (we're really picky about our ranch haha).", "author": "Mika C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-17", "description": "I normally get the Whiz Burgers with fries and a banana shake. Always delicious and the service is prompt. This location is also good for people watching.\n\nUnfortunately on my most recent visit I paid using my credit card only to find later that an extra $10 had been added to the tip despite tipping fairly in my opinion for the above meal. Won't be going back anytime soon unless I know I have cash on hand.", "author": "Shelaya L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "Easily one of my favorite burger places in the city. \nWhiz burger with crosscut fries and a shake\nNever have had a bad experience with this place and always happy&full after one of their burgers", "author": "Mandy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "This is a counter, drive in style burger joint that has a super retro feel like you'd see on a cross country road trip.\n\nI had a fries craving and had always wanted to check this place out. They don't have late night hours unfortunately (and surprisingly) though. \n\nThe large fries cost about $3 and I did have to wait awhile, but the the fries were totally worth the wait. The came out piping hot and were crispy on the outside and soft on the inside -- so, just right! \n\nI can't say anything for the burgers or other menu items, but I did notice they did have a Chicken Teriyaki dish which seems odd and out of place, but a guy in front of me did order that. He sat at the counter and ate the whole thing. There's also a couple of picnic tables to sit at too.\n\nThey have a small parking lot too which is convenient.\n\nThis seems like a great local spot with a lot of regulars.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "philly cheese steak!!!!!!!!! So good. Omg. I expected it to be sub-par but honestly it was so good. Props", "author": "Tessa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "3rd Gener SF-er.  All of us thru the generations ate here.  It's okay.  As like others, the fries are meh...I never order them.  It's OG.  My mom ate here in the 60's while still a kid.  I'm glad to see it's still up and running.  Kudos!", "author": "LennyLi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "OMG! Best burger ever! Definitely go for the whiz burger. The entire sandwich was exceptional. The meat, avocado, bacon, all was perfect. Freshness score was a 5 as well. Visiting family, we are from San Diego, and this will be a must return. Do not be fooled by the looks of the place, or neighborhood. They had a 92 on the health inspection. Loved it, the end.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "Gee whiz.\n\nHow is this place 1) still in business in an era of gentrification and 2) still serving burgers for less than $5.\n\nPerhaps because the friendly staff is serving freshly grilled chicken, lettuce, tomato, pickles and onions on a sesame bun that are quite good. \n\nNo question about that.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "Finally made it to this place and it was glorious!  I know it's a burger joint but I have no power over my order if there are hotdogs or corn dogs on the menu...and that's what I got.  They slice the dog in half and serve it on a hoagie-ish bun which was great, sat flat, no spills, awesomely spicy.  Corn dog was properly fried and delicious.  Solid milkshake...the place is open air in a so-so part of town so keep an eye out for panhandlers.  Don't expect anything fancy from this place other than good food.  I'm surprised people are complaining about the neighborhood or the service, seriously, what did you expect??", "author": "Yadira A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "This place is freakin' great, and I'm not sure why the other reviews are so polarized. (Although, the one about the car getting towed from the parking lot is pretty funny). However, you can't hold that against them in a review about food. Plus, there are a number of other snarky comments related to the neighborhood and it's \"up-and-coming\" appearance, but whatever.\n\nThis is pretty much the ultimate burger drive in. It has hilarious (and original decor), a cool retro feel. The whiz burger is pretty much where it's at. Bacon, avocado, burger, all on a french roll, sliced at a diagonal through the center. Mmmm, delicious. Fries are good too. I suspect the other items are good too, but I can't really vouch for them. We did try the banana shake, which was delicious and tasted like it had a whole banana blended up in there (which it probably did!). \n\nCheck this place out the next time you've had one beer too many at a bar down the street. You won't regret it.", "author": "Brent W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Love this place,   Food is always good,  basic burgers, fries n shake....   Old style drive in.   Good value for SF eats.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "The place screams SKETCHY with a capital \"SK\", but the food itself isn't so bad and the prices sure are cheap. My boyfriend is a good ol' American guy who loves his red meat, and his craving for burgers and other greasy, unhealthy American goodies brought us here one balmy summer night.\n\nI went with the chicken wings and fries combo because fried meat and potatoes is one of the greatest food combinations ever invented. The wings were tender but tiny, so if you're hungry do not go for just 7, which I thought would be enough. The batter was nice and salty, but lacked other seasoning so came across as kind of bland. \n\nMy boyfriend got the Whiz Burger, which comes with avocado. It was deeeeelicious and actually had me wishing I'd ordered that instead. He also got a banana shake. I'm not really into shakes and the banana shake had too much artificial banana flavoring for my liking, but it probably wouldn't be so bad for fans of banana-flavored dairy.\n\nIt's probably best not to come here alone unless you're 6.5\" and built like a rock. However, the sketchy-looking people generally don't bother you. They might leer at you for a while, but then they usually find some other moving object to leer at.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "This is it - one of the best burgers I have had ever! Great Milkshakes too! A true blast from the past - don;t let the neighbourhood or the looks of this place fool you. This place is the real deal for great food! I have gone to fancy places and the burgers do not measure up to this place.\nPlus the prices are retro too!", "author": "Grant H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-08", "description": "what i ordered... whiz burger\n\ntypical hamburger patties and fillings served in a faux sourdough bread\n\n\nambiance... bad (it looks like one of 'em structure in the ol' west movies)\nservice... so-so (a stare and a quick question but a single word of gratitude at the end)\ncost... $ (fair)", "author": "Gors P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "100 on the heath test, you know it's good.....but for real, great old school style drive in burgers...get drunk down the block then come here to get right", "author": "Danny and Christina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-03", "description": "Owner was a jerk and so were his employees over a ranch.... owner was also eating while he was making food. Odd.", "author": "Jav V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Want a good bacon cheeseburger, seasoned fries and a shake? This place nails it. I've had friends venture away from this recommendation and be disappointed, but my answer is don't stray from my advice.  Killer espresso malt shake!", "author": "S.B. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "A shining beacon of hope on the promenade of despair that is South Van Ness. If you want cheap and tasty burgers, dogs, fries, shakes and other morsels of Americana, this is your spot. A combo with fries and a drink is under $8, and only takes a few minutes to cook up. You can easily fill your stomach for under a ten-spot.\n\nNote that this isn't a dine-in kind of place. It's a walkup window with a few picnic benches around. The view isn't great, but the eats are very good.\n\nThe junior burger was substantial enough for me, but don't let stop you from gorging yourself on a full-sized burg or a chili dog or what have you. They have veggie options, a turkey burger, and fish burger too. But obviously the truly health conscious should walk on by.\n\nMe and the Dining Companion opted for onion rings and cross-cut fries instead of the regular old befrenched fries. You can do it too. Be the change you want to see in your potato world.\n\nObligatory Title Pun: Don't WHIZ past this gem.\n\nMenu Readability: Check out the handpainted sign inside!\n\nNeed to mention: They have a perfect health score. And they accept cards.\n\nWhat this place teaches me about myself: I really shouldn't paraphrase Gandhi in this context.", "author": "Vivek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-26", "description": "Sketch-y.  truly a unique \"dining\" experience.  Have you ever been to a drive up movie theater?  Well I haven't either, but this place surely reminds me of what that would be like.  The building is obviously run-down and the insides are left to the imagination with posters and menus posted all over the windowed store front so you can't see inside.  \n\nThe food was good, much to my surprise. Don't get me wrong, as I was happy to have paid for and eaten good food, but you don't expect what you end up getting dished out.  Whiz Burger is definitely a \"classic\" burger with mustard served on top of fresh shredded lettuce and a thin meat patty.  the flavors are bold and reminiscent of something you'd eat at a carnival.  A good carnival.\n\nMake sure to try out the criss-cut fries as they were perfectly crispy and deliciously hot.  Bottom line - I'd go back.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Cool & simpale place! Really nice if you are not looking gor something spaciel, just good fast good :)", "author": "Dana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "This place is my jam. It is a Mission and San Francisco institution. When I first lived in San Francisco 15 years ago, this was a frequent lunch and dinner spot, being 2 blocks from home and 5 blocks from work. Now that I've been back in San Francisco for a year, I love every chance I get to cheat and pig out with the burger spot every In n' Out pretends to be. It's a simple burger stand, with parking, and outdoor picnic tables and a counter. It's old school, and it's glorious.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Yummy fries and a decent burger- satisfied my craving! Next time- definitely getting the banana shake and criss cut fries!", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Used to live near this place, and let me tell you, their Burgers are one of the most delicious burgers i ate in years. Been eating since 1995 and they still provide the right amount of fries and juicy burgers. definitely recommend this place for anyone dying to eat a burger and are close to the location.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Love this old school drive in. The burgers and fries are delicious. The service and employees are fast and nice. Never close please.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "Whiz Burgers was just fine--quick food, scalding-hot french fries, and tables outside to sit. \n\nProbably wouldn't have this as a frequent destination, but it did the trick on a hot Sunday afternoon.\n\nThe BLT was legit, and the fries, like I said, are made with lava and flavor. Maybe let them sit for a tic and let them cool, word to the wise.\n\nThe good: pretty diverse menu (tuna melt? Ok). \nThe bad: it's the Mission, so be prepared to protect your food.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "Do you want a burger? Of course you do. Classic, simple, burgers made at a joint that doesn't presume to be more than the greasy corner burger shack it is. The shakes and malts are terrific, and pair well with the burger when you're really feeling like punishing your heart and rewarding your taste buds!", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "This review is for the only thing I've ever ordered from here. The #7 with criss-cut fries. The veggie burger is actually a high(er) quality than what most hole in the wall places would serve. I think it's made by Wildwood? I really wish Vin Diesel over @ Jay's Cheesesteak http://www.yelp.com/biz/jays-cheesesteak-san-francisco would use this burger. The price is ok but could be cheaper. \n\nI've been coming here for years, off & on, everything is pretty much the same as I remember except they take credit cards now. I always call ahead since they take forever to make your order. Besides, who actually eats here instead of taking it to-go?", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-04", "description": "Waffle fries are bomb\n$2 corn dog... yes!\nBanana shake is awesome\nBurgers are OK, but what the heck, it's convenient", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-06", "description": "greasy, hot, fresh, disgusting, and perfect. \n\nwhiz burger is my favorite self indulgent lunch. mmmm. it's so bad, but so so good. \n\nI hope this place is around forever.", "author": "Cat G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "this is what i miss about the old san francisco......not frisco.....good food, great prices, good service.", "author": "M R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "There's a church right in front of the drive in, in case you want to pray for your sin of gluttony that you will commit after eating one of these burgers.", "author": "Sean D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "Decent burger, but geez a place famous for burgers and they have an entire chinese menu? The guy at the register didn't seem to understand me until I spelled my order out for him. Boo. I'll get a burger anywhere else next time", "author": "Nic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "Whiz Burger could use a bit of a fix me up. Their retro bar stools are now missing their cushioned tops and the place looks in dire need of a paint job. I like to think it's part of their charm. Either way, it is SO GOOD. There has been countless overhyped burger joints opening. Granted they're all amazing but sometimes you just want a greasy cheeseburger with no fuss and that isn't $15.\n\nLook no further on the menu - the Whiz Burger is all you need. It's everything a classic burger should be. The bacon gives it just enough delicious fattiness (flavor!!), onions, lettuce, avocado, pickles, mustard and mayo completes it.\n\nThey have all the typical milkshake flavors but try their banana milkshake. It's sweet and just the right thick consistency.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "+4 for being an ol' skool burger and fries *joint.* So ol' skool - you have to write your order down *on paper* and give it to the guy. That's ol-timey, man!\n\n+4 for having very tasty fries. I have dreams of these fries. No joke.", "author": "Mark S. I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Great burgers, small line a little wait but definitely satisfied.", "author": "Casper D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-14", "description": "Such slow service! I don't understand why these two guys, the only guys who look like they're running the joint on a Tuesday night, look bored when there are five customers waiting out in the cold for their order! One customer cancelled their order since it took forever, and another had been waiting for at least 20 minutes.\n\nOne more star because the burger and fries tasted good. They were legit burgers, but I could probably find that elsewhere and with way better service.", "author": "Kris I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "I've been here a few times with friends and overall the experiences have been \"meh\". San Francisco has a ton of great eateries, so there's a lot of competition out there, even for a classic institution. On the other hand, there aren't a lot of burger places in the Mission, which may be how Whiz Burgers has stayed in business.\n\nThe yays:\nprices are low\nhours are convenient\nselection is good\nhot greasy food generally hits the spot\n\nThe nays:\nfood is fair, with a couple notably bad dishes: chicken teriyaki, tuna melt\ntables are in very bad shape\nstools are near breaking point\nI always feel like crap after eating here \n\nDespite my love of fries and shakes, and the convenience of Whiz Burgers, I can't see any reason to go back.", "author": "Kely G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "We really liked Whiz Burger, it was great.   \n\nWe got 2 burger burgers with cheese, 1 seasoned fries (criss cut), onion rings, a soda, and a strawberry shake. The criss cut fries and onion rings were nothing to write home about. The burgers were delish. Great bun (perfect bun to meat/topping ration). Simple burger set up: mayo, lettuce, pickle, tomato, onion. Burger: 1/2 inch thick, well seasoned. The best way I can describe them is that they are similar to In-and-Out but better, and more homemade. The strawberry shake was also very good.  \n\nWe'll be back :)  \n\nThey had a health score of 100, awesome!", "author": "Lani N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "You can keep your $20 artisan gourmet Valencia St burgers. Whiz Burger has been here since 1955 for a reason, awesome burgers fries and shakes all around!!", "author": "O. S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-07", "description": "I live couple blocks away  and went here about 5 times and never got my order right. I confront the   cashier and he is just like you are out of luck. Whiz Burger has terrible customer service and the food is below In-n-out quality. DONT BOTHER with their nasty wet (yes, like water wet) french fries.   I wish someone would come take over who knows how to cook correctly.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "I was born in the mission and I have always known the place is there but never tried them before. \n\nI like a good old fashion burger but I really got suckered for the Philly cheesesteak. Well the pregnant wife wanted one. We ordered it with lettuce and tomato but it comes with grilled onions, bell peppers, mayo and cheese. I recommend put those veggies although it sounds weird. \n\nMy only complaint of this place is retarded, knowing the element of the neighborhood, is the wooden tables and benches. I'm not complaining about the bird poop, I'm complaining that the tables haven't been changed since the earthquake of '89. \n\nWell overall it's a good place.", "author": "Vicente C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "Good ole fashioned drive up.  Good quality food.   Possibly the best corn dog in town too.", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-17", "description": "Although the burger does the trick, what I fall hard for are:\n\n1. The sign\n2. The cheesesteak\n3. Waffle fries\n4. Tater tots\n5. Chocolate malted banana milkshake", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "This place what actually good. I had the Philly Cheese Steak. The meat was pretty tasty & made perfect down to the delicious local swiss cheese. Really yummy I also shared some of the chicken wings; they were deeeeply fried and I say deeeeply because I do mean it. Tasty but oily. The bf had a chicken burger which he said taste \"meeeeh\" so i took one star off.", "author": "Cassie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-06", "description": "Man oh man oh man oh man. I love this place! \n\nI was searching for a burger place in SF to call my own. I searched far and wide, but the burgers were either too expensive or too bland...or both! And then I stumbled upon this place.\n\nWhat a pleasant surprise. In an overpriced city such as San Francisco it's nice to find a cheap place to eat with a whole lot of character. Their specialty is their Whiz Burger and boy is it special. They make a mighty fine banana shake as well. \n\nSee ya there?", "author": "Murphy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Still the same after all these years, great burgers and greasy fries. It is good that some things don't change.", "author": "John E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "It's a grease bin, and an excellent one! It doesn't try to be something it isn't. The food is cooked and served fresh. The orders are always accurate. Love it.", "author": "Kelli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "I've been coming here since I was a kid, burgers are great, and their banana milkshakes are to die for. Love mom & pop shops in The City Of Kings", "author": "Frisco K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-30", "description": "Burger: just meh.\nBanana milkshake: it brings all the boys to the yard.\nFries: number one.\nCorn dog: number one (how can you mess this up anyways?).\n\nMinus half a star for the crooked bench table top and low quality corn syrup ketchup.", "author": "Evan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-15", "description": "This place's burgers taste exactly like McDonald's burgers. Plus, I couldn't hear anything the guy at the window was saying.\n\nOn the bright side, they didn't mess up my burger. And the prices totally make sense.", "author": "Casey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Well, 3.5 stars.\n\nI love novelty 50's style burger places! On my way to church one day I took a different route and drove by this little place and it immediately caught my eye. After church I convinced a friend to come with me to try this place out.\n\nI ordered the fish sandwich meal and my friend ordered the philly cheesesteak. Both were delicious. Honestly I ate here a while ago, so I can't remember specifics, but I will definitely come back. Just wish it wasn't in a seedy part of the neighborhood, but it was satisfying :)", "author": "Becky K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-20", "description": "The worst food I've had in a long time. If I hadn't been desperately hungry, I would have just thrown it in the trash. I got a tuna melt that was literally just white bread, tuna, and American cheese. I don't understand how a restaurant can be so terrible and stay in business.", "author": "Jakob H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-11", "description": "Two is pushing it and only for longevity do I give it such high marks. Go visit this relic. \n\nThe beef was flavorless and the fries were just horriable oh and the coke was flat and the bun was dry.  The plus side; I got to eat outside in front of the restaurant in the parking lot with the pigeons. \n\nI won't be back except maybe to take a picture of the old school sign.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "This place is solid, I like that is unchanged and run down but still serves good food and a great banana shake! Some reviewers say it's in a seedie neighborhood, but as I look around all I see are hipsters and Lyft drivers. Places like this will be gone soon so come try a shake!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-07", "description": "I want to love this place.  But I think that the oil in the fryers has been there since 1955. And I swear that they deep fried my veggie burger in it. Soft serve ice cream is okay. I don't want then to go all hipster. But just step it up a tad in the fresh dept.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Pretty freakin' awesome. Look at me I'm yelping. Mediocre burgers and fries. Lots of crack and prost's. There's a camp area behind the store. Clarence rents his tent out by the hour. He says he's just down on his luck.", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "Dearest Whiz Burger,\nI miss you so much. I used to order seasoned fries, a banana milkshake and a veggie burger from here whenever my dad was feelin' like a burger and fries. Holy mother of YES. I just miss this place so much. I basically grew up eating their burgers all the time. This was my in-n-out before in-n-out in Daly City came into existence. This place is legit, but i wouldn't recommend actually eating there. It's rather unsanitary. Take it to go. I'd give it one more star if the seats weren't full of bird shit.", "author": "Kai S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "Oh Whiz, you gritty little Mission delight. I completely agree with the overall 3.5 star rating. There is just something so quintessential San Franciscan about this corner dive. While you will never see a tourist stop here (bless the heavens), I also don't think we will ever see Guy Fieri or Anthony Bourdain featuring the joint, but I adore it.\n\nI ordered my junior burger meal deal, aka #1, and sat down to watch the show. A random sampling of who might appear - a pimp, the homeless, the hipsters, the business person, but somehow it all works. It's loud, the buses stop out front, it's grimy, but damn it makes me smile every time. It sings San Francisco! \n\nI enjoy the burgers, the chicken sandwich and the turkey burgers. The fries are thick cut and cooked perfectly. It's not the best burger around, but there is just something delightful about the whole experience. The burger reminds me of grilling out at my parents' house on a hot summer day. The burger is a little more done than I like, the bun is not completely fresh, the shredded lettuce is a tad watery, but I swear to you it is so damn good! The mustard and mayo combines and creates this creamy, tangy sauce that clings to the lettuce shreds and adds a certain dimension of flavor. \n\nI would never dream of taking an out-of-towner here, but if you live or work in the city then I believe it is a must-experience experience! It just works and it's just so good! Check it out, fo' sho'.", "author": "Shannon K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-20", "description": "Got the corn dog, it was average but I devoured it because I was starving. However, the wait was super long for a corn dog! The crowd was mixed, family members, young chic couples, but also very colorful and sketch figures. Would love to see the picnic tables, counters, and the windows cleaned or revamped and painted or something.", "author": "Nancy Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-06", "description": "Props for being here since 1955!\n\nI got the burger burger, which I was told was basically the Whiz burger without avocado and bacon.  The meat was almost like highschool lunch burger mystery meat, on par with McDonalds.  Luckily it came with pickles and enough mustard to mask the taste.  \n\nI stopped by while walking my dog (there aren't many places that you can grab food with a dog, well a large dog).  I wanted to sit outside and eat, but seriously there were too many homeless people and my dog was scared.\n\nI heard their shakes are amazing- too bad I'm lactose intolerant. \n\nCool that it's still around, but run down, and almost gross", "author": "Skye W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-01", "description": "Im only giving it two stars because the food was decent.\n\nOtherwise my experience was kind of shitty.\n\nThe guy at the register took my order for a number 1, which includes fries and a drink, and when my food came up he didn't supply the drink. I asked for the drink and he told me that I didnt get a drink because I added cheese to my burger and it is an extra charge.\n\nSo I had to sit there and argue his logic with him for several minutes after he tried to send me off without giving me what I had paid for.\n\nIt was annoying and disappointing. I don't think that they should have tried to swindle me out of the drink that I paid for and then treat me like I was stupid all explain to them how wrong they were for trying to swindle me.\n\nGive me what I pay for. That is all I ask.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-18", "description": "This is an old school Hamburger stand that's been there since 1955. It's one of those quirky throwbacks that you run into from time to time.\n\nI've eaten here a few times over the last ten years just for the novelty of it, and you should to, but to be honest the burgers are only average.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-20", "description": "Not to much for the whiz burger, but boy do they give you enough fries. Since this was my first time there I give it another try. I will ask the locals what to get. Says its been there a long time and it looked it, but looks are deceiving.", "author": "Biggg J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-25", "description": "I was stomping up Van Ness from the Dog Patch towards Mission, and I saw this diner and decided to do lunch.  i wasn't quite sure what to expect, since this place appears to have been largely unchanged from the '50's (you can't fake the patina!), except for the San Francisco prices of course.\nI got a turkey burger with garlic fries and although I was sour they stuck me an extra $2.50 to upgrade to the garlic fries, when they came out I saw that not only was it a much larger order but they had actually fried the garlic and put it on the fries.  The turkey burger was prime quality... meat and juicy with a nice bouncy bun and crisp lettuce.  The garlic fries pretty much guaranteed that nobody wanted to get within 3 feet of me for the next few hours, which made walking through the crowded Mission that much easier.  And it was nice to sit out on the old wooden table in the lovely SF weather and gnaw on a burger.\nPro tip: get the banana shake if you get the garlic fries to mitigate the destruction.  Unless you're worried about vampires of course.\n\nAll in all I'd say this is a fun place to go once (or twice if you have a craving), but there's little to put it on your short list.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "First, the place is really cool because of location and architecture.  Granted it is a drive in but there aren't many other unique places like this in the city.\n\nSecond, the burger burger is freaking delicious.  Sesame bun toasted right, fresh vegetables, good burger meat and cooked right.\n\nThird, the fries have a taste of fries.  Other places burn the fries and they are just crisped shells of what a fry should be.  It also comes in a little bag so you don't lose them all over the place.  \n\nFourth, it's affordable.  If you try burger urge in the haight, the same meal of fries, burger, and beverage is $18.  It's $8 here.", "author": "E M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-03", "description": "Whiz Burger is a solid old school burger stand.  It is not in the best neighborhood.  I am a big guy, and I can take care of myself, but I don't invite danger.  My spider sense tingles every time I go to this place as soon as I turn my back to the street and step up to the window to order.  This is not an eat-in place.  The outdoor stools and picnic tables, forget it.  This is an eat it in your car or at home far away from here kind of place.\n\nLocation aside, their bacon double is FANTASTIC.  Their fries are solid.  Shakes are good enough.\n\nIt is worth a try, but go at sun up and take it home with you.", "author": "Shaun H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "The mango ice cream cone is unbeatable. It's gigantic, inexpensive, and tastes fabulous.\nIf you're afraid of the The Mission you are not only behind the times, but you shouldn't come here. For all the rest of us, it's a great place.", "author": "Carl C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "This review is currently ONLY for the chocolate malted milkshake. It was good, rich and a little foamy (I prefer less foamy which is why I gave 3 stars instead of 4) :)\n\nI've been meaning to eat a burger at this place for over a year haha so I have every intention of coming back and trying the burger and fries. When I do, I will revisit and edit this review. Maybe it will go up one star, maybe it wont... muajajaja (attempt at evil laugh in a not applicable situation :) )", "author": "Gerardo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-24", "description": "No bueno, as in not that good. Ordered the whiz special, no onions. Got to work and found there were onions in my order. Ended up making a mess getting those onions out. I'd rather drive an hour out the city next time to find a better burger spot. The only think that makes up for the nasty burger was the delicious strawberry shake.", "author": "Elliot C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "I can only give a review on their milkshakes because that's all I've had.  My husband had a chocolate malted milkshake and I had a chocolate banana milkshake...both were so yummy.  I'm not even a big fan of malt, but I would totally have a malted milkshake from here.", "author": "Rose A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Stumbled upon this place while looking for something quick to eat. Awesome burger for cheap.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-26", "description": "This 1950s old-school outdoor-seating-only burger joint has really great \"curb appeal\", as the realtors say. \n\nThe food, however, barely reaches marginal quality. Damnit, you WANT it to be better, as this would be on the way to a foodie perfect moment. Alas, it's not to be. \n\nOkay fries, good condiments, but what tastes like only the best frozen 'B'-quality meat. Better than starvation, but only just. \n\nKeep driving. Your stomach will thank you.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "Whiz Burger is a place that you don't want to admit to enjoying. It's an old fashioned drive it and fast food at it's greasiest. However, it's a San Francisco classic and when you are up for a splurge (I do mean calories, not cash) it's worth it! It's exactly what you would expect burgers and fries, shakes and malts. Not exactly culinary grandeur but what do you expect from a fast food burger joint. You could go to a big chain burger place or enjoy a snap shot from San Francisco days past. \n\nPros\n- The shakes, malts and root beer floats\n- Seasoned fries\n- Pretty good burger (not as greasy as some)\n- Takes credit cards\n\nCons\n- The regular fries are bland and not worth the calories!\n- Closes down fairly early", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "A nice break from hip foodie cuisine. Veggie patty is as good as the one at southern pacific. Chocolate milkshake=perfect. & thick creamy ranch for seasoned criss cut fries. What more could you want?", "author": "Yvonne Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "I was craving good, simple food to take home, having just flown back from a 48hr trip for an east coast trade show. I got the Whiz Burger and I'd recommend it to anyone else looking for something quick to eat/order. \n\nMy meal definitely was better than expected, maybe because of the delicious french fries. I couldn't get enough of them! Hopefully pre-salting isn't all that it takes to satisfy my fry taste buds. I don't think I was that worn out.\n\nThe building and its location weren't a big deal. I enjoyed Whiz more than Beeps, which is set up similarly. Parking next to the building, followed by a quick to-go order, was perfect for me. When I walked up to the window, a guy came around from the back counter and was on his cell phone. For some reason, this didn't surprise me. I went asked the dumb question of, \"What's on a Whiz Burger?\" because the toppings seemed to be a mystery on all three types of menus in front of me. He didn't blink though....rolling out bacon/avocado and then all of the other toppings. Guy's a pro.\n\nThe shake was ready after a few minutes. I'm not a shake guy but Yelp reviews encouraged me to try it. The actual strawberries used were appreciated. The burger and fries came out just a few minutes later. Pretty darn fast. In that time, one person was ahead of me, and two followed with orders at 5pm. (Remember, my body was feeling 8pm, especially after the previous night.)\n\nIt was a good deal: $12 for a burger with bacon, avocado, adding cheese, along with fries and a shake. Sure, we can spend hard-earned money at a ton of places in the Mission, not to mention all of SF, but very few places make fries THIS GOOD. Am I too easily pleased by salty fries? Maybe, maybe not. Go there yourself, and then let me know.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "I've been going to this place for the past 15 years and I still love it. Hamburgers, the waffle fries and the vanilla shakes are my favorite. Service has been a bit slow lately but still delicious!", "author": "Marlo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "I have walked and driven past Whiz Burgers for many years. Finally, I was hungry enough to walk up and order something. Yesterday I pulled into their lot (easy to park-- yay!) and ordered a garden burger with extra pickles, plus a medium Coke. It took maybe ten minutes for me to get my order, but gosh, that garden burger was good! It came neatly wrapped in a small bag with ketchup packets and a straw for the drink. I ate half of it right then and the other half later, when it was still good. The veggie burger has a smoky flavor to it that made it extra delicious. \n\nAll for $7.50, not dirt cheap but definitely reasonable in our town for the meal I received.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "I use to live a few houses away from Whiz ever since i was born in 1985. Whiz burger is a good decent place. To this day, it's still a good decent place. Good burgers and good memories. \n5 stars for still being around and bringing me back memories when i'm around.", "author": "Nelson M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-02", "description": "After buying my hamburger combo meal, the first thing I noticed was the the price of the combo was actually the same price as buying a burger, fries and a drink separately. Not sacrilege, but not a good look; kinda felt like they were calling me stupid. I sat down with my meal and it was all around sub-par. The fries had enough salt on them for 3 orders, the vegetables were not fresh (inexcusable for ant California dining establishment), and they give out only a few of these wimpy ketchup packets that hold less than a teaspoon, forcing you to ration out your ketchup, only to run out before finishing the meal. Doesn't take a whiz to figure out there are better burger joints.", "author": "Diesel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Like my second kitchen. Sad but true. The turkey burger, grilled chicken sandwich, The corn dogs, and the fries are great. The veggie burger is gross. The ice cream cones are the secret tip: hearty and quality (may be Mitchell's) for only $1.85. The shakes are great.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-04", "description": "Banana shake is fantastic, as well as the waffle fries!\n\nThe burger was just ok- kinda thin (not a good meat to bread ratio), i asked for \"medium rare\" and it was closer to well done, and the bacon (yuck) was perhaps the fattiest bacon i've even encountered.\n\nStill looking for that perfect burger....", "author": "D F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "I'll make this short- \n\nWant some burger goodness on the fly for cheap? Whizzzz burger!\nsidenote: and I am a vegetarian, so can't speak for the meat.\n\nHere's what ya gotta try:\n\nSpecial: Veggie Burger with (get the crosscut) fries & large drink\n** and the Banana shake is amazing!\n\n\n-1 star short of a perfect rating for all the grease & possible tummy ache later. but yummy overall.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-23", "description": "The awesome storefront at the Whiz suckered me into getting one of their burgers. It oozes 50's charm out of that big glass window, over the picnic tables and onto Van Ness. \n\nI was hoping the burger would have the same sort of personality, if it's possible for a burger to have one. Yeah, burgers can have personalities.\n\nThe guy at the counter asked if I wanted everything on it and I said yes, assuming that meant lettuce, pickle, tomato, onion...the burger basics. I didn't know it meant adding bacon, avocado, and more cheese at an extra charge. Oh well, I thought, more toppings more flavor. \n\nDespite the extra fixins the Whiz Burger was just bland. The meat wasn't great and it fell apart as soon as it was unwrapped. And I would say it was more of a hoagie with hamburger meat on it than an actual burger. \n\nIt's worth the visit just for the building but don't expect to be blown away by the Whiz Burger. Their root beer was bangin, though.", "author": "Corbin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "I would give this place 6 stars if they had vegenaise and sriracha for my veggie burger.  Sometimes you just need to go that extra mile on your own.\n\nPs.  Jalapenos.", "author": "steve m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "Good food love the burger the crosscut fries is a bit expensive also love the garlic fries love their coffee milkshake", "author": "Heat L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "The steak sandwich is probably just 3 stars. It's tasty and works well with the toppings they put on it, but it's nothing special... Kal's Bar-B-Q in Sunnyvale is a lot better in that regard. But I can't give this place 3 stars as a whole... the malted shake I had was amazing and the retro look is intriguing.\n\nIt's a bit awkward having to sit at a picnic table in the Mission District when you go here... I imagine a lot of the patrons opt to get their food to go rather than eating at one of the few tables they have outside.\n\nOverall, I plan to return again and try a burger. I'll consider the steak sandwich as well, but I'd like to try more things here.", "author": "Jesse R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-09", "description": "Wow! 5 stars, definitely. \n\nFor years I had avoided Whiz Burger for a myriad of reasons. It's on the corner of Shady Lane and Ghetto Way for starters. It looks physically run down, just like most hipster joints - and sorry, but that doesn't exactly scream 'sanitary' or 'delicious' to me. Also, it's a burger joint and I'm a vegetarian, so we're automatically at odds with each other. \n\nBut, my curiosity got to me this time. I walked past and noticed their giant menu, and mango and banana milkshakes screamed out at me. So I kept looking, and to my surprise I saw grilled cheese and veggie burgers. And I was hungry, so thought, 'what the hell?' \n\nThe veggie burger was AWESOME! It was the tofu kind, I think it tasted like Wildwood, which is my absolute fav. It stayed delicious even after it was luke warm. AND? They have seasoned fries. And they were amazing. Light, fluffy on the inside, crispy on the outside. I abstained from getting a shake, but I will next time.\n\nMmmm. Next time....", "author": "Amber K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-12", "description": "Passed by Whiz many times and wanted to try.\nHad a burger / fries  lunch.....hmmm, it was GEE WHIZ but not in a good way. Cool looking place. Grouchy folks taking the food order. Hamburger was well, basic at best. Fries were OK, a bit soggy. \n\nYah, if you live next to Whiz Burger and don't care what you are eating, Whiz is for you. If you are passing by....just Whiz on by, keep going. \nNot a place that will see me a second time.", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-05", "description": "This is pretty terrible food, but bad in a way that is like how a really bad movie can be good and surprisingly entertaining.\n\nNow and then, because I live down the street, I need something quick and cheap. \n\nAnd I need that special Whiz taste.\n\nThat's when I go to Whiz Burger.  Turkey burger is not bad.  I like that there is not another place like this in SF.\n\nSometimes you gotta get your food Whizzed on.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-29", "description": "Came by with a friend to eat burgers. \n\nI ordered the mushroom burger and garlic fries, my friend ordered the burger burger. While we waited, we sat on the wooden tables and chairs. They seemed pretty dirty. \n\nThe food took like 15 minutes to make. \n\nThe garlic fries were pretty good, I wish they could've added a little more garlic. The burger was just dull, flat and boring. NO FLAVOR in the cheese, beef, mushrooms. \n\nIf I'm in the area and craving garlic fries, I'll give it a second chance and check out other things in the menu too.", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-09", "description": "Whiz Burger Haiku\n\nCome for the burger\nHomeless drunks ask for your change\n\"Sorry, just spent it\"", "author": "Shannon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-20", "description": "Confession one:  I am a vegetarian who hates veggie burgers.  It's like eating a bread sandwich, but worse--I mean, I actually like bread. \n\nConfession two:  I a sucker for anything old and/or divey.  \n\nSo when the boy, on an eager quest to find the best burger in the city, said 'Whiz Burger', I was in.  When he said 'the veggie burgers are really good' I was skeptical.  \n\nI am happy to report that--omg--the veggie burgers are. really. good.  They're made of tofu and vegetables and get crispy on the outside, and are nothing at all like a bread sandwich. \n\nThat, plus waffle fries and half a fresh banana shake, left me in food coma all Sunday.", "author": "Dana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "Amazing burger and shakes. Great atmosphere, friendly staff, authentic burgers. Most bad reviews on here seem to be based on pretty isolated experiences.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-08", "description": "Look, your not going to find a fancy burger joint here. The place is physically falling apart... which is awesome for me because the food is so good that the unappealing aspects of the place keeps the line short :)\n\nI look forward to my climbing days over at mission cliffs just for my trip to Whiz Burger right after.\nI have never had a more delicious hamburger. Hands down.", "author": "Lotan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-09", "description": "I like the food, it was good for the money. But when I was told that the three dollar shake was almost 8 bucks because it was the largest size. I felt like the employee thought I was a tourist, because the chocolate shake was not any bigger than the 3 dollar shake I had the day before. I have not gone back, because I don't want to get ripped off again. The same meal cost me about 12 bucks the day before with the same shake size and that day I paid 20 bucks for the double cheesebuger plain and the large shake with fry's, same meal.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-26", "description": "Make sure you go to the right window, they will ignore you even though you are standing at the other window. I guess when they say order here, it really means order here. Just got a milkshake before dinner and it was chocolately but not too overpowering. Kinda of like every other milkshake.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-18", "description": "Whiz Burger has some awesome grub, I'll tell you that. The signature eponymous burger comes complete with avocado for a nice departure from the ordinary burger joint offering. There's also vegetarian options, chicken burgers, etc. Garlic fries, shakes, you can get what you need here to get that burger joint fill.\n\nThe real neat thing about The Whiz is the outdoor seating which is especially awesome when the weather cooperates.\n\nPrices are a little steep, but you get a nice portions, so you can't really complain.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-05", "description": "Yes, as others have written but I had to experience for myself, the allure of the burger stand/drive-in is dusted by the lame food. Such a shame, because this could be such a gold pot. Missionites would love it.\n\nI had a cheese burger and chocolate shake- that was all I needed from this place. The burger was tasteless and the cheese not melted. The chocolate shake was okay.", "author": "Lis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "Don't mistake this four star review for tacit approval. This is a disgusting, borderline hazardous hell hole. Even the food items I'm comfortable consuming I can't vouch for entirely. You have to embrace the concept of beneficial stress to really get behind ordering food here. Actually dining at the outside tables would be taking things past bravado and on down into \"cry for help\" behavior. Eating your food at the bar stools with your back to Van Ness is up there with bending over for soap in jail or taking pills you find on the ground (both of which have more than a tangential relationship with Whiz Burger as a whole). \n\nWith that said, I really really like the titular Whiz Burger. The right amount of everything; cheese, beef, bacon, and avocado in proportionate moderation, cooling tomato, iceberg lettuce, onion, condiments on a nice, soft, toasted roll. The redundant \"Burger Burger\" is actually a single, reasonable burger. I won't belabor the rest, it's all what you'd expect. \n\nTake a walk on the wild side but eat it at home and keep your guard up while waiting like Inspector Cleaseu coming home to Kato (i.e. calm, friendly but prepared to defend yourself).", "author": "Milk N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-13", "description": "The burger was pretty tasty (avocado wasn't ripe -- blech!).  Both the regular and spicy waffle fries were very tasty.  \n\nUnfortunately, my digestive tract did not enjoy dinner so much.  I went with a friend who can eat anything, and she had some problems with it, too.  Even if you have the stomach for it, Whiz Burger's food is nothing special.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "The Bananna Shake, and cross-cut fries. 'Nuff Said.", "author": "Connor E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-22", "description": "I love their veggie burger here.\n\nIt's cheap, it's relatively quick to get, and hey, this place is an awesome venue to get it from (have you ever seen this place??). Cool joint for sure.\n\nYou order at the window & sit outside. Nice :)\n\nTotally love the restaurant as a whole & will def. be back!\n\nTry the veggie burger!", "author": "Kai S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Milkshake,burger,fries are yummy.. My son doesn't like eating burger but this place is his favorite spot. Been here 4 times and still keep coming back, friendly staff and definitely going back for more.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-16", "description": "I've enjoyed food here before but my last visit was spoiled by bad service. When I order a cheeseburger I expect it to come with cheese. Slapping a cold unmelted piece on after the mistake is pointed out does not turn it into a cheeseburger. By the time I've had to send my food back twice it's time to get a refund and go elsewhere. So I did.", "author": "Jade J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "I've passed by Whiz Burger so many times and have always wanted to come here! I love the old school and somewhat ghetto look of the place, and often times places like these can be the gems that surpass newer and fancier places. \n\nDuring our sub-par garage sale, I walked over here with my sweet baby on this past sunny Saturday afternoon.  I ordered the turkey burger with cheese meal, and my lady ordered the veggie burger solo (so we shared the fries and drink). Our total was around $14, which I guess isn't too bad. It turned out to be plenty of food so I'm glad we opted to not get the additional order of fries.\n\nMy turkey burger was big and tasty, and had all the fixins. The fries were really good, and there's nothing I dislike more than a crappy fry. Overall I thought my food was pretty good!\n\nOne thing I didn't really like was the way you order. You go up to the window, which is fine, but they didn't give me a receipt or a number. My lady had to stay and claim the table and I stood around by what I assumed was food window. It would be nice if they just called out your number when your food was ready so you don't stand there hovering like an idiot!\n\nOther than that, I would come back to Whiz Burger; perhaps for a shake next time!", "author": "Audrey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-11", "description": "Whenever we pass by this place, we always say, \"Next time.\" We finally took the plunge and tried it. Not the best place to go to if you are trying to eat healthy but who the heck cares. We tried the Bacon Cheeseburger. It was big and delish. Bacon makes things better. If you order the large fries, you will get a Large fries. The onion rings are ok. The seasoned fries are nice and flavorful. Can you tell we didn't hold back?! And the banana milkshake was creamy and fresh. For a junk food fast food fix (if you don't want the normal McD's or BK, etc.) this is a good place to go.", "author": "Mel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-29", "description": "Upon my first visit to Whiz Burger I was distracted from ordering by a hobo searching the contents of their garbage can. The hobo was so dirty he looked like a coal miner. The elastic band in his athletic pants had long since succumbed to the stress of the hobo lifestyle. This allowed myself and church goers across the street a clear view of his dirty hobo underwear. Except he wasn't wearing any underwear.\n\nExhausted in his effort to liberate some fries, and then some ketchup from the trash, he laid out on the sidewalk for a much needed rest. A few minutes later he awoke and began eating the bounty that laid waiting before him. It was at this point I lost my appetite and went home.\n\nIf you should see a hobo wearing a toeless sneaker on one foot and on the other, a black boot, you may also want to pray for his soul.", "author": "Dinner Dog X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "We call this place the church of Whizzlam for a reason.\nGet get GET a banana shake.\nAlso, bomb veggie burgers? Be still my I stopped eating meat! This makes me so happy!\n\nOnly con: the grilled cheese is definitely a miss. I cracked mine open and put fries inside and everything was a-ok, then, though.", "author": "Erin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "Whiz burger is the perfect place to go for a great yet simple burger. With great burgers, tasty fries, and delicious shakes, This place is worth the time.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-09", "description": "Bad business !!!!!! so when you go eat here make sure you save your receipt!!!! The owner called to have my car towed by Eagels Towing and road service after I walked around the corner to check aout the area for about 10 minutes .$8 burger towing $300 so I would have to say the burger was not worth it !", "author": "Kristi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-25", "description": "Even though I lived nearby for a year, I had NEVER been to Whiz until this afternoon.  DANG that's a great burger!  I ordered a Whiz burger w American cheese and everything (not knowing what was on it) and a banana shake.  The shake was handmade and featured a perfectly ripe and then-peeled banana and was totally delicious.  The Whiz, it turns out, includes my two favorite burger tops - bacon and avocado.  This is a great burger!  It was also a double decker.  $11 for the pair, I'm a huge fan and I will definitely go back and dive deeper into the menu.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-26", "description": "3 stars for the novelty of the place, and the resilience of lasting for so long.\n\nFood itself is just ok. I don't get using a french roll for a bun (was this a new thing to try and compete w/trendier burger joints, or a carryover from the 60s? either way. no bueno). \n\nAs far as retro burgers go, I prefer Beep's over Whiz. And Bartel's over all else.", "author": "Sabine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-26", "description": "Love the Whiz. My favorite is the steak sandwich with fries. My first time here I came with low expectations, but I love it. It's one of those places that I just gotta have when I get the craving.", "author": "C. H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-08", "description": "A true rip off!\n\nI went here for a fish burger, small onion rings, and a small banana shake...$13.  The fish burger, shake, and onion rings should have been appropriately titled \"mini\". The quality was poor and all except the shake (half decent) tasted bland.", "author": "Nyla S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "Had their bacon burger, criss-cut fries, and a banana milkshake. The fries were great, the bacon burger is distinctive (though could be a little more so), and the milkshake is as good as you'd expect. I may choose this place over In-n-Out if I were somehow put in that awkward position.", "author": "Epicurean _."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "We live nearby and have been going for years. Try the banana shake or chocolate malted milk shake, waffle fries, and a cheeseburger. Location/set up is convenient and while it is kind of ghetto, I would never be afraid to go and get some food here.", "author": "Leo P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-14", "description": "Whiz Burger's burgers and fries are okay, maybe even good.  The milkshakes are good.  The service is fair, and somewhat prompt.  The prices aren't great, but aren't horrible.  For this, the restaurant gets 3 stars.\n\nThe restaurant has one other feature, however, which I can't fail to mention.\n\n/enable rant mode\n\nThe restaurant also rents out parking the lot behind the restaurant.  About $100/month, but also on a daily basis.  Because I live nearish to the restaurant, I rented parking there for a month.  One day, I returned to discover my car gone.  After the initial \"Oh my god, someone stole my car\" hysteria had passed, and after long investigation with the manager, I found out the story went this way:\n\nWhiz Burger is near a Korean church.  There had been a funeral at that church that afternoon.  Many of the attendees had parked in the Whiz Burger lot without paying, so the owner of Whiz Burger called and had all the cars in the lot towed during the service.  Including my car, despite the prominently-displayed parking pass.\n\nNow, before we talk about poor Ben and all the trouble I was put to because the owner of Whiz Burger can't be troubled to actually check the cars before having anyone towed, let's remember this: he had the cars of the funeral attendees towed DURING THE SERVICE.  If there was going to be a procession to the grave site, that's right out the window.  Even if there wasn't, you now have a bunch of people walking out of a funeral who now have to deal with getting their cars back.  Executive summary says: WHAT A DICK MOVE!\n\nBut back to me and my problems.  I now have to get in a dirty, stinky, cramped tow truck and ride to the tow company's beautiful headquarters in wonderful Hunter's Point, return my car and drive back home.  Why do -I- have to do this?  It's not like any of this is my fault.  But the tow company politely refused to return my car any other way.  The tow truck driver also felt the need to try to explain to me why none of this was his company's fault.  Great move!  I guess it's judgment like this that has resulted in you having a career as a tow truck driver.\n\nI now pay $160/month to park elsewhere, but at least when I go to get my car, it's where I left it.  And, really, isn't that THE WHOLE FREAKING POINT?????\n\n/end rant\n\nSo, 1 star for Whiz Burger.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-08", "description": "Before Bender's burned the fuck down, we'd hang out there for really two primary reasons: 1. Jessi and 2. the close proximity to Whiz Burger.\n\nWhiiiizzzzzzzzzzzzzzzzz Buuuuuurrrrrggggeeeeerrr.\n\nThat's how it sounds when I say its name after I chomp the H outta Whiz Burger's box. Perhaps y'all see the Whiz as a dude or, to be fair, someone a little in between, but I'm pret-ty sure the place is a straight up chick with, like, huge tits and the mouth of a sailor.  And if you don't eat everything off your motherfucking plate, you know bitch is gonna rectify the situation one way or another. \n\nSo you better just eat it.\n\nOr perhaps I just make up dick-tarded scenarios as a sorry means to justify eating like the Midwesterner that I am.", "author": "Chloe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "word,\n\nThere something to be said about diner food. Diner food really represents the true ideals of America as diner food completely disregards any idea of health or nutrition in the search of the all-American, all-pleasing taste rush. When in doubt deep-fry it. Pour that salt on that. Liquid sugar side drink? Oh you know it. Barely cooked beef? Yes, yes 1000x yes!\n\nThat being said Whiz Burger could only be more American if you installed a Statute of liberty on top of the building that played the tune to 'God bless America,' while the 1985 Bears sing and do the 'Super Bowl Shuffle'.  \n\nThe design of Whiz Burger is awesomely great as it looks like a relic from a by-gone era of the 1950s when diner food actually WAS considered healthy and nutritious. Unlike other wannabe 50's diners **cough cough Lori's DIner cough cough **** Whiz Burger was indeed built in the 50s, and not just some lame corporate gimmick. You feel like the Jets might show up to order a burger before the their rumble with the Sharks.\n\nLike any respectable diner joint they have burgers, fries, shakes and soda. They've even modernized a little with churros and salmon burgers. They actually do have salads, but lets be honest no one goes to Whiz Burgers for a salad, you go to Whiz Burger because you wanted a drippy saucy beef burger with heart-clogging mayonnaise, and salty french fries that leave you full and maybe a little disgusted by yourself.\n\nyups", "author": "david h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "(Pub Commute Stop 1b)\n\nMaking your place all retro and yellow is always a good call.  I bike down 18th St every night, so when we needed an impromptu food stop roughly on the way from 16th/Bryant to 19th/Folsom, naturally the memorably-decored Whiz pops into my head first.\n\nActually, Whiz makes a pretty good alternative to In-N-Out if you can't be bothered to trek to the wharf or Daly City, or if you just want some beef alternatives (big thumbs up on the turkey burger, btw).  In fact, the fries are even better than In-N-Out.  Note that this is a burger *stand*--you order at a window and eat outside (there's 2 picnic tables and a counter), so mind the weather.\n\nThe food and style of the place would definitely merit 5 stars, but I have a couple objections:\n\n1) A place like this is just begging to be open all night.  Sure it's set back a bit from the Mission scene, but not by much, and I'm sure it could be a midnight mecca for hungry hungry hipsters.  But alas, it closes at like 9:45.\n\n2) What's with the surly owner?  Read Ben P's tragicomic review--it doesn't surprise me in the least.\n\nOk, so now we've picked up Ed M.  On to Homestead!", "author": "Wes M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-15", "description": "Coolest burger joint in the city\r\n...ok \r\nCoolest looking burger joint in the city.  \r\n\r\nWe should pool our money together and buy it cause with the right menu and chef it would be a slam dunk.  The folks that operate it clearly dont know what they have and it shows from the crappy burgers to the dirty ketchup stand out side.  Maybe I will go back and try it but there are other burgers out there to be eaten still..  \r\n\r\nThumbs UP:  Looks like a burger stand from the fifties - not like one of those dorky \"diner\" style joints but like something from the golden age of Los Angeles. \r\nThumbs DOWN:  Please  sell the operation to someone who knows what they are doing", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-16", "description": "Tried the veggie burger, seasoned fries, and a chocolate malt shake.  Friend got the same, but a banana shake.  Everything was pretty bland.  I appreciated that the veggie burger was not a boca/gardenburger patty.  Not sure if they make it themselves, but it was refreshing to get the vegetarian option at a place like this and have it not be something I could get in the grocery store and reheat myself.  \n\nIf you count salt as seasoning, then the seasoned fries were seasoned.  Not quite what I expected from a food item under that moniker.  The chocolate malt shake was solid, but if I'm gonna gulp a milkshake, I kinda want to be wowed.  The banana shake tasted like banana powder yet had chunks of banana in it.  I'm... not sure how I feel about that, honestly.\n\nIf this place were open late and I were prone to staggering between dive bars, I might end an evening here, but it's not and I'm not, so I probably will look elsewhere next time I'm in the mood for diner/fast food.", "author": "elizabeth o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-02", "description": "After a full day of cleaning a storage room, buying a Christmas tree and doing good deeds like donating items to the Goodwill, I needed a burger. Seriously, I thought, \"I need a burger.\" \n\nI ordered a double bacon (I know!) cheese burger with garlic fries. The burger I had was actually very good. I had no clue what to expect. The quality of meat was surprising, and the cheese wasn't processed American slices. I'm suspicious it was like nacho cheese. It actually tasted really good! The garlic fries were good as well, after of course, I added some seasoning. The garlic fries got the garlic part down. So well, my car filled with the smell of garlic almost instantly. I bet if they sprinkled the fries with some salt or their seasoning would have made them fantastic. \n\nI really enjoyed Whiz Burger. I can't wait to return! Thank gawd I live 5 minutes away!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "Been hankerin' for a burger for days now and I worked out really hard this morning so I could get one without feeling all guilty...I still felt a little guilty, but it was good!\nThis place is absolutely no frills, good cheap food. Friendly guys at the window, fast service, yummy burgers.  Your not going to get blue cheese and kobe beef but you'll love the juicy fatty goodness.  This place has plenty of character and that makes up for its lack of...dare I say, class!", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-09", "description": "I've driven by this seemingly forsaken Mission institution for decades and not tried their burger since my earliest drive by's back then.  One of my favorite cab divers suggested Whiz after one of my recent Yelp reviews and here I am.  A prime corner at South Van Ness and 18th with parking aplenty and an equal amount of not giving a shit attitude.  Across the street from a pristine Church but somehow it feels like a blighted neighborhood and I get the feeling that Whiz and its owners aren't much concerned about quality of life for those living nearby.  It's a once modern and small square building sitting at the corner of a large unkempt parking lot, with a lot of dirty windows, worn out picnic benches and broken counter stools just outside the dirty windows.  The menu is also from another time and yet it says what the owners feel like sharing about their dilapidated drive-in.\n\nI parked in their parking lot and walked over to the front window and ordering counter and was panhandled by a pretty down and out toothless couple who looked they just finished a life ending attempt at copulation and failed.  A small group of students from nearby schools, a priest, a few scattered customers and some mean looking punks hung around the picnic tables our front and on the sides of the building, not very inviting but like I said, thei place ignores anything and everything outside the glassed in cube where they cook and count money.\n\nI wanted to try a burger so I could share with you my experience and when I ask the counter person what their regular, best selling burger was, he mumbled incoherently 'da burger special' and since there were about half a dozen and he might have been in a coma, I just asked for a cheeseburger special with a diet coke and fries.  I sat on a broken stool at the outdoor counter and watched the inside and outside with amused skepticism, like waiting for a drug deal gone wrong to turn into a gun fight, but no such drama unfolded although it wouldn't have been out of character.  Soon enough the guy yelled at me, no names please, and handed me a brown bag and frail waxed paper cup and I arranged my find on the bag and took my first bite.  I'd ordered it as they serve it, no special request, and I got it and then got to wrestle with eating a grey, flavorless burger patty disguised with a runny, layo type dressing, shredded lettuce, chopped tomato, a lot of tasteless pickles on a bun that wasn't up to the job of holding it all together.\n\nThis type of burger can taste so good when drunk or hung over, but is a culinary nightmare when stone cold sober and hungry for just plain good food.  By the 2nd bite part of the bun lay on the ground along with much of the toppings and the melted cheese, no choices here, had coagulated into stone age toughness.  I was unable to finish it and focused for a flash on the recently frozen fries which were white as snow with the copious amount of salt shaken over them.  The diet coke was flat and the cup it came in was caving in from plain cheapness.  How does a place like this survive for so many years?  I don't really know, but one can speculate that the wild folks who hang around and pose like gangsters must buy a lot of burgers and fries or the nearby Church provides a subsidy to keep the kids out of their Church.  If the meat only looked like it had once been red.", "author": "Stu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "havent been down here in ages .. { 1970s} need to get back down there again, used to go here while at my cousins on Capp St..", "author": "CATHY F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "Homies:  Ey Ruca let's get our grub on over there.\nRuca aka me:  The Whiz?  Gross man.  It looks like a dump where cucarachas dance up on the hamburger bunz! \n\n*2 drinks later*\n\nRuca:  I'm hungry, fuck it, let's go to Whiz! \n\nFirst thing when we ordered: a water beetle was on the counter, and as we threw some cash at it,  waiting for it to dance, about 40 police cars + a Paddy Wagon  roll through, blockin off the whole area! \n\n We heard a loud THUDD in the middle of the calle. Someone dropped a gun from the roof a church across the street. \nOOOOooooo CHIT! \n\nWe looked up and some foo across the street , top of a church clinging to a saint,  basically caught. The cops gave him a ladder to come down but  homie put up a ten minute scene which consisted of him pushing the ladder away and joking  \"Want me to jump?\".  \nThe cops were pissed off going \"Come down like a man\" .  \nOther cops were eating burritos, enjoying their break.   \n\nNE Wayz, the joint was better than Medieval Times, lemme tell you, the food was great, but the entertainment was BETTER!", "author": "Roxane P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "Everyone hears the name whiz BURGER, and they don't know that they make the second best cheese steak sandwich in the city... order the #4 (includes coke and fries)  with \"hot peppers, grilled onions, and bell peppers\" and you are good to go with a GREAT cheese steak.\n\nGet the BURGER out of your head and go for the cheese steak.  I have never even had their burgers, and never will.  How could anybody eat a burger there after eating their cheese steak?  Closest to Philly besides Divisadero street a the Cheese Steak shop.", "author": "Timotheus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-08", "description": "Whiz is one of those places your dad took you to when you were a little kid.  It's no-nonsense; you order outside, wait outside, and eat your food outside.\n\nThe fries are good, and whatever vegetarian option I had was decent, although I don't remember what it was.  It's got its own parking lot, which is unusual for this part of the Mission.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-01", "description": "Dude fuck all y'all that diss the wonder of the Whiz.  Straight up.\n\nFirst of all as a born and raised San Franciscan this place is OLD SCHOOL.  I remember going to the Whiz when I was little... back when the Mission was dangerous! Imagine that.\n\nThe fact of the matter is this: They don't care about you.  They don't care about your needs... unless those needs are a burger, crispy fried and the best fuckin' banana shake you ever laid your hands on.  To the cheap fuck who thought that the shakes are too much.  Been to St. Francis Fountain lately???  The banan shakes are better than that place by leaps and bounds.  They use FRESH bananas! So. Damn. Tasty.\n\nOn a trip to the Whiz the other day getting my haircut it went a little like this:\n\nCounter Dude: What you want?\nMe: Whiz Burger (the works), crispy fries, banana shake.\nCounter Dude: Here? To go?\nMe: Here.\nCounter Dude: 5 minutes.\nMe: Sweet\nCounter Dude: Cool.\n\nDone and done... no ass kissing, no \"service\"... it doesn't preport to be Park Chow nor DOES IT WANT TO BE!  The new peeps in San Francisco feel like every restaurant has to give them a blow job with their meal in order to get 5 stars.  That just isn't how it is.", "author": "Dutch G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-24", "description": "Great turkey burger, awful fries. Is it that hard to blanch some fries in the morning, toss them in the freezer and then give them a 3 minute fry when they're ordered so they don't come out all soggy and oil-logged? If I can do it at home, Whiz Burger can do it. \n\nI will prob go back someday for another turkey burger or maybe a regular cheeseburger but I won't be ordering the fries.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-02", "description": "!!!FRIBBLE ALERT!!!!\n\nThis review is of one thing only: The coffee milkshake. Mind you, I believe the Friendly's Fribble is technically a frappe, and of course a classic Fribble is served in the cold, cold steel canister in which is was mixed, which means it's enough to feed a family of four. This comes in a paper cup, but it's still the closest thing I've found on the West Coast to the only good thing on the menu at Friendly's. Sometimes you just want a Fribble, and this is the fix. What up New England!?!", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-10", "description": "Damn good burgers, damn good shakes -- Watch your car like a maniac.\n\nIt is not worth the $400 we ended up paying as a result of eating there. My lady friend and I parked in their lot, got a burger and shake, ate it there, and then took a little walk. When we returned about 45 mins later, the car had been towed. The only signs were the standard \"unauthorized vehicles will be towed/parking for customers only.\" The fellow at the counter told my now sobbing friend that, yeah, tow truck comes by every 15 minutes (???). \n\nI understand the need to protect your lot if you're in such a central location, but, Whiz Burger, be reasonable. Towing loving customers' cars is not a way to keep them coming back. Then again, if you split the fee with the tow company, I guess it's as if we'll be coming back for another 13 or so meals.", "author": "John F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-12", "description": "I've driven past several times, but last week ate their for the first time.\n\nIt was late at night and the place was lit up like a beacon. I walked up and ordered at this counter and felt like I had walked back in time several decades.  The menu is simple.  The food is greasy. But somehow it does satisfy. It might have satisfied a bit more if I had been drunk. I think I will make sure of it next time.  \n\nSo I wouldn't come here for the burgers per se. I'd come here for the convenience --an easy walk for me--- and the atmosphere.  You know, old-time walk-up/drive-thru burger joint. It definitely scratches an occasional burger itch.", "author": "Padawan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-04", "description": "This is where Ponyboy and Dallas ate after killing the Socs.  \r\nCheap food.  Don't want cheap food?  Go somewhere else.  Don't expect this to be a gem.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "I gave 5 stars for the hot links. think it was the very first time i ate an authentic american thing", "author": "Pinqi F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-23", "description": "Wholehearted three (but not more) stars.  A stylish retro leftover serving... mediocre fast food.  It's convenient, it's cheap, and it tastes like food from an era of lower standards.  But Jesus is it good when you're drunk.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-24", "description": "Its Saturday afternoon and the last day of the 2007 Bicycle Film Festival at the Victoria.  We're hungry and decide to take afew pedal strokes over to Whiz.  Hot link hot dog thingy and garlic fries quell my hunger.  Good food at a fair price.  Fortunately the weather was decent that day as  there is only outdoor seating.", "author": "andrew l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-06", "description": "I gave Whiz Burger a extra star because the Bobby Teens made there \"Hot City Boys\" video there back in the 90s. Check out Whiz Burger in there now old video http://www.youtube.com/watch?v=ozThnDhiGmw \n\nThe place is a Mission landmark, hopefully it won't go the way of the Chatterbox, the mural, and the giant sign. \n\nGood fast food in a old school happy days diner.", "author": "Johnny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "I've driven past Whiz many many times thinking ooh I must try that, it looks good.  It reminds me a little of Dick's in Seattle that has been a fixture on Broadway for many year, but this review isn't about them so apologies for the digression.\n\nI had the Big Whiz burger minus the avocado.  I love avo but always find its inclusion on a burger a little odd.  The Big Whiz is obviously their signature dish and comprises of two patties, some sauce, lettuce, tomato, pickle and bacon served in a French roll and then expertly wrapped up in wax paper and sliced in two.  It was absolutely delicious, well seasoned and a great balance of flavours and I still think that the addition of avo would have been a bridge too far.  The use of a French roll rather than a burger bun is an inspired choice and sets the Big Whiz apart from your common garden variety burger.\n\nThe garlic fries we ordered to go with our meal were definitely garlic fries but woefully underseasoned and no salt was given to us in the bag.   I presume this was another misguided attempt to help keep my blood pressure low and if at any point in my future my doctor tells me it is anything other than textbook I'll thank the food service industry of California for doing its bit, but until then I'll keep on my high horse.\n\nI did however think that Whiz was damned expensive for a counter service burger joint.  2 burgers and 1 portion of garlic fries came out at an eyewatering $18.  If we had added drinks each then we'd have been looking at $25.", "author": "Tony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "I have a friend who says \"18th and South Van Ness...where you go to forget what happened to you at 17th and Capp.\" \n\nMy girlfriend and I were having one of those next-morning, what-in-the-fuck-did-we-do-to-ourselves-last-night moments and decided the only way our shame and our hangovers could be squelched was via a very large, very greasy cheeseburger. \n\nSure, the place looks a little sketchy, one of those places where you don't wanna interact with the clientele too much and where you probably shouldn't examine the kitchen too closely, but dear Lord, the place is fucking excellent. \n\nNot only do they have seriously old school burgers, fries, and shakes, but if you take your greasy brown bag of goodness and sit at one of their picnic tables--and by the time you get from the pickup window to one of the tables 10 feet away, your brown bag will be translucent from all of the grease--you will have a view while dining that is better than any channel on TV. As you munch on your salty, salty fries and chow on your burger with old school shredded lettuce and crinkle-cut pickle slices, you can watch a variety of pimps, crackhos, illiterates, and degenerates on parade. My girlfriend and I laughed so hard at the buffet of humanity that passed us by that we determined we might have been still drunk from the night before. \n\nShit is cheap, shit is good, and the view is amazing. Get yer ass to The Whiz.", "author": "kdub .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-08", "description": "Although my mild food snobbery rarely dissuades me from trying new places, this particular one had always scared me. I'd walked by it a zillion times on my way to and from Bart, and my preconceptions of it had been dark indeed: it stood as a postapocalyptic monument to the faraway days of Eisenhower and Khrushchev; unchanged and uncleaned in its half century, it quietly harkened to the utopian nostalgia of innocent teenagers at soda shops, while simultaneously failing to fend off accumulated decades of urban blight. This looked like the sort of dilapidated drive-in where gangbangers and homeless denizens would gather today, the sort of place that might have been the initially cheerful setting for a B-grade horror flick in the '80s, only to become the site of real shootings in the '90s, and which of course would carry roachy, ebola-laced Z-grade food that could kill on sight.\n\nThankfully, the reality was not such a faustian tapestry. The menu on the back wall is printed in Tomorrowland-esque retro futuristic style, and includes an assortment of burgers, dawgs, fries, shakes, and (disturbingly) chicken teriyaki. Past experience has taught me wariness of eating establishments that serve burgers, burritos, *and* teriyaki -- invariably none of them will be remotely edible -- but the lack of burritos in this case allowed Whiz past my radar with only a yellow alert.\n\nTheir impressive selection of fries included regular (thin-cut), garlic (didn't try because they were $3), and seasoned (the delicious waffle kind that are near impossible to find elsewhere). I paid the extra quarter for a dollop of mediocre Ranch to dip my seasoned fries. One of my lunch companions got an involuntarily supersized order of skinny fries for dessert, which seemed only fitting after her dinosaur-shaped and very probably not organic chicken nugget entre.\n\nShakes there were runny and unmemorable, offered in a variety of flavors which would have been divine had they contained any real ice cream. And in the espresso shake I ordered, real espresso. Funny how so many things in life could be improved with the simple addition of espresso. Heed the wisdom of this lesson at every opportunity, Grasshopper.\n\nAs for the burger, I got a 1/4 pound \"junior\" cheeseburger. It was probably the closest thing to a Tommy Burger I've had in Northern California: no ingredient is of particularly high quality, yet somehow the cheapness of it all coalesces into a product that surprisingly exceeds the sum of its parts. I'd still favor an In-n-Out or Nation's burger over a Whiz, but there's something transcendently gratifying about enjoying trashy food that logic dictates should be awful. This principle actually holds together many Midwestern delicacies: green bean casserole, cherry dump cake, and jello parfait among them.\n\nThe only thing about Whiz Burger that isn't stuck in the 1950s is the prices. I shelled out $9 for the junior burger, waffle fries, and shake. Ouchitude! Sometimes the painful reality of Bay Area prices can bust the illusion of an otherwise perfectly believable anachronism.\n\nThe quantity of grease consumed over lunch would have been better spread out over a month or two; my system was generally disgruntled following the experience. But my mouth had enough guilty pleasure that I may return occasionally. And no, I won't be trying the teriyaki.", "author": "Brian U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-18", "description": "Three (and a half) stars.\nThe cheezburgers are pretty good and there's a lot on the menu to pick from for whatever combinations/styles of burger. I think that Mary's on 16th actually trumps them though, for  service & atmosphere. Of course, how many places in town ARE actually stroll-up joints? Take away half a point for their never seeming to catch the \"HOLD the mustard\" and for the prices on Shakes/Fries. They'll dink you for a Hamilton anyway they can.\nThat being said, a meal out of Whiz Burgers will forestall any other meal \nof an afternoon, easily- But they are (now) better than Flippers...", "author": "Mark L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-25", "description": "Similar story to my Serrano's review.  Minus the unrequited love.  \n\nConsistent, good, cheep, fast, close to home.  When I need a cheeseburger fix and I am lazy or short on time.  I go to Whiz Burger.  \n\nI don't question the quality.  Things can be good and not of high quality.  Maybe that sounds bad, but whatever, there it is.  Do you love Count Chocula?  Boo Berry?  Wonka Candy?  Taco Bell?  I am sure those things are not make from top shelf materials.  I know for a fact that the ground meat used at Taco Bell is \"Grade D\" and there are oats added to it.  But I still love Mexi-melts.  \n\nI had some friends eat here once and they claimed they had poopy-pants for the next 24 hours.  I love them, but they are a little delicate, intestinally speaking.  So if you have a cast-iron stomach and like cheesy burgers, this is a great place.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-25", "description": "I remember walking past this place on my walk from school home back in my elementary days, in fact, I met Steve Young there once, he was on location shooting a car commercial, the whiz sign was made look nice. That was then. \n\nI decided to throw this place into a few random nights and each time have been full, not impressed. I dont learn.", "author": "Joe J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-30", "description": "The Whiz Burger\" is da BOMB.!!!! Don't judge the book by it's cover!! Yea ain't no top notch place, nothing impressive...it's been there for as  long as I can remember, love their \"Whiz Burger\" since I was a kid and still love it now!!!my kids also love it!!!  I've tried so many times to make them myself...and it jus NEVER comes out the way they do it!!!!! Try it before u knock it!! O Nd the shakes are good too... Mmm I gotta go soon!! Jus made myself hungry!!!", "author": "Jacqueline F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "i was near the amc metreon theatre on fourth street.  my friend and i had a craving for chocolate malts.  i walked into mel's diner across the street and asked to see serving size of a malt and the price.  there was one size for to go orders.  i biked to whiz burgers and discovered they have THREE sizes:  regular, large and extra large.  the extra large cost less than the one, much smaller size container at mel's diner.  they put the containers in a carton and then in a plastic bag so i could get it in my backpack for the ride home. \nthe price, product and service were excellent.  it was a very good value, quick delivery and a tasty malt!", "author": "Kevin E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-26", "description": "I was running errands with a friend and we were both hungry. We wanted food fast, but not fast food, if you know what I mean. My friend remembered a burger she had at a bar in SOMA, but she didn't remember that the place wasn't open yet. All was almost lost until we came across Whiz Burgers. It's old school in that you order at the counter and eat outside on rough-hewn picnic tables. It's new school in that they have veggie burgers and mango shakes.\n\nI had a Whiz Burger without avocado and a side of onion rings. The burger comes on a roll, which is a nice change. She had a cheeseburger with fries. She was very excited about the little brown bag containing her fries. I was excited about bacon because bacon makes a cheeseburger better. Her excitement faded during the meal. Perhaps her burger didn't live up to her standards. Perhaps the scent of the off-duty bike messengers at the nearby table put her off her appetite. (But bonus SF cred points for those scoring at home!) It's not my favorite burger in the City, and I'd probably give it 3.5 stars if I could, but if I was nearby, I'd return.", "author": "Timothy O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-09", "description": "I had the worst service i have ever had in my LIFE. I had bought a burger walked back to my job to eat it I have been there multiple times and never had the food bad or service bad at any time. When I got back to my desk and bite in the burger the most of the meat was still pink and i dont like eating pink meat at all. I called them  and the manager/boss/owner (Older Asian Male)  picked up the phone he was so rude when i told him that the meat was still pink he HUNG UP ON ME! I called him back and asked why did he hang up and he just hung up on me AGAIN! He did not believe me that the meat was not all the way cooked I walked back over there to show him the burger and he didn't even want to look at it. He kept yelling at me saying I'm causing problems when all i wanted was another burger not my money back. He kept yelling at me and saying that he has a lot of other customers and i wasn't important. He finally gave me a refund of my money for the burger WHICH I DID NOT WANT ALL I WANTED WAS ANOTHER BURGER!! The manager/boss/owner (Older Asian Male)  was very rude the whole time and he did not beleive me and he stated I was causing him problems. (HOW AM I CAUSING PROBLEMS WHEN ALL I WANTED WAS ANOTHER BURGER) I am NEVER GOING BACK TO WHIZ BURGERS. THE WORST SERVICE I HAD FROM HIM MOST DEFINITELY LOST AN CUSTOMER.", "author": "Mondale E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-03", "description": "Whiz Burger is one of those places that you remember seeing in like the 1950s.. ok, maybe I wasn't alive in the 1950s but you know what I mean.. \n\nThe old, beat up, bird guano stained half broken sign proudly marks the corner of 18th and South Van Ness.  There's no indoor seating at this burger stand, so you'll have to take your food home, or eat on the oddly proportioned picnic tables that look like they were recycled from the construction site down the street.  Well, at least they're recycled.\n\nAs for the food, it's what you'd expect from a burger stand.  Fast, hot, greasy and tasty.  I prefer the burger burger myself -- it's just your classic hamburger on a sesame seed bun.  The \"whiz burger\" is a strange sandwich on a french roll with avocado and bacon.  I like my burger.. um.. more burger like.\n\nThe shakes are delish.. i always go for the chocolate banana...  Anyway, stop by whiz on your way to wherever.. it was one of those places that I'd always pass by and think to myself.. \"Hmmm.. I should stop there\".  And one day I did.  and I was happy.", "author": "Dennis Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "They have a printout that says \"Best place for feeling like you are on a road trip\". That pretty sums it up. This is road food for wanderers looking for Dolores Park.", "author": "Gonzalo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-18", "description": "Sitting outside on the picnic tables (no indoor dining) is not bad on a nice day.\n\nThe service and food are no-nonsense.\n\nWhiz Burger is served on a hoagie roll. The meat patty is coarsely ground. You do not have an option for medium well, etc., so you may infer whatever you want to infer from that fact (e.g., unlikely to be Niman Ranch beef).\n\nFor the money ($9 for whiz burger, fries, and bottled water), I'd walk the extra few blocks to Burger Joint.", "author": "Rob T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-03", "description": "It comes down to this - if your expectations are realistic, then you'll like this place.\n\nI wouldn't say that the food is \"good\" but that's not the point. If you want the perfect veggie burger or a place to take your parents, then go somewhere else. If you want to eat nasty greasy fries while gazing upon some of SF's meaner streets, then this fits the bill.\n\nAnd who doesn't want that from time to time?", "author": "Josh K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-20", "description": "As I stand in my kitchen and decide not to eat another pack of ramen, I look out the window, and she calls for me \"Cheese burger with sauteed mushrooms.\" I dont bother with the fries, sometimes go for a shake, onion rings are as bad as the fries, but I dont want fries with that, give me my burger!\n\nCheesesteak is good if you are looking for a portion control medium size sandwich.", "author": "Willie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-23", "description": "I've been searching for a good \"side of the road\" burger stand here in the city...not the \"gourmet trying to be more than a burger burger\". So when I saw Whiz, I got all excited that maybe I'll get a sloppy burger wrapped in shiny foil with shredded lettuce, pickles and special burger sauce. Unfortunately, this wasn't the place. Though the burger wasn't bad (a little on the dry side), it was far from a burger stand burger. And the price was a little high for a burger stand too. I'll have to say that the shakes were pretty good. \n\nI guess when a burger place also serves chicken teryaki, you take a gamble.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "Frozen in the 80s blue-collar era of this city now all but disappeared, this place is no nonsense and the real deal.  As I type this review my keyboard is starting to glisten with the glow of french fry grease and twinkling salt.  \n\nOrder the junior burger with extra pickles, ketchup and mustard only.  Accompany that with a small order of  fries.  Sit outside at the bar and hum \"God Bless America\" as you gorge yourself.  \n\nPS - I ordered this today for lunch and my total came to $6.66.", "author": "marc d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "So I decided that on my way home through the Mission I would make like a tourist and pay a visit to Whiz Burgers. I've passed by here so many times... and thought - man this is just a good ole slice of Americana... it's like that famous film with Richard Dreyfus and almost on my doorstep. \n\nSo I ordered me a good old fashioned veggie burger, garlic fries (I have spent nearly 2 years in this country and not yet sampled garlic fries - I decided my cherry had to pop eventually on that delicious note) and a malted chocolate ice cream milkshake. \n\nVerdict? Well, the veggie burger was your average veggie burger and tasted like one too. The garlic fries, soggy and unsalted. The milkshake - tasted like it had banana in it. I am allergic to bananas by the way, so that is definitely not a route to my heart. I've also spent half the evening in discomfort and I can't decide from what part of my meal tonight. \n\nOverall - I am not a burger fan by any stretch of the mind. So it would take a miracle to wow me. For something quirky in the middle of a town center, Whiz burgers is fun as a novelty and a little randomness in a town full of such things. Worth going.. possibly after a few beers on a hot summer night.", "author": "Catriona C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-24", "description": "Oh it's good.. trust me. My first time here was when the crack heads next door to my building pulled the fire alarm - I decided to whiz on to Whiz Burger with my friends instead of waiting outside for no reason.  \n\nSince then, I've had the turkey burger and veggie burger ... all great!  I have a weakness for french fries so I never go without.  Their regular fries are a good intermediate between skinny fries and fat fries.  They also make seasoned cris-cut fries which are awesome.  \n\nAlways nice to take it togo with some beers and head to Dolores Park if you're tired of eating burritos in the Mission.  They also open late 9:45-10pm everyday.  Score!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "Good amount of fixins which is key to any good burger. They give you a mound of lettuce, tomato, and pickles. The only thing that bummed me out was that they put mayo on their burgers. Yuck. \nThe turkey burger was tasty albeit a bit dry and my buddy's mushroom burger was delectable....just a guess but she demolished it. I'd recommend the seasoned waffle fries...just like the cafeteria lady used to make em...crisp on the outside and soft on the inside...the way a perfect fry should be. \nTip: Take it to go as bums tend to pester you while you are busy stuffing your face on the picnic benches outside.", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "I had no idea...\n\nI walk by this place nearly every day to get to work and didn't really turn my nose up at it (goodness knows I'm not dive snob) but just never factored it in as a place to eat.\n\nBut holy moly -- that's a pretty decent burger.  Like a good diner burger.  And as most have said, it's definitely the best in the neighborhood.\n\nYelp encouraged me to go check it out and to that I say thank you, Yelp.", "author": "Johanna w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-18", "description": "I just wish that someone would take this place over and make the food edible.  Okay, it's edible, but just barely.  And I've tried it more than once because it is sooo stuck in time that I am drawn in, thinking \"Really, how bad could a burger and fries be?\"  Pretty bad apparently.  I will not be going back again until there is a big banner reading \"Under New Ownership\"", "author": "sarah b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-26", "description": "Ok seriously, the banana shakes here are amazing, and I'm a banana shake snob.  They use fresh bananas, which is the only proper way to do it!  YUM, YUM, YUM!\n\nThat's the only thing I can give it 5 stars for, as that's all I ever order there. .  .", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-08", "description": "Oh yes, I was starving today between lunch and dinner. How starving? I was running errands and had the urge to gnaw my own foot off. Luckily I drove th Whiz. The place looks like something from the past and I rolled up for a jr. burger and a strawberry shake. \n\nThe burger reminded me of one I had as a kid, so I am pleased. The shake was just OK, but I'll be back for the burgers and the fries I saw other customers chowing down on. Maybe I'll try the chocolate or the mango shake.\n\nPlus, how can ya hate a place with chili dogs?", "author": "Akasha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "I used to live literally 5 minutes away from this place, walking distance! \nso old school!! i love it... the food is also very good!", "author": "Monique S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-29", "description": "I always get what I know taste good and stick to that. At places like Whiz, you stray and you might end up paying the price. This place definitely has a tasty Turkey burger. I've had nothing else but I hear the tuna-melt is equally delicious? I've had a friend order the grilled cheese once, its basically a few slices of cheese and bread nuked...did not look appealing or even editable. \n\nI wouldn't recommend sitting down on the benches to eat your meal unless you like to be accosted by crackheads. Whiz is definitely \"the\" place if you need a quick burger fix on the way to somewhere else. It's a mom-pop burger joint and it delivers for what it is.", "author": "Richard K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "I love how these old burger stands are still around. They stand tall and might not reach the height of the golden arches but I take them over their ubiquitous counterparts. I like the one down the way from the stork in oakland also, but I like the burgers here better.\n\nI had the turkey burger ($4.53) and found that it made my gut very happy. Fries, however are standard fare. I especially like the signage that hangs over the place.", "author": "wayne s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-06", "description": "One of the longest-lasting greasy spoon drive-thru establishments in the Mission area. Great shakes, hamburgers, and fries... and a local clientele that proves that it has worth. If you become a regular customer, you'll meet all sorts of \"mission rats\" who frequent this place, and every one of them will have great stories to entertain you before they hit you p for change.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-09", "description": "On my way to one my favorite bars (see \"Truck\" review), I didn't think it was wise to have \"x\" amount of cocktails without eating.  I came upon \"Whiz\" burgers:  I looked at the menu and the price was right, the service was quick and the burger with all the fixings, filled me up nicely.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "I have lived here for almost 2yrs now, and this place caught my eye the 1st week I was in SF... and I had never been there until yesterday!\n\nThis place is so freaking good, it actually rivals my out-of-state affection for In&Out Burger.  I had a Whiz Burger w/out bacon, seasoned Waffle Fries with some amazing ranch on the side, and a tastetastic Banana Shake ---   \n\nEverything was just right & exactly what I needed at 9:30pm... toasted bun, fresh lettuce/tomato, and WAFFLE FRIES. I do love the animal meat, and this place serves it up real good.   If you haven't been here, do it now.  I mean, right now.\n\n(Fear not Veggies, they do have Veggie Burgers also.)", "author": "Jake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-12", "description": "Solid burgers, cool retro vibe. Deduct one star for something in my partner's burger that was bad, and another star for simply not kicking ass. No stars deducted or added for the loose bar stool that, while probably being a safety hazard, was actually quite good fun.\n\nSeasoned fries = must order.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-15", "description": "Exactly what I was hoping for.  Awesome burger, lots o fixins, melty cheese, toasted bun, squashed down and melded into one solid slab of deliciousness.  \n\nMinus one star because the fries were undercooked & kinda soggy, and the cheap-o brand ketchup packets were annoying.", "author": "Philip K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "I will admit first, I've had ocassions where my veggie burger was overcooked, but that was only one time. Every other time i've come here., the fries are perfect and so is my veggie burger!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "I think I have just consumed the greatest fresh banana shake ever, accompanied by a pretty good veggie burger (with cheddar) and crosscut fries. Fourth star for the shake, for sure.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "A very tasty burger. Makes me wish I was around when such drive-in style burger shops were common place. Awesome milkshakes as well.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "Whiz was something of a dinner staple of mine when I lived closer to this place.  Some might say it appears grungy, and you must sit outside (or take your food elsewhere), but it's also got ample parking and a unique building that gives it character.  Their fare is classic American diner food, and it doesn't disappoint, for the price especially.  If you just get a craving for grilled meat in a bun like I do from time to time, definitely check out THE whiz burger--two patties in a French roll, with avocado and bacon, for $6.75, little more with cheese.  Their shakes are also money.", "author": "Alan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-23", "description": "I like the place. The burgers are pretty much standard fast food /burger stand fair (frozen patties) but they are tasty and better than a fast food chain. On the other hand, its fun to go here and the fries are tasty.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-13", "description": "Eaten here a few times, never had a bad experience. Lots of picnic tables setup outside to eat at. The burger & fries were tasty. My girlfriend loves the ability to order Tang as an alternative to soda :)", "author": "illy m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "Whiz Burger is a great walk-up burger joint in the Mission.  I spied it while driving up S. Van Ness and made a mental note to visit on a weekend when a greasy burger is the preferred remedy for a hangover.\n\nAs to be expected, that day came sooner than later, and I found myself ordering a cheeseburger, Whiz Burger, waffle fries, and a hot dog.  Yeah, so what...I was hung over and grease does a body good (sometimes).  \n\nThese burgers harkened back to the good ol' days:  when guys put the same oil in their hair that they did in their V-8s.  Thick with nostalgia and calories, if Whiz Burger doesn't fix you up when you're feeling down for some comfort food...then I doubt anything will.  \n\nThis place isn't tidy and doesn't want to be either.  Sun beaten posters and food advertisements are taped everywhere you look, but the service is prompt.  You may have to share a table with a pigeon or two, but if you can find an outdoor greasy spoon without that kind of clientele, let me know.  \n\nGreat food for someone who had an, ahem, great weekend!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "I am constantly amazed as to how this old drive in has survived. Every time i pass it its like looking into the past. Now let me say that if your looking for the worlds best burger or some other culinary wonder its not here. However you do get a good cheap burger and fries at a great price. Also they have great milkshakes. Besides the food, its a cool place to look at.", "author": "paul a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-11", "description": "The food may be ok to mediocre but the owners (father and son) are miserable and nasty people.  See multiple reviews on the towing of customers from their lot. Save your money for better food and kinder people.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "Best banana shake ever AND they take debit cards when it seems like many places are moving to cash only.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "This place reminds me of Beep's Burgers, but run by Mexicans. In my hood, so it's immediately a win.\n\nYet another place I wish I could eat everyday and die happy.", "author": "Alexis C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-26", "description": "I had a hot dog here once. It came cut lengthwise with pickles and tomato. They might as well have  put sprouts on that shit. The burger's were pretty worthless as well. There's a lot on the menu so maybe there's a winner up there but I'm done trying to find it. Whiz gets half a star for milkshakes and a half  a star for that pang of nostalgia it evokes in a small town boys heart.", "author": "Mingus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-12", "description": "Wildwood tofu burgers as the standard veggie burger is an A+ choice.  The \"Seasoned Fries\" are waffle fries, the normal fries are thick, and the garlic fries are better left un-ordered.  I very much enjoy Whiz Burger and would subscribe to their newsletter.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-10-19", "description": "I have always been tempted to stop and try the Italian burrito. What could an Italian burrito possibly consist of? I'm completely baffled.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-31", "description": "I love Whiz Burger. Do not come here for gourmet. Come here because the burgers are solid, the fries are crisp, and the urge commands. They even have a parking lot, so bring your disastrous carbon footprint.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-07-04", "description": "Good in that ... bad sort of way. Try the waffle fries!", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-17", "description": "I really like Diet Coke. Especially when it's $1.39 for a cup that's billed as small but is really medium and is served with lots of ice. Therefore, I really like Whiz Burgers.", "author": "Mairead J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-08", "description": "I love Whiz Burger. The vegie burgers are good especially with grilled onions. The fries and onion rings are usually good although occasionally they overcook them, but that doesn't happen often. They always get my order correct, which I truly appreciate. And they have a parking lot. What's not to love?", "author": "Wan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-08", "description": "Good greasy food.  If you love your arteries then stay away from the Philly Cheesesteak.", "author": "Sas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "This place may not look like much on the outside but it's still a treasure. Great food and fast too. I always enjoy going over there to grab a quick burger and shake or soda. The employees are friendly and willing to explain what goes on each type of burger. One of these days I'm going to have to try their veggie burger.", "author": "Todd H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-17", "description": "our neighbor sherman used to own whiz burger until he died in the early 90s.  the first time i ever saw this place was maybe around 1987 when my dad left me in the car on 18th st. to go do something shady im sure.\n\nthe key things that differentiate a whiz burger are the long soft-roll like bun, and automatic bacon and avacado.  whiz burger i would classify as a 2nd tier chinese hamburger, i dont normally compare chinese hamburgers in the same class of food-item as regular hamburgers such as 1st tier burgers like pearls burgers and joe's cable car or 2nd tier burgers like zeitgeist, barneys and big mouth burgers.", "author": "christopher a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-13", "description": "personally, i think whiz burger has the best veggie burger in the city.  it comes with all the fixin's and it's a wildwood tofu burger which is the cream of the crop as far as veggie burgers are concerned.  they put lots of pickles on your veggie burger which i like and it's best with cheese and avocado.  one thing is that they don't put ketchup on your burger, you have to add that yourself. and, if you get it to go on a regular basis you'll end up with a drawer full of ketchup packets.\n\nyou have to get a shake if you go!  they're all good but the fresh banana shake is the best.\n\ni would give whiz 5 stars but sometimes their french fries are less than stellar.  usually i think they are good and crispy but every now and then i get a bad batch.", "author": "Kristie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-26", "description": "yum! the veggie burger is surprisingly filling and delicious. \nthey have a lot of drink choices and really greasy fries. \nwatch out for the crackheads around the corner.", "author": "Oleya P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-31", "description": "The Whiz Burger (burger with lots of mayo, bacon, avocado, and other forms of animal and vegetable fat) is served on a french roll.  It's retardedly delicious.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-11", "description": "I like to issue fatwa's with Shaketada al Fryphy at the Church of Whizzlam.  Screw 40 virgins, just give me a banana shake and a whiz burger with a small order of fries.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-05", "description": "I sat on the bench eating my veggie Burger thinking I was in Fullerton and not on s. van ness street . burger was great and way more interesting than boca or garden variety that EVERYONE uses which is very very boring! The criss-cut/waffle fries  were great and greezy and the root beer fuzzy like I like it- great 2pm breakfast  on a sat.", "author": "A. Gun n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "Ahhh Whiz Burger, definitely a destination spot for my wife and I on a Sunday afernoon. My wife gets the whiz Burger and I always opt for the veggie burger with fries. You hear the term \"old school\" over and over when people describe this place. I'll agree, the ambiance and old -never refurbished chairs and counter tops give you the old school feel, but its more like a run down memory of the way things used to be. I like the food but I think the name WHIZ burger is very appropriate as we almost always smell urine while we are eating. Its fun to go on a Sunday afternoon because the church across the street lets out around 1pm and you can spot some really awful church outfits. You have to love a church with a hotdog vendor outside! All in all, Whizburger is a great place to soak up Saturday nights hangover and move on quickly before the smell of piss ruins your appetite.", "author": "Go Cat Go G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-22", "description": "Pretty damn pricey for a grease shack.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "it's another \"WTF? I haven't reviewed Whiz Burgers?! How could that be?\" After all, the irresistible Whiz Burger (served on a french roll, with bacon AND avocado and the usual burger makings, then neatly wrapped and cut in half even though gluttons like me will just consume the whole thing in one sitting). the cross cut fries are crispety crunchety good, so are the shake offerings (hmmmmm... mango shake) AND they have corn dogs. There was a time that I craved WB but got dissuaded by my friends and went to a vegan place instead. THAT was a mistake. I was depressed for days, only to be cured by the tasty goodness housed on the corner that WB occupies.", "author": "ray e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-16", "description": "whiz burger is a decent if i'm looking for a cheap lunch place to satify that carving for a burger or hot link with fries & washing it down with a shake.  the burgers are overall decent nothing to majorly rave about.  the hot link sandwich is pretty good, sliced in half down the middle served on a seeded roll with the standard fixins.  the fries are pretty good when they are hot.  the milk shakes are the best though.\n\nnot a bad place to pick up a quick bite to eat or just craving greasy spoon burger.  the prices are pretty reasonable for what you are getting.  parking is available either on the street on in their parking lot.  they only accept cash.", "author": "larry s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-18", "description": "i love shredded lettuce.\nthis place has it.\ndon't sit at the tables. this should seem obvious as they are a free for all to anyone on s. van ness and 17th.. but hey, whatever.\n\n**i'm a veg so it's all i've had there and it's good.", "author": "A S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "The veggie burgers are vegan, so long as you specify NO MAYO (they use the Wildwood burgers, which are my favorite), and they use the delicious pickles, the sour ones, not the weird sweet ones. The garlic fries, I'm told, are made without butter, and are also vegan and slathered in a ridiculously amazing amount of garlic. They are also *crispy* on the outside just the way I like them. The only complaint I have is that the fries get cold kind of quickly.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-26", "description": "Really good shake, mediocre burger. Great if you want to get full & eat outside; bad if you want a really good burger.\n\nHave to say, I was disappointed. My burger was dry and took about 10 minutes to make without anybody in line. All the parts seemed fresh & freshly made, but they never came together. For the price & the wait, I should be getting something better than what I can find at a carnival.\n\nI was hoping for a mission version of Berkeley's smokehouse or Sam's on broadway.", "author": "Floyd L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-29", "description": "This place is hella good. And if you don't like it, you can just get the hell out.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-26", "description": "the cross-cut fries are yummy here, as are the shakes (last time i was there, i had them make me a banana-chocolate mix).  \n\nthe veggie burgers are just so-so, though.  \n\nthis place is fine for a quickie grease-fest, but definitely not the best.", "author": "Elle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Great turkey burgers and fries.  And that seems to be the only thing I ever order, so I can't really speak for the other 50 things on the menu.", "author": "Antichris E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-01", "description": "A co-worker of mine recommended this place last week, so I walked there from work on Friday to check it out. I had a hot dog and a banana shake. The hot dog was par for a hot dog, but the banana shake was killer! I might have go go back for another one of those sometime soon... YUMMMMMMMYYYYYYYYYYYY!!!", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-03", "description": "Since this place is a hop and a skip from my condo, i had to try it. My roommate told me to not to try it since its in the mission district and on the corner where all the crazy people hang late at night. That didn't stop me from trying the place out and i'm happy i did! OMG they have Garlic fries! Not the powder mixture but real garlic and parsley garlic fries. My love for garlic fries is beyond anything, anywhere they sell garlic fries I'm there! Their burgers are good as hell, its not your regular shaped burgers but I don't expect everything to be normal in the mission. The Whiz Burger is my absolute favorite, why? It has bacon and avocado without paying the extra price to add them on. Their quick, sometimes friendly and that's why you'll see me here grabing a bite to eat.", "author": "Lucky M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-04", "description": "Chicken melt was average and the fries were average but I love the ambiance of a real outdoor diner.  I'm yet to try a real chicken sandwich or burger.  I'll come back.", "author": "Ankur P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "This place is great! The burgers are tasty! Shakes are great also. I've never had a negative experience there.", "author": "J M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-15", "description": "the memories will bring me back there when i find myself in the mission again.  we started walking by and just picking up fries (they were good) till we decided we were ready to venture into their other food.  the veggie burgers are good especially with avocado!  you can eat on the bar with stools spaced too far apart to sit close enough to your sweetie.  we parked and ate in a u-haul once and watched a guy pour a bucket of lard into a hole in the ground in the parking lot.\ngo for the experience and partly for the food.", "author": "Monk R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-16", "description": "Food is solid. the milkshakes are yum. it's fun to get food and sit outside on a nice day.", "author": "Veena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-29", "description": "don't be afraid - it's actually clean in there. i promise.\n\nthe burger was solid. my copilot said it was indeed a very good veggie burger. the seasoned waffle-cut fries were yum. and the banana shake is TO DIE FOR.\n\nbetter burger than burgermeister, though i did like slider's better.", "author": "Clover Dan .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-06", "description": "I call my orders in, and then pick them up. They have on site parking, which is rare and awesome. I love their veggie burger with avocado- it's probably deep fried or something, because it's so much better than the one i make at home.  Their fries are amazing, I crave them on a regular basis, as do the people I work with- it's pretty much a weeky thing. Reasonably priced, quick and convenient.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "Yum.  Damn fine burgers, fries and shakes.  Not the best in SF, but the best in the neighborhood with a gigantic 60's-era signage.", "author": "Kimbro B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-15", "description": "love this place! they saved my horrible hangover from that damn love holiday with the best cheeseburger I have ever had. The bun was a little toasty and the toppings delicious!", "author": "Susan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "The Whiz... Best drive-up 50's style burger joint in the city!  They have a unique veggie burger, but I always go for the Whiz Burger, criss-cut fries, and a root beer freeze (it's like a root beer milkshake).  Being at 18th and SVN don't be alarmed if you find yourself amongst crackheads, junkies, and hookers.", "author": "Josiah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-23", "description": "I've heard a lot of rumors as to the vegan or non veganess of this place but ill trust Josh on this one.  If you've got a hangover or just a hankering and the only cure is greasy american fast food, this place will do you right.  Once I saw Tragedy eat here.", "author": "Britton R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-28", "description": "I didn't care much for the burgers, but MMMMM fantastic strawberry shakes and criss-cut fries so close to home. It doesn't get much better...", "author": "Natalia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "so, basically 95% of my friends live within a 10-block radius of whiz burger, while i live in the cuts of the richmond, so i spend a lot of time driving back and forth across the city, making eating sometimes precarious...\n\nbut wait! have no fear, whiz burger to the rescue! seeing that it was still open and i hadn't eaten in a while (making me cranky like woah), i pulled into their parking lot (yay! not everyone is a hipster on a bike!) and was thrilled to see that they had chicken, turkey and veggie burgers all as menu items! i have not eaten red meat since i was a kid, and i don't plan to start anytime soon, so this was a good bonus. and their fries are so yum! i had them in my car when i picked up a friend, and we both could not stop eating them. they are well-seasoned and just crispy enough to not be gross and soggy. i also had a turkey burger which was a little over-cooked but still good and really this is a totally legit quick-bite.\n\nand having had their fries, i'm really grateful i don't live closer...", "author": "Elizabeth O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-11", "description": "the veggie burger was squishy & fell apart. requesting mushrooms on top took a little too long to explain. way overpriced. sigh.", "author": "Jade P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-24", "description": "i'm a sucker for drive in's, but whiz burgers is nowhere in the same category as beeps out in ingleside.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-18", "description": "the best banana milkshake i've experienced.", "author": "hilary w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-11", "description": "The best veggie burger in the whole world! I am not kidding.  I wish there were more whiz burgers all across the world.", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "best burger I've ever had. Meat is not the best quality but it is a PERFECTLY constructed burger, every time. What else is there to say? 5 stars.", "author": "blimp w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-05", "description": "Great Burgers, waffle fries and last but not least the banana shakes. Definitely worth checking out.", "author": "Patty G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-22", "description": "the place has burgers, fries, grilled cheese sammitches and friggin TERIYAKI bowls c'mon people what more do you want when it's late night and you fell off the wagon in the Mission ha", "author": "Lolo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "Mmm. the veggie burgers are so good because they are deep fried in the same oil as the meat. They are also made of tofu instead of oats and crap. Also, the thin McDonalds-type fries are tasty. It's kind of expensive, though, for a place that serves fries in a paper bag, but hey, free parking!", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "got a sandwich of some kind here and took this little video of one of my favorite signs in the city.  how can you not love Whiz Burger. old school all the way.  the guy was nice and didn't catch me doing the video...", "author": "Veronica V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "The milkshakes rock! And they are cheaper here than at the diners around town.  I may develop a habit, and a spare tire made of milkshakes.", "author": "C G."}
