{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "This has become one of my favorite bars in San Francisco. I love, love, love the decor and the environment. I absolutely enjoy the atmosphere and the backyard garden is wonderful if you're on a date. The drinks are reasonably priced and the bartender was very nice. I had a great time here and cannot wait to return.", "author": "Dawson M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Came here during pride weekend and had a great time!  The bar has a wonderful funky vibe inside, and I felt pretty welcome there immediately.  As soon as we walked in a table of ladies were sitting at one of the tables near the entrance, the immediately engaged myself and my family in some light hearted ribbing.\n\nThe bartenders were all nice and the drink prices were good.  We didn't sit on the patio, which is apparently very nice, because we didn't realize until we were leaving that there is a second area other than the spot you can see right from the door.\n\nAlthough this is a \"lesbian bar\" it also has a neighborhood bar vibe to it as well.  I saw plenty of straight couples there in addition to the LGBT patrons.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "Last night was the second and LAST time stepping foot into Wild Side West, the treatment that my friends, fiancé and I received from the female Caucasian bartender was nothing short of discriminatory, rude, and borderline racist. We left the bar with sentiments of humiliation, embarrassment, and complete disappointment.\nFirst, I'd like to point out that, as a member of the LGBT community, for a lesbian bar that has been around for years, screaming liberation on their walls in a sanctuary city and has a big sign that welcomes all race, age, gender, religion etc. the bartender's actions last night spoke exactly the opposite of what a lesbian bar in San Francisco is supposed to represent however, by the other reviews I've read, I might not have been the only one that has had an unforgettable experience. \nMy Fiancé and I came in for a couple of drinks last night and to play pool, (her grandparents/family have been living in the Bernal Heights neighborhood for decades) we hung out waiting for our turn for the pool table and a couple of friends; from the start the bartender wasn't entirely friendly (ok no big deal, maybe she's having a bad night). I was at the bar ordering my second drink by the time our friends arrived, the moment they walked in she was watching them waiting for her chance to check ID's, of course that's your job; do that. I've just never seen any bartender so eager to check someone's ID before (from that point on the bartender started to get very agitated, one of the ID's happened to be a passport because my friend is from Guatemala). My fiancé was at the pool table getting ready for our game of pool when the bartender asked what they wanted to drink and the designated driver politely said he was just going to be playing pool and his boyfriend was good for the moment and still deciding, then she says extremely rude \"IT'S A BAR GUYS YOU GOTTA ORDER DRINKS OR YOU GOTTA GO\" ok, so at that point I gave my 2nd drink that I just BOUGHT to my friend that's not driving so that issue was solved. We were going to play our game of pool that we just PAID FOR and leave because in all of my years of going to bars with friends and one person out of the group isn't drinking because we're trying to get home SAFE and the other hasn't decided what he wanted yet, NEVER has it been a big deal. She kept harassing us saying \"IT'S A BAR GUYS\" yeah, clearly we know where we came? So, I asked her \"Why is it a huge issue? We bought drinks except one person that's driving? And we're paying to play pool?\" and with no logical or reasonable explanation she said \"If you don't like it then you can all leave!\" Even the other people at the bar stared and seemed a little uncomfortable. I was very shocked to be treated this way, the bartender kept staring us down to see if we were leaving then came from behind the bar to the pool table to tell us a 2nd time that if we weren't buying anything then we must leave even though I just bought a drink from her and gave it to my friend, does it matter who bought it? We skipped out on our pool game and left. At this point it's clear we were not welcome and it just so happens we were the only people of color in the bar that were not accompanied by a white person and the only people that were getting approached like this, it was humiliating, dehumanizing, discriminating, and flat out wrong. People come to this city to get away from inequality issues, not to get treated like this, it shouldn't be ok anywhere but we wouldn't have expected this type of service at a lesbian bar. There are still gaps to be filled within the LGBT community itself and experiences like these make it so much harder for people to come together in a time when the world is so full of hate and divide. To the owner of Wild Side West (god forbid if that bartender was the owner) make sure you have bartenders representing what you preach on your walls because this is so much more than just a bar for some people, it could be a haven but disappointingly enough there is no safe space here for people of color.", "author": "Angelica V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Wild Side West is a one of a kind dive in SF. As one of the last (and oldest) lesbian locales in the city, it has a special kind of charm and magic that really make queers like me feel at home. \n\nMy girlfriend and I came by on a Tuesday evening just looking for a beer before grabbing dinner. We sat at the bar and were served promptly by a friendly bartender. \n\nThey have pretty basic beers on tap (Guinness, Anchor Steam and the like) as well as some well distributed crafts like Deschutes Fresh Squeezed and a rotating Fort Point. They've got a full bar and cans / bottles as well, plus chips if you're needing something to tide your tummy over. \n\nThe real magic of this place is the whimsical decor, welcoming atmosphere and the lovely mix of humans (I especially enjoy how many older lesbians frequent the place!). The back patio / secret garden is an absolutely magical setting that will have you questioning whether you're really in the middle of a metropolitan city. You really have to experience it for yourself. \n\nLike I said, I love that this is an absolutely welcoming dive -- sometimes you want to play a round of pool or just drink a cheap beer at the bar and stare at a TV without having to listen to drunken male conversation or worry about watching your back as a queer woman. Wild Side West provides that opportunity. \n\nI am concerned with the recent bad experiences with bartenders I've read from other Yelpers -- I'm glad I got lucky on a good day but I really hope management at Wild Side will take those to heart and weed out / correct any misogynistic or overtly, unnecessarily rude behavior from their staff.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-26", "description": "My partner and I were in search of a lesbian bar and were pleasantly surprised to find this hidden gem. Walked in and fell in love immediately. The decor is historic, cozy, and fun. The clientele the night we went in was predominantly female/lesbian which was nice and awesome. \n\nHOWEVER...never in my life have I ever experienced such rude and horrible service (I live in Las Vegas). The male bartender was unwelcome and blatntly rude. My gf and I sat at the bar and literally every person he served asked him what was wrong and apologized to HIM. He ignored everyone. \n\nI get we all have bad days but I still think it was inexcusable. It's a shame because we loved everything else about this bar.", "author": "Vanessa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "Good place to come for late night drinks at a neighborhood dive eclectic bar. Cash only I believe.", "author": "TJ S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "If you are racist, hipster, techie and/or anything in that nature.... This bar is for you.... As a Born and raised mission native, I treat anyone that is visiting or moving to this city with pure kindness... These bartender's are completely disgusting!!!! I understand that when going to a bar you must buy drinks (duh!) All five of my friends ordered drinks except for me. The bitch bartender told me to leave since I wasn't ordering anything drinks??? I put my pride aside and explained to her that 1. I was going to be the driver, and 2. I have type 1 diabetes and don't drink. The snobby bitch had the nerve to tell me I should go to a bar that better suits me!?! I then got really pissed yelled all type of shit and then got kicked out...", "author": "Alley K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-26", "description": "Please do not give your business to this bar. I had the most upsetting experience I've ever had at a bar in my life at Wild Side West.  The bartender told me and my friend that we could not be in the bar because we \"looked young.\" I am 28 years old, and when I tried to show him my California Drivers license he would not look at the ID. He refused to serve us and continued to ask us to leave. Discrimination against two women who appear young is completely disgusting and wrong. I will never come back to this bar again.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-03", "description": "I was super excited to come to my first lesbian bar here in the city. My experience sucked. I just moved here. I have my Texas id and it was bent from use. I didn't get served and when I asked if they could scan my id i was told no. I'm 33 and have bartended at lgbt bars for the past 7 years. I was hoping to feel welcome in a city that is known for welcoming us and instead I ended up walking for an hour trying not to be to upset from my whole day and then the ending.", "author": "Ekta K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "What a cool little spot! A few friends and I were looking for a bar and needed: outside patio, full bar and most importantly, open. And we found a real winner with Wild Side West-\n\nThe bar is what you would expect of a true neighborhood local- a bit \"loved\" on the inside but a spot where everyone is friendly and the drink pours are hearty. \n\nThe best part about this bar in my opinion is that it's dog friendly and that there's a massive back garden area where you can sit and hang out. It feels like you're having a drink in a secret garden or something, and you can tell from the groups of people hanging out that everyone is friends.", "author": "Elliott W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Love Wild Side.  Great neighborhood bar.  5 stars for fab bar and first bar I've seen with paper straws!!!!", "author": "Barbara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Loved the dark-haired, tattooed bartender who gave the history of the bar, owners, and activities that occur.  The outside patio and garden removes you from the city and places you in this intimate area to just hangout.  The uniquely decorated garden has a lot of random stuff, for example, there are plastic, ceramic, stone, or metal legs placed throughout.  This is also the most (or last) lgbt female-friendly bar in SF and is very welcoming to guys and straight people.\n\nThis is the coolest dive bar, hidden in Bernal Heights, that I've ever been to and the drinks and locals are just really pleasant and laid back!", "author": "Mee-Jin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "This is a great lesbian and Bernal local bar! Check your attitude at the door and you'll have a great time. Cash only.", "author": "Amaris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "Great little friendly dive bar. Fantastic vibe, but when I ordered my Guinness they did it all in one pour. Anyone behind a bar that serves Guinness should know how to properly pour the stout.", "author": "David A R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-30", "description": "A cool place to visit from a historical perspective but nothing else appealed to me. It was a bit out of the way but we made the trek via uber without any issues. It's a place you can sit and have drinks and although there is a small dance floor and DJ there were not many people dancing. The decor is eclectic and interesting. \nI guess it depends what you are looking for. If you are looking for dancing or finding someone to potentially date this probably is not the place. But if you want to relax with friends in a bar this could work.", "author": "Alison H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-07", "description": "I've been coming to Wild Side West for about 6 or 7 years and I am deeply sadden by last night (possibly racist, but certainly disappointing) experience. I've happen to only come here with white people in the past and never had any issues. Last night was different. \n\nAfter a queer girl party @ El Rio, I wanted to take my friends (who happen to be black) to the first place myself and my girlfriend went on a date 2 years ago. Having just stopped for ice cream (we weren't drunk) I thought a sip in their garden would be magical. \n\nWhen we first approached the door, I asked the young woman with the shaved head and piercings if the backyard was still open. \"Oh yeah, of course\" she waved me off. I said \"Yes, but I know it closes at 10p, right?\" Looking down at my watch I saw it was about ten to 9p. \"It'll close at 10ish/10:30p tonight\" is what she said. \n\nHaving confirmed the garden was open, I ushered myself and 4 friends inside, excited. \n\nMy friends have never been there before, so before we ordered drinks I wanted to secure my favorite spot in the garden. We walked downstairs, and after checking a few nooks, we found a spot. As we are putting our things away and getting settled, the same person from the door approaches us. \n\n\"My manager sent me. You have to buy drinks if you want to be here\" \n\nNo problem really, but it was a bit creepy, seeing as we were tucked in this fold and she came right to us. I told her as much. \n\n\"Yes, there are cameras everywhere. She's watching me right now.\" \n\nUH OK SUPER CREEPS. We all started to look around in the trees. I had never seen a camera there, ever. But I understand you have to buy drinks to kick it. We send a couple of friends to buy drinks so we can hold down the spot. \n\nAfter they get back with rounds, my friends try to teach me how to play rummy using a deck of cards. About 15 minutes after we get our drinks, the same girl approaches us: \n\n\"My manager is upstairs and says it's too loud. I have to close the garden. I've opened the deck for you though\" \n\nSurprised I say \" I thought that the garden didn't close until 10p? It's 9:40p\" \n\nDoor person (and bartender) says: \"Bar time is different\" as she is walking away. \n\nNow, what in the BLAZES does that mean? \n\nThe vibe was: black voices carry, and we don't want to hear yours. \n\nConfused, we gather our things. \n\nThinking that maybe she hadn't accounted for daylight savings time, I mention that she said the back wouldn't close until \"10ish\" and that it's only 9:40p. I also mention I've been coming here for about 6 years and the garden has always closed at 10p, quiet hours. \n\nPerhaps the door person/bartender was trying to be cool with us, but it just came off as condescending to be called \"boo\" (equivalent to \"sweetie\") as she dodged the question and said they are working on getting a permit to allow the garden to remain open all night. \n\n\"We have to keep the neighbors happy\" said door person/bartender. \n\n\"Yes, but the garden is always open until 10p, the time you told me walking up\". She said nothing. \n\nMy friends and I tried to make it work on the patio, but the magic of the garden was lost. We left in silence, and I was embarrassed to have taken my friends to one of the last \"lesbian bars\" in SF. \n\nWild Side West: although there aren't many black folks in SF, we are still here. I was hoping that it was okay to be black, queer, and have a good time within your bar, but it didn't feel safe at all, and pretty much we weren't left alone the whole time we were there. I guess El Rio it is from now on. \n\nI still have all the loving memories, including the first date with my girlfriend (who happens to be white) 2 years ago and I suppose those will have to suffice.", "author": "Mercedes G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "So reading a lot of peoples bad reviews on this bar is pretty sad. For one, this bar has been here for years as well as a ton of good people. INCLUDING all the bartenders. \nThe first time I came to this bar, the girl with the shaved head &piercings was such a sweetheart to me. I ordered my drink &decided to start up a conversation with her. Didn't have any problems. \n\nCan't really understand why some people on these reviews I'm reading are calling her a racist &condescending? I never really got that impression, so I'm a bit confused. She, nor any of the bartenders I've had really gave me that vibe. \n\nI was told that they had a garden &patio so I went to check it out. She said they close it at 10, so I said \"Ok, cool just let me know when it's time.\" It was absolutely beautiful. After being down there for about half an hour, the bartender told me that she'd be closing up the garden soon because there wasn't a lot of people going down there anyways. She explained that they were working on Bar Time which I can understand being that it was busier in the bar than in the backyard that night. But she said I could finish my cigarette up on the patio &that it would be open for a while, at least until people start being loud, then they'll have to close up to respect the neighbors.\n\n Totally understood. She kept checking up on me to see if I was having a good time &see if I needed another drink, so that was pretty cool. I got really good vibes from this bar, so far, haven't had a bad night here. \nBeen coming here for a while now.\n\nIn all honesty, some reviews, I think, is a defamation of character on these bartenders. Don't assume that because they call you dollface, hun, boo, that it's condescending. Some people just talk like that. I didn't mind it, but if you're insecure about someone calling you that, speak up &let them know.  \nPlease be considerate of people coming or working at this bar. Everyone deals with a lot of shit everyday, so don't take every little thing your bartender or people around you say, up the ass. You probably just had a bad day, don't make it harder on people at the bar trying to have a good night. You guys are taking these reviews too personally. All bartenders, no matter what bar you go to, go through a lot of bullshit throughout their day of dealing with drunks. They call it Bar Time for a reason. \n\nSo far, I've met so many awesome people here, so if it's your first time, or you've been there forever, spark up conversation with people! This is the best place to make new friends or acquaintances!! If you get here early, enjoy the garden before it gets dark out!!! \n\nThey also play basketball, baseball, &football on the TV's. I've gotten food delivered to me there as well. Pretty awsome bar to chill at &unwind after work. Thank you Wild Side for your services!! Hope you all enjoy!!!! Also, thank you lady piercings on the customer service!", "author": "Noreen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "What makes a bar special are the people and the top person on my list is Tina. She is the type of bartender that knows your name, remembers your drink and goes out of her way to make your experience golden. If I'm having a rough day, I pass by and see who's behind the bar--if it's Tina, I stop in and know I'm going to have my spirits lifted. \n\nOverall, WSW is a great place. I love all of the different environments of the decks and yard. It's fun to bring out-of-towners for drinks because of its uniqueness. The little shoes with shrubs, the pool table, and the warm and friendly atmosphere. \n\nThanks, Tina and everyone for doing a great job!", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "Cash only!\n\nGreat neighborhood bar, decent craft beer selection and they have a pool table. So bonus for that. \n\nI heard the outside area is pretty nice too, but I didn't see it since it was too cold for me.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Cool, very casual bar with lots of local girls. The bar is pet friendly. Would recommend to women who like their ladies rugged and casual!", "author": "Christina F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-19", "description": "Love the ambiance! However..I came here the other night for the 3rd time (every other time was great). I ordered a dirty Shirley but the bartender was an entitled asshole who refused to make my drink. She replied to my order with a, \"really? It's so bad for you though..\" And then called over another bartender to make it for me. I order bitch drinks all the time and have never had someone react that way. 1. Thanks for making me feel stupid. 2. Don't be a bartender if you can't handle making \"annoying\" drinks. 3. Alcohol in general is bad for you... \nThe bartender was a female with black hair shaved on the sides and face piercings. She should be fired IMMEDIATELY lol", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "This place really sucks when it comes to sports. Don't come here if you want to watch sports or anything other than the crappy movies they put on. The bar staff is really un-welcoming, unless your a regular. The bartenders here are the worst! Surprised they've been around for so long. Don't let people like this get away with terrible customer service, and an unwelcoming attitude. Email: info@wildsidewest.com and let the owner know what's up.", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "Nice place for a drink. It was pretty quiet when we were there. Very stormy out and I think that kept the crowds away. Friendly bartender and other \"ladies\" there for a Saturday drinkie. Strong  well priced (cheap) drinks. Love all the liberal shit posted up everywhere on the walls. I felt right at home. Only 4 stars because two reasons.. the place I sat, at the front hook of the bar, reminded me of a person that hadn't showered in weeks..a little like piss, and old spilled liquor. It was kinda gross and I could've happily just moved but we were only there to check it out and head out for a live music show. The other reason is the location is sort of out of the way, and there aren't a lot of other places to stumble around too. But catch a quick LYFT and you're all set.", "author": "Nicole O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Oh Dear Wild Side, you're forever loved and cherished despite your sour smell, trashed garden and underwhelming spirit selection. Bartenders are solid. Homoriffic history is upheld in upmost honor. I'll go again soon accepting all that you are.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-10", "description": "Wanted to love because there are so few  \"safe spaces\" for queer girls nowadays. However it was cold as ice walking in, and I am not talking temperature. Barely had a greeting from the bartender and all of the fellow guests were glaring at us from go. The drinks were decent priced but the staff was so rude. To top it off a clearly drunk \"regular\" got in my spouse's face about something ridiculous and completely unwarranted. SHE was lucky we weren't in the mood to make a bigger scene because it was all quite childish and insane and the bartender then took her side. If you could take a tip back, we would have. Then she continued to ignore us, never said goodbye or thank you. They were also clearly serving underage kids who were playing pool. What a disappointment. Never coming back.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "My people! Love the garden. Love the crowd! Love the pool table!\n\nLOVE LOVE LOVE\n\ndon't come here if you're part of the new gut remodel love bugs, this ain't the place.\nHere, we like things with a vintage touch. We value history. We love our City by the Bay and Wild Side West is a HUGE PART OF S.F. History.", "author": "shanestar h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Best fuckin bar on Cortland, hands down! The bartenders are ALL very cool, the pours are heavy handed, great outdoor patio, and old movies always playing on the tv. It is rumored that the pool table used to belong to Janis Joplin. There's a piano against the wall, and very interesting nudes hanging above it. It's where I learned how to play piano by ear for the 1st time.\n\nThis bar will always have a special place in my heart. I always meet great friends and interesting characters here. May you never go away. We await the return of Mr. Nancy from her surgery. Gotta love that salty gal! If you have an issue with the sometimes surly old gal bartenders here you don't get the joke, you're overly sensitive, or you are the joke. lol I hear this about my favorite bars all over town, and ya know what? It's not them. IT'S YOU. Grow roots elsewhere. We are from here, and we ain't goin anywhere, transplants!\n\nFind a Marina douche suck up bar that will cater to your fragile needy ass. Ya wanna stiff drink, be left alone, or socialize with the quirkiest, arty, locals than do. If ya don't like them, WE DON'T LIKE YOU.", "author": "Stella T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "Geessh.. talk about making you feel uncomfortable...The atmosphere is really cold and awkward.  When my girl and I walked in the door people looked at us from head to toe. If you aren't a usual/local person here don't come here. A girl playing pool bumped in to my girl didn't apologize ,more like gave her a look like she did something wrong. Of course she is a local here. Not a good atmosphere or vibe at all", "author": "Gabriela E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Came at night with the friendly Clark Kent bartender and the next day with the grouchy gal bartender. I don't need someone to beg to be my friend so it doesn't bother me when I don't get small talk . Clearly I like this place and I'm straight. I love the old movies playing on TV , I love the backyard , we were upstairs , I like the sun on me while I sip a Whiskey Sour. Really cool inside with a pool table and really cool outside upstairs and downstairs . Met friendly chatty locals . I'll be back.", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "I proudly bring out of town visitors to this bar because of its history and outdoor seating downstairs, EVERY TIME I HAVE GONE, the bartenders never give a warm welcome or smile.  The beer is cold and the atmosphere is great but the bartenders are not inviting at all.   One star for cold beer.  My guests felt like an inconvenience.", "author": "Valerie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "Honestly can't believe I have not already written a review about the Wild Side West. I've been coming here for years, as it is one of the great Bernal Bars. \n\nThe best part about this bar is the electic backyard, this really is a great beer garden with multiple areas for getting together groups of people. Backyard swings, gazebos, art everywhere and beautiful plants. On a sunny day, you can find me swinging on the bench sippin' beers or manhattans.\n\nAnd you know I'm having fun if I'm loading up the jukebox and singing like it's my party, because the vibe here is cool and comfortable like that. We come here to have fun, play pool, enjoy the sun and a couple cocktails. It's as Bernal as I am and I love that. ;)", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "Ole Wild Side. \nJust up the hill and nestled in the perfect neighborhood for its demographic. Unpretentious, divey, interesting, and lively. \nThis place has its share of regulars but they are never unwelcoming. The outdoor space is worth a visit on a nice day- sort of a beer garden feel. Lesbians do love their outdoor spaces.  =)\nMy only gripe would be with one consistently rude day time bartender. But hey! I guess everyone has their quirks! (Note to self: limit the small talk with said bartender.) \nThis little eclectic place gets somewhat busy on weekend nights, trivia nights, etc. It can sometimes be too tight for a group. But if you arent opposed to snuggling up next to the lovely ladies of Bernal Heights and company.. check out Wild Side!", "author": "Sydney S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-30", "description": "One star, for the cool backyard....that's it. Unless you've grown roots in this neighborhood bar, expect to be treated like dirt...um, no thank you that's what is outside. \nMaybe sometime during the week you might find a decent bartender there, but on a Saturday afternoon you may come across dragon lady. She is just plain rude and obviously miserable with her station in life. Here's a tip, don't ask for a glass of water because she'll just point to a plastic container at the back of the bar. Gross.\nChange is good, and when it comes to bars change tips well. I love the character of this place, but the service is so off putting I'd much rather pass and get a drink elsewhere.\nGo to Holy Water", "author": "Sneakrs 1."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "easy access.   the fab 24 line.  if you really need uber go elsewhere. bring your own chess set to the patio.   score a mojito on the way and sip it to a checkmate.", "author": "William S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "This is the greatest place that America has ever made. Everyone here is an old mean homo. And they are drunk. And there is a beautiful back garden. And there are androgynous women. And one of them wears a baseball hat which features a cartoon of bacon. Be mean to someone and have a drink, then you will be bffs. It is cheers for queers.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-26", "description": "I came in to break bills for some change and saw Janis Joplin on the wall so I decided to stay for a beer. During my brief visit I enjoyed the musical stylings of The Cure, The Kinks, and others.  Perfect soundtrack for a Saturday afternoon.\nMy visit was brief for a few reasons.  I got a super icey vibe from the bartender. Cash only so I had to break in to my emergency stash (mildly annoying).  And no food.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-27", "description": "Wild Side West is another dive bar we hit while I was in SF. This place was pretty dead, but then again it was a Tuesday night. There were a couple ladies playing pool and a couple of older gentlemen who seemed to be regulars at this eclectic bar. The decor at this place was crazy cool. I just wish it was happening like others had reviewed. \n\nThe lady working the bar was extremely nice and patient as we were indecisive and ended up only getting some soft drinks. I know I know, but we were looking to be able to catch up and ended up not drinking at all. Although we may have been cheap patrons we did have a great time laughing it up and trying to take pictures. I would like to come back on the weekend during my next trip out to the Bay area.", "author": "Gloria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "This is one of my favorite bars in sf, great friendly bartenders and great friendly crowd. ALot of times I've brought pizza to share with everyone.\n   They have alot of   great beers on tap an sure know how to make a great drink too.\nYOU definitly gotta check out the patio. Its nice and very unique.\nThe jukebox is one of my favorites in the bay, definitly a great david Bowie selection.\nDefinitly a great area, its a dive that I love diving into . Theres no sharks when you dive into this dive.  Mostly alot of great dolphins.   They really seem to rep all my favorite sports teams here too, yeeeeeeeeeah buddy!", "author": "Luke S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "I've been coming to this bar for years and I've always had nothing short of a great experience each time! Great bartenders and super cool atmosphere of decor and nature! Also serves as a nice quiet place to bring friends :D", "author": "Sally M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "A civic treasure, a place to drink & socialize in a unique setting with professional, well made drinks served with panache and style. The kitche decor and ambiance  engages the senses while you relax and unwind in this artistic & welcoming oasis in the City. I have been coming here for many years &  I never cease to be amazed by the beauty of the surroundings and of the people who work here and frequent this :  \"Only in San Francisco\" kind of bar.", "author": "Armando C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Everything you want in a funky neighborhood bar.  Friendly tenders, reasonable prices, banged up wooden floors, crazy eclectic decor all over the place, and a steady stream of folks who seem cooler than me, but not pretentiously cool, just \"I am sorry I am just cool\" cool.  Plus the backyard garden is awesome.  If you are strolling around in Bernal and need someplace to pop in for a drink or three, this is definitely the place.", "author": "Doron A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-28", "description": "The decor was cool, the bartender was a bitch. It was lonely and simple I expected more and better hospitality.", "author": "Mo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "what a fun bar for gays. I had a great time here meeting new people", "author": "Salima T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "Very divey kind of vibe.  You walk in, and it's dark and dank.  Then you find your way all the way to the back and discover a little oasis in the backyard.  Just a hodgepodge of benches and lawn chairs and outdoor furniture and swings surrounded by some random and nice landscaping.  \n\nAny place that has outdoor seating like this is good in my book.", "author": "Nina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "This is a little garden gem in the middle of a great neighborhood off of Cortland.  It is a perfect place to relax, have a drink or coffee, do a little work and enjoy being outside on a sunny day.", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "I was told many times before my arrival at Wild Side West that this is a lesbian bar. It was as if I was supposed to prepare for a public castration by a roomful of women dressed like the \"Girl with a Dragon Tattoo.\"  What I encountered here was quite the opposite. Maybe it was because it was relatively early for a Saturday, but the large majority of folks there were men. Everyone I encountered, whether friend or stranger, was straight. This retaught me the valuable lesson of never judging a book by its cover. I've been to many gay and lesbian bars in my day and the folks are some of the friendliest and welcoming I've known. \n\nI enjoyed a couple different refreshing draft beers while lounging around a large round table in the center. It was freezing cold outside and on the verge of raining, but you would have never known from the bar's the warm and cozy interior. They even had a nice little back patio.\n\nBernal Heights is one of my favorite little SF neighborhoods, so I can almost guarantee that I'll be back soon.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "Great outdoor area, pool table, and cheap drinks. Female bartender is always cold/rude.", "author": "Laurel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-04", "description": "Terrible \"service\" rudest staff I've ever encountered anywhere and I'm about as nice as a person can get.  Our whole group gave this place several chances, but left each time disgusted. We all walked across the street to the Lucky Horseshoe where the staff was impeccable, the owner drank with us, GREAT live music. Don't bother with Wild Side West unless you like overpriced, watered drinks, crap service, and the smell of moth balls.", "author": "Lorriane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "This is a place to be experienced, not to write about. But I guess this is Yelp and I should write SOMETHING. \n\nI stumbled upon Wild Side West as I was renting a place in the neighborhood and was just pleased as a plum with everything about it. It sort of had a weird smell and was terribly dingy, but that's the allure of the place! The drinks are cheap, the clientele is varied and you have all these tiny alcoves downstairs and out in the back where you can hide and make out with someone... if that's your prerogative. It wasn't mine...that night... but now I know ;)", "author": "Valentina V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "This has been the end of the line Friday nightcap for me and my wife for years.\n\nNothing fancy, just a fun western themed bar to relax have a drink a chat with your neighborhood friends.\n\nThe bartenders are friendly the crowd is a great mix and the drinks aren't too expensive.\n\nI'll be back again next week.", "author": "Sara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Yayyy for Heather and Rory. Anita too, her book is fabulous. Rory's antics are far too amusing to not return. Known John for quite some time and always good to see him working. Mike, ooh, aka Master Chef, provides the best of foods for all. Usually there's a Hot Dog steamer with wienies, veggie ones too, sometimes hot links. This is simply a downright neighborhood bar that knows how to treat and keep their patrons. There's a most peaceful backyard too, for all those who haven't one, to enjoy. Plenty of comfy seating for when you feel need to \"be on the sidelines\" awhile. Can pass on the moldy oldies TV shows LOL, crowd very caring and kind, makes up for that. Easy, safe parking in a good community oriented area.", "author": "Jean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "Great patio. Cheap drinks. Funky crowd. Come by on the trivia night and have a great time.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "New favorite bar! Great bartender, great drinks, good prices, and, oh, the patio!\n\nWent for my lady's work event, and we ended spending the entire afternoon there. Why leave when the Bloody Marys flow like wine and the music is so good (yay for iPod DJing)?\n\nReally fun and quirky bar. Way, way better than the Lexington. I wish it wasn't at the TOP of Bernal, but I guess it keeps the young riff raff out (would say that my girl and I were at the younger end of the patron spectrum). And hey, we burned off at least a drink's worth of calories walking our bikes up. \n\nPretty standard drinks and liquor offerings, FYI, and it's BYOFood, although I did enjoy a bag of Crunchy Cheetos because why not. \n\nSuper fun joint. I'll be back for sure.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-25", "description": "Love this place - yes it is a Lesbian bar, everyone is cool and would like to keep it that way. Certain bartenders are exceptionally cool and make a great cocktail.\n\nOne time I was in here with friends and 10 strippers came in to hang out and have a pow wow on the top back porch - wow great pow wow!!", "author": "Rew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "We were here Saturday night - Scavenger Hunt Pub Crawl - Nearly 20 of us.\n\nI regret that I forgot the name of the awesome bartender; Natalie? Something like that I believe. Either way - Awesome!\n\nThe bartender completely got behind our scavenger hunt and had a blast with us. We were a rowdy bunch having an amazing time, laughing our collective butts off and taking all kinds of pictures as part of the hunt.  \n\nThe patrons were crazy fun too. We were a big crowd and entering a bar was on par with flashmobbing it because we completely took over each establishment we visited. In this bar, everyone wanted to be part of the party.\n\nThere were arm wrestling matches, piggy back rides, group hugs, drink chugging contests... all with complete strangers! The patrons were totally on board and having a blast with us.\n\nThe drinks were good, the prices were more than fair, the atmosphere was 'neighborhood dive bar' (seriously, we all know that's the best kind, right?), and we had a truly memorable time.\n\nLoved this place.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "This place is AMAZING!! Great for a nice afternoon with a couple of friends or for a late drink and some pool. It is especially amazing because of the incredible backyard that has lots of private areas for you and your friends. \n\nBonus points: I left my makeup bag in the bathroom (promise I only had one cider) and a couple days later when I traced back my steps I realized it was at WSW. I called after work and no answer, no biggy I figure they can't hear it every time especially if it's busy. Anyway, I found them on facebook and shot them a message. They got back to me in less than 24 hours and told me they had found it and would keep it in a safe place! \n\nBottom line: this is an amazing bar, with a ton of history, great + cheap drinks, BEAUTIFUL backyard that makes me forget I live in San Francisco, and a very kind staff who don't steal your junk!!", "author": "Brooke W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "My girlfriend and I went here on a Saturday night expecting a lesbian bar and oddly when we walked in it was a massive sausage fest! We walked out immediately, very confused, questioning whether we went to the right place! We triple checked and we were definitely in the right place. I don't know if it was an off night of if it's more of mixed crowd or what, but I would never go back after having walked into that sausage factory!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "This place is a lot of fun. The barmaid Roary was especially charming, and made me feel very welcome there. I'll be back.", "author": "Bernal R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-11", "description": "I have been a bartender  in this town for over twenty years now, so I feel as though I have seen it all....but today I was getting my dog groomed so I had a few hours to kill and I wound up at Wild  Side West .We were served round after round of beers unopened! Not sure if she wanted us to take them to go or what ?\"No  \"thank you\" or facial recognition at all ! I got it ,that we are not salty regulars ,but  that's kinda  bullshit!.  Maybe accepting new people who are happy to tip and bring others \nwho might like this place... Only reason I am in this area getting my dog groomed here is cause my friend owns the butchery and I am trying to support local", "author": "Chris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-18", "description": "A bar with history and a backyard patio.  I find that many of the patrons are locals on the older side.  The drinks are OK, the atmosphere is divvy - and dirty all around.  Watch out for the mosquitoes in the back yard.\n\nAlso has 2 big TVs in the bar - a negative for me.", "author": "Spoon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "I freaking love this bar!!\n\nWent here for the first time about a couple months ago because my boyfriend works right down the block so one night we decided to grab a quick drink.\n\nIts very big and spacious.. they have a back patio and a huge back yard downstairs with tons of places to sit and very good for groups of people. They even have a little bbq area (that you can rent out) which is really cool.\n\nIf I did have one complaint... it would be about one of their female bar tenders was really rude. I'm not much of a drinker at all.. I'm usually the designated driver but when I do have a drink.. I enjoy having a Sex on the Beach because it's not to strong. So when I went and ordered one she gave me this horrible look and rolled her eyes at me.. I was so confused I even had to ask my boyfriend like \"did she just roll her eyes at me\" .. It kind of rubbed me the wrong way but I didn't let it ruin my night I just figured that she just cut her tip in half.\n\nBesides that, I overall really love this bar. The rest of the Staff & the Owner Billy are very friendly & they make you feel comfortable. Sometimes they have great specials like a beer and a shot for low prices. Also Wednesday night is Trivia Night, it was really fun to play against others and meet new people in the process.\n\nI recommend this bar to anybody who wants a chill, drama- free night.", "author": "C A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "Nice little 'hood bar. Had a pint of Margarita.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-07", "description": "The greatest patio! I could sit here all night & let my imagination take me to Alice in Wonderland!", "author": "Jill B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "Great drinks, beautiful patio, and a lovely bartender on a Sunday afternoon.", "author": "Shalana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-30", "description": "Potent pours!", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "My favorite dive bar in San Francisco!  Pool table, juke box, fun spacious backyard patio and stiff drinks...what more can you ask for?  Oh, and easy to find parking spots.", "author": "Judith S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "This bar is a boozy paradise all the way out in Bernal Heights.  Living elsewhere in the Bay, I haven't really tried to venture to this neighborhood before recently, which was a MISTAKE!\n\nI came out here to Wild Side West after visiting a friend in the neighborhood, who was selling me on the fact that it's a \"divey gay bar with a dragon in a tree!\"  (She wasn't lying, but it's also so much more!)\n\nThe front room of the bar has some larger, cozy tables, a pool table, juke box-- everything that you need.  The surrounding mix of turn-of-the-century antiques (e.g. Clara Bow-esque black and whites in carved frames) and modern chotchkeys (including a beer-bottlecap-bedazzled pair of mannequin legs spread suggestively over a piano).  It's representative of the folk and the staff who populate the room: familiar, comfortable, respectable, with some edge and flair.\n\nThe real unique selling point on this cozy boozy oasis is the back patio/terraced gardens.  This is where the \"Dragon in a tree\" comes into play:  hodge-podge flower pots, plants, lights, and decor are sprinkled over a top-patio, a lower \"lanai,\" and a terraced garden.  By day, it'd be great to smoke and drink here for hours over a RIchard Brautigan book....and by night it'd be great to smoke and drink here for hours over some good conversation.   A great, unexpected outdoor area to get lost, while you lose yourself in whatever you're doing!  An effervescent womb of flora, light, and cigarette smoke!\n\nOur bartender, Mr. Nancy, was quality people--had to mention that.  \n\nI'm lucky to now have an excuse to come out here and hang (my friend had better never move), but, city folk, if you need a BART-accessible escape without crossing any water or suburbs, I still recommend coming here just to spend a few cozy, smoky hours just outside the trendy hub of the SF metro.", "author": "Sam R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "Loves this place.  Cool.  fun.  great outdoor area.  and free drinks for sexy me.....  hayyyy!!\n\nxo\n\nP", "author": "Pammy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "Wild Side West is a serene space in the city. This is a great bar to come to and relax. I really enjoy sitting in the backyard on a nice day.", "author": "Pillowsblanket S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-31", "description": "This bar is so amazing... EXCEPT for the bartender. she is so unbelievably rude. For the first couple of time I came in I thought no big deal, she's just having a bad night. NO. every single time I have come in she has the same rude expression along with no \"thank you\" or \"you're welcome\" or even a smile. I have even watched for afar to make sure I'm not being crazy.. She is rude to every single person. Completely uncalled for.", "author": "Morgan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "Hands down, coolest bar I've ever been to. Like other reviewers have said - you just have to go and experience it. When you walk in get a drink and go straight out the back door, down the stairs, and then explore the garden. You'll find a nice little place to sit and take in all the random decorations. It was pretty quiet when I went but that was nice because I could actually hear the person I was talking to, unlike most bars.", "author": "Kasey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "After an epic fail at the club I whipped out Yelp mobile and pulled up this little gem for our party completely due to Mike D.'s fantabulous review.\n\nA lesbian bar with a beer garden, a pool table, and a pinball machine? Okay he had me with just pinball.\n\nThis is a great bar. Maybe it was just the culture shock of going from an overcrowded club to a smaller venue. But really nothing to dislike here. I guess the best way to describe this place is it just feels like SF. Just a nice vibe and good peoples.\n\nThe only downside to the evening was when we lost our dates to a group of girls who were having a lot of fun. It is a good story, but those darn Yelp rules prevent me from sharing it in this review!", "author": "Nick B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-19", "description": "the only lesbian bar left seince the lexington club closed, men are in here too, its a bar", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Love this place.  Obviously a neighbourhood bar with lots of regulars, but very welcoming to visitors.  Everyone was so friendly and on a sunny afternoon, discovering the garden, I thought I was in paradise!  This place is now on my list of all time favourite drinking places.  Well worth the walk up the hill.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "If I lived nearby, I'd be here all the time.  Amazing outdoor patio with tons of seating, lots of little nooks for hanging out with friends.  I love that there are so many little tabled seating areas behind foliage or trellises -- it keeps the noise down, and it's nice to chat with friends without having the whole bar listening in to your conversation.  Only wish they could keep the yard open later, but understand they've got to be courteous to their neighbors!  Inside is a bit cramped, but fine - your standard neighborhood bar.   Go earlier in the evening, in good weather, to take advantage of the patio.\n\nWhat is there to say about the bar itself? It's fine... reasonable drink prices, mixed drink specials are usually fairly tasty/strong.   Can't find a thing to complain about. :)", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "Ah, yes, the Wild Side West.  : )\n\n   The beating, drinking heart of Bernal Heights, the Wild Side West is a seriously funktastic place of wonder that never fails to satisfy.  Unless, of course, you are a straight guy trying to meet a straight girl, cause this place is also the beating heart of SF lesbian drinking culture  (yeah yeah, lexington, whateves) and your Game prolly won't pull much weight here.  (Not to say it is impossible to meet straight women here, it is just statistically less likely.)  \n\n    Anyhoo, the most fabulous thing about the WSW (aside from the killer people, hi Jan!) is the beer garden, which is out back and DOWN THE STAIRS.  Musicians often jam out under the big upstairs patio (you may find me here on occation), and the sprawling beer garden fills the back space with what seems to be 100's of little nooks and grottoes for private conversation.\n\n    The jukebox, which used to play a strict rotation of Janis, Eminem, and Missy Elliot has been updated to one of the internet equiped everysongintheknownuniverse kind of deals, which is cool.  Much cooler than Janis, sorry to say, but hey, to each their own.\n\n  Speaking of Janis, she had sex on the pool table.   True Fact!\n\n  Fireplace:  so so good on those cold San Francisco days and nights in the winter.  And the summer.  and the spring.  And the fall.\n\n   Some of the bartenders are cooler than others.  Mister Nancy is a personal favorite, but a few of the other good ones were sacked/left when the place changed hands recently.  Thus the 4 stars and not 5.  Love this place, can't say I am much for the new management.  BUT... they do care about the place in their own  way and didn't sell the place for scrap wood and condos when SF lesbian icon/bar owner Pat passed away recently.  I do have to say that painting over  the mural on the back wall was a major fuck-up.  Billie... WTF?\n\n   On a historical note, it is important to recognize that 30-40 years ago, lesbians were marginalized and maligned to an even greater extent than gay men, and that Pat and her partner Nancy put their necks on the line and their hearts and souls into a safe, positive place for lesbian women, by lesbian women.  This place drew all kinds of fire from  bigots for many years, and the big front windows were broken so many times by haters that they were eventually just covered up, and remain so to this day.   The Wild Side West is not just a great neighborhood bar, but it is the heart of a community and really represents the best of the spirit which has made San Francisco what it is today.", "author": "Bad Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-27", "description": "I had forgotten what a cozy and comforting place the Wild Side is. Last night was a slow Wednesday, and WSW provided a great place to catch up with an old friend, with another old friend tending bar. \n\nGood beers on tap. Pool. Fire. Outdoors. Juke. Perfect.\n\nDon't get over to Bernal too often but the Wild Side is worth a detour any night or day.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "I'm not too crazy about the TVs inside, but love the backyard patio.  The $4 beer didn't hurt going down either.", "author": "Maria A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "Stopped in for a beer on a nice afternoon with 3 friends, experienced the rudest service from the moment we walked in. We were quiet, respectful, and completely sober, and the bartender gave the rudest looks, scoffing at the one younger girl (22), and not offering any drinks. Regardless, we all tipped well normally-- (hey, people have bad days and don't always need to be nice). I have never made a yelp review, nor wanted to, but as someone that works in the bar and restaurant industry I was blown away. We left after one beer, and while smiling, waving, and saying thank you, she ROLLED HER EYES. My friends and I frequent dive bars and I want expecting anything beyond a beer and a welcomed seat in an COMPLETELY EMPTY BAR.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-05", "description": "Congratulations it's you first time at a Gay Bar!!!!!!!!!! This is what Foursquare told me WOOHOOOO I LGBT divirginized my social media apps. Anywho this place is pretty trippy, their garden is taken straight out of a bad trip to Alice in Wonderland and if you love hanging out in a swampy mystical environment YOU'LL LOVE IT! Garden Gnomes... Check, Crystal Ball... Check, Dragons...Check, Oversize Frogs staring at you from the trees...Check. I'm a Bernal Local so I come here often, it's always a diff crowd, young, old, sloppy, put together etc etc, you name it this garden might potentially have it. It has us for sure.", "author": "Lannette G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "Why haven't I been here yet? Lived in the city for almost 13 years and finally set foot here the last two Sundays. Loveliest backyard ever, super chill clientele and bartenders. One thing missing, better beer selection on tap but they have a decent happy hour. They have a tasty margarita too. You can bring in food from across the street and enjoy your tasty tuna sammich out in the back. Wonderful!", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "The thing that sets Wild Side West apart is the big beer garden in the back and the cool collection of tunes and pool table in the front.  \n\nThe beer garden is awesome for so many reasons.  It's big and has lots of little nooks and crannies for groups to assemble and have some intimacy.  Christmas lights, statues and little waterfalls create a pretty romantic ambience.  \n\nThe inside isn't too bad either, as previously mentioned, the jukebox has ample tunes for your listening pleasure and there's a pool table for the folks that need a little activity.  \n\nI'm definitely returning to this bar when the weather gets a bit nicer so I can enjoy the great patio.", "author": "Karen N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-18", "description": "Pilsner Urquell on tap and hefty shots of Irish Whisky...what could be wrong?  Bad service and an uncomfortable atmosphere!  Been there twice and both times was ignored at the bar for a long time before Ms. Surly acknowledged my existence and took my order. She did pour a good sized shot tho. The local hipster dude and his girlfriend were greeted with a smile, and so were the group of girls. I had heard its a lesbian bar, so what?  I wasn't there to chase girls-just wanted a quiet drink.  But it was clear I was not welcome. I get better service and feel way more valued at Sam Jordan's down in Bayview, and I'm REALLY out of place there...  So for Wild Side - probably a great place if you are a local, a hipster or a sensible shoes kind of girl... For the rest of us, just walk across the street to the Horseshoe...", "author": "Ken P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-03", "description": "You don't expect to find a lesbian bar in Bernal Heights but there it was.  Lexington is another.  I am not sure how I just happen into these places.  Good for people watching.  No Pisco though!", "author": "Laurence H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "The place is looks like any dive bar one inside. The backyard area is pretty spacious and is decorated with some crazy stuff. It has benches and tables around spread around along with some nice bushes. The atmosphere is pretty chill.", "author": "Rigel A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-20", "description": "Cheap drinks.  Not so friendly staff.  Tiny bathroom.\n\nI came here to meet up with some people who were getting together for a drink after work on someone's last day.  It's a block away from where they all work, so the venue was chosen for convenience.\n\nI really didn't like it much here.  When you walk in you notice an odd smell in the place.  Not quite BAD, but very distracting.  Kinduv an \"old\" smell.\n\nI sat down at the bar and waited for the bartender to serve me.  Now, I do know that this is a lesbian bar, and I didn't feel quite welcome here as a straight guy.  Maybe Im imagining that, but if it wasn't because of my sexual preference, there was definitely some reason why the bartender wasn't very friendly towards me.  She smiled and talked with other patrons that were either regulars, friends, or both, but wasn't nearly as friendly with me.\n\nI tried to order a mojito because I had read on Yelp they were great here, but I was told they were out of mint.  I asked the bartender if she had any other specialties, and she said she could make what tasted kinduv like an alcoholic Snapple.  That sounded awesome, and I went for it.  It was exactly as it was described, and was refreshing and delicious, not to mention strong.  I was very polite the whole time, and even attempted to compliment the bartender on the drink, but just got a weak thanks without her even looking up at me. \n\nLater when I wanted to play a game of pool, I waited around the bar a bit to ask the bartender for some change.  After a while, she stopped where I was standing and looked at me with a questioning expression, and I asked for change, with a please, and when she gave it to me a thank you.  The whole time she didn't say a single word or crack any semblance of a smile, only acknowledging the whole transaction by giving me what I asked for.\n\nThe bathrooms here are two tiny stalls out back, mens and womens next to each other.  Kinda uncomfy.  I had to step in on the side of the toilet in order to open and close the door.  I'm sure it must get difficult for people that are drunk to get in and out.\n\nThe patrons here seemed nice enough, but the bartender made me feel very uncomfortable.  Maybe knowing its a lesbian bar is making me confuse being unwelcome because of sexual preference with just plain bad customer service, I don't know.  I doubt I will ever be back.", "author": "Jon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "4.5 stars. \n\nThis somewhat clubby dive-ish bar is frequented by a mixture of locals, lesbians, and lesbian locals. It's almost always quiet enough for relaxed conversation (exception being major sporting events). \n\nThere is a huge overgrown garden backyard with seating nooks which is totally awesome when the weather permits.\n\nThe first time you walk in you'll immediately feel like you're missing the secret handshake, but that'll pass quickly if you're reasonably polite and civilized.\n\nWhether WSW seems like a lesbian bar or a neighborhood bar varies depending on the day and hour. Straight guys are a common sight although this is probably not the best place in town to hang out in hopes of meeting a single straight girl.\n\nThe \"competing\" bars across the street really don't do anything for me but I do dig WSW.", "author": "Joseph H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-16", "description": "I had an interesting experience at this bar.  While I went there with the intention of hanging at a bar with hot girls nearer my own age than I could find at the Lex - what ended up happening was that I was maybe one of five or six queer women in a bar that was hoppin' with SF yuppies.\n\nWeird.\n\nBut: I do love this bar.  The old-timey dive-ness of it is friggin' awesome.  Their back patios and gardens are really awesomely pretty (though they close at 11pm, which is a bummer).  The bartenders are hot, nice and good at conversation... not to mention they give you free chips occasionally if you have been sitting there long enough...\n\nAnd, then there was Ms. Claire - whom my friend Liz and I had the great pleasure of talking with for the majority of the evening.  We discussed queer politics, art, lit, music, people being too obsessed with cell phones and computers and the rarity of true love...\n\nBetween Amaris, Ms. Nancy and Claire the evening - while not what we had expected - ended up being pretty awesome...\n\nGood stuff, Wild Side West.  Next time I'll wear my bedazzled cowboy hat... Yee-haw, Towanda Jane!", "author": "Kate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "Awesome people, rad decor, incredible backyard, Janis Joplin's pool table. 'nuff said.\n\nI only wish this place were in my neighborhood.", "author": "Emily P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "I consulted Yelp for a neighborhood bar with a patio when a friend of ours wanted to meet up and grab drinks on a lazy Sunday afternoon. It led us to Wild Side West, and as we approached the entrance, we knew we were in for a treat. One of the Sisters of Perpetual Indulgence was sitting there, collecting donations for breast cancer. \n\nInside, the DJ was mixing some fun dance music. The bartenders were friendly, and because of the breast cancer benefit, felt boobies of the chocolate and vanilla variety were for sale. Imagine walking up to bar and finding a random felt boobie on the bar while you decide what to order. OR being greeted by the bartender's felt boobie, strategically placed between her two real ones.\n\nWith several drinks in hand, we headed down the narrow steps to the backyard. Lots of nooks, crannies, and seating - plenty of space to just hang out. Seems to be a chill neighborhood bar, so we'll definitely be back. I'm holding onto that fifth star for subsequent visits!", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-17", "description": "I was there once, and although I didn't buy a lot of drinks to really know prices, etc. it was an interesting little location to hang out with gay-friendly people.  I remember there are a lot of places around there too to get food etc. when you're buzzed and needing food\n\nPS I don't really like the atmosphere as a gay bar.  Being queer, I didn't find it very inviting in that sense; it just seemed like it just so happened there were a few gays in that place, not that it was specifically a gay location.  The bathroom was really small too.", "author": "Xhris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-19", "description": "I love me a lesbian dive bar. Great backyard on this one. It's a trek, for sure, from Petaluma to Bernal Heights, but definitely one I'll make again. Cheap pool table, HD TV, friendly bar tender.\n\nI can't wait to return.", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-05", "description": "Drinks = good and strong\n\nAmbience = energetic yet laid-back\n\nBartenders = great, friendly!  \n\nParking = pain\n\nOutside seating = a nice plus\nAlthough the stairs are treacherous, especially if you're in heels...you've been warned!\n\nPrices = typical, and I think it was cash only...\n\nIt's a bar, so it will get crowded!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "Last time I was at Wild Side West, I couldn't help but think to myself:  \"Nothing like walking into a lesbian bar and finding it full of men....\"\n\nEvidently, all walks of life enjoy this saloon.  The very first time I went into Wild Side West I was a lesbian-bar-virgin and didn't have clue.  The late 1800s nudes that adorn the walls got me up to speed pretty quick.  The owner gave me a brief tour, rightfully proud of the lovely garden in the back.  These days, while drinks are mixed by the bundle of energy that is the day bartender, I play a little pinball, or attempt a bit of Burt Bacharach on the upright piano.  At this bar I've engaged in thoughtful political discussions with other patrons, watched one entertaining geriatric pool game, and caught an ep of The Barefoot Contessa on the flat screen.  Very uncomplicated and relaxing.  Best of the Heights.", "author": "Poet D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "Love being in this city full time again as of two months ago!! I'm so happy to find places like this. They just do not exist in LA. Great people, great mixed crowd of all types. Lotsa fun, fun fun! We, my girlfriend and I, are coming back!!", "author": "Valerie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "This place is extremely nice but I only gave it one star because of Tina the bartender. She lack personality and customer service. My friends told my girlfriend and I to meet them there before we go to dinner at Vega (excellent service and delicious food). So I went to purchase a drink for my girlfriend and I and she ask for my ID which is fine and ask me for the other ID whom I'm buying the drink for. I didn't have any problem with that but I knew it was going to be a problem because of the malicious stare when entering the bar and showing her my ID. My girlfriend shows her ID which is unfortunately expired. I understand by law that an expired ID is not valid. I told her ok but she continue to talk and was very condescending about it. She told my girlfriend that she can't stay because they do not serve food and again gave us a malicious stare of disgust. I didn't want to make a scene so my girlfriend  left and I went to the patio to let my friends know and they were furious because they didn't even get carded. So they decided to test it out to see if we were getting discriminated against because we were of African Descent or lesbian. My friend (Caucasian male) went to order a drink to see if he would be treated differently. Of course he was, so she wasn't just following the  law... She wanted us out of there. She didn't ask for his ID nor ask for the person of whom he is buying the drink for. At that moment I was furious but walked out because I'm not a confrontational person. I live close to the neighborhood, we did not present ourselves as if we were trouble. I have never experience such blatant racism in my life and this will not be my last review or action. San Francisco is a city full of different people and I don't want anyone to feel the way my girlfriend and I felt.", "author": "Shay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "Go for the enchanting back patio filled with huge windchimes, creepy maniquins, old porch swings and large, stone frogs. \nYou can catch the sunset and have a drink and it is so dang magical.", "author": "Addyline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-05", "description": "This is technically a lesbian bar, but in reality it's an pretentious hipster bar (no that's not an oxymoron). It's really a neat little place with great knick-knacks (think Sweeney Todd barber chair), an extensive music collection, a fireplace, fun elixirs (i.e. chocolate cake shot, hot buttered rum), and a great vibe overall.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "niner/giants fans without question! awesomely eclectic patio, garden, and deck. free food sometimes-- i love their chili competition and stiff cheap drinks. perfect for day drinking and relaxing with the game on. easy parking, nice crowd mix, dogs allowed. perfect neighborhood bar. love this place.", "author": "Vanessa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "The garden alone is well worthwhile, add good company, and the drinks are always good!", "author": "Tiia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "What a cool bar! the large three story garden in the back where the saying among the locals is 'smoke whatever you want, no one cares' is awesome. I love drinking my cocktails out by the exotic plant life the owners have growing back there. The bar has been there for ages and it gives off this old timey welcome home feeling. On cold days they have the wood burning fireplace on. And, if you want to make a night of it, the most amazing sushi place is across the street named Mokis, make a reservation because the fish is fresh and the place is usually full. After dinner wonder over to the art gallery 'Inclusions' which is about a block away.", "author": "Zoe Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "I went bar hopping last night and had a great time at Wild Side.  They have an outdoor patio area which was so nice and chill.  On a beautiful day or night I could hang out there all day / night long drinking and smoking.  Bartenders were also very nice.  This is a great neighborhood bar!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-11", "description": "I like to this of Wild Side West as a local bar for everyone that leans towards being a lesbian bar.  Everyone is welcome as long as you are not a jerk.  Also, they have the best beer garden in town.  It is overgrown, and has little secluded areas, and fairy lights, and found \"art,\" and I want to spend all my days in it.", "author": "Tia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "My favorite bar in bernal heights, well there are only maybe 2 bars there ha. I love the cute patio on the back, feels like home! Cool unique things to look at and cozy atmosphere.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "Wild Side West is fantastic.  As Bernal residents, we actually have some pretty great choices for bars, but the Wild Side stands out.  Bartenders are mostly friendly enough, the beer selection is fine, and the prices are reasonable.  But it's a tie for the main attractions - the garden out back or the clientele.  The garden is funky in a really wonderful SF way, and the perfect spot to hang out on a warm afternoon or night.  There's always somebody playing music and lots of great plants and weird garden ornaments.  The clientele is always friendly, often quite drunk, and widely varied.  I do wish they'd change up the beer selection a bit more, and with a bit of cleaning up the main room could be made a bit more comfortable.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-03", "description": "It's hard to go near Bernal Heights and not stop in Wild SIde West. Be careful of the Mint Juleps, they are tall and might knock you down....\nAs the pictures reveal, the garden/sitting area in back is charming and a really nice place to be on a warm evening.\n\nThe bartenders have always been pleasant and the atmosphere has always been very relaxed in a cute and campy sort of way. \nNicely done.", "author": "Bella T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "Love this spot!!! Even more so now that the sun is showing it's face again 'round these parts.... making it an oh so lovely idea to be outside more...morning,  noon and night!!! Besides being a fun little bar with a rockin' jukebox (a crony told me it's now one of those fancy shmancy satellite jukes) the bartenders are mostly awesome (there a couple of standoffish ones that will give you the stink eye the first 2-3 times you go then it's all good and they will make your drinks EXTRA (tres boozy) yummy!! Kat is the bomb!!! Tina F (we miss you!!) Anyway, a very stellar crew, mixed clientele although the Wild Side is officially a ladies who like ladies bar! One of the first actually, in SF! \n\nWild Side has been in Bernal for 30+ years now! When it first opened (by Nancy and Pat) patrons would frequently find themselves getting hassled/heckled and a couple times a month the owners would find their front windows smashed in!!! The solution? Stop replacing 'em! Which is why even to this day, there are no front windows, artfully boarded up you could say...with just a friendly swingin' door (that goes both ways) to welcome you! CAUTION: Don't go bustin' in the front door too quickly, or you may hit the backside of one of the folks playing pool! (I've been on both sides of the equation and depending on your level of inebriation can alternately be hilarious or obnoxious...you've been warned and besides, you don't want to start off on the wrong foot now, do you? Of course not!!! = ) \n\nAhem, so this place has a pool table, great juke, fun bartenders, a diverse clientele that is there to have a blast...what else?? So glad you asked! This place has the...BEST...backyard I have ever experienced at a bar!! Better than your Uncle Bob's patio, better than many beer gardens in Munich...this here patio/yard has like...4-5 levels??? You walk out the back door and you're on a cool deck with a few seats...you go down a couple of steps and there's a nifty nook with a table and 5-6 chairs and a bench...trot down a few more steps...green trees, flowering bushes and a cozy seating area for 4 ...a little gazebo and swing and miscellaneous chairs...journey further and there's a stretch of lawn, more trees for lounging and lollygagging about on the lawn or chairs...it's really cool if you want to get some fresh air, smoke, plot a coup, make out or swap stock tips or recipes!!! AND this place has some pretty swell bbq's during football season!!! If bbq isn't your thing, you're easy walking distance from great restaurants....Vino Rosso, Liberty Cafe, Little Nepal, Piqueo's, Moki's to name a few! \n\nOn 2nd thought, forget what I said, it's really not that great here (hoping that the place won't be inundated with people...I like to think of it as perk of hanging in Bernal and being in the know!!! (~_~)   Alright, just kidding...stop on by and..... \n\n.......\"Take a walk on the wild side!!\"  (Where's a clip of Lou Reed singing when you need one? = )", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "Looking for a place with a nice big back patio area, is low key and chill and away from all the noise of the city?  Wild Side West is really great for that.\n\nThere's a mixed crowd here and even though it's in Bernal it's not just a Bernal crowd but folks from all over.  If it's nice out (or even our usual chilly weather), you have to go out back on the deck or yard.\n\nEveryone seems to leave everyone else alone here and there's no pretense here at all...", "author": "Gene X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-18", "description": "This is my favorite bar in the entire city. The staff are fantastic, from remembering everyone's name, to knowing when I had just had my heart broken to remembering my favorite drinks. It is how your drinking experience SHOULD be.\n\nLovely lesbians, cute nerdy nonscene gay guys...awesome neighborhood straight people and the best jukebox in town.\n\nThey have hot alcoholic beverages in the winter, a gorgeous outdoor seating area year round, and irish food on St. Patty's Day.\n\nYou could not go to a better place, so tell Tyr, Regina, and Mr Nancy that Rylan sent you ;)", "author": "Rylan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-05", "description": "I like this place enough - it has a nice backyard.\n\nBut sometimes you never know what you're going to get here. I went here for my birthday last year and some creeper of a dude kept hitting on me and my roommate.\n\nAnd I'm knocking off a star for the red-headed bartender who never ceases to be a rude ass bitch.", "author": "Whitney D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-29", "description": "It's like a really weird run down neighborhood bar from Wisconsin but with lots of lesbians and trees. Perfect little nooks and crannys behind trees and bushes to escape reality with some beers. I dig this place a lot, but some of the bartenders are ice queens. Just accept them for who they are and they will serve you a good drink. We can't all be sunny.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-23", "description": "This bar is almost a lot of things;\n\nIt is almost a lesbian bar, but there are always enough straight people here to make you unsure\n\nIt is almost a neighborhood bar but there are enough people here who have clearly traveled from other corners of the city\n\nIt is almost a dive bar but the percent of its clientele that are career drinkers is not high enough\n\nIt almost provides great service, except when it doesn't\n\nIt is almost a good deal...the drinks are very strong, but a tad too expensive\n\nIt is almost a great place to hang out on a sunny day but there is seldom a steady stream of sunshine on their multi-level back patio\n\nIt has almost  all of the things you want in terms of entertainment and ambiance; a pool table, a fireplace, a decent jukebox, old school cash register, kitchy decor and pinball, but people seldom utilize all of this to its full potential\n\nDespite it being an \"almost\" bar (I didn't even know this sort of bar existed until  started writing this review) it is still a great place in Bernal Heights to hang to with a few friends and quench your thirst. \n\nDefinitely worth checking out. \n\nI am almost sure you will like it as much as I do.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "Yeah.  Uhm.  So I've been holding out on you.  I know, you thought that since I'd been so opinionated... so caustic... you thought that meant I was an open book, so of course I'd already told you about my favorite place.  I'm SO sorry but I just couldn't.  I'm a conflicted Yelper with trust issues.  Let's start with:\n\n1) I don't know you.  What if you're actually some chest bumper with frat manners?  I can just hear you yelling backward as the lesbian bouncer hauls you out, \"DUUUUUUDE!  Rosie W. said this place was cool!\"  Which leads me to:\n\n2) They know me here.  OK, not THAT well, but Regina knows me.  And she's pretty much the most professional, friendly booze ninja in this whole city.  If you ruin that for me, I will be a sober nomad with nowhere to go.  Which brings me to:\n\n3) I live crawling distance from this place.  It is my Regal Beagle.  And when I'm here, I really can't talk to you.  Because I am probably already drunk and boring the life out of some poor young lesbian who just got off the bus from Eugene and wanted to have some fun but now is stuck in a dead end conversation with a married chick.  So you see, I am busy.  Which brings me to:\n\n4) This is a lesbian bar.  That doesn't mean it's only for lesbians.  That means if you get into an argument with a lesbian here, you lose.  So you can hang out, but you are a guest and need to mind your ass.  Which leads me to:\n\n5) There's not a lot of room on the patio.  This patio has been the fertile ground of many a fruitful conversation with my neighbors.  It's my salon.  My Algonquin Round Table.  OK, sometimes it's just where I chain smoke and repeat myself (see #3).  But there's not a lot of room and it's one of very few al fresco drinking spots in town with a wind guard.  \n\nI want this to work SO badly.  So let's just agree that you won't thrust the door open and screw up someone's pool game, and you will say please and thank you and be friendly, and you will not hog the spots in front of the fireplace or on the patio.  And you will never, ever put your cigarette out in the typewriter.  \n\nOK, we have a deal.", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-06", "description": "An entertaining place to come for a drink with a friend. Lots of colorful people here (and not just lesbians).\n\nThe beers appear to be relatively cheap.\n\nNot my usual cup of tea, but if I'm in the neighborhood, I'll happily come here.", "author": "Dana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-06", "description": "Every month or so, I pick an SF neighborhood I know very little about and just start walking.  I always do this alone because I'm a rebel. Or because no one can stand my company, but that's a story for another review. This past Sunday, Bernal Heights was my chosen destination.\n\nIf you can get past the Mt. Kilamanjaro walk up Cortland Avenue from Mission Street, I guarantee you will find something here to suit your taste. A Cambodian restaurant? That's odd. Jesus Christ, there are a lot of dogs in this neighborhood; Michael Vick would love it here (just kidding). Wow, this video store (http://www.yelp.com/biz/CSdlg3J_lhtN_TRlB9BjiA) has almost everything from the Criterion Collection. I'll definitely come back here to get my Jane Campion on...that bitch can direct!!\n\nBest of all, Bernal Heights is home to Wild Side West. I sat at the bar and struck up a conversation with two SF locals who invited me to join their group on the back patio. Have you been back there at night?? It's an OASIS! An OASIS of AWESOME! It's a little tricky traversing the stairs after 3 pear ciders though, so be careful.\n\n5 Stars.\n\nNote: My only complaint is that the jukebox sure does carry a lot of Indigo Girls and KD Lang tunes.  I guess the owners really enjoy country western/folk music. That's the only explanation I can think of anyway.", "author": "John T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-15", "description": "Heavy pours, lots of lesbians, and decor that looks like a musty attic (and also my dream living room.) If somebody threw Dire Straits' Money for Nothing on the CD player, it would be just like childhood. And lord knows the best bars remind you of childhood.\n\nAlso, they let me put my own honey in the hot toddy, which is about the best thing any bartender has ever done for me. After all, I'm an adult now; I can have as much honey as I want.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-01", "description": "This is a charming little hole in the wall of a bar. I like that it looks kind of like a haunted house/old western style featuring real dust and cobwebs. It reminds me of what a real western bar would have been like back in the 1850's sans all of the electronics, fancy beer taps and other modern conveniences (Insert internal running water here).\n\nThe back yard is accommodating offering seating with privacy for 2 people all the way to large groups.\n\nGood place to lounge around, I feel that for a dive bar that I'd normally rate at a 2 stars this one is a little more special than most.", "author": "Carlos V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-27", "description": "The first time I went to this bar I was meeting someone and was fairly new to Bernal Heights. So as I sat there patiently waiting and drinking I thought to myself, \"Man, there's a lot chicks in this place.\" I don't recall exactly, but I may have been the only dude there. /Stage whisper/ \"The Wild Side is a lesbian bar!\"\n\nThat's cool. I've been back many times and have never gotten a man-hater vibe and there's actually a pretty mixed crowd. There's a pool table, a patio out back and a grandma's attic/lumberjack decor. Friendly laid back atmosphere. \n\nThe Wild Side West, where you don't need to be lesbian to have fun, but it'd be more fun if you were.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "This place is perfect for an event or large party. \nI was recently here for the Benefit for the Boob.\nLots of really cool people and entertainment. \nPlus they have a lovely patio and backyard. \nBartenders are a friendly bunch.\nA destination place for a warm sunny day.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "Okay, before I continue on with my reviews of Chicago establishments, I had to write a quick review for Wild Side West since I paid this awesome place a visit last night with a couple of friends.  \n\nWild Side West is the ish, yo!  Seriously, the bartenders are awesome.  The people are friendly and it totally beats the Lex, by far!  My friend bar tends there and I actually ran into her and it was so nice to feel welcome.  My friend and her girlfriend had an equally great experience because the entire vibe was incredibly chill.  \n\nThe coolest part is that they don't give anyone problems, which is so great.  They've got a nice little patio out back with benches and the cutest dangling lights for ambiance.  Seriously, it's one of the best bars I've been too with a completely chill vibe.", "author": "Dorothy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-18", "description": "This bar has a great back yard and cool atmosphere.  I wish I could go there again but the staff was so unbelievably rude that I have to give it one star.  \n\nI went there on a week night with a friend.  When we got there and ordered a drink there were 3 people behind the bar but only one person doing anything and we were ignored for several minutes.  I was a little annoyed but I thought \"hey, it's a week night, everyone seems to be in a good mood, I'll roll with it\".  \n\nMy friend and I finally got our beers and went out back to drink.   A while later the bar tender came by and told us to bring our own glasses back up since we were such jerks....WTF???  I asked her what she was talking about and she laid into us about how we were so rude when we were waiting for our drinks.  Neither us us had any idea what she was talking about.  She thought we had complained about waiting so long (obviously she realized we had and felt sensitive about it).  \n\nThe only thing we could figure out was that we had been talking about a race my friend was going to run and she somehow pickup up \"it's about time\" as complaining to her.\n\nIn any case, nothing we said made any difference to her or anyone else working at the bar.  As local customers clearly we were wrong and not worth listening to.\n\nSo if you go to this place, make sure you kiss the staff's butt or you may find yourself being attacked.", "author": "Keith B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-14", "description": "OK, call me a hater, but I have to say it...  I love a dive bar and especially love a gay dive bar.  I really, really want to love the WWW.  It's nearby, it's kitschy, it's neighborhood-ish and queer-friendly.  You can bring a group of folks here and get spots at the pool table pretty quickly, your songs come up on the jukebox in a reasonable amount of time, and there's a backyard and a fireplace.  \n\nBut there's just something that's a little off.  Maybe it's the fact that you have to wait forever to get a drink from the surly chick behind the bar.  Maybe it's that the drinks should be just a titch cheaper for the venue.  Maybe it's the rats in the backyard.  I can't say. \n\nI'll go here if you're buying the first and second rounds or I haven't seen you in a while.  Or if it's a sunny weekend afternoon.  Otherwise, let's go somewhere else.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "This is a good friendly neighborhood bar.  Cheap beer and good service in an environment where you can sit and talk to your friends.  They also have sports or an awesome movie on in the background if you get bored of your friends.", "author": "Paul T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "This is friendly neighborhood bar which has a very comfortable atmosphere which borders on being almost a cluttered mess - I was there on a cold overcast day and so you couldn't really use their outdoor space.  I've been told by friends when the weather is nice this is a great place to hang out with friends and have some beers.  Looking forward to a return trip on a sunny afternoon..  Great selection of beers, and great mixed drinks (strong).", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-03", "description": "I wish I was just a little bit better with my bike.\n\nI wish riding up to the top of Cortland were a casual thing, a \"Oh, you know- just rode up Cortland... what're you up to?\" kind of thing. If it were, I would do all my studying and homework in the back yard of Wild Side West. It feels like someone took my favorite stuff about Texas backyards (minus the barbeque), and moved it to San Francisco. And then offered me a beer.\n\nI heart WWS forever.", "author": "jason l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-28", "description": "Gorgeous. \nSimply because it attracts the most laid-back honest mix of unpretentious folks in the city. The Fireplace is laden with shoes and there's always someone playing a not-so serious round of pool. Drinks are cheap and standard. But the real magic happens out on the back patio. Someone's always strumming a guitar, lighting a cigarette, telling a story. It's sunny during the day and lit with twinkling lights at night. Everybody I've taken here loves it--yes even straight guys AND lesbians. How many places can you say that about? This is my current favorite bar in the city.", "author": "Sita B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-12", "description": "I love the outside patio. It's such a contrast to the bar...with rambling vines and cozy little tables. Inside is laid back random funky with flashbacks to the 70s (and before) here and there. \n\nHaven't been there in a while, but the last couple times I went the bartender was friendly (and cute), the company was friendly (and cute), and I felt relaxed and happy with my honey (who is, again, friendly and cute). \n\nGood place for a kick-back time.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "We decided to go here because a lesbian friend of mine was in town and she wanted to see a little of the SF lesbian scene.  This was our third stop on our LGBT SF tour for her.  And by far, the most action was happening here on a Saturday night.  It was cozy and inviting.    \n\nSo we walked in and the gal at the pool table seemed friendly, really friendly.  I think she was a regular.  We saw her kissing another woman about half an hour later.  Then my friend decided that she wanted to send a photo of herself kissing a woman to her girlfriend back home.  So she was making out at the bar with this same pool table woman and snapping a photo with her phone.  Hey, whatever turns you on, right? \n\nThere definitely seemed to be some affection goin' on in this place.  So, I would say that if you are a lesbian, or bi-curious even, you have a good chance of getting some action at this place.  Or at least getting a date.\n\nI really liked the fireplace with shoes on it.\n\nIt is fine to go into this place as a heterosexual couple.  Though guys might be a little jealous of (or maybe turned on by?) their girlfriends getting all the attention from other women.  \n\nEnjoy the people watching!", "author": "Erica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-21", "description": "Wild Side West is, by far, the best place to drink outside in San Francisco. Their back patio is a little hetero-friendly lesbian wonderland in my sunny neighborhood. It is absolutely perfect!\n\nAs far as the inside goes, it's getting a little too smelly. Husband and I walked by last night and there was a curious smell emanating from inside. I don't know, it was like a combo of booze-soaked floor, backed up toilet, and bleach. Not good. Even still, that back patio is amazing. I'll take it over Zeitgeist any day!", "author": "Abby W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "Best outdoor patio in San Francisco.  Good beer, better mixed drinks.  Great neighborhood dyke bar with a nice crowd.", "author": "X-topher B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "It's a shame I don't remember that this place is here more often. Because I live up on Bernal Hill, I'm often reluctant to go anywhere because it can be simply discouraging to think of walking back up the hill or paying a cab to lift me 300 vertical feet. But Wild Side West, despite some hills and valleys on the route, is more or less at the same altitude in my house. What's not to love? \n\nThey've got a great outdoor area and despite an apparent classification as a gay bar, I've always felt welcome (as opposed to, say, the Lexington Club). Decent beer selection and always a fun time, and I need to remember to support my local watering hole more often.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-14", "description": "This is in response to a review written about me that Colleen wrote.  Love my job. Love my regulars who have been great to me.  Love the Wild Side West.  You on the other hand, I think are ruminating tooo much on one thing I said which you completely took the WRONG way.  When you ordered your beers and I was running out I ran downstairs and made sure to grab more and chill them on ice for you so your next round would be nice and cold. I actually tried to give your 8 dollar tip back the first round, sure it was a great tip, but if I really cared how much you were tipping I would not try to hand it back to you! I agreed with you that the movie was intense and that I was trying to find something to watch.  When you told me that you were glad I changed the channel I did say something in the vane of ..I'm not changing the fucking channel for you! I am changing it because it needs to be changed!  I swear a lot, YES IT\"S TRUE!  And when you pulled me aside one of my regulars stood up for me because he thought you were being hypersensitive.\n\nNotice there are no other bad reviews about me here. I want to defend my honor.  I am a kickass bartender and I like my job and feel lucky to be a part of a great establishment. \n\nIt is really too bad that you misconstrued what I was trying to convey.  Seems like you are looking for something to write down and want to be mad about something...I am not the only one who noticed!", "author": "anita e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-04", "description": "Around the corner from my house is Wild Side West, a great little lesbian bar (although I think it's really just for everyone).  There's a pool table inside, if you dare to challenge any of the skilled billiard artisans who play there.  After being humiliated and with my tail between my legs, I head out to the Back Garden, down the stairs.\n\nIt's divided up into eight or nine seating areas, all divided by mature foliage, and is actually quite beautiful.  Every little area is set up as an intimate place for between 5-8 people to get their swerve on, and I've met some funny and interesting people there.\n\nGo, if even just to see the garden, even if you don't drink, grab a soda water and drink it in down there.  Bring a friend, prepare to bash Republicans, and check it out.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-22", "description": "After a quick walk through the Mission district and a hike and picnic on Bernal Hill, my friend suggested we check out this little bar he and his girlfriend stumbled upon while exploring a few months back. Wanting to see San Fransisco from a non-tourists perspective we quickly agreed, especially after he assured us it was the chillest bar he had ever been to.\n\nHe wasn't lying! Even from the exterior, I knew I was going to like this place. However it wasn't until I stepped inside that I knew it for sure. And of course when I stepped back outside onto the expansive, multi-level patio I was smitten! Oh why can't we have a Wild Side East in Boston! \n\nVisually its an overload. It's the kind of place where I bet even a regular is discovering some new scrap of paper on the wall or a clay figure poking out from behind a plant on every visit. It looks like a cowgirl's mind exploded. This is also the bar I discovered Speakeasy's Big Daddy IPA (which is delightfully making its way east and can be found in a few packies in Boston), my favorite of the local beers I sampled. Wild Side West was the perfect low-key place to take a break from a lazy Sunday of exploring to hang out and meet some locals, before disembarking to do more of the same.", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "Nice broad selection of beers and drinks -- great garden in the back, nice neighborhood in the city", "author": "Ed B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "Wild Side West is like the Lexington's quieter, friendlier, and not-nearly-as-horny older sister.\n\nSure, it's way the hell out there, but its isolation evokes a true neighborhood feel.  Aesthetically and thematically, Wild Side recalls an old country general store.  Some of the bartenders can be a little self-absorbed--a few have ignored my very patient and respectful male friend for minutes on end--but others are completely welcoming.  And the drink selection is fabulous: a good mix of beers and uber-girly elixers.  My favorite is the Peppermint Patty: hot chocolate with a generous helping of Peppermint Schnapps.  \n\nWild Side West's patrons are remarkably varied.  On any given night you can run into flannel-sporting locals as well as made-up L.A. expatriates.  Some are hot and others aren't, but this isn't a pick-up scene anyway.  \n\nThe outdoor patio is beautiful but very, very cold.  I know a lot of small-framed women who would appreciate the addition of a few heat lamps.  \n\nAll in all, Wild Side West is a cute, quaint bar and the pride of SF lesbian nightlife.", "author": "Karin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-11", "description": "I went to Wild Side West for the first time for my 33rd birthday because I wanted somewhere casual and fun, with an outdoor area. It was the perfect place for my party! \n\nWe got there early enough to grab 2 big tables in the backyard patio, and as my friends trickled in, I started the night with a super-fantastic Mexican Coffee specialty drink (I am a major tequila lover, and there is nothing better than tequila with coffee and kahlua!!). We had pizza delivered from Goat Hill Pizza, and everybody was in heaven!\n\nThe cute bartendress (damn, I forget her name!) gave me a free birthday shot of my favorite tequila (and a few of my friends too) later in the evening when we moved inside to warm ourselves up. \n\nWild Side West totally rocked my birthday world. Everyone was extremely friendly and helpful, the bathrooms were clean, and everyone in the bar, patrons and staff alike, was having a great time. It's not fancy, it's totally low-key and no frills, so if that's what you're looking for, go for it! \n\nOh, by the way, it's not a Lesbian/Gay Bar, it's just that some lesbians happen to run it. It's homo-hetero-whatever friendly! Myself and all my friends there that night are almost all 100% hetero, and nothing was amiss.", "author": "Gael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-19", "description": "So some people have been comparing this place to Zeitgeist. But it's not a big open rowdy hipster beer garden. A more apt comparison (in terms of vibe and layout) would be El Rio, and Wild Side West wins out on that battle.\n\nHere's why I like Wild Side West best:\n1. It's in Bernal Heights, which doesn't get nearly enough love as it deserves (mostly because of its distance from the center of SF, I'd imagine).\n2. The beer garden is multi-leveled. Mutli-leveled! I feel like I have stumbled into an Ewok dwelling, but with less fur and more lesbians.\n3. There's all sorts of magical hidden art out back. The knight is my favorite. Such a brave little man.\n4. Allegedly open jam sessions are a common occurrence in one of the gazebos (wasn't happening when I went though). Bring your own guitar though?\n5. There's a real communal neighborhoody vibe amongst the patrons... I felt welcomed immediately.\n\nI mean, I love El Rio too, but Wild Side West is just... special.", "author": "Trey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "Wow, I was here a month or two ago and haven't had the chance to review. It was a nice Sunday, I wanted to take a couple friends for a drink there to show them the awesome secret garden. I've always loved this bar because everyone's always super nice, drinks are priced well, and the garden is beautiful. Last time I was there we met the owner. She was friendly, a really warm person and the fact shes a dog lover. She played w/ my little yorkie for awhile, he fell in love w her. Oh yea, I'm straight and super girly, still love this bar.", "author": "Nicole P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-15", "description": "One of my top three bars in the City, and definitely the one w/ the coolest beer garden (#2 El Rio, #3 Zietgeist). The patrons are so diverse you could definitely spend all night here w/o even realizing it's a queer bar.  the highlight of the place is the backyard beer garden.  it's huge, beautiful and decorated with gorgeous plants and lights, and much more pleasant than the beer garden at zietgeist.  wild wide west lacks pretension and yet would be justified in having it.\n\nWild Side West is a major contender for my favorite bar in SF!\n\nNOTE:  Don't come here if you're looking to hook up or have a wild, crazy night.  This is more of a chill place to come and chat with friends.  If you want to engage in the former activities, go to Hot Pants at Cat Club or Brownies For My Bitches at Harvey's, or Toxic Sunday at the Cafe, etc etc.", "author": "Sid D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "Looking for a place where you can sit outside in a gorgeous garden and smoke? This is Eden, baby. Beautiful. \n\nWent here for my friend's birthday. I was apprehensive, at first, because from the outside, it looks small. But don't be fooled by the tiny exterior. There's a LOVELY backyard. And an even lovelier bartender. She's smokin' hot. Had a great time and will definitely be back again!", "author": "Guinevere Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-03", "description": "I'm not really sure how I feel about this bar. \n\nOn one hand, it's totally cool with the huge backyard that makes you feel like you're on a jungle adventure.\n\nOn the other hand, the bartender (the night I went, anyway) wasn't particularly friendly and didn't really make me want to give her my hard earned money for the overpriced mixed drinks. \n\nAnd yet on one hand, many people are nice and will talk to you and try to include you in the group.\n\nBut still on the other hand, you might get hit on by straight boys (I did) or get caught talking to weird lesbian couples from Canada that are really boring and socially awkward (that happened too).\n\nThen again on one hand, they've got this group of old hippies that play music outside on certain nights and invite you to jam along with them.\n\nStill on the other hand, you might feel out of place if you don't particularly enjoy these jam sessions and stand there feeling out of place while your other friends join in. \n\nSo WSW is sort of like a Chili's Restaurant. You know you can have a decent time, but there are just enough things to keep you from truly and unabashedly enjoying yourself.", "author": "Angie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-16", "description": "Average age of the customers here is older than what i would like it to be.  This is a local corner bar, don't expect to see anyone dressed up nice or wearing makeup.  A good place to kick it and you're a lesbian and you live walking distance from the bar.  It looks really old-fashioned inside like a very old bar.  I am sure I could grow to love this bar if I lived near it.  But last night when I went I just wanted to get out of there.  I told my driver James, \"Take us to the Lexington James.\"  Wild Side West, good luck to your business but I probably won't be back until I am desperate and in my 50s.  Generally speaking, the women there were not cute.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-29", "description": "Was strolling aimlessly on Cortland Ave, a recent discovery, and passed this place.  Attraction?...Raider of the Lost Ark pinball...hello.\n\nWent with a man friend and had a great time.  The bartenders were awesome...one unfortunate fellow that seemed to think we weren't cool enough for the place, but that's a mark on HIM, not the place.\n\nBeautiful, BEAUTIFUL garden areas.  Just a lovely place, lovely people.", "author": "Cris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-15", "description": "Boyfriend: I think this is a lesbian bar.\nMe: No, I don't think so.  (Looks around) .... Okay, yeah.  Oops.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "I don't know why I have never reviewed his place just have not ..\n\nI went last Thurs to play pool though and had such a goodtime decided to yelp about it wanna hear it here it goes\n\nThings we already know\nUmm its on cortland\nIt's a Divebar\nBeen around forever\n1st gay bar on Cortland\n\nThings you may or may not know \n\n1.Well the friend I went to meet says that she goes because she can always discover a new treasure ( you know some strange lil trailer park artifact)\n\n2. The juke box is crackin and you can even go online and find whatever you want\n\nI actually had hell of fun last week I have a few friends who live in the area so I may just go back more often", "author": "Kim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-14", "description": "Holy crap, this place has THE BEST outdoor patio area in all of the places I've been to in SF.\n\nCute, even kitschy homo bar when you walk in. And its in Bernal Heights, not exactly known for its roaring nightlife (or roaring homos... haha), but this is wonderful place. Reminds of of Truck in SOMA, except more lezzies. The drinks were cheap, delicious, and served with pizazz. I'll be back for sure, don't miss this place gays and non-gays!", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-17", "description": "Ventured to Bernal Heights and walked into this bar a little before midnight on a Saturday night. Found the bar lined with men..possibly two women or so in the whole place. It was not very packed. I was expecting a lesbian bar but quickly left for the lack of women. Possibly the men were lesbians but not quite what I was going for.", "author": "Blu M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-17", "description": "I can't believe I'm lucky enough to live within walking distance of this bar.  The bartenders here are so sweet and the patrons have all been cool too.\n\nSo far my highlights include:\n- Sitting down at a table with a random guy in a fedora, and watching my friends try on his hat.\n- Guy with banjo and guy with fiddle playing bluegrass covers of Oasis.\n- Watching two guys ferociously make out against the back fence of the garden (sorry, but I literally could not look away).\n- Walking in on a busy night and finding the bar both crowded and completely silent, staring at the TV.  I was pretty sure the president was speaking or we'd had another terrorist attack, but then I saw Meryl Streep was giving her Golden Globes acceptance speech.  Felt like I was getting the collective stink eye from the room for interrupting.\n- Getting a well deserved eye roll from the bartender after my friend and I broke a glass (pro tip: those table tops are NOT fastened to their supports, i.e. milk crates, on the back patio) and then in our drunken state thought it would be a good idea to present her with an ash tray full of broken glass as a \"warning\" that there was glass downstairs.\n\nI hope to have repeats of these experiences and many new exciting ones, once it's warm enough to sit outside again.\n\nPS - If you sit on my porch swing I will cut you.", "author": "J W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "What could be better than a cool bar located a 1/2 block from my house!  Great outdoor space with private lounging nooks.  These ladies (I've never seen a male bartender) pour a heck of a drink.  Make sure you eat dinner first!\n\nIt's always referred to at a lesbian bar (and actually, I have been picked up a couple of times...) but it is definitely welcoming to everyone.  My husband and I have been coming here for years.\n\nAnd $.50 pool!  Does it get any better than this?!", "author": "Heather F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-20", "description": "I went here fully knowing about it being a lesbian bar.  I didn't have a problem getting a drink, the back yard was nice (even though I had to sneak down there because it was late), the pool table was bar-worthy, but the place seemed a little bit dead.  Kind of \"meh,\" if you will.  \n\nIf you won't then go ahead and go.  Maybe it was an off night?", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "After a day inclusive of photo taking, driving down every steep street the city could throw my way and going crazy shopping on Valencia, my friend and I decided we were thirsty and the only place which could sate our palates was Wild Side West.\n\nI never knew about the little garden in the back with all its little secluded places to sit and get comfy. It was the bomb!!\nI have to say I felt like a complete maroon after all the times I just sat at the bar itself and watched the bartender use the cool old cash register.. but we settled on into the best seat in the house, way in the back and we drank until the cows came home.....great place. I love coming to Bernal and relaxing here with friends.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-21", "description": "just an average bar. good size pours and a nice patio outside.", "author": "Priya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-21", "description": "Shhhhhhh...Okay folks, I know it's hard not to go to the nearest hilltop (Bernal Hill - it's beautiful) and shout at the top of your lungs how much you heart Wild Side West, but please use some discretion. If we are not careful our secret garden could turn into the next Zeitgeist; Bernal Heights would be overrun by fratboys and then us locals would have to go all the way down the hill to El Rio to escape the havoc that would ensue. I hate frat boys and I hate the cover charge at El Rio...so let's keep it on the down low*, alright?\n\n* Okay, I am not that righteous. Please share our jewel with the people you love, but if they are wearing a NOR CAL hoodie (West Coast Choppers is just as offensive) and drive a pick-up truck re-direct them to Zeitgeist", "author": "Hurricane Rena .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "I almost held out on posting a review for this place because this is one of my favorite bars. Why? I grew up in this area, lived about 2 blocks away. This bar from the outside, looks like my old house! But that's besides the point. Plenty of beers on tap, great bartenders, pool table, pinball, juke box, and oh yeah the Secret Garden. I call it the Secret Garden because the moment you walk down the steps of the patio you'll feel like you followed a rabbit into a hole and entered into Wonderland. Not so Secret anymore now that I posted here on Yelp, but it's a must and don't mind sharing at all. Enjoy!", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-21", "description": "In my pre-East Bay life, Wild Side West was my local hangout.  It's lesbian-owned, yes, and many patrons are lesbians, but not in the clique-y hardcore Lexington sort of way, where bio-males or straight chicks are pretty much prohibited unless you're with someone really cool.     \n\nOthers have already waxed poetic about the amazing patio, so I'll give you some of the other reasons to put WSW on your favorite bar list:\n\n- It's dark and cozy with a great fireplace if it's too cold to hang out in the garden.\n\n- The bartenders are sweet and edgy at the same time, and they don't play favorites just because they know the person at the end of the bar.\n\n- The walls (and other surfaces) are covered with junk to look at, so if you're shy and you're waiting for someone, you can distract yourself by examining the shoes that cover the fireplace (for example).\n\n- The tonic water tastes really good for some reason, so the well T&Ts taste better here than some of the top-shelf ones I've tasted elsewhere.\n\n- Their softball team has a reputation of being unbeatable when there's beer around; otherwise they kinda suck.", "author": "Sharon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-08", "description": "Though you could totally call this a neighborhood 'girl bar' it's not. It's a neighborhood anyones bar that just so happens to have some sexy lesbians..or..a lot of them..((eyes glaze over))....what was I saying? Oh yes...\n\nThis is a perfect place to grab a drink and go sit outside. They have it set up all cozy like and I totally dig it...though the night we went we witnessed some sketchy activity but ya know...they weren't bothersome so I don't have much to complain about. If you are a girl..who likes girls..who wants to bring girls or boys - this is a great place to do so. I once stopped in the Lex with 2 boys and..yeah..AWWWWKWWAAARD...", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-17", "description": "Great dive. Funky decorating. Great back deck for smoking conversation. Wonderful beer garden during the day. Show up early (1pm) on a sunny Sunday afternoon and head downstairs for a real good time. Difficult employees are the only drawback.", "author": "seth c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-03", "description": "One of the best bars to hang out at in the evening during the warm months of September and October. The multi-terraced outdoor patio in the back has plenty of common areas with room for groups up to about 15 if you feel like being social... there's also lots of hidden nooks and crannies if you need an intimate corner for making out. \n\nThe place is decorated with lots of colored lights and strange little statues. There are two propane bbqs which anyone can use if you want to bring some food to have with your cheap drinks. \n\nOn some weekend nights, people seem to spontaneously bring out their music instruments and have a good ol' jam session. Plus inside there's a pool table and a great pinball machine.\n\nWild Side West is primarily a lesbian bar, but everyone is very friendly and the bar welcomes all types. (On several occassions perfect strangers have invited us to join their parties and partake in their food) I don't know anyone, gay or straight, who hasn't been charmed instantly by this place.", "author": "Johnny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-21", "description": "The Wild Side West was extremely unexpected.  There is the most incredible garden/patio hidden in the back of this place.  The initial interior is your standard dive bar situation with a pool table, some kitsch, and limited seating.  The garden in the back is what with take your breathe away.  It's like somebody pilfered all the most odd  pieces of furniture from backyards across the Bay and assembled them into nooks and crannies for intimate conversation.  I may have gotten one weird look from one of the lady patrons, but that could have been imagined.  I also thought I saw an animal in the garden, but it turns out it was just a leaf.  The drinks weren't magnificent because they weren't gay-man-drink-the-pain-away-bring-the-slutty-out, but some nice beers were on tap.  Overall, great neighborhood bar for lesbians, gays and all folks.  Take a walk on the wild side.  Ugh, even I hate myself for saying that.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-09", "description": "So many fabulous Sunday afternoons/evenings spent with my gaggle of writing friends, tucked away in some corner of the garden, surrounded by random stuff -- wonderful.\n\nBig, rowdy, makeshift jam band belting out chestnuts under the porch.\n\nWeird sculptures topped with plastic spiders and blow-up hammers and what's this weird old radio?  What's this plant doing in the hand of the little stone angel?  \n\nMMMMMMmmmmm. . .", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-29", "description": "Great little bar with a killer back yard. Everyone seemed really friendly after we settled in. Great conversation starter kind of place, too. Cash only bar.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-09", "description": "Shatangi gotta agree with Brother G. A very non scene gay-friendly establishment. Relaxed and neighborhoody.\n\nShatangi told you", "author": "Njon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "I'm pretty sure I saw a gnome or some other sort of magical creature run across my feet in the back garden last time I was there.\n\nBonus points for being the backdrop for the WORST. DATE. EVER.  Seriously, I'm glad that now I have a truly great story for my future dates when this question comes up.  Before I had to mention the guy who couldn't stop talking about his retirement account or the snooze-fest guy.  You have to be seriously crazy for me to be able for me to pathologize you in a single hour.  Borderline personality disorder much?\n\nLove you WSW!", "author": "Mat K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "SHHHH!  OK, never mind keeping it quite since I guess too many other yelpers like it too.  I love this dive bar. It is cool, good drinks and the patio is one of a kind.", "author": "S J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-03", "description": "On a nice summer evening, this is the place to be.  The \"Secret Garden\"  as I like to call it, provides hideaways and niches for stolen kisses.  I love bringing dates here and even though it is considered a gay bar, I feel extremely comfortable here.  The bartenders are sweethearts and the patrons are chill.  I prefer hanging outside as opposed to inside as the inside gets crowded and there is limited seating.  \n\nIn the garden, people play instruments, laughter is abundant and there is a tranquil air about.", "author": "Yasmine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-26", "description": "As opposed to The Lexington, this queer ladies' hang out is always chill, the pool table is accessible without a lifetime of waiting and mean look giving, they won't always get your drink right, but if you lose your ID here, you will most likely get it back. NEVER a problem with parking, or bathroom wait, and you can totally take your drink out back to the sweet dimly lit-up patio for a smoke and random conversation with strangers. \n\nWild Side West stands out on its' own of course, without being compared to a pretentious queer youth hang out, but I am just so excited that there is an alternative.", "author": "Micah R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-02", "description": "I have lived in Bernal Heights for 10 years and I really want to like this place. I have tried over and over to support my local dive bar...alas, when we sit at the bar we are treated like aliens and it is all business without a smile and a  slight mumble of recognition from the bar tendress.  Then you have to watch her stuff a burrito down her gullet and ignore us. We left like we entered.....like we were ghosts. They have Speakeasy Big Daddy on tap so I will be back, I just have to remember I am going for the beer, not the bar. Meh.", "author": "John A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-14", "description": "I think this is my new best kept secret, so don't tell anyone. From the outside this place looks like a hole in the wall, when you walk in your suspicions that this is a neighborhood dive are confirmed. But order yourself a pink lady and walk straight out the back door and down the stairs to the left. the garden starts from there and keeps going, back and back. there are numerous private seating areas and it looks like they might event barbeque on the weekends.\n\nwhen we got there for happy hour on a friday night, its true, it was mostly lesbians, and quite a variety of women at that. but by about 9ish when we left a there were a few boys here and there, so don't be intimidated if you haven't been to many lesbian bars before, they don't bite.\n\ni can't wait for another hot san francisco night, wild side west kicks zeitgeist's ass! now if only the tamale lady would stop by i would be in heaven.", "author": "Kai H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-07", "description": "My favorite place up on Cortland to grab a beer, for certain.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-12", "description": "What a great little neighborhood bar!  Nice people, cute girls, funny kitsch (even if I'd nver want it in m own apartment), and cheap drinks. I love San Fran.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-16", "description": "I think this bar is neat, beer selection is a little slim but what they have is pretty good. The magic is in the open space outside and in the backyard.\nDyke bar, yeah, sure, but they aren't unfriendly to auslanders.\nI too, experienced the dirty hippies playing music, but I managed to ignore them because I couldn't smell them.\n\nI think this is probably Bernal's coolest bar.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "Things I love about Wild Side:\n\n- The bartenders. They are hilarious, nice, and compete with the guy at The Knockout for Best Mixed Drinks in the Mission\n\n- It's the kind of place where you end up talking to people you don't know, even if you are a bit introverted. It's just that friendly. \n\n- Lesbians tell great stories\n\n- The back garden is like something out of Alice in Wonderland. You forget you are in the middle of a city\n\n- You can book the grill out back for a party\n\n- Good motown on the jukebox\n\n- It's three blocks from my house, which makes it the communal living room for Bernal Heights", "author": "Erica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-06", "description": "In a land of Boy Bars or Total Assimilation, this place is a good bet for a lezzie girls' night out.  Love the space, especially the table right in front of the fireplace, and the garden out back is killer!  One of my favorites in the City.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-22", "description": "Perfect neighborhood bar that also happens to be 75% lesbian.  Very chill place with a cozy feel.  I've never seen it crowded but there is always a few people.  You can play pool or go hang out in there weird statue/beer garden which is delightful.  Unlike traditional beer gardens its cluttered with trees and halfassed folk art creates nooks and crannies.   Not a place to \"pick up\" women, but rather a fun place to unwind with your buddies.  The catch is that its on the top of bernal so you will only go there if you live on the hill.  Maybe it's for the best, if this place was easily accessible it would be ruined by the masses.", "author": "BeeryMcGymrat X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "This is my gayborhood bar and it's a great place to get a drink and actually do some relaxing. Highly unpretentious, affordable, with a fabulous patio/garden. The patrons and staff are friendly and I appreciate that everyone mixes at WSW, even though the two guys I hit on ended up being straight. Oh well...I love this bar!", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "I don't really live all that close but will happily walk the extra blocks to come here for a drink. The bartenders are awesome. Inviting outdoor patio and fun people ... a good place to hang out and chill at the outdoor patio on a sunny day!", "author": "M J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-15", "description": "Haggard lesbian writers clutch to mugs poured by beautiful bartenders.  Construction workers chat over the game while enjoying ice cold servesas after work .  I love this bar, theres no pretentiousness, people are down to earth and everyone knows your name...well not everyone.  \nGreat bar!", "author": "ashanta r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-05", "description": "Isn't it amazing how things that are perfect for you can exist without your knowledge? How could I have lived in SF without knowing about Wild Side West, the coolest divey, straight friendly lesbian bar there ever was? Everything is better in Bernal Heights and Wild Side West totally proves that. The drinks are cheap and super boozy, the jukebox is great, clientele friendly & unpretentious and they have Elvis pinball. What else do you need?", "author": "Maria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-24", "description": "Couldnt get a bead on this place.  Very divy.  Found out later it was a lesbian bar, but when we were there, all kinds of people were hanging out.  Some old hippie dude was playing on the pool table.  Two motorcycle dudes came in, grabbed beers and went out back.  Hetero-looking couples hanging out.  They have Pyramid apricot ale, which I didnt notice until after I ordered a Fat Tire.  The one bartender wasnt very friendly.  The other, guess it was the owner, told us the story about Domino, the cat, whose picture hangs above the bar.  That cat had some long legs.", "author": "brewgirl b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "Wild Side West is quickly becoming my favorite bar in San Francisco. Really? you ask. That dingy little place? Well, friend, allow me to elaborate. I have never had a bad time at WSW, and I have been there, um, many times. Though this is undoubtedly due at least in part to the wonderful cohorts with whom I have had the pleasure of spending time at WSW, I have to give credit to the place itself. The jukebox is good (anything that puts Kanye West in the same collection as Al Green and classic country will automatically gain points with me), the drinks are strong and cheap, and though service can be spotty, it's really only because the bartender knows so many people that she can't help but chat a bit--- and she's always smiling. This is highly preferable to bartenders at many other bars who don't even give you the time of day. Plus, they actually respect women here, and will give us (especially we diligent and often underappreciated femmes) the preferential treatment we deserve-- not something I usually ask for, but I sure as hell do at a bar when drinks are at stake. I should also mention that this is a queer ladies' bar but by no means exclusively and by no means sceney (i.e., no cookie-cutter \"hipper than thou\" folk-- you know who you are) so most everyone should feel comfortable here, something I truly appreciate.\n\nThe ambience seals the deal, old-fashioned and quirky without trying too hard, like a combination of old west saloon and Victorian punch house, and the smoking patio/garden outside make for a lovely escape. Recently when some dear friends and I attended in celebration of my birthday, I had the pleasure of being serenaded \"Happy Birthday\" by members of a motley band who had a few moments earlier been performing holiday songs (to the best of their efforts) in order to raise money for \"the old people of Chinatown who don't have any.\" Friends, it doesn't get much better.", "author": "Janine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-01", "description": "There is something sexy about a woman bartender that could kick your ass, and they have them here. Known as a lesbian bar, but has more of a laid back neighborhood hangout feel. They have all the pre-reqs of a great bar: pool table, pinball, Galaga, and a good diverse selection of music on the jukebox (Talking Heads, Le Tigre, etc). Their courtyard on warm days is one of the best kept secrets in the city. Full rating is given for having Rolling Rock behind the counter.", "author": "Bucky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-22", "description": "Probably the most fun and diverse of the night hangout spots along this strip. While the average weekday/night visitor is most likely an older local, this will also have the youngest customer base of any of the bars in the area. We used to step onto our balcony to see who was at the WSW balcony to gauge the crowd and determine whether to head over or not. Still a fun place. Verrry laid back. Fantastic outdoor area. The crowd is eclectic for sure -- especially fun to discuss politics. The late afternoon early evening sun time is the best window to start an evening here!", "author": "Tanya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-29", "description": "The interior of this Bernal Heights watering hole, with its bohemian charm, resembles an old-style saloon, with a long bar, mismatched tables and chairs for playing cards, a couple of pool tables, and assorted tchotchkes on the walls. The interior takes second place to the outdoor space, with its bi-level patios, shrubbery and sculpture garden, and hidden nooks and crannies for private tete-a-tetes. Bird feeders perch on rustic artwork, while patrons relax on furniture fashioned from cinderblocks and driftwood. It's known as a lesbian haunt, but it's really more of a neighborhood hangout in a neighborhood heavily populated with lesbians. Males are more than welcome, and gay men more interested in socializing with a friendly crowd than cruising for tomorrow morning's brunch date will find its charm and character a refreshing change from the oppressive atmospheres found in Castro and SoMa bars. For basically non-bar people like myself, this is a five-star bar .", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-12", "description": "Admittedly, I was a little intimidated when I read about this place, which is why I was all the more pleasantly surprised by the laid-back atmosphere.  Certainly the most impressive part is the stairway and garden in the back.  When I was there a local neighborhood band was shooting the breeze and practicing, they weren't bad either!  Also, props for having Hot Toddies on the menu.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "I love this bar especially when its sunny out. Has a great garden area in the back to sit out and enjoy your favorite drink. Good drink prices with a coin opp pool table. In addition Mr. Nancy makes some outstanding drinks. I've also referred some of my friends to go there and they seem to love it too.", "author": "Roc O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "The back patio is what I'd want my backyard to look like, minus the dirty hippies playing \"mildly offensive\" music.  Note to the wise: the bathroom on the right is much nicer than the one on the left, plus you get to admire the artist who turned a regular penis drawing into a happy elephant!", "author": "Jess T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "cool and comfortable. would love to come back when it's warmer and hang on the ah-mazing back patio. until then, I'll enjoy the decor, jukebox, and strong drinks", "author": "Caddy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-09", "description": "think \"the secret garden\" \nadd beer\nadd hidden bbq grills\nthat is wild side west\nit feels so exciting in this very childlike way to wander through the endless garden seeking out the perfect little nook to make your own...\nthere are far too few outside drinking locales in this city and this one has even taken the trouble to make the garden cool!", "author": "Sole A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "Great neighborhood bar.  Of course, the patio with its nooks and crannies allows both privacy and coziness to meet new friends(like we did tonight!).  I especially love the fireplace for those cold SF nights.", "author": "michelle s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-13", "description": "No matter what, any bar with a good beer garden always gets 5 stars from me.  wsw has one of the better beer gardens I've seen - or rather, one of the most unique.  The bar itself feels like an old time saloon that's gone berserk.  The patrons and bartenders are so nice.  One time I was there with a buddy and the bartender was talking to her friends; although there were about five other people in the bar, she spent a full minute finishing up her conversation with her friends.  I liked that.  I can appreciate a place where there's no real rush and the rockin older butch bartender takes her time wrapping up the conversation she's having with the two women across the bar before serving the guys that just walked in.  Right on.\n\nWhen you walk out into the beer garden it's like in the remake of \"Great Expectations\" with Gwyneth Paltrow and Ethan Hawke when they enter Paradiso Perduto and the ethereal music starts playing, there are old fountains filled with leaves and statues, empty claw-footed bathtubs with vines growing on them, etc.  Rad!!!", "author": "Mr. A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-14", "description": "Fun,divey mixed bar. Love the musty funk! Good jukebox. The back garden is a magical place. So many nooks and crannies to snuggle in or just hang with your special peeps. My only complaint is the staff. The bartendresses are not always the most friendly or attentive. I have stood at the empty bar for ten minutes just to get a beer. Ouch!", "author": "sockanooni s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-08", "description": "the infamous lesbian bar...\nand yes i have seen them there..  the ones w/the short hair, the ones who wear the sport coats, the lipstick ones...  it's cool though, they're real cool.\n\nso i've been here w/an old male friend...he took me to the romanitc patio.. it's real cute.. not like romantic pretty and shit.  but i mean great vegetation, cute lights around the plants/trees... random benches... you could get cozy here w/a hot date...  too bad i wasn't really into this guy...  so it wasn't much of a romantic night..  but i dream of taking my bf who i am into here one day.. then it will be a romantic night..\n\n1 great memory about this place...the lesbian w/the sports coat beating my old male friend's ass in pool.  that was a hilarious scene to see.  she knew she was gonna kick some serious ass too.. what more a man.. her chest was puffin' out.  \n\ni lost my pipe here.. later coming back to get it back in it's little pouch, sans the trees, but it was great there are good herb samaritans out there!", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "A really great space and almost all the people are great.  But twice I've been there during the day (and read about someone having the same experience in the guardian I think) when some lady was trying to work out some inane cover on her guitar while playing snippets over and over.  This should not be done in public that's why jesus invented houses.", "author": "Ed B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-25", "description": "You don't want to come here. It's not for you. Nope no fun at all just keep on walking. Really just stay away.", "author": "paul a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-24", "description": "My heart was lost somewhere deep in a jaeger bomb at the highest hour of the night. Thank you.", "author": "Kiki C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "I should have been coming here because this is the spot in the neighborhood! It's lively and fun and everyone has such a great energy! There's games, music and a pool table--pick your favorite. And the drinks are good and at a good price! I love it! I will be coming back here again!!! Fun Fun Fun! :)", "author": "Mel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-15", "description": "I love WSW's creative use of restroom items such as the bathtub planters in the back, the toilet-seats-turned-picture-frames on the walls. I love that they have Salt n' Peppa AND Willie Nelson on the jukebox (get out of my HEAD wild side). You've read enough about the back patio at this point but seriously, it is rad. I love the one Elvis-like bartender despite, and maybe because of, her goldfish-like memory of drink orders and resulting abracadabra prices she comes up with. Spent many a birthday and date here.  Even had the Indian pizza joint deliver here for my birthday, it was a-okay with the ladies of wild side. Its a trek but I need to get there again soon (and just stop bothering with the Lex altogether).", "author": "Abby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-01", "description": "A friend and I ended up here after we decide we wanted a drink and a bar neither of us had been to before. It was a wonderful surprise. It was exciting to discover the back garden. It has wonderful seating nooks and even a porch swing. It was on the chilly side that night, but we toughed it out and had a few (too many) beers. I will definitely go back when the weather warms up. I have a feeling it will quickly become a favorite!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-03", "description": "okay people....just because san fran is a veritable dryland for lesbian bars, ya don't have to give EVERY one of them an automatic 5 stars\n\nthat said, WSW is a great bar...like a clean dive with lots more character..very friendly folks...and a woodstove!\n\nif it had more pool tables and a bit more space, i might give it 5 stars\n\ntip:  if you are hungry, the italian place across the street and up 2 doors is phenomenal...awesome bruchetta and pizza...and you can bring food into the bar", "author": "Guinnivere B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-25", "description": "I actually like this bar a lot.  It's just so quaint and almost campy.  The bartenders are nice.  It has always been a mixed crowd there...gay, straight, sporty, not so sporty, etc.  They have a nice patio garden area to enjoy when it's not so cold.  I like that the bathroom sink is outside of the toilet area, you can see who washes their hands after tinkling.  :)", "author": "jen n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-07", "description": "You could easily miss the big deal about this bar if you don't do a little exploring... the massive garden in the back is what it's all about.  A little creepy, but in a good way.", "author": "Sleuthy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-07", "description": "This is a good place, the people are always really nice, the decor is funky, they have a pool table and they have a great patio out back, which is perfect for smokers, and there are all these nooks and crannies so you can have some privacy,there are always people playin acoustic guitares out there. I really like this place, but my heart belongs across the street", "author": "JIll H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-28", "description": "\"I only had a moment in this bar, the drinks seem pretty standard as did the pool table and the jukebox. However the two items promot this bar above most of the hundreds of sf bars are the back yard/patio and the clientele. The people are a mix of age and coolness. The young and old mix as do the hipster and that dude in sweat pants. A back patio in an SF bar is rarer than a pitcher of ice tea in hell, but even so this yard is a stand out, with discreet night lighting, fountains, trees and plants, statues, art work, and for lack of a better name, little make-out nooks. I was enamored instantly. All of that and Maggiemudd is only blocks away.\"", "author": "Ian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-17", "description": "Well, I'm not a lesbian either, and I also like this bar! I have been here about 5 times and each time that I have been outside in the back, there have been friendly types of all shapes, sizes, and cultures offering you a smoke of the regular or the wacky tobacco type. It's quite a nice place to hang out.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-25", "description": "super great place to be drunk at.\n\nweird ass backyard with all sorts of statues and shit strewn around it. bad times if you are drunk because if you are like me you will lose balance and fall onto a statue and bang up your legs.\n\nstrong drinks\n\npretty good prices\n\nrad marys and very good mojitos which im sure they hate making. they let you bbq in back,bring weiners and you are set!", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-18", "description": "Just a four block walk from home, who can complain about that... the back is great to sit with friends in the sunshine and the pool table is always inviting... I'm really gald to have this in my neighaborhood!", "author": "Joy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-11", "description": "Fun kitschy decor, good jukebox, great outdoor patio and back yard, and wonderful mix of all types of people.  Not the kind of bar you take a clean freak to, though, unless they don't mind seeing the occasional rat running along the trees.  But I love it!", "author": "Bodacious T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-24", "description": "This is exactly like your neighbohood bar but instead of older retired dudes wearing poorly-fitted ballcaps, think older retired women. Had a great time here one night a while back with a friend; the bartender was cool as were the patrons. Great place for shooting the shit or starting an evening off.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-28", "description": "Best lil garden bar in SF!!! Rumor has it Janis Joplin got down on the pool table.", "author": "Amaris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "One of the best outdoor drinking spots in SF. Drinking a mojito on a bench hidden in the labyrinthine plants = Happiness.", "author": "Saleema F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-05", "description": "You are a guy and you go into a bar with paintings and pictures of nude women on the walls, sports on the t.v. and occasionally two women are making out---and no sexual tension. It is like the womb! A secret entertainment is out back at night when you can watch rats scurry up the palm trees. Great bar!", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-18", "description": "This is my favorite neighborhood bar. It's very laid back, the drinks are cheap, pool is 50 cents per game, and there is a bizarre garden in the back. sometimes people bring their own guitars and play music. No one cares what you do. \n\nWhile this is a lesbian bar, everyone is really welcome there. I would say you might not even know it was a lesbian bar at first. Many people from the neighborhood hang out there, straight men, gay men, gay women, straight women, etc. I have never felt weird as a guy there and there are always all stripes of life hanging out there. \n\nOn big football days, they have a \"football boo-fay\" which consists of hot dogs and baked beans on wonder bread hot dog rolls. It's pretty amazing!", "author": "Gieusse P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "I came here a few years ago to slake my thirst after walking my lazy ass up to the top of Bernal.  I forgot everything about this bar except the nonfunctional fireplace strewn with odd shoes in the middle of the room.  BUT I missed out on the best part, which I discovered last night: THE PATIO.  \nThis ranks among the neatest (yes, I said NEAT) outdoor patios I've seen in SF and beyond.  It's like a secret garden with several intimate sitting areas, funky old junk decor, and porch swing.  At night, cords of bright-colored lights provide the only light and friends sip and chat in the dusk.  \nWe had a great time sipping Mickey's grenades and soaking up the bayou-like ambiance provided by the guy with a banjo (!).  \nThe beers were of average price, the crowd inside was fun and friendly, and the bartenders chatted us up appropriately.  \nIt's like an old shack full of your friends where you can play in the backyard.  And it's a bar!", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-10", "description": "The back patio is simply awesome. The moment I went out there I literally got lost, okay maybe I just had a little too much to drink. Still, having a pool table to greet you is all I need to hang out with my dikes.", "author": "Bernard V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-17", "description": "I am not a lesbian but I like this bar. The open patio/backyard area is very nice. The whole decoration is very peaceful and cool. If you have a small group friends and want to relax and talk a bit. That's a good place to go.", "author": "Yina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-18", "description": "one of the things that i  miss most about living in SF is wild side west. i was always dragging my friends up to bernal heights to go to this place. it's HELLA worth the climb up cortland street! that's right, i said hella. \n\ni miss the garden, the cheap booze, the elvis pinball machine and the ms. pac man.... i miss listening to random people playing their guitars in the garden outside... miss watching folks get all competitive over a game of pool...miss the jukebox...miss considering buying a pack of american spirits behind the bar just because i was tipsy...\n\nthe only thing that i don't really miss about the place was the service. it always seemed to me that if you weren't one of the regulars, it took extra long to get served. still, it's hard to complain about this place...", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "i love this place!  My friends first turned me on to it long ago and I now never pass up the opportunity to go.  Sure, its far from the middle of town, and it might take you a while to get served a drink depending on who is bartending, but it is a great place.  The garden outside is nice.  Great to find an alcove and chill with friends or get a little frisky with a special someone in a dark corner ;) mmmmhmmmm!", "author": "Suzanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-06", "description": "Wild Side has a great vibe. Been going there for years and love the outdoor spaces, particularly the back patio in the afternoon on a sunny day. The conversations are always interesting and I've never felt out of place as a breeder. The bartenders are great, especially Tierney, Regina and Mr. Nancy, who is a veritable encyclopedia of punk rock knowledge, and the drink prices are the best in the city. Buds are 2 bucks and Anchors are 4 bucks. Can't beat it with a stick. And you can almost always park right out front.....Any other places like this? Let me know and I'll check them out, but I sort of doubt it.", "author": "Armand C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-20", "description": "The eden in the back, and the groovy, dreamy lighting. Who cares about the drinks (though they're fine). They could serve pickle juice and I'd still love this place. Pool and garden haven under the stars. So magical, tucked away like a perfect secret.", "author": "Cate F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-14", "description": "Thanks, Yelpers... This place is cool.  From the bar that looks like something out of Alaska in the 20's, to the garden in back with nooks, crannies and a clawfoot tub made into a planter! We went on a Friday evening (6 p.m.) with a friend from Chicago.  The place was a little dead, but picked up quickly.  Many places to hide out in the garden, have a beer and just kick back.  The fact that it has been described as a \"lesbian\"  bar is a bit misleading.  There are lesbians, there are straight people, and everyone was incredibly mellow.  I can't see anyone having a bad time here unless they listen to Rush or Hannity on a daily basis.  Oh, and to the people at the bar that night.. Sorry about our Chicago friend snapping photos.  He just thought it was a cool place.  I know it seemed like the old \"straight guy from out of town shooting pictures of S.F. lesbians\", but he just thought the bar was incredibly unique. \n\nWarning... I'm bringing my guitar next time.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-18", "description": "How can you beat the friendly vibe, the awesome garden, and the laid back atmosphere?  It's pretty much the only place I take my friends for a drink and a conversation.", "author": "Brent D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "One of my favorite bars in the City. It's enough to make you look at \"For Rent\" signs in the neighborhood! Lovely backyard garden.", "author": "Juliette T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-15", "description": "This place is fun if you want to go and chill and have a conversation. Say...for a first date. I recommend going early (so maybe a place to go before you hit the night clubs) and checking out the back yard/ sitting area. Wonderful art, great drinks and fine woman.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-26", "description": "The absolute best lesbian bar in the city... but no pussy drinks here!!  I'm so happy I live in Bernal Heights!", "author": "Renee A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-21", "description": "I've been to the WSW many times and only by default since I live up the street. I like to support the neighborhood businesses even if it is the filthiest place I've ever been in, dirty tables, restrooms etc. I know, lets try a remodel, paint, dump the dated crap on the walls and fireplace and give it a new start. Now the rest of the story: The Bartenders, OMFG!!!! Horrible, I actually watched the bartender ring up $4.00 for our round of drinks (4) and charged us $21.00. So lets see, 4-21=17.00, she's making bank! They have the same miserable bartenders everyday, lacking personalty, class, and conversation, which explains why they have no business. It would be very hard to have a business on Courtland and fail, the only competition would be the Stray bar up the street and that smells like a urinal. Since the \"New Owner\" came into play, we all hoped she would clean the place up, add a little class and charm. That didn't happen. My friends and I went there the other night...again, to play pool, thinking it changed. It did, they now have a male bartender, WTF!! So, the place is now officially a dump, but why bring a male bartender into the picture? Is this a form of desperation or it's going to the men? No longer a lesbian place?? This place had great potential with the right people and different owners working it, it would be 5 deep at the bar. So it's off to the Lexington for a good drink with a bartender that has a personalty and a sense of humor.", "author": "Joy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-02", "description": "We used to come across town to hang out at this laid-back bar. Now it's our 'local' and we couldn't be happier. It's best to go on a sunny afternoon and hang out in the cozy back garden. Everyone at WSW -- the patrons and the staff -- are great. Even my guy friends feel welcome.", "author": "anita c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-21", "description": "This is a well known lesbian hang out.  I'm not a lesbian but loved it all the same.  I enjoyed the back yard/patio area...you are instantly transported from a dive bar to a different world when you walk out the back door.  Groups are playing folk music on guitars and lounging around between the thousands of plants.  Comfortable place since it's pretty quiet and homey.", "author": "Allison K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-09", "description": "Hot lesbians, good beer on tap and billiards.  Need I say more?", "author": "Walter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-15", "description": "LOVE this bar!!!  I don't even know where to begin.  Cheap drinks, friendly, casual atmosphere.  I LOVE the back yard.  A great place for Lesbians and well, anyone.  I much prefer this bar to the Lexington any day.   A nice mixed crowed without the hipster attitude.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-20", "description": "Nice bar with a lot of interesting decor. The patio area in the back is pretty cool. I heard some interesting conversations while I was back there. There was a lively crowd in there on a friday night, and even though I heard this was a lesbian bar, there were plenty of people of all orientations, including me and my gf. The parking around here could be a pain but if you're not driving then its good for a few pops.", "author": "D J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-17", "description": "I would have given it 5 stars, but it's just so hard for me to get to.  What's up with public transportation to Bernal Heights?  I love the outdoor deck and garden, where I once spend almost 6 hours one Sunday.  Cheap beer, cute girls, and sunny afternoons make the Wild Side a great place to spend a lazy day.  Plus they love my friend Cat.  They even made a sign proclaiming their love for her.  So it's all good with me.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-23", "description": "Relaxed and friendly bar with an awesome jungle like backyard.  Seriously, you could get lost in their backyard after a few drinks.  Always seems to be some random person playing a guitar down there.  The bar itself is pretty standard, with a nice pool table and a few places to sit.  Good strong drinks if my wife orders them.", "author": "John K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "WSW is tucked into a tiny house on Cortland Avenue, but the facade is deceptive. Step inside and discover the huge back garden, which is full of art and strung with lights, and has plenty of quiet secluded areas with porch swings and tables. It's a wonderful getaway -- you feel like you're in someone's artsy backyard, a little like Zeitgeist but with more shrubbery and without all the drunken yelling.", "author": "Beth W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-25", "description": "Best dyke bar I've ever been to, although, you'd never know it without venturing out back, down the stairs, through the myriad secret garden nooks where you may want to make yourselves a little more comfortable. And the best part is the unpretentious yet innately hip clientele (if that isn't too self-aggrandizing), impromptu banjo ballads and sing-alongs in the \"music\" nook, and the strangely (yet dangerously) rejuvenating quality this place has...for a bar. I'm a bit mystified.", "author": "M A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-22", "description": "What happened to the murals????? I loved them and now it is a big white boring wall of .......nothingness.", "author": "Deborah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "very comfortable and cozy atmosphere and a magical back patio (but the patio closes at 10pm) i can't wait for long summer days so I can enjoy the patio in daylight. pool is only $.50 and the bar has a great selection of beer, wine and liquor. they even have specialty cocktails! the juke box has a decent selection and is fairly priced and there is a nice fire place as well. i can't wait to go back i just wish wild side west were closer to my house.", "author": "Leuwam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "Gay, straight, questioning - it doesn't matter here. If you're alive, you will enjoy the back garden at this Bernal Hill haven.  From the community of musicians that gather on weekends to the 20 somethings rolling special cigs, this is a SF MUST SEE. You won't find tourists all the way out here. Start your afternoon with a hike up the hill and chase it was a pear cider from WSW. This is possibly my favorite bar anywhere in the world.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "I love this bar, its got that only in San Francisco saloon/dive/queerbar vibe with anchor on tap and a friendly attitude to us straight folk. Oh ya and the back yard rips.", "author": "Gabe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-29", "description": "Great lively bar and can be overly crowded at times.  Nice garden on warm days.  Bartenders are fantastic.", "author": "May M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Sometimes the bartenders are a little surly, but the back garden more than makes up for it.  I recommend taking a Stella and a Jameson out there with your besties on a sunny day.", "author": "Hallie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-22", "description": "Wild side is a San Francisco institution.  I'm told that Janis played pool on the same table that is there today.  Drinks are pretty solid, and the ambiance is cool.  The garden out back is just cool, intimate and interesting.  Friday night - you can feel the girl power.  Lots of fun.", "author": "Fiid W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-08", "description": "One of the great bars of the City. I've spent many a night closing this place down. Always an interesting crowd having a good time. The bartenders are memorable and the juke box is filled with a broad range of great tunes. I am glad they cleaned up the back patio area, however- it used to be swarming with vermin late at night. But now it is very safe since they took the seed filled bird-feeders out and got a cat to patrol the area.", "author": "Stefan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-24", "description": "Best bar on Bernal Heights! The back patio and yard are great for a sunny afternoon buzz, and the bartenders kick ass. Everything you could want in a bar.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "My gf and I have been interested in checking this place out for months, since there's definitely a lack of lesbian bars in S.F. Finally made it out, so to speak, and I'm glad we did. It was really low-key, pretty slow (especially for a Saturday), but it has a great vibe and good-priced drinks. Bartenders were cool, and I've no complaints. \n\nOnly reason the place didn't get five stars (can't do 4.5) is that it didn't really feel ... well ... gay. Not that that's a bad thing; my big knock on the Lex is that it's too butch. Wild Side West feels much more inclusive, which isn't a bad thing, but it's not as \"gay\" as I would've thought.", "author": "andrea a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-27", "description": "Loove this place!  The garden in the back feels like you've stepped right into the secret garden, complete with overgrown vines, little white wrought iron benches and hidden nooks.  Awesome bartenders and chill crowd.  Maybe I haven't been there on a really busy night when it could potentially get rowdy, but it's been laid back the two times I've been there.", "author": "Tanya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-17", "description": "I really like this place, great neighborhood bar and the oldest lesbian bar in SF! The crowd is mixed, gay and straight. Great beer garden, pool table and a descent juke box. Regina is definitely my favorite bartender there.  My only wish is for the bartenders to buy back once in a while.  Also, they don't have a happy hour which is kind of a bummer.  Besides that it's a really good place to meet new people. Definitely a must!", "author": "Linda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-06", "description": "I'm not a lesbian but I love this bar.  The drinks are cheap and they have a fun cocktail menu, but only take cash.  The bartenders can be a little surly, but that just adds to the atmosphere of the place.  The highlight is really the back garden.  It winds around and surprises you with little nooks which are great for private conversations, and they have areas good for large groups.  We make a beeline for this place any time there is a warm night (which of course is rare in San Francisco).", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-16", "description": "supposedly for lesbians but i am cool with lesbians so i like it.  even though i am not a lesbian.  not that i am not cool with lesbians.  anyway!  love the lesbian patio in the back!  just kidding, i will stop.  go here on a warm(ish) summer night and the next evening you will find yourself driving here even though you meant to go home.  the first time i visited, i ended up returning 3 times that same week.  this tells you two things...1)  wild side west is a great bar with a magical back patio and 2) i am a horrible, terrible lush.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-14", "description": "I love this little neighborhood bar but the bartenders are awful! If you dont feel like drinking then go to Wild Side. I went in and there was only 3 people at the bar and the bartender completely ignored me and was taking shots with her friends.", "author": "Doug S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-25", "description": "good bartenders, mixed crowd, multiple chandeliers, shoes lying around a fireplace and a giant backyard in which to puff all kinds of smoke.  five stars.", "author": "Charly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-03", "description": "What can I say about this place?  Well, let's just start off with the atmosphere.  It's pretty laid back, with several regular patrons who enjoy chatting with the bartenders and others.  The jukebox is good, probably could do with some updated cd's, but good enough for me when i've had a few cocktails in my system and can't even hear the music by that time.  There's a really cool and eclectic outdoor patio/garden (urinals and other bathroom fixtures are perfect pieces for art).  Plus, the pool table never has a long line.  Anything else...oh yeah, there's one of those sit down multiple video game console thingy's, a Galaga/Ms. Pac Man game, and a pinball game that they always seem to rotate out every so often.  No attitude, easy parking, great selection of alcohol, yummy specials, and snacks.  What else could you ask for?  Well, actually, I would ask for more tables, but hey, I'll take the easy parking anyday over the option of more tables.  Oh, and I really like the fact that the bartenders don't mind if I bring my own food in.", "author": "Kris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-12", "description": "Very relaxed neighborhood bar... their back patio is like an enormous secret garden... wonderful seating, art, and landscaping. The patio closes earlier than the rest of the bar so don't show up late and expect to be able to be outside in the gardens. This is a lesbian bar that is extremely welcoming to all...", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "Even though WSW is listed as a \"gay\" bar, I always find it just as much a neighborhood bar.  The back yard area is very comfortable, and there are plenty of secluded places to get a little privacy if you just want to talk or something. And no attitude. Definitely a plus.", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "this is one of my favorite bars. amazing garden, ramshackle with lots of nooks and crannies to sit in. murals in the bathrooms. fireplace inside. pool. cool bartenders who check my id every time i go there(thanks). the perfect place to take shelter in a rainstorm, or a sunny afternoon.", "author": "nattles l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-04", "description": "this is a amazing bar.  the backyard here easily surpasses el rio in its greatness. it reminds me of my eccentric hippy grandma that never left her little suburban cottage and grows, if i had one of those.  theres a big fireplace in the middle of the bar and it is covered in high heels and other various painful footwear.  the barkeeps are nice and efficient, but youre not there for them.  after you get your drink (you can get a hot toddie or irish coffee btw!) go outside.  the patio is nice but dark and boring.  go downstairs to your right and theres a little lighted area under the patio where people seem to have sing alongs and jam sessions, nothing too granola and if its not your scene you can keep going.  farther in you'll find nooks here and there to stash yourself to talk or smoke or 'whathaveyou'.  all in all, its a fun adult version of swiss family robinson meets the smurfs.", "author": "regan g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "GREAT outdoor patio, extremely diverse group of very friendly folks -- behind and in front of the bar.", "author": "DD M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-07", "description": "i started at the wild side getting bloody mary's with my friends on sunday mornings. they had this bartender, robb, who opened the joint early--10am--on sundays in football season. we didn't give a shit about the games, we'd order up the bloodys and take them in the amazing back yard. you've got to see the garden by both daylight and at night. the only drag is that the garden closes early, but it's not the bar's fault. the drinks are strong, the air is friendly, and you're bound to meet true san francisco natives at the bar. it's a true favorite!", "author": "Sidney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-13", "description": "chill and fabulous dyke bar, back garden and patio are awesome, classic lesbians and younger dykes abound!", "author": "Erika Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-01", "description": "wsw is a perfect neighborhood bar. the patio is great on warm summer evenings. i've ended a few memorable nights there including NYE when they sold drinks to my group, then kicked us out (they were closing) a mere 30 seconds later. gotta admire their tough love style. plus, i scored a whole new set of pint and whiskey glasses that night. thanks wsw, you're the best!", "author": "Megan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-07", "description": "i came here last nite, on a wednesday night around hmm 10 maybe? for my first time there. yes, i said on a previous review i doubted id go back to bernal heights, but apparently i did. so, wild side west was dead. there were maybe ten people in there. i couldnt really tell it was a lesbian bar, it just looked like a bar. kind of a dive bar, with lots of weird decorations, including a fluffy white thing we couldnt figure out what it was. there is a jukebox for music, and z put in some songs but we never heard them.  mostly old type music in there but some random things like a missy cd and justin timberlake. but mostly old countrywestern or rock or whatever. i dont even know. neither of us drank anything, so cant comment there. the reason why this basically empty bar in the middle of nowhere got 4 stars is because of the garden. if you go out the back and down the steps, there is a garden, just like someone's backyard. there were just 2 other people there, who i scared away by accidentally talking about rapes. they were fake, movie rapes, but they didnt know, and they got scared. stopped conversation, stared at us worriedly, then pretty much left their drinks where they were and ran. the garden is decorated with old tubs and sinks and random junk objects which create a sculpture type effect. it is very modern artsy and i enjoyed it. it was a great place to sit and chat, just like we were in our own backyard. the neighbors did close their window. if 2 people talking bother then then imagine what happens when theres a crowd out there on the weekend. i imagine there must be a crowd there at some point. so go there on a weekday night (in my neighborhood everyone is out, but in bernal heights theyre asleep or dead or something) and you can have the place all to yourself.", "author": "Merredith L."}
