{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Honestly this may be the best Chinese food we've ever eaten. And we eat a lot. Any restaurant that you can have 4 kiddos with you on a daddy (daughter x4) date is a hit... but when said Kids rave about how delicious the veggie fried rice is, you know you've got a winner. \n\nWe got the standards...\n\nVeggie spring rolls - perfect\nGeneral Tsao's chicken - (crispy on outside, moist on inside)\nMongolian Beef - perfect amount of heat. Vegetables were still slightly crunchy (which is right). \nVegetable fried rice - I've already commented... but the most flavorful veggie fried rice we've eaten... and did I mention that my 4 children loved it?\n\nWe're passing through San Francisco going back north. So glad we found this place.\n\n5 stars is the best rating we could give. My girls voted and said they'd have given it a 7 Star is that was possible.", "author": "Brandon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "Located in Glen Park near the Bart station, this Chinese restaurant seems to have the locals coming back. Seeing as it's on the narrow and winding Diamond Street, street parking is sparse, but there is a small lot across Chenery St behind it. Bart really puts this little strip of restaurants on the map, as well as a couple Muni lines.\n\nThe interior was quaint like many traditional Chinese restaurants. They have quite a few larger tables; I wouldn't be scared to come here with a group of about 8 or less. We went on a Wednesday evening and I'd say it was about 60% full.\n\nThey have complimentary tea, upon request. We ordered beef chow mein, kung pao chicken (I highly advise), and an eggplant dish. The veggie dish ended up being my favorite. It was pretty oily like most Chinese food, but not overwhelmingly so; and it was very tasty. Our waiter was attentive and did not leave our water glasses empty. Overall very average experience; won't make a point to return.", "author": "Navila H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "If you're feeling lazy to cook, Win Garden could be a surprisingly good option!  A couple ordered food from here and brought it to the bar we were watching the Warriors game at, and oh man, with that delicious smell of Chinese takeout, I just had to ask where they got it from!  She said it's her favorite Chinese spot in the city and pretty much swears by it, so I gave it a bookmark for future reference.\n\nOne night, my sister and I needed to eat some dinner and most places were either closed or almost closing, so we decided to try Win Garden.  Staff were really chill and got our order in and out quickly.\n\nWe ordered the Korean Fried Chicken and the General Tso's Chicken, and a small box of white rice.  We appreciated that their take out containers have a corner slit open so the food doesn't get soggy or whatever.  Both dishes were really good!  The General Tso's Chicken was flavorful and the Korean Fried Chicken was crispy.  The General Tso's Chicken even came with some broccoli.\n\nThey're great for take-out, and delivery is free with a minimum purchase of $20.  I'm glad that couple recommended this place to me and that it's actually a decent restaurant!", "author": "Stephanie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "Came here with my aunties as we were meeting a friend from San Francisco for lunch and this place is a Win-Win situation as it is close to Bart, about 2 blocks or so and it is comfy and the food is delish!  We each ordered a dish and so we had crispy chow mein noodles with seafood and vegetables, fried calamari, Westlake beef soup and minced chicken in lettuce wrap!  Food was nice and hot and good sized portions!  Great comfort food!", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "Great, tasty food, well prepared and seasoned. Service is good, courteous and efficient. My husband prefers the sweet and sour meatless chicken over the real thing and he is not a vegetarian. Pot stickers are delicious, dry pan fry string beans, and their fried rice and chow mein are delicious.\nI usually order delivery or takeout and it's as good as dining in. Lunch specials are well priced and restaurant is clean. Parking can be a challenge...but worth the trouble.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "I ordered dinner for delivery from this restaurant and the estimated time is 60-70 minutes. The delivery is about 10-15 minutes later than estimate which is less ideal but the foods were very good so my hungry stomach didn't complain too much. The foods arrived hot which I loved. The portion was good size as expected for a Chinese restaurant and full of flavors. I got their Singapore noodles, basil chicken without spicy, Mongolian beef, and shrimp with snap peas. I was glad they remembered to not add any spicy to the chicken because some restaurants would forget! My family enjoyed the foods and we would order again!", "author": "Lena H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "$40 for chicken chow mein, kung pao chicken, pot stickers, bowl of white rice, and two Sapporo. The food was savory and delicious, and came out quick. \n\nIt wasn't too busy for Saturday dinner so the waiters were quite attentive. The server even brought us a child's plate and water without being asked. It may seem unimportant, but that was awesome to me. \n\nIt's pretty much at the corner of Diamond and Chenery with metered parking in front. Sometimes parking can be difficult in this area -- do be warned. \n\nWe will definitely be back to this place!", "author": "Ximena C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-13", "description": "The most unprofessional delivery service I've ever experienced. Apparently Eat24 sent a courier from the restaurant to my address, and the worker was under the impression that he was entitled to a cash tip. Tips are optional, and a courier can't demand specific tip payment. He just left my residence with the order, having texted that I wasted his gas and can feel free to pick up the food. Umm, fuck you.\n\nUpdate: I've spoken with Eat24. They will deal with the restaurant, and they are canceling my order as well as providing a $10 credit toward my food purchase from a professional business.\n\n--\n\nUpdate: Restaurant suspended from Eat24. Wouldn't mind if Grubhub did the same, especially since the apps have merged.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "We love this place! Found this gem with the help of yelp! The food here is delicious my favs sizzling rice soup has so much flavor order it you'll be happy you did! Bbq pork, Fried rice, chicken chow mien, sizzling beef, the list goes on! Everything we have tried has been good thank you!", "author": "R V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Win Garden knocked my socks off. I ordered pickup from here years ago and there was a mishap that resulted in me leaving annoyed and empty handed so I've never gone back but that was a huge mistake because the food here was fantastic. The potstickers were some of the best that I've ever had. The fried rice was insanely delicious with big plump flavorful shrimp and a nice mild flavor in the rice. The chicken chow mein was good, lots of chicken in it and just what you'd expect and want. Lastly, the Kung pow chicken was perfect too. I loved how plentiful the peanuts were in that dish. This is my new Chinese spot 100% I can't imagine choosing anywhere else, especially after Shanghai Dumpling on Monterey went downhill in the last year :/", "author": "Emma H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-15", "description": "Was hunting for Chinese food in the Excelsior and came across Win Garden on Yelp.  4*so I thought must be pretty good.  I was wrong.  Ordered a couple of simple dishes - chicken chow mein and BBQ pork won ton.  Food was ready in about 15 minutes.\n\nUnfortunately, the chow mein was super greasy.  At the bottom of the take out box was a pool of grease.  Noodles were bland.  Won ton no better.  Not much taste.\n\nWill try other local options when in the mood for Chinese.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "Service is piss poor, I've waited over 90 minutes for my food and when I called the woman was extremely rude. With so many other Chinese options around, there's no reason you should go here", "author": "Seth K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-21", "description": "Was it Win for the win? I don't think I was looking for anything special when I got off at the Glen Park BART station, just something for dinner on one of my solo nights when Jamie W. was busy being civic minded. Me, I get busy eating something he probably wouldn't want anyway. I was strolling along Diamond eyeing several places crowded with lingering diners and just happened upon this nondescript Chinese restaurant by accident. As far as the customers, there was only one couple in the entire place.\n\nI had a feeling they were related to the owner since they were taking up a large party table all by themselves (photo: http://bit.ly/2nR8JFo). I could tell this was a serious operation by the unsmiling faces of the staff. Their menu was also eight pages long with small print. It was a fakakta novel. Not Kafka, fakakta. It was a lot to study without Cliff Notes, but I decided to start with the $9.95 Garlic Spinach with a big bowl of white rice (photo: http://bit.ly/2njoadl). It was a no-frills treatment that still satisfied, and the portion was more than enough for one.\n\nSpeaking of which, I decided to splurge a bit and ordered the $13.95 Roast Duck Half (photo: http://bit.ly/2nKeDat). I was just having a major hankering for duck, and with the crispy skin and fatty meat were definitely what I was wanting. I ignored the plum sauce on the side and barely nibbled on the oil-drenched bok choy. It was just the duck I needed to gnaw. Fortunately I took half of it home before I made a pure glutton of myself. The service was an exercise in discipline, friendly not so much. So back to my original question...was it Win for the win? It was more like a draw.\n\nFOOD - 3 stars...solid dishes, no big whoop\nAMBIANCE - 3.5 stars...spacious, only moderately atmospheric\nSERVICE - 3.5 stars...efficient\nTOTAL - 3 stars...no-frills but it satisfies if you are in a Peking kind of mood", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-31", "description": "I attempted to have lunch here yesterday but had the worst service I've ever experienced due to a clueless waiter with an attitude. When we ordered our food, I informed him that my daughter had a peanut allergy and told him to make sure he didn't give us anything with peanuts or peanut oil. Even though the menu clearly states that the salad dressing contains peanuts, he brought out her food with a dressed salad. When I pointed this out, he took her plate back, scraped off her salad and put lettuce without dressing in the same place he just removed the salad. I told him they needed to make the whole lunch over again because she has a severe peanut allergy, but he argued with me and refused to do it. I ended up paying for my meal only and left. The health department should be notified because he is endangering customers with his ignorance.", "author": "Suzan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-26", "description": "Bad customer service, they droop off the menu in my door for first time l was trying to order for delivery and whoever answered the phone \nIt was to mean...", "author": "Wendy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "Delivery was quick and personable the night we ordered from Win Garden.  I paid an extra $1 for each chicken dish that we ordered because I requested all white meat.\nThe Broccoli and Chicken and the Chicken with Black Bean Sauce were very tasty and ample in serving size.\nWhite rice and an order of Pot Stickers completed the order.\nI think it took about 30 minutes for delivery.\nThere are a lot of items to choose from when ordering on-line.\nIt couldn't have been any easier.\nClap! Clap! Clap!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "I'm a sucker for Chinese food. Win Garden is no exception. I have to order Chicken Chow Mein no matter which Chinese restaurant I go to (only true way to compare Chinese restaurants). Win Garden seriously tops the list all over the Bay Area (for me). This is even compared to places such as Jing-Jing in Palo Alto (a close second) and Chef Kwan's (formerly Su Hong) in Menlo Park.", "author": "Dean Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "Feeling lazy to cook on a Friday night and Win Garden came to rescue!  Came for a lunch special a few days ago and had such a fantastic meal along with a very pleasant dining experience!\n\nWe were very please with the food arrived on time with the delivery service!   This is such a convenient service for a Chinese food place with \n\n1.Eggplant with chicken and prawn is amazing.  The shrimps, chickens and eggplants were perfectly cooked with its special tasty sauce.  This is my favorite!\n2. Honey Walnut prawns.  Had to order two!   Haha.  This is another must have plate.  My super favorite!\n3. Prawns with sweet peas-   Very refreshing dish and the peas were cooked perfectly as they were crunchy to eat.   I don't like soggy vegetables.\n4. Asparagus with honey walnut sauce- ok.  It's a bit too sweet to me.  Had to try as yelper raves about this dish\n5. Chinese broccoli with garlic.  Perfect\n6. Kung-Pao chicken-yummy!\n\n The quality of the food was excellent.  All ingredients made fresh.  All dishes were savory and with flavor, and NOT too oily.  Price is reasonable for such a huge portion.  The restaurant is clean. \n\nDefinitely the place to go back to whenever I am in the area.", "author": "Ivory B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Very fast service, great staff and good food are 3 things I look for in a walk in restaurant. The cost does not matter if the qualifications of a good restaurant are met. The Win Garden met and I was highly impressed with good and staff. Glad I found this little hidden restaurant in Glen Park by accident the outside look dumpy but inside is well done and very inviting for customers.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "I love this place! Ordered from them a couple weeks ago for the first time and it was so delicious. I highly recommend the orange chicken and the Mongolian beef! I have literally been ordering their food at least once a week!", "author": "Kay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "My friends and I ordered the chow mein noodles, fried rice, general tao chicken and Szechuan pork. It was all really tasty and arrived in well packaged containers. Food was very flavourful and was a decent amount for the price we paid. The dishes do not come with rich so we had to order those separately.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "I can't wait to COME BACK here! My man and I were too lazy to leave the house so we got take out... I realized we haven't had Chinese food in hella long & I am soooo glad I thought of it because this place HIT the spot! \n\nOrange chicken: YES! Just order it. Even in the take out containers the chicken was cooked perfectly. Not too sweet and stayed crispy! \nChicken chow mein: Not greasy, no beansprouts, no extra BS I don't like. \nHoney walnut prawns: Again, consistently cooked well! It wasn't as sweet as I wanted but it wasn't too mayonnaise-y if that makes sense \nFried wonton chips: My man ordered this without me knowing so I was hella irritated when I saw this because I thought he meant to order crab puffs and thought fried wonton by itself would be greasy and gross but OMG girl just order it lol. Hella addicting! \n\nCan't wait to try more stuff on the menu! Nom nom nom", "author": "Roxanne A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-15", "description": "DO NOT DO NOT DO NOT ORDER FOOD FROM HERE! I waited and waited for my food to be delivered and when I called grubhub two hours later, they said it had been marked as \"Delivered\". When they tried calling the restaurant, no one answered. This is the second time I have a delivery problem with this restaurant. If you plan on giving your money away and going to sleep hungry, this is the place to put in an order.", "author": "Mohamed A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Great food!  Each dish has a unique flavor and is well seasoned.  I love the Westlake Soup!  They will use lamb or beef in any dish.  Ample serving size as well.  Our favorite restaurant!", "author": "Judy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "Came here to take advantage of the lunch specials. Good list of food options and very fairly priced for what's included. Entree plus rice, soup and a little mixed greens salad all included in their lunch specials. You can upgrade the white rice to brown rice/chow mein noodles for $1.50 which still ends up being pretty reasonable. \n\nWe were especially surprised at the number of veg options on the menu. The meatless chicken is surprisingly good and one of the better versions I have come across. Their other tofu/veggie dishes are also good. \n\nService was fast and friendly. No frills. Clean place. Definitely a good value and worth returning to. They also have a reasonable delivery minimum for those in the neighborhood.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "I've been to many Chinese restaurants. Prices are good but sometimes it will reflect on the service and quality of the food or worse...the cleanliness of the establishment (no offense to Chinese restaurants out there:).\n\nI love the Win Garden location as it is situated in a quiet corner of the busy Glen Park area. I always find street parking so that usually isn't a problem but being the nature of the location, you might have to search for one depending when you come.\n\nI would like to say that this is one of the cleaner Chinese restaurants I've been too. No sticky tables, condiments haven't been sitting on the table for years, & they provide you with silverware (knives included) & metal chopsticks. Linen napkins are provided as well, which just shows they really make an effort to go beyond.\n\nService has been great. Mandy, the owner is very helpful, & always checks in with you as well as keeps your water glass full. They will also bring the hot sauce and soy sauce to your table in a saucer & accompanied with tiny spoon for serving. Talk about attention to detail!\n\nFood is always great. I think they have the best sizzling rice soul in SF. Broth is very clean & they give a lot of protein for the price of $5.95 for a cup. And keep in mind I'm a big eater but the cup order is huge! Chow mein is delicious...big portions. Oh and try the Korean Chicken Wings...sticky, salty, spicy, & crispy!\n\nAll in all, I found my go-to restaurant when I have that craving for Chinese food. Prices are very reasonable as well. It's honestly just a great establishment run by good people with the intention of providing delicious & high-quality food to its patrons. We need more of these establishments to be honest.", "author": "Ralph N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Excellent, affordable food, fast service. Great gem in Glen Park. Jalapeño fried rice is a unique but delicious take on a classic. The chicken & string beans was also unique but excellent. 5 stars.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "If you should find yourself in Glen Park without a car (perhaps working on a project in the library, like Dread Pirate Roberts) and don't feel like climbing the hill to the excellent dim sum place in Diamond Heights, then by default Win Garden is your Chinese lunch spot. And it's not bad at all.\n\nThere is an unusually large lunch plate selection, including a number of meatless items (not vegetarian but \"meatless\" as in \"meatless Kung Pao chicken\"). You get house egg drop soup (typical specimen) and a small salad on a plate with your rice and your entree. I had the garlic twice-cooked pork and it was fine. You have to ask for hot sauce or soy sauce. Chopsticks are the Korean skinny metal kind which only work for me when copious amounts of beer are on hand; I had to resort to my fork.\n\nIt's a pleasant, clean room and was busy at lunchtime but with good service. The actual food is three-star compared to other spots in SF but I'm bumping it due to the general lack of negatives.", "author": "Otis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "We're in the Glen Park area, folks--you know, where burritos cost over $13 in cash!!! One little tart the size of HALF the palm of your hand at the nearby main market costs nearly $5!!  The great thing is they accept CC. \n \nSo Win Garden's had changed again from serving dim sum at the door to now being only a sit-down restaurant.  Well the ambiance is certainly worth your $10-$15 with the walls and floors and bathroom in decor. It's spacous enough for many tables so groups of 4 or more are certainly ok. The service is punctual and courteous.  \n\nGo for the lunch special mainly under $10 which includes a soup, your choice of rice(brown, fried, white) or chow mein, and a salad.  Personally, I think the salad makes the meal more nutritious and a fuller meal even if you're not getting such a large amount of the main dish.  Dining on the soup beforehand also will make you fuller. They give more than enough rice or chow mein. You could also add an appetizer for another $5-$8.  \n\nObviously if you want deals on chinese food, the combo meal takeout at Sweet Delight Bakery at 4476 Mission or bento special deliveries by Golden Moon at 2511 Geneva Ave  or Kome buffet in Daly City would be your best bet.  But to take a rest at a nice ambiance Chinese restaurant in a nice neighborhood near Bart, you can't beat Win Garden at Glen Park.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Hands down the best Chinese takeout in the city! I have been ordering from here for years and was devastated when I could no longer get delivery via Eat 24 - little did I know that Win Garden was now on GrubHub!\n\nThe main reason I fell in love with this place is that they have brown fried rice, which is impossible to get anywhere else. It's hella good too! Pork and chicken are always A++ and never greasy. My other go to's are the shu mai, hot and sour soup and the insanely good ginger broccoli. Perfectly cooked, crunchy and well balanced on the seasoning. Even the fried chicken dishes are always crispy and on point, never too sweet with just the right amount of sauce. Quality food made with care!\n\nDelivery is always speedy and without any snags. Prices are fair, especially considering the generous portion size. \n\nI'm so happy I can get delivery from you guys again!", "author": "Mina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Everything was alright. \n\nCrispy Fried chicken: needed more seasoning. \nPeking Pork Chops: was not that great. Felt like I was biting into something soggy.\nMongolian beef: good. \nFried veggie rice: good.\nChowmein: alright.\n\n Probably wouldn't order from here first if I were hungry for Chinese.", "author": "Asi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "I love this restaurant. The orange chicken and crab rangoon are delicious! The delivery is free and fast (it was scheduled to arrive in an hour, but arrived in about 40 mins). Win Garden is definitely 1 of my top 3 chinese food spots.", "author": "Joy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "This is strictly for delivery. Consistently delivered on time if not early. Food portions is what you would expect. May not be the best Chinese food in SF but food always taste good.", "author": "Eileen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "They just canceled my delivery order, because I've paid 10% tip. This is ridiculous. No calling from the restaurant when order has been cancelled. If I don't ask Yelp, I'll never know what was going on, and keep waiting.", "author": "Han L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Visiting from Las Vegas and was in the mood for Chinese food. We arrived and were allowed to sit where we pleased \nThe waitress was nice and although she was alone and had multiple tables to serve  she took the time to make sure we were comfortable and taken care of\nI ordered the orange chicken lunch special and my GF the Mongolian lunch special\nFood came quick and was delicious\nI've seen people's reviews saying it's \"fake\"Americanized Chinese but I thought it was great. I'm from Las Vegas where there's Chinese fast food at almost every corner this tops it by far. I  will come back next time I'm in San Francisco", "author": "Jose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "I am a General Tsao Chicken addict. That fried chicken with dripping sauce and a spicy kick goodness. How did I survive without it before? I just can't stop eating it once I start, the pringles of Chinese food, I just have to have some more of that deep red, crunchy, hot... oh, you are still here.\n\nAhem.\n\nMy regular take out dinner joint in Glen Park (ate in once at the restaurant and it was really nice too). Surprisingly everything I have ordered has been great, which is not normally my experience at the few Chinese places in the city I have tried. Even when I took the risk of ordering something that Eat24 said only 13 people before me had ordered, the Asparagus with Honey Walnut Sauce, and it was freaking fantastic.\n\nThey are also pretty consistently quick with pick up orders, so make sure to arrive before the estimated time.", "author": "Tristan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "The food isn't bad- not my favorite Chinese food, but they deliver when I'm in a crunch and it's not bad tasting! I usually get either orange chicken or general tsao with fried rice or chow mein. The Chinese broccoli with oyster sauce is yummy too. I'm a fan of pork buns that aren't very fatty- these little steamed bbq pork buns are good. What I am upset about is that their delivery guy is rude to me. He's a pretty young guy. As soon as we opened the door he straight up just said \"tip?!\" Like...who does that? Either way, I tipped him, but he didn't have to be so demanding. Would have been 4 stars, but customer service matters!", "author": "Sophia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "If I could rate this place out of 10, I would give it 9 3/4. The food is delicious and the portions are fit for a troll! Win Garden Leviosa", "author": "James N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "BEST CHINESE TAKEOUT/DELIVERY IN THE CITY!\n\nI'm in love with this place. I can't speak on behalf of the dining experience because I've never actually been to the restaurant, but I can tell you that after the many times I've ordered delivery, this place is a winner in my heart (er, stomach). \n\nTheir food always arrives fresh and hot. They offer cheap prices and give you generous portions that I'm always ordering to share family-style. And if not, I'll have endless leftovers, which I'm also perfectly fine with. \n\nItems that I've tried and would recommend:\n\n- BBQ Pork Chow Mein\n- Beef Chow Fun\n- BBQ Pork Fried Rice\n- General Tsao Chicken\n- Orange Chicken\n- Honey Walnut Shrimp\n- String Bean with Fried Tofu in Garlic Sauce\n- Vegetarian Spring Rolls\n- Fresh Cucumber Salad\n- Wor Wonton Soup\n- Pork potstickers\n\nIn comparison to other Chinese restaurants, the food here is not nearly as greasy (huge plus). Free delivery for orders of $20 or more, and they are speedy!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "The food is consistently good pleasant service.\nLunch special come with soup and a salad on the plate quite good.\nNeighborhood street parking can be challenging.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "This place has great food! We showed up with 25 people after a basketball game and they gave us superb service! Everything came out really fast and delicious. They didn't make one mistake. Really friendly!", "author": "S K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Our delivery was on-point and on time! There were plenty of utensils and condiments - they even gave us extra. The food was also great! We had Cashew Chicken, BBQ Pork Chow Fun, and Fried Rice. Thank you for a great experience, so that we could stay inside and relax.", "author": "Candice N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Cheap & good. Went here for lunch with a friend and the food was good for that price for this area.", "author": "Martin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "I used to order delivery from emmys but I found this gem! It is a little bit pricier but the food just tastes so much better & \"cleaner\" I love the general tsao chx, green beans, & wonton soup!", "author": "Miss V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "I should have picked Emmy's Restaurant close to City College of San Francisco and not you. \n\nThis is what I got and this is how much. I ordered from you June 12 2018.\n\n3 shrimp dimsum for the price of $6.45\n6 potstickers for $8.45\n8 wings for $13.95\n\nAnd I tipped you $4.71 for this? Again, I wish I ordered from Emmy's restaurant by Ocean and not you.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "Decent roast duck dish, though you'd do better getting a whole roast duck in the Richmond.\n\nPleasant service.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I'm so happy to call this my neighborhood Chinese take out! Their general tso chicken is the best I've ever had because it's just the right crispy exterior but tender chicken. Great portions and great service. Definitely my go to place for some tasty Chinese food.", "author": "Vickie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Ordered takeout since they deliver. They stated 60-90 minutes delivery time. However, the food arrived earlier than stated which was great!  We had the lettuce wraps, seafood and basil soup and mooshu pork. The lettuce was very fresh and crisp. We received 6 wraps with the mooshu pork and still have leftover mooshu. The veggies in the mooshu were crunchy and fresh. The soup was tomato based with fresh tomatoes, bean sprouts, seafood and basil. It was super good. We would definitely order takeout from here again. We would also dine in if we have the opportunity.", "author": "Terese C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "I love the Chinese food here.  I could eat there 5 times a week.  Friendly service and conveniently located in Glen Park near all the shops.  Great Pork Fried Rice, Kung Pao Chicken, Mongolian Beef and Beef and Broccoli!  You won't be disappointed!", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "One of if not my favorite Chinese restaurants. Food always tastes fresh and the meats used are always of quality. Their General Tso Chicken is highly recommended.  The shrimp used in their Singapore noodles is meat and good size, not tiny. Prices may be a little higher than others but you are paying for quality.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "Never ever again!. I've ordered from this place before and I wasn't impressed, but it's in my neighborhood, so I thought I'd give it another shot. \nThe worst hot and sour soup I've ever had. It was so oily due to the hot chili oil. There was no sourness to it. I also order chicken chow fun- fun to eat, it was not. It was tasteless and scarce on the chicken. Just noodles with no flavor. The eggplant with black bean sauce was uneventful. My roommates vegetarian potstickers were so thick in dough we picked veggies out; which were nothing to write home about. \nPerhaps, the only item we felt was eatable was the string beans with tofu. But unfortunately, we will not be ordering from there again.", "author": "Myra A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "Good Chinese food with quick delivery. However the prices are a bit high... it would be okay if the portions matched the prices but nope... portions are tiny... you're better off ordering the lunch option but still tiny portions. (But will be full) their hot sauce is bomb! Fortune cookies are good too and I rarely eat it... you could be a regular thang, but em prices....", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "The staff is friendly and it's a clean restaurant.   The house special fried rice, Walnut prawns and double mushrooms are very good.", "author": "Donna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "The delivery was slooow (well over an hour), and the food arrived warm, not hot. That said, the actual food was light, fresh, and flavorful. I especially liked the side order of garlic broccoli. (Thanks Yelpers for the suggestion!) I'm sure I'll order from Win Garden again. It's better than other options close by.", "author": "Phoebe O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "We had a great meal here.  Good food; fast, friendly service; and a clean, pleasant setting.\n\nMy husband and I shared the following dishes:\n\n1) Chicken corn soup - good\n2) Chicken chowmein - tasty and not too greasy \n3) Szechuan chicken with mixed veggies (upon special request) - tasty\n\nThe food came out quickly and the service was decent.\n\nThe setting is nice - simple, well-maintained, and lit with pleasant, soft lighting.\n\nA solid spot for a casual Chinese dinner!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Very poor customer service! never again! Ordered food online and we called to verify that the order was received but unfortunately there was an issue with their partner site. Instead of apologizing they brushed off the experience we had and ignored the fact that we were already waiting for 45 min! Not even an apology! When we expressed our disappointment with the site that they partner with and with the attitude in her voice, she said \"you do what ever you want\".  Win Garden never apologized for this inconvenience and the voice of the woman was very aggressive!  We called again and once again said \"go ahead do what you want! write a review!\"-- and so we did! Never again will we go to this place. At least they could have done is apologize. I was not expecting the attitude and her rudeness! A simple \"I'm sorry this happened\" would have fixed the issue, instead they only cared about blaming there partner website, they did not care about the customer.", "author": "S P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Win Garden in Glen Park, San Francisco was excellent for lunch!\n\nMy friend and I were very pleased with our lunch. I had sweet and sour pork (which I rarely order) yet it was excellent. It came with rice and salad and was more to eat than I could finish.\n\nMy friend ordered orange chicken, which she liked a lot. Plus we shared a side of shrimp dim sum dumplings, which was excellent. \n\nThe price for the main lunch courses was inexpensive, less than $9. \n\nI definitely recommend Win Garden. \n\nParking is on the street but the meters accept either coins or credit cards.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "Had high expectations due to the reputation of San Francisco and Chinese food and the rating of this restaurant. As soon as I walked in the restaurant, I had a feeling I'd be disappointed. The menu had no Chinese on it, and some names of the dishes made no sense. It was clearly not an authentic place for Chinese people.\n\nWe've ordered mainly dim sum dishes because that's what our guide initially advertised it as. Some of them are:\n- Avocado spring roll: ...what? Anyway, couldn't taste the avocado at all, don't even know what's in there.\n- Shrimp dumplings: the dough was a lot thicker and harder than I expected.\n- Char siu ribs: some parts of the ribs were ok, most of it was very dry.\n- Beef chow mein: not bad, tastes just like the typical fast food pad Thai.\n- Pot stickers: only thing I'd actually recommend. Generous proportion of meat, thin dough, fried just enough. \n- String bean chicken: beans were not the flat Chinese ones, and were pretty hard and not cooked enough.\n\nWe just came back from a 3 hours hike so I was hungry and was pretty full by the end of it nonetheless. We were a big group and it came out to 16$ per person including tax and tips. Not bad but on the higher end for dim sum. I didn't feel like it was worth the quality of food overall.", "author": "Ivy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Finally, truly great delivery Chinese food in Glen Park/Bernal. They don't skimp on the vegetables, nothing is too greasy, everything is fresh, best fake meat dishes I've had in SF, best onion pancakes....  wonderful.", "author": "James H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Pleasant surprise to receive my order of tasty food (beef chow fun, dry fried string beans, braised fish filet with mixed veggies, sesame chicken, and salt and pepper pork chop) earlier than expected.", "author": "Penelope Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-28", "description": "Too soon to tell but so far 2 out of 4 dishes I liked so far.  Had the combination appetizer,  chicken chow mein, beef with asparagus, and wor wonton.  \n\nThe combo app was 3 stars\nChicken chow mein 2 1/2 stars\nBeef Asparagus 3 1/2 stars \nWor Wonton 3 1/2 - 4 stars\n\nI will come back and try other dishes and update my review as I see fit.", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "If you don't live within 2 miles of this place I'm pretty sure you haven't heard of it, will never hear of it, nor ever need to hear of it.\n\nGreat neighborhood Chinese restaurant.\n\nWor Wonton soup and Wonton mein are both really hearty - good broth, lots of meat and seafood (if you want).\n\nMapo Tofu: nice flavor but it also has this 'Chinese spice' in it that numbs the tongue.  If they can make it without that then I'll order it again, otherwise that numbing just doesn't do it for me.\n\nPan fried noodles: super good and crispy with good sauce and tons of vegetables.\n\nMongolian chicken: slightly spicy with good flavor.  A winner.\n\nStreet Parking only.\n\nYou'll see a lot of people getting takeout and delivery but it's almost never crowded to eat in.  Portions are huge and nicely presented when you eat in!\n\nThey do their own delivery through Eat24 and it's super fast!", "author": "Traci H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Food: 4/5\nPrice: $$\nPortion: 5/5\nPresentation: 4/5\nOVERALL: 4.5/5\n\n(TAKEOUT REVIEW) One of the BEST CHOW MEIN I have ever had. SERIOUSLY. I loved it so much I ordered take out 3 days in ONE WEEK! That says a lot! I usually order through the yelp app, I originally tried them out from Post Mates. \nI'm glad I came across them;\n- Chow Mein is a must!\n- Vegetable Egg Rolls are good\n- Siu Mai is pretty meaty and tasty too\n- BBQ Pork Fried Rice is yummy too!\n\n- Duck SKIP, little dry and not that meaty\n- String Bean w/ Chicken SKIP, was kind of bland\n\nDefinitely a place I would order when I want chinese. I really enjoy how sturdy they package your items and I appreciate them cutting little corner openings so things don't get suctioned in and spill/pop open also to prevent too much steam. TY!", "author": "Eva H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Tasty food and fast delivery! Perfect for when I'm lazy and it's raining outside. Love the shrimp with lobster sauce in particular. I'm quite certain that they make liberal use of MSG on their food, but it doesn't give me too much of a headache.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Great hole in the wall. Their customer service is really good and they have a lot of vegan/vegetarian options to choose from! We've had the salt n pepper meatless chicken, general tsao's meatless chicken, n Mongolian meatless chicken, and everything was so good.", "author": "Anjelica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-26", "description": "Ordered: salt & pepper wings (soggy and bland), egg rolls, wonton soup (warm not hot), broccoli beef (bland), steamed rice and chicken chow mein (bland). Portions are small (not family style) everything we ordered fit in 1 plastic bag... the food was a bit pricey and very bland. 2 stars because they deliver. But won't be returning. I hate when I waste too much money on nasty food!!! #disappointed", "author": "Julia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-12", "description": "This place is definitely a quantity over quality establishment. The orange chicken was 90% batter, whatever chicken was present were these tiny pieces. the Chinese broccoli with oyster sauce had no sauce or very little. Everything else was just ok.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Good solid - clean - not greasy - good seasoning g - nice service - salt pepper prawns good, eggplant tofu excellent", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "I've only ever had delivery from this place (courtesy of Eat24), but both times have been HOLYHELLTHISISAMAZING sort of good. I can only imagine what it would taste like as an eat-in meal. But for delivery? Things stay pretty warm and pretty crispy, although the delivery time can take forever.\n\nAnother note -- this is pretty standard Americanized Chinese food fare, so if you're expecting something beyond that, you should probably look somewhere else.\n\nI especially recommend the dry braised crispy pork and the roasted duck. Portions are generous and can last you quite a few meals for leftovers!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Our families favorite place in the neighborhood. I'm happy our daughter introduced us to this place. We eat in and order in and it's always delicious.", "author": "Ana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Unbelievably good meatless chicken options. I ordered the orange meatless chicken, sesame meatless chicken, garlic meatless chicken, and jalapeño vegetable fried rice. I have to say this is the best chicken alternative I've tried so far. I'm a big fan of this place.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "Ordered Togo from here few times a week, their delivery is pretty fast.\n\nFood is pretty quality \n\nWe ordered orange chicken, string bean, Kung Pao Tofu \n\nWe will keep ordering to go from them", "author": "Mack A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "I was pleasantly surprised by the food I received. Usually Chinese fast food is super greasy and extra fried and convinces you to go healthy next meal lol But not the food I got from win garden. It was very well made and the flavors were delicious. Especially the chow mein! They got my order wrong, but I still have to give 5stars because it was so yummy.", "author": "Louisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Such great veggie Chinese food! Friendly neighborhood restaurant with reasonably priced take out and quick delivery!", "author": "Anthony F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "This is what greasy Chinese food is supposed to taste like, and I mean that in the best way possible.  I love their generals tsos chicken and pork fried rice. Their lunch special is a fantastic deal - combination platters with generous portions along with soup. Non-lunch meals are a little pricey since they don't have combination platters and you have to order meats and starches separately. \n\nThings can be hit or miss here though. Breaded  chicken dishes will sometimes be flavorful, and crispy (even take out/delivery), but other times soggy and bland (for Americanized Chinese food). Also once I had a very negative experience placing an order with a young Cook. I really don't expect much from Chinese restaurants but the guy was offensively rude and actually asked me to pay in cash when I wanted to use my debit card. I should really minus 2 stars from my review but since I like the food so much, just taking off 1 star. \n\nOverall, solid Americanized Chinese food. Best general tsos I've had in SF. Recommendation to the owners would be to have combination platters on the regular menu.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Thank you yelpers for helping me find this gem!  This is now my \"go to\" Chinese take out joint!  First off this place is clean and organized not like some Chinese restaurants that have piles of boxes or cleaning materials in one corner smh. Friendly service and great food!  We ordered the red oil won ton which had just the right amount of spice and flavor. We also got the mixed veggies with prawns that came with a sauce ON THE SIDE not mixed into our entree as if someone threw in a bucket of sauce to hide how rotten their veggies are (just saying lol). You options of sauces for you steamed mixed veggies (major plus) Can't forget their sizzling rice soup. I love that they have the option of brown and white rice.  Will definitely come back again.", "author": "J N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "LOVE LOVE LOVE the Chinese food from here.. I use DoorDash to deliver their food.. You won't go wrong eating here.. Believe me.. I usually order 2 a month here.. They are not expensive.. But even if they were.. I would still order from here.. #YuuummmyChineseFood", "author": "Juliana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "Very nice neighborhood Chinese - we always order the same for takeout: Hot&Sour soup, walnut shrimp, orange chicken. Always works great. Never a long line or issues with the food. Big portions.\n\nI even had business meetings for lunch or dinner there - it's the \"usual\" Chinese restaurant ambiance - white linen napkins in the evening. Reusable chop sticks.\n\nRecommended", "author": "Flo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "Had the vegetarian orange chicken. It was just alright, very chewy and rubbery. The breading was also extremely thick. My friend ordered the vegetarian egg rolls and there was a long black hair cooked into one. I definitely won't be eating there again...", "author": "Genna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Win Garden is the best!  A total go-to in the Glen Park neighborhood.  The food is really good and the service is excellent. So I order food from them to be delivered for the most part and they are always on time.  A few weeks ago, however, I ordered the eggplant with shrimp and chicken and found it to be way too hot and drowned in chili oil.  So, I called to complain, not something I usually do.  Anyway, they offered to remake the dish for me right then or at any time in the future. The next time I went in, I ordered something else, but saw that they had a note about my my complaint on their board.  They said \"Remind us to fix that on your next visit.\"  So tonight, I took them up on it.  They gave me a free \"replacement\" of the original dish and obviously took care not to repeat the mistake. It is delicious, and I am so impressed that they remembered my complaint and acted on it.  I highly recommend WIn Garden!", "author": "Peggy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "I keep ordering from them and truth is the food is good. One other time they forgot pancakes AGAIN. I now check on delivery and the driver apologized and went to get them. It took maybe 30 minutes but at least it was fixed. I've gotten over the sour taste from when they accused me of lying.", "author": "O W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "Win Garden is usually our go-to spot in the neighborhood. It's fresh, offers healthy options and is always delicious. Everything on the menu is pretty typical but I especially like their eggplant because it's  never mushy! In fact, all the veggie dishes we've had taste like they get their produce daily, super fresh with a nice al dente bite. Yes, Chinese takeout is usually greasy and sodium filled, but Win Garden tastes the way I'd expect my super healthy aunt would cook, and then some.", "author": "Sophie m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "I ordered takeout from this place and it made me sick. I'm pretty sure it was the pork. Ugh. What a waste.", "author": "Cindy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "This place has the most awful delivery staff I have ever experienced. They are rude and incredibly unprofessional. When I called the restaurant to tell them about their disrespectful employee they accused me of lying!! There food is expensive and mediocre at best. I will never waste my time or money at this restaurant again.", "author": "Gaby F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Okay... So here goes. I am not sure that this will do this place justice but I will try! I have dined in and ordered to go.... And now that I think of it, ordered for delivery too! I absolutely need to be honest here. I love it. So what is it that I love from this place?? The service is amazingly nice, neighborhood is decent, and food is super tasty! I love their BBQ pork fried rice, chicken chow mein, soups, mango chicken, and broccoli chicken! Yes, love me some chicken . So, it is fast and tasty. I would recommend to my best friend and even to a stranger.", "author": "Pamela A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "Great service.\n\nI had the brown rice and tofu Kung pao chicken. Fried tofu, veggies, peanuts, all dressed in garlic sauce. My mind wasn't blown, but it was good.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "There is only one hostess during rush hour. She was running up and down like a headless chicken. She didn't check-in to see if we were enjoying the food or we needed additional items.  I ordered Jalapeño rice and it was a bit burnt. The bathrooms require some renovations.", "author": "Mwangi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "DO ORDER: The Korean Fried Chicken. It's bomb -- extra crispy with sauce at the bottom if you want it extra saucy. Not super spicy but totally great.\n\nDON'T ORDER: The chow mein. The flavor is off -- the beef, chicken, shrimp, pork chow meins are around 80% noodle, 15% meat, and 5% cabbage/spring onion.", "author": "Ri R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Perfect neighborhood Chinese!! Fresh ingredients and a very diverse menu. When I first moved here 4 years ago, this has been a few different Chinese restaurants. But they seem to have stabilized as Win Garden and I have found the quality to have steadily increased and increased over time. Admittedly it's an Americanized version of Chinese, but it is AWESOME AMERICANIZED CHINESE!!! and that's nothing to be ashamed of... Things I love: Kung Pao Chix, Hot & Sour Soup, Gen Tsao Chix, Jalepeno Fried Rice, Hong Kong Crispy Noodle with Pork. I mostly get take out since I live nearby, but I find myself ordering it about once a week.", "author": "Jay E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "Since posting my original review, I haven't seen the worker who was rude.  The current workers are very nice, and the food is excellent.", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "So Good!!! Loved all the food we ordered. Service was excellent. Lil hole in the wall with really good Chinese food. Sweet and sour chicken was bomb. Com and best chicken wings", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Great food. They deliver! Totally consistent quality and service.", "author": "Chelsea E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Korean Chicken Wings are perfectly seasoned and glazed. Amazing crispiness and flavor! I'd get again anytime if in the mood for some wings! Crab rangoon and Drunken Beef are also great!", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Great for delivery! \n\nGeneral tsao's came still crispy it was one of the best I've had. Duck was delicious, lots of bones though. Hot and sour soup and wonton soup were delicious. Beef and broccoli, tasty and tender beef with perfectly cooked broccoli. Yummy chow mein with BBQ pork.\n\nDon't forget to order the rice!", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Very good taste and service!!!finally find an authentic Chinese food in SF!!And easy for parking on the street!!free after 6pm!!", "author": "Yiran X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "It was takeout night.\nChinese was calling my name.\n\nHenry's is our usual go-to for Chinese delivery, but they don't have crab rangoon.  I decided I really needed crab rangoon, so that meant ordering elsewhere.\n\nAfter a little research, I decided on Win Garden.\n\nCrab Rangoon.\nVeggie potstickers.\nSesame chicken.\nSweet & sour pork.\nWhite rice. \n\nI wanted bbq pork fried rice, but it isn't listed on their grub hub menu for some reason.  \n\nHow did it measure up?\nNot so well.\n\nThe crab rangoon was the best thing on our roster.  Crisp & tasty, w the filling the right consistency.  It was thick & not runny.  They're more like crab pockets rather than dumplings, w the wonton ends pinched together & the filling in one lump only in the middle.  How about distributing the filling more evenly?  So you get more bang in more bites?  But, that aside, they were cooked well & tasted great.\n\nThe veggie potstickers were mediocre at best.  The mushrooms were slimy to the point of my actually mistaking them for fat.  Not good.\n\nThe sesame chicken.  Bland.  Bland.  Bland.\nPass.\n\nThe sweet & sour pork.  Same.\n\nThe lack of flavor in almost everything was remarkable.  The only component that the sesame chicken had that it's supposed to were the actual sesame seeds.  Sad.\n\nThey did arrive at the time quoted.  \nBut aside from the crab rangoon, it was a forgettable meal.\n\nLive & learn.\n\n2 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Always order from here. They have vegetarian chicken that is amazing. Great price as well. Order the lunch special come with soup and salad.", "author": "Bianca D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Fast delivery, good Americanized Chinese food! They offer a variety of Chinese food, they also offer vegetarian options which is nice for those who don't eat meat but enjoy the flavors. So every time I eat Chinese food, I always look for the FLAVOR!!!! and the flavor was definitely there, it did not disappoint.\n\nWhat we order:\nSesame Chicken\nMongolian Beef\nGeneral Tso Chicken\nSteamed Vegetables\n\nI usually order delivery for lunch, I love the containers they put their food in and it's a quick meal.", "author": "Vanessa Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "4.25 stars \n\nEating at Glen Park's year-old Win Garden feels like #winning. \n\nI can't vouch for their pickup or delivery system, but judging by the non-stop phone calls & customers stopping in to grab to-go orders, they're a popular new kid on the block. Only 1-2 other parties dined in when we were here, but don't let the empty restaurant discourage you from eating here; it just means faster, more attentive service for your group! \n\nWe ordered: \n-- pork BBQ appetizer: he enjoyed this, but commented that it didn't have the crispy edges he's used to.\n-- avocado egg rolls: lots of black pepper flavor, generous portion of ripe avocado, nicely fried wrapper \n-- beef fried rice: he was delighted by the beef bounty, I kept having to push pieces aside. Sufficiently flavored, perfect with our saucey entrees \n-- eggplant in spicy garlic sauce: standard, but what was unique were the bamboo shoot slivers -- loved that! \n-- sesame chicken: tender white meat chicken, perfectly fried exterior (not overly fried, crunchy without hurting the roof of my mouth)\n-- dragon beef: thinly sliced fried beef with onions--we liked! \n\nWe've long complained that we've yet to find great, cheap Chinese food, but as long as we don't order like we haven't eaten for a month, I think Win Garden fits that criteria. Will definitely come back to try: their soups, dim sum, & \"meatless\" entrees.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Great food, reasonable prices and delivery too? That's what I need.\nThanks Win garden", "author": "Gary H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-30", "description": "I just went here for dinner so while the experience is still fresh in my mind, I figured I would write about it.\n\nMy order:\n   - Avocado Spring Rolls: they really should be named egg rolls because that's what they are. You can pass on these as they are really bland and not as crispy as I would like.\n   - Crab Rangoons: not bad, but I have definitely had better.....there was minimal crab inside....\n   - General Tsao's Meatless Chicken: the first few bites were pretty good as they are super crispy, but they are definitely on the sweet side so you do get sick of them fast.\n\nThe service was just okay as they were understaffed. I felt ignored, but once they did get to me, they were very accommodating. They pack your to-go stuff for you and they are very nice in bringing out chili and extra sauces. They just did not have enough workers to man the phone calls and order pick-ups, let alone the people eating inside the restaurant.\n\nI might come back here in the future, but I am not in a rush to come back.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "Ordered delivery General tsos w white meat. Got dark meat w/ mostly fried breading.\n\nCrab Rangoon arrived ice cold\n\nFried rice was pretty good", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "This place is probably the only place in the city that does General Ts(a)o's Chicken the way I like it. Everywhere else is too soggy, or not saucy or not anything. I'm a big fan of that dish and get it every time I order from them.\n\nTheir whole offering is great as well! I particularly like the Dragon Beef, the Wor Wonton Soup and the Black Pepper Beef. Thanks so much for your quality food!", "author": "Samuel Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-08", "description": "Nice location in that it's right next to the Glen Park bart station. It is a bit Americanized and the prices are generally $10-12 per dish, but its pretty good! It's like a 3.5. \n\nMy favorite dishes to order here are the: garlic spinach, general tsao's chicken, dumplings. Those are the best dishes I found there, every other dish were not great.\n\nOne sad thing is that they charge money for tea and it's not free like it should be...", "author": "Derrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "Very good! Enjoyed the dim sum but a bit overpriced. Everything ordered was delicious. I would definitely order again", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "After my poor review, about 20 minutes later the restaurant called me and ask me several questions about what was wrong with the food. She also stated that she did just try the Thai Iced tea and it was in fact spoiled. She offered to give me the same order for free next time I want to order, which I thought was very nice of her.\n\nAbout a month after I originally ordered, I called and ordered the same thing. They remembered me and I had no issues getting my food for free as stated. What I thought was a little odd was that the guy on the phone asked if I will still tip the driver. \n\nThe food arrived with in 40 minutes which was super fast. The hot and sour soup was really good. Perfect flavor and taste. The kung pao tofu was also really good. It was not fried this time which was great. Had lots of veggies and peanuts. Also it was not drenched in oil this time. I will order delivery again from here next time I am working in the area.", "author": "G O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-04", "description": "My bf and I have ordered from this location take out a couple of times. We have also eaten in the store twice. The first time we came here, we asked for hot tea, unknowingly, we were charged for the hot tea. We were also charged more for the dish that was on the menu a lot lower. We then spoke to the employee and they adjusted the price. When you order from here, make sure if you're looking for meat, you let them know, its the meat one. My bf ordered the orange chicken and I think he ordered wrong, but we ended up getting the vegetarian option, which I was very disappointed in. We always like to order the potsticker, the crispiness and the inside tastes amazing. The potsticker also tastes very similar to ling lings potsticker. The sauce is very identical as well, which was great. I suggest ordering a potsticker, orange chicken, and fried rice. They're wonton soup is okay, I wasn't a huge fan of it, but it is very popular. They add in snap peas and chicken pieces into the soup which is very interesting. Service is mediocre, nothing too special. But this place is definitely more of an American taste Chinese restaurant rather than authentic Chinese.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Ordered delivery off of Eat24 and it was definitely satisfying. The food is really cheap and they give you pretty generous portions. \n\nI ordered 3 things off the menu to meet the $20 minimum requirement and I only ate the Mongolian Beef today in two separate meals. Each of the order also comes with hot and sour soup and a fortune cookie. I didn't really care for the soup, it was really bland. The Mongolian Beef was pretty flavorful, however. I also liked that they separated the rice from the protein so that your rice doesn't get super soggy and gross.\n\nOverall, I really enjoyed my meal. I have two more: Beef Broccoli and General Tsao Chicken for the next two days. I will update this review if the other two aren't as good. I will definitely order from here again.", "author": "Anny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Their meatless five flavored chicken makes me swoon. Dangerously hits those cravings for americanized-chinese food that were previously unsatisfied as a vegetarian. I always order through yelp and use the Eat24 coupons. They make your order promptly, and it's always tasty!", "author": "Claire G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Star Rating 1-5\n\nStaff Friendliness: 5\nStaff Knowledge: 5\nStaff Efficiency: 5\nTransaction Time: 5\nOrder Wait Time: 3\nRegister Counter Cleanliness: 5\nKitchen / Prep Area Cleanliness: N/A\nDining Area Cleanliness: 5\nBathroom Cleanliness: N/A\nFood Handling (i.e. clean hands): 5\nFood Presentation (i.e. wrapping, boxing): 5\nFood Preparation (i.e. made with care): 5\nFood Value: (i.e. worth the price): 5\nFood Taste: 4", "author": "Charlie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "I love the Chinese food here. I was looking for a while for good Chinese food in or around our neighborhood and this place \"wins\" in my book. I love all there food here especially their won ton soup. You can't go wrong here a d they deliver.", "author": "Steph B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "Ordered for delivery\n\nShrimp dumplings: hit the SPOT! But only 3, and they were so good I wanted more! Next time two orders.\n\nMango Prawns: holy cannoli this is amazing. A little zing to it (and I'm spicy intolerant) and I still LOVED it!\n\nGarlic Broccoli: thought it would be the chinese broccoli, but still delicious!\n\nI will DEFINITELY be ordering again. Everything was great and fast, friendly delivery.", "author": "Elena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I love this place!! The Meatless General Tsao's vegetarian chicken is so good!! My non-veg friends love it too! And I love that this very unassuming place is super vegan-friendly!\n\nAlso, the owner or staff member I interacted with was so awesome. I ordered takeout, and when I got there, I realized I had forgotten to ask whether something I ordered (the turnip cakes) was vegan. It occurred to me that they might have fish sauce so asked if they were vegetarian, though I kind of misspoke in not asking if they were vegan. She said \"yes, but they have eggs. Do you eat eggs?\" I really appreciated her being so aware of vegan eating that she thought of asking this. When I told her that I don't, even though obviously this was my error for not checking ahead of time, she was so sweet and offered me some veggie spring rolls instead.\n\nTo add to the kindness, I mentioned that I had my dog with me waiting tied up outside, and The woman offered to bring the food to us outside so I could stay with my dog! Really nice. Then when she brought me the food, I offered to give her the turnip cakes back, and she said to keep them, so I'm giving them to my friend who's not vegan. All of the food was delicious.\n\nI really appreciate this neighborhood spot, and I highly recommend it as a destination spot for vegans and vegetarians.", "author": "Nora K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "After returning for lunch I had to add a star... literally the best chinese in the city.", "author": "Jami J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "The hot and sour soup smelled like a dairy farm. Not exaggerating. We took one taste and threw it all away. \n\nEverything else we've ordered from here has been pretty good. Would be a four star review if it wasn't for the soup.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "I've been coming to Win Garden for years and LOVE IT! The food is very flavorful and prices are reasonable. List of my faves:\n\n1) Pork Potsitckers\n2) Salt & Pepper Prawns\n3) Korean Chicken Wings \n4) Salt and Pepper Pork Chop\n5) Wor Won Ton Soup & Seafood Soup in Basil Tomato Broth\n6) Beef in Black Bean Sauce\n7) Tomato Beef Chow Mein\n8) Mongolian Beef", "author": "S. D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "Vegetable Chow Mein was a huge hit! Even my picky Kindergartner liked it. Crab rangoon was great and the meatless options are extensive. We will order from here again!", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "This restaurant serves a neighborhood which is not predominantly Chinese. So you have table cloths, cleanliness and more attentive service than you generally find in the \"authentic\" restaurants.\n\nI ordered the lunch special of lamb with scallion and ginger sauce. The main dish was nicely done with good flavor. Rice was included. A bit odd for a Chinese restaurant was the green salad on the plate. I first ate the lamb and the rice, and at the end tried the salad. It was actually a decent salad with a good tasting dressing.\n\nThis restaurant has it where it counts most, the food.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Seems like the best Chinese delivery I've had so far in the city.  Three of my favorite Chinese foods are Ma Po tofu, red bean sesame balls, and Chinese broccoli.  They were all very delicious.  I will definitely order from here in the future.", "author": "Virgo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "This is our go-to Chinese restaurant when Xiao doesn't feel like cooking. Everything we've had has been really good.", "author": "Liz P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "General Tsao's Chicken: 5 stars, super crispy and delicious, with really yummy sauce with a hint of spice. \n\nChow mein: 4 stars, lacks some flavor, but the noodles  are good and very slurpable.\n\nHot and sour soup: 1 star: The soup was completely bland and tasted like chemicals. Not hot, not sour, not good, blegh.", "author": "Gideon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Win Garden is a great place to eat Chinese food. I like how they package the food in containers everything is always Very neat the food is great we love it I give this restaurant a five star.", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Delicious food. Great service.  Highly recommend wings and dumpling.  #nomnom. Also recommend for those traveling from Los Angeles and others places.  Come by have delicious food.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Most everything I order is my favorite.  Walnut Prawns, the Won ton soup is the best!  Orange beef is a big favorite in this house.   I have yet to have a bad experience and this is our goto.", "author": "Stephanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Super good Sesame Chicken. Always my go to place when I'm looking for quick comfort food close to me. I usually order through Grubhub. Most places, even if they are as close to me as Win Garden is, take 1 hour to fulfill my order. Luckily, WG delivers within 30 minutes! If you live around Glen Park, Miraloma Park, or Diamond Heights you definitely need to try this place.", "author": "Spencer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "My Chinese food stop is always here. I admire how there's only one waitress and is on top of everything. Good food and good service !", "author": "Ady P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "This place has consistently turned out fresh, tasty, not over-salted, non-MSG tainted, Americanized Chinese food. The veggies are crispy and taste fresh. Fried items like pot stickers and spring rolls don't taste like they've bathed in old, recycled, rancid oil. I prefer Alice's, Henry's Hunan on Church St, or Eric's, but Win Garden is closer to home. Service is not great, and the atmosphere is rather dull, but the place is generally clean. I usually get take out.", "author": "Lotion M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "Ordered delivery. It took 1.5 hours and I love three blocks away. Had I known I would have just ordered pickup and walked down. Food was also not as good as it usually is.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-02", "description": "They don't respect people in this place, I had a pick up order under my name and the lady totally ignore me because my ethnicity I'm Mayan/Egipto and people have always look at me as not important, you are in my El Dorado and you are one of those invasor that really don't deserve having a happy life in my lands", "author": "Roberto O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "I have never been to the restaurant but I've ordered take out from them several times! The wait time is never long and the food always come hot and fresh. \n\nTheir food is really good and seems to have less oil than other take out chinese in the area.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "An Eat24 win! This showed up as the only 4-star Chinese restaurant that delivered to the Mission and was open tonight, and overall it didn't disappoint. \n\nWe ordered: \n-crispy chicken (meh, but 'crispy' might not be suitable for delivery)\n-mango prawns (yum! A little light on the prawns compared to the other dishes, but the flavors were there and I loved that they removed the tails)\n-Mongolian beef (also tasty)\n-veggie chow mein, which was refreshingly not super-greasy. \n\nI'd try a different chicken dish next time, but the other dishes were great and the delivery arrived 15 minutes earlier than their estimate.", "author": "Krista L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Good quality food and the people here are great.  Ordering delivery is fast and easy.  The one time they mixed up one of my items, they sincerely apologized and sent the delivery driver right back to bring me the missing item. \n\nIn the Chinese food category, Win Garden gets 5/5 stars.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "I had ordered for delivery thru Yelp and the food came faster than expected. My friend ordered the tomato beef and I had the lunch special Mongolian beef over rice. We both enjoyed our meals and everything arrived still hot. I would order here again!", "author": "Brenda K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Fantastic food. Unfortunately our organizer and myself, one of us Asian, the other northern European heritage could not get the other 8 Caucasians in our party to order Chinese Family style so we could have had quite the banquet. Oh well, so the 2 of us had our own mini banquet. \n\nBut everyone loved the food, even the 3 vegetarians. \n\nWe had green onion pancakes which were the best I've ever had. As others have said they were not oily at all and a great spicy onion taste. \n\nWe also had the Ma Po Tofu with ground pork which was our favorite. I've never cared for tofu that much but this dish was great. On the spicy side and lots of heat. About at my tolerance level for spicyness and I don't know if you can get it toned down or not. \n\nAnother spicy dish was Kung Pao Calamari but I didn't like the Calamari in it. It was those strange scored things that you get when you order a mixed seafood dish and then wonder what those thingy things are. I don't know if it's a different part of the Calimari or if they score it with a cross hatched tool but I've never liked the taste or texture but at least I know what the critter is in mystery meat Chinese assorted seafood. On the other hand our Meetup group host liked the dish. \n\nOur host said that the Hot and Sour Soup was excellent and trusting him because we seemed to like the same things, I found he was on point. I don't care for most of the give away Hot and Sour Soups but a good one is very good as was this one. \n\nI had a sample of one of the other dinners in our Meetup group's Crab Rangoon, the cream cheese and crab puffs and it was the best I've ever had. \n\nI had a taste of some of the other dishes at our table but can't remember now just that it was all great and large portions like typical Chinese restaurants and not the fru fru gourmet smaller portions. \n\nWin Garden I understand is very new and in the place where 2 other Chinese restaurants have failed so I hope they do well. I know that I'll be back soon. \n\nLovely people who have good service and great food. Reasonable prices too, just a little bit more than the average Chinese place. \n\nPS In case you are wondering, our Meetup group is not a food group but a Jazz music followers who often go out for a meal afterwards.", "author": "Neil W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-26", "description": "Poor customer service! Please acknowledge that you phone operator is really unprofessional. How can you let your operator shouted at customer like that? I actually try to be calm since she canceled my food and I didn't get a refund from the website to find the way out and all she said is \"I can't do anything, I refund you already\" and all so ask me \"do you wanna cancel all of your orders?\" This's a bad.. no, worst business man! Tell her to chill and learn how to be nice with customer. I didn't pickup her phone when she reached me back for out of asparagus doesn't mean she can just cancel my order and be rude to me while I try to get back and find a solution. I ordered food from you guys so many times and this time is the worst! you better talk to that girl operator!", "author": "Saharat S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-27", "description": "save your money, time and appetite for even panda express is way better than this.", "author": "C C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Had the orange chicken and sweet/sour pork lunch specials. Definitely priced super affordably for lunch, and surprisingly comes with a solid serving of rice plus soup unlike other Chinese lunch specials. Orange chicken was delicious and only had a few pieces of orange peel that needing taking out. The sweet and sour pork was a little too saucy and had a lot of breading on the meat, but overall was typical for that dish. Ordered pickup but ambiance seemed solid when I came in.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "I do not normally eat Chinese food, but the food from here is delicious! The only Chinese restaurant I ordered from by online ordering.", "author": "Regina Rose S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-18", "description": "I'll admit that I eat here, but that's because it's the closest Chinese place and it delivers. The food is not particularly flavorful or fresh tasting. The chow mien is one of the blander things I've eaten. That said, they prepare your food quickly. And include fortune cookies with delivery orders.", "author": "Brittney N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "This is my go-to Chinese restaurant. Their potstickers are my favorite! Some people think they're too doughy and sometimes I get an occasional piece of cartilage, but I always get an order. I usually get their beef chow fun, but this time I tried it with shrimp. I wasn't too crazy about the combo here, so I'll probably switch back to the beef next time. I also really love their crab rangoon and wor wonton soup. My family loves the General Tsao chicken dish. Can't go wrong at this place!", "author": "Cindy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "You can't lose but only win at the Win Garden. Great delivery and great food.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-03", "description": "Food took forever to come. Almost 2 hours when the delivery window was 1 hour. I called the restaurant and all they had to say is they were busy and the driver had 6 other stops before he got to us. Food was still warm, except for pot stickers, but they were on top. By that time if finally came I was so hungry I would eat anything but really the food was just okay. We ate it, but I probably won't order again.", "author": "Christiana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "I will absolutely be back here, and Glen Park defiantly has a righteous Chinese Restaurant. Our waiter named \"Will\" was just phenomenal, and I've been to Dankos, Slanted Door etc., and this guy hella nice! Yes I said HELLA, so you know I'm a native Cuz THATS HOW WE ROLL. \n\nThe steamed vegetables w/ the Garlic Sauce  was sooooo good, my wife started to pour the sauce over her rice, and we fought for the last Crab Ragoon with our chopsticks, and I lost.... Sizzling Rice Soup was good, and also ordered the Mongolian Beef, Combination Appetizers, and Steamed Rice.....! Bring an appetite, or you will be bringing it home, good times.....\n\nI saw some weird reviews, and how can one take a packet of Soy Sauce and put it on your food, and then somehow blame the establishment, CREEEEEEEEEEEEPY!  \n\nThis place is good, the prices are good, and Will the Waiter is Fantastic.....! I'll Be Back..!", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "It's a very clean and nice place to dine Family style Chinese food. The food taste is authentic and delicious. It a must-go Chinese restaurant in its neighborhood no matter for food to-go or dining in.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "Great food and great service! Eat24 and I messed up the order and they dropped everything and made me a new order and delivered it in 15 minutes.\n\nThe meatless choices are great and I had the Generals chicken and shrimp dumplings. Everything was excellent and better than the food, was the service!", "author": "Adam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Always delicious meatless choices. I recommend the sweet and sour meatless chicken!", "author": "Scott C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "This place is a good go to for good Chinese food. It's most certainly not the best... Alice's Restaurant... but this place is great when you are in need. Great prices, friendly staff and good food. What more can you ask for.", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "This is a must try！My Uber driver told me about this place. The food is good and the customer service is even better！I went to there at July 4. Now，I understand why a lot people want to go to there to get dinner，because \"Win Garden\" is outstanding！also they told me they do the deliverly，I will try it and come back！", "author": "Manson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Would love to dine in the restaurant one day!  (I'm waiting for another delivery from the restaurant!)  This is my go-to-take-out place!  My must orders are: pot stickers (the sauce is awesome), a good portion of mushu pork, General Tsao's chicken (one of the best I've had in the bay), and Singapore noodles (the curry is just right).  Love this place!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Second time around was just as good as the first. This time we ordered:\nPot stickers - pork: Very good. Lots of ginger.\nMongolian Beef: Just OK. We weren't originally sure which was the beef dish, and the lack of distinction carried over once we started eating.\nBasil Chicken: Pretty good whitemeat chicken dish. Basil had just enough flavor to confirm it was basil, but not overwhelming. This would be tasty with some extra spicy kick.\n\nStill a fan of Win Garden!", "author": "Paul L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "Ordered for delivery through Eat 24 with delivery time between 45-60 minutes. In reality it took 75 minutes which was very disappointing. The food however, was still warm when it arrived and the portions were larger than expected for delivery. Ordered sweet and sour pork, beef broccoli, wor won ton soup, and spicy salt and pepper fish with rice of course. All were very yummy and satisfying.  We'll be ordering from them again, but maybe next time for pick up.", "author": "Cheryl M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "I ordered the General Tao chicken with fried rice no egg. This was one of the best General Tao chicken I ever had. It was only 8 bucks lunch special and it came with soup. The potstickers were just ok. Also came hot in the promised delivery time. Will order again.", "author": "Yaneke B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "DO NOT USE BEYONDMENU.COM (the service on their website)!!! Their \"customer service\" simply ignores you after stealing your money. SCAM!\n\nThe restaurant however is great! I highly recommend the \"Spicy Boiled Fish\". Everything is delicious and fresh tasting. Just be sure to eat there or call to place your order!", "author": "Willy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-31", "description": "Ordered something simple. Shrimp Dumplings, Brocolli with Fish and Brocolli with tofu. One with Garlic sauce and the other with Black bean sauce.\n\nBoth sauces were watery, The fish smelled and tasted like hot dogs (I had to throw it away after gagging), They gave me some watery brown sauce instead of Black Bean sauce, and the dumplings came as one giant blob of reheated mess. I'm pretty confused about the reviews because this has to be the worst Chinese food I've had in San Francisco. I'm hoping this was just one accidental major screw up.", "author": "Bruce W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-14", "description": "It's an okay neighborhood spot granted their to-go menu is a little confusing, especially when you're looking at it on your phone. There are many better places for Chinese food in the city, but this is the only place in this area... Honestly if San Tung had a place that just took to-go orders, I would be getting take-out from them at least once a week.", "author": "Carolina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "A star is a bit generous. How does a day of pissing out of your ass sound??? They should call it \"Lose\" Garden, because weight & a day of work is all I lost. On the bright side, they were very prompt in delivering my food poisoning. Good times", "author": "Bill S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "Great food, I got mongolian beef (best) some vegetable dishes (broccoli was great as were string beans) duck could have been better but it was good.", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "This is my favorite Chinese delivery. All the food is excellent. The portions are large. The delivery is fast. And the food is hot.", "author": "Cliff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Tasty, clean, accessible parking on the street generally.  A little spendy for the amount, but I really liked the food so much we tookout twice in three nights due to circumstances.", "author": "D R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Very solid chinese for delivery. All the dishes we ordered were good and it hit the spot. \n\nWe really liked the korean fried chicken wings.", "author": "Jon O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Went in for a casual lunch with the kids. Nice food in generous portions that arrived fast. Very attentive and pleasant server. We'll return!", "author": "ruth k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "I love this place! Super nice staff and excellent food. This is a huge upgrade over the previous Chinese restaurant that was at the same location. The new owners have done a great job! The Win Garden had become our regular Friday night tradition.\n\nTry the big won ton soup and the garlic chicken.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "Since this place had decent reviews I decided to give Win Garden a shot. Called for delivery and the man who was taking my order was very rude. When I was finished placing the order and giving my card info he very sternly asked about my zip code ( excuse me\n If I didn't hear you the first time ). I confirmed my zip code and realized I forgot to ask about drinks and I said \" I'm sorry but I forgot to ask what your drink options are?\" There was a brief silence and I said \"hello?\" The man on the phone suddenly hung up on me.  \nI then decide to call back and cancel my order, this man had terrible customer service skills over the phone, and I won't reward any establishment with that kind of service.\nI call and someone picks up, I mentioned I just called to make an order and that I want to cancel. Nothing was said back to me, but who ever it was hung up on me again. At this point, I call my bank to make sure this restaurant did not charge my card. No charges. I call Win Garden for the 3rd time and the man who took my order answered. I then told him that I would like to cancel my order because of the awful customer service over phone and his responds was he was busy taking a customers order. Unbelievable! I said I was ALSO a customer and could have been a potential repeat customer if it wasn't for the bad service. Now it's my turn to hang up. BYE!", "author": "Tanya N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "I have ordered here many times.  I love their food.  Food is awesome.  But when it comes TO following basic instructions, they fail to the highest degree.  All I ask is that they call when they are here and give me cutlery, forks and spoons. .  I never complained about it, only once I did.  Maybe they will read this and correct the problem.\nToday 010415 the driver did call and did bring spoons and forks.  \nSometimes they forget to call and sometimes they forget you requested cutlery and forget to bring it.  If they corrected that I would give a better rating.", "author": "Pat W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "This is the best Chinese food in the area, hands down. We always order for delivery on EAT24.\n\nThe Ma Po Tofu and Mongolian Beef are the two highlights for us. The Hot & Sour Soup is good as well.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-19", "description": "We ordered delivery. Everything was okay. Nothing was great. My favorite was the mushu pork. Despite the pancakes being dysfunctional, the flavor was nice. The Mapo tofu was shockingly bland. We requested the dish be spicy - pretty sure there was not a single chili in it. Def won't be trying this place again.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "Delicious dinner, kind & attentive staff, and easy parking makes this place my next favorite.  \n\nI ordered honey walnut prawns for $12.95, a Tsingtsao for $4, worth it for a calm Sunday evening in a clean, trendy restaurant.", "author": "Ann B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "The Wor Won Ton Soup was spot on...good broth, deep flavor, plus excellent and generous quantities of all of the many ingredients that are a part of this soup. Never been a great fan of their version of chow fun (bland), but this time it was better, ...good noodles and plenty of the BBQ pork (choice of several meats) and just short of hitting the right depth of flavor. Prawns with sweet pea was good and again, generous, but again, somewhat bland. Also had the onion pancakes. Win Garden's version of this dish are made thin and crispy...which I like, opposed to the many places that deliver a thick gummy mess. Not much of an onion flavor, but still, I would order it again. My sense is that Win Garden succeeds in using fresh and good quality ingredients, but really needs to bump up the intensity of their flavors. ...That special something that makes a dish zing!", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "I've lost count of how many times our office has ordered lunch from here (I'm pretty sure we've ordered from here once a week for a month or so)! The combination of the good food and super fast delivery makes it hard to order Chinese food anywhere else.\n\nOur usuals are:\n- General Tso Chicken lunch special w/ egg fried rice\n- Jalapeño fried rice\n- Wor Wonton soup\n- Crab rangoons\n\nWe aren't big fans of the egg flower soup that usually comes with the lunch special. BUT their hot and sour soup is delicious! We're never disappointed with the food and somehow always surprised at how fast they deliver--no matter if it's the middle of the lunch rush. We'll continue to order here for as long as the food quality and delivery speed stays the same!", "author": "Allison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-18", "description": "This restaurant is a typical Chinese American offering and doesn't deserve more than average at best. I ordered eggplant with scallops and shrimp. It looked ok but as I ate it it left a pool of oil behind. I called Grub Hub who delivered it and told them I thought it was not acceptable and who gave them a highest quality rating?  I was told to contact the restaurant and I went to bring in the food of which 50-60% was left and the server behind the counter said I had eaten all of it. It was sitting right there in front of me. I asked if their dishes all swam in pools of oil and she said that is how it comes and would t offer me anything. I'll never go back to this place and wouldn't recommend d it.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Have ordered from here multiple times for delivery. It's been perfect every time (by my standards). Arrives hot, tastes good and is consistent!   A few times delivery has been delayed due to the restaurant being busy ( 90 minutes one time) but to me it's worth the wait...", "author": "K H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "I am giving the restaurant a dot because the customer service I received did not deserve a star...it was offensive .  I went in to order take out, I was asked to set in the front of the restaurant.  I set down and settled into the menu.  Then I was asked to move because there was a party of six who needed the setting .  No problem.!.  We asked where should we sit, she points to the table in the middle of the restaurant.   I noticed that she never came my way, so I stopped her to let her know we were ready to place our order. She told us to go back up front to place our order.  I gave up at this point and went to another restaurant. This is the thing... had I not stopped her ... I guess she would have continued to ignore me ...she couldn't  even take my order ... really!  Patronizing a business should never be this difficult.", "author": "Deborah O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "Absolutely horrible customer service for really mediocre food. Unbelievably dissatisfying experience.", "author": "Nicholas P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-28", "description": "Awful example of service. These guys suck and shouldn't be open as a business. Hopefully they close soon!", "author": "John Michael N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "We've ordered takeout from here several times and it's always delicious. The food comes quickly and is hot and fresh. I've never dined here in person but I'll definitely continue to order takeout!", "author": "Diana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "I've gotten a lot of Chinese take out from a lot of places in SF and this place is the only take out chicken chow mein that i didn't have to hold my breath and douse heavily with sauce to snarf down. When I ate this I was just like \"damn these ingredients won't give me a terrible bowel movement.\" However more importantly, I haven't been able to find a Chinese place with cream cheese /crab rangoons anywhere in all of the Bay Area, until I hit up Win Garden. Y'all r killin it", "author": "Mikayla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "My friend and I ordered Crab Rangoon, pork potstickers, chicken fried rice, & General Tsao chicken. The food was great. And our host/waiter was awesome; He was very attentive & paid attention to detail. Highly recommend this place!", "author": "Jane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "The meatless chicken, although didn't taste like chicken, tasted pretty good! The food was delicious but the delivery time was around an hour and 30 minutes. They did warn us about this wait time, but it is longer then average from my experience.", "author": "Sawlat T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "I have been in the throes of the flu for the past week.  So, we have been ordering from Win Garden almost every night.  The food consistently arrived quickly and the customer service has been spot on.\n\nMore importantly, last night, we ordered the Chef's Special Dry Braised Chicken Wings (Spicy)!  Dare I say that they are as good as San Tung?  These are better because they can be delivered to your home (super easy to order directly from Yelp)....and come with a side of excellent customer service!  I am all over that and will continue to order from Win Garden...again and again and again!!  I encourage you to do so too!", "author": "Karla F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "So I order lemon chicken for pick up. I arrive and tell the dude at cashier my order and he's quick to correct me saying I ordered WALNUT CHICKEN. I told him I ordered lemon chicken and he insists he repeated the ordered but in reality he hung up on me instantly right after my order.. The fact he lied saying he repeated it and gave me attitude as if it was my fault he messed up. That alone will make me NEVER COME BACK HERE AGAIN!!! How are you gona blame the customer when it was your mistake?! I walked out f* this place!! Bad service!!!", "author": "Illa C V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "I ordered food from here through Yelp a couple weeks ago when I was in the recording studio with my band. Delivery was great and the food was REALLY good. I only wish I had gotten more plates, napkins, and utensils, but overall it was really good stuff. I'll definitely keep them in mind next time we're there.", "author": "Brent I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "So far so wonderful..the customer service is good .....food was Excellent. We were skeptical of coming in here after the old restaurant closed HONG SING. But now, WIN GARDEN, thank you ...food was good. Now I'm not afraid to come here.", "author": "Braddah Rick M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-03", "description": "After my original review (9/2014) I noticed a bunch of new reviews with four and five star ratings, so I thought I'd give it another shot in case maybe something had changed.\n\nSorry, but it hasn't.  Tonight's choices were dry-sauteed string beans and Szechuan chicken. The overwhelming flavor of both was salt.  Not chili, or spicy, but just plain  NaCl. They were exceedingly, almost painfully salty, to the exclusion of virtually all other flavors.\n\nSF has some of the best Chinese food in the lower 48 but sadly this still isn't it. It's unexciting at best and, as tonight showed, incredibly salty at worst. I really, really wish it were otherwise since the prices are reasonable, it's very close to my house, and I really like to support our neighborhood businesses--but sadly I won't be returning; one chance for an update seems like enough.", "author": "A.J. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "I have only ordered this for delivery but everything was very good. We ordered the black bean chicken, chicken fried rice, chow mein. The black bean chicken was very interesting and even had mushrooms. It tasted very authentic. We will define toy order again.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Tastiest Chinese food I've had in SF! The Wonton soup is so flavorful-- I've never had anything like it! The string bean chicken was so tasty. Great job on adding flavor to everything!", "author": "Lissette L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "Chicken: does it salt and pepper? It's not as succulent as its pork and squid standards. However the bird is the missing link yearned by surf and turf enthusiasts. Lemons would have made this dish a perfect ten.", "author": "Edward G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Been to Win Garden a ton of times. My go to Chinese place. \nThey are super fast. Always here/ready at their locale for pickup on time and more likely 5-15 mins early. \nEverything is in generous portions, fresh and delicious.\n\nThe general tso chicken. Always gone at my house, even if we get two. TRY IT\n\nThe veggie chow mein is awesome. Not super greasy, lots of good veggies (snap peas!), not just the cheap ones, fresh.\n\nBBQ pork buns are a little pricey but I've tried a bunch and theirs are solid. \n\nThe crab rangoons are a staple, super delicious.\n\nThe only things I didn't love were separated from me by preference. I like a modest amount of ginger and spice, and thus didn't enjoy the veggie potstickers and the jalopeno chow fun respectively. The potstickers were handmade though, and bomb otherwise, so I suppose I could order and ask for less. Same for the chow fun.\n\nSeriously, try them. They're great.", "author": "Shaymaa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Fastest delivery time I've ever had, decent food. They don't read the special instructions on the eat24 request but whatever. \n\nGood Chinese food, had fried rice and sui mai.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "The second- and last time- we ordered from here. Overpriced, poor quality and rude staff. Knowing it was Friday of a holiday weekend, I ordered online an hour in advance; specifying the pickup time as 8:05 PM (the order website has you do this, it's not a special thing). Arrived at just that time and found the food completely stone cold. They'd obviously made it was soon as order came in, disregarding the specified pick up time. The expensive Garlic Broccoli was not as pictured as chinese broccolini-type vegetable, stir fried with a sauce.. It was just plain, virtually raw brocolli, no sauce and only a sprinkling of chopped garlic, not stirfried- maybe steamed for 30 seconds? It was raw! - for $11! The roast duck was advertised as a half duck but obviously wasn't- there was no wing and only half a leg & who knows how much more of the \"half\" was missing.The salt & pepper chicken wings tasted like the meat was going bad & also overpriced at $13.The shrimp dumpling wrapper was really gummy inside, vegetarian potstickers were bland & not tasty at all.. I so regret not going to San Tung for their fabulous dry fried greenbeans ($7.25) and wings ($10); so much better pricing and quality..On top of it, staff was rude. The website doesn't allow you to pay in advance if you pick up, so had to stand there waiting as food got even colder, as gal (30's, with orthodonture) took phone orders . Other staff were milling around, wiping tables & sweeping and standing in doorway of kitchen looking out; so I asked to pick up my order as gal was on phone. Gal got mad and said \"we busy!!\" (apparently I'm not). The name on the receipt on the bag was not mine or anything close to mine (\"Lars\") , but when I questioned if it was the right order, she got mad and tore that corner of the receipt off - weird! Sixty dollars for take-out food for two w/o any drinks or dessert- and she can't even be bothered to say \"thank you\" or  \"enjoy your dinner\" or \"come again\".. she just took my money in a cold, hurried way.", "author": "Sue W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "I have only ordered delivery from them and the experience each time has been great. \n\nI live in bernal heights and the delivery times have been faster than a place closer to me on Mission.\n\nThe food is very solidly good. Not too greasy or overly salty. I like that they send the sauce for general's tofu separate from the tofu. The green beans are perfectly tender while retaining a little bit of crispness. \n\nThe portions are also large. I order 3 dishes which is enough for a dinner and lunch the next day for two people. I make rice at home so I don't need to buy it. \n\nOverall a great option for reasonably priced, tasty,  (relatively) quick option for delivery.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-18", "description": "Since this is the only Chinese restaurant that I know of in Glen Park and is walking distance from my home, I WANTED to love this place . . . .I really WANTED to . . .but I just didn't. \n\nI was pet-sitting for a friend while she was on vacay in Paris and strolled across this place during one of my many doggie walks.  Normally, I only window browse because I can't go inside any shops with the dog but this time, I was so hungry that I came up with the idea of calling in my order from my cell phone and letting them know I was right outside the door.  Searching for my cellphone while balancing an antsy dog, a plastic bag full of dog poop, and another plastic bag full of dog treats proved to be more difficult than I bargained for so I plopped myself down on the sidewalk while I searched.  That's when the waiter popped his head out of the restaurant (probably to see why I was there).  He was very polite and agreed to take my order and bring the food out to me when it was done.  \n\nI ordered the Chinese broccoli with chicken ($9.95) and the jalapeno fried rice ($8.95).  The food was done in 15 minutes and cost $20.95 (or $25 with tip).  I was SO excited about finding the place and couldn't wait to bring it home and try it.  I actually live in the Excelsior/Portola neighborhood but don't enjoy walking down Mission as much as Glen Park (Glen Park is just so charming!).  I have family visiting me soon and was looking for nearby places that they can walk to while I'm at work and, since my dad LOVES Chinese food, I hoped that this could be THE spot.  \n\nBut, unfortunately, despite loving the location of the restaurant, appreciating the staff, and finding the appearance of the restaurant to be nicer than what is available on Mission Street, I just REALLY couldn't get past the food and would probably walk over to Henry Hunan's for Chinese in the future rather than this spot.  The portions were plentiful (my order could have fed 2-4 people) and the prices were reasonable however the Chinese broccoli and chicken dish was actually rabe and chicken.  I know that Chinese broccoli looks a lot like rabe but rabe is distinctively different in taste (much more bitter) and has enough visual differences (leaf edges and size of broccoli florets are different) that the chef should have spotted the mistake.  I find rabe to be too bitter for my palate and can only stand to eat it in small quantities or when it's disguised by other food components. Although the vegetable was cooked beautifully, I couldn't enjoy it. Since the dish was mostly rabe and was the main ingredient, the mistake was just too much to bear.\n\nAnd the jalapeno fried rice was not very good.  It wasn't the worst fried rice I had (that award goes to a restaurant in San Antonio, TX which served inedible fried rice) and it wasn't so disgusting that I COULDN'T eat it but it was bad enough that I didn't want to.  There were no jalapenos in the jalapeno fried rice but there was plenty of stale red hot chili oil (I don't know why a new restaurant would have stale oil either).  There was also some other weird smell/taste to the dish that I know I had before but couldn't quite identify. And, oddly, after sifting through the rice to pick out meat (for the dog) I found a single shrimp in the fried rice.  I don't know if shrimp was supposed to be included or not (I don't remember) but thought it was odd that I would have a quart of fried rice and a single shrimp in it.  Boo!\n\nIn all, I give the food 2 stars & the service 4 for an overall rating of 3.  So sorry Win Garden, but I probably won't be back.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "I ordered delivery and to my surprise, it arrived very quickly. I got the eggplant with shrimp, sizzling rice soup, and Chinese broccoli. Everything came hot and was really tasty. The portions were big, too. I will definitely order from here again!", "author": "Nina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Hot, fast, and courteous, easy to place the order over the phone. Meal was perfect! Plenty of meat in the dish.", "author": "Nik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "I'm so excited for this place. Finally a decent chinese food place in Glen Park!! \n\nWe order take-out and delivery from this place all the time. They are fast! Although it helps that we live 5 minutes away. \n\nTheir food always comes hot and fresh. It's not exactly cheap, but the portions ate plentiful.\n\nWe've tried the following and would order all again: \n\nBeef Curry - a place that finally makes it extra spicy for me \nMah Poh tofu \nGon Chow Ou HOI", "author": "Winny F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "Had a quick dinner here during the first game of the World Series and glad to see that the inside wasn't too loud like the bars around here.\n\nDinner for two just consisted of the Dragon Beef and two sides of rice. The Dragon Beef was more or less sweet and spicy deep fried thin strips of beef which I enjoyed quite a bit, but less so for my guest. It's a shame that the rice bowls are priced separately rather than per guest because that would easily give this place a solid 4 stars. For a buck fifty, you get a relatively small bowl of rice and with dishes that taste pretty salty, you're gonna want some rice to dull out a lot of the saltiness.\n\nOverall, not a bad place to pick up dinner if you're in the neighborhood.", "author": "George Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-19", "description": "Pretty below average.  Beef fried rice that I ordered for dinner was clearly not made to order.  It was the mass stuff that was used as part of the lunch specials.  The rice was mealy/sticky and the beef was questionable.  If a Chinese restaurant can't do fried rice, then it's hopeless.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Best potstickers ever. Hot crispy generals chicken. This place is awesome with a clean health score", "author": "AL M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "This spot has seen several Chinese restaurants come and go, but I hope this most recent incarnation is here to stay. \n\nThe owners are a husband/wife team and the husband (in charge of the kitchen) used to work at Mission Chinese. We've only eaten from here once so far and it was take-out but we were impressed by the quality of the ingredients and flavors. The wife (Spring) is in charge of the front of house and she's very personable and friendly. \n\nThe previous owner remodeled the space, so it's clean and open. There's an opportunity for these owners to decorate in order to make the space feel warm and welcoming.\n\nWe'll definitely be back and I hope the neighborhood can support this new business.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "Traditional Chinese food! loved the scalion pancakes, and all the dishes. \nWe had a large group and ate family style, it was perfect!", "author": "Joe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Ordered Crab Rangoon and Szechuan Chicken Win Garden for the first time tonight. The delivery was prompt and the food was very delicious. Not as spicy as I had hoped for but tasty none the less. Generous portions too!", "author": "Jayanthi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Got delivery, took about an hour on a Sat night. Korean chicken wings were delicious. Dragon beef seemed to have the same sauce as the wings, also very tasty.", "author": "Kris Marie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "I love this place! I've never been inside but I can tell you that their delivery service is excellent. I have ordered over a dozen times and have not been disappointed yet. I highly recommend the Basil eggplant with prawns and scallops.", "author": "Lena R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Been wanting to check this place. Nice little gem. Food was very good, we had:\n1. green onion pancake, thin, flaky and not oily. Very delicious\n2. Chow Mein, great flavor could have used a little more noodles.\n3. Asparagus with black bean sauce. It was good but I can't say I'm a fan of black bean sauce in general \n3. Shrimp with eggplant. Boyfriend loved it. \n\nThis place is delicious and close by. Look forward to going back soon and trying other veggie platters :)", "author": "Belen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "What a gem.  Located in Glen Park village on Diamond near Tiger's coffee shop. Best Chinese takeout around unless you head over to Henry's Hunan on Church or San Tung on Irving.  We recommend any Potsticker, Kung Pao or Mu Shu, Chinese Broccoli with Oyster Sauce, Eggplant with Spicy Garlic Sauce, Dry Sauteed Green Beans, Szechuan Chicken, Dry Braised Crispy Pork and Mongolian Beef and any chow mein (made with fresh noodles).  Fails for us are the Chow Fun which arrived as a starchy clump (it might be better if you eat in) and we're not impressed with the fried rice.  We're still working our way thru the menu.  Next up we want to try some of the Meatless Chicken dishes.  Highly recommended.", "author": "Pam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "I ordered pick up from this place tonight. And I forgot my keys and got locked out of my house when inleft to pick up food. It is after 10 pm and they let me not only stay inside but also eat the food right here after hours while I wait for my friend. These are some really nice people. And their food is so delicious!", "author": "Ramya V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "In my opinion basically the best Chinese food outside of the sunset, especially for vegetarians. Frankly I adore everything I get from this place and the dry braised meatless chicken is my favorite. Get the pot stickers as well, they feel way less heavy than other options around the city. I also love the salt and pepper meatless chicken and always order jalapeño chow fun! Wha!!!\n\nP.S. Delivery has always shown up before the quoted time, even more than you would expect.\n\nWill continue to order from here religiously and you should, too!", "author": "Nathan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Great take out place! Haven't really eaten at the restaurant, but food is good. The veggies sides, like the Ginger Broccoli and Sauté Green Beans was a little over cooked, but good. Love their General Tso and Jalapeño Fried Rice.", "author": "Jadma N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Glad that I ordered their cumin lamb dish.   Tasted pretty good without being too greasy.   However would be even nicer if the ladies don't have to shot inside the kitchen.  Perhaps adding a kitchen door will fix that.", "author": "Tony W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "sesame ball was good (a little too much bean paste)\nwah won ton soup was good", "author": "Diane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "What a wonderful addition to Glen Park.  We have enjoyed six perfectly cooked meals here since Win Garden opened. The BEST garlic eggplant ever. It's not so easy to plate a perfect version of this classic vegetarian dish, yet Win Garden avoids grease and over-cooking of this, as all dishes, to deliver just what we asked for: medium spicy throughout, piping hot, soft-chewy-sweet-spicy goodness.  Calamari Kung Pao delivered just the same perfection. \n\nBrown and white rice, all noodle dishes:\nPerfect! \nRice and rice noodles seem such easy things to cook -and they are! - yet far too few restaurants match Win Garden's attention to detail in buying high quality grains and steaming/wok-sautéing them to perfection.  \n\n\n\nOur waiter last night was attentive without being officious. He listened to just what we wanted and made sure the kitchen used no msg, little oil, plenty of spice without going overboard.  Szechuan the way it should be.  \n\nWe've had takeout from here twice before and been delighted with soups, noodles, stir fries.... We enjoyed dining in last night: simple, spotlessly clean decor matched the unpretentious, honest food and efficient, friendly service -- all at reasonable prices. \n\nSo close to BART -- just a 3 minute walk from Glen Park Station -- less than a 10 minute gentle stroll from anywhere in Glen Park and close enough to most other SF neighborhoods to get here fast - or enjoy free home delivery - that I hope the place succeeds wildly but fear it might become so popular we could have trouble finding a seat in future.\n\nHot and sour soup was both hot and sour -- and just a tad overly salted. Still, it had layers of umami and a great mix of spicy, salty, and naturally sweet, to make up for the heavy hand with salt.  \n\nWe will try the free delivery soon. Or just pick it up on the way home again since it's so darn easy. Can't wait to invite friends to meet here.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Small place but some of the best Chinese food I've had with great prices:) great place to take the family. I recommend the wonton soup", "author": "Jasmin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "Pretty solid food ...the general Tsao chicken was crispy and sweet and a little spicy and good and the chow mein was really good have a good amount of vegetables in it and salt pepper shrimp was okay I could have had a little more pepper on it. Now I'm already hungry from writing this because I ate it 30 minutes ago", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Fresh and delicious! When put in my delivery order they told me that they were especially busy that night but they delivered within 30 minutes -- much more quickly than I was expecting. We got the lemon chicken, jalapeno chow fun noodles, and crab ragoons and it was all so good. I'd especially recommend the jalapeno chow fun if you like spicy food. Will definitely be ordering from here again!", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-25", "description": "The food is good in taste. We tried the orange chicken, bok choi, egg fried rice, chow mein, and shrimp in a cream sauce. That's where the good news ends. The food gave my fiancée and myself medium and serious stomach pain, on the verge of stomach flu. In a pinch I would give them another chance, but not for any occasion. Their extremely lax treatment of credit card numbers, expiration dates, 3 digit codes, and addresses of incoming phone orders is seriously troubling. The man at the cash register would put callers on speakerphone and have them give their payment information and then repeat it back to them in full. In my 30 minutes of waiting for my order in close proximity I must have heard 6 or 7 sets of payment info. If you're ordering pick up or delivery, do so in person or via Yelp.", "author": "Anton U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Why didn't I order here before!! I found my spot!! The food is really good and very tasty! We were literally talking about the food the following day. LOL. I never called in the order, I ordered online. But, let me tell you that the customer service was outstanding. The delivery driver was extremely polite and kept thanking me for the business. I'll definitely keep ordering.", "author": "Patricia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "We have not been to the restaurant, but had our supper delivered.  The delivery was here within 30 minutes of the order. The delivery man was nice and courteous.  He thanked us for ordering from Win Garden.  He made sure we had everything and he made sure that gate was firmly shut.  (This is critical because I have had to chase my Pommies down the street when other deliver folks did not close the gate after being asked to make sure it was slammed shut.)\n\nThe food was hot and delicious.  We ordered Beef with Chinese Broccoli, Tofu in Black Bean Sauce, Walnut Prawns, and Singapore Rice Noodles.  \n\nWe have found that a restaurant that does poorly on the Walnut Prawns doesn't do that well with anything.  The Walnut Prawn expert in our group thought the dish was perfect.  Lots of prawns, walnuts, and puffed rice noodles.  It was pretty to view and tasty.\n\nMy dish to order was the Beef with Chinese Broccoli.  I love Chinese Broccoli and Beef.  This dish was full flavored with both the broccoli and beef perfectly cooked.  It was a very colorful dish that was delicious to see and even better to eat.  Excellent.\n\nPerfectly cooked braised tofu in black bean sauce is sometimes hard to get.  This lovely dish was graced with braised tofu, mushrooms and blackbean sauce.  Yummy with great mouth appeal.\n\nThe Rice Noodles, Singapore Style were perfect.  We ordered one order per person because we wanted some for breakfast or lunch tomorrow.  They were delicious.  There were prawns, meats, and veggies that were all perfectly cooked with the light curry flavored noodles.  They were soooooooo yummy.\n\nEverything was fresh and fresh tasting.  The seasonings were wonderful.  Comparing the foods I have eaten while in Asia, I can say that it is definately NOT standard Americanized fare.  It is good cuisine We will definately order from them in the near future.", "author": "Gail S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Best Chinese delivery I've had since moving to the area.  Will order from again.", "author": "Jon F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-23", "description": "I'm changing my two star rating to a three star rating, because after I got past my disappointment about the SIMILARITY of the ingredients in what I had expected to be very DIFFERENT dishes, I was able to appreciate the QUALITY of the ingredients -- especially the next day, when enjoying leftovers.", "author": "Marvin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "I love this place. Fast delivery. Consistency. Great Customer service. The general Tsao chicken is crispy and amazing. Vegi fried rice is a must. Pork chow mein is tender. Shrimp and walnut is delightful. This food is spot on, don't know if I could order take out from anybody else. I'm loyal!", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "This place is terrific!  We had the hot and sour soup which was delicious, the cashew chicken and the chicken with veggies were very good.  But, my favorite was the basil tofu with eggplant. Yum, yum, yum! The service is fast and friendly.  I'm going back!", "author": "Debra O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Best Chinese food I've had in SF, good prices, and a really great delivery experience. I ordered off the dim sum menu tonight, and I'm so glad I did. My order:\n\n-BBQ Pork Bun: 3 delicious steamed pork buns\n-Shrimp Dumplings: perfect, amazing, best ever. Delicate and light, yet warm and sticky and comforting. Fresh, real shrimp, amazing little pillows of goodness. I forget how many there were--I ate them so fast I forgot to notice!\n-Turnip Cake: 3 cakes, great texture, subtle flavor, very nice\n-Broccoli with Ginger Sauce: (located on the salad menu if you're using their website, but this is not salad) tender broccoli with just the right amount of snap, perfumed with fresh ginger, nicely flavored with no gooey or heavy sauce. I love this portion and price, rather than having to order a separate $10 entree just to get veggies in my meal like at most places. \n\nI also ordered some white rice, and I swear even the rice was better here than anywhere else, as were the dipping sauces. Their chile oil is so good I want to put it on everything in my fridge. I couldn't believe how fast my order arrived--the driver laughed and said they weren't busy. He was friendly and polite. \n\nWin Garden, you have won me over. I can't wait to try the rest of your menu.", "author": "H. M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-19", "description": "We eat a couple of times in the restaurant. The food is decent but the service is lousy- unorganized and slow.\nToday we tried to get takeout and I called the order in- I was told 25 min it would take. After 45 min from calling (waited already 20 min in the restaurant) the waiter reconfirmed my order and telephone # and told me \"it would be ready in 5 min\"- after the full hour we finally got the food. Unacceptable service.\nBeware- the dishes come without any rice.", "author": "Thomas P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "So just to be clear, I've seen this chinese place change names and management...and as a chinese-American, I'm going to be brutally honest. Win Garden is really good! The prices are decent and the inside of the restaurant is simple yet clean. Service is quick and friendly. But the best part? Yes, it's definitely the food and no, not msg lol. This place tastes even better than Red Jade!! In my book, if you can make vegetarians dishes taste good, then you definitely know what you're doing. Here, they make the best eggplant lunch special that I've ever tasted hands down. Yes, this establishment is new, but trust me when I tell you that the chef knows what he's doing back there and I'm so happy that I no longer have to travel all the way to church for green beans, sesame chicken or eggplant tofu...when we've got a great little chinese place here in glen park! So happy that we finally have a good chinese place after Hong Sing establishment closed. Give Win Garden a chance- they also have a dim sum menu too! \n\nSidenote:\nI just read some overly harsh reviews that was obviously written by some snobby wannabe critic...anyway, this place is definitely comparable to some of the other restaurants you would find in Chinatown. Maybe it's just me, but it's so annoying to hear ppl bash chinese food ... FYI - PF Chang's is not authentic chinese food in my book...and neither are the other fru fru places that purport to serve it too. The taste here is actually very close to what the food tastes like in China. Obviously, not every dish is palatable to everyone...so use your common sense and order something else because sometimes telling the waiter what you're looking for is smarter than ordering something you hope tastes like Panda Express because this ain't Panda Express and it ain't PF Chang's either. So don't get it twisted. If you're looking for yummy good old fashioned Chinese food - then this is the place to go. Good eats ya'all!!", "author": "Rayne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "Yummy food and great veggie options- meatless orange chicken and chow mien are  great!", "author": "Zan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "If I could give them no stars I would in a heartbeat! HORRIBLE HORRIBLE HORRIBLE customer service!!! We orders thru eat 24, our order hadn't been delivered in over an hour so I called and they hadn't even checked their orders online! When I complained the rude ass man said he didn't wanna argue and that he'll call to refund my money while my kids are hungry AF waiting for their bumb A** restaurant to deliver! NEVER AGAIN!", "author": "Diana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "It was a little odd walking in on a Saturday night, because the place was nearly deserted, other than one other couple a few tables over and a worn-out TV blaring sports on the back wall.  But Win Garden won us over with good service, cloth napkins, aluminum chopsticks (but slippery!), and really well-prepared food.  I honestly was not expecting the food to taste as good as it did, and both of us agreed everything here was well above average.  The ingredients appeared to be very fresh, and everything was flavorful.  If this place were located on Valencia, Divisadero, Chestnut, or even Irving St., I think there'd be a line on weekend evenings. These guys deserve it.  So do yourself and Win Garden a favor and give 'em a try some time -- easy parking, very close to BART and MUNI, fair prices, no waiting, and very very good Mandarin-style food.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Perfect Chinese take out that is never greasy. Fresh ingredients, really good flavors and a great menu. Everything I have tried has been spot on. Nothing fancy, just really good Chinese food. My new go-to-spot in the neighborhood that is Glen Park.", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Just what we needed in our neighborhood......DELICIOUS Chinese food. Moved from SOMA (3) years and FINALLY found a place I can't live without!!!! YUMMY!", "author": "Melinda R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-23", "description": "I was having a serious craving for greasy Chinese food... Ordered to-go and told them I was allergic to seafood and nuts/peanuts. I left for a few minutes to run some errands and came back. The guy told me that he told the chef to avoid shellfish, nuts/peanuts, sesame seeds, and soy sauce. I told him soy sauce was fine and to tell the chef... so he went back there and returned with the food saying that he was sorry that the food had already been prepared. The guy was nice and considerate, perhaps overly so. But maybe he needs to learn what different types of foods cause allergies, since he works in a restaurant. An allergy to nuts/peanuts doesn't mean an allergy to soy sauce. He gave me two packets of soy sauce and chili oil. I came home with white chow fun and white chicken. It tasted very underwhelming, even after I added a whole packet of soy sauce. Now I have a headache from the MSG in all that soy sauce I added and no satisfied taste buds to show for it. I spent over $20 for Chinese food and I'm still craving it.\n\n Also, I received no napkins or chopsticks.", "author": "Jeanne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Win gardens changed owners 4 or so years ago. It is a  geat neighborhood rest.   Reasonable, mostly standard fare, great service.  They also accomodate my wierd changes, mixi g things: \"string bean chicken but the sauce in mongolian beef?\"  ... \"Sure\"", "author": "Rich S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "This is a good clean Chinese food restaurant. Good Chinese restaurants are hard to find. I have eaten here 5 or 6 times, and every time it was delicious. The ingredients are good and the flavors rock. It is also quite reasonably priced.  I am really excited about having a good Chinese restaurant in the neighborhood and the city.", "author": "Karim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Win Garden is a must go for clean, delicious Chinese food. The front of house is courteous, thoughtful and genuine. We have lived in the Glen Park area for years and I can say I'm excited for Win Garden. Today I placed an online order to go and came in after 15 minutes and didn't expect the meal to be ready as it was a large order but figured I'd wait, wasn't in a particular hurry. The staff promised me it would be done in 5 minutes, which it was, and offered me a seat and glass of ice water right away while I waited. Impeccable customer service, great food and a decent price. Keep up the work!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Pretty tasty Chinese food! I enjoyed it. It's very conveniently located near my house. I ordered the fried rice and crab wontons. Obviously not as good as a place in Chinatown, but fairly cheap prices and a good location means I'm interested.", "author": "Chad H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "I am very happy that win garden is here. Over the years I've found myself staying away from chinese food as it tended to not be very healthy and the ambiance sometimes lacking.  This restaurant not only has plenty of healthy and vegetarian recipes but it also has a really good meatless generals chicken. they also offer brown rice which is another nod to health.\nThe decor is pleasant, with white table clothes which offsets the TV. My only suggestions would be to dim the lights just a bit.  But maybe thats just me-- a chinese food romantic:)\noh darn-- late breaking news.  I just ordered 2 dishes and a rice order for $25 for me and a friend  and they only delivered one fortune cookie.  More importantly they delivered the dishes in plastic instead of the more planet friendly paper containers we have come to associate with take-out.  2 minuses (the first very forgiveable, the second a big but easily solved problem), but still a great addition to the neighborhood", "author": "Sophie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "YUM! I have been looking for a place around my house that was responsibly priced with good food quality. success! clean tasting food, and not greasy at all like other places. will definitely go again! Looking forward to trying the vegan options :)", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "Ordered via eat24. Delivery was scheduled for 50 minutes and ended up taking 1 hour 40 minutes. The food was cold and congealed and I was never given an explanation or an apology, so unfortunately there is no way I would ever recommend them. If you want to try your luck with take out or eat in, have at it. But delivery, no way. There are too many great Chinese restaurants in this city to give this one a try.", "author": "William N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-31", "description": "I ordered delivery for the first experience with Win Garden. It came in a reasonable amount of time and was still moderately hot. As a vegetarian, I ordered the spring rolls, General Tso's meatless chicken, broccoli with ginger sauce (app), and white rice. The spring rolls were good and seasoned well, but not a SF standout. The meatless chicken was tasty, but a bit soft. I love that they sell veggies in a smaller size then the normal $8.95...and the ginger broccoli was amazing. It was so fresh and cooked just enough with strips of fresh ginger. The rice on the other hand seemed old. I will order again and I recommend trying it out.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "I really enjoyed the food, by far the best fried rice I've had in the City. We also had Szechuan Pork which I thought was in the top 5 we've had, and an order of West Lake Beef Soup. \n\nWe will be going back and think this restaurant stacks up well against the other restaurants in Glen Park and against the best Chinese restaurants of this style in the City.", "author": "Mr. K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-01", "description": "Food arrived 45 minutes after estimated delivery time (in total 1 hour 45 minutes). Had to call the restaurant directly to get an updated status, and 20 minutes later, the food arrived. Keep this in mind if you're hungry!", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "From reading the reviews I would have never come here and I am so glad I didn't. Just moved here and could never find a place to eat until a few weeks ago. The food is really good and very flavorful, has veggie options , and very nice staff. I come here almost everyday now", "author": "Rebeniric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "Loved take out from this place! I had sweet and sour soup (could have been slightly spicier), broccoli beef, and pork buns. Delish. Remembering it for the future.", "author": "Nkat H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "I'm always very surprised by how good everything is here, honestly some of my favorite Chinese in the city. I've tried the General Tso's Chicken and Mapo Tofu, both were excellent. The shrimp dumplings are insanely good, as well as their pork potstickers.", "author": "C J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "I went there with a huge group. The restaurant handled that well. Everyone raved about the food. I'm taking that into consideration in giving them such a high rating. I didn't find anything that stood out. Nothing was bad. It was extremely Americanized. The avocado wontons were weird. They have Chines hot mustard. I like that. Anyway, my boyfriend now swears by the place. So, I'm eating a lot of it. Here's what isn't bad. The food is not greasy. The rice isn't mushy or hard. The vegetables are plentiful.", "author": "Therese M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "I certainly concur with other writers about the need for Glen Park to have a decent Chinese resto -- this will do just fine.  I've eaten in once and done delivery, and both times the food was well-made, fresh ingredients, and cheerfully served. The menu is very well designed, and off it I have had the Westlake soup, Hot and Sour soup, chicken wings two different ways, Mu Shu pork,  Triple Delight, sesame rolls, and turnip pancake.  I will keep exploring the menu, again both from there and my home. This is not Mission Chinese, although one of the principals has worked there, and the Mai Po Tofu shows evidence of that -- however it is a very solid repeatable choice when you get that inevitable urge for Chinese and want it here and now. Support Win Garden. I will keep going.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "The food is bland. It needs something to make it tasty. It's good, clean food but it's bland. The portions are large, the staff is great and the place is bright, clean and quiet and the prices are fair. I've eaten there once and had takeout once (very fast delivery service). I'll be going back because the food isn't bad and it's the only Chinese option in the neighborhood AND they are open for lunch - a big plus. But honestly, if I were going to order takeout for delivery again, I'd call Mission Chinese Food.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "I ordered the BBQ pork, pot stickers, wor won ton soup, and a box of white rice.  The food arrived in less than 30 minutes and was hot and ready to eat.  Everything tasted great.  I will definitely order from Win Garden again.  The total cost for the food was $28 and change and I tipped the driver $3.", "author": "Jerry Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "Very good standard Chinese cuisine.  What's not typical of Chinese restaurants is that the place is very clean, both in the dining area and in the back of the house (based on the 98/100 inspection score I saw posted).  We will be getting takeout from here regularly.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "This is my new go to for Chinese food. The 5 stars is because it's NOT too oily and heavy.. It's not mind blowing but its better then the competition.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "Came here in need of a quick meal on our way to SFO. Not only were they super accommodating, but the food was outstanding!  Super pleasant surprise, especially in light of it not being super busy, and surrounding restaurants were jammed.  We'll be back!", "author": "Rob D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "Healthier, fresher food than most other Chinese restaurants I've tried in SF--especially the quality of the veggie's, and lean chicken breast used in mixed dishes.  Chow mein I had was unusually non-greasy compared with most.  And this at a low price ($6.95 to $7.95 for lunch), in a clean, pleasant restaurant, with efficient service.  Lot's of meatless choices for vegetarians, as well as plenty of choices for meat eaters.  Don't know why this place isn't more popular; it should be.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "I love the food and close too home. A little pricier than other local Chinese food spots", "author": "Irma P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-11", "description": "I ordered from there tonight. The food was okay, as thus far I have only eaten the won-ton, shrimp, and crab Rangoon. I have yet to eat the house Chow Mein and and my Sweet and Sour Pork!  I had asked for a container of sweet and sour sauce, to dip the aforementioned dishes in!  I was sent and empty container with no lid, and 3 little portion control cups of sweet & sour sauce! It was just enough to successfully dip the shrimp in, which were small, but tasty! I called to complain that what I asked for was not given to me, and that I was given an empty pint container with no lid and the 3 little portion control cups of sweet & sour sauce. The guy continually re-iterated that they give one cup for each order! I told him that it was not enough to dip my food in! I told him that since I was paying for it, I didn't care that they usually gave 1 per order, and that I wanted what I asked for, and I had no problem paying for what I wanted!  When he began to re-iterate again, rather than argue, I informed him he should have given me what I asked for, but he needn't worry about it . . . That I would never order from his business again!  I all fairness, the delivery guy was nice, and arrived quickly, so I gave him a nice tip!  So, that is my experience with this business!  Let me make it clear I have no problem paying for what I want! If it cost a dollar extra, I would have gladly paid the dollar! I don't care what you \"usually do,\" I want to know that you could do what I ask if you can't you should have informed me when I ordered it! Anyway, because of his behavior, this business has lot a good customer! Thus the low score!", "author": "Veronika F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "the newest chinese food addition to glen park. big portions, fair prices, nice people, pretty authentic food.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-11", "description": "horrible service.  we were the only customers in the place. we sat waiting for 15 minutes while the waiter walked around and ignored us and never gave us menus. we decided that this was a sign of more to come, so we left.  never going back again.", "author": "william c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "Decidedly above average Chinese food, but exceptional service.  They got part of our to go order wrong (included those dreaded bean sprouts although we requested no bean sprouts)... Of course we didn't realize until getting home.  Didn't expect much in terms of correcting the problem but called anyways to let them know, and they offered to redo the order AND deliver it so we wouldn't have to go back.  They even recognized their error and apologized. Maybe I have really low standards but I didn't expect that level of customer service for Chinese take out.  Food was also great so they've won us over and we'll definitely return!", "author": "Mana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "We didn't know where to go on Christmas day for dinner. Win Garden was open, so we gave it a try. We were all very happy with the experience. The food was really good. In the neighborhood, good food, and open on Christmas.", "author": "Linda E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "I've gotten dinner delivered twice and have been very happy each time. The food was yummy, good sized portions, fresh and arrived quickly. WIn Garden is several steps up from the quality of the food in the previous two Chinese restaurants that occupied the same space, and beats out other Chinese delivery I've sampled in this area. Glad they are here in GP, hope they stay.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "Best Chinese food delivery in the Glen Park / Diamond Heights area. Great flavor and affordable.", "author": "Steven G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "I was visiting from Los Angeles and ate there the other night. The spring rolls are a must get and same with the crab puff. If you are in the area and like Chinese food should should defiantly eat here.", "author": "Gram N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "I really hope this restaurant makes it.  I was depressed when the previous Chinese restaurant in this spot, China House, closed after only 6 months.  Glen Park needs a decent Chinese restaurant.  I've been to Win Garden twice now, and I ready to say that it has found one.  It is better than China House, and is the kind of good (but not fancy or expensive) Chinese restaurant that every neighborhood should have.  If you live in Glen Park, you should go here.", "author": "Daniel A."}
