{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "Tried the $41.80 special dinner set for Sunday lunch today. Korean cowboy bones were the best followed by fish fillet & tofu claypot. Portions of roast duck in the two bbq items combo plate weren't that good... garlic Chinese broccoli was standard. Came with house soup. Rice per person is $1.50 -- all in all a good neighborhood meal for 3", "author": "Cathrin P C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-29", "description": "Wanted to try their Hung Tao Yee Fu WonTon....  The wonton were tasty.   Nice mix of meat and shrimp, but the broth was just egg drop with a little bbq pork in it.   No crab, cilantro, etc.\n\nAlso saw that they had good reviews for the chow fun.   I ordered dry style black bean beef chow fun, and the kitchen made the gravy style.   Rather than wait for them to remake it, I kept the sup gum chow fun.   The gravy was pretty salty, and kind of greasy.   \n\nTheir sui gow dumplings were pretty good.\n\nIf I'm in the area, I might stop by again, but wouldn't go out of my way to eat there again.", "author": "Fun T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "I had a BBQ pork noodle soup when I came here. The place is a sit down restaurant as well as a meat shop. There were tons of customers for their meats, but not as many people were dining in when I went.\n\nThe soup I had was pretty bland and I've definitely had better for the same price. There was a ton of BBQ pork and the noodles were cooked well, however, so it was well worth the money. However, the staff are really nice in that the credit card minimum was $20, but they let me use it since I had no cash. \n\nThanks!", "author": "Derek K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "HAIR IN THE STEAMED RICE!!!! SMH!!! \nPlace is gross.  I have found hair in the entrees from here but I was dumb enough to go here again:\n\nHAIR IN THE STEAMED RICE!!!! SMH!!! \n\nHAIR IN THE STEAMED RICE!!!! SMH!!! \nPlace is gross.  I have found hair in the entrees from here but I was dumb enough to go here again:\n\nHAIR IN THE STEAMED RICE!!!! SMH!!!", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "The best roast duck in San Francisco. I've tried them all and it's better then the one on Noriega and the roast duck ships in Chinatown.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Went here for lunch and had the Roast Duck and Roast Pork 2 item combo. If you specifically request a duck leg it's just $1 more.\n\nThe roast duck was decent but it is slightly on the leaner end and they don't have any plum sauce. That being said they do include some soy based sauce in the rice.\n\nThe roast pork was acceptable, nice crispy skin on the outside and relatively tender on the inside. The cabbage was a bit over cooked and a little soft.\n\nOverall a decent place but not the best.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Super chill family style restaurant. The staff is incredibly nice and because it's super lowkey, you get a lot more attention from the waiter. The food is worth far more than the price - I can probably find the same stuff in the Richmond or even Chinatown for $5-8 more. I'll definitely be coming back for more Peking duck!", "author": "Calvin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "It's weird that I haven't reviewed this place because I've been coming here for as long as I've lived in this neighborhood-- 20 years! This has been under different management or ownership at least a couple of times. However, some of the same staff is the same. \n\nFood is good. That is never really an issue. For the most part, it's been the same over the years. I do notice from my recent visits (usually takeout) that the portions are a little less and/or they skimp on the meat. Super disappointing. Some of my family's favorites: wonton noodle soup, Hong Style combination chow mein, pot stickers. \n\nThis place has loyal patrons, especially because of their roast duck and other BBQ items (bbq pork, roast chicken, etc). I'm teetering between an overall score of 3 and 4, but I'll give them the benefit of the doubt and go with 4.", "author": "Lani S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Came here on a Saturday morning when it opened. First people in but other customers came. I would come here when I was a child and got the duck noodle soup I haven't been here in years at least a good 10-15. I was craving some duck and egg noodles and this is closest to my house. I was pleasantly surprised to know the wonton duck noodle soup tasted the same. The broth could've been a little more flavorful but it did not disappoint. I remember the bowls being bigger but maybe that's because I'm older now. The service was great. There was some confusion with my friends order but the cook and waitress were kind enough to come back to the table with a plate of fresh noodles and confirm those were the noodles she wanted. Would come again.", "author": "Chloe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "Passed by the restaurant and had lunch. Order a rice noodle, good taste though a little bit hard to swallow... that's probably why they have it with soup.", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "It looks like they recently under gone new management - the prices seem to gone up a bit. \n\nI've been ordering take out since it's super convenient and feel like the service went a bit more downhill. Basically walk in, they ask for your order, make you pay immediately. Also, i believe the owner keeps asking if you're paying in cash since they obviously would prefer not to let you charge. \n\nI ordered a whole duck, BBQ Pork, and some rice which was just enough to charge on my card since I didn't bring enough cash. He made a big deal and asked, \"Can you pay with cash?\" Like, I would if I had cash... but again, typical chinese restaurant service.", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "I've been familiar with this restaurant for decades. They've changed hands at least twice during this time, and it's been on and off my go-to list, depending on who is managing it. I've hit it a couple of times in the last few months. The service is courteous, and the food is consistently good. My most recent take-out order included \"wet\" style beef chow fun, Mapo tofu, bbq spareribs, char siu, and eggplant. All were a hit with the family.", "author": "Virg Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-29", "description": "The tiny tank of giant carp is thoroughly depressing.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "One of the best places for chow fun. The same reason why many people are crazy about using old cast iron pots/pans because it's been seasoned over time, woks are similar. Not many places are able to produce a smokey flavor in their food for this reason. This place got it and it's very apparent in their chow fun.\n\nTheir roast pork is also great here. They don't do the whole pig, just the belly. I have no complaints.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-15", "description": "We came here at about 4pm on a Saturday afternoon due to its proximity to Ocean beach where we were heading to. It was a pretty quiet eatery. We ordered the roast duck rice and wanton noodles. Considering it was such a quiet street area that afternoon, we didn't have very high expectations. However, we were pleasantly surprised that the food tasted good. Portions were very generous for the price, which is a rare sight in the city. Service was prompt and adequate.", "author": "Lindt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "This place is so far out on Taraval, you can kiss the ocean.  These are the basics I was introduced to at Win's:  soup with black mushroom dumplings, bbq pork, roast duck, gai lan and, of course, a bowl of white rice.  I haven't tried anything else.\n\nThe soup is nothing special.  It's a thin broth, if that, but the dumplings are the stars.  Juicy, tender skins hold slivers of crunchy black mushrooms  I haven't seen these elsewhere and they are a treat.\n\nBbq pork and roast duck are some of the best.  And cheap, too, for a small plateful.\n\nGai lan just because you need that bright green veggie doused with savory, salty brown oyster sauce.\n\nAdd a little rice and you have a simple, delicious and filling meal.", "author": "Sondra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "Sometimes you just crave greasy food and the Asian girl in me knows where to go when that craving hits.  Win's is your typical Chinese BBQ restaurant where you can get your BBQ items, fried rice, chow fun , peking duck and lots more.  Most of their customers order to-go.  But eating here isn't too bad. Surprisingly, it's clean, even the restrooms. I feel this place is better than Cheung hing.  You can get 2 BBQ items over rice for under 9.00.  That's a pretty good deal in today's world.  I normally get the roast duck and roast pork over rice. It's soo good!.  My friend and i have also good have an order of peking duck to go.  You should eat it quick before the skin of the duck is no longer crispy. The Chow fun with beef and bell pepper is delicious! I normally ask them to use less oil when they make and it always comes out perfect.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-16", "description": "The food is ok, not a lot of flavor, but the spring rolls are the best I've ever had in my life!!! The spring rolls have amazing flavor and they're freshly made!", "author": "Melody R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "Family Fav for take out. Pots tickers have great taste for a change of fat dumplings at other locations. We order cashew nut chicken, broccoli beef, veggie chow mein, orange broccoli chicken, and snow peas :) cheaper large portions for family is a huge plus...we enjoy their friendliness and the butcher up front reminds me of family..", "author": "Dianne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Love the salted fish fried rice, salt & pepper pork,  the roasted duck, & hung siu dao foo.  I haven't been here in a while.  It use to be my go to place.  Pleasantly surprised that they have renovated: new tables & chairs, kitchen revamped (that's what the worker said), and looks cleaner than before.  The food tastes more fresh and better than I remember.  The only thing that tasted better before is the Chinese broccoli.  Will have to frequent this place again.", "author": "Jeannie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "New owners that are carefully watching standards with better portions. The lame owners from before are finally done! Those cheap bastards!", "author": "diewney n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "This is my favorite Chinese place. I always get the noodle soup and wontons. I have also had a bunch of their dishes when I ate with my coworkers and it was like a Chinese wedding banquet and all of the dishes were perfect. \n\nMy favorite are the noodle soups, of course, and fried chow mein. Also, their fried shimp rice looks plain but its bursting with flavor - like all of their food.", "author": "Steph N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "It's litty!\n\nBBQ pork fried rice and honey walnut prawns can give a blind man sight. \n\nIf you havent been here before start living your life. \n\nAlso I dont like spending all my money, So this place is a great deal .", "author": "AllPodcasts M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "Better customer service now! Since new management. Stopped going there for awhile due to old management.", "author": "roland l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "When I'm here I only order one thing: duck over rice to go. They give it to you in under 5 minutes so you're really in and out. The portion is huge; I typically share this with my boyfriend and we are both left satisfied. Given the chance, I probably could polish this off on my own, but I would probably be too stuffed to move.\n\nThe food is honestly greasy and salty, but it's the same taste from when I was a broke and starving college student so it's a nostalgic taste that I don't get tired of. I guess the only difference is that the price and the portions of this dish went up.", "author": "Hayne P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "The food was decent and the prices just fine. Woke up the next morning feeling like I had been stranded in the desert for days... though that isn't atypical for chinese restaurants unfortunately.", "author": "Courtney Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-20", "description": "I used to always come here for a cheap bowl of noodle soup or rice porridge before games at Saint Gabriel back in elementary school, but I just happened to wander back here the other day. Things haven't changed too much in 10 years, which is great. Prices are still dirt cheap and the quality is good. \n\nWe opted for the Win's special noodle soup and I \"upgraded\" to yee mein. Overall, it was good. Served in a nice hot broth with pieces of chicken, shrimp, and squid, I found this to be very filling for $7.95 ($1 extra for the yee mein)...however, I couldn't get over the fact that they cut all the noodles into these tiny pieces (-1 star)! Also ordered a sole fillet porridge which was very hearty. The porridge was infused with slivers of ginger and had a substantial about of fish. It was very satisfying. We also tried their dumplings. They aren't very big, but everything worked together nicely. I also liked that the black fungus didn't overwhelm the entire dumpling like it does in other restaurants.\n\nDefinitely a go to for quick and cheap takeout on a busy day!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-01", "description": "It is a very traditional Cantonese restaurant. It is on the 40th avenue. There are various kinds of food, such as toss noodle, noodle soup, rice and so on. I ordered beef fried noodles. It tastes just so so.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "For 18 dollars you take home the whole damn duck. The best damn duck in sf. Juicy tender fatty and flavorful. Even the bones taste good. Not salty at all like the others", "author": "Gio B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "I'm a fan of Win's. What can I say, I grew up eating their juicy, crispy, duck. I can honestly say that this duck is better than the ones I've had abroad, in Hong Kong. I like the service here too. They try hard, even though it's usually only one waitress and one chef near the window. She always smiles at me and gives me free soup.\n\nHere's what I can vouch for:\n\nTheir duck\nTheir wonton noodles\n\nThat's what I give them 5 stars for because that's what they do best here.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "Win's Restaurant is one of my top finds since I've really started exploring food in SF. It's got the mom and pop shop vibe and serves simple yet delicious tasting dishes for amazingly affordable prices. \n\nWhenever I come with my friends the big seller is always a nice warm bowl of wonton noodle soup- for less than $4!! Great broth, nice portion of noodles, and freshly made wontons; what a great buy! But wait, you can turn it up a notch- get the wonton noodle soup with a roasted duck combination (get the duck on the side) and it brings the total up to ~$6.80. After a work out or a run around lake merced, this dish is a well earned choice. \n\nI've been to Win's about 6 times in the past 6 months and have had excellent service with the staff. They mainly speak in cantonese, but coming from someone who doesn't (me), I can vouch that ordering and speaking to them in english doesn't hinder the experience or meal. \n\nMust try dishes that really hit the spot:\n\n-Wonton noodle soup with Big Dumplings  or roasted duck (both are my faves)\n-BBQ pork braised noodles\n-Pork spareribs over rice\n\nAnd with Fall and Winter coming, I will be back very soon for a delicious and well portioned bowl of noodles, wontons and duck!", "author": "Jon K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "This place is not very well kept, it smells of old duck fat as you walk into the restaurant. The service is very fast, the meal taste very homemade. I didn't get the MSG headache or thirst after eating here. The restaurant was empty at 530pm on a Thursday. I don't think I'll come back as I had issues with the cleanliness and smell.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-26", "description": "I use to order from this place at least twice a month.  I would always get the Win's Special Pan Fried Noodles with seafood.  OMG.  So good!  It wasn't hard finishing the whole thing by myself.  \n\nUntil one day.... I found out what the \"special\" meant in Win's \"special\" Pan Fried Noodles- pubic hair  =(  Never again have I returned.  I've searched high and low.  No other restaurant has compared to the price and taste of Win's.  I will not give up.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "This was the most disgusting Chinese food I have EVER had. My boyfriend and I could only take 2 bites of our orders before having to throw them out because they were so gross. He had barbecued pork chow mein and I had chicken fried rice, which are possibly two of the easiest/simplest things to make. How do you screw them up so bad? His noodles weren't cooked, everything was greasy, and I literally think I'm going to puke because of the taste in my mouth.", "author": "Rebecca J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "My neighborhood restaurant good with BBQ pork, Roast Pork, Boiled Chicken, and Roast Duck. I like to get boiled chicken and roast duck there. Personally, I like this place better than Cheung Hing on Noriega because Cheung Hing's roast duck has too much MSG. I love roast duck and I am not allergic to MSG. However, too much of MSG will get me sick. Also, food overall is on average  and with reasonable price.\n\nI minus 2 stars here because of their service and decoration. Don't get me wrong, their staffs are nice there. However, the owner couples had two times ignored me and I left. I am not very sure if the sauce cost them a lot? Many times I did not get my sweet and sour sauce with my roast duck. I need to ask for it which most of the restaurant will come with the sauce without asking. If I ask for extra sauce, they do not seem like very happy with it. \n\nFew years ago, I ordered a pan fried noodle 煎麵 on both sided 兩麵王 and ask for red vinegar on the side. They owner debated with me and asked \" where are you from, why are you so strange, eat noodles with red vinegar?\" I thought they suppose to come with red vinegar without asking. \" I was born and raise in Hong Kong and I always see that dish with red vinegar on the side since I have memory .\" I answered. Then he asked, \" Which part of Hong Kong? What restaurant? I did not see that at all. Maybe it is only your family. \" So I answered \" Wan Chai, Causeway Bay, Central. Most of the restaurants.\" I felt kind of weird he debated to a customer for just a little tiny cup of red vinegar but I answered his weird questions, too. Yea... It is a neighborhood restaurant with an owner has his own character。 Learned to enjoy it! \n\nThe other minus one star goes to the decoration. This restaurant looks the same since I was back in High School. Their lighting is always dark. Time to remodel it!", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "Great selection of foods, but we go for the won ton noodles. The noodles are carefully made and have a great snap. The wontons are generous with fillings and great flavor. You can select roast meats and kind of veggies you'd like in your bowl. If you have a bit of appetite, you can even add noodles, always a wise choice.", "author": "E. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-17", "description": "I wanted to stop by Sunset's Best Seafood for their fried rock cod dish, but as it turns out, they were closed...on a weekday.  Bummed out, my girlfriend and I decided to try one of the places next door for a change since we always went to the corner store.\n\nI ordered the three meat rice place with roast duck, soy sauce chicken, and BBQ pork and she ordered the wonton noodle soup.  The meat place was just ok and not nearly as good as the ones you'd find on Irving Street.  The wonton soup was totally tasteless and disappointing.  In fact, the free bone soup that came with my rice was better.\n\nThis was a total letdown of an experience and I would have much preferred the food at the corner.  The service is a lot better there to boot.  The meat in the window lured us in, but won't fool me again.  I'll pass on this one in the future.\n\nFood: 5/10\n\nService: 5/10\n\nPrice: $\n\nAtmosphere: 5/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-05", "description": "I used to eat food from Win's all the time as a kid. With so much fond memories of this place, I had to come eat here again. \n\nThe roast duck from here was just ok. The skin was cooked well and had that distinctive light crisp to it. The meat could've been seasoned a bit better, but it still had a decent flavor. There's a sweetness to it that kind of distracts the typical five spice flavor. It's good enough for Outer Sunset locals, but I think Cheung Hing and Ming Kee are still the reigning champs when it comes to roast duck. \n\nI did enjoy the noodle soups here. By Hong Kong standards, this place wouldn't be anything special, but it stands out among other Cantonese noodle soup places in the Bay Area. One of the biggest fumbles of wonton noodle soup around here is that the broth is pretty much just watery chicken broth. The broth at Win's wasn't as pungent or aromatic as I'd like it to be, but it did have hints of the dried seafood flavor that added an umami character. The noodles had a good bite to them, and the wontons were seasoned well. They had a good ratio of shrimp, and the seasoning and spices imparted a slight warm fuzzy feeling on my tongue. That's a good sign. I've definitely had better wonton noodle soup, but with its cheap price and decent flavor here, I can see myself coming back for a quick fix. It's better and closer than any place in Chinatown. \n\nNext time, I have to order the Ngau Jaap (Honeycomb Tripe Stew). This place made me fall in love with tripe as a toddler, and I'd really like to see if they can make it just as good as I remember.", "author": "Nei N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-09", "description": "Neighborhood restaurant only come here if you have to. Portions are small for the soup noodles. The bbq pork and selections are average or below. Many other options in sunset but not in the immediate area.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "they have the best wonton soup..usually super nice service and very fast. i am not a huge fan of chinese food  but this place made me fall in love with it..", "author": "Karen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-29", "description": "I have come here many times, 4 out of 5 times it is plain bad!\n\nThe wontons used to contain meat now they are very flat and  just of smear of meat.\nI love duck, it used to be passable here, but the last three times I had it, it had very little meat and very plain salty. Too bad that they seem to get away with the fact that they have been here for a long time.", "author": "Charles W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-08", "description": "I've been to this place for years. They used to have BBQ pork and roast duck. However, what makes it worst is the couple owner not the food. The lady at the counter (wife) only take money. She doesn't know jack about the restaurant, even the price on their menu after all these years. The man (husband) doesn't care about anything, except rushing people to place their order. \n\nEvery time I order something, the chef will NEVER cut the amount you ask for. If I order 1LB, they'll cut 1.5LB and make you buy the whole thing. I can't believe the chef so inexperience that cannot cut the right amount you ask for. It happened so many times that I've to tell them I won't buy any if they don't cut the right amount I asked for. \n\nTo add on, here's an experience from my wife that makes my whole family stop buying from them. There's one time my wife ordered TWO noodle soup to go. My wife asked them to separate the soup from the noodle (which is non sense to mix them together when to go but they DID). They charge $0.50 for each extra soup container, which my wife didn't mind even it's non sense. So they charge her $1 extra for TWO noodle soup orders. They only gave her ONE cup of soup for TWO noodle. \n\n1) How the hell ONE cup of soup is enough for TWO noodle?\n2) How the hell they charge $1 for only ONE cup of soup but not $0.50 or give her TWO cups?\n\nOf course, my wife won't let this go. She questioned the owner (husband). They didn't  apologize and even make up an excuse saying ONE cup is enough for TWO noodle!! If that's the case then why they charge for TWO extra container?! They ended up gave her TWO cups of soup, unwillingly. \n\nBottomline is, that couple only cares about money and will rip you off into pieces.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-26", "description": "I used to eat here as my buddy lived closed by. The food was ok but not a place Id go out of my way to eat at. The honey walnut prawns and beef stew was really  good. The fried rice plates and noodles were just average at best.\n\nI stopped going as some of the people here are rude except the lady who collected the money. Service is not very good here. No point in coming back since there's so many other Chinese spots close by.", "author": "T C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "This is my go to for Wonton noodle soup. It's got amazing fried tofu with soy sauce too.\n\nMy family comes here once in a while for our weekend lunch fix and it totally hits the Chinese comfort food spot. Diners are usually Chinese families who are looking for a cheap, decent bite to eat.", "author": "Steph M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-31", "description": "I've been going to Win's since I could eat solid foods.   Keep in mind that like many Chinese restaurants west of 19th ave in the 'set, Win's is not known for their service. It's a bit grimey too, but if your not afraid of a little grime, your fine.   \n\nAs others mention, the duck is something you JUST have to get.  Why else would you go to Win's?  We get the combo pork/duck and beef with bitter melon.  God, I used to hate bitter melon, but after some growing up, my taste buds yearn for that crispy, bitter  vegetable flesh.  Soy Sauce chicken, ginger chicken, and the won-ton soup is good.  One time, I got the soup that was warm.  Ick, I hate warm soup.  Hot Hot Hot!\n\nAnyays, if your looking for a quick fix of good, FAST, unreasonably cheaply priced Chinese in the outer sunset, this CAN be your place!  Mmmmm", "author": "Cat A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-03", "description": "Nothing like 3 bites into your meal and having the owner stop 3 feet from your table and fart and then walk away. 3 bites in and now I have no appetite. Gross. Seriously gross. I can't imagine how gross the kitchen is. I'll never ever come here again. Gross.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-18", "description": "This place was so good back in the day that lines would form to buy their roasted pork. Nowadays after the change of ownership, the lines are gone. The quality of the meats has really gone down. \n\nEven coming here to eat their food is bad. Had their won tons last time I was here. The place was as dirty as most places in Chinatown but the prices weren't as cheap as Chinatown nor did quality match.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "My bf lives two blocks away from win's and this is our go-to spot for fast and easy take out. Their westlake soup is bomb and is a dish we ALWAYS order. They put so much meat in the soup unlike other places where they hardly give you anything.", "author": "Linz C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-15", "description": "Local place to pick up roast items. Went at 8PM Tuesday night and there were two ducks left and a smaller piece of roast from a whole pig. The restaurant was not as shabby as I thought. But clearly, they make money on TO GO orders since they have a small TO GO setup table in the front. I will keep that in mind for next time. \n\nTried:\n*$13.95 Peking Duck (4 of 5) Pretty good. I thought it was good size and nicely roasted. And $13.95 was an acceptable price. The duck was not too fatty or too skinny. \n*Roast Pig (didn't get the price per pound, next time) (2.75 of 5) Pretty bad. I guess I went too late in the night and the roast was out since morning. It looked absolutely great, but it was old. I could only imagine when it was fresh. I will not buy this when I go late at night. Next time, I will go buy it in the afternoon. I think it will be pretty good. I learned my lesson, do not buy roast after 7PM. They only make one or two pigs a day. By 7PM, the roast pig has been out for hours. Too long for me!!!\n\nI will return to try other roast items.\n\nNote: Closed MONDAYS.", "author": "Janice T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-03", "description": "I have always ordered their roast chicken here because it's very good with crispy skin & moist meat.  Yesterday I had family visiting from SoCal so I wanted them to taste the roast chicken. I called and the owner (lady) answered. \n\nMe: I would like to order a whole roast chicken.\nOwner: Roast chicken? Ok. ready in 10 minutes.\nMe: Thank you.\n\nTen minutes later I went to pick up. I walked up to the lady. She was busy doing the bills and didn't look up ( a sign of attitude...without acknowledging your customers)...I had the courtesy to wait till she's finished ringing up.\n\nMe: Hi, I am here to pick up the roast chicken.\nOwner (frowning): roast chicken? we don't have any.\nMe: I called and you said it would be ready in 10 minutes.\nOwner: I didn't say we have it.\nWaiter (who happened to come out from the kitchen & heard us): she checked with the kitchen and we don't have any. You didn't listen carefully.\nMe: But the owner said it  would be ready in 10 minutes ! and why couldn't you tell me you had to check with the kitchen first? Instead you told me it would be ready!!!\n\nOwner already bent her head and kept busy with other bills. The man at the chopping board tried to placate me and said I could order something else.\n\nMe: No thank you !\n\nI was and am still mad with their attitude. I will not go there again !!!!", "author": "agnes f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-24", "description": "- \"Bbq\" Pork & Duck meat was served cold --ewww\n- Wonton Noodle soup was salty and the noodles were like cheap ramen. Straight nasty.\n- Service sucked.\n- Eating here was like eating at a hole in the wall Chinese spot in China. Wouldn't be surprised if I had ate raccoon meat.\n\nSkip unless there's no other possible option.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "Great food with excellent service! I loved the BBQ pork, fried rice and won ton noodles! Very authentic Chinese food with a variety of choice. Although the shop is a bit dated, the overall experience is adequate! I recommend this restaurant to all of you!", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "My family and I have been coming here for 10+ yrs. Great BBQ items. BBQ pork, roast duck, roast pork, soy sauce chicken and boiled chicken. All is delish. My parents always come here to get BBQ items for lazy nights when they don't feel like cooking, Chinese special occasion dinners and when we bring offerings to the cemetery when visiting our deceased relatives. I've tried so many other dishes they have. I can't name all of them. One of my favorite dish is a special request/not on the menu duck chow fun (dry). \n\nI'll say service is def better since they change ownership/staff a while back.", "author": "Jo S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-21", "description": "I only found out about Win's recently when a friend mentioned he had been eating here for many years.  In the 2 months or so I've actually returned several times myself.\n\nI've only ordered their Chinese BBQ items, but it's been very good each time.  On my initial visit I had a bowl of Won Ton and Noodles with BBQ Pork (http://www.yelp.com/biz_photos/hbDkXsC4_ZOt5h04hmPReQ?select=f_N38Wtx-yfeoUOi7hEEug).  There were only five won tons, but these were big and plump and filled with a little ground pork and lots of firm shrimp.  The noodles stayed firm and chewy even while sitting in the hot broth.  A generous portion of thick sliced BBQ pork sat on top of the noodles; these were lightly glazed, tender pieces of pork.  \n\nOn a more recent visit I had the BBQ Pork and Roast Duck over rice (http://www.yelp.com/biz_photos/hbDkXsC4_ZOt5h04hmPReQ?select=mS9pKO8j_AsecMsLAKjxyA).  The duck was very good in flavor, but take a close look at the duck skin; you might want to remove the skin when it isn't plucked clean.  That's usually not the fault of the restaurant but the poultry supplier.  Again, lots of BBQ pork and the usual boiled lettuce comes on the side unless you request otherwise.\n\nOverall it is very good Chinese comfort food.  The service is friendly, and if you order BBQ items your food is ready right away.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "I was craving roasted duck over egg noodles and decided to come here. They gave a generous portion of duck and a healthy sized portion of noodles. I've gotten the egg noodles with vegetables before, I think it's just cabbage, but the bowl and amount of noodles was significantly more than the other ones, assuming to compensate for no meat. Haven't tried anything else, but this is definitely where I'm going from now on", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-31", "description": "I used to come here in college and came back a few days ago for dinner.\n\nGot here around 7 and got seated right away\n. Ordered half a roast duck was good\nTong choy was excellent \nAnd a salted fish tofu clay pot. Was ok \n\nTis place is consistent with their roast foods the other stuff on the menu is hit or miss.\n\nI would be back if I was in the neighborhood.", "author": "DOM d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "After driving by on our way out to the beach, we decided to stop in on our way home to pick up a peking duck!  We love duck but have never ordered it like this to go and eat at home.  For the price and quality it was a good move and the side of sautéed veggies was excellent quality.", "author": "e w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "We came here for lunch and for the roast duck. The duck seemed like any other duck, but it was good. I got minced beef rice and it was just okay. My dad got roast duck and rice noodle soup. My mom got roast duck and egg porridge. That was really good. I hadn't had that before. The waitress was really nice. The interior isn't nice, just a typical Chinese restaurant in SF.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "Whenever I have a craving for won tons, I usually come here. \n\n~Pros~\n\n- It's cheap!\n\n- Very decent won ton for the price.\n\n- Their BBQ meats (pork, roast duck, etc.) are good and lean. No one wants a fatty BBQ meat!!!\n\n~Cons~\n\n- Sometimes, it can get a little crowded on the weekend, therefore making parking a bit harder.\n\n- There is a $15 or $20 minimum for a credit charge\n\nShort & simple review! If you have never tried Win's , check it out next time you crave won tons or just plain ol' Chinese food.", "author": "Selina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-06", "description": "This review is for the quality of food and dine-in service. \nCustomer service is fine -average but I thought our waitresses dirty finger nails needs to be cleaned. \nI used to think this place was great despite the place being not so clean. The quality of food has definitely declined. I ordered the general chicken, boyfriend ordered sweet and sour shrimp, roasted duck and sauteed spinach. The duck was pretty blah. Not much meat and was a small serving. The general chicken was heavily breaded as was the sweet and sour shrimp. I was highly disappointed because it was literally like being served fried flour drenched in sweet and sour sauce. The boyfriend was like \"this is how it is at restaurants\". Yeah, Chinese restaurants. The chicken inside was the size of a large cashew. The shrimp in side the large layer of deep fried flour was so tiny and tasteless. I prefer not to come back here ever again. This goes for many Chinese restaurants (Chinese are cheap and will do anything to save a penny even if it costs your health!! so beware...and be wise). O___o \nTotal of the bill was around $30 something for 4 dishes. I thought it was expensive for the crap ass food we were served.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-23", "description": "Known throughout the years of serving some of the best roast duck in the city, Win's has lowered the standard of their food and service to being one of my bottom Chinese restaurants in the city.\n\nLets start with the bowl of siu ap won ton mein (roast duck wonton noodles) what this place is known for.  I placed my order and after what seemed like an eternal 15 minutes I had to ask the waitress for a status.  I can understand if the place is packed, orders get lost but my table was one of four tables occupied.  The waitress finally brings my order and this is where the downward spiral begins.\n\nI took a sip of the broth from the bowl of won ton noodles.  Luke warm!!  I sifted around to see how many won tons amongst the noodles and found only three which is about three under what they normally served in the past.  My duck came on the side per my request.  At first glance I can see clearly the coagulated fat around the meat.  Nasty!!  I take a bite and as suspected the duck is cold as if it were sitting for hours.  I immediately flag down the waitress to advise her of the duck situation, I did not even bother with the soup and won ton for fear of liquid payback.  She advises she will get me some hot duck and walks to the back which I found odd since they just brought up three fresh ducks to the front window.  \n\nThe waitress returns and places a small plate of steaming hot duck.  The same duck they served me before but freshly zapped in the microwave!!!  I am thinking Are you kidding me???  I immediately refuse the duck and ask for her to take the entire order back and take it off the bill because I am not eating it.  She has the nerve to say I need to pay for the noodles and won ton, she will take off $2 for the duck.  I advised her that they are violating food safety standards and I will call the health department if they do not take the entire order off the bill.  She finally relents and took it off the bill.  All I can say is on a sunny day those rays hit those ducks in the window for God knows how long.  Don't run the risk of being served room temperature cold duck, avoid this place entirely!!", "author": "Grubnoisseur Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "This is an outrage, can't even get a simple glass of water unless you eat there. Low quality food anyways.", "author": "Kenny N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-06", "description": "I tried Win's the other day, and it was not too bad. It was also not too good. \n\nThe BBQ was standout - delicious, good flavor quality, decent portions. The BBQ pork was top notch, and I'd definitely get it again. The Peking Duck was relatively reasonable in it's pricing, and while a bit greasy (as duck tends to be), it had an excellent flavor profile. I also dig that they toss in steamed buns, plum sauce and some rinds to go with it.\n\nI was less impressed with the house chow mein, which I had with Hong Kong noodles. The flavor was kind of similar and undifferentiated throughout the dish - meaning that the scallops and the shrimp and the chicken and the pork all had a similar flavor. Not a lot of veggies beyond bok choy.\n\nI've  yet to try the other Chinese joints on the block, so I don't have a great comparison point in the neighborhood, but compared to some of the Chinese food throughout the city - this place is a solid, but unremarkable place.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-13", "description": "Went there and got a roast duck, when I went home I have noticed that there were fewer pieces than it should be. Almost like they took some pieces.\n\nI will definitely stand next to them next time (instead of go over to Walgreens opposite to shop) while they chop up the duck.\n\nThis has never happened before, so I will give them another chance.", "author": "Christy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-20", "description": "Utterly Disgusting,It is horrible,The food is low quality and in low quantity,and yet it is expensive,try next door sunset seafood,it is in bigger quantity and tastes better", "author": "Philip T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "This place is definitely on my speed dial for Chinese food takeout. I must say that I order the same dishes all the time. I can't get over their roasted bbq duck over rice, wonton soup with green onions, mongolian beef and my favorite, their fried wontons.\nUnfortunately, they lack customer service skills, and they seemed a bit cold. \nI don't take it personally because perhaps it's just the way they operate. Nevertheless they treat everybody the same. So don't be surprise if they ask you, \"What do you want?\" or give you that look,\"hurry up!\" \nAlso, I don't recommend eating in because the place looks depressing. But if you're all about the food, and you don't mind how the place looks, then pull yourself a chair. I highly recommend the fried wontons and roasted bbq duck TO GO!", "author": "Po S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-22", "description": "I usually order takeout when I'm at a friends house. I usually order a salt and pepper chicken, dry pan noodles, or porriage etc. Its reasonable and fast and great service. Their duck is really good as well and short ribs. If your looking for quick bite I would come here. Their food is great and the portions are huggeeeee!", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "My parents know all about these hole in the wall restaurants dotted along the Sunset area, which brought us to Win's Restaurant.\n\nMy mother even called ahead to make sure the food would be ready so we could grub before our flight.\n\n* Roast duck - I like roast duck, especially when it's fatty and tasty and there's a lot of skin still hanging on.  I like their version.  Obviously, this is what they are known for and their most popular dish, for good reason.  It also came with roast pork, but I was too focused on the duck to really care about the pork.  But it's supposed to be really good here. \n\n* Fried rice with egg whites, pine nuts, and black fungus - Fried rice is the last thing I ever order, but this variation is so good!  It's not often you see pinenuts in Chinese cooking, so that already makes it different and unique.  I'd definitely go back and have it again.\n\n* Fried rice with preserved pickles - There was other stuff going on in here too, but I can hardly remember because I enjoyed the other fried rice dish.  The Husband really liked this dish though and he ate it all up and took the leftovers to work the next day!  \n\n* Dumplings - We ordered two kinds, and they were both good.  Fresh and with lots of shrimp.\n\nWe also got complimentary soup to start, but we had so much food going on already so we couldn't really enjoy the house soup.\n\nThey had a good mix of diners, Chinese and non-Asians alike.  Families dominated this place on a Sunday night, so it's definitely a locals place.\n\n3.5 stars.", "author": "Teri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "Solid food, lots of seating, extremely fast, and cheap. That pretty much sums up Win's. While I found their garlic eggplant to be okay, I thought their wonton noodles and duck to be great. If you're looking for a cheap meal, come here. It's a Win-Win's situation (sorry, I couldn't help myself).\n\nMy tummy gives Win's Restaurant...4 Stars!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Sizzling rice soup - good! Roasted duck - really good! Manila clams with Chinese wine - food for the soul. Great tasting food to fulfill your Chinese food cravings.", "author": "Miki S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-14", "description": "After some renovations, Win's is a place our team goes back to time and time again for the roast duck, wonton soup, beef claypots, and pan-fried noodles.  Other highlights include beef satay chow foon, general tzo's chicken, and BBQ combination plates.  \n\nService is fast, friendly and helpful.  The decor is simple, somewhat clean, and that of a typical Chinese restaurant with roasted birds hanging  above a rotisserie grill out front.  Parking is tough on the street, but it's possible to find around the neighborhood.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-10", "description": "I'm not picky, but it's supposed to have dried fish and shrimp roe in the ingredients of the wonton soup, but they don't.  So the wonton soup is kinda tasteless. \n\nThe Oyster with Roast Pork and Tofu in Clay Pot is yummy.   BUT, be aware that the female in the cashier is very dishonest when comes to the pricing.  The price on the menu was $7.95 and the price tag stuck on the box was the same; however, when the server asked this female  whether charging me $7.95, she said NO. she ended up charging me $8.75.  Even my mother-in-law had the same experience saying that she always overcharges.   But the male owner is OK.", "author": "Brielle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "Came here for takeout.  I ordered the tomato beef chow mein (thick noodles) and the beef chow fun.  The flavors are very good and authentic Chinese.  \n\nThe amount of the tomato beef chow mein was only half of the take out container.  Love the tomato sauce.  They gave a little more of the chow fun though.  Thank goodness.  The prices for each is $6.95.  Still a good deal.  The wait was too long.  It took about 1/2 hour for my orders to be made.  Service was too slow..\n\nWhile waiting for my orders, the man who works up in front of the restaurant cooking noodles somewhat coughed into some wonton noodles.   The owner at the register didn't seem like she cared for my business.", "author": "J W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-02", "description": "We came here after trap shooting at Lake Merced with my bf and his coworkers. One of his coworkers live by here, so he suggested this place.\n\nIt reminds me of greasy Chinese-American food. It's not the best but I guess it's comfort food. This is not the cleanest place but the food is cheap here. The service is fast.", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "I came here yesterday night with two of my friends. We arrived at the restaurant at 9:33pm, knowing that it closes at 10pm. We were desperate to find a place that was opened on a Saturday night since my two friends didn't have dinner yet. Our originally plan was to go to 8 Immortals but it closed at 930, so we opted for this place. It wasn't exactly the best looking restaurant from the outside, but the inside was decent. The decor is old-fashioned with minimal decor hung on the walls. It also has a television at one end of the wall.\n\nSo as we walked through the door, the waitress greeted us with a hello, quickly setted our table with tableware, and gave us the menu to look over. She paced back and forth which made me nervous although I wasn't going to order anything. She even came to our table TWICE to ask if we were ready to order - all within three minutes or so. However, she was really polite and told us to take our time. (It was understandable since they were already getting ready to close the restaurant down for the night.) After some quick deliberation (clearly under the pressure), my two friends settled on Seafood & Pineapple w/ Egg White Fried Rice and Sauteed Mixed Fresh Vegetables with rice. http://www.yelp.com/biz_photos/hbDkXsC4_ZOt5h04hmPReQ?userid=NLgTfZz_ITzmV6KiO-mGIg Both dishes were around $7.\n\nThe portions were huge! Each dish was able to feed at least two people. However, the food was unable to be finished within the fifteen minute time frame that we had left in the restaurant, so we asked for the food to be boxed. The waitress nicely boxed it up for my two friends with a smile on her face. I checked my cell phone, and it read: 10:09pm. We paid and said \"thank you\" multiple times. The waitress thanked us in return and wished us a happy new year.\n\nFriendly staff, quick service, and decent prices for big portions. Four stars well deserved.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "FOOD\nVery tasty.  My wife loved the won ton noodle.  I particularly enjoyed the barbeque pork and the roast duck.\n\nSERVICE\nNot bad.  Par for the course for SF Chinese restaurants.\n\nPRICE\nInexpensive.  Our bill averaged out to about $10 per person.", "author": "Subrosa I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-31", "description": "This place is ok, not the best chinese food around, but not the worst. It's definitely cheap and decent food. Nothing too special about this place. It's average. That's all I can say.\n\nThey do accept credit cards which is a plus for chinese resturants, but the only download is that there is a minimum charge of $20 (I might have got the amount wrong). So if you don't have any cash and want something cheap from this place, tough luck =(\n\nFriendly waiters and waitress. Good place.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-16", "description": "-I'd rather eat panda express-\nThat pretty much sums up my review. I found the food very bland and not worth the price. The chowmein tasted like a microwaveable dinner, and the beef was no better than the meat served at malls. The only reason I went to Win's was because Hong's (directly next door) was closed and the owner was on vacation.\n\nI will not return to Win's at any time in the future. I HIGHLY recommend Hong's. Hong's is next door, and has far superior food at comparable prices.", "author": "Graham U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "This is my moms go-to-place to order Chinese take out whenever she feels lazy and doesn't want to cook. But today I ordered Spicy & Salty Sole filet over rice which is basically just fried fish over rice. It is a simple dish but good comfort food for me. \n\nHowever, my friend ordered the Seafood over Hong Kong Style Fried Noodles. He was hoping to get a lot of seafood but there was only about 3 shrimp and 1 scallop with a bunch of filler veggies. We expected more from Win's seeing that we order from them quite often. (Check the pics to see what I'm talkin about)\n\nThe workers are always very friendly and you receive your food very quickly. This place has a warm home-y feeling to it, it's nice. The food is relatively cheap too. My spicy and salty fish over rice was only about $6. $6 for a rice plate lunch ain't that bad; plus, I was pretty full. \n\nNice people, non expensive Chinese food, and a wide array of selections.", "author": "Benson T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "I normally get things to go from here since it isn't too far from my house but one day my mom and I decided to eat here for lunch.\n\nArrived about ten minutes til 11am, their normal opening time.  Luckily they let us in and sit down and order.\n\nI got the beef with tofu with rice ($6.50) and my mom got salted fish fried rice and we got fried won tons for appetizers.  The food came out pretty quickly and the portions and prices were great.  My mom had leftovers for a few days.\n\nIt maybe isn't the cleanest restaurant (table was a bit sticky) but good prices and good portions.\n\nI enjoy their bbq pork and won ton soup and congee.", "author": "Noreen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "Came here on Sunday afternoon.  Good comfort food. - old fashion chow mein, chow fun, noodle soup.  Watched the other customers who ordered basic cantonese cooking items.\n\nNice homely place", "author": "Bill L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-23", "description": "This was a find.  From the outside, the place looks unassuming and not particularly distinctive on a block with two other Chinese restaurants.  The tables are sticky and I'm not that attracted to places with ducks hanging in the window.  But they serve several kinds of congee, so I had to give it a try.\n\nI had the pork and preserved egg congee ($4.50) and it's the best one I've had on Taraval St.  The consistency was a little watery (I prefer Eight Immortals for consistency; I think EI cooks it longer because the rice has broken down more) but for flavor, Win's is better.  Win's puts fresh ginger in the congee (so does EI), but Win's pork tastes better.  It's shredded and definitely marinated in soy sauce.  Very nice.  The broth is flavorful too.  You can also get the crispy Chinese fried donut (not the best I had but Chinese fried donuts are always greasy) for an additional charge and extra preserved egg for $1.  Extra preserved egg - I love places that offer this option. I think this place has the best jook in the Sunset/Parkside.\n\nThe won tons are filled with pork and shrimp.  I prefer my won tons to have more pork (so that they're juicier) but these are good.  The big dumplings are better than the won tons because they also have Chinese chives and black fungus (adds a crunchy texture).  \n\nI came on Sunday for lunch and every table was occupied...the place was bustling.  People were waiting for tables and many pick up orders up front.  Seemed like everyone there was Chinese.  I like the front area where they chop the duck (there was a constant chopping sound) and cook the dumplings.  The duck looked very good from a distance and not too fatty.  \n\nService is brusque and efficient.  She asks, how many (in your party) and what do you want, and that's the extent of the conversation.  They have specials posted and the prices are reasonable (but not dirt cheap).  I do wonder why a homemade Chinese tamale is $4.95 though.  That seems high but maybe you get more than one.\n\nThey take credit cards but there's a $20 minimum.  They have large and small tables.  I wouldn't bring anyone who is squeamish about eating at a place that's not spotlessly clean but I would bring other Chinese people :-)", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-15", "description": "My boyfriend really wants me to stop writing negative reviews of Chinese restaurants in the city because he thinks that sooner or later I'll be hunted down and hacked into bits by angry Chinese mafioso.\n\nYeah.  So...I'll just say that their wontons are actually pretty good.  \n\nBut that long strip of sticky fly paper hanging from the ceiling- really not doing it's job.  They may want to invest in a bug light or something.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-07", "description": "My sister and I went here for an easy Chinese new year dinner... (Hey I already cooked for 11 on Saturday, what makes you think I could deal with more!)\n\nAnyway... for 25 bucks we had their 6-course dinner meal...no, not the family style on the front with the Americanized dishes...the one glued to the back of their menu, with more chinese-style items.\n\nFatt choy (seaweed that resembles hair) with lotus root soup--nice flavor, but obviously sitting too long in the lotus root.\n\nSteamed chicken and roasted duck--fatty, moist, delicious, and just hard to resist\n\nBraised tofu with fish fillets--good sauce, too much breading on the fish though\n\nSteamed gai lan, with oyster sauce--yum.  I'd go back for more of this\n\nShredded beef with stir-fried peppered onions--good flavor, just that the meat was soaking in baking powder too long--yeah, we could tell, as it melted onto our tongues, and not in the good way\n\nLast item was dessert--red bean soup, yum...not too watery, and full of bean flavor.\n\nWe also ordered their special of the day--pork dumplings--soft and chewy on the inside, crisp on the outside, and a nice gingery flavor.  \n\nService = loud people in the front by the BBQ meats, and just as loud from the kitchen in the back.  So, they're friendly, but expect real 'Chinese' people (curt, efficient, and just loud)...and at least they try to speak English too.  (Then again, I try to use my limited chinese but...)\n\nDecor = bright room with patches of busted out fluorescents, dark furniture, and somewhat clean but lots of foot traffic in and out of the kitchen, so it's a bit dirty on the floors.\n\n$20 minimum for the credit cards.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-27", "description": "Win's is a no-frills Chinese restaurant with cheap, good food. It's the kind of place that looks kinda dirty inside, but you keep coming back because it's cheap, good, and in the neighborhood. There's a constant row of double parked cars outside the restaurant because this is the kind of place where Chinese families stop to pick up takeout for dinner. I know that's what my family does, and we end up eating Win's takeout way too often. The roast duck and roast pork are excellent, as is the steamed chicken, but sometimes you get shafted with the janky, non meaty parts of the bird or pig. Don't take it personally; they've even done that to my mom, who's a regular and orders in Chinese.\n\nThe congee, wonton noodles, crispy chow mein, and beef tofu rice are among my favorite things to order. And everything's so cheap too! $5-$6 for a rice plate or wonton and I'm good to go for dinner, and sometimes even with leftovers for lunch. Part of my regular rotation of Sunset restaurants on the cheap.", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Yelp help us find this restaurant, other wise we probably would not have stopped. The roast duck was crisp, juicy and only lightly seasoned. Wanton soup was good and the special potstickers were not special. The setting is very mom and pop. Sitting in the front window cooking is a delight to watch. Service is good.", "author": "Terry M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-29", "description": "I used to love this place for pretty much everything, especially the roast duck and wonton noodles!\n\nOne day my mom and I came to get a roast duck for lunch, and when we got home, there was no duck breast! okay, so I don't know what the hell they would do with a frking duck breast, but they didn't give it to us. Ducks don't have much meat aside the breast. So we were pissed as fuck.\n\nWe went back, and my mom started bitching at the lady behind the register. I don't know if she was the owner or anything; but they did what you would expect them to do. They said that that's bullshit and they would never do something like that. Fuck your shit!\n\nCheck your food before you leave!", "author": "Erica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-20", "description": "my family and i have lived by this restaurant since i was little and i think their pork fried rice is the best. the best i may have ever had. For 6 bucks too, what a deal!~ not too shabby. im not a big fan of rice and actually not usually able to eat very much in one sitting, but i can eat a full to-go box. their wonton soup is really good as well. i love the people that work there. even though i'm sure i look like any other asian girl that comes there to eat, the lady at the register, when ringing me up the other day, said 'Oh, its you!' and smiled.  \n\ni recommend this place to anyone in the area. it may not be the most romantic or clean place around, but it makes up for it in favor, taste, and comfort.", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "I came to Win's many times and my favorite entrees here are still their barbecue spare ribs, wonton soup, barbecue pork fried rice, and their soy sauce chicken. Their duck is good too but cannot compare with Cheung Hings. However, their soy sauce chicken and barbecue spare ribs in my opinion, are better than Cheung Hings. Their soy sauce chicken has a very smooth texture to it and the sauce is great. Their spare ribs are glazed with honey and it's delicious. The last time I came here, I tried their roasted duck with dried wonton noodle and ordered their barbecue pork fried rice. Sad to say, their bbq pork fried rice did not meet the standard of the previous bbq pork fried rice. It still had flavor but it was missing a lot of bbq pork meat so it was like eating salted fried rice with pieces of eggs and green onions. Even the roasted duck with plain fried wonton noodle tasted better than the fried rice that I usually order here.\n\nAnyway, they get the meals ready really quickly esp for to go which only takes about 10 minutes. I would recommend getting food to go if you're hungry and in a rush. The service is ok. I would rate this place 3.5 stars if I could because they have good Chinese food.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-06", "description": "Disclaimer: This place probably uses a crap-load of MSG!  Well, if I am going to eat it/eat out, might as well be on the best duck noodle soup in town.  This even beats the not-so-coherent late nights out in C-Town, where the bowl of duck noodle soup seems like an insta-cure.  Really, what more can you ask for...$6 din din that fills you up and satisfies the taste buds.  Hubby likes the won ton noodle soup with bbq pork, and he says it rivals his other fav place: Won Ton Noodle House.  Given that I favor Win's, I win that battle (sorry had to put the pun in...I couldn't resist).  Time for hubby to get our pick-up order.", "author": "Steph W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "The Best Duck, Barbecue Pork and Wonton Noodle Soup in Town.", "author": "Walter T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-11", "description": "My hubby and I call this place the \"Duck Nazis\" and they have every right to be one -- because their ducks are so flakkin' delicious!!! (for you BSG fans out there)  It's amazing - they have not only the meatiest ducks but tastiest.  Skin is a little crunchy and the ducks are not too fat.  It's really worth the $10 and the drive out to the Outer Avenues.\n\nTheir other dishes are good too, and cheap.  When you're too lazy to cook, just order a couple of their dishes for less than $10 and then you're done.   They are very busy in their to-go business so best to call in first.  Otherwise, you will have to wait as long as 1/2 hr during busy nights.  \n\nClosed on Mondays.\n\n**********\nRevised 6/4/07\n\nThey have NEW OWNERS!!  Taste is still relatively the same although the duck now has a lot of fat.  Not sure if it is a change in sourcing.  Need a little more time to figure out if it is for better or for worse.", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-19", "description": "Greasy over-cooked food, with a generally greasy feel to the tables also.  If you want poorly cooked Chinese food, this is the place for you.   Simple dishes like eggs rolls arrive in pile of grease.    Can't imagine why they have been in business for so long, maybe it is because they were the only game in the neighborhood for a long time.", "author": "Axa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-13", "description": "Man, it took a long time to drive to this place. I was hoping that given its relative proximity to China that the BBQ meat would be good as most of these Yelp reviews suggest. Sadly, again it would have made more sense to head the other direction and go to R&G. Aren't there any hole in the walls around where I can get a good BBQ rice plate??\n\nThe duck was dry-ish and lacked the intense flavour that it should have. The sauce was also lame. Honestly, the duck at 99 Ranch in Daly City is better. The char siu was actually pretty tasty, but I find it tasty at most places and it was a little too fatty for more liking.\n\nOn the plus side the service was good and efficient. \n\nIf this place were walking distance from my apartment I would consider going back, but given that I feel like I need to pack my passport when I head out this far, I don't think I will be returning.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "Theres not much I can say about this place.\n1 - it's cheap\n2 - it's good\n3 - you can't get any better for the price\n\nReally, if you're in the mood for roast duck come here. It'll be cheap and you'll be satisfied.", "author": "Eddie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-31", "description": "I gave this place five star based on the food and only the food that I suggest that you get. This will be on my list of 5 star food at 1 star places. \n\nThe best roast duck \nThe best roast pig \nThe noodles specifically the rice noodles.\n\nThat's it! Do not get creative and order any other things from this restaurant. All of the other stuff is just blah. This place is one of those off main stream bbq pork/roast duck/ roast pig places in the sunset district. This is outer sunset and everybody from outer sunset knows about this place. The decor, the service, the cleanliness are not all there, so do not expect it to be an all around well lit, well kept great restaurant.   It is a Chinese owned restaurant with predominately Chinese speaking waitresses.  Speaking is Chinese to them is a plus but is not necessary.\n\nRemember............you are here for the food only.", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "This is the perfect place for \"I refuse to get ready days\". \nYes, they serve traditional chinese food\nYes, they have take out (roast duck, chicken, the whole shabang).\nand ..\nNo, it isn't the fanciest resturaunt with various wall decorations .. \n\nBUTTT\n\ntheir food is absolutely delicious and cheap. Along with that, they give you big portions and the servers are really friendly. When dining in, it comes with complimentary soup. Good golly, I could go for some walnut shrimp and salty fish fried rice right now.", "author": "Brenda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-22", "description": "Bottomline :  There's always the pros and cons. \n\nPros: *  Very cheap with a decent quantity even if you're a heavy eater ($5-8 / person)\n* Wait time is generally low (5-10 mins tops)\n* If you come in a group and if they have the supply, you'll receive free soup and it's pretty good (applies to lunch time)\n* Service / Waitress is friendly and nice \n\nCons:  * Overall the place gives off a vibe that it can be a little more hygenic\n* The food here can be a bit oily depending on what you order / or heavy in fat\n(By this I mean, roast duck or stew beef - can be high fat content sometimes when you prefer to see a bit more meat)\n* The quality of the food highly varies between dishes - I would only recommend the standard BBQ related material or stew beef and a few other dishes. \nI do not recommend unorthodox orders like the curries or the Americanized dishes.", "author": "Ken N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-29", "description": "Pretty cheap food but the roast pork and duck was pretty unappetizing. It came with white rice and some old cabbage. I won't be going here again.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-06", "description": "ordered for a pick up, WoW! did I ever feel ripped off. Caveat Emptor, let me explain! i ordered 2 roast duck & bbq pork over rice & when /i got home, i was looking at how bad the integerity of the owner is. They gave me what appeared to be old left over bbq from the front rack, stuff that wasn't sold & either frozen or refrigerated for later use, fresh cut bbq pork should not be dark in color & stale tasting! writing this instead of calling is cause my cantonese is not fluent & just wanted to give everyone heads up when taking out!. the duck was alittle better, not sure if it was as old as the bbq pork. i hope owner gets wind of this as i will not order from them again, until! in addition, the portions are small, but price is big..........", "author": "david c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-08", "description": "Hands down, best roast duck in the City!  I get this over white rice with the roasted pork with crispy skin, not to be confused with BBQ pork a.k.a. \"char-shiuu\".  The soy sauce chicken goes with the duck well too.  For the uninitiated, you will find these dishes under \"Barbeque Items\" as \"combo barbeque items and rice\".  You can even order three items if you want.  \n\nSometimes i get the duck with wonton and noodles.  Just be careful, as the heat from the soup tends to \"cook\" the duck, giving it this gamey taste ruining the duck!  I usually, fish the duck out of the soup as soon as it comes to my table.  The rice won't do this, because it's not hot enough.  Duck is fatty and boney.  It gets a little messy, because you will use a combination of your chopsticks/fork and fingers.  \n\nThe place is kind of \"greasy spoon\".  Cleanliness could be a lot better.  Service is like what you get at most Chinese restaurants in my experience (and I'm Chinese!).  Don't be offended, it's mainly cultural, not personal.  The dining room is sticky and kind of dirty.  It's cold in the winter too!  So consider ordering your food to take out.  \n\nDespite this, the duck here is still THE BEST!  I've had some of the other dishes, which are average.   The duck is the main reason I come here and give it five stars!  Closed mondays--bummer!  On Mondays, I'll go to Cheung Hing on Noriega.", "author": "Stephen F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-14", "description": "Mediocre at best.  I was not a fan of the cabbage & ginger soup; just a flavor I guess I am not use to, the roast duck well good, was greasy and yet tender with five spices; other places can do it better.  The spicy sole fillet has a light badder and jalapenos; not true salt & pepper; and the seafood yee mein is good, but fishy.  I do not think I will be coming back; also, the service was just okay; a bit indifferent and cold.  I will have to try Sunset's Best a couple doors down.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "Win's is your basic Chinese charcuterie, i.e., a place that sells roasted meats and the dishes that you'd combine with it, such as noodles.\n\nI've found it to be tasty and filling. I particularly like the seaweed, duck, noodle combination. \n\nAfter reading some of the reviews here, I wonder if we went to the same restaurant. One reviewer objected to cold roasted duck but doesn't seem to realize that when you roast the duck and hang it up, it gets cold. It's cooked already and has been eaten that way by billions of people for centuries. \n\nAnother person wrote about being charged for the house soup. House soup is always free at Win's, so I have to attribute the writer's problem to a misunderstanding. \n\nBasically, this is a solid place for roasted meats and noodles, with some creative items in addition.", "author": "Greg T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-27", "description": "Is 3:30 pm the new 12 noon on NoriA$ea and Outer Sunset District? Or is it because nipples tend to harden on a dreary typical San Francisco Sunday afternoon in October where it was easily 20 degrees F colder than in the Peninsula Bay Area, causing an intense arousal where the cure is a lust for hot red meat?\n\nSomething must have went down yesterday, as Old Mandarin Islamic and Win's (Wing Fai Siu Lap Meen Ga in Canto Chinese, or \"Forever Glorious Roasties & Noodle Haus\") were packed to the gills where it smelled of meat and restaurant atmosphere everywhere and possibly the softening of nipples from the gush of warmth into the body from good hot food. Or everyone had the same idea to eat during that cold time of day. OMI in particular where EVERY table was having hot pot,  as if the restaurant had some afternoon tea di$count $pecial, the \"tea\" being numbing hot spicy hot pot broth for dipping or shabuing (swish, mofo, swish!) their lamb n' beef into.\n\nCheung Hing Noriega, the roa$tie$ hau$ of choice amongst the people, had no customers, no line, yet no parking space for miles on end. This drove me over to Win's to give them a shot, just to see what the fuss was all about.\n\nFor some reason the Wins meat master (butcher) was absent for about 5 minutes. After what seemed like an eternity he finally emerged and got my order.\n\nI bought half a roast duck and half a soy sauce chicken to go and while they were a bit cheaper than Cheung Hing, they weren't quite as good. The duck's sauce/marination reminded me of New China Station San Jose, where I could taste all the strange herbal like medicinal mix, all drowned in soy sauce. The chicken was decent but nothing to write home about otherwise.\n\nLots of specials on the wall that I didn't pay too much attention to, and overall Win's looks like your typical old neighborhood joint, much like the other places on Taraval.\n\nSo yeah, is 3 pm the new noon for bites? Or are more $ini$ter force$ at work that drove A$N peep$ to eat and snack?\n\n1) A$N$\n2) Cheap afternoon tea $pecial$, or just cheap eats in general\n3) Fog & Freezing Cold (nipples pointing at high noon, or westward three on the sun dial)\n4) All of the above\n\nI'm bettin' on #4, coz SF isn't turning into a late night snacking culture like Taiwan!", "author": "Ken K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Chinese Deli's are often misunderstood. At first glance, the ducks hanging upside don't seem very appealing. Looking past the window display, Win's restaurant serve delicious bbq spare ribs.\n\n Tender meat marries perfectly with the tangy sauce. Their poached chicken lacks flavor. I would suggest them to first brine (soak meat in water and salt) over night. For a great side dish, the orange octopus has great chewy texture. \n\nFor thrill seekers, their duck tongue has great texture, similar to tendon. Stealing the show, the roasted pork features meat with a pungent spice. The skin crackles with one bite. Another good dish to try are the chicken wings in soy sauce, a great snack especially during a great NBA finals game.\n\n I have found that different deli's around the city highlight a certain dish and at Win's, the spare ribs are a must try.", "author": "Rayfil W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-09", "description": "Win's is a winner!\n\nI picked up lunch from here today since one of my jobsites is down the street. I was looking for a restaurant that was supposed to have a good crab in black bean sauce. I think this is the place. It's been a few years. \n\nSo I got the duck over rice plate. It's my new fascination....seeing how much chocolate and greasy foods I can eat before an acne breakout. \n\nMy duck wasn't very meaty and it was cold. But it was a nice surprise to find cabbage with it. It's my other new fascination...seeing how long I can go without veggies before I get Scurvy. \n\nTheir health inspection report score was 93. Also the owner is changing per the notice on the door. \n\nI noticed on the menu that they also serve ostrich. I guess that's good to know if I'm every dying for some ostrich. \n\nI'll go back and try the duck again. Maybe tomorrow and I can add Gout to the Scurvy and acne for a hat trick. Wish me luck!", "author": "Kevo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-07", "description": "The food isn't bad, don't get me wrong. But the new owner can seriously go to hell. One way ticket, VIP, no waiting in line. \n\nI've had so many confrontations with him that it's become routine. \n\nFirst confrontation. I went to go buy a roast duck to-go. It was under 10 bucks. I had no cash on me so I was going to use the plastic. The guy sitting behind the cashier said minimum was $10. I explained to him how I was in a hurry, had no time to go to the ATM and that it was only 25 cents short of the minimum. He replied by asking me \"It's only $9.75. You don't have money? It's pretty cheap you know.\" (In Cantonese.) He then told me to just simply buy more stuff and then he'll let me use plastic. I told him before, that the owner always let us irregardless. He snapped back by saying \"Go find the old owner then, we're the new owners!\" So I looked him straight in the eye and left. \n\nI dread it everytime my parents tell me to get pick up from here. Second time, I ordered a noodle soup for my dad. Usually, places would separate the noodles and the soup in 2 different containers. This guy just puts the noodles in a container and then ladles the soup in. Not only does this create really soggy noodles, but there isnt enough soup as the sheer volume of the noodles leaves no room for soup, so when you finally pour it in a bowl, you have an island of noodles and barely any soup. \n\nI complained to him about this, asking him to put soup in another container. He goes \"I already put soup in here.\" I asked him, can you just give me a container of soup? There isn't really enough in there. He replies by saying, sure, the container will cost 50 cents and then $2.50 or a bowl of soup to-go. I was seriously almost about to smash his face into the boiling water. \n\nI'm done with this bullshit review. 5 stars for the old Win's, and the new Win's can go to hell. The owner, his family, and their families. Hum ga chahns.", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-12", "description": "While Cheung Hing is probably preferable for the hard-core duck junkie, a trip to the quiet, sit-down, refreshingly non-dingy Win's yields a much more comforting experience as Outer Sunset Chinese dives go.  Indeed, after a hard week, nothing says \"food is love\" like taking a boneless slice of peking duck (with extra skin, of course), tucking it into a steamed bun, lightly dipping it in plum sauce and popping it in your mouth.  I get misty-eyed just thinking about it.  Besides the duck, the menu goes on for miles, complete with lots of prix fixe \"family dinners\", and the specials on the wall are quite unique-sounding.  It can't *all* be that good, but if Yelp could lead me to a few more dishes on par with the duck, you'd have yourself a 5-star place all the way.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "This is your quintessential hole in the wall Chinese place - some place you go for *normal* comfort food.  If you like the typical ABC dishes, salt pepper pork, honey walnut shrimps, etc - this place is 'ok', portion size are decent.\n\nIf you like your Won Tons, congee, and Roast Pork, THIS is the place to go.  I'll come here just for the Roast pork.  I don't know how they make it, but it's the best dead pork I've eaten.  BBQ Pork - not so hot, roast duck - ok if you like them fat.", "author": "Ed F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-27", "description": "i love the mongolian beef from this place though we have noticed there must be a different cook on different nights because it does vary night to night - though always good sometimes better. Good food, good prices! \nOh and try the duck!! YUM!", "author": "Candy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Hey! This place is great! Just around the corner and the food is always great! Come in, eat up, or take out, and call it a night!", "author": "Jack L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-07", "description": "Did you just say steamed chicken? Yes, indeed you did. Music to this healthy yelper's ears, even when coming from a Chinese BBQ joint. And let me tell you, the smallest size, a half portion, is about enough chicken to feed me for a week. I could have gone with half of a half of a half and still had enough for its intended purpose - topping on a spinach salad. Little does Win's know, they are feeding me and someone as a replate. Everyone wins.\n\nThis much positive feedback usually means four stars, but I had to subtract one for the chef (Win?) spitting right in front of me. Not on the food, but into a trash can. Gross. But that still was a lot of steamed chicken.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-26", "description": "We were lucky and went on a late Sunday afternoon, otherwise parking would've been really difficult as it is commonly in this particular area. This place is also a very tiny whole in the wall with very minimal & tight seating. My chair was against the table behind me! That was a bit awkward..\n\nWe were a party of 5 so we ordered 2 plates of 2 bbq items (duck & bbq pork and duck & crackling/roasted pork), seafood porridge w/a side of kidneys & picked vegetables, korean style buffalo wings, fried tofu, one bowl of dumpling & egg noodle, and a bowl of wonton & egg noodle.\n\nThe bbq items were ok. I would rather save my money and go down the street to Cheung Hing. The \"korean style buffalo wings\" were just fried wings w/honey drizzled and some sesame seeds on top. It was WAY too sweet! I had one wing w/out the sauce and it was a lot better. The soups and porridge were very simple, nothing extraordinary. The fried tofu wasn't very crispy either. More on the soggy side. Basically the only dish I really liked was the kidney & picked vegetables. Nothing really stuck out as great to me.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "I've been nursing a huge craving for roast duck over rice lately (hmmm...maybe my intake of grease and salt isn't meeting the government's Recommended Daily Allowance) and thoughts of Win's keep popping up.  Sure, Win's does other dishes well enough and they also have a great deli but as a bunch of other reviewers state, Win's really is all about the Duck.\n\nI used to come here after work to satisfy my roast duck cravings but I've since moved out of the city.  Now, sitting an hour and a half away, I'd actually consider making a drive out to 41st and Taraval just for a simple plate of their roast duck and rice (and perhaps add a couple whole ducks boxed up to go in order to stave off further cravings).\n\nWin's is cheap, the food is good and I can't think of anything else to add that hasn't already been written about this fine hole in th' wall.", "author": "Man of Leisure M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-07", "description": "I'm a Chinese girl and I better damn well know Chinese food, no matter how Americanized I've become! \r\n\r\n4.5 stars. \r\n\r\nI just LOOOOOOOOOOOOOVE their beef chow fun!! It was tough, I couldn't decide if I like the chow fun from JoJo's or from Win's. I think I like Win's a little more. \r\n\r\nI love roasted duck and I've had my share of bad experiences with roasted duck. The roasted duck at some places have a funky after-taste. This place got great roasted duck. Make sure you try it out!", "author": "Nance W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-11", "description": "This place is delicious! I love their duck. It's a tad bit more expensive, but very worth it. It's not as oily as some other places. \n\nThe old mean lady is not there anymore, so the staff are definitely more friendly and the atmosphere is a lot better. I really didn't like her  because she would yell at the staff while we were eating..not cool. So if she is reading this then, THANK YOU FOR SELLING THE RESTAURANT.\n\nEverything is good..watch out for the vegetable dishes. We ordered one, and it was small and totally expensive. (We ordered off the menu-not a good idea).", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "Quick basic food.  Nothing special or fancy but tasty.\n\nhad the Tomato beef chow mein and a number of different Won ton noodle soups.  Street parking with no meters.", "author": "Ray Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-16", "description": "Wins. Wins.\n\nTotally agree eith euge l. From mama at the register to her son in the kitchen this place is authentic chinese food without the hurried pace and abrupt service. They've been around, oh like... forever and continues to serve up food with excellent consistency.  My favorites: West Lake soup, Beef Stew and chicken chow fun with gravy. mmmmmmmmm", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "Supports my conviction that duck in the window == worth a stop.  Better yet, worth a drive from anywhere else in the city.\n\nCome here for wonton noodle at lunch, leave with a couple takeout dishes for dinner.  That's what my very Chinese parents (in town visiting) did yesterday, and today, and probably again tomorrow while I'm at work.  Following this formula, lunch and dinner for three was just about $30 - can't beat that value.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "I've been coming here for years, an almost weekly visit to get my salt and msg fix. Yup, this place is not for the health-conscious types, but if you want to indulge a bit, you will be rewarded with some very tasty food. As individual tastes can vary, reviews will vary accordingly. And as choice of dishes goes, it can also vary, thus, ratings will swing accordingly as well. \n\nHere are my personal favorites:\n\nRoast Duck, hands-down the best this side of the city...If the duck is cold and you order half to a whole duck, they will oil blanch it to get the skin crispy and hot again before serving to you...ahhh! It's as close to being in duck-heaven as you can get.\n\nRoast Pork, hands-down the best anywhere other than the one I had in L.A. They use a center-cut (don't know if that's the technical term) but the perfect section of meat has just the right proportions of skin, fat and meat. They bake the specially cut sections throughout the day. If you're lucky to get it right from the oven....mmmm, mmmm, mmmmmmmm. Don't come too late. The roast pork sells out readily.\n\nBBQ pork, hands-down the best anywhere--they use the cut of meat that is more expensive...tender with just the right amount of fat. As I said, this place is not for the health-conscious. Lean pork is usually too dry for my taste. Not these...lean plus fat equals moist succulent meat. And if you're so lucky to get one in which the fat is sorta al dente, like between fat and cartilage...Oh my, yummmm. \n\nIf you're a fan of duck feet, don't forget to order some, especially the claypot version served with black mushrooms.\n\nAlso, do not walk away without trying the hung tao yee wonton...it's an old chinatown dish that very few restaurants make this dish anymore. We like a variation with westlake beef soup base for the hung tao yee tun.\n\nTheir salt & pepper chicken wings is one of the best! Salt & pepper fish is yummy as well, as is the calamari.\n\nIf you like egg and shrimp over rice noodle (watt dan hah fun), be adventurous and try their satay version. \n\nAnd since I'm a regular, I often order variations of their dishes to suit my taste as well as averting boredom from eating the same dishes.\n\nThe people who own Win's are very nice people, once you get past their serious side. It's tough running a small mom & pops business. And believe me, there are \"customers\" who come in and try to take advantage of them or try to freeload. I've seen it happen time and time again.\n\nAnd speaking of cleanliness...they may not spit shine the silverware or wipe the tables with the utmost care, but I see them putting the cleaned utensils in boiled hot water to sanitize them, hand dry each utensil and chopsticks, and then at the end of the day, piling the chairs up and scrubbing the floors clean of the day's foot traffic. And so, this is the time I make my leave with leftovers in hand.\n\nOne more thing, the house soup is complimentary...if you think they charge for it, something went askew in the translation/interpretation.", "author": "Lil D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-07", "description": "Meh. Nothing outstanding, but nothing horrible about the food here.  We got the 6-course meal and I was a bit surprised by the smallness of the dishes as I was expecting typical Chinese banquet portions.  For only $24 though (and only two eaters), it's a good amount of food.\n\nThe gai lan was nice and crisp.  The chicken and duck were good (not great) but fatty.  The chicken's ginger condiment made me a bit homesick; it smelled like what my dad makes. The rest of the food: meh. I liked their red bean dessert, not overly sweet.\n\nAlthough it may not be for everyone, I liked the atmosphere. It's a small restaurant and they cut up the ducks and chickens right by the front window. Some will probably find it loud and annoying, but it made me feel right at home.  They were also doing a lot of takeout, so there's a lot of Chinese flying back and forth in the front.   (I was slightly annoyed by the other patrons though. One couple kept adding dishes when they saw other people's which confused the wait staff. Another table had a kid who kept making comments about the decor, the people, the Chinese flying around--blegh.)", "author": "Yan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-15", "description": "An after school stand by. Win's has been holding it down with cheap, belly-sustaining entrees for a long time. Evidence: the owner still sits on her stool in front and calculates your order on a notepad. No calculators in sight. \n\nThey are famous for their duck, but I don't have to tell you: you will be able to discern that from the many ducks hanging in the window and the many many framed reviews on the wall that tell you that the duck is the ish. Spicy garlic chicken and won ton soups are also highlights. \n\nWarning: The boss lady a.k.a. speedy human calculator has little tolerance for customers who cannot order in Cantonese. Pointing to the menu item seems to help little because she then frustratedly squints at the menu and guesses which entree you wanted. However, if you can get over the language barrier (bring a friend!) it's totally worth it.", "author": "Kari M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-10", "description": "Win's offered great sized portion rice plates at extremely reasonable prices.  I always get the combo rice plate with roast duck and roast pork.  They give a huge amount of both, with a side of steamed cabbage and a mountain of rice that I can never finish. Ask for extra duck sauce on the side for make it a little juciy-ier.  \n\nI would pass on Win's Potstickers, which they claim are their speciality.  They seem to have a bit too much ginger in them.  And when I told them it tasted that way, and wanted to send it back, they responded with \"Well that's how we make it.\"  Thats fine if that's how you make it, but at least let me take it off my bill.  In the end they did take it off, but they didn't have to respond the way that they did.  \n\nOverall, come here for the combo rice plates which are served quickly and at a reasonable price, but given that this is a Chinese restaurant, please don't expect much on their level of service.", "author": "Cass J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-20", "description": "This place rocks, and it's been around for close to 20 years.  I used to live across the street when I was a kid (41st & Taraval - represent!), and between the ages of 10 and 15, I picked up a shitload of food here.  They have ducks hanging in the window and really good chow fun.  If you're jonesin' for jook (a Chinese rice porridge), they serve that here in the am and give you the 'Chinese doughnut to dip into it with.  Yum!\n\nDefinitely one of the better Chinese food joints in the Outer Sunset/Parkside area.  I'd eat there all the time if I still lived there.\n\nI' m giving them 4 stars because the middle-aged Chinese woman  (she's probably kind of old now, and possibly dead!) who ran the place and sat at the cash register used to be a little brusque with me whenever I went to pick up food.", "author": "Karen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-14", "description": "Best darn  \"food for the buck\" in SF..\n\nThis place is a REAL sleeper.  Like Cinderella who does not have time to \"pretty up\"....  It is the Ugly Betty of the Outer Sunset, and I am gilng back tonite,for the second time this week..\n\n$25 fixed price meal feeds THREE, easily..... \n\nBut:  it is not the volume, but the quality, that will call you back..jb", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "Been coming to Win's for years.  Experienced two owners and the food have been consistently tasty and substantial throughout the years.  This restaurant has always been a great place to take family & friends for quick cheap Chinese eats.", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-15", "description": "Pros: Entrees are reasonably priced and they give you a lot of it. If you can't decide go with a rice plate, not the fried rice but the (item) over rice. Can't go wrong with that. =D\n\nCons: A little too greasy for my taste sometimes. Avoid ordering Broccoli Beef and Tomato Beef Chow Mein. You can totally feel the MSG after your meal.\n\nService is alright and the people speak some okay-ish English.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-08", "description": "You know when people say \"This is the spot!\"?  Win's is THE spot.  I've been to Win's about 4 times now and still can't get past the set menu or \"pre fixe\" for you gastro-technical people out there.  $22 for the two person set gets you soup, Chinese broccoli, their \"oh my shit this is outta control\" roast duck and chicken, clay pot fish and tofu with nappa cabbage, pepper beef, and dessert.  Tonight, we ordered oysters with green onion and ginger in addition to our \"usual\" and it was the kaboom!  \n\nIcing this wonderful gem of a sunset chinese restaurant is the friendly personal service.  Not the \"Hurry up what do you want, hurry up and eat, now hurry up, pay and get out\" service I've come to expect in many a Chinese restaurant in the City.  For example, after eating until we both were ready to explode, the owner made sure I had enough boxes to even bring the rice home if I wanted (without asking).  She also made sure I packed in every bit of cabbage from the clay pot, even though I already felt like a total glutton bringing home enough food to feed 3 more people.  Yeah, its good.  Yeah, its really good.  They know it, and they don't make you feel like they're doing you the favor when you eat there.  They're grateful, and years and years of regulars are grateful too.  ALOHA!", "author": "Barry A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-28", "description": "I live three blocks away, so I would really like to love this place, or at least love to like it.\n\nThey were supposed to have this amazing won ton soup, of which I am a big fan. When I ordered it, I was very disappointed. The broth was way too salty. \n\nThe fried won tons are actually very good, which earned them that third star.\n\nThere are just too many good, cheap, Chinese restaurants in this town to tolerate mediocrity.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-20", "description": "The prices aren't bad, but the food itself is really not that great... If you happen to be in the area and need a quick and filling meal for a decent price, go for it; if not, I would keep my options open...", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "Grew up in this neighborhood and saw the progressions of the growth of the business.  The original owner recently, well not that recent anymore, sold it to someone else.  \n\nIn any case, it was great to have a \"WonTon House\" close to home.  Wonton Noodle Soup is essential to an Asian Man's diet.  Gotta have it once in a while and they certainly fit the bill.  Their BBQ Items are pretty good too.  Probably not on Cheung Hing's Level but pretty good nonetheless.  \n\nThey also have this tamale that no other place has that I like to eat once in a while.  In fact, I haven't ate it so long, I may just make a trip out there sooner rather than later......", "author": "Mark W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-13", "description": "This is a good place for Wonton Noodle Soup and Roast Duck if you're in the area and need a quick bite to eat.  The duck here usually has a nice thin layer of fat under the skin which is critical for moist duck.  I really dislike the the duck at places like Chueng Hing where the fat content seems to overwhelm the flesh.\n\nHowever, like most small chinese restaurants, the place does need a little cleaning.  I wish they would take advantage of commercial restaurant cleaning services.\n\nThe other dishes on the menu (a la carte/family style) is about three stars.  It's nothing to truely rave about.\n\nAll-in-all this is a good place for food if you live in the area and don't want to travel too far for chinese food.\n\nThree stars only cause of the roast duck.", "author": "Curt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "My Chinese mother orders food to go from here and she used to bring me here for Wonton noodle soup. That means the place must be cheap, and good! and it's both. All their pork is good and their main dishes are good too. It's no fuss homey chinese food, nothing fancy.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-23", "description": "If you have been visiting this place for more than 2 years, you should know what this place was like 2 years ago. There were plenty of reasons to come here 2 years ago and there is absolutely no reason to come here now.\n\nFor the same food, good to Norjeg2 Chenug Hing!\n\nWhat a disappointment....", "author": "Andy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-19", "description": "If your hungry and you want a cheap meal in the Sunset you will get a lot of bang for your buck at Win's. Some may question the lack of ambiance or the scary guy chopping up roast duck or barbecued pork in the front but I have yet to get food poisoning from this place. Not much of a review but cheap + food can equal food poisoning. I have been ordering here for over four years and never had a problem.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "I like this deli for the stuff hanging in the window. They have good pork and fowl here. I also appreciate that the deli man chops the pieces evenly and clean through the bone so that you don't choke on tiny bits when you bite into your duck and chicken. I almost choked to death once when I was a kid because of someone's poor butcher skills; my mom started chopping her own stuff after that.\n\nSaltwater chicken with ginger-scallion dip was my absolute favorite thing to eat growing up and I still like to take down a good chicken whenever I can. The chicken here isn't rough and overcooked like at some places and I love that they're not stingy with the ginger-scallion dip because I slather my chicken in it and also mix some into my rice. The roast duck is very tasty too and not excessively fatty. I also like the noodles here but the chow fun is just okay. My sister and I ordered seafood chow fun one night and there was very little seafood and veggies. I think it only cost $6 something so there probably wasn't much more to expect. I'd come out here just for the deli items. Actually, I think I will tomorrow...", "author": "Queenie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-13", "description": "This is the only place that I guarantee that the wonton noodle soups are a never fail and always delicious choice. I can't get over how the soup base can make all the difference...there's just enough flavoring in it that it's not overkilled by soy sauce!\n\nLove love the noodles, they're usually ramen style. The rice plates are also a good hit for lunch. I haven't eaten dinner here..but since this place has only a few tables, it's not a really big place.\n\nCall in and make a take-out, they are fast! I never had to wait longer than 10 minutes for my food.", "author": "Pauline L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-19", "description": "Sorry to say... I gotta diss on Win's. Their food isn't that good and the few times I've gotten takeout rice plates from them, it's been like 99% rice and not really much of the food. It was mad cheap, but I would like less of the rice. There are so many other places in the Sunset with better takeout for a buck more. \n\nWin's is suppose to be a duck and roast pork place, but I've had it and it wasn't that good. The pork was tough and had too much fat. The duck was not meaty enough. Why don't people just go to Cheung Hing... it's like a mile away and has WAY BETTER food. There is a reason this place never has a line out the door and Cheung Hing does. \n\nIn short... barely decent food, but why even come here for that. Skip Win's and check out other places in the Sunset", "author": "Arick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-25", "description": "I haven't bought anything from here except roast duck. They have really good roast duck. I used to buy it from Noriega between 30th and 31st Ave. across from Safeway. My friend suggested Win's. And I thought \"why not?\"\n\nI prefer Win's even though they are a bit more expensive. But I like it because the oil is in a tiny container on the side. The place on Noriega puts it with the duck. Yuck!!!!\n\nI know roast duck is very fatty. I try to take off the skin and pull the fat off and toss it. I sometimes even take a paper towel to soak up the oil from the duck.", "author": "? ?."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-11", "description": "Win's Resturant is a winner by far.\n\nService here is ok, but the food is awesome. It can be pretty difficult to get some good chinese food in the sunset/parkside, so this place is set in the perfect location. I've tried many of the other chinese food around that area and none has deserved a second trial except Win's. It's quite unique how the resturant is set up. If you order BBQ plates or wonton noodle they'll make it in the front of the store, but like chow mein and fried rice comes from the back. Kinda feels like eatting in China town.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-22", "description": "Be careful, this place has a floor slicker than the local jiffy lube.  I've felt more stable while trying to walk across thin ice.  \n\nYes it isn't the cleanest place, but what decent Chinese food is?  They have a little BBQ station at the front, elevated above the greasy floor that the common people have to slide around in.  And from what I could tell from eating the BBQ pork, these people know their BBQ.  I'll definitely be back to try the duck and order the BBQ pork again.  For $5.50 you get a sizable plate of pork, which is not too fat laden and is actually tender and flavorful, a great combination.\n\nThe other two dishes I had were the special spicy pot stickers, which were strangely not spicy at all, but were huge and flavorful nonetheless.  Also had the tomato beef chow mein, which was a loser, not recommended at all.  Finally the Ye mein was quite good and I would definitely order it again.", "author": "Stephen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-15", "description": "I would give this place five full stars but to be honest I only come here for a couple of things and have not yet tried many of their food menu items so I don;t really know just yet. \nBUT...i can say that their roast duck low mein and roast duck ho fun are mouth wateringly delicious! I come here for my roast duck a good once a week to treat myself. Yeah, it's THAT good. \nCan't say too much about service or decor...it's a chinese resturant afterall. You go there for good food. Nuff said.", "author": "nancy l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "Our late night dinner spot every tuesday night.. great hole in the wall chinese restaurant... although i am accompanied by people who speak chinese and know the good food, not the regular chinese food people usually get.. we get the dishes that are not on the menu or the ones that are in chinese and people like me cant read them... good solid consistent food!!  \nBad note:  floors are very slippery... never fails. I just have learned to be very careful as i walk across their floor", "author": "Shelley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "I luv Win's.  Outstanding cheap Chinese food.  Chow mein, low mein, chow fun, roast pork with bean cake, roast duck, won ton noodles, etc.\n\nIf you want a cheap Chinese meal at a greasy spoon, hole in the wall ghetto restaurant, try Win's.", "author": "Raider J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-07", "description": "Just had lunch here with a coworker.  This place is famous for their roast duck and I ordered the quarter $6 plate to share.  I ordered the wet egg and beef over rice and my coworker ordered Mongolian pork.  At lunch, you get free house soup.  The soup is the standard dried bok choi, carrot, and pork bone soup.  It tasted good.  The roast duck came out in about 2 minutes and we were able to eat this while waiting for the rice plates to be cooked.  The duck was moist and flavorful.  Slightly crisp skin and good meat.  It was cooked more such that more fat was rendered out, but not dried out.  The duck is highly recommended here.  My wet egg and beef over rice plate was good as expected like at other restaurants in San Francisco.  The serving was ok-generous.  Price was $5.50 for the rice plate, pretty reasonable as most other restaurants are starting to reach $7 for the same dish.  The beef was tender, and the egg was mixed with a lot of corn starch to make a thick egg-drop soup consistency.  The lady waiting tables was very nice and efficient.  I enjoyed her deliberate enunciation when repeating the dishes we ordered.  Very nice woman.  The atmosphere was bright, but the L-train passes every 15 minutes which thunders by.  I enjoy this place and has been one of my regular locations for lunch for many years.  I highly recommend the food and service here.", "author": "Ed K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "Great chinese food in my neighborhood. Love the wonton soup dishes and the duck is pretty good since its one of the only roasted duck and chinese bbq places in the Taravel side neighborhood. Since there are now new owners I say the food taste just the same and I think the service is better. Yeah the waiters and waitress speak limited english, but they're friendly and patient.  I think the old owners especially the lady owner who always was at the cashier was scary. \nThe fried chicken wings are yummy !", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "Very good roast duck and hot and sour soup here.  Another plus is that this restaurant opens until 10am, one hour later than most similar restaurant serving HK-style barbecue.", "author": "H K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-21", "description": "Review for Wonton Soup to Go.  For $6.00, five lonely wontons in a plastic container.  Broth sprinkled with green onions was in a separate container.  In summary, very bland pathetic looking orders of Wonton Soup to Go.  There are many better options in the Sunset.", "author": "Lucky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "i live 4 houses away from wins. \n\nit has won me.\n\nits food that tastes good, and doesn't cost a lot. What more could you want?", "author": "Danny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "Ive gone here for 20 years because it was always decent and cheap but I dont go much anymore because the service sucks and the staff is surly and very unfriendly.What really got me was I went in for take out and they wanted to charge me 25 cents for an extra litle plastic container of chili sauce...I could not believe it!!", "author": "james m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "The place is not fancy but the food is great tasting. I ordered the seafood chow mien & veggie rolls and it was delicious & portions were large. To top if off, prices were very inexpensive. Will definitely go back again!", "author": "Selma R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-22", "description": "This place is known for really good wonton soup and roast duck and I agree.  They are pretty consistent with the quality and portions.  The restaurant does look pretty old and the floor is sometimes slippery.  This place is good if you want good traditional wonton soup and duck.", "author": "JACOB L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-04", "description": "I think I've been eating here since I was 12 and nine years later it is my favorite places to grab roast duck. I feel that the restaurant lost a bit of its great taste from the past (before it burned down) but other than that definitely the roast duck and BBQ pork are the bomb. I would give this place a 3.75 star of out 4 if I were to be a bit picky.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "This is the best BBQ take out place in the Sunset!  I always come here for their BBQ roast duck, roast pork, BBQ pork, steam chicken, occassionally their squids.  All are tasty good.  Always long line for take out BBQ food esp dinner time weekend or weekdays.  I appreciate their food and they opened this place for many years and hope they stay open for a long time.  I appreciate the convenient of having this type of Cantonese food in the neighborhood.  Once in a while, want to have a good won ton noodles soup, just go to Wins, and I will dine in because eat in won ton noodles soup taste better then take out ---maybe is the soup and noodles can get soggy when take home.  Their service is not too bad to me, people may thing they are rude but just their style of communication to me.  Overall, I am still their fan!  Thanks Wins!", "author": "Kitty G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-21", "description": "GYEAAAAA!\n\nNow we're talking.  Win's, another SF landmark for those of us who lived in the ghettos of lower sunset.  If my memory serves me right, Win's is the number one spot in the set to get roast duck (we are now going to refer to Sunset as the set because I'm starting to relive my days as an adolescent teen).  You order half a duck with steamed rice and it comes with steamed cabbage in a light oyster sauce.  How many fucking chinese restaurants in LOS ANGELES do that ?  Sam fricken WOO definitely doesn't and they're goddamn roast duck is close to fricken 20 bucks! Ok whew, I need to calm down before this review turns into a socal chinese restaurant bashing review...\n\nAnyway if you're ever in the \"set\" make sure you stop by here for some bomb ass roast duck.  You won't be disappointed!", "author": "Hung T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-20", "description": "Gotta try the Chinese roast pork and won ton noodle!", "author": "Porkchop S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "This is my favorite after marathon spot, I've been here once each year for three years and each time right after I finished the marathon run. What better way to satisfy my huge appetite with greasy chinese =) The shrimp wonton soup is pretty good here. The duck is ok, not the best in sunset but pretty tasty still. This place also sells duck to go. Duck, wonton soup and guy lan is what I look forward to at the end of my race. Lookin forward to next year...", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-20", "description": "The food is great. It comes quickly. Portions are generous. A *tad* on the pricier side for what the restaurant is, but it's good authentic Chinese food.", "author": "D T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-01", "description": "A lot of times, I just don't feel like fighting the crowds on noriega and irving, so I walk down the block to Win's and never leave unsatisfied. The staff is very prompt and friendly which is always something more than expected at real old school chinese restaurants..lol.  For some reason, i just love how they prepare their roasted pork. they serve the best part of the pig too, always. Their roasted duck is juicy and full of flavor. I always get that with ginger and green onion lo mein (braised noodles). Broth could use a little kick, but good nonetheless. They post unique specials on the walls too: pinenut, egg white, fried rice...or something interesting. Those are a hit or miss. I just stick to the basics here and enjoy my usuals.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "Love their bbq.  The roast duck and roast pork are the best.  Especially the roast pork, the skin is crisp, nice flavor, not too salty not too bland, and they only use the belly part, which is best cuz it's not all lean meat.   The ginger scallion chicken is yummy too, but i think it's a lttle over cooked.   Fast serivce, close to home, my favorite place for togo in sunset.", "author": "Tadaa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-29", "description": "wins by far is the best chinese food i, as a non chinese can easily get. i know there are others out there, but wins is super nonchinese friendly, easy take out service, and the food? oh good lord, some of the best roast duck around. they pack in every serving this duck sauce liquid stuff that makes every bite an mouthgasmic experience. \n\ntheir noodles and wontons second to none. excellent. excellent.", "author": "Euge L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-10", "description": "yum.  we ordered so much... egg rolls, BBQ platter (pork, chicken, ribs), kung pao beef (not on the menu btw), pork fried rice, braised noodles with wontons.  And ate every last bit, except for the noodles which we found lacking in flavour and so totally not worth it.   Everything else was super good - me and reno fought over the last wonton (he won.) Cinzia was being crabby and insisted she didn't like anything, but I saw her sneaking bites of pork fried rice when she thought nobody was looking.  Reno's  \"I done\" was betrayed by him sniping Jack's bbq chicken over and over.  Jack's quick hand commanded most of the pork fried rice and all the bbq reno couldn't reach.  So there we all were, stealing eachothers food and loving it.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-17", "description": "Cheap Chinese Food! But, that's about the only thing going for it. I was extremely disappointed in my experience. Came here with my team after practice because this is one of their favorite places to go. Unfortunately, I've had better. The skin on the potstickers was really thick - not a sign of a good Chinese restaurant. The walnuts served with the Walnut Prawns tasted slightly stale. Overall greasy food which did not taste really fresh. I would be very reluctant to return when there are much better Chinese restaurants in San Francisco.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-07", "description": "hello ... flavor??? where are you??? when the new owner comes in, he stands right on top of his cooks and watches them like a hawk making sure they don't add anything to the dishes. sure the economy is tight, you could downsize your dishes, streamline you ingredient list, fiddle with the prices but when quality suffers ... i've had steamed rice with more taste than the last dish i've had there recently.\n\nall that said, win's is still a cheap eat and timing your visit may still earn you a good meal, fast and fulfilling. make sure you take some1 with you who speaks cantonese when you go.", "author": "marvin l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-10", "description": "I have been faithful to Win's for over 10 years. It was THE neighborhood go-to spot for everything roasted (duck, chicken, pork) and of course, the crunchy shrimp Pan Fried Noodles. It's unfortunate that it has since been transferred to a new owner because frankly, it's like losing a member of the family - to leprosy. This place now sadly serves cold Pan Fried Noodles with half the shrimp, half the bok choy, and twice as much baby cockroaches.  Horrified but still hopeful, I turned to the won ton noodle soup to find a slightly larger cockroach's legs (count them- 2) floating atop the dark bland broth.  Dismayed but not yet defeated, I finally turned my chopsticks to the plate of cold roast duck, to find, not more cockroaches, but lots and lots of duck follicle hairs.  Needless to say I paid my bill and got up to go outside and vomit.", "author": "K N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-05", "description": "very good \"siu yeah!\" (i.e. roasted stuff) roast duck, BBQ pork. and wonderful wonton noodles. the kitchen also cranks out unique offerings of chow mein, chow fun, and even serves sauteed ostrich. Ostrich meat tastes like beef but is lower in cholesterol. recently remodeled the dining area which makes dining there a nicer experience.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "ROAST DUCK! Enough said! Been going here ever since a was a little kid. Best duck in the bay area! Prices are super cheap, I  guarantee you'll leave win's satisfied and full.", "author": "Lex S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-30", "description": "Well it sounds like everyone really likes this place and it was recommended to me by my Chinese co-worker.  We got take-out from Win's last night and it was totally awful.  There was no chicken in the \"General Tsau's Chicken\" (it was all breaded and fried fat) and the tofu/veggie dish had a weird taste and odor.  The potstickers, however, were delicious.  I guess we didn't order the right stuff, but I don't really like duck and it's too bad the other stuff wasn't good.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "Win's is a great place for feel good Chinese food...jook (rice soup), won ton soup, you know the stuff mom used to make. Even the stuff mom used to bring home...roast pork, char sui, and roast duck. All three are fantastic! Don't go in expecting a fine dining experience, it's a hole in the wall Chinese restaurant, but you defiantly get much more than you pay for.", "author": "jamie p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-26", "description": "Found this place by typing in \"roast duck\" on yelp...and it was perfect.  They have these family dinner plans for $10 (min. 2 people) that included an egg roll, wonton soup, duck, chicken and brocoli, and shrimp fried rice.  All were excellent, the service was nice (which goes against the rule of good chinese restaurants), they didn't bully us out when we were done (which goes against good chinese restaurant rule #2), and there was more than enough food for left-overs.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-04", "description": "We've had take out from here so many times but I kept forgetting to review it while the food was fresh on my mind and in my belly. But tonight, everything was so good, I had to bust out the keyboard as soon as I had wolfed down a plate-and-a-half full of food. We've never actually sat down in the restaurant to eat. It's just always been much more fun to get the food to go and inhale it in the privacy of our own home along. I had no idea there were new owners, but I don't think the quality has changed.\n\nTonight, we had:\n*chicken salad - perfectly seasoned, albeit a teensy bit soggy (which really doesn't matter when you eat it as fast as I do), but sooo flavorful. Be sure not to make the mistake my funny hubby made the first time we ordered this:  do NOT order \"chinese\" chicken salad. It's a chinese restaurant so it's just chicken salad! (Wasn't that on an episode of Friends??)\n*broccoli beef - the beef was juicy and tender, the broccoli still crisp and soaked in enough of the sauce to burst in your mouth when you bite into the little tree\n*bbq pork - We think this is definitely one of their best dishes. It's always tender, and made with lean pork Lots of other places we've tried bbq at have used fatty meat. Win's pork is meaty, baby.\n*veggie chow mein - not as many veggies this time as it usually has (bok choy, broccoli, carrots, celery, mushrooms, etc.) but I love their chow mein noodles so to me, the more noodles the better! These are not the skinny mein noodles but the thicker, chewier noodles.\n*combo fried rice - the only ordinary dish, but still yummy\nAll that food and yep - just $33!\n\nIn the past, we've also had their chicken wings (very garlicy but yummy, especially when it's still fresh and still crispy), hot & sour soup (delish - not too hot that it burns your taste buds off so you can't even taste anything else), and kung pao chicken and cashew chicken (ditto). You just can't go wrong with Win's for the taste and the price!", "author": "Teri T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-04", "description": "This place is one of the better restaurants in the Outer Sunset, for sure.  Nothing fancy, but the food is good and cheap, and the service is decent.  I felt like I was actually over at a friend's house when I ate here as opposed to an actual restaurant (which is a good thing, I guess).\n\nWe ordered an oyster claypot, Chinese broccoli, black bean sauce clams, and rice.  It was enough to feed three people, plus leftovers, and we got out for around $25.  The included desert was an almond jello that wasn't too bad.\n\nNot a place to drive to if you're coming from far out, but if you're in the area, hit it up.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-27", "description": "can I say the best roast duck in sf?? the best! and I used to live in chinatown. Most of the time the roast duck in loaded with a thick layer of fat under the skin. The duck at Win's is usually so lean that it's almost healthy to eat (ok, I am just justifying my pigging out)  It is a casual inexpensive chinese restaurant. Get a bowl of roast duck noodles if you are ever in the neighborhood", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-10", "description": "If you're looking for some great chinese roasted duck, look no further! The duck is very meaty, and moist. The prices are very reasonable.", "author": "Gilbert D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "I love their wonton soup! Quite recently, I've tried their regular menu items and so far those have turned out to be quite good too! The prices are relatively cheap and for the price quite tasty.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-15", "description": "New owners.  Same good pork.  'cept ask for the pork sauce.  Them new owners are lil stingy with da sauce!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-10", "description": "I come here when i need to buy cha sew, duck , or chicken for my mom because it's s close to my house. Theres prices are really cheap too.But it gets crowded on special chinese days because all the moms want the chicken or duck to bai sun. It may look alittle dirty, but the food is good , so dont be afraid of how it looks from the outside!", "author": "christy w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "Good bbq items. The staff is really kind.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-28", "description": "I agree that their BBQ pork is quite delicious but it's NOT worth $10.00  per pound! Other places in San Francisco are selling the same for $5.50 per pound! In addition, after the shop changed hands, they only use (headless) frozen chicken not the fresh ones that are more favorful and can be found at other stores. Seems the new management just want to make lots of money quickly in anyway possible including ripping off loyal customers. Did anyone else notice that their roasted duck ($12.50 each) are much smaller than the ones found at the other stores?\nI don't shop at this store anymore...next time I feel like some good pork, duck or chicken I would go to Noriega or Irving! I can get the same or something better at a much better price and that really matters in today's economy where every dollar counts!", "author": "D L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-27", "description": "I've been frequenting this place on and off for some 4 months now. I quickly grew fond of the fast, friendly service and of course the Roasted Duck over Rice. Unfortunately, the quality of food and service have been declining from visit to visit. The duck ended up being fatter, having less meat, whilst chiefly consisting out of abnormally sized bones. I've seen a lot of ducks in my life, but none that would resemble such a shape, therefore I presume that these aren't naturally bred ducks, but the factory farming kind of poor quality. Of course, the duck's quality has never been A+++, but as aforementioned, the nice atmosphere and the well-used condiments made up for the poor meat quality. It's good street food, but it's just that \"street food\". Hong Kong version of shabby Hamburgers and Hot dogs... don't expect anything too fancy", "author": "Roger W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "This place is the mad notes for rice plates. You won't find a better scrambled egg and beef over rice anywhere. They also make a chow fun that will make you want to kiss your enemies. They offer both the dry and gravy sporting varieties.", "author": "riz n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-11", "description": "my husband found a *bug* in his chow-fun.  nuff said.", "author": "elaine i."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "I'm giving 3 stars for the price and also the BBQ meats are normally good.  However recently i tried the preserve egg and pork jook and asked for an extra egg.  When I got it, I stirred the jook and could swear the amount of eggs seemed like the regular portion.  I questioned the waitress and she said they added the egg.  Next time I will ask for the egg on the side.  The other problem with the jook it was really watered down and almost taste like soup.  I would suggest you stay away from the jook dishes!!", "author": "Wally W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-18", "description": "I love this place.  I've been coming here  for 3 years and it has never ever disapponted me. This little place has the absolute best wonton noodle on the west side of the city.  \n\nTheir potstickers are pretty darn tasty and plump.", "author": "kenny l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "Living a couple of block away this place is a godsend when I'm craving roast duck. They have good basic Chinese foods - wonton, HK style chow mein and fun. I think service has gotten friendlier since the mean old owner lady sold it, and from what I understand to a couple of employees.", "author": "Sheena L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-17", "description": "Agreeing with the roast duck/pig comments everyone makes, but wanted to mention that the wontons and fish balls are also quite good.\n\nIt's totally a hole in the wall, but it's reasonably cheap and the food is quite good.  I don't think I've ever been dissapointed.", "author": "josh w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-01", "description": "My husband and I get take-out here at least once a week. Their duck and bbq pork rice plates are so hearty and delicious. And we always order soup - my favorite is the duck noodle soup or chicken juk. Hubby loves the Westlake minced beef soup.", "author": "Zoe S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-18", "description": "I have only been here once and probably will not go back.  The price was right and the service fast, but the food I ordered was pretty gross.  I was so hungry I was ready to gnaw my hands off, but the Sweet and Sour Chicken was so bad I just ended up eating some of the rice and then a Twix bar so I wouldn't pass out from hunger.", "author": "Dave O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-05", "description": "Great comfort food! I've been going to Win's for over 10 years and I can't help but order the wonton soup every time. It has great flavor and lots of shrimp. When I go to Win's the only decision I need to make is whether or not I want to add chashu or baby bok choy to my wonton soup. But if I am really hungry I usually add noodles and go with wonton mein. My boyfriend on the other hand always orders the chashu dofu. The roast duck is also a very popular takeout item. \n\n* Win's was open on Christmas day in 2007. I ordered take out on my way back to San Francisco.", "author": "Akemi F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "just found another roast duck spot.  hello angina.", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-22", "description": "Great won ton mein at a decent and affordable price. Their barbecue items are just as good ie roast duck and the char seiw.", "author": "p a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-24", "description": "I live in Oakland but would come to Win's at least once every three weeks for my Peking duck. I love the flavor of the ducks here and how it melts in your mouth!", "author": "Lynne O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-13", "description": "This Chinese restaurant is 'A-OK'. I live two blocks away and sometimes come here when I have nothing to eat at home. Their roast duck and squid is good. I specially love the squid. If you eat squid, you should definitely try it! Sometimes my parents would come by here and get the squid as an extra dish for dinner. My whole family loves it!!  I haven't been here for anything else for awhile, but they have a huge selection and pretty cheap. Overall, not a bad place to go for a fast cheap chinese food. Definitely not the best but good enough for a neighborhood restaurant. It would be better if the place is cleaner and brighter.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-24", "description": "Great place to get fast good Chinese food.  Pretty standard Chinese food hole in the wall.  If you get the standard beef chow fun or their porridge (jook) then you are safe.  I've never had their deli items but my parents which are older always said their roast pork is the best.  Service is ok if you don't speak Chinese and if you do, then service is better.  Don't expect much from the hole in the wall but for a quick meal, it's good.  Parking is limited because everyone wants to park in front.  Plenty of parking if you are willing to walk.", "author": "C T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-18", "description": "quick, cheap, and friendly. what more do you want from a neighborhood family owned shop? the food, to me, is only slightly better than \"okay\", but it is one of the better places to eat this side of sunset blvd. i must say, roast duck does get pretty gross without anything else to eat, so remember to order your rice.", "author": "Ben T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-15", "description": "good chinese food for lunch and dinner!!! live very close there and always get food from there!! prices are reasonable and service is good.. variety of food to choose from...", "author": "Lily T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-20", "description": "this place has been around, more miss than hit; alas new owners and the go to for bbq items in the sunset/parkside area, sit down was not bad, incredibly fair prices for what you get, stay away from the standard stuff, like chow this and that; and go for sauteed items and even though mom isnt always there to do it, they can!", "author": "tim y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "best thing ever is their wonton soup. you just cant go wrong with their wonton soup and if you can handle just a bit more you could add noodles with it. i think its less than $4 for wonton soup and maybe $5 with noodles. the place is kind of old looking but if youre hungry and dont want anything fancy this place gives good portions like other simple old traditional chinese places.", "author": "melanie t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-22", "description": "Win's taken a nose dive.  Varooom.  Walked in on a Friday PM at 5 PM, you'd think you walked into a ghost town.  Where were the people?  Only 1 couple dining.  I used to have to wait in line for take-out or a table at that hour.  Me thinks...bad economy?  Yes, they raised their prices but nothing drastic and definitely not as outrageous as Koi Palace.  A pound of roast pork was $8 and 1/2 duck about $6.   According to a previous reviewer, the place was sold.  Didn't recognize the dude behind the cash register or the butcher behind the glass.  But, I got my roast pork and roast duck in a jiffy.  The duck was fatty but still tasty.  The roast pork skin was crunchy but didn't have the flavor it used to.  I was disappointed, it wasn't the same which can happen when ownership changes.  We'll have to decide on another visit when we do the usual take-out food like chow mein to see how much of a drop in the quality of the food has occurred since the changes.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-17", "description": "i love win's.  aside from the duck and ribs, the dumplings are amazing.  everything is fresh and the people are really nice.  its cheap and good, never a disappointment.  i love the snow peas and garlic as a side, and the dumplings in broth are delectable.", "author": "colin b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-08", "description": "I come here mainly for their duck and roast pork.  I know that that place across the street from safeway on noriega st. is even more popular for their ducks, but I prefer coming to Win's because I think it taste much better and they don't try to rip you off on the roast pork!  (you know how when you buy roast pork at some other place, they would make you pay for an extra piece)  Usually when I get my duck and pork from win's, the skin is still nice and crispy when I get back home.  I also like the soy sauce that comes with it.  It's so yummy when you dip the duck and pork in the sauce and eat it with a bowl of hot steamy rice.  Yum!!!", "author": "Katniss B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-18", "description": "Good chinese food, fast friendly service, big portions, and good prices. Try it, you won't regret it.", "author": "jon p."}
