{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "I tried Wooden Spoon twice with two different people, and it was a hit. It's a cozy little hole in the wall, kind of easy to miss, but incredibly spacious and well decorated inside. The delicious brunch, drinks, and great service will keep me coming back.\n\nFood: lots of vegan and gluten free options\n-Chicken and biscuit dish: Delicious and highly recommended. I was jealous of my friend's order... usually they're jealous of mine :( \n\n-Huevos Divorciados: Served with vegan chorizo, avocado, and eggs. Good, but the chicken dish is better\n\n-Blue Green Smoothie bowl: Contains blue green algae, granola, and fruit \n\n-Soft scrambled eggs: Served with salmon, crispy potatoes, arugula, and fruit. Crab is pictured in some photos, but it's seasonal.\n\nDrinks: \n-The breakfast spritz was amazing and peach flavored  \n\n-The mimosa was just as good \n\nThanks for reviving my brunch cravings, Wooden Spoon!", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "This place is so fun! I love the sunny, woodsy cafe vibes for brunch. The turnover is reasonably quick. The waitlist on a Saturday was decent, and we only had to wait around 15 minutes which is a big win in SF. The food and drink were pretty tasty. I got the margarita and my friend ordered the gin yogurt drink (which was better imo). Food was good, just shy of great. I would come back here though. Service was also a bit on the slower side. \n\nAmbiance: 5/5\nFood and drink: 4/5\nService: 4/5", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Nice atmosphere and brunch vibes! \n\nWhy I was here // I came with my friend and now maid of honor around 10am on a Saturday. I asked her during brunch! \n\nAtmosphere // this restaurant was bigger than I thought and I loved the amount of natural light within the restaurant. \n\nService // very friendly and I love that they came by often to fill water and to check up on how you're doing. We were also quickly seated since we were a party of 2! \n\nFood // \n-my friend got the granola crunch French toast and it was fabulous! The vanilla bean cream on top was to die for! \n\n- she also go a side of potatoes and they were nicely seasoned, crispy on the outside and buttery on the inside. \n\n-I got the house hash and it was delightful! The coconut cream corn was my fave on topped with kabocha squash really felt in season with autumn! \n\nOverall //", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "We had a fantastic brunch here a couple weekends ago! Three of us ordered very different dishes but loved all of them equally.\n\nTHE WAIT: Quoted to be about 45 minutes around 10am on a Sunday (same day as Folsom Street Fair, so it was busier than normal), and we were called about 25 minutes later.\n\nTHE COST: $71.70 before tips for brunch and drinks for three. Very affordable!\n\nTHE SERVICE: Super friendly. Our server was fun and joked around with us a bit.\n\nTHE FOOD:\n\nCOCKTAILS\n* Honey Bee ($10) - 4.5 stars\nDelicious, lightly sweet, well balanced, and refreshing. Enjoyed equally by the boys and girls at the table!\n\n* Stone Grove ($10) - 3 stars\nA bit stronger, but not as tasty as the Honey Bee.\n\nBREAKFAST\n* Swedish Society Pancakes ($10) - 5 stars\nThese were crazy soft, smooth, and moist. The lingonberry jam was perfect with the lemon curd as well!\n\n* Soft Scrambled Eggs ($15) - 4 stars\nPerfectly textured soft eggs, and the potatoes were amazing, with a perfect light crisp. Salmon didn't seem the most fresh, but it worked. \n\n* House Hash ($15) - 4.5 stars\nMy bf saw someone else eating this and knew immediately he had to get it. His instincts were right! The meat was very tender and tasty, and the coconut creamed corn was a delightful pairing. Just a very heavy and oily dish, if you're up for it!", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Open faced Rueben! I wasn't expecting too much but it was a simple recommendation from a friend. This place didn't disappoint. \n\nWhen you walk in you notice the clean, modern, and healthy vibes. Plants mixed with fruits and booze. The bar area is a great place to sit. \n\nI know they are known for breakfast but I was attracted to the lunch menu. I wanted to mix it up. The Rueben got me with the home made sauerkraut. The German boy in me couldn't say no.  It didn't disappoint. The sweet of the sauce with the sour flavors of the pickles and capers was perfect.\n\nTo finish it all off, the fresh squeezed mimosa was perfectly sweet and refreshing. Well done!", "author": "Adam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Delicious brunch spot for all tastes. My brother is vegan and I'm vegetarian and we were delighted, with lots of options for both of us. \nThey have vegan eggs (just foods) and vegan chorizo so they can make pretty much anything vegan. \nBe sure to get the cashew crema (off menu)\nAlso the orange juice is the best I've ever had. Super friendly owner who came to talk to us - I'll be back!", "author": "Sheel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "This place is beautiful & the food was so delicious, I was so shocked! \n\nParking is pretty bad here, there's a lot of metered parking closeby - if you don't mind walking a little there's also some neighborhood parking around the area.\n\nCame here early on a Saturday morning (at around 8am ish) and luckily got seated right away!\n\nBelgian pancakes: MY FAVORITE! So good, the lemon custard is seriously to die for, it was so delicious! It was the perfect balance of tart & sweet. It also came with a raspberry (I think) sauce, which was really good as well. \n\nFor my entree, I ordered the crab scrambled eggs & it was really good. The greens that came with this complimented the scrambled eggs very well!  I loved the garlic potatoes that it came with. (I almost never really pay attention to the side dishes lol).\n\nMy bf ordered the short rib hash which was pretty hearty for me, but my boyfriend loved it! It was pretty delicious and he really liked it!\n\nThe coffee du Nord was pretty good as well, make sure you add the creamer it really balances the acidity! \n\nThis might even be my top fav. brunch place around the area.", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "Came here for brunch after seeing it on the Eater map. \nWe waited for a bit over half an hour around noon on Sunday and ended up sitting at the bar anyways. There's not a whole lot to do in the immediate area while waiting, though Verve and Thoroughbread are around the corner.\n\nTheir brunch menu only has a few items that looked good and we had two of their more popular dishes.\nThe Huevos Divorciados was eggcellent and comes with vegan chorizo which is surprisingly tasty. The dish had the perfect combination of crisp tortilla, fresh sauces, and runny eggs. \nThe Soft Scramble with Crab was less exciting than it sounded. The scramble itself isn't that flavorful and the crab is kind of decoratively sprinkled on top. The side potatoes are really good though. \nThey have a nice cocktail menu. My Breakfast Spritz tasted really watered down with club soda but the bartender swapped it out for a yogurt-based cocktail that was amazing.", "author": "Sharon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Love this spot for its convenient and spacious location, sunny, bright ambiance, and delicious food!\n\nI've been to Wooden Spoon a few times since it opened, and so far my favorite items are the House Hash (the meat is delicious, the corn adds a lovely bit of summer sweetness, and those three sauces mixed together are divine!) and the Dungeness Crab Soft Scramble. The mascarpone just makes the eggs so darn fluffy. I'd pass on their Swedish pancakes and scones, the latter of which are a little unconventional.\n\nWatch out for a wait!", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Really impressed with this place! My bf and I came here on a Saturday morning for brunch and we had a great time. The atmosphere is warm and inviting, service is friendly, and the staff uniform (all-denim) fits nicely with the whole theme they have going on. \n\nBloody Mary: beautifully presented in a tall, skinny glass with a wooden spoon. It's not my favorite, since it lacks the spicy and peppery taste, but it was still good. It has more of a celery taste to it, so if you're not a fan of that, I would try a different cocktail. (4/5)\n\nMorning bowl (added a poached egg): sooo good! I love this. It comes with lots of veggies, quinoa, riced cauliflower, and this delicious pesto sauce. (5/5)\n\nDivorced eggs: great presentation and had a fantastic variety of toppings. Flavorful and filling. Probably one of the best huevos divorciados I've had. (5/5)\n\nI'll definitely be back again!", "author": "Christina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "On weekends it's a mess. On a weekday it's great. Like any great brunch spot if you come on a weekend expect at least an hour wait. My friends and I tried coming on a Sunday and we ended up leaving because of the wait. So I randomly came by myself on a weekday morning, and it was so quiet I had to first ask if they were opened. \n\nI sat at their marbled bar and ordered their smoothie bowl. Smoothie bowls are the new craze. And honestly they're simple but delicious and light. I love their vibrant colors and various healthy toppings, but for their smoothie bowl I feel like it needed a bit more smoothie. It felt like the toppings took up more space in the bowl than the smoothie. I'd recommend it if you want a healthy light breakfast. \n\nYou can usually find free parking a block or two down or there's plenty of metered parking nearby as well.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Wooden Spoon is your classic brunch spot for your typical millenial; trendy ambiance with a nice twist on typical breakfast foods that up the price tag considerably but still find a way to bring people back.\n\nFor me, it was their Market St. Benedict that made it a 4-star over a 3. I can never quite get them right at home; the smoked tomatoes, thick-cut bacon and more importantly the biscuit instead of a traditional English muffin really helped put this benedict over the top for me. The potatoes that accompanied the benedict were crispy af, and that's something I almost never get so A+ there! As a finishing note to the meal, it comes with a small fruit bowl as well and it balances it out perfectly. Other members in my party also were satisfied with their food (morning bowl & huevos divorciados). \n\nThe prices weren't as outrageous as other places I've had in SD or LA; $14 for the Benedict and a base of $10 for the morning bowl with $3 add-ons for eggs, avo and bacon. \n\nParking around the area is hit-or-miss since it really just depends on your luck with st parking. I would advise going on a Sunday morning (~9am is when I went), parking around the area is superb. \n\nOne caveat is that their service can be a bit slowed once the brunch time really gets into full swing, took us an additional 15 min to get flag someone down to get our check once we were done.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "Super cute restaurant with sleek and posh decor. Just like most brunch places there, expect it to get packed on weekends. My friends and I came here around 10:30 and luckily didn't have to wait. \n\nI ordered the SOFT SCRAMBLE. I loved how there was crab inside. It tasted super fresh. The eggs were perfect -- and definitely super soft and fluffy. This dish was very well made. Unfortunately, the portion was somewhat small so I wasn't as stuffed as I would like. I also tried my friends HOUSE HASH. This dish also tasted amazing. The short rib tasted like steak that was fresh off the grill. What a wonderful dish! \n\nI also loved how energetic and happy employees were on a Saturday morning. Like most brunch places in the city, expect to pay $20+. It isn't my top brunch place in the city, but it's still quite delicious!", "author": "Melinda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "I decided to come here because my older brother was telling me good things about this place, not hype-ish stuff, but moreso, \"You needa try this place. The food is delicious, and the environment is very Instagram worthy.\" I mean at least the last part was true. \n\n-The wait is crazy. We arrived around 12:30pm, and were told someone would be right with us when they had time. My brother found the sign-in sheet, and independently did the host's job. By the time we waited for the host, we would've probably lost some major wait time. Flying in from New York and experiencing the superb customer service and Instagram worthiness of brunch spots, I asked the host if we should drop our cell phone number or if we'd receive a text, and to my dismay she said, \"We'll just come out and call you.\" Instead of making people wait outside bored out of their minds, maybe giving customers the freedom of roaming around the neighborhood and coming back when they receive some point of contact would make everyone's lives more efficient.\n\n-The food is alright. A-OK. There honestly wasn't much that impressed me. The food was just food that you eat for nourishment, and not really for enjoyment.\n\nEven though the food was lacking, what really lacked and left a bad taste in my mouth was the service and the waitstaff. We started off with my brother ordering a drink, and by the time our food arrived, the bartender asked if we needed anything else. Yes, the drink we ordered at the beginning, it'd be nice if we could get that. In particular, I felt very uncomfortable under the quizzical looks given from the Caucasian hostess. I caught her staring at me, and being the character I am, I looked back at her, and then she looked back wondering why I was doing the same as her. Maybe because of my age, but it felt like she was wondering what I was doing there. Regardless, it just left me with a bad impression of the Wooden Spoon. Even leaving a $2 tip felt like too much of a disservice to my wallet. I think I'll leave the brunch scene to New York to handle...", "author": "Erica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Brunch review.\n\n4 - HOUSE HASH  \neggs, shortrib, potatoes, pickled vegetables, mustard cream\n\n3 - MARKET ST. BENEDICT  \neggs, buttermilk biscuit, thin cut bacon\n\nOverall, \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Solid brunch spot. Came here on a Monday that I had off from work - no wait. Yay!\n\nOver cooked poached eggs are a deal breaker for me - luckily this place nailed it. Knife went through the egg and out came that delicious runny yolk that I got to sop up with the English muffin and all of that drenched in a yummy hollandaise sauce. The bacon added to the Florentine eggs Benedict was a nice touch. Lattes were delicious. Overall loved this place.\n\nNote: they do have high chairs for the little ones", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Amazing brunch in the Castro area! I was here with a friend on a Saturday morning at around 10am. We put our names on the waitlist, and right when we did, we were actually able to get seated right away! Of course, since it was the 2 of us, it was easier to seat us, but there were plenty of parties that were 2+ so the wait might be longer (but honestly, in SF, when ISN'T there a line/wait for brunch??) My friend got the hash, which was a great savory and hearty dish. I got the granola french toast, and a side of potatoes. The french toast was great, especially the whipped cream, since you can tell it was hand-whipped and had real vanilla in it! The potatoes were awesome, crispy on the outside and cooked perfectly on the inside. The potatoes came with a ranch-like dipping sauce which was equally as delicious. The service was attentive and accommodating. Overall, this is a great brunch addition in the area, and I would definitely come back!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Golly, this daytime place was good. Really good. They seemed fairly well attuned to healthy appetites who want to keep healthful. This restaurant comes from the MacNiven brothers, Dylan and Rowan, who previously opened the lobster roll haven of Woodhouse Fish Company, and their partner, chef August Schuchman, who had been running the kitchen at Woodhouse. They've come up with an all-day breakfast menu that they serve until 3PM which they supplemented with a smaller sandwich and salad selection at lunchtime. I was here for breakfast after my workout at the gym with my youthful trainer. Yes, I really worked out.\n\nEven though the House Hash and the Granola Crunch French Toast both looked tempting, I decided to go for the $10 Morning Bowl, a savory creation which combined quinoa and cauliflower rice with sautéed mushrooms, pickled carrots and red onions, arugula, and spinach (photo: http://bit.ly/2Myvla9). Quite healthy and delicious. Now I could have also gone for the $12 Blue Green Smoothie Bowl with algae, chia seeds, granola, and fresh fruit, or the $8 Granola with Greek yogurt and fresh berries. My point is that they provided gluten-free choices that went well beyond bacon, eggs, and pancakes, which they offered as well.\n\nI felt like something sweet, so I also ordered the $7 Mixed Berry Bowl which was a straightforward mix of fresh blueberries, blackberries, and cut strawberries (photo: http://bit.ly/2KISDZd). That was the perfect chaser to the Morning Bowl. Their $4 Drip Coffee comes from Sightglass, so it was most satisfying (photo: http://bit.ly/2OWFVt8). Izabella was a terrific server and she made my morning with her infectiously attentive manner. Even with an equally new Scandinavian eatery, Kantine, down Market Street, this handsome eatery is the one housed in the Swedish American Hall, same as Cafe du Nord below, and they even serve Swedish pancakes in tribute. Definitely coming back with Jamie W.\n\nFOOD - 5 stars...about as good and healthy a breakfast spot as I would have hoped for\nAMBIANCE - 4 stars...pretty spacious on a weekday morning\nSERVICE - 4.5 stars...like I said, Izabella was a prize\nTOTAL - 5 stars...nice to experience another hit from the Woodhouse team\n\nRELATED - Collection of breakfast and brunch places I've tried and reviewed: bit.ly/2At2LFz", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "Just had a solo breakfast at Wooden Spoon. I was tempted by several of the menu items but decided on: \n\nFRIED CHICKEN & BISCUIT (5/5) -- fried chicken thigh, black pepper-cheddar gravy $15: I did not find the gravy bland as another Yelper did; I found it super tasty, peppery and savory. Chicken thigh was boneless, cooked perfectly, and had to be at least 6 oz. Serious protein, nom nom! Breading was also excellent. Biscuit was spread with a tomato onion jam (?), I think, also very good, and biscuit itself was good. Came with plentiful dressed arugula greens and about a 1/4 cup steel ramekin filled with fresh strawberries and blueberries. I didn't try arugula (looked very fresh), but everything else was YUM. Two thumbs up!\n\nSTONE GROVE cocktail (5+ Bonus/5)-- gin, peaches, apricot jam & yogurt $10: REALLY good. Who knew gin would go so well with freaking yogurt? Maybe too good, if you know what I'm saying. Server asked if I would like another but I demurred as it was before 10 AM ;-) If possible, I'd say three thumbs up for this \"healthy\" breakfast cocktail. Served in highball glass and garnished with what appeared to be a dried apricot on top of ice cubes.\n\nDRIP COFFEE by Sightglass $4 (3/5): I think I've had Sightglass before, but not sure. I get all these fancy SF coffee brands mixed up, between Blue Bottle, Ritual, Four Barrel, Flywheel, etc., etc. I love coffee but this was too acidic for me. I added most of the cream I had and it was okay, but no great shakes. I left most of it behind in the cool diner-style mug. Cute creamer in shape of mini milk bottle with hemp tie around rim.\n\nSERVICE: Friendly, professional, thorough. \n\nTABLE: Clean, minimalist, no flowers this morning, brown paper napkin.\n\nOVERALL: Win, would return with husband and other hungry people. Would skip coffee and go with fruity yogurt cocktail. Cheers!", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Environment: This was my first time here and I must say it won't be my last! I really enjoyed the atmosphere here, which I personally believe, is key to any restaurant.\n\nFood: the portions were really generous, I got the house hash which was delicious!! I recommend it.\n\nService: the people were really friendly and welcoming. :)", "author": "Alex W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "We had to wait for about 35 mins to get in AND they made 3 errors with our order and I am STILL giving them 5 stars!!!!\n\nThis place is relatively new and only open for breakfast/brunch and lunch.\n\nNext time I am going to ask to wait the extra time to get a coveted seat at the inner counter where you can overlook the kitchen.\n\nWe ordered the short rib hash withOUT avocado and asked for an extra egg. (we got it with only 1 egg and with avocado, which actually was a super good compliment to the dish). We also ordered the swedish pancakes and a orange juice. The juice arrived about 3/4 of the way through our meal, and we told our sweet waitress before that just to cancel it b/c it was coming in so late. She said she would not charge us for it (but she did) and they charged us for the avocado. It was all so delicious - we just didn't make a stink about the bill being wrong - we just paid it. ($50 including tip)\n\nTHIS PLACE is 99% as good as my absolute favorite Plow - but with 50% less wait time, and closer to my house. I hope it stays not super crowded - but I think the word might get out. \n\nThe short rib hash, included HUGE pieces of melt-in-your-mouth short ribs - LOTS of 'em - and crispy potato wedges with 2 kinds of sauce at the bottom of the plate... WOW  (and another WOW).  The Swedish pancakes were some of the best I have ever had, I would have liked them served with some butter and maybe double the portion of lingonberry jam, but yummers all the way.\n\nCan I go back for brunch again tomorrow???\n\n(tip for the owners - Ella's on California & Presidio used to be great & is only a block from my house, the owners have changed in the past year, and now it stinks - can you PLEASE tell them what you are doing right??, or better yet - take it over and replicate Wooden Spoon!!!)", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "If you like brunch food and Instagram-worthy photos, then this is the spot for you!\n\nMy friend made reservations for a party of 5 people. The waitress said that since the tables are small, groups of 5 or more are usually more difficult to accommodate and will require longer wait time.\n\nI ordered the soft scrambled eggs which comes with dungeness crab, smoked bacon, mascarpone, chives, potatoes, some berries, and half of an avocado (because millennials love their avocados haha). Everything was delicious and I really enjoyed the crab on my eggs. The prices were pretty reasonable for the large portion sizes. I tried a piece of my friend's pancakes and they were so fluffy and delicious. Everyone really enjoyed their food options.\n\nNotes: The restaurant isn't really big. Make sure to make reservations ahead of time for large parties! There's a bar at the front of the restaurant. It's kind of loud inside, so you might have to talk a little bit to the people in your table. The interior design feels very homey. There are wooden spoons in picture frames all around the walls haha. The restrooms are interesting. There's a women's restroom with two stalls, two separate unisex restrooms, and a men's restroom (I think). I feel like most brunch places in SF have one unisex restroom, but at Wooden Spoon, you wouldn't need to worry about waiting in line to use the restroom. The service was excellent and the staff were friendly. Since the restaurant is located on Market Street, parking can be difficult to find in that area. Make sure to look into other alternative transportation methods, such as, Uber or Muni to get to the restaurant. I would definitely come back here to try the other items on the menu!", "author": "Sylvia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Here in the Castro, brunch is the most important meal of the day so a new brunch spot is always welcome... but subject to much judgement. Fortunately, Wooden Spoon lived up to the hype for us. Why?\n\n-Only a 25 minute wait and first come first serve seating at the bar\n-More than just Mimosas and Bloodys (I had a breakfast Spritz!)\n-Ok but the Bloodys are REAL good. \n-Dungeness Crab Soft Scramble yaaaaaaaas\n-Not a huge fan of breakfast potatoes (i'm a bad Irish person) but theirs were delightfully crispy and I totally ate some\n-Swedish Society pancakes which are deliciously lush but thin enough that you don't feel *that* bad about yourself\n-Fast friendly service\n\nWelcome to the hood, Wooden Spoon! Reduce your wait time and i'll be there regularly!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "This is my new favorite brunch spot, hands down. I'm not sure how long they've been open for, since they have just over a 100 reviews, but they deserve so much more! \nTheir pricing is SO REASONABLE for being in SF, which makes this place that much better. \n- House hash: Amaze! Love the tenderness of the short rib in this \n- Soft Scrambled Eggs: MY FAVORITE - I love the crab mixed in with eggs in this, and the sides of salad and fruit are so good!\n- Blackberry Bramble and Bloody Marys for drinks.. a MUST GET \nThe staff here are so attentive and the bartender is great! (also good-looking too lol)", "author": "Julia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Loved this place! My husband and I stopped here for breakfast and we really enjoyed the ambiance of the restaurant. We ordered the Granola and the Big Spoon-- plenty of food for the both of us. Our server, Izabella, was excellent!! She was super polite and provided excellent service-- thank you!", "author": "Maja K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Great breakfast. The outside does not do justice to what lies inside. As soon as you own the door you are greeted with a busy bar area, and then further back the restaurant opens up into an open kitchen and more seating. The breakfast menu is large, innovative, and priced reasonably. I found many things I could have ordered and it's easy to add on sides. \n\nThe food was well prepared and included nice touches like edible flowers. The soft eggs with crab I ate had a large amount of fresh crab. The juices were fresh squeezed. \n\nThe restaurant is impeccably clean and I even saw people cleaning while I was there. The service was great. Genuine, calm, attentive, and eager to help. \n\nThis will be my new go to breakfast place.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "I'm part of a \"ladies who brunch\" group. These brunches don't happen as often as I'd like given our horrendous work hours, but when they do, they're pretty darn awesome. Enter 5 ladies into WS.\n\nWS had an airy, open vibe, rare for the city. It was lively with a hustle and bustle that was friendly.\n\nThere were plenty of dranks to be had - mimosa, breakfast spritz, coffee du nord (irish coffee), and more. Some of us double fisted and had both an eye opener and some regular coffee. The mimosa wasn't necessarily memorable, but I remember a decent balance of alcohol and juice.\n\nWe shared the French Toast, which was the highlight of brunch. The brioche was fluffy with just a bit of crunch on the edges, topped with a very light whipped cream. The cream was a delightful addition as it was just slightly sweet and very refreshing. I'm generally not a fan of whipped cream, so this took me by surprise. Dusted on top were toasted granola and fresh strawberries and blueberries. There's maple syrup on the side if you want things even sweeter.\n\nFor something savory, I had the Huevos Divorciados. It was decent, although I've had more flavorful and probably more authentic versions. The dipping sauces were neutral to me, and the black beans and soft eggs were the same.", "author": "Cici T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-11", "description": "Uh oh - the dreaded under 100 review yelp score distortion strikes again.\n\nA friend and I had an absolutely horrible experience there yesterday for brunch.\n\nFull rundown:\nThe good: cappuccino; the space (which is basically just Aatxe so no credit to Wooden Spoon for that)\n\nEverything else:\n- Lemon spritzer gross - barely fizzy water, with lemon. Not the right flavor profile at all. Underwhelmed. Sent back and then awkwardly had a person that never identified himself challenge us about what was wrong. Not a friendly \"hey! we're new, would you mind explaining what was off so we can fix it?\" Rather \"Hey. What was your problem with the spritzer?\" Uh. YOUR problem is that it was nasty. It was just barely fizzy water with lemon in it. Not a fizzy lemonade, not refreshing or appetizing. How does someone get a lemon water type beverage wrong? Not sure, but they succeeded at doing it.\n\n- Scone - gross. They said they were baked in-house but something off. Perhaps baked previously then rebaked or reheated. Too crumbly, slightly burnt taste, too dry. Also, they brought us the almond scone initially even though we ordered the lemon. No apology for that, just an eye roll.\n\n- Service weak - 20 minutes in and sill no utensils or napkins - even though starters and drinks served.\n\n- Benedict not good - watery because of tomato, couldn't taste hollandaise at all, bacon overcooked, biscuit mushy - would be better with a traditional English muffin. \n\n- French toast basic, soggy (but best thing we had)\n\n- Fried potatoes good\n\n- Fruit had little fruit bugs on it. Likely just not rinsed.\n\n- It was telling that they just brought us the check and didn't ask how anything was.\n\nOne and done. Wish we'd left after the scone and lemon drink nastiness.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Arguably one of the best breakfast I've had in San Francisco. I need the recipe for that French toast . Also had the short rib breakfast hash. And bacon. we practically licked our plates!", "author": "Cerraeh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "For one of my last brunches in SF, my friend and I decided to check out the new Wooden Spoon! The space initially seemed small, but the restaurant extended as we kept on being led further into the space. There is bar seating, and plenty of table seating. And the interior design is lovely! I can see this place being super popular. It was already semi-crowded for breakfast on a weekday, so was already pretty impressed.\n\nThey serve Sightglass coffee for a slightly steep price of $4. My friend and I split the Swedish society pancakes with huckleberries and a lemon, and the house hash with eggs, short ribs, potatoes, pickled vegetables, and mustard cream. The food was really good! I enjoyed the swedish society pancakes more. It was the perfect balance of sweet and savory. I also enjoyed the house hash and the mustard cream sauce was delicious! My only suggestion was to have the short ribs made a bit more tender. But overall, a really great breakfast and would def come back! And pricing was pretty reasonable apart from the coffee!", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-29", "description": "Came back and got the morning bowl ($10) with avacados ($3), Swedish pancakes ($10), and the stone grove ($10). The food and drinks were good. The service was left to be desired. The girl at the front with a blue lace top and jeans did give me and my sister the look as we did not seem to \"fit\" the certain clientele that eat here. Knowing that look, I looked back as I am not intimidated by anyone. I immediately had a feeling she was new as I have come since the opening of Wooden Spoon and the original staff have always been kind and appreciative. The current staff is a mix of opening staff and new hires. Every other staff was good, but that one girl.", "author": "Wesley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Love the vibe that Wooden Spoon brought to this space. We came for brunch. The menu is not crazy extensive, but I think offers something for everyone. I got the House Hash, the short ribs were flavorful and super tender, and not crazy rich and heavy. I loved the sauces at the bottom, really tasty! Potatoes weren't as crispy as I'd like, but I think that's what they were going for because the potatoes with the Market St, Benedict has a nice crispy edge. But so much food! I tried so hard to shove my face but still couldn't finish. Prices are pretty reasonable too. I'd definitely return!", "author": "Nana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "We had a great Sunday brunch here! The service was very good and the food was excellent. I ordered the eggs Benedict with a side of chicken apple sausage. The Benedict plate was a lot of food and well balanced with a side of arugula, potatoes, and fruit. I asked for a side of the mustard creme fraiche with the potatoes, as well. I highly recommend asking for that as it goes really well with the potatoes. My dislikes were that the English muffins weren't toasted and the hollandaise was a little too lemony. The chicken apple sausage is very, very good so if you like breakfast sausage - get it! The space itself is pretty small, very loud, and has little airflow so it was really warm inside. The adult beverages looked reasonably sized but I had the lemonade spritz which, at $5, was in a tall skinny glass with a lot of ice so it was roughly two drinks-worth and not worth it.", "author": "Alissa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Came on a Saturday morning for a weekend date with my husband!\n\nWe arrived at 9:30am and got a table immediately, but by the time we left there was a line out the door! So definitely get there early if you can. \n\nWe ordered the Granola Crunch French Toast, the Little Spoon, and a latte. The food was delicious and came with really fresh fruit, too. \n\nSuper cute inside, good food, great service, good location. Be sure to get there early to avoid long lines!", "author": "Sunnah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "Delicious spot! We had a bit of a wait, but for 9:30am on a Saturday to be expected. The staff were friendly and helpful and the food was delicious. They were able to satisfy myself (a vegan) and my cousin (an omnivore) quite well with deliciousness from start (mimosas and lattes) to finish. I'd definitely return.", "author": "Eve V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "I've been here several times. Once was on a date; he said this place would be his new go-to brunch in SF, and we hadn't even sat down yet! Shame it didn't work out, cause he's clearly got great taste.\n\nWooden Spoon is beauty and brains. A truly gorgeous space -- modern, fresh flowers everywhere, lots of light, impeccable yet minimalistic decoration. Airy and open and even when busy never feels crowded. \n\nThe experience is only enhanced by the food. Soft scrambled eggs were packed with large chunks of crab and was so smooth and tasty. Shared the French toast both times I was here, which is also divine -- crunchy, just the right amount of sweet. Cici T. in her review called me out for double fisting a regular coffee (Sightglass, yum) and a Irish coffee (appropriately boozy!), which I'd do again, and you should too.\n\nThe staff are all lovely, incredibly attentive, infinitely patient, and felt like friends at the end of the meal.\n\nOverall a great experience every time, and the reasonable price point ($$) and wait (20-30 min on a weekend) are the cherry on top. Get in here now though before it reaches Zazie-esque levels of fame (though IMO it has surpassed the former as the King of Brunch in SF) and the wait inevitably explodes.", "author": "Nami T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Great service and great food! Saturday brunch is always tough, but the usher and waiters here try to make it as easy as possible. I put my name down at 12:45pm and was seated at 1:30pm, so not too long of a wait after busy morning hours. My friend ordered the House Hash with eggs, shortrib, potatoes, pickled vegetables, and mustard cream. I ordered the Huevos Divorciados with eggs, house made vegan chorizo, avocado, crema, and black beans. The portions were huge! We both enjoyed our dishes, though the chorizo in the huevos divorciados was too salty. We were pretty satisfied with the service and food here and will likely visit again.", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "After a long week of work in SF, I finally had the weekend to myself to enjoy the sites, the food, and my friends. My bestie and I found Wooden Spoon on Yelp and after taking a look at the photos of their food, we decided this would be the place that we enjoyed brunch. We walked over, put our name on the list, and relaxed outside until our name was called. \n\nEventually we took a seat next to the window in their main dining area. It was bright, the window was open and there were little wooden kitchen utensils up on the wall. It was all very cute and inviting. Our server came over right away and we knew instantly that we needed mimosas. While he worked on the drinks, we explored the menu. Everything looked good but I settled on the Blue Green Smoothie Bowl and my friend ordered the Market St. Benedict with a side of sausage. We also agreed to split the pancake, you know... for dessert! My smoothie bowl was vegan and gluten free (score!) and included banana, pineapple, hemp seeds, and seasonal fruit. It was so freakin' fresh and colorful, I loved it! The flavors were strong but it wasn't too sweet at all. I would definitely get it again. Once I was done with the smoothie bowl I enjoyed a few bites of the pancakes. I didn't indulge too much but I can say that they were really fluffy and the syrup was a perfect pairing. They were certainly a dessert to the meal I had. \n\nMy friend and I really enjoyed our time here at the Wooden Spoon and if I lived nearby I could definitely see myself coming here more often. There are several other items on the menu that I would to try and the service was great. Our server really was awesome and contributed to our entire experience, which was... 5 stars! Whoop whoop!", "author": "Jayme H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Oh.. my.. god. So good. Got the morning bowl and I'm hardly letting myself breathe in between bites. Healthy and delicious. Servers are nice. Place is clean with nice lighting. Prices are not bad! After living in a small town with few options of good food and coming here- feels like heaven.", "author": "Scout L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "Came here first thing Friday morning. \nI ordered a granola bowl with honey comb  really good. I usually order bigger plates but I glad I went with a healthier and light option for breakfast. I also had their fresh oj. My bf has their Benedict's. Mmm soo good. The biscuit and the bacon had perfect crunch to them and the potatoes were fried perfectly .", "author": "Nena O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "New brunch spots in SF are always exciting for me, especially now that I'm a tourist to SF and not a resident. Came here with my ex roommates and the waiter was talkative and helpful in assisting us with our decision. \n\nI ended up getting the short rib hash because I was craving meat and potatoes and omg the short rib was so tender. The kind of thing that melts in your mouth and topped with a poached egg, this was amazing! The pickled veggies and sauce the dish came with were surprising for a brunch place, very intricate flavors. Would come back to try more things next time I'm in town!!", "author": "Hana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Great Food. Great Customer Service.\nGreat Ambiance.\n\nThe brunch food was delicious, the coffee was decent, but the thing I want to remark on is the great customer service. It was a crazy day for them and the bartender forgot to make my latte and there was a delay with some of my food, but the way he handled it impressed me. As soon as he realized he was very kind and apologetic. Then he got it to me right away, and when the bill came he applied small discount without me having to make a fuss. The whole experience was pleasant and amicable and resulted in me not minding at all about the mixups. Mistakes happen sometimes, but most restaurants do not even try to make it right unless you make a big stink about it. I would have probably just let this slide but been displeased by the establishment, but as it stands I am very happy with them and would happily return.", "author": "Tara T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-01", "description": "As a frequent solo diner, and a person who actually likes to do so, I like it when places treat me no differently than any other diner there. \n\nThis place, well it needs some work for the solo diners friends. I came in around 1:30 pm on a Saturday and they were packed. \n\nI ended up getting seated next to the kitchen which is honestly a favorite place to be seated. Also, the only other solo diner was sitting next to me. \n\n1) waitstaff coming by as I was getting situated for ordering. Sure, the guy next to me may have been sitting there for a few minutes, but I just got there. Please know when people are getting seated because the waitress was a little annoyed at me when I wasn't ready. \n\n2) I ordered a drink. Got delivered to the guy next to me who sent it back. 2 minutes later, drink came to me. \n\n3) scone that I ordered was kinda delivered to him instead of me. Not a big deal, but it would be nice if your wait staff knew where ppl sat and what they ordered. \n\nThe food itself, well it was good. The house hash was great with short ribs, egg and potatoes. It jus came with a large amount of cream that I think covered all the flavors of the dish. I think the cilantro or parsley oil is enough. \n\nCurrant scone - on point. \n\nAs a solo diner, I like going places that make me feel just as welcome and appreciated as everyone else.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "One of my favorite new brunch spots. This is a newly started San Francisco treasure that is quickly picking up in popularity and for good reasons too!\n\nFirst off the decor in the place is very tasteful. Modern and simple. Open and inviting. Just the right touch of greenery gives the place a sense of elegance that really leaves you shocked to see how inexpensive the food is priced.\n\nThe food is beautifully displayed. Everything is well thought out. When you have your first bite of anything (I have been twice now and tried 5 entrees amongst friends), you are surprised out how well spiced and balanced the food is. I am used to dousing hot sauce and condiments on everything and this is one of the first places where that is just not necessary. Again the price scale for such freshly made great dance of ingredients is shocking.\n\nLastly, the service is unforgettable. Everyone is charming and welcoming. You feel so at home, like you are having brunch at someone's house. Kat has been my server for both visits, and is exceptionally sweet, thoughtful, and friendly. She remembered my name coming in the second time and even remembered all my weekend plans with my friends (which was weeks back!). \n\nThe only thing you need to be wary of is for some reason it can be abnormally hot in there. I have been luckily places by the windows every time but I am not sure how well I would do on a hot day being placed anywhere else. However, with all the other great things there are to rant about this place, I will be a returning guest regardless. I am hoping they can fix the stuffiness!", "author": "Louis P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "I got the Benedict and let's just say everyone at my table was jealous. But honestly, every meal was so well thought out and plain delicious!\n\nWould def go back if we are ever in area again.", "author": "Paulina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Sooo bomb I want more. More!!! Can't wait to come back. \n\nHouse Hash: that mustard cream sauce and whatever green oil/sauce thing on the plate was perfect for the short ribs on this dish. Oh my lord.\n\nHuevos Divorciados (v): couldn't really taste the vegan chorizo but that egg and that verde salsa, lord!\n\nTip: first come first serve at the bar. Quicker than their waitlist. \n\nDefinitely coming back!", "author": "Alicia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "5/5: Food\n5/5: Atmosphere\n4.5/5: Service\n\nNew favorite brunch place!!! Super cute place and the food options are great. I'm not an eggs person per se but I got their crab omelette and it did not disappoint. The portions were large also.", "author": "Terrie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-26", "description": "Small, clean, modern, nice place to go for brunch", "author": "Faye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Great drinks & breakfast! Not overly crowded on a mid Saturday morning. I'd definitely visit again!", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "A solid brunch spot!  Attentive and friendly service.  Hostess and waitress were totally helpful and welcoming.  The food was excellent.  Everyone in our party enjoyed their meal.  There was a mixed up in our order and the staff were apologetic and willing to help fix the issue promptly and comp the meal that came way after the rest of the group finished theirs.  It made up the disappointment and we truly  appreciate the go-beyond customer service.   We tried the market Benedict which was perfect in terms of the taste and texture; the big spoon was decent; the soft scramble egg was right on; corn beef sandwich was beautifully presented and flavorful.  Oh and don't forget to get the granola crunch French toast as an end note to a flawless Sunday brunch. We will definitely be back to try the other items on menu", "author": "Janita s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "My friend told me about this new spot in the neighborhood and we joined for brunch earlier today. Great atmosphere, everyone is super nice and the food was delicious and well thought out.\nPresentation was fantastic on all plates that I saw at other tables around me.\n\nCurrently they are walk ins only which we only waited around 15 minutes for a party of 3.\nI had the hash on the menu which was absolutely great and it's their \"rustic\" take on a hash. I did witness another table ask to take away their plate because it's not a usual hash that you expect to get at a diner, this is definitely a more polished tasty version.\n\nI'm definitely bringing friends and visitors if they are looking for a new spot to brunch.", "author": "Albert Paris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "Pros: cute space, pretty yummy food, great value \n\nCons: long wait, long wait once seated, slow service, bland (BLAND) gravy", "author": "Guinnevere C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Fantastic food fantastic service. Got the soft scrambled eggs and hash. Mimosas were brilliant and crisp. I would highly recommend for either brunch or lunch!", "author": "Kristine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Seriously have nothing but good things to say about this place. Here's why I loved it:\n-Chairs with backs; no barstools!!!\nEntire Restaurant is bar seats (two \"bar\" areas...one with alcohol, the other is a view of the kitchen.) one high communal table and one set of chairs and a table facing the wall. Important to note that all chairs have backs!!! No bar stools, which is so important. The way my back is set up...I can't eat a whole meal on a bar stool. \n-Vegan chorizo!!!\nI love huevos rancheros but I've literally never had chorizo because I don't eat pork. Their huevos are NOT VEGAN (cause eggs...) but the chorizo IS and it's house made.\n-Excellent curated wine/alcohol options\nThey have rose from Scribe (a place I love), deep eddy vodka, Junipero Gin and a few other specialty liquor options. They also have fresh squeezed OJ from a machine behind the bar and I had a lemonade spritz (non-alcoholic) that was fantastic.\n-Chill place for a solo meal with your computer\nI went at 11am on a Wednesday and there were two people working quietly on laptops while watching French toast etc and no one bothered them. \n\nI absolutely recommend this place and will certainly be back nexttime I'm in SF.", "author": "Brea E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Best brunch i have ever eaten. Ordered the House Hash and WOW. It was absolutely amazing. Hostess said it would be a 35 minute wait, but we waited for about 15 minutes. I was so hungry I didn't even take a picture and I devoured my plate. Drip coffee wasn't good. Wouldn't order that again.  Would definitely come back when in town again.", "author": "Cindy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Just got brunch here - the food was great (we had the granola French toast and the house hash), and we were happy with the service. Always a long wait (you put your name on a list and have to wait there in person to be called) which is why it took us a bit to try it out.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Adorable staff and yum food. Great new addition to the neighborhood.\n\nI'm an omnivore, but it's surprising how many (good) vegetarian dishes they have, so any veg folks aren't just stuck eating one same old dish.\n\nHighly recommend the biscuits and gravy.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Excellent food and good ambiance. Not too long a wait for SF Brunch and   great food and service. One of my favorite brunch places in the city.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "I can tell you one thing ... even if you do not believe me ... try the blue green smoothie bowl!  Banana, pineapple, hemp seeds, buckwheat granola, and assorted fruit totally work!!! It was super filling and it was super good!  I now dream of that granola!\n\nI also had a side order of bacon (yup I'm a bacon eater) and it was perfectly crispy ... and the perfect portion size for someone who's a bacon eater.  Ok so I now dream of that granola and that bacon.\n\nI ordered the Lemon currant scone - - this one was more Irish than English ... more soda bread than soft cake - - and I wasn't a fan - - but that is a preference issue - - because it was perfectly well prepared, just not to the way I like it.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Went to wooden spoon today for brunch and ordered the yogurt berry gin cocktail and the pancakes with the lemon and jam...FANTASTIC. Loved the ~vibes~ of the restaurant, the lovely service, and the great food. The prices weren't too bad either. I highly recommend this spot!", "author": "Manuela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Rustic charm and plenty of brunch options! They stay true to the theme of Wooden spoon.", "author": "Sebastian L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-03", "description": "It's my fourth time eating here. I had high hopes, but each time I visited the service has been poor and the food has been mediocre at best.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "We were visiting San Francisco and.had an Excellent meal here. The wait was about 45 minutes on a Saturday but we were able to snag a seat at the bar and avoided the wait. The coffee was good as well as our food! I had the Eggs Benedict and it was fabulous!", "author": "Viki W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-11", "description": "Unfortunately, we were really really disappointed here. We walked by on Sunday morning and the line to get in here was out the door, so we decided to come back a few days later on a Thursday morning (no wait!). \n\nThe man at the bar was super friendly. That's about as much as I can say for the \"pros.\" \n\nWe ordered the smoothie bowl and the morning bowl, and both were a complete disappointment. The smoothie bowl was gritty and tasted a bit sour, while the quinoa bowl was slimy and flavorless. The only positive part of either of these meals was the granola on the smoothie bowl. The granola was great. \n\nThe service was also really, really slow. Not because it was busy (it wasn't), but just because the waitress never came back to us after giving us our food. She didn't check on us at all, meanwhile she visited the tables around us several times. We were never asked if we needed anything else or how the food was - just asked if we wanted the check (finally) 30-40 minutes after we were served. \n\nI'm sure other items on the menu were MUCH better than what we got (the table next to us had pancakes and French toast that looked delicious), but what we got was pretty much unpalatable - neither of us came close to finishing our meals.", "author": "Hannah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Great brunch spot on Market. The drip coffee is excellent and I love that they have so many vegetarian options! I'd recommend both the huevos divorciados and the biscuits and gravy. The house-made vegan chorizo had a really nice, interesting, roasted pepper (?) taste to it, which made it a lot better than any of those wannabe meat knockoffs you'd usually find elsewhere.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Everything I had was well made and delicious!\nI particularly loved how refreshing the blue and green bowl was - flavorful and not too sweet.\n\nI try not to write useless reviews. In this case, I had some insights on one of the dishes I had. The little black things on the blue and green bowl aren't fruit flies, as another reviewer feared. There's a little sprinkling of seeds and dark blue-green algae on the fruit, not bugs, on my honor as a bio major. I could see how someone without glasses might think they were something else, but if your eyesight is better than 20/80 ;) you'll be fine. I loved the crunchy toasted granola.\n\nMy friend and I later enjoyed the flavorful brisket hash with mustard sauce and the huevos divorciados, which happens to come with a vegan chorizo patty.\n\nThe staff are cool, and it was fun to watch the chef get in the zone. He is like the Steph Curry of their kitchen.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "We had the - \n\nSwedish Pancakes huckleberries, lemon - extremely authentic and delicious (I'm Swedish!)\nCorned Beef Open Face sandwich with house made sauerkraut, Russian dressing, capers, cornichon - so insanely good, such a great play on Scandinavian concept but Jewish Deli flavors.\nHouse Hash eggs, shortrib, potatoes, pickled vegetables, mustard cream - o.m.g. all my most favorite flavors, so good, the mustard cream is the most fancy swedishy sauce I've ever had. \n\nGreat prices, great service, great ambiance.", "author": "Kjerstin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Visiting from out of town I came here with my boyfriend on the way to Muir Woods. I yelped around and this place showed up so i figured why not, and I wasn't disappointed. \n\nTheir only faux pas was when we were doubted(?) for trying to grab a seat at a table. We walked in and the friendly waitress told us to find a seat at any table so we started to look around. Then another guy who was wiping tables, started questioning us as we were discussing our options. I told him we were told to grab a seat and he replied, \"without menus?\" As if we were making this up and just wandering around for fun. But I get it, I work in the industry and people annoy me when they think they can just do what they want. I could tell it was a miscommunication though and everything else ran smoothly. \n\nOur waitress was phenomenal and the food was fresh and delicious! We both got the crab scrambled eggs and we were very happy. I had a few mimosas made with the fresh orange juice and it was delicious. All in all I was so happy with everything and very pleased with this little gem I found on our trip. I definitely recommend it to anyone coming through!!", "author": "Kaela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Came here on a Saturday morning for breakfast. We tried to make reservations but couldn't. So I we went early at 10am. We managed to get a table right away. We sat down and were right away treated by a friendly server. By a few minutes later there was already a line forming. He brought us all coffee thank God in a timely fashion. The coffee was pretty good. The ambiance was energetic and fun but chill enough we could have a good conversation with our friends from out of town we hadn't seen in ages. Menu was pretty diverse with lots of veggies options. I had a hard time choosing. I ordered the heuvos divorceados which was basically hard taco shell with eggs, salsa of various varieties and black beans. It was darn good. My friend ordered the avocado toast which was massive and she had trouble finishing. Over all the food was good and for breakfast for four people we only spent around 100 dollars. Value for money in San Francisco it was great.", "author": "Anne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Stopped in after seeing the great ratings. One of the best meals I've had in a long time. I ordered the breakfast bowl (spinach, grated cauliflower, quinoa, etc. with two delicious sauces) and a negroni. Food and the cocktail were delicious, service was great, atmosphere clean and relaxing. Would definitely recommend.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Had a DELICIOUS and gorgeous brunch on a Sunday morning. Still thinking about those super authentic Swedish pancakes (THAT LINGONBERRY JAM!!) and their brunch hash. Also tried the corned beef open-faced sandwich and some crispy potatoes in the side. \n\nThe table next to us had an enviably gorgeous granola bowl, and given how tasty everything was I'll have to go back to eat through more on the menu. \n\nStaff was super friendly, space is bright and fresh and cozy, and we had a fantastic time.", "author": "Celina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Wow. You need to come here. Seriously best breakfast I've had in a long long time...maybe ever. Not joking. The hash with the short ribs was completely and ridiculously amazing with a generous amount of huge boneless pieces of melt in your mouth short ribs with potatoes and an amazing creamy sauce. And the eggs Benedict. Don't get me started. The hollandaise is second to none. Service was fantastic. The atmosphere is modern but homey and the exposed kitchen highlights the talent of the chef's. And...the coffee was even good! Not over roasted...very smooth with the signature tart kick of a coffee that had been roasted correctly. Come here!", "author": "Larissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Still a hidden brunch gem so you better try it ASAP! No line on a Saturday around 10am and the food was exceptional. We loved our orders of the soft scramble (which had crab and bacon in it!) and the big spoon (with egg, bacon, toast, potatoes, pancakes and fruit). Service was great and I can't wait to return and try out all the other delicious things on the menu (I.e Swedish pancakes or the short rib hash)!", "author": "Joanna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "OMG. I would give this place a 10 out of 5 if I could. FOOD: AMAZING-got the soft eggs with crab, huevos divorciados, brioche French toast, and granola yogurt. Everything was a 10. High quality ingredients. The handmade whipped cream was the best I ever had. I didn't even have to use syrup on the French toast. My 2 yr old can be picky so they separated all the components of the granola yogurt for her and she had fun combining them. SERVICE: Friendly and knowledgeable. Spot on recommendations and promptly brought out my daughters food first (parents know how important this is).  FACILITIES: modern, well designed (even to the flower arrangements), clean, large bathrooms, and environmentally conscientious.", "author": "Maryam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Went here on a whim to meet some friends for brunch, our friends with a toddler were running late, but the staff let us sit anyway and were suuuper accommodating to the fact we needed a bigger space for the little one coming. We started with the Bloody Mary, really solid good flavor with a kick. My husband and i had the soft scramble with Dungeness crab, with bacon, salad and fruit... servings were good sized and the scramble was super good. \n\nSpace is a little cozy but awesome, service was great, and food was excellent. Will def be back to try the crazy looking French toast everyone was ordering.", "author": "sarah s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-19", "description": "Had brunch there by chance.  We were in the neighborhood and walked around looking for a decent restaurant for brunch.  The food was excellent and the service was very good.  Would have given them a 4-star, but...  When we stopped there, the staff said a 20-minute wait, but it turned into 45 minutes instead!  I was about to leave when my name finally got called.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "This place is great!  Went for lunch today and tried a bunch of stuff, everything was amazing!  Staff was friendly and helpful with the menu.  The French toast was incredible and my husband loved the soft scramble.    We will definitely be coming back many times!", "author": "Erin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "Breakfast/brunch is my favorite meal so I am constantly on the lookout for new spots that offer regular breakfast fare with a twist.  I think Wooden Spoon is one of them.  Had the soft scrambled with crab and the Morning Bowl.  The soft scramble was perfect.  The surprising item was the Morning Bowl.  The cauliflower rice was so delicious.  Not sure what they put in there.  I added an avocado.  May add a fried egg next time but it was a very satisfying meal and guiltless.\n\nMinus one star as they brought my coffee with no spoon to stir the milk + sugar.", "author": "Mei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Had a fantastic brunch this weekend at a great new breakfast/brunch/lunch next door to the Cafe du Nord. Four of us ate family style and tried the Blue Green Smoothie Bowl (healthy goodness), Swedish Pancakes (traditional awesomeness), Market St Benedict (delicious!), Huevos Divorciados (uniquely amazing) and the incredible House Hash (my favorite)! All dishes were excellently prepared with perfect seasoning and taste. No complaints on any of the dishes, just huge praise! \n\nAs for their cocktails, best brunch drinks I've seen in a long time. The Breakfast Spritz was refreshingly tasty but my favorite was the Blackberry Bramble. A gin infused smoothie the was the perfect combination of sweet and tart. Delicious! \n\nStaff knowledge and service was top notch so I will  go back again and again. This neighborhood needed a great brunch spot and it got one with Wooden Spoon! Kudos!", "author": "Cary D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Highly recommend this new brunch spot! Service was perfect. I had the Blue Green smoothie bowl (pictured below) and i will definitely be coming back for it again. Also had a side of bacon - which is extra thick and cooked perfectly!! Oh and the coffee was really really good!", "author": "Tara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "A gem.  I'm happy about this place in our hood that doesn't have lot of good places. Awesome food and coffee. I'll definitely come back again", "author": "vadim m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "We liked this place. A lot. Solid brunch. I got the soft scrambled eggs with Dungeness crab, bacon and marscapone, bf got the big spoon, which came with eggs, bacon, potatoes, pancakes and toast. My scrambled eggs were creamy and rich, with a solid amount of jumbo lump crab (yum!). The potatoes were to die for - halved potatoes perfectly deep fried and tossed with salt. Both of our meals came with a small cup of berries, which really rounded out the meal. I felt I was getting allllllllll the food groups. Iced coffee was tasty, and we didn't have to wait for a table. I felt like all the ingredients were top quality. \n\nOur one extremely minor complaint? Pancakes were a little too fluffy for us. We will be back and we will be trying the open faced sandwiches. We had a little bit of food envy when we saw those go by.", "author": "Brigitte J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "I had brunch here on a Monday morning and the place was packed! really enjoyed the smoked salmon scramble and the Hash was really tasty as well. Service was on point as well, I can't wait to try the rest of the menu. So many details are on point, the bathrooms are clean and the open kitchen is a cool touch to the space.", "author": "August S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Everything was top notch.  Service - fantastic.  Aesthetic​ - beautiful.  Food - delish.  Juice and cocktails - on point.  \n\nI'll be coming back.", "author": "Josh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "Wooden Spoon is one of my favorite brunch spots in SF. Warm, cozy, really friendly people working there, and a great menu. I was a huge fan of the Dungeness crab soft scrambled eggs. I noticed they took it off the menu recently, but I really hope they bring it back when crab season returns. That dish was the best! The fried chicken and biscuit is also really delicious, and recently tried the salmon soft scrambled eggs. Another great dish for sure, though my heart is still with the crab.", "author": "K S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "So happy to find this place! The pancakes were solid. Light and fluffy. I could have been happy with just two. \nThe Swedish pancakes were light and crepe-like with a crunchy crust. \nBut the real standout was the House Hash. Short ribs? Win. The mustard creme was a mystery to me when we ordered it, but it melded the potatoes and short ribs perfectly. Amazing. I'll be back!", "author": "Craig d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "Long wait. Unapologetic hosts. Slow service. \n\nThey skipped over us and provided no explanation for why they did it nor any apology. \n\nFood was good though", "author": "Rey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "I came here for breakfast everyday when I was in San Francisco. Everything I tried was delicious and healthy. Their bacon was very thick and crispy, the vegetables were fresh, the sauces were natural and authentic. Fresh orange juice and grapefruit juice were bomb! The staff was very friendly and food came quickyly even when the restaurant was busy. I'd be here everyday and try the whole menu if I could.", "author": "Lan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "I got the short rib hash. It was great; bright and flavorful. I'd get it again! I also split the divorced eggs. It was good too but not as good as the hash...", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Delicious brunch - the eggs Benedict were perfectly done and the Swedish pancakes were to die for, especially the lemon sauce. Would definitely come back for more!", "author": "Thomas S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "The House Hash was amazing!!! Honestly one of the best lunches I've had, mimosa was also divine. The wait did get a little long, but it was definitely worth it. The host and wait staff were just as great as the meal, coming back soon to try the rest of the menu!", "author": "Demi G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "I really want to like them.  Food is good but this place is not consistent and they try to cram you in.  I get that this place is small but be considerate of your guests and try not to cram people into the bar or community table. \n\nLast time I was there they tried to jam us at the community table.  Finally 5 people left out of frustration. My friend and I were not thrilled being jammed in. \n\nToday while they were busy their staff looked like they were deer in headlights.  I had to ask someone to finally take my order.  The Big Spoon.  Asked for eggs to be scrambled light.  Order comes. Eggs scrambled hard, rock hard toast with glopped on butter, no butter for pancakes no salt or pepper.  When asking for butter it was cold and hard.  \n\nThe owner saw I was pretty unhappy and did comp me which was the right thing to do (and appreciated).  Nice guy however I do hope he will work to get his staff on board better.  \n\nThis is the new hotspot with a lot of young people who will wait for an hour but is this really worth it? I am a neighborhood guy and I do hope they get it together as I know other neighborhood friends have not been having great experiences there.", "author": "Eli B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-13", "description": "My wife and I wanted to check this place out because it's in our neighborhood, and one thing that the Church & Market area lacks is an abundance of decent food. I immediately noticed that the price of coffee was high: $4 for a cup of coffee, and $6 for a latte. I get it -- brunch is inherently a luxury, rents are high, and employees need to be paid well. If you can't afford it, then don't go, right? But here's the issue: the coffee here is not good. And one thing my neighborhood does have is a wealth of excellent coffee options. If you're going to charge the highest price for coffee in this area, then you also, therefore, better have the best coffee, or at least coffee comparable to what other local venues serve. Both my wife's coffee and the expresso in my latte were sour, and tasted low-grade. They need to find a better source for their brew, and they also need to pay attention to its preparation. Their food was okay; no big surprises or big disappointments, but it certainly wasn't memorable. Again, SF offers some fierce brunch competition, and a restaurant can't survive by being fair-to-middling (note how the owner of Tangerine on 16th and Sanchez re-conceived that unremarkable restaurant to become the very popular Kitchen Story). Wooden Spoon's space is very pleasant, offering a sort of cozy minimalism, and a brunch joint is a good addition to this spot. The service was good and hostesses and staff were attentive. So please up your game, Wooden Spoon! I'd like to see you succeed.", "author": "Allen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "What a great place this is! \n\nIn San Francisco, it's rare to find a breakfast/brunch spot that doesn't have a line around the corner. When we arrived, we were seated right away, and the service was perfect. \n\nI ordered the Morning Bowl with a poached egg added, and it was fantastic. I also sampled some of my friends' Pancakes and House Hash, and the food was outstanding all around. \n\nWooden Spoon is a wonderful addition to the neighborhood that will make a lot of San Franciscans happy.", "author": "Joe W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "Enjoyed the food quite a bit (tasted all of my friends food). The Bloody Mary isn't as tasty as it looks. Perhaps a mimosa would have been a better option. I would come and eat here again. The food was honestly great. Not sure if the wait is warranted. Either way, worth a try.", "author": "Sergio A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Really great breakfast place.  I sat at the bar, but next time I will get a table if I can.  The service was fine, but I they seemed to be more attentive at the tables.  Good coffee.  Cute young man appeared now and then behind the bar.  He was not very friendly with those he did not know.  If he would turn on the smile to strangers there would be line down the block.  He did refile my coffee but was hard to get his attention.  I ordered the crab omelette.  Wow, was it good, as well as everything else that came on the place.  Pricey, but worth the price.  Will order the same thing again.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Pretty much the ideal brunch spot: delicious food, often elevated in thoughtfulness and execution; a warm, lovely interior that feels upscale without being stuffy; and understated service that's both friendly and professional.\n\nOverall, this is the kind of spot that I'd use as a data point when selling someone on a neighborhood. Hope it's able to stick around.", "author": "N L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Loved this spot for brunch!! Great value for quality food. Ordered the soft scrambled eggs with crab and they were perfectly cooked! The potatoes were phenomenal as well-they reminded me of the potatoes at Plow. Awesome neighborhood spot! My fiancée ordered the short rib hash and felt the short ribs were slightly over cooked. Overall very pleased! It will definitely be a new go to spot for us.", "author": "Kelcie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "I'm a visitor in SF with curiosity to taste traditional American breakfast/brunch. It's my first time using yelp and I saw this restaurant with 4 and a half stars so I watch the picture reviews and want to make my decision through the netizens recommendation.\n----------------\nI can't decide between house hash and that one with crab. One waitress says that both are her favorite and the ribs are heavier. Since I'm really hungry and have a plan to have seafood on the next day, I order the house hash.\n----\nthe moment it get served, the smell attracts me soooo much!(I'm hungry to death in late 11 o'clock) After having the first taste on the rib----wow! that's fantastic! Not only the ribs, but also the potatoes, the corns and especially the 3 kind of sauces with mustard, pepper and cream are awesome. All those things make a prefect match together, making the whole course a total enjoyment.\nthe egg is perfectly cooked as well, soft and half liquid.\n--------\nI thought the amount would be even or too little since It's breakfast and I'm really staring, but actually It's perfectly enough for me as a lunch cuz there're plenty of ribs and potatoes. Only if there could be more vegetables or salad!\n\nThat's really  a nice experience!", "author": "Fiona Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "OVERALL: The ambience is bright, clean, and gives the impression that it doesn't know exactly what it's trying to be, so it tries to be a little bit of everything. The result is that while the casual atmosphere and fair-priced fare should attract easily placated customers, the tax is on those who expect innovation to result in something better. Overall, the food and feel can be summed up by one word: Simple. Unfortunately, while simple can be the secret to otherworldly pleasures, in can also be the recipe for another word: Meh.\n\nFOOD: The lackluster crab and bacon scramble could have used more crab, and was certainly short on bacon, while the included greens left much to desire, slightly aided by a small ramekin of fruit. Potatoes were somewhat dry, so I recommend adding sauce of your choice. The Big Spoon is filling (pancakes and toast for carb-loaders). Someone mentioned on Yelp that they use real maple syrup, but I am doubtful. Theirs is not viscous and tasty like real maple syrup. The best I can say about the food is that it wasn't bad and it was healthy.\n\nDRINKS: For cocktails, the Blackberry Bramble might be a popular hit, since they were out of ingredients to make it, unless it is anything like the watered down and undrinkably bland Breakfast Spritz, in which case I would steer you towards the Strawberry Margarita for sweet Tequila in the morning. Coffee is hard to get wrong, but they really got it right by going with Sightglass.\n\nSERVICE: I am hesitant to even begin to describe the deluge of poor service I received, but I cannot discount the experience. Service, when it is really good or really bad, is elevated in importance. So I must say that the begrudged long hair tatted guy behind the bar must have been pulled off the street because he had no clue what was going on. His deadbeat demeanor and incompetence makes me wonder how he got hired, and whether he seemed so disinterested and hungover at the time of his interview. He was so quiet and mumbly I gave up trying to understand him by the time we left. Didn't offer cream/sugar with my coffee, said he gave me half-and-half when it was soy milk, gave me no spoon. Asked how I wanted my eggs when I ordered an item that has \"Scramble\" in the name, asked what kind of toast I wanted but didn't know what kind was available, never gave me the toast, did not offer any condiments including butter for toast/pancakes or ketchup for potatoes. Never checked in with me about food or cocktails, even after making one of them twice and having it sent back, tried charging me for the drink that was sent back. I am probably missing something, but not as much as he was missing.\n\nSUMMARY: The simplicity offered by Wooden Spoon is a good idea, but the portions and flavor need to be re-examined to get it right. It is still a healthy option and fairly inexpensive (it can't afford not to be, with the service I received).\n\nSide-rant: if your only location is in SF, don't tack on a 3% surcharge for \"SF Mandates.\" You are only in SF, so that is part of the cost of doing business, and should be factored into the price of the items listed on the menu. It is your responsibility as an employer -- if you must pass the cost along to the consumer, do so in an upfront, transparent, socially responsible way, rather than sneaking it in at the end as a hidden cost.", "author": "James C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "We were to try typial SF food for breakfast. We got impressed!\nWe sat on the bar seeing the kitchen work and it was so good to see everyrhing coming up.\nWe got \"The big spoon\" and \"The soft scramble eggs\" that contains dungeness crab. We thought it was too much but the taste is amazing!!\nWe got in love with the pancakes!!", "author": "Aïda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "My friends and I were lucky enough to stumble upon the Wooden Spoon. We are visiting SF and happened to catch their first Monday open. Our waiter Addison was fabulous and very helpful. There were too many great options on the menu! The music was great. Open a Wooden Spoon in LA please!!! Will be back next time I'm up.", "author": "Lea W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "This place is quintessential SF boug brunch. I can't say I didn't enjoy, since I am into these things, but I also can't say it necessarily stands out in it's category. I waited about 45 minutes (was quoted 30) on a Sunday morning with a party of 5, ordered the vegetarian biscuit and gravy, and a French toast for the table. All was delicious and presented well, but that's to be expected at a place you wait 45 minutes for.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Happened upon their soft opening and came inside to check it out. Great new breakfast and lunch place with uber-friendly staff and really good food and service. We will be back!", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Fantastic! Highly recommended! And the service was great and attentive. We will definitely Ireland's be back!", "author": "Danny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "The breakfast menu is large,innovative and priced wise reasonably.", "author": "Braden F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Sooo glad this place exists. Bright, spacious dining room and beautiful bar with tasty food served by sweet people. Felt super comfortable walking in for the first time and will definitely be back. \n\nAte the berry bowl with granola today but want to try pretty much everything on the menu. Highly recommended.", "author": "Seth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Breakfast and brunch done perfectly!  Great addition to the neighborhood.  I've had the opportunity to go twice now and everything I've tasted has been delicious.  I got the soft scramble with crab (I am picky about my soft scrambled eggs and these were smoooooth!), the short rib hash (meat falling apart .... yum!), and the eggs Benedict (the biscuits!).  Service was excellent and quick!", "author": "Liz B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Food, atmosphere and service all great. I'll be back. Had the hash it was perfect it was just the right amount of food", "author": "Kevin l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "so good. if visiting from out of town, definitely check this place out. order the eggs benedict!! our favorite of what we ordered", "author": "Kamryn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "From attentive service to the most delicious meal, Wooden Spoon is an excellent restaurant addition to the neighborhood and to SF. Cannot wait to go back as so many choices sounded tasty and looked just as amazing as my meal as wait staff was bringing them to other tables. Be sure to check this restaurant out. It is definitely worth the trip to the neighborhood.", "author": "M. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "UPDATE: Owner contacted me about coffee mishap....(machine not working properly).  Also...BUTTER will be on pancakes!. Time to try this place again.", "author": "R H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "I wanted to get brunch with two friends this past Sunday and Wooden Spoon did not disappoint. They have a standard check in system where you put your name on the list with the server and just kind of hang out until your name is called. I think they had a text system in place, but what can you do. We waited about 45 minutes when we put our name down at 11:00am.\n\nI really like the general layout of the restaurant with a fair amount of tables and bar space. The waiting staff was also very attentive and friendly and the hostess didn't get annoyed when I did the midway checkin on how long it would be until our table was ready.\n\nThe food was incredibly good, certainly one of the best brunches I've had in San Francisco. The bloody mary was the perfect thickness / spiciness and had a bunch of pickled veggies on top, which was a nice addition. Two of us had the soft scramble with smoked bacon, crab, and house potatoes. The potatoes were perfectly crispy and the crab was cooked perfectly. One of us had the hash, which had a generous amount of meat and had a super tasty sauce. Finally, the side order of bacon was thick and crispy. Overall, a delicious meal!", "author": "Phillip P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "Breakfast or lunch it is the place to go! Amazing Food and Great Service!", "author": "Lee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "What a great addition to the restaurant scene! The vegan chorizo is a MUST! One of the better brunches I have had! Addison was a great server and made the best recommendations. Do yourself a favor and try wooden spoon!", "author": "Travis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "It's a cute little place that worked out perfectly to meet friends for brunch. The softest and delicious french toast ever. The menu is very limited and not much variety to keep going over and over but whatever's on there is good. Friendly service and fresh food !", "author": "S S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "So definitely forgot to take a photo of my meal because it looked so good, that I choked down right away and let me tell you, it was PHENOMENAL. I had the dungenuss crab soft scramble and probably could've had two more orders. 1) Definitely told my friend that I'm taking him here next week 2) Had a dream about the Bloody Mary.", "author": "Jacqui M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "It's great to have a top notch contender in the sf brunch scene. I had the Big Spoon, which is the perfect size for a day hangover.", "author": "Dawson L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "I have been wanting to try this place for some time. I walked in, they were very busy as expected but I could see at least two seats in between that were free and I was a party of one. Two hosts were at the door. One greeted me female), the other didn't (male). She pointed out the two seats, said it might be a bit of a squeeze but if I'd wait for 20mns she could get me a spot. Why fit in all those seats if you don't actually want to seat someone when there's a free spot? But fine, no problem. Then another single diner got up on the end and she (hostess) said she was going to put me there, hold on while it's cleaned up. I hold on, it gets cleaned up.  Hostess seems to get very busy so I keep waiting. Another lone diner walks in, sees the free spot that they just cleared supposedly for me, asks the other host who has yet to acknowledge me if it's free. Host says yes, sets him up with a menu. I look at him (host) and he just looks back at me, expressionless. I keep looking for hostess who can see me but still seems busy. Eventually I ask the host what's going on, weren't they clearing that spot for me, wasn't I here before this guy? Host, again expressionless, tells me I need to wait. I wait. Eventually I ask again what's going on. He points to one lone seat in between a very crowded bar and tells me they'll seat me there if I wait for the other parties to leave first. No apology, no explanation, barely even any eye contact. I'm sure the food is good but whatever happened here with their customer service was really disgusting. Was I the wrong race, sex, nationality or number?", "author": "Anushka R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Finally!  Found a place in The City that has really good Swedish Pancakes without looking for an IHOP.  House hash was really good, also.   Coffee's good.  Updated decorum.  Good help., clean kitchen.  Found two wooden spoons on the wall that a left gander could use.", "author": "R C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "Second time coming. Food was delicious and drinks were great, too! Service was could have been better. We were a party of 7 waiting for brunch. Hostess stated it would be a 40 minute wait. 45 minutes go by and I go to check and the hostess explained that they were just waiting for tables to leave, who have already paid. Cool. 10 minutes later a friend and his kid had to leave because it was taking so long. In the time we waited, the hostesses were seating parties of 2, often coming back out to call on parties that obviously left. We were finally seated at the communal table. A friend in my party walked into the dining area and saw many empty tables that could have been used to accommodate larger parties. Then it was time to order and 2 people in our party ordered the house hash, which was sold out!   It seems parties of 2 had preference, which meant, that there is a greater chance that larger parties who have to wait a lot longer, no longer have all the menu options to order from. Waste of time! But the food was delicious.", "author": "Perry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Loving the decor and the natural light. That paired with the amazing service and delicious food makes for a wonderful experience! I went for brunch and had the House Hash, every bite had the perfect mix of taste and texture. Will be back!", "author": "Lamont H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Super cute, delicious hash, great service. Looking forward to coming back to try the mimosas and bloody Mary", "author": "Lyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Delicious food, good service. I had the hash and a blackberry bramble, and shared a plate of Swedish pancakes. They were all delicious.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Wooden Spoon is such a great addition to the neighborhood! The variety in the menu, the perfection of the eggs (everyone must try the soft scramble with crab and marscapone!), the design vibe and fresh cocktails (with fresh grapefruit juice!)will definitely have me coming back. The service was great and attentive which was icing on the cake.  Will definitely be back for more!", "author": "Christine K."}
