{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "SVU - one and only edition\n\nRandom evening to catch TNF highlights but this was the spot to meet my homie G. Woodbury was pretty occupied earlier in the evening then later packed with ppl from AT&T Park. Luckily my man Rad or Roje (sorry for not getting your name spelling correctly) grabbed me a seat and served me up mezcal. What can I say? You know how to make a girl feel special. Music was on queue and the food came fast.\n\nFall victim to your late night craving. This place will definitely satisfy just that.\n\nDespite the havoc that rolls thru each night, the super cool staff remains gracious and attentive to its patrons.\n\nI appreciate you, see you soon.", "author": "Trish Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "Fun place, good service and decent food.\nFun place to stop by and have a drink and hang out with friends.  Go size location, pleasant if table and chair and a large bar, just watch out for Giants games.  The service is fast and friendly.  Bartender are fast making and serving good drinks.\nThe food is ok, looks great on the menu, and is ok.\nThe Deviled Egg $5.00 and Baby Back Ribs $12 were good bar food and I really enjoyed the fully loaded tots.\nLiked the drink specials: $10 Tequila + Modelo\nLook, it's a bar with fun food, good service and fun atmosphere.\nYes, I'd come back and would recommend for fun night out with the guys.", "author": "David E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-22", "description": "Good special drinks. You get a shot and beer for most of them I think, but I recommend you ask for a cup and just mix if you don't like shots. $10 Max for that special drink. $12ish for the house special drinks atm.", "author": "Bertha H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "Pretty cool bar. The highlight definitely has to be the vintage video games in the back corner. Friendly crowd and nice staff. Walking distance from AT&T Park and right across the street from a Taco Bell Cantina for all of your drunchie needs. Great spot to go grab a drink or 3 after a game!", "author": "Chase M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "My friend and I came here for a late night meal after turning up at the Alchemist and we got the K+O Combo (something like that) and we got 2 Tacos, Ribs, and Sliders in this combo for $18 and we ordered Truffle Fries for $10 and we were hella happy and full after.", "author": "Erika D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "We stopped in here after a Giants day game at AT&T Park and had a drink and appetizer. They had some specials that were mostly shots and beers but we decided to try their seasonal margarita (strawberry, rhubarb & lime) and the froze' (Lillet rose, white peach vodka? and grapefruit blended into a slush). Both drinks were very refreshing, the margarita was pretty tart. We also had the fried Brussels sprouts which tasted great and were served with a Dijon sauce. Our server was very attentive and the place had a nice vibe. Of course, the crowd was pretty much Giants fans after a winning game so everyone was in a great mood! Would definitely go back again if in the area.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "A large, quality SoMa bar that gets lots of crowds on weekend or AT&T Park game nights. \n\nFood offerings like a scrumptious fried chicken sandwich with fried egg were several notches above pedestrian pub fare. Tots and fries are also a solid bet, and drinks aren't too unreasonably priced. With old-school video games like Super Mario and Sonic the Hedgehog to add extra vibe, the overall ambience was quite lively and fun. Borderline brotastic, even, without being outright douchey and self-absorbed like the West Bay scene increasingly is these days.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "So if you're wondering about the food on your way to the bathroom if you look to the right in the kitchen  you will see sheet trays of brussels sprouts and part of food trays. Dear staff management and owners, you cannot talk on the sheet tray right underneath your food that is absolutely disgusting and help her violation to the fullest extent, it's a hotspot careful but my first name but I will deathly not order food from here ever", "author": "Mariya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "The bartenders are friendly, and Frito pie is delicious. I enjoy it there even I went there alone sometimes. It's not too crowded or too quiet, so it's a good place you can also go alone or with friends", "author": "Munchuli P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "I took a date to the bar to eat and drink before the Giants game. After reading the reviews, I decided to come here and was not impressed. The drinks are very expensive, and not very good quality. I asked for a Long Island, but it tasted like straight mixer and was dark brown. Long islands do not look like that. If you are gonna charge me so much money drink with little to no alcohol then it's not worth it. SF always has high prices, but the quality should be there. \nI asked for my fried chicken sliders to be plain without anything on it because I am allergic to some of the ingredients. The first time it was brought out it was exactly how the menu stated so I asked again for them to make it. For a second time they brought out the same thing. I was only charged for one, which is okay I guess, but I was unable to eat the food. Also it took forever to bring out the food, even though the bar wasn't even half full. I didn't eat it instead I just paid and left. The food may be good or not, I don't know because they repeatedly got my order wrong so I couldn't eat it. We then went to a different bar across from the stadium with cheaper and higher quality drinks. Because of the terrible service we received here and needing to go somewhere else, we missed the beginning of the game and was still starving.", "author": "Raphael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "Came here to pregame before a concert. Followed the sign that said \"cocktails on tap\" in the back of the place. Took forever to get our orders but that's what happens when your a petite asian girl who cant get the bartenders attention. Anywho, after 20 minutes we finally got the bartenders attention and wanted to order the Raspberry mojito. Unfortunately, they were out. *insert sad emoji* then wanted to order a simple margarita or cranberry vodka and couldn't get that either and was told that we would have to go to the other bar because she only serves beer, shots, and certain cocktails. Well, that was a waste of our time. We ended up going to the other bar more to front of the window. Quicker service and the passionfruit frozen margarita was delicious", "author": "Za T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "The bar owner reached out to us personably to help explain the situation which was totally appreciated.  We understand now that the kitchen and bar are  operated separately, that there was a major concert that same night and that they were short staffed due to unforeseen circumstances.  I still think they should start using real china for all food at all times (better for the environment and cheaper in the long run), but we really did enjoy the drinks and most of the food so will give it another try! And we really appreciate it when business owners take the time to listen to feedback and are open to it.  5 stars for management. \n\n---------\nCame here for drinks and dinner on a Tuesday night (during happy hour).  Drinks were delicious and food was not too bad. The tots, tacos and Brussels sprouts stood out! But the ribs, chicken sliders were both dry.  However given what you're paying, you would think that they could serve the food on real plates rather than disposable plates/paper containers.  I understand that it's \"bar food\" but for $8-15 per item I would expect real plates. Also it took 30 minutes for the food to come out (!!!) and we had to ask our server 3 times for water.   Water alone took 15 minutes.  Not sure if I would come back; the wait wasn't really worth it .", "author": "Sean. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Ever since moving to Mission Bay, I always wanted to try Woodbury. It seemed like a cool place to hang out with excellent food and beverages, so I decided to come here on my 26th birthday. This place has a weird theme, and I'm not quite sure what it is. Camping and outdoors, perhaps? Anyways, Woodbury captured my heart when I read this sign on the board: \"By the way... we do NOT serve FIREBALL. Drink like an ADULT.\" Bahaha.\n\nI had a taste of the ribs that my friend ordered, which were pretty good, but my friends and I mostly came here for drinks. There was a decent selection, though I would say Woodbury is just your average bar overall. Nothing too special about the menu or experience. The waitress was sweet enough to arrange for a complimentary birthday cocktail... and it was STRONG. Yikes!\n\nWe came here around happy hour time on a Thursday, so it wasn't too busy. Plenty of space, though I can imagine (and it seems from other reviews) that it can get quite packed, especially on game days. While I'm not dying to come back, I enjoyed my time here, and I would be open to returning when it's not busy.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "We changed from our usual venue and came here to watch the first game of the 2nd round Playoff game for the Warriors.  It was on a Tuesday and surprisingly not crowded at all!\n\nThe place is very specious with multiple TVs. However, depending on where you sit, the columns may block your view. They also have some video game setup near the back to play for free. \n\nIt's been a while since the last time I visited here but I believe they changed their menu to include some healthier options. We ordered a Corn Dog, a BLT, and Fish Tacos. The Corn Dog was fine; your normal corn dog. The BLT portion was huge. It also came with french fries. We shared it between 2 people. The Fish Tacos were smaller in portion and tasted all right. I think their Old Fashioned is on the sweeter side but I did enjoy it a lot. \n\nThis place also has a decent sized women's bathroom. It is usually kept pretty clean.", "author": "Alice L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "A casual spot for happy hour, pre-game when the Giants are home, or a get together with your girlfriends before dinner, daily happy hour specials are from 4:30-7pm Monday - Friday or on gamedays before the first pitch!\n\nI didn't get to eat any o their bar bites but the menu looked good. They have finger foods such as tater tots, fries, tacos, ribs and sliders, perfect with any beer! They have a moderate selection of beers on tap and bottle or can. Cocktail list is even smaller. I had the Dark & Stormy with rum, lime, and Top Hat ginger beer and also a Moscow Mule. It was okay. I'd enjoy it more if they had a longer list of cocktails.\n\nThere's a game station in the corner with old school game consoles like Super Nintendo and maybe an Atari (older than my time!! LOL!) and many game cartridges stored in the drawers. They're a lot of fun, especially playing Mario Kart! Brought back so many old childhood memories!\n\nThe atmosphere is inviting, there is plenty of space to mingle, TV screens everywhere you look if you're here to enjoy the game. Tables are first come first serve but theres a spot in the back where they do take reservations for groups. I had girls night here after work and we had a great time!", "author": "Janny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Good beer. Not so local but I had a unique one from Iceland that was smooth. Great bartender once you get to know him. Small spot but decent seating and very spacious. Open late for those of us who want to grab a beer with a friend after work at 1130 and have a good conversation", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Great bar next to AT&T park with decent HH deals on drinks and food \nOld school video games you can play\nScreens that show the games (crazy during Warrior games)\nAdjacent door to Alchemist inside the bar\n\nOverall Thoughts\n\nSo far a fan of Woodbury", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "My husband & I pregamed here before Sunday's Giants game and really enjoyed it. It was our first time in, beers were good, bar bites were awesome but the staff was excellent. I hope I have his name right, Rah was behind the bar & he was top notch. Super organized & friendly and went out of his way for every costumer. Cool ambiance and Excellent service, we were very pleased. We will definitely be back to sample that drink list too!", "author": "Susan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "This has always been my go-to post Giants game bar (along with the Alchemist), but we decided to check this place out for a Warriors playoffs game this time around.\nTasty drinks, cheap wine, and pretty delicious bar food.\n\nI opted for the salad and the flash fried brussel sprouts, and was surprised at how delicious the food was! The quinoa and kale salad was perfectly dressed, and had the perfect cheesy and crunchy texture. The flash fried brussel sprouts were good at first, but started getting a little soggy towards the end.\nFrench fries are always good, and they did not disappoint.\n\nCome for some old school video games and moscow mule on tap!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "After the Giants game, my friends and I wanted to find a place for small bites and a quick drink before our train ride back home. We stumbled across this place since it was only two blocks away from the ballpark!\n\nFood and Drinks - They have a good selection of small bites. My boyfriend and I went for the Fully loaded tater tots and Beef sliders. We made a great choice since both of these were so flavorful. One order of beef sliders come in two and they were juicy and not overly well done. The tator tots had bacon, scallion, cheese, and other ingredients. I ordered the Dark and Stormy drink for myself since I wanted a cocktail to sip on. \n\nAmbiance - The first thing that caught my attention is the Super Nintendo they have towards the back. It brings that so much memories since I use to play that as a kid. They have cool deerhead hung on the wall and chandeliers made of deer antlers. There are also two bars, one for mixed drinks and the other for beer. \n\nService - Our drinks came out almost immediately after we ordered it. The waitress was friendly.\n\nOverall, I will definitely come back to try their other small bites since the tator tots and the sliders impressed me. Next time when i am back, I will play the Super Nintendo!", "author": "Allie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-22", "description": "My boyfriend and I come here before Giants games. Drinks and ambiance are great. There's a lot of room and they even have video games. I am trying their food menu for the second time (sober) and it is below average; at least the tacos are. I just wish there was some sauce or some cheese because it was very dry. The texture just seemed to be missing a wet element. I will, however, continue to be a customer here for the drinks.", "author": "Tia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "What a great bar and friendly bartender! The lemon drop I had was on point and the bartender was a shorter guy with a beard. He was so nice and friendly and explained drinks when I asked about them. We did not try the bar bites but they did look good, next time we will try the food because we will be back thanks to a friendly smiling face!", "author": "Robert W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Food is great! They have some awesome adult slushies and the music is rockin! Great place pre-game!", "author": "Jacqueline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Love this place!!!!!!!! Culture is down to earth but with high class. The slushy Irish coffee is BOMB!!! If u don't already like Irish coffees then maybe u won't like it...had a nice strong coffee taste too. A must order if ur hungry is the truffle fries :)", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Came in last night to have a date night with the hubs, and got lucky to find a football game playin on the TV as well. It was a slowish start, heavy middle, and heavy end of service for the staff and we were taken care of at all times. There were some really 'douche'y people there but the service was still outstanding. Thank you Taylor for keepin our beers cold and full and just for being awesome! \n\nFor food we had the tots 5/5 and the spicy sauce is amazing, we also had the sriracha deviled eggs 5/5 as well and I had the fried brussel  sprouts, they were 5/5 too but I had filled up by then so I couldn't finish them all, lol.\n\nAll in all, we'll definitely be back. And probably get the K+O combo, that looked delicious!", "author": "Lizzy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "While the food menu is small and the buffalo bites I ordered were only meh, I did get a lot of them, and the drinks and staff and ambiance are solid in this not-super-fancy-but-not-quite-divey bar just a block from AT&T Park. Other bars nearby have better food, IMHO, but this place has solid cocktails. They're not super pricey or overly fancy stuff, but good solid drinks (including a few different kinds of slushie drinks which were AWESOME on this 90-degree day!). The beer selection is also pretty good and again, the staff were great and the ambiance is solid and a bit nicer than places closer to the stadium.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "BAR + FOOD + BASEBALL + MUSIC\n\nMy friends and I always hit the other bars down the street during the sports season and I never understood why we never went to this bar. I had an opportunity to check it out on my own since none of my \"alpha\" friends were with me. It's a great place to grab a drink, get some delicious eats, and chill out and pre game before the game or catch the game on tv. The music is loud bumping radio hip hop and the crowd is mixed and laid back. We need to kick it here more often. \n\nMOSCOW MULE ($8) - they didn't bother to give my Moscow Mule in a Moscow Mule Tin cup. It was served in a glass. Definitely didn't taste strong but half way through I was feeling it.\n\nCHICKEN WINGS ($10) - house dry rub with ranch dipping sauce. I noticed everybody getting the saucy wings but I'm not into saucy kind of wings. I initially asked for the hot wings with sauce on the side but they gave me the house dry rub. The dry rub was good but a bit too peppery and salty to my liking. I had to dip the wings in a lot of ranch to lessen the seasoning flavor. There were 8 pieces per order so it is definitely worth your dollar.\n\nBACON POPCORN ($3) - Topped with Korean Chili Flakes. I live anything bacon and to have bacon flavor on my favorite snack was a bigger positive. It basically was popcorn with some kind of bacon butter grease drizzled on the popcorn and a few sprinkles of chili flakes on top for heat - which I didn't really feel. This is worth the $3 and nice to munch on while drinking. \n\nI'll need to come back to try the Frito Pie and Tots. \n\nJABA approved. Until the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "I am glad I checked this place out before the Giants game.  I've never really walked past this place before or after the Giants game because we usually walk the opposite direction.  The service here is impeccable and very attentive even when it's busy! The atmosphere isn't divey at all and its decorated pretty nice with plenty of table seating.  They also have an upstair area where they play music and also another bar. I believe they have 3 bars where you can order drinks from. They seem to handle all the customers with no stress.  I tried the Moscow mule and it's sooooo gooooodd!!! A must get! I like how you can get some beers with a shot and that's like their special.  \n\nIf you're coming here then you MUST try the food! Talk about nicely portioned especially if you want to share, not too pricey, and just so damn delicious! Fish tacos tasted fresh and yummy! You must try the loaded tater tots! I will for sure be coming back here when I'm in the city.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-04", "description": "I usually dont write reviews, but i feel compelled to describe the treatment I received at Woodbury.  This type of mistreatment of a customer should never happen to anyone .\n\nI came in with a friend and requested a couple of basic Vodka drinks and received 2 drinks for very little ice in them.  I requested more ice in the drinks from the female bartender . She became very upset and with an attitude said to me...\"are you telling me how to make drinks?\"\n\nShe walked away and didnt give me any ice and proceeded to talk about me to 2 customers next to me when I walked away to talk to another bartender about her treatment.  The female bartender came back a few minutes later and said to me...\"you want ice? Here it is\"...she dumped a huge piece of ice in my drink spilling all over the bar and then walked away. \n\nMy friend and I finished our drinks and appetizer and knew it was time to leave. I asked her for the check and I saw she charged me for my ruined drink. I told her I was not going to pay for this. She then said that she didnt want my f*uckin' money and told me to get out! I asked her for me receipt back and she threw it on the floor in front of the entrance to the place.\n\nI looked at the security person and asked him for help, he did nothing and her manager also just looked at me and my friend. I picked up my receipt off the ground and left.\n\nThis young female bartender who thought she could do anything she wants to do should be spoken about her treatment.  Why are people like this working when so many great people are out of work?\n\nI would not recommend this place as these people could care less about their customers  serving weak overpriced drinks. Not a place with good vibes or fun to be had.\n\nStay away from this place and the young arrogant female bartender!", "author": "Santiago F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Stopped in here last night, and we were very pleased with the experience. Admittedly, there wasn't a night game for the Giants, so the place was pretty empty, but they served us quickly and the food and drinks were great. I really enjoyed their spinach-artichoke dip, which has a layer of melted/nearly burnt cheese on top to make it extra delicious. \n\nI ordered two cocktails and my friend got two beers. We enjoyed all the drinks, although they weren't exactly cheap (not that I expected anything different--it was $11 for a smallish glass). The bartender was super friendly and engaging, and there were multiple TVs showing sports, which is a must for us. \n\nOverall, it's definitely a place I'm looking forward to visiting again!", "author": "Olivia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "Been to this bar multiple times now and always have a good time here. The food is great, served until 1am which is always a plus and good music and service. \n\nThe place gets packed on game days (and gets EXTREMELY hot) but the bartenders so kindly have a few fans in the bar, one of which was pointed directly at me the other night, so can't really complain about that. \n\nI ordered the tacos last time I was there, which I think were a daily special but they were delicious! The frito pie is also a really unique snack that I've never seen served anywhere else. It's chili, cheese sauce, and scallions all mixed into a bag of fritos! Love it.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "The night of Ghostship (Halloween party in case you did not know)....tired and hungry and looking for a place to grab a drink and food on the way home. We stumbled on to Woodbury and glad we did. As expected, it was packed and loud but we were lucky to get a table. \n\nThe food was surprising good. The tater tots, truffle fries and the burger were perfect after party food and went fast. The decor is interesting...it is more country than SF with the antler chandeliers and mounted animal heads on the wall. I was too buzzed, hungry and tired to be offended.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "Really cool looking place. I like that the bouncer ID's you and then you don't have to whip it out ever again.\n\nThe mounted heads where nice. My jameson, ginger ale was nice and strong. \n\nThere is a very strong sense of preferred patrons here. I kind of felt like I wasn't really there or being offered to be apart the aura of the establishment. I couldn't really talk about service when it was so minimal and without error.\n\nI wished to be more welcomed.\n\nI work next door and have moved on from carpooling to taking public transit so I will totally be back from some $6 jameson for a light buzz before sardining myself on the transit. \n\nLots of meh, all the meh and the KO restaurant was also not very memorable. They have a great menu and vision but every time me or my coworkers grab something we end up disappointed. Better execution and friendliness needed here.", "author": "Niana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Great spot and cool staff. The food was tasty and the drinks got the job done ;)! Big TV with the warrior game on was a plus but the Dj and the reggeton was the cherry on top last night. Good time! Try their fried chicken sliders and loaded tator tots!", "author": "Willian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "I think this place is great fun.  \n\nHas TV for the game.  I was watching 49ers pre season football and I had a hard time explaining the rules to our Madrid companions from work.   Yeah our football is hard to explain.  \n\nThey have a pretty interesting Happy Hour.   They had chicken Lumpia.   \n\nAnd their shots and Beer is also a pretty good deal considering. \n\nThere are console video games to play with. \n\nAnd I actually get a kick out of the name because I feel like there should be some kind of Walking dead decorations.    And a picture of the governor.   Will definitely come back.", "author": "Homer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Anyone who knows me knows that I don't consume alcohol. Then why, Anny, do you go to the bar?! Because I like my friends, okay?! Leave me alone!! That being said, I only ask one thing of my friends when they plan socializing events, that the bar serves food. \n\nUsually bar food aren't generally that great, but Woodbury has pretty good food. I tried their ribs and chicken nuggets, and fries. Aside from the ribs, the portions are pretty generous to share amongst your friends. I thought the ribs were the best. The flavor is a little sweet, which isn't particularly my style but it was still very good. The meat was really tender, juicy and easily fell off the bone. I thought the fries' \"Cajun\" flavor could use a different Cajun seasoning, with a little bit more mixture of flavor. I thought the plain fries tasted better. The nuggets were the most popular amongst my friends. And I personally liked it even though it was not the best nuggets I've ever had. \n\nOverall, I think Woodbury is a good place to gather with your friends. The environment is great and the staff is friendly.", "author": "Anny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "Man this place is packed!\n\nFortunately they didn't require a cover charge, not even for Friday night :) There was a video game booth inside where you can play nintendo---nice touch :) The beers are all served in pretty cool mason jars, and the place is very, very packed pretty much all night. Most of the clients are young working professionals from around the area. We even bumped into a random dude that randomly gave us his business card out of nowhere\n\nPretty popular place for beer and hanging out. Should definitely stop by if you are bar hopping in the soma area", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Go-to local pub. Good pub food, great staff, and even retro consoles to play with. \nNormally packed during Warriors or Giants games.", "author": "Al C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "This place has a good motif and is generally a place to come grab a drink. I was a bit disappointed as the only food options here that really are thrilling are the ribs, and this was confirmed by the bartender. Not that other stuff is bad, it's just not exciting. Great bar though with tons of options for whiskey and tequila. Be careful, happy hour could get expensive.", "author": "Frank O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-26", "description": "Quirky and crowded little spot that proudly does not serve fireball. I enjoyed their sign proclaiming this and telling patrons to drink like an adult.  Within our group we tried a variety of cocktails from Moscow mules to pina colada slushies to traditional vodka sodas. Good music and kind of silly decor (antler chandeliers etc).  Looked like a good beer selection, too. Fairly quick service and strong drinks so be warned on that front.", "author": "Melanie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "A couple of friends and I decided to go find somewhere to go eat after the Giants game. We stumbled this place on Yelp. As we arrived we were ID by the bouncer. The atmosphere of the room felt spacious and reminds me a lot like 55th south bar in Downtown San Jose. The lighting were dim with lights hanging around the place. \n\nYou had the option to sit at the booths or the tables which were pretty high up. They had two bars which one was for the beer& shots and the other as the main bar. \n \nI found the menu interesting with their choices of drinks paired with shots. If you were in that kind of mood to start of your night with one mixed drink or beer with a shot. \nI decided to order myself beer which I can't recall the name. But all I could assure are good. \nThe presentation of the drinks were unique, the beers and mixed drinks my other friends order came out in mason jars, giving that urban vibe.\n\nWhat I found it unique about this place was that they had an area to play video games and not just your regular ones. The old fashion games you would find if you were born late 80's and early 90's\n\nFood were finger food which are great for something light and just enjoying your drinks. My friends orders the sliders and the tator tots that just looked and tasted delicious. \n\nOverall I would definitely come back. The vibe, service, food and drinks were great.", "author": "Jacqueline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "I feel like I've walked by this place for months (or maybe even years) without giving it much thought, but within the past few months, it certainly seems to be becoming one of my go-to places, especially since I sometimes attend classes nearby. Although Woodbury can get quite loud and busy, I haven't noticed any difficulty finding bar (standing) space or a table or two to claim for groups. The drinks (cocktails!) are good, and the staff are friendly - and helpful, if you're not really sure what to order. And did I mention the games? Nostalgia alert, if you were ever a fan of Super Nintendo ;) It's has a casual, cool vibe that's great for post-work happy hours, hanging out with friends, girls nights, you name it! It's also close to AT&T Park and Caltrain, so easy to get to on foot or by public transit.", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Came here with co-workers for their Happy Hour and had a blast.  It had a craftsman style interior with an intimate ambiance and low mood lighting. Drink combos during happy hour were great.  You can order a cocktail or even a beer with a shot. All I can say is, try the Frito Pie.. I dare you.\n\nAmbiance: 4.5/5 (a little too mood lighting)\nDrinks: 3.5/5\nService: 4/5\nOverall Experience: 4/5", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "I understand it was a Monday night, but for being told its last call at 12:30 am for a bar that closes at 2. Um what!?!?!?! \n\nDespite that, the bar has such a cool ambiance to it and has a great selection of drinks. With video games, mason jars, bike chairs, and wooden decor - this place is such a chill bar to kick it on a weekday night!", "author": "Eric Joseph D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Woodbury has Hours of happiness: Mon - Fri, 4:30pm - 7pm. How could I not drop by?! Who doesn't want a couple hours of happiness on a Friday night?\n\nThe specials on the board were:\n$2 PBR (12oz)\n$6 well drinks\n$10 mystery shot & beer\n\nWe decided to try the mystery shot and beer. The mystery shot was something sweet with hints of cinnamon. I didn't care for it, but it wasn't hard to shoot.\n\nFood wise, we ordered:\n*Poutine ($8): mushroom gravy, house ricotta, fried shallots; Get loaded (+$5): skirt steak, bacon\n*Brussels sprouts ($8): bacon, shallots, garlic confit, white wine, herb butter, korean chili flakes, parmesan\n*Shishito peppers ($5): blistered, citrus oil, lemon garlic aioli\n*Tots ($5): with dipping sauce\n*Chili cheese tots ($10): house chili, cheese sauce, creme fraiche, scallions\n\nMy favorites were the Shishito peppers and Chili cheese tots. The peppers had a nice smoke. I barely used the citrus aioli since it was a little too think for dipping. Plus, the peppers were good on their own! The chili cheese tots were also delicious. The chili didn't have beans which was great for me since I hate beans. And the cheese was ooey, gooey and comforting! The rest of the dishes were okay. I didn't care for the poutine though. It was hard to get a bite with everything and I didn't care for the ricotta.\n\nWe came on a Friday night, so the place was pretty busy. Luckily, someone left right when we got there, so I snagged a table along the wall.\n\nFun bar. I'd definitely go back for drinks and snacks!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "I'm giving it 4 stars Bc its open late around a food desert area in SOMA. It's an ok place to eat but I really appreciate that it's open late", "author": "Martha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "Oh yeah, I am a fan of the ambiance of this place. I dig it. I felt like it was super chatty downstairs so explored the upstairs and it was chill and rad. The movies were being projected on the walls, the vibes were right. I was a happy camper.", "author": "Magda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "This is our neighborhood work bar for a reason, staff is awesome, drinks are great, and you can always catch a Warriors or Giants game in the big screen. These guys are some of my favorite bartenders in the city!", "author": "Allison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "I stopped by here yesterday after hanging out at the Giants game with my girlfriend and our friends.  Located a few blocks from AT&T park, this place is perfect for an after game celebration or a chill night with some good drinks and food.  \n\nAmbiance:  The bar itself has a really awesome look and feel to it with lots of hardwood furniture, walls, flooring and two decently sized bars to order from.  Spacing is very generous since most of the tables are along the walls allowing for more standing room in the middle.  They have old-school game consoles next to  one of the bars so you can play games like Super Mario while having a drink which is awesome.  I loved Super Mario as a kid so this just takes me back and gives bonus points for Woodbury.  \n\nFood & Drinks:  Their menu has your typical gastropub choices and a great selection of drinks for everyone.  We ordered the loaded tater tots, beef sliders, a few dark and stormy's and a Dogfish IPA to wash the food down.  Our food and drinks came out super quick which was nice because its never fun to wait too long for your drinks at a bar.  The tater tots were absolute heaven with melted cheese, bacon and green onions.  The beef sliders were cooked perfectly, served with a sweet onion jam and crispy bacon.  The dark and stormy was made very well and you can never go wrong with a solid IPA.  Overall I really enjoyed my meal here and will definitely be back for more food and drinks.\n\nService:  Service here was nice and quick with our orders/requests.  Not much to complain about here in terms of service.\n\nOverall Experience:   Really awesome bar in SF located next to Giants Stadium with good food and good drinks.  I will be back for sure.", "author": "Nathan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "I would say that it is one of the best spots to catch a game around the ballpark... (Unless you have a ticket to the stadium)... Drinks are moderately priced ... Decor is awesome... Bartenders are friendly and attentive...if you feel like a hero , you have a chance to prove yourself by playing street fighter on their sega!", "author": "George B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "The scenery was nice, but they lacked a good amount of beers on tap. They had good choices of cocktails, but most were premade slushies.", "author": "Kyle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "I don't really remember a whole lot while I was at Woodbury, but what really stood out was the SNES and Sega Genesis! I was super pumped until I realized the controls were pretty unresponsive. Either way, it was still something I've never seen at a bar before.\n\nWe ordered tater tots while we were there because we just came from dinner, but they were pretty tasty. You can't really mess up tater tots though.\n\nI'd imagine the place gets pretty busy on the weekends. It was empty when we went but it worked out better for us because we got to hog the games all night.", "author": "Kurtis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Fun and chill bar!\n\nVideo games, beer in mason jars and TV for the Giants game or whatever games that are going on!\n\nThey serve up bar food too!  Extra perks to just linger and have a good time!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "This is one of my husband's and my favorite bars in town. We usually come here to get a few beers and play Super Mario Brothers and Street Fighter. Yep, you read that correctly. Woodbury's has a Super Nintendo!!! \n\nOf course, that's not the only great thing about Woodbury's. We love the bar bites (tots and sliders are so damn good!!), and the easygoing atmosphere. The bartenders are always attentive and friendly, and we've never had a bad experience here!", "author": "Rie U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Come before the giant's game..cool place t kill some time..come check it out..its worth it.", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "Visited here after the Giants game recently and I'm a fan! The bartender has some great recommendations for local beers from Berkeley and what other beers were in season. Has a cool vibe with wild game on the walls and dimly lit. If you need a cool spot to chill and have a drink with friends after the Giants game this is a good spot!", "author": "Mitchell B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-06", "description": "My $6 Happy Hour cocktail a Boulivardier was a nice welcome to what cocktails one usually finds on a Happy Hour menu. It was mixed to perfection. The ambience of the place is great. I had to remind the bartender of the Happy Hour price but oh well....", "author": "Steven B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-17", "description": "Surprisingly crowded for an unremarkable bar, Woodbury is fine for a quick drink but probably not the whole night.\n\nIt's a fairly large space that fills up towards the end of the week so it gets loud then. Earlier in the week is fine for casual drinks with plenty of seating. Bartenders are adequately friendly. They have a happy hour from 4:30-7 pm but the specials aren't much to crow about. Definitely trying very hard to get hipster-cred with details like mason jar glasses to 16-bit video consoles. \n\nNot the best spot for post-work happy hour but it will suffice in a pinch especially for larger groups. Woodbury will do well however for getting a few drinks in before a Giants game.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "This place has great service! The bartender was very generous with our drinks, and even brought us extra drinks on the house. Great aesthetic, great atmosphere, and drinks!", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "I like it! It's so valuable as a place to wait for a train. It's pretty in side and they have a nice selection of drinks that aren't super expensive (for SOMA standards). I tried the food this time around too and it's quite good. It surpasses the \"surprisingly good bar food\" tier and enters the \"I could see actually going somewhere specifically for this food\" tier.\n\nStill, a better selection of nice beer on tap and a noticeable happy hour would be improvements.\n\nSuper Nintendo! and other old-school video game consoles are available for your drunken competition pleasure! The controllers actually work pretty well, so I'm guessing they replace them from time to time. They have a decent selection of social games. Anyone can just go use these, and even on a crowded Friday night, it's not too tough to get a turn. Again, super impressive for SOMA.", "author": "Justin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "What do you do once 5:00 pm (4:30 for me, whoo) hits on a Friday?! Go to the nearest bar and beer yourself.\n\nI've been to this spot when it was previously the Thai restaurant, but coming into Woodbury for the first time gave off a whole different feel. It is much better use of space with ample booths, standing tables and seating along both bars. The decor makes it feel very rustic/hipsterish...stuffed animal heads hanging on the walls, unicycle looking chairs at the bar and to my surprise, the coolest thing I've probably seen in any bar was an original Ninetendo game console with Street Fighter playing. Whaaat?! I'm sure the rest of you 90s babies would go crazy for this as well.\n\nMy coworkers originally were supposed to go the The Alchemist bar next door but since they weren't open yet, we decided to grab a drink here and check it out. It was still fairly empty but we still sat ourselves in the back bar where there was more space. We saw the beer and shot specials and went straight for those. $8 for a shot of tequila and a modelo, not bad! By the time it was well past 5:00pm, next door was open but we literally came back here in less than 5 mins because it was so dead next door, plus they had the 80s/90s jams playing, the type that'll make you do a couple body rolls here and there.\n\nWe didn't bother looking at the menu for any beers or cocktails and just went for another round of the beer and shots. At this time, spots were well taken over all over the place and I would only expect it to get more crowded on game days. I definitely would come back and try more on the menu, happy hour from 5-7. Good vibes here!", "author": "Georgina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "May be an amazing deal, but he whisky is crap crap crap. Hold your nuts while you take your shots, because you'll feel like a _ _ _ _ _ afterwards. Peace\n \nUncle Paul", "author": "Pauloes B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "A little piece of heaven! Food, drinks, great service, SUPERB music and the atmosphere is exactly what you need when looking for a place to DRANK!", "author": "Daniel E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "With a passable drink menu and plenty of appealing \"bar snacks\", The Woodbury is the kind of place you want to hit for happy hour, or late night after a Giants game. It's fast, it's reliable, and it'll get the job done.\n\nThey have high-top tables and open space to walk around and mingle. The noise level is loud enough to drown out any awkwardness (just in case you're on a first date or hanging out with \"that couple\") but not so loud as to prevent conversation. \n\nAlthough I balked at the junk-food heavy menu, my friends ordered a sampler and the chili-cheese tots and both were delicious. The tots were especially good, with a hearty, spicy chili and queso fresco + green onions on top. I would gladly get those again, and I'm excited there's another variation on tots left to try. \n\nIf you're into \"Frito Pie,\" onion rings or chicharrones - you'll love the menu. If you're looking for vegetables and salads or a  sit down meal, keep looking.", "author": "Catie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Pretty cool spot on the way to the Giants Game.  Really chill place with two bars one on the side and in the back.  They have a decent selection of drinks and the service was quick and friendly.  It's first come first serve seating just FYI.  They even have old school SNES games too in the back to play as well. \n\nFood was ok.  Small portioned and nothing special.  But a good place to grab a drink after work or before the game.  Place was packed when we got there so must be a popular place.\n\nUPDATE: So the manager message me and told me that food was made separate from a different company.  The bar area and drink are all Woodbury, so in that case I have changed my 3 star meh to a 5 star yes.  Close to the park, great drinks, awesome atmospher, and old school SNES games.  What's not to love?", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Stopped by here before the Giants game last Saturday.  I really liked the ambiance. The happy hour is one of the better ones in the area and runs until first pitch.  The ribs were delicious, as were the tots!  I'll definitely be back to this place!", "author": "Warren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "One night in San Francisco, I found myself drinking Miller Light on a boisterous party bus, in celebration of a friend of a friend's 35th birthday. I can only assume this is what you Bay Area folks get up to on the weekends when you're not hating on us losers in SoCal.\n\nI got off the bus at some point, only to end up rejoining the same party when it reached Woodbury, its final destination, after midnight. (I think Alchemist was the original target, but it was either closed or full when the bus arrived.) I was fairly drunk by this point in the evening, but I remember liking the bar. It was one of those comfortable bars with a lot of wood and probably too much effort at man-cabin taxidermy chic. Busy but not too crowded, with decent atmosphere. It was easy to get a drink and service was fine (which is to say I remember nothing about it, good or bad).\n\nThere was a full bar but I stuck with beer. There was a decent selection on tap, though I didn't end up drinking anything I couldn't get in my own town. I had a Deschute's Black Butte Porter and a Dogfish Head 90 Minute IPA, both solid options.\n\nI wouldn't go out of my way to hang out here or anything, but I liked Woodbury, and it was a good spot to drink and talk and hang out. Low hassle for a Friday night. Party buses welcome.", "author": "Steph C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-28", "description": "I was here with a group of 8 people for JUST drinks (well we had tots also) and was charged an automatic 20% gratuity.\n\nI asked the manger via email about it the next day (didn't want to cause a scene then) and they said the server 'mentioned that she told you about the gratuity and that she circled it on the itemized receipt.' \n\nI can understand and accept the auto gratuity if we had sat down for dinner.\n\n-----\nUPDATE after Phil's response:\n\nSo Phil C. expects us to tip $3 on a $15 drink here. Yes, server did inform and circle gratuity AFTER - not when we ordered.", "author": "Jesse D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "We went for drinks here on a Thursday night and had a great time.  They have a big open space with plenty of seating (at least on a weeknight).  They had all of your standard beers and liquor in addition to a number of beer and shot combos ( that's your thing).  We didn't try any of the food, but the couple sitting next to me ordered burgers and they looked juicy and delicious!\nIt was an added bonus that they were playing an awesome throwback playlist of 90's Top 40, but it might have been because it was a Thursday. :)", "author": "Gloria N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-30", "description": "I came to Woodbury for a drink before a Giants game. It was during happy hour so I offered a Moscow mule ($8), but this was not a Moscow mule. It was vodka + ginger ale and a squeeze of lime. A Moscow mule contains ginger beer. If I wanted a well drink I would have ordered a vodka and ginger. \n\nWorse than the drink was the insanely loud music. No one here is trying to dance, they're trying to have real live conversations because it's happy hour. Turn the music down. I couldn't wait to leave because of the assault on my ears.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Really cool bar.  Great drink specials and really good quality bar snacks.  The ribs are epic as are the buffalo chicken nuggets.  Really good service too", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "Play some games before the game! Video games before the ball game. Yep!\n\nThis will probably be the regular stop before hittin' the park from now on. It's super close to the park but wasn't overflowing like some of the other places in the area. There were great game day deals. I got a gin and soda for $6. Decent pours. \n\nWe got the loaded tots - gluten free!! - with these weird fish flakes but they actually complimented the pile-o-calories quite well! My boyfriend got the bacon wrapped hot dog and it was more like a nice sausage. I did manage to sneak a bite, without the bun. \n\n*Most importantly* they have a SNES, Sega Genesis and an Atari to kill some time while you wait for your food to come out. Lots of games and man Super Mario Kart is way harder than I remember it being. And the original Mortal Kombat is way less bloody. You've been warned.", "author": "Carol M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Cool place to hang with friends!\n\nVibe: casual \nInterior: love the rustic woody feel especially the chairs. Plenty of seating and standing room. The place itself is small but very rookie especially since the bar is on the size and another one at the end with bar seating\nCustomer service: very efficient and if you are sitting at the lounge area a waitress will come to you rather than getting up and ordering at the bar. Our waitress even came by to see if we need another drink or order from their food menu\nDrinks: my friend and I got a different beer and shot combo. He opt for whiskey and crispin cider for $13 and I got a tequila and dogfish 90 min ipa for $15. Great combo! Love me some IPAs\nFood: Good bar bites selection -- poutine just for $5??! And if you want fully loaded with steak or chicken just $3 more! We ended up getting fully loaded tots and reg poutine. Huge portion but the gravy on poutine was bland. :( no salt??! But the tator tots were gooood! Was super disappointed on the poutine. I wouldn't order it again and I'll stick to the tator tots or try something new\nEntertainment: super nes, Atari and genesis! Awesome!! Plus there was top 40 music playing in the background\n\nDefinitely will come here again and maybe even before Giants game!\n\nAlso a plus plenty of parking!", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-09", "description": "This bar is weird; more specifically the vibe and the clientele are weird. My friend and I came in expecting more of an industrial bar look and feel, and while you definitely got that from the decor, everything else just screamed sports bar. The first thing I noticed were the various bars located throughout; not knowing if they were specific to one type of drink or not, we sat at the back for a little more privacy. The back space was a shot and beer bar, so we decided to each try a shot & beer combo. They did have a lot of beer choices in the menu, and I was pleased by my choice. \n\nAround 5:30, when we first got there, it was still pretty quiet, but by around 6:30 the place was so loud and rowdy we started to feel claustrophobic. Service by then was basically nonexistent where we were sitting. We decided not to order another round because the bar had become bro central, so we left to find a quieter place to drink our Friday evening away.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "loud, very loud, so loud, having a conversation is near impossible.  I had a great time though, and the best part about this place are the video games in the back.\n\nBartenders are friendly and generous, but the scotch selection is absolute garbage.\n\nmy (drunk) female friend beat every guy that challenged her to mortal combat and street fighter. egos were hurt at the end of the night...", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "I'm a single dad with responsibilities so I don't typically spend my time at bars unless they serve my favorite tequila (Mi Casa).  With that said, I've become rather fond of the 'cheers' like comradely there and find myself going back more and more.  Bar staff always makes me feel at home and every single time, I've made a friends at the bar.  Did I mention they have a Genesis and a SNES on big wide screens?  Yeah, let your inner 80's baby out to play is what I say.\n\nFood?  They got it.  I wont comment on it though because I've yet to try anything more than the tots which were as good as tots get.  \n\nBefore writing this review I couldn't help but read some of the low ratings by other customers and I feel I can help you have a better time out there by giving you some advice on the do's and do nots of SF bars.\n\nDON'T:\n\n-touch the garnish.  It's gross\n\n-snap your fingers, make loud noises or raise your hand.  They see you and because they're not making vodka redbulls and making cocktails that take a freakin' minute it's a good time to practice patience and level up a bit.\n\n-close the door without permission.  I'm talking to you Sk L, would you lower the volume of a music venue if it were too loud for you?  Would you go to someone's office and lower the brightness of their computer monitor because it was too bright?  There's somethings for which it's okay to do when you're at home or your own place of work but you'll be surprised by how many business owners prefer to keep the door open, because it shouts to the world, 'WE'RE OPEN!'.  Bring some layers, SF gets cold.\n\n-get caught up in 1st world problems.  So what if Kanye was on Pandora.  Bartenders' hands are wet and they can't run to change the station every time Pandora's algorithms start fucking up and playing Kanye.  \n\n-complain about not tasting the alcohol.  Here's the thing about a well-balanced cocktail....lean on in.....closer....clooooooser.  Ok, a well made cocktail blends ingredients so well that it doesn't have to taste like a Long Island Iced Tea.  That's the whole point of a craft cocktail... \n\nWith that said, remember that it's important that you DO:\n\n- Have a good time\n- make some new friends\n- crack a few jokes\n- try something new\n- learn the bartender's name(s)\n- tip your bartender.  They work hard and you're automatically classier when you do.", "author": "Eli R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "Stopped in on a weeknight and was impressed with the industrial decor and friendly, laid-back vibe of the place.  The barstools have pedals for your feet like unicycles and the drinks come in mason jars!  All the little details that make a place memorable and unique.  \n\nI didn't stay long enough to get food, but have heard good things about the tater tots!  The menu definitely appears to be of the heavy bar food variety, but I have yet to see a place that serves bell pepper chips or a side-salad so I'm not complaining.  \n\nThe servers are very friendly, lots of TVs to watch sports and it's a short walk from the stadium - too easy not to stop by!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "Would give this place a better rating if the bartender wasn't such a [beep] with attitude. Sorry for the inappropriate language but it is what it is. \n\nCame in on a Monday night around 11 pm, super starved after a long day and in desperate need for a drink to wind down. The girl behind the bar (I'm assuming she's a regular bartender there because I've seen her before) took our order for food and drinks. \n\nI ordered a Ketel Greyhound while my friend ordered a Ketel Soda. Basic stuff. Not going to lie but the drinks weren't strong at all and you can barely taste the alcohol. \n\nWhen the food came, I asked for hot sauce or something spicy to go with my Fried Chicken Burger. Reason for the 2 stars are for the FOOD by the way! Anyways, asked her for extra Sriracha and napkins with some sort of utensils (which should be given if you order food at any given restaurant I would think) and she made this face as if we're bothering her. We had to flag her down once again because we wanted another drink and even though I swear she saw us waving (it's a Monday for God's sake, it's not that busy and the bar is NOT that big or long), she kept talking to a guy down the bar. Uhmmm...ok? \n\nWhen we asked for the check, she just straight up charged my card without giving me the itemized receipt or even asking me if that's the card I want it on. Some people may not think that's important but maybe because I work in the serving industry, you SHOULD ALWAYS make sure they get the itemized receipt so people can make sure they know what they are getting charged for! \n\nSorry if I may sound like a [beep] for writing this but I hardly ever writes Yelp review unless the place is extremely bad and in need of a reality check or it's excellent beyond expectation. I would like people to know my honest opinion and that's all there is to it. Hope that helps!  \n\nBy the way, this place used to have loaded tater tots when I went about a month ago but they don't have it anymore so I probably would never come back here again just because the food is mediocre and the service is just terrible.", "author": "Jayla N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-14", "description": "Shots 'n' tots! That's what Woodbury is good for - whether it's a post-work happy hour or a special celebration. Or you just need to get messed up.\n\nThough it might sound like a good idea at the time, tequila and chili cheese don't sit well in the stomach. Even fast food junkies can agree it's a bad combo. \n\nHappy hour? Yes! Dinner? Nope. Make this a first stop of your afternoon/evening and eventually stumble to somewhere with non-greasy bites and you'll be ok!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "i was really happy with this place!  have bookmarked it for a while now, and was excited to stop by last night for drinks with a girlfriend. the bartenders were really chill and friendly, and the foood was delicious!\n\nwe got shishito peppers, the dry rubbed wings, and fries - which were SOoooOoo crunchy and thicker cut and the dipping sauces were great. practically everything comes with dipping sauces.  we also ordereed a bottle of wine, and the glasses are mini mason jars, which was interesting!  \n\na friend ordered the mac n cheese sandwich and the brussels, which also looked quite nomsies.\n\nanyhoo - will be back soon hopefully to try other things, especially since it's right around the corner from my apartment!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "A great place for drinks. It's low key and chill. There is a good variety of beers, and it's own whiskey bar, which is kind of cool. There are also old school video games for entertainment. Surprisingly, I think we came here on NYE, and it was not busy one bit. Which was appreciated on my end.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "cool little bar down the street from my place. a little over priced but the drinks are strong and the food isnt half bad. also, i like that the music is at a manageable level. too many places blaring shitty music in this area, rendering any type of meaningful conversation useless.", "author": "Kelso M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Wow, fish tacos = bomb\n\nFrom San Diego and the expectations are met\n\nGood drink deals after happy hour\n\nBar tenders are down to the eart, they take care of peeps", "author": "Jared R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "This place is too cool for school. They have old school video games but make sure you don't use the busted controller\n\nDrinks were a little bit over-priced but the bartenders were nice and welcoming. The selection of alcohol was also strange; for example they didn't have el cassadores but they had ever other middle shelf tequila.\n\nIt didn't matter though we got drunk anyway. That probably why we thought the crowd was awesome because everyone was amused by us while we played drunken super mario world.\n\nDecor was very, dare I say, woody?", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "I don't know why but their chicken tenders are like crack. Crispy on the outside, moist on the inside. My friends and I tore into them and then immediately ordered another basket because we couldn't get enough.\n\nI like that there are big tables to house big groups, but there's plenty of floor space for smaller groups to be closer together.", "author": "Rosy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-16", "description": "Ok I get that they just opened. and there was a Giants game...I feel like this place will only get crowded because of the proximity to AT&T Park.\n\nPros: Strong drinks. Comped our SUPER SALTY shroom burger b/c it took 40 minutes. \n\nCons: No Happy Hour. People next to us got their fried food/sliders way before us when we ordered 20 min before them. Same thing with table on the other side of us. Took about 3 asks to get water.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "This is one of my favorite bars in this area. Super chill, good food, easy to get drinks and video games, what more can you ask for?\n\nPros:\n- good food; loaded tots are fucking good, & regular tots are good\n- 2 bars; 1 for stupid mixed drinks and 1 for beer and shots\n- good happy hour\n- snes that normally has street fighter going for the gaming nerds\n- bartenders are cool\n- plenty of seating \n\nCons:\n- packed after work and on game days", "author": "Tom R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "Let's see... Mouth-watering sliders, ridiculously good gluten-free wings, video games, delicious cocktails, and a separate bar where you can order beer and shot if you don't want to wait for me to get my fancy drink, really nice wood design throughout, lots of seating (I have no patience for crowded bars that force me to stand and balance my drink), excellent game-watching screens that manage not to make it feel like a sports bar (oh, it is also around the corner from the ballpark so perfect pre/post gaming), what else...? \nOh! Did I mention the food?!", "author": "Sole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "There is nothing like coming from a long day of work and stepping into a world where you can be adult and kid at the same time. Beer/Shot in one hand, and a video game controller in the other. If you are a Manly man ,Woodbury is the place for you. Or if you are a women who can handle a beer or shot and can enjoy real liquor (no long islands, margaritas here) also, if you don't mind dead animals on the wall, then this is the place to go!\n\nHighlights:\n\nDecor: Tavern style, wood paneling, antlers on the wall and hanging from the ceiling. This is a mans dream bar, the bar that he wishes his wife would let him have at home. \n\nBooze: This bar features beer both on tap and canned. Selection on tap changes so you can always come back for something different. \n\nLiquor: Very straight forward list, they have basic scotch, whiskey, rye, gin and tequila selection. If you are looking for cocktails, then head over next door to Alchemist for a more extensive list and tasty cocktails. \n\nFood: They have different selection of bar foods. Sliders, fries, Poutine and burgers . No frills and thrills , straight forward and delicious.", "author": "Kimberly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "The first thing we noticed at Woodbury was that new bar scent. I'm sure it will dissipate after another Giants homestand or two but for us it was the perfect spot to meet up pregame. We got there before the crowds and had no problem getting a table, our waitress Bree was super friendly and had some great suggestions, and the tater tots were pretty great!\n\nAlso, the prices are pretty reasonable considering the proximity to AT&T Park ($8 for a PBR and shot of Fernet is a pretty great deal anywhere in SF actually)\n\nGood stuff, I'll be back to try more of the food menu...you can find me over at the vintage Atari 2600 playing River Raid.", "author": "phil h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-11", "description": "Been meaning to check out the new kid on the block for a while, especially since I roll past them every day to and from work. Finally dropped in a few weeks ago for a friend's friend's birthday party, and got to check out the space.\n\nTurns out that this is actually run by the same people who run The Alchemist upstairs, which I'm a fan of. And while I didn't try much of the food (took some nibbles from the fries and tots, which were solid), and sort of cheated with the drink (one of the guys I know from the Alchemist made me an off-menu cocktail, since they mostly focus on beer and straight liquor here), I thought Woodbury was a pretty solid space overall, if not a bit on the loud side - whether or not this was because we came in on a game night, I can't say.\n\nA solid three stars, only because I'm a fan of fancy cocktails and places that are a bit more conducive to non-shouting conversations, and Woodbury doesn't cater to that really. If you like something a bit more pub-y though, definitely come check it out.\n\n***Accessibility Info***\n\nVenue - Plenty of space to maneuver about, until it gets crowded anyway. Unfortunately, from what I recall, all the seating is bar counter height.\n\nBathroom - Didn't check them out.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "Super cool and chill space, with plenty of seating, large screen TVs, and even small area with a video game console (people were playing Street Fighter when I went haha!) The bartenders are friendly and accommodating.\n\nThe cocktails ($9-10) are legit! They rotate the menu every week; I just asked the bartender to surprise me ;) and he gave me some delicious pineapple concoction. They also serve all their beers in glass jars. +1 star. \n\nThe lounge is located near public transit and ATT Park, so it's overall very accessible!", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-13", "description": "The food here was really so-so. The brussel sprouts were over-cooked. Everything was mediocre. I would only come here if no other options open.", "author": "Anne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Love the spaciousness. They serve food as well. The bartenders are friendly and they give you a generous pour. \n\nBest part? They have video games in the back!", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "So let's start off with how my first time here, I forgot my ID, so the bouncer wouldn't let me in. I was a little upset but hey, the guy is doing his job and well, that's my fault for forgetting my ID.  Okay, moving on to my second attempt here, the bouncer remembered me! Lol. Sweet guy and he explained he was just doing his job and I told him no hard feelings, and that I was glad he was doing his job, off the bat, great staff!\n\nWhen you come in here, it is a little confusing. So here's the low down, you seat yourself and you can grab a menu at the bar, but a server will come around to take your food order. If you can't wait for a drink, you can go to the bar to order a drink.  My friend and I came on a rather slow day, but it was game day, so once the game was over, it was PACKED! But before that, we were able to enjoy the calm atmosphere and enjoy the game from our seats without a bother.  The server was super nice, but not very attentive so it did take us awhile to order and reorder more drinks, but with my picky friend, she was super accommodating with his picky order of can we add this and take out this. How embarrassing. Lol. jk. But anyways, once it gets busy, you'll prob wait a long while for service because it told us awhile to get our check and leave because we couldn't find our server anywhere.\n\nWoodsbury mule was awesome! It was Kettle One with Ginger Beer and Lime.  A bit bitter with a mix of sweetness, and you barely taste the vodka. Def ordered seconds, along with shots. Lol. Food, my friend had the hot dog and added chili and i took a bite, it was delicious! I had the burger and super delicious.  There was a lot of stuff on their menu I wanted to try so I'll def be back! And one thing that truly makes me want to come back, they have N64 free for all to play! We didn't get a chance but I will be back to kick some ass on Street Fighter! ;)", "author": "Hepsie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-03", "description": "I wasn't that interested in their beer selection and it was the end of the night so my liver couldn't handle a beer and a shot, so I just tried the food.  The tots were great, nice and crispy.  The dry wings were pretty good - very crispy skinned, but the seasoning was just mediocre.  The loaded poutine was huge (well, I suppose it WAS the cost of an entree!) and was overall pretty good but just needed a little more salt.   \n\nI feel like Woodbury is more of a party scene for a younger crowd or rowdy Giants fans.  I encounter enough drunken Giants fans on my Caltrain commute, so personally, I'll be at the classier Alchemist upstairs.", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Came here after a Giants game. Cool staff, cool environment. Had a lot of fun. Would go back again. No food was being served but they had cute $3 mini coronas that made up for it lol.", "author": "Gee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Super friendly and nice service - opposite of all the irritable bartenders at bars on King.\n\nVictoria and dude with mini fro super nice and friendly.  Great music, large tvs with sports, good bar food until 1am, great ambience, definitely my late night grub or drink spot of choice now in SoMa.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "I absolutely love this bar. It's my go to place for a relaxing ambiance. The bartenders are very nice and attentive to everyone. They are super laid back as well. The food is surprisingly good for a bar. I return often. Call me a regular :)", "author": "Nadia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "Was really hoping that those appetizers would be better. \n\nAnd it was a little weird.", "author": "Dimple B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "All the servers wear yoga pants!!!!!! I LOVE this place!!!!!!!!!!\n\nTexted and tequila for the win\n\nTaylor is great", "author": "B.dot P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Gets crowded during Giants games but in a non game day it's pretty chill , good music and bar good , also good atmosphere. Also the bar has unicycle seats ..", "author": "C A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "I love coming here. My last reviews isn't indicative of how the bartenders normally are.", "author": "Alvin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "info@woodburysf.com\nreservations@woodburysf.com\n*The owners changed. It is Phil Chen.\n\nDear Kinson,\n\nThe service at Woodbury last Saturday night (Nov. 7th) was horrendous. I have rarely experienced that kind of outright rudeness, apathy and just plain indifference... it was as bad as a United Airlines flight. I have loved Alchemist for some time as do many of my friends. In fact, many of my startup clients and students are in your area and host Happy Hours and events at your place. I will not be recommending this to them moving forward. \n\nI went to close the door because it was freezing and the wind was blowing. The rude brunette bartender (Saturday night shift) walked right past me, went right to the door and opened it back up... no explanation, no communication, and even an annoyed rolling of the eyes. WOW, are we 12 years old and do we even understand BASIC CUSTOMER SERVICE? Seriously? \n\nSo, I walked up to ask for the water that we requested and had not yet arrived. I politely asked why we couldn't close it because it was cold... logical question. At first she just ignored me as if I was annoying her and she didn't have the time to address me... but the bar was not that busy. I asked again. \"We just do. Owners rules.\" A TON of attitude and again another opportunity to just politely address the issue. \n\nIt would have been perfectly fine if she had said, \"Oh, it's just our rules, but if you'd like to move to a back table, I can help you do that.\" I GET THAT! No problem at all! I would have been happy to do that! Instead, her friends at the bar (who were getting free drinks) started yelling at me that I was \"givin' attitude\" and even had the classiness to flip me off and go and open the second door... for what reason I still don't comprehend. CHILDISH, RUDE, CLASSLESS. Of course, the bartender did nothing to communicate to her buddies at the bar that this kind of behavior is reserved for middle school and NOT a cool bar in the in SOMA.\n\nI was shocked and incredibly disappointed and request that you please address this issue. We finished our drinks and went to 25 Lusk with an incredibly bad taste in our mouths. \n\nSarah", "author": "Sk L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "What's not to like about this bar? You can get a shot and a beer for $10! And their tater tots are the best I've ever had. You can get them loaded with your choice of meat, cheese, etc and it is the best drunk food I've had in a while. And yes I know, everything tastes better when you're drunk. But I've had it twice now - once super drunk (um devoured it with my bare hands) and once sober (ate like a lady with the proper utensils). Both times were amazing.", "author": "Ivy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "Need a cool place in SOMA to watch the game? Want some surprisingly solid food to go with that beer? Woodbury is your spot. Drink out of mason jars, order the juicy medium rare gourmet cheeseburger, and throw in some hot wings! \nThe cocktails are excellent as well.", "author": "Jia H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-02", "description": "My biggest complaint about this place has go to be the bouncer.  There's this one guy that works there a lot who searches people like it's an airport, and says threatening / intimidating things out of nowhere nearly every time I've been in there.  Things like \"I've got my eye on you guys\" and \"you'd better get a drink soon\"...and for no reason whatsoever.  This has been my experience several times when he's there.  I don't need to bring my business to a place where I experience that nearly every time.  It's too bad because it can be a decent time, but there's really nothing special about this place.  They have video games, but the controllers are all busted and don't really work.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-01", "description": "Came here with some friends on New Years Eve after a really nice dinner nearby.  I liked the layout and cocktails and decor but the music was so bad.  If you are a woman and don't want to be offended by misogynistic Bay Area hip hop, don't bother coming in.  The loud offensive music played all night and eventually we left to go somewhere more upbeat.  Basically if you like that music, stop by but if you don't, try elsewhere.", "author": "Joanna P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-10", "description": "Let me start off by saying, when I first walked into this place last weekend, I loved it. The atmosphere is super nice - a bit dark, with dark wood everywhere - just looks really nice. One look at the menu and again, awesome - they have beer and shots in one drink, or pair them up based on what goes well together. And then, I saw the video games! Who doesn't love a place that has Mario Kart on Super NES at a bar? Sounds great, right? \n\nWell, I've now had two service-oriented issues that took my 5-star rating down to 2 - a shame.\n\nLong story short, the first time I was there, my friends and I were ready to pay up, but were told that the POS is down and they can't take credit cards. I get it, that happens... but to wait until we're done and then tell us is super inconvenient. I told this to the bartender (instead of just running home to post it on Yelp), but he could have cared less.\n\nThen... this weekend... I went back. Arrived at 6:45 and the door was locked (which was odd since we were there at the exact same time the week before - and, Yelp showed the opening time as 6:30). A couple of seconds later, an employee opened the door and let us in, saying they just opened. Great! Well, we sat down at the bar, and the bartender refused to serve us until 7 - he made the comment that they're closed and just ignored us until 7:01. A couple of other people walked in and didn't know what to do. They asked if they could at least sit down he was ready, and he just kind of shrugged and said \"I guess, but I'm not serving anyone until 7\". Sure enough, we sat there and watched him peel oranges and stock fridges. Then at 7:01, he asked us what he can get for us - almost as if we just walked in the door. It was odd, and was very poor service. I get it - you don't open until 7 - well adjust your hours online, and at the very least, tell your doorman not to let people in the bar.\n\nHopefully this can be addressed. If so, the place is definitely worth visiting.", "author": "Derrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "Stumbled in for a drink while exploring the area.  Nice atmosphere but the drink prices were a little on the high side.  Great service!", "author": "Jason K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "This place used to be good, but the menu has gotten a lot worse over the past several months. First they cut the sampler platter (a great combo of onion rings, chicken tenders, and corn dogs) into separate and more expensive items, then they cut all of the items entirely. The burger was still good, but they now they cut that too!\n\nThe last time I went I got the only meal left on the menu -- the fried chicken sandwich. It was beyond disappointing -- it didn't even taste like chicken. If anything, it tasted like a thin slice of greasy crushed dreams. I couldn't finish even half of it. Also, they're not quite accurate about the drink sizes -- the glasses have markings on them for the size, so don't claim it's a 16oz beer if the top marking right at the top of the glass is 12..\n\nAnyway I'm just disappointed in this place's food. Used to be a great spot for a late night bite and drink", "author": "Alexander P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Came here before going to the Bey-Z concert a few weeks back. Arrive around 6pm, just in time for happy hour, yay! Ordered two blue moons ($6 HH price) and the loaded tator tots ( [~$12] cheese, ground beef, green onions) and it was amazing paired with beer. After about an hour people getting off work and wanting to get a drink started coming in and by 7pm the place was jam-packed! \n\nIt was pretty difficult getting a seat in this place, but managed to get a little spot at the bar thanks to the bartender with the curly hair and cool necklace (right on, dude!) \n\nOverall, cool spot to hang out before heading for a night out on the pier/ ballpark/ etc. I definitely will be coming back to have more of those delicious tots and try the rest of the menu.", "author": "Kathleene E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "Fun bar. I've yet to hit up the old video games in the back corner, but just knowing it's an option makes me happy.\n\nI haven't really had any of the cocktails, I mostly come here for the beer and bar grub. They have some fun snacky foods like tater tots and the beer selection is reasonably interesting, although i'd appreciate a couple more hoppy beers on the menu.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Arguably the best bar in SF... Zack is a mastermind at the helm...world renown bartender at your service... Great bar food, which is tough to come by... 5 stars, point blank, period.", "author": "Chad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Really yummy Moscow Mules and great Happy Hour before the Giant's game!! Great service too! Oh and the loaded tots are amaze!!!!!", "author": "Marny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Great spot after Giants games. More bar than restaurant, but clever and delicious drink options. Fun levels on beer + shot depending on what you like. Appetizer sampler was good and more than enough for four of us looking something to snack on after drinks at the bar (and game). Also, don't try for fireball. That's not their thing here, but with many whiskey and tequila choices, there should be something for most.", "author": "Rob E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "Fantastic place with a great selection of beer and the opportunity to re-live your youth with an Atari from the 80s", "author": "Louis C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-21", "description": "Highly NOT recommended!\n\nFor starters, the drinks were horrible. We asked for a Moscow Mule and received in return something far off from that (and of course, NO copper cup in case you were wondering!) We also were interested in a shot of Fireball but instead the bartender informed us that they did not have that and instead made us their substitute drink. By that I mean whiskey with chili flakes. One of the most disgusting things I've ever tasted!!\n\nSecond, my next complaint comes from my experience with the bouncer. I happened to walk into a stall with puke everywhere. The guy before me yacked everywhere in the restroom. Unfortunately the bouncer happened to walk in one person late and blamed me for the mess. I denied the incident and he proceeded to escalate and kicked me out. How about instead of worrying about throwing people out who just spent an arm and a leg on your disgusting drinks, you worry about cleaning up your restrooms? Wasn't going to continue to argue so my group of friends left. If I'm going to yack, Id own it. But at least in the end, I'm not the one who gets to clean the restroom - Poor guy.  \n\nI will admit, however, that any bar with a video game system is a plus. So that, and only that, will this bar earn TWO stars.", "author": "JM G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "This bar was everything my boyfriend and I were looking for in a gastropub on our first night in SF.  The ambiance and vibe were great.  Service even better.  And, the food just topped it off!  We share a ton of food, including the ribs (ridiculous!) and brisket burger (double ridiculous!).  Highly recommended.", "author": "Liza V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Great cause it's close the ball park, but that ain't NO Fritos pie! Take some lessons rom The Front Porch!!", "author": "O. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "I enjoyed the Alchemist the last time I was in the area so I figure I'd check out the groups new concept in Woodbury. Met a bunch of old co-workers after they attended some conference nearby,. I got their a bit earlier than them and caught both a Warriors and Giants game on the tvs. Then I found something more fascinating: two people busting out Mortal Kombat and Mario Kart on the video game consoles. Now that's cool. They've got two separate bar areas and have some interesting ideas in the drink dept. A \"Pop In\" menu where they have beers with liquor floats and spirits \"paired\" with beers in complementary fashion. Went with the Oaktown Brown Ale and Averna Amaro float and it was pretty tasty. When the crew showed up we ordered a ton of the menu. Loaded poutine (with skirt steak/bacon), loaded tater tots (with 4505 hot dog). sliders, Woodbury burger, Dry Rub chicken wings. Everything was solid but I really liked the tots and wings. Bree our server took really good care of us and for a 2nd night open they seemed pretty steady. Im imagining the game crowds before hand must have been torture, so Im glad we caught the mellow time while the game was going on", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Came after the Giants game (couple blocks away).  Came quick enough to grab seats but within 30 min the whole place was full of standing people.  Beers are reasonably priced and seems to have good enough selection.  Tater tots came with some delicious mustard-like sauce that was pretty good.  Good vibe.\n\nWould come again if in the area.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-17", "description": "They have some good specials, good food. \nBut waitresses seemed giving us pressure and felt uncomfortable.", "author": "May Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "Fantastic bar with an even better bartender. We were in San Francisco for about 24 hours while on a road trip. After leaving the Giants game, we stumbled upon this place and hoped it would fulfill our wish for creative cocktails and a cool vibe. Woodbury was exactly what we hoped it would be. \n\nI always call myself a \"beer and wine kinda girl,\" not because I don't like cocktails, but because I'm so damn picky about them. I don't like sweet. I don't like sour. I don't like the taste of vodka. A sour apple martini basically makes me want to puke. This is pretty much what I told the bartender, Kinson. (See, my experience was so good, I made sure to get his name before we left, knowing I had to write a review when I got home.)\n\nAnyway, Kinson whipped me up something that was the perfect balance of fresh and spicy. I can't exactly remember what it was, but I know it had basil in it. A lot of drinks followed, each one more inventive than the last. Each person in my group had at least 2 or 3 drinks, and our bill was half of what we expected it to be. We walked out feeling like we hit the jackpot of all bars. Too bad I live in So Cal and won't be going back any time soon, but I definitely recommend it if you're in the area.", "author": "Shay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "What a cool place! \n\nWoodbury is put together pretty well. It has a rustic-like, open wood, dark saloon kind of theme, but classy; a shabby chic. The bar area was very nice with stools for each patron, but it was really the Nintendo NES and the Atari that caught the eye of my friends and I. Next to the bar they offer both of these systems and wall mounted TVs free to play. A few beers and some video games took us right back to our childhood and sparked some fun competition in Mario Cart.\n\nUnfortunately, despite the great atmosphere, the great beer and drink selection, I have to deduct a star because of one incident. After my friend and I continuing to order drinks without providing a card or opening a tab, our other friend shows up and hands the bartender his card; all seems normal. It wasn't until about 15 minutes later, when we wanted to close out, that we're told that the card processing system is down and we need cash. The bartender admitted to knowing this since the 45 minutes we have been there. To resolve the issue, we each had to go to the adjacent building and use the ATM. While not a huge inconvenience, it could have been mentioned much sooner and avoided altogether.\n\nI will still recommend Woodbury to friends and family in the area based on everything that is great about the place.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Cool place, weird seating that isn't comfortable, and good wings. I asked for a whiskey neat and got 5-6 fingers which was surprising and excessive. So guess order for whiskey neat for two people? I'm not complaining. : ) I doubt it'll happen again anyway. \n\nService was decent. The servers were busy but did their best to help and were friendly. I'd definitely go back to try the food and see how much whiskey I get this time around..", "author": "Sneha P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Great new pub in the area with delicious bar bites. There's plenty of tables in a very spacious area so it's a great spot for happy hour. Their bar stools looks like unicycles!! So cool!\n\nThe chili cheese tots and the regular loaded tots were delicious! Highly recommend getting that. One thing I was surprise to find here is the Frito Pie! These are so popular in the east coast and I'm so glad I can find it in my hometown in the west coast. Frito Pie was delicious as well. Dry rub wings was blasting with flavors. \n\nStaff are friendly and they have a host for your table so don't worry about having to go to the bar to order. Tables are first come first serve; help yourself.", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "This place rocks! Great staff, good food, and a really fun environment. You can get pretty silly here, so long as it is in the name of fun and isn't bothering anyone.", "author": "Zachary T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-17", "description": "The staff can be rude and very hypersensitive to the ballgame crowd.  Their hours are a little frustrating in that they are only open on Sundays when Giants games are in town and have what I would consider limited hours on other days, compared to other bars in the neighborhood.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "Friendly, knowledgeable staff, great drinks, and delicious food! Stopped in here when in San Francisco on business and decided on a little pleasure mixed in. The Woodbury delivers on the experience.", "author": "Hugh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "This is a great new bar that just opened up in the soma. It has come great drink combinations for very reasonable prices. The bartenders are wonderful, and there is a good selection of liquor thats able to satisfy everybody. There is also a lot of space to sit or stand. \nI've been here about 3 times, and I was always very impressed. Keep it goin' guys!", "author": "Sami B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "Awesome stools - 5 stars.  No stout - zip, zero, zilch stars.   When I sat down I was greeted and told that they don't open for another 15 minutes.  It was 4:45pm.  I guess I am not in Sacto anymore where even the liquor stores have \"happy hour\".  So, he was kind enough to let me watch tv and use the restroom until they opened.  I asked for a stout and ended up with an Anchor IPA.  The menu looked good, but I can't share a review on that because I only came here for the beer.  I am sure this place is rockin' after a baseball game because of its location.  I am a cyclist and totally love the bar stools!", "author": "Wendie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "This place is awesome! I love the people and cocktails menu upstairs at alchemist. Always has a fun crowd.", "author": "Victor F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Yessss they really have old school video games like Street Fighter!  And Poutine?  Sort of.  Instead of cheese curds they serve it with Ricotta cheese.  OK.  But what really made it money was getting it \"loaded\" which added skirt steak (YUMMMM the seasoning!!) and some bacon (just OK).  They also had Black Butte on tap which is one of the best dark beers ever.  And a mini (7 oz!) Pacifico which is almost too cute for words.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "I organize my company's happy hours and we LOVE this place. This place is so stunning. Great location, within walking distance to the Caltrain station and ATT park. Full bar with excellent beer menu. The bites are scrumptious: my favorites were the mini burgers, and the faux vegan sushi roll. Also, we got to compete against each other playing old-school video games for free! How awesome is that?! \n\nService is outstanding too. The managers always make sure to stop by your table and make sure you are enjoying yourself. \n\nThis is a great stop. We will be coming back frequently.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "So my main gripe here is that the bartender never returned my credit card. Yes it is my fault for forgetting to get my credit card, but the bartender just assumed that I was going to keep a tab and never asked me (I have a bad short-term memory and usually always never keep a tab for fear of forgetting my card). \n\nOther than that...the place seems to be a nice chill place to grab a few drinks and see some old (new) friends. However, the music was way too loud for a bar...there was no dance floor...so it might be wise to lower the music so people can actually hear each other.\n\nI wasn't sure if there was a special or not, but I got charged $8 for just a blue moon. Pretty pricey for just a beer.\n\nI did have a good time as I saw a bunch of old friends. But I'm not sure if I would come back given the aforementioned.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "3.7 stars for me. \n\nI went to meet a friend here who had just returned from Mt. Everest. It was great to catch up with her. \n\nSince there wasn't a Giants game it wasn't packed, but it wasn't empty either. Perfect spot to gather with co workers or enjoy a beer. I would check to make sure there isn't a game before heading here. (Unless of course, you are looking for a close spot to the stadium to have a beer before YOU are going to a game)\n\nI had the wheat rascal, which I enjoyed, not too sweet. Service was excellent. \n\nThe food looked delicious for what it was. My party ordered the tater tots and the sliders. I had one tot which was delicious. The menu was good, prices seemed reasonable. My only problem was that there was no option to order something healthy.  A side of broccoli would have been great, a soup? Small salad? Asparagus? Sautéed Brussel Sprouts? All of these would be a compliment to the other food already on the menu. \n\nI would go back, especially if I was with a party who wanted to order beer and fancy bar food.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "This bar is dope! We left the bar upstairs and walked into Woodbury and felt like this is where we belonged all along! They were playing gangsta rap, had TVs with sports on, TVs with video games on, and the vibe was on point. Great drinks like the bar upstairs but a more lively surrounding. I'll definitely be back to try their food items and to kick it again and again.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Woodbury is a great neighborhood bar to visit, great staff, very homey, great place to go after a game, oh and love the cocktails!\n\nAndrea W.", "author": "Andrea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "A great addition to the ballpark area. Wings were really great and enjoyed the drinks. Wish I could remember which ones. . .  Our server, Brie, was really top notch. \n\nThe atmosphere is casual and very cool. The moose on the wall is a nice touch. \n\nI'll be brining my team back again soon.", "author": "Marc R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "I like the ambance of this SOMA bar. A great, big space with strong drinks. Came here both before and after a Giants game on a Tuesday and it never got too packed to be enjoyable.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-12", "description": "Bartender was unfriendly and we paid $70 for straight lemon jiuce kamikaze. Will not be returning.", "author": "Robin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "This place is super close to home, we have been here a few times! Bar-tending and wait staff are awesome and super friendly. Always suggesting drinks and making creative new ones. Taste the watermelon pepper shooter it's amazing! Not sure what's it's called. But it's awesome!! \n\nFood and ambiance is good, defiantly bar food. Tater tots are great.\n\nBeware on giants game days! It gets pretty packed :-)", "author": "Nichole P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "8 dollars for black label and a beer. Decent poutine, and some solid tater tots.\n\nThis place is solid. Easy area to find parking if there are no games, and if there are, its another option to pregame at!", "author": "Marc T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "This is a new-ish bar, located where Root Thai used to be (very briefly, not sure what happened).  I've been here twice now for happy hour since we live nearby and have really liked it so far.\n\nTheir drink theme is a bar and a shot - mostly separate, but also a few that are mixed.  My personal favorite is the Black Butte Porter and Ancho Reyes.  Food-wise, it's pretty good bar food.  We really like the loaded tater tots and I like the dry chicken wings (my girlfriend prefers saucy wings).  The prices a bit high and the happy hour deals aren't anything special, but it's SOMA so we're used to it.", "author": "T.J. H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-05", "description": "The bar is 50% full, I sit down. 3 bar staff, none cleaning none taking orders, mostly disengaged. Finally get a drink. Poor local bar.", "author": "Glenn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "Went there for the first time for happy hour with mom and sister.  My sister beat us there by almost an hour, and said the place was awesome when we arrived.  We were greeted by a nice enough bartender.  I saw Dogfish head 90 minute IPA and excitedly ordered.  Small mason jar, but hey, it's strong beer.  Mom didn't know what she wanted. \n\n Asked bartender for Mexican coffee... He checked, they don't have coffee.  Ok fine.  Mom looked behind the bar at the \"just the classics\" liquor, and asked what kind of martinis he could make her.  Bartender said \"well, it can have gin, or vodka, and vermouth...\", not understanding.  I ordered her a cosmo.  He made a damn good one.  Mom asked \"so what's the happy hour price for this?\". Bartender says it's not part of happy hour.  I pointed out that we ordered a well cosmo, and well drinks are discounted.  Female bartender stepped in, easily  and confidently saying it's $2 off.  Fine, cool, whatever.  Maybe he's new...  \n\nMom ordered mushroom sandwich, she said it was tasty. Her salt and peppered fries were awesome.  Sister and I ordered loaded poutine.  Mushroom gravy was overseasoned with a mystery ingredient, but overall yummy.  I had a full conversation with male bartender about my desire for jalapenos, and after confirming he had some, they never came.   Sister also ordered the bratwurst sausage, which she was looking forward to, but never came.  Isok, half order of poutine was enough food after all.  Food was good, little overpriced for what we got, and no happy hour food specials like we had hoped for.  \n\nSister and I agreed to go back a little later next time, as it started to fill up as we were leaving, and just drink beer, eat fries, and be open to the scene.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "awesome place for a drink and some grub. They have the best grilled cheese, honest. Only thing they are City prices. :)  The beer come in small glasses but if your in for a drink watch a little tv and lounge, its a must stop by", "author": "Ray R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Great food and decor wish they would have changed the playlist. They had the same playlist as the last time I was there. Great that they had no cover on a Saturday very casual no dress code.", "author": "Karla R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "Woodbury is the place to go before a game! I was there right before HH ended and we were able to order two rounds of drinks before 7. There was a pop up BBQ event going on so I was unable to try the tots that people have been raving about, but the food was good nonetheless. We had brisket and chicken tacos, shells and cheese, baked beans, cornbread.. all amazing. After the game we noticed the line was ridic but I would def return anytime I am back in the city for a Giants game!", "author": "Tina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "Casey U. muses on the formula to make a new bar in San Francisco sucessful:\n\nA new, popular bar should focus on fancy-ass liquor, and pour beer for a dollar or two more than anywhere else. It should have black butte porter for seven dollars, and P.B.R. for four bucks, and bad wine, but it should be alright because they're served in mason jars. It should have poutine on the menu, and tater tots, and a burger for over 15 dollars. The poutine should be mediocre, with sad wilted fries, sad, flavorless gravy, and an artesinal cheese which does not resemble the classic curd in any way, shape, or form (which is a travesty guaranteed to offend any self-respecting Montrealer). The bar should have a SNES in the corner with Mario Kart and Super Mario Brothers for children of the nineties with too much disposable income to get their daily bath of nostalgia while indulging in their long-repressed competitive impulses. A hip bar should have meats with a pedigree, and menus printed on high-quality paper that looks like its been through a war.\n\nWalking in to this hypothetical bar, you should feel unworthy if you make less than 75k a year. The clientele should range from 21-35 (in this town, if you're any older, you're finished), and everyone should have full heads of hair. There should be conspicuous displays of taxidermy (which means the bar is edgy), and strange chairs, possibly in the shape of unicycles (which means the bar is unique), and bartenders in ball-caps (which means that the bar is cool). It should be a place in a formerly bad part of town where you feel great taking profile pictures, and using your new selfie-pole (which I just found out is not a euphemism for a beef bayonet...if you know what I mean), and Instagramming your night for the world to see. It is a place of style, rather then substance.\n\nWell, hello Woodbury. It seems I've accidentally described you, right down to the tragic Poutine. You do the generic new bar thing well, but, to my untrained, impoverished, and unhip eyes, you're a totally unremarkable place.", "author": "Casey U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "Solid spot for post game food & drinks. We snagged a table and grabbed apme yummy appetizers. They have a cool list of beers and shot specials. Staff was super friendly. Thrilled to find a cool spot that isn't a total mess after the game.", "author": "Victoria O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "I'd passed by this bar multiple times on my walk to AT&T Park, but never stopped in.  Glad I finally did the other day because I was pleasantly surprised with the setup and the service.  The decor was enjoyable - cute, trendy, rustic, and clean.  The highlight of this bar experience was by far the fact that they have a Super Nintendo and Sega set up for customers to play.  Drinks prices are about what you'd expect in proximity to the ballpark, but they do have daily and ballgame specials that aren't half bad.  Worth checking out!", "author": "Kristen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "What a nice place to find! Great bartenders who care and want to deliver;the food was amazing :) will differently be back! Had lupia and chicken wings yummy", "author": "amanda f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Service was great. Food amazing. I think the cheddar burger is the best burger that I've ever had.", "author": "Shar C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "I was there, I guess day 3? No usual opening hiccups, for me and my friends.  Nothing but great beer, great food , great whiskey and unbelievably friendly service. \nWe had about 3 different servers at various times and all of them were incredibly gracious and friendly, without being fake. Will definitely be going back on a regular basis, just need a payday first. :-)", "author": "Coco F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "I dreaded picking a sports bar for Super Bowl Sunday, but one of my party suggested Woodbury and I'm glad she did! Despite how popular this place clearly is, especially during the big game, the staff was amazing.  I believe our server's name was Kinson(?), but man he was on top of things. We had the tots, the fries, and the wings (plus more beer/shots than I'd like to disclose), and everything was awesome. Big tv's all over the place, and video game stations to the right of the bar. Pretty typical food and beverage choices, but what set apart Woodbury for me was the staff. I'd recommend this place for any big game, and I'll be back soon!", "author": "Jesse G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Came in very early for Giants game. I saw this new place and decided to try it out. Awesome service and fantastic food! Sorry Momos.... I've found a new spot before games !", "author": "Ed H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "This place is dope. They have a pretty good selection of beers on tap. I've only been once but I'm guessing their beer menu changes. The food is a tad over priced for the portions but was very tasty. I'll definitely be coming back here. Wasn't too packed during a play off sharks game which was a plus.", "author": "William M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-02", "description": "Me and a friend were on our way to SF giants game and came across this little gem! Honestly it was the 6$ mimosa sign they had that steered me right in! lol! So both of us ordered the mimosa's which were poured into a slender mason jar! pretty neat and strong ;p ! and then ordered the breakfast...we got the basic eggs, bacon,and all that other jazz. I was definitely admiring the moose heads and shot bar near the back...it kinda gave me a feel of a game of thrones bar...lol..I immediately thought of king baratheon...anyway I can see how this place may be popular since AT&T park is 2blocks away...the only thing I wish this joint had, is bigger flat screens, if your sitting directly across from the bar, the TV is not big enough to see score and the game too much...I found myself squinting...anyway I see myself stopping by again no doubt..but mainly for drinks and the shot bar next round!", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-17", "description": "I really wanted this place to be great because I live a block away. Cool location and decor (like the bike tile/pedals stools). But the margarita drink of the day was really sweet with no salt option. The food was all bland and dry(!), especially for what should be flavorful, indulgent bar food: jalapeño cornbread (with weird cheese whiz butter), poutine fully loaded (with stouffers-box tasting gravy) and trio of sliders (one of them is literally bacon and bun, not in a good way)...unfortunate.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Crafty beers and decent apps. Good place to grab a drink with some friends. Bonus points for some old school video games in the back!", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "4 stars is for the food and service. The crowd and atmosphere I give 3 stars. I thought the place would be more spacious and the crowd would be older and uh not all start-up kids and older startup people ha. The food was really good, I said to a friend this taste like it's Asian inspired good...then all these Asian young chefs started coming out from the back, I was right! The tator tots with hotdogs and fish flakes were heaven! My friend loved the spiced wings, I thought they were ok, it was alot of white pepper and salt. I could pass of the Cuban sandwich, It really just tasted like a pressed ham sandwich, boring.  It needed Pickles to cut the rich meat taste. Beet salad, I've never had beets that were crunchy before, was it done on purpose?, it was still tasty.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Alchemist was getting really stuffy (literally and figuratively), so we moved downstairs to Woodbury.  It's much better ventilated, more spacious, and much more chill downstairs.  They also had some pretty good tater tots and mushroom poutine fries, which are awesome right around midnight.", "author": "Marilyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "Another great new bar! This place used to be a Thai restaurant but clearly, it wasn't doing well. Now that the owners of Alchemist took it over up stairs, they turned it into an awesome new bar with great bar food and wait for it.... SNES and Atari video games! The vibe of this place is a lot more laid back and has ESPN on which is always nice if you ask me. They have two full bars and the place is pretty spacious with plenty of seating. I highly recommend coming here for HH or before a giants game.", "author": "edward k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "Came here after a giants game, many others had the same idea.  Fun little bar with awkward metal stools and cool vintage video games.  I didn't drink but my boyfriend had an old fashion and seemed to enjoy it.  I didn't interact with much of the staff but they definitely looked like they were hustling to make drinks and keep everything clean.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Stopped in here on July 3rd right about happy hour- with a holiday - it's almost like a Friday night. The atmosphere was good, nice decor - I love bench seating across the back of the bar. It was full, but not too crowded and we were able to find a seat. Like most bars these days the design looks snazzy, but also makes for a loud venue if trying to talk - but I figure that's expected.  They were out of the mushroom burger which made me sad, but I got the salad with the savory almonds & poached egg - a poached egg makes everything more awesome.  My guy had the basic cheese burger and it was tasty - the fries - of which I stole TWO were good - crispy but not skinny. I was a fan.  Our friend had the spicy brat which she said was delicious too. We also had beer and cocktails - I love a Paloma (tequila and grapefruit) - Everything was good and fresh - some reviews say it's pricy, but it seems pretty normal for SF to me. The standout was our service. Jamie M (I think) was super nice and attentive -offering suggestions and keeping the water and the cocktails flowing.   \n\nOh and while it was full at 5-6-7pm - by 8-9-10 it wasn't very full - maybe that's the holiday and no game, but it was totally chill and the guy girl ratio was most certainly in favor of the ladies. \n\nWe will be back - thanks for a nice easy fun evening out.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Super fun place. Special shout out to Rah and Victoria (was that her name? I remember her name being all queen-ish). Rah was super chill. Victoria funny as she's gorgeous! Coming here again for sho", "author": "Ankush K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "I crave the POUTINE!!!  And beating everyone else here at Street Fighter 2.  I beat the owner and he had to walk out of the bar ashamed and sad.  I love this place - it's very comfortable and I will be here many more times.!  Kinson is baddass!!", "author": "Matt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "Stopped in on a slower night, Met Kinson who was working. Made me and my friends feel like we were old friends. Had a blast and he made great drinks as well. These are the type of people that make a spot great! Grab some drinks and get nostalgic and play some mario cart", "author": "Tommy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "Was lucky enough to attend the pre-opening party at Woodbury last night. As a perfect compliment to its sister bar, Alchemist, it fills in the gaps that you might not find upstairs... Woodbury has T.V.'s, video games, snacks, lots of beer, and a Moose head! Can't wait to go back!", "author": "stephani p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "I already had a bad experience in the past with this place due to the incompetent bouncer they hired, then on July 23rd during a MetroWize-hosted event, they not only screwed up on the drinks my party ordered, but also overcharged us. Since there was a drink special going on with MetroWize, but the bartenders still charged everyone in my party the same regular price, that's 2 strikes. And apparently not just the bouncers, but the bartenders and the event organizers are incompetent here too, DON'T COME HERE UNLESS YOU WANT TO BE CHEATED.", "author": "Keoini H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "love the food and atmosphere. great place to watch the game and eat amazing bar food. the service is amazing and everyone is always so friendly and nice. my go to spot for a chill day/night.", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "Great ribs,music, and atmosphere! What more can you ask for. The portions are small but if you want nice high end bar food, this is a great place.", "author": "Adrian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "This is a cool neighborhood bar. Really good cocktails, you can also get a beer and a shot with top shelf alcohol for $10. They also have super Mario on big screens in the back. The bar stools also have peddles - my one complaint is that they don't move so I can't work out while I'm boozing.", "author": "Ayele A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Awesome bar, great beer+shot combos and they serve food until 1 AM. Bonus bar on the second floor but under a separate name. They're connected! 'Wood' definitely recommend with a group of friends.", "author": "Ana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Finally.... a real restaurant with real food and a real atmosphere. It just goes to show you the difference between posers and professionals.\n\nFood still needs refinement.  But it's only their 2nd day.\n\nAtmosphere....simple and inviting. \n\nStaff....still needs to pay more attention.  But, again, it's only their 2nd day. \n\nWay better than 3rd Street Bar and Grill....and you don't have to deal with a grumpy old waitress/owner with an ego.\n\nMy favorite appetizers are the beer and shots!\n\nThis place is your local hangout just to meet, eat and have fun!", "author": "Karma Is Coming 4 U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "My favorite new local spot. Not a sports bar, though they'll have the games on tv - no audio. Not a dive, but affordable and staffed with great people, with some tasty grub.", "author": "Tamas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "This place has Moscow mules on tap! The bartenders helped break the ice on a blind date, so we had a great time. The tots were tasty too. We will be back next week.", "author": "Zachary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "Came her before giants game. They have nice set up of TVs which they were playing the World Cup games. Score! Super knowledgable mixologist who helped me choose a great cocktail the Passarinho. Will come back for this drink and the great service and oh did I mention they have Mario cart to play!?", "author": "Laurie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "I went here after the Giants game a week ago and I am glad I did!  The staff, from the servers to the bartenders are very friendly and made me and my friends feel right at home.  The cocktails were amazing and the vibe is very exciting yet laid-back.  I was impressed with the service and also with the food, which is something I am very picky about ordering from a bar type facility. \n\nA nice touch was also the moose on the walls however I am Canadian.  I will be back next time I am in the city!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "Definitely a cool place. The wings were a solid choice and the burrs are great. They have some awesome and personable people on staff too. 100% vibes", "author": "Ian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "if you love tater tots, this is the place to go.  chili cheese tater tots was DEVINE.  shot and a beer is their specialty.  definitely recommend it.", "author": "Christiana L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-15", "description": "service was good. was drunk and in need of some food, this was not the place. saw a bunch of great reviews but the food lack salt or any form of seasoning.", "author": "Gabrielle A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "cool atmosphere pricey drinks poor service worthy of a 3 star rating wish they would be more attentive to the guest you have to approachnthe bar for anything you need no service at the tables avoid the loaded tots the bonita flakes are sooo fishy!", "author": "Casilda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-11", "description": "a sports bar trying to be a hip cocktail bar~ the atmosphere and decor was nice, new looking, and tidy. they had a Super Nintendo and an Atari set up when I was there, which was super fun. the bar itself seemed kinda limited spirits wise, but the service was speedy, and cheerful~ the bartender remembered every drink I ordered, which was a nice personal touch. overall, maybe not a destination bar for me, but if I was wandering around that area again I might go back.", "author": "Iliea S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-07", "description": "Cool space.  Didn't love the cocktails.", "author": "Amjad S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "this place is... interesting.  i don't really think the people who made this bar know what they wanted to do judging from the deer/moose heads on the walls, to the beer and shot and tater tot menu, to the super nintendo and atari games in the corner. but hey i'm not complaining!  anywhere where can get a shot of whiskey, modelo, chili cheese tater tots while kicking ass in street fighter i'm down for. and it's right in soma so super close to work, i'm happy.  service is a little slow, but it's a hipster bar! it all makes sense!", "author": "Reyana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Chill spacious bar and drinks were decent. +1 star for the working SNES.", "author": "Drew L."}
