{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Food is delicious \nStaff is so attentive and welcoming\nLove the ambiance warm and inviting \nDefinitely recommend it", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "Wow this place finally not crowded yet. Went early dinner with baby. His mom recommend this place to eat. Yes beans beans is good. But the sweet n sour omg light batter fried with tasty sauce .. curb my craving.. cuz of my vision sight. Inside was little dim lighting for me.. staff was quick n nice.. this place is a 2 thumbs up yay...", "author": "Crisy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-22", "description": "Not authentic. Dumplings were really bad. No soup at all inside and the skin was dry. The Dan Dan noodles were so bad my friend and I left a full fish uneaten.", "author": "Clara Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Love the Bao!  These Bao are king size!  Our basket of 8 Bao was more than enough for the 3 of us, as well as the other dishes.  Good service!  Not pretentious or snotty waitstaff!  I really enjoyed our meal here!  Sorry-no photo of the Shrimp prawns-our diner was really hungry for his prawns!", "author": "Molly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "I was hanging out with the boys when we realized some friends were in town. I was starving, so we decided to meet up for dinner at Xiao Loong Restaurant in West Portal. (One of the boys suggested the restaurant as he's been here before.) I believe my girlfriend called ahead and made a same day reservation for our party of five. The three of us arrived first on Saturday, January 6th around 7:45pm.\n\n*Xiao Loong Bow: hand rolled thin chinese pastry, stuffed with ginger marinated ground pork, then steamed 'til plump and juicy ($10.95)\n*Dry Sauteed Green Beans: fresh green beans, flash-fried and tossed with a mixture of fresh minced ginger, chopped garlic, minced preserved chinese turnips, and roasted red hot peppers in house soy sauce ($11.95)\n*Mongolian Beef: tender sliced beef sauteed with green onions, julienned yellow onions, and roasted red hot peppers in house sauce served on a bed of crispy rice noodles ($12.95)\n*Spicy Garlic Pork Belly Fried Rice: jasmine white rice stir fried with garlic, chilis, green onion, egg and tender stewed pork belly ($11.95)\n*Taiwanese Popcorn Chicken: chicken thigh meat marinated with garlic, ginger, pepper, and five spice powder lightly battered and flash fried topped with crisp basil ($9.95)\n*Dry Sauteed Brussel Sprouts: fresh brussel sprouts, flash-fried and tossed with a mixture of dried spices, fresh minced ginger, chopped garlic, minced preserved chinese turnips, and roasted red hot peppers in house soy sauce ($12.50)\n*Sizzling Rice Soup: shredded chicken, shrimp, water chestnuts, sliced shiitake mushrooms, peas, and spinach in a light chicken broth topped with sizzling rice served tableside ($14 large)\n*Xiao Loong's Hot Braised Fish: daily fish topped with a rich spicy mixture of minced black mushrooms, water chestnuts, bamboo shoots, fresh ginger, chili, and garlic ($14.95)\n*Hunan Hot Pepper Pork: julienned pork stir-fried with jalapeno pepper and onion in a spicy sichuan sauce ($11.95)\n*Steamed Jasmine White Rice ($2)\n*Tsingtao ($4.50) x8\n*Lichee Congou Black ($3.50)\n\nWe had so much food! But we actually managed to finish most of it. I adored the veggies. The greens beans retained a crunch and the brussels were nicely fried. I was excited to try the fish and xiao long bao as those are two of my favorite dishes. I thought the XLB had good flavor, but they weren't that soupy. The fish wasn't the dish I was thinking of, but it was cooked nicely. (I wanted the fish cooked in chili oil.) The soup and fried rice were also tasty. I love brothy soups, so this hit the spot. The pork belly added a nice meatiness to the fried rice. I'm not big on saucy meat dishes, so I thought the mongolian beef and pork were okay. The popcorn chicken wasn't quite as savory as the one from boba tea shops (probably cuz of the lack of MSG?), but it was a nice deep fried dish.\n\nCute Sichuan spot in West Portal. Definitely fed our hungry bellies.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "So I'll be the 227th review. Only point of another would be to add something new or solidify what's already been said. \nI can't add new; the accuracy of the reviews of the dishes seem pretty spot on. I can only confirm that it's a good place to come eat tasty Chinese food. A touch of authenticity yes, but still prepared to be palatable to the masses. And there's nothing wrong with that. The flavors meld deliciously, and yes some dishes as noted are better than others. \nIt's a small place so at peak hours you'll probably have some wait. The service is quite good, attentive and efficient. \nWe four left feeling happy for having dined there; isn't that the point ultimately of going out to eat? Wether it's at a Michelin restaurant or here, the local little place, leaving feeling good is always nice.", "author": "Peddie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Got together with the girls for dinner here.  The place is small but cozy and service is attentive.  They have a big menu and you can either eat family style here (sharing dishes) or order your own.\n\nThere were five of us and we ordered separately but got to try each of the dishes:  xiao loong bao (are huge here and come out piping HOT) - tasty, dried fried chicken was a-ok, Chinese style fried calamari which was good but alittle too much batter, dried fried green beans, delish and crunchy, baby bok choy, spicy chili prawns (not spicy at all), brussel sprouts with pork belly which didn't seem like it belonged in a Chinese restaurant, prawn fried rice was a bit salty, beef chow fun.  The portions were plentiful so we got to share the dishes.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Excellent food. Courteous service. I like that they let me choose my table. Clean place. The dry fried chicken was great, as were the green beans. Price friendly. I will return to this excellent establishment.", "author": "Marshall S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-04", "description": "The taste is ok but do not expect authentic Chinese food here. I've never seen mo por tofu with some kind of black soy sauce like this- plus why adding garlic? It does not help with any flavor if you don't know the right technique to use it; it's also an ingredient that needs to be used cautiously because of the breath people have after eating it. I would rather walk into the kitchen and cook this myself. \n\nPro: price; the place is decently clean and with sunshine", "author": "Tianyi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "What a great spot!! I just ate here with a friend and was really happy about the overall package that their lunch special offered.\n\n+About $10 pp for lunch: \n+ The set lunch came with quite a lot: a main plate, rice, corn & egg soup, and an \"appetizer\" (see photo)\n+ The food was all very tasty! We got the garlic chicken and fried chicken with brown rice\n+ It wasn't crowded when we went, and the food came out super quickly\n+ My pal and I were dog sitting for her cousin, and the staff was kind enough to let us bring the little pup into the restaurant! How hospitable! \n- The only thing that disappointed me was that it was advertised as coming with said \"appetizer,\" when it was just a thumb-sized spoonful of pickled veggies. Oh well- it was all still great! \n\nAll together, this is a solid spot to grab a very affordable and tasty weekday lunch! Perfect for working from home or for that random day off you have where you'd like to #treachoself! Thanks, Xiao Loong, for the great experience!", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-24", "description": "We got take out tonight\nThe menu looked pretty good but the food: Mongolian beef,&chow fun were quite bland. Dry fried green beans were pretty good but overall, I was disappointed. A big let down for the price.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-07", "description": "$12 for a partial takeaway container of sweet and sour pork. Pork size pieces were no bigger than a nickel. Pretty disappointing. They also never confirmed my order so I didn't get to eat until 75 minutes after I put in my order. XLB had no juice and incredibly thick dough. One of the worst Chinese restaurants I've had in SF. They did include chopsticks, napkins, and sauce so that was a plus.", "author": "kiwi l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-06", "description": "A real let down.  The service was good, but that was it.\n\nFirst, the prices are high for entrees.  \n\nNext, the flavors are really lacking.  Where is the spice and wok taste?!\n\nFinally, the beef and pork meat quality were poor.  For the price and location, I expected better quality than a discount Chinatown joint. \n\nWill not be back...", "author": "Eric A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Born and raised in San Francisco I've tried a lot of Chinese food. I am fortunate to live only a couple blocks away to some of the best Chinese food in all of San Francisco! Who would've thought that West Portal would be home to such incredible regional Chinese dishes. The dumplings are amazing, fish dishes spot on , old school chow mein best in town.\nI highly recommend this restaurant .", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "I did enjoy the food at this restaurant.  I had the Vegetable Chow Mein and Dry Fried Chicken.  The Chow Mein had plenty of veggies and was quite tasty.  I appreciated that the Chicken and Sauce were separate.  I hate when the food is drowned in sauce and I do prefer to put my own sauce on foods.\n\nThis will definitely be one of my mainstays for Chinese food.\n\nOne of the big reasons I am giving this restaurant 5 Stars because of the OUTSTANDING customer service.  I was given a glass of water while waiting for my takeout and the staff was welcoming and extremely friendly.  \n\nThe only downside are the odd hours but I will be coming here mainly for dinner now that I know.", "author": "Geneva F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "Nori seaweed soup is nice. However, the Xiao Long Bao and Tan Tan Noodle don't worth the price at all. Especially the Tan Tan Noodle, it is extremely sweet and I even taste peanut butter in it. \n\nThe service and environment is good but food is totally disaster. I'd rather get Xiao Long Bao from Trader Joe's and microwave myself.", "author": "Jiawen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "This is my go to take out place. I work right up the street and grab some dinner almost once a week. Their honey walnut prawns is to DIE for! If I could eat one thing for the rest of my life that would be it! Small restaurant but the food is good and so is the service. Prices are a tadddd high but you get huge portions and I think it's worth what you pay for.", "author": "Angelica V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Delicious food! Great homemade potstickers, the asparagus was amazing along with the Mandarin beef. We will be back next time we are in town.", "author": "Genevieve A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "Was my 2nd choice. The place i wanted to eat at had a sign that said they were closing on Tuesdays now! Boo.... i walked 3 blocks to find this place, bc some months ago, a friend of mine was in the area and we walked around and she informed me that she's eaten @ Xiao and she enjoyed it. \n\nThey had weekday lunch specials and bc of this, seemed to have no trouble during the lunch hours. I ordered the lamb. For $7.75 that was a pretty good deal. Should have known...when the food came, there was a good amount of rice, however, as i got to the sliced meat, i noticed it sat on a big bed of yellow onions, green onions, dried chillis (10 of 'em i counted!!!). So, the meat was *very* skimp. i think the pile of onions weighed 3x more than my meat. I'm not much of a meat glutton, but, i felt it was a lit' smller than a child's portion sized. Next time, i'd ask for double the meat portions and they can charge a few bucks more.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-07", "description": "I was at SF to pick up my cousin from the Airport so I stopped by to have dinner with my uncle while waiting for call.\nI thought this restaurant is owned and served by some Chinese workers that speak Chinese and have Chinese menu.  But nope, they are all English speaking servers and fully English menu. I was okay with it. Here is my rating chart, all out of 5.\n\nRestaurant space: 3/5-super small, so small that you barely able to move between tables, you pretty much can't sit back to back with people on the back of your table\n\nService: 4/5- it was fair in my case even though the waiter forgot few things on my order. \n\nAppearance:3.5/5- the interior looks nice and the Lightning is great. One thing that bothers me is their menu. They are so sketchy if you compare it with the interior. They use paperclip to hold one of the page of the loose menu(maybe redesign and reprint a new menu?)\n\nTaste:3.5/5- I and my uncle ordered a plate Black Bean Chicken, String Bean and 3 orders of Combination Fried Rice(because we assumed the portion is not going be big and we were right). The String Bean was pretty good(genuine with Wok Hey锅气) and Fried Rice had strong favor and smell of egg and we loved it. But the Black Bean Chicken was lacked of taste of Black Bean and that was a let down.\n\nIf you are looking for Cantonese dish. This is not the place. It's more welcome for American people who loves Broccoli Beef and Orange chicken.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "I love this place.  Yesterday was the second time I've been there and I have left totally stuffed and satisfied each time.\n\nIf you haven't tried their lemon pepper shrimp, you've got to stop by and get an order.  They are TO DIE FOR.  We also had the dry fried string beans and the pork fried rice.  I don't know what they do to their dishes, but their courses are always more delicious than the dishes I've had at other Chinese restaurants. \n\nIf you like Chinese food, run - don't walk - to this restaurant.  Highly recommended!", "author": "Roberta K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Service is excellent and they are happy to adjust dishes and add different veggies depending on your preference. Hot and sour soup is the best I've ever had and the eggplant was very good. Lots of good Americanized chinese dishes. This will likely become our solid, go to, non-special occasion chinese restaurant in our neighborhood.", "author": "J A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "I've only been here a few times but the service is always great and the food is really good. Big portions and solid flavor on all the dishes I've had so far. It's a nice place for a date night or to meet up with a friend in the neighborhood.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "This place may be small but the food is good. Had lunch here today and it was more that enough. \n\nI actually planned to come here because in my past attempts they have been closed.\n\nSo, today made perfect sense especially with the gorgeous weather in San Francisco. I got here around noon and walked straight in. I took a seat near the back corner. \n\nThis place has a unique vibrant style to it. There is a lot of gray on the interior but it works well. The staff is very polite and welcoming. The staff apparently have to be in formal wear which is cool. Service is quick and painless. There is rushing to place to an order but they actually say, \"Take your time\". BAM!!!!! This is how you keep customers coming back. Comforting words go a long way in customer service. \n\nAs far as the food goes it was what I needed. I had haven't had Chinese food in some time so it was nice to get something different. But of course I get my usual order, that I couldn't help, Mongolian Beef. It was on the lunch menu and I had to. The only difference in this order compared to the others was that I chose brown rice over the white rice. When I saw the plate coming to my table I knew that I had made the right choice for lunch. \n\nThe plate looked amazing as it was brought over to my table. The orange slice is always a nice addition to the meal as well. The food was good. Just the right portions of beef to rice. That ratio is always important because if you have too much rice you will get full quicker. FYI, keep an out for places that do that because they will compensate for the shorting you on other stuff by putting more rice on YOUR PLATE!!! \n\n(Side Note: The more interesting thing about this lunch was the conversation that was going on 2 table away. They were discussing their Christian faith which I found to be a breath of fresh air. It is not too often that people discuss that openly but it was nice to see that people are getting more comfortable in doing so.)\n\nBack to the meal. The food was good and I would recommend this place. Parking might be terrible because there always seems to be heavy traffic along with construction on the streets. My suggestion take public transit or park in the residential and walk over. \n\nEnjoy and happy eating. The doctor is OUT!!!!", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Even though the staff is young and Asian, there is definitely a suburban, middle-aged feel to this somewhat fancied-up Chinese restaurant. Maybe it was just the sour-faced clientele that evening since it sure didn't have the hustle-bustle feel of Chinatown or even the Inner Richmond (photo: http://bit.ly/1E9l66E). It's West Portal after all, a neighborhood that feels to me like someone took a piece of a peninsula suburb like San Carlos or Redwood City and transplanted it into this part of the city. I came here by happenstance since I just decided to stay on the M-Line longer. It certainly looked inoffensive enough in here, and I felt guilty for being seated at a table for four since they didn't look like they catered to solitary diners.\n\nThat became clear when I saw the huge portions being served at the other tables, and it was also reflected in the higher-than-Chinatown prices in their voluminous menu (10 pages and counting). And yet, I was kinda starving so I threw caution to the wind and ordered away. First up were the $8.50 Steamed Vegetarian Pot Stickers, a half-dozen huge ones in a bamboo steam basket filled with minced Shiitake mushrooms, Napa cabbage, tofu and mung bean thread (photo: http://bit.ly/1LoeCDf). They were steaming hot and pretty tasty with the hot mustard, but I could make my way through only half of them. It was clear that the daily special, the $10.95 Spicy Garlic Pork Belly Fried Rice was meant for a family but here I was scooping piles of it on my plate to devour.\n\nThe stewed pork belly was a nice carnivorous touch, but the rest of it was a generic pile of starch with garlic, green onion, chili pepper and scrambled egg (photo: http://bit.ly/1JmchC7). I think the carb overload made me a bit delirious because I dared to order a third dish, the $10.50 Spicy Sichuan Garlic Eggplant, which was nice and tender since they use the smaller Japanese eggplant but with a kick thanks to the special garlic sauce (photo: http://bit.ly/1MHT1WO). I know I porked for $35, but at least I had some decent leftovers for lunch the following day. The service was quite attentive and downright cordial, and judging from the rest of the customers, you could already tell they respect their elders. Hey, at least it wasn't a hipster hangout.\n\nFOOD - 4 stars...hefty portions go along with the hefty prices but the overall quality is quite good\nAMBIANCE - 3 stars...like going to a restricted country club\nSERVICE - 4 stars...young Asians can be nice...see?\nTOTAL - 4 stars...conservative Chinese spot is worthy of a return visit...with a large party", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "The food was so good and I wish I had a bigger stomach to eat more! The servers were really attentive to my drinks and was also making sure if my food was suitable for my tastes. I'm only in the city for the weekend and this restaurant was one of my major highlights since I've been here. I would love to come back the next time I visit again!", "author": "Sang O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "First time ordering food and the food is delicious and customer service is good. \n\nSuper close to public transportation, which is a plus for me.", "author": "Elizabeth Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "They seated number of tables of same size before us. People who arrived and were put on waitlist after.  Very frustrating mismanaged 45min wait.  Did not do anything to remedy situation. Saturday night medium size line.", "author": "Jj W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-06", "description": "Yikes. If you name your restaurant after a dish, that dish had better be excellent. The XLB were too large to eat properly, but that didn't matter because all eight were devoid of liquid inside. Each had sort of disintegrated on the bottom leaving behind only dry filling and sadness. The rest of the dishes were mediocre at best. West Portal needs to raise its game!", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I love this restaurant-they're dry fried chicken is to die for. There asparagus and green beans are amazing along with pretty much anything on the menu but these are my favorites. Great service, lovely place, you can actually hear Your table mates without speaking loudly at all. It's a neighborhood gem and I absolutely love it.", "author": "Sandy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Amazing service. Each member of the staff was incredibly polite and attentive to my family during our dinner. Haven't been to any other Chinese restaurant with this quality of service. Food was great too, and I loved their specialty menu. The tan tan peanut sauce noodles are quite unique and tasty. My husband and mother who are both vegetarians also enjoyed their extensive vegetarian menu. We were celebrating my mother's birthday, and I called in for a last-minute reservation late in the evening. It was nice that they were able to book my family last minute. When it came time to have cake, the waiter even cut a slice of birthday cake for my toddler even though he wasn't sure if she was allowed to have cake. LOL. Love that he was even that thoughtful. My family will definitely be coming back.", "author": "Bay Area Yelper S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-19", "description": "The ambiance is nice. The food is a disaster. I got a Mongolian beef and it was literally sinking in sauce. My kid innocently asked if I had ordered soup?", "author": "Vici P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Excellent take out. Great dumplings, wonton soup, and fried chicken. Mongolian beef was also very good.", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "Dry Fried Prawns\nBrussel Sprouts\nShrimp Fried Rice \nPot Stickers\nShrimp and Chive Dumpling\nXiao Loong Beef\n\nYou're Welcome!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Likely the most pleasant Chinese dining experience this side of the city (and worth taking a trip out to West Portal).  The food quality is high.  Service is great and the ambiance is relaxed.  Quite the mix really!", "author": "Kashif M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "I have lived in the area for many years and somehow this was my first time dining at this restaurant - but not the last! I loved everything about this restaurant, from the relaxing ambiance to the amazing wait staff. This place isn't like every other Chinese restaurant down the block - it's truly authentic and you can tell that the owners really take pride in what they do. \n\nFood: must get the shrimp and chive dumplings. 10 come in an order and I wish I ordered 20. I loved mixing all of the sauces (ask for the Chinese mustard) and then dipping them. The lemon prawns were really good, but the icing on the cake was of course, the chow main (crispy). Everything was delicious and full of flavor. I loved that the salt was very minimal in every dish. \n\nI'll be back!", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "Well here we are back on West Portal. The last time we tried this place we checked the hours which were listed lunch til 2:30. We arrived at 2:15 but were told the kitchen was closed. Pretty uncool. But the reviews were interesting so we returned for a snack at 6:15pm. It's got beautiful atmosphere. Fung shued perfectly. The service is attentive but not intrusive. We ordered brown rice, a vegetarian special green beans with garlic with preserved Chinese turnips. Wow delicious. The very young waiter was unsure about the actual ingredients of this dish--so more training would be a good idea. Regardless-- it is a fabulous dish. I ordered my fave dish xiao long bao. Sadly what they serve is not a soup dumpling. The dumplings are the size of a softball--about 3 times the size of a proper soup dumpling. The pork mixture was good but there was no broth inside. Hello--the broth inside is what makes it xiao long bao which is different than a giant potsticker. It's ironic that they named the restaurant after a classic dish they don't actually make. Next time I will stick to the dishes that are more modern Chinese & when I want soup dumplings I will go somewhere else. Suggestion-- change the name of your restaurant.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "The royal emperors of china would be proud of this restaurant. I had the Gao Lan which is thinly sliced leg of lamb, marinated in Sichuan spices &Xiao long bow which is Hand rolled Chinese pastry with ginger marinated ground pork and then steamed. Both were phenominal. I defiantly will be coming back.", "author": "Joseph V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Authentic?  Not really.  But is it like Panda Express? Definitely not.  I actually found this place pretty good for lunch - got the shiitake mushroom and beef - for $7.95 including soup this was a steal.", "author": "Ernest S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "I travel all over the world for a living and this is by far the best Chinese food in the world. I don't know how they do it but the sauces that use or so savory and so good it's just incredible. My mother-in-law drives all the way down from Santa Rosa just to eat here at least once a month. It's definitely the most repeated restaurant on my charge card bill every month. Even if you don't like Chinese food you'll love this place.", "author": "Max H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "I like this restaurant very much.  The flavors are fresh and excellent.  Great menu.  My only criticism would be the consistency of some dishes.  Sometimes they can be more salty than I've had before when ordering the same dish.  Other than that, it's one on my favorite restaurants I frequent in West Portal.", "author": "Marlon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Appetizers are amazing especially the spicy dried fried chicken. Good Ambiance and very (read very much) pocket friendly!", "author": "Shivangi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "I was just passing through the area for a quick lunch.  This Chinese (Tawainese) restaurant is beautiful with modern Asian minimalistic decor.  It is quite small, yet quaint and exquisite inside.  I love the life-size terra cotta soldier at the front door.\n\nI devoured their Chinese chicken salad with peanut dressing, sesame and cilantro.  It was very simple but fresh, tasty and good.  The service was excellent too.  They checked on this lone wolf a few times bringing more dressing and hot chili sauce for me.  I'll be in the area for a while with this new project just beginning and am looking forward to exploring the menu further.\n\nXiao Loong is not your typical attitudinal, average Chinese restaurant.  They offer a great atmosphere, excellent service and delicious food.  -perfect place for date night!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-25", "description": "Really average Chinese food sorry was expecting more from the reviews. The xao prawns were in this chinoamerican sweet sauce that in sure does not exist in China. Good value and nice servers however!", "author": "Nate P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "LOVE this place. We have been long-time patrons for delivery, then a couple of years ago went into the restaurant for Christmas Eve. \n\nThe food is consistently excellent, the service is friendly and efficient.", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Tasty Chinese in west portal. Don't listen to the \"non authentic\" hype. No mystery meat here, clean and kid friendly.", "author": "Shervin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "I have been here twice, once being with my girlfriend for her birthday and the other for a group project. The atmosphere and decor are simple but it brings out a good vibe. The windows had many scratches from the outside. It's quite small but they managed to have a lot of searing inside. The services kept me content, asking if everything was okay and filled my water immediately. However, there was an instance where the water was warm. The food came out warm and every plate came with rice. Overall the food was good. I recommend their pan pacific fried wonton. It was very flavorful, being crunchy on the outside and creamy on the inside. The fried rice is like most fried rice. Their beef and broccoli was better than most. It was very tender and the sauce did not over power the dish.", "author": "Joshua L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "Five stars dine in and delivery, love this place, my go to for Chinese food in my neighborhood, very friendly", "author": "Lew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "I love xiao loong. The owner and staff are so warm, they really make you feel like it's your place. And it's in West Portal, which is just really cool, in a not trendy sort of way.\nThe food is delicious, homey, and very consistent.\nEspecially love the xiao loong beef, the Brussel sprouts, and the wonton soup. Yumm!", "author": "Nancy E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "We came in on Sunday July 12th,2015. We ordered Xiao Loong Bao, pot stickers, string beans, mu shu pork, and hot and sour soup. \n\nNot so good: Xiao loong Bao because they are really huge and don't really taste like Xiao Loong Bao. \n\nVery good: hot and sour soup. \n\nI might only come back here for the soup.", "author": "secilia c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "This place is so good! The food is fresh and beautifully served, the service is amazing, and the ambiance is comfortable and relaxed but modern and tasteful. I've tried 5 different entrees and they've all been fantastic. The hot and sour soup is bomb! Also this place is kinda cheap for the quality and quantity of food you get!", "author": "Elina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "This is the Chinese restaurant in our neighborhood that we always wind up going to. It's okay but why doesn't anyone in my family have any real taste or sense of adventure though? Chinese food will always hit the spot as long as it's not frozen in the refrigerated aisle or in the super markets deli but I know that there are far better choices out there and especially in San Francisco California of all places! The moo shu pork sometimes arrives lukewarm and crepes or pancakes that come with it are under par in flavor and quality compared to other places I have tried. Just like pizza Chinese food always tastes good but I know it's not top notch though. \n\nWe had these old friends, \"the Wang's\" who would invite us out for Chinese food every year around christmas and they really knew their stuff and exactly where to go! Why can't we go to some of those places once in a while? I was going to leave a three star review but added an extra star because they are always friendly, welcoming and attentive here and I'm just too nice really. This place is fine to satisfy your Chinese food craving but there are definitely better Chinese restaurant in San Francisco.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "Very entertained.\n\nMy taste buds: Stir fried chicken breast, broccoli and baby corn in a black bean sauce with hints of garlic and ginger. Full of flavor. Quite filling. And just $6.95 at lunch.\n\nIncludes choice of white or brown (awesome) rice, small egg and tofu soup that was quite rich and rather satisfying on this foggy day. Orange wedge too.\n \nStaff was friendly and attentive. Space very clean, modern and not all that big. Perfect vibe for a relaxed meal alone or with a perfect.\n\nMy sense of humor: Fortune cookie at the end saying there is a celebrity future ahead in entertainment. We shall see.\n\nFor now see four stars.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-27", "description": "Not good! Food is mediocre, rice was not cooked properly. Food didn't even taste good. Definitely not good Chinese food.", "author": "Aisha P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "Was with a friend who ordered garlic chicken & said it wasn't garlicky enough. However, my meal was pretty good. I ordered family style chili pepper tofu which had a lot of flavor & was spicy as expected. The vegetable dish we ordered to share, shitake mushrooms & baby bok choy, was also good. My friend said this dish was more garlicky than the garlic chicken which is bad when you expect a dish with the word garlic in it to be more garlicky.\n\nAll dishes came with the choice of either white or brown rice and a nice vegetarian house soup. However, the meals did not come with free tea. A pot of tea was $4 or $5 depending on the type.\n\nI didn't like having to pay for a pot of tea as most  Chinese restaurants usually serve a pot of tea as part of the meal. However, they did have a nice selection of teas for you to choose from & hot water was freely added to your tea leaves as wanted.\n\nMy friend's meal & having to pay for tea are the reasons for 3 stars rather than 4 stars.", "author": "Debbie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "Though I haven't had chinese food at too many places, I can say hands down that Ziao Loong never dissapoints and has such flavorful chinese food with such a nice but casual atmosphere.", "author": "Skylyn H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "Food is very average and Americanized. If you are looking for authentic Chinese food, this probably not the right place. I would say the cooking style here is similar to Panda Express, they use a heavy and salty sauce for every dish you order.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-11", "description": "Definitely a very westernized Chinese restaurant, along the lines of a P.F. Chang's.\n\nCons:\n- We ordered the vegetable \"Hong Kong style\" crispy noodles, which are not really anything like actual Hong Kong style noodles. I'd have forgiven the lack of authenticity if it was still tasty, but the noodles were drowning in super salty sauce, and by the time they were soft enough to eat, I was gulping 5 sips of water per bite.\n\n- The vegetarian pot stickers, while fascinating in size, were disappointingly bland. It turned out pouring a few drops of the sauce from the noodles onto the pot stickers actually worked out quite well.\n\nPros:\n- Our waiter was really attentive, which you really wouldn't see in a regular Chinese restaurant, so props for that.\n\n- I initially thought the broccoli and soft tofu dish was pretty bland too, but after a while I actually appreciated the simple sauce it came in.\n\nVegetarian tip: The waiter informed me that any of the soups can be made vegetarian (aka without chicken broth) if requested.\n\nNon-vegetarian tip: The table seemed to enjoy the Xiao Loong Beef dish.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "The quantity of food is a good size per plate. The food was pretty good, but not the best. They have a good selection of Chinese food but not enough dumplings. The staff is friendly. Good selection of tea.", "author": "Ivania M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-01", "description": "If you think the food here is great,chances are,you probably haven't been to a lot of Chinese restaurants. To be fair,the service and atmosphere were not that bad. But the food is basically average(or worse). And it's overpriced.", "author": "Russell W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-06", "description": "Dumplings Dumplings Dumplings! The food here is great and a bit on the spicy side. Lots of good options. Dry fried chicken, crab Rangoon are delicious the chow fun is yummy.", "author": "Leigh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-08", "description": "House chicken is a favorite dish; 1 star off because occasionally food is a touch too salty, but in general, great flavor and slightly more healthy than your average chinese.\n\nWe usually do delivery because the restaurant itself feels a touch cramped, though waitstaff are responsive and friendly.\n\nOverall, worth a try if you haven't yet!", "author": "Leigh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Had this place bookmarked for a while now. Just went here with my GF. The food was phenomenal. A1 meat and veggies. We had Mongolian beef. Curry chicken clay pot. And Shrimp and Chives Dumpling (we loved this one). We came later in the evening and I thought they would give us a lackluster quality meal, boy was I wrong. Customer service was also on point. My new FAVORITE Chinese restaurant in the ENTIRE CITY.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-10", "description": "I heard this restaurant was good. \nThe good:\nService and friendly attendant staff. \nChicken chive dumplings \"yum!\"\nThe bad and or ugly:\nRecommended fried dry chicken. Recommend detox at diabetes clinic. Ok not that bad but the sauces are incredibly sweet. Not what I expected.", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Great staff and great food. It's hard to find a Chinese place that cooks with good ingredients. This place seems to care a bit more about people's health", "author": "Xrysa Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "It is very telling when you walk into a Chinese restaurant in San Francisco and the only Asian people eating there are with Caucasians. Not a single table of all Asian diners. This place delivers exactly what that would lead you to expect. If you are looking for Americanized Chinese food, like hot  and sour soup, lemon chicken, or Mongolian beef, and house specials that are variations on that theme, this place will make you quite happy.  The staff is friendly, courteous, attentive and efficient. The dishes are executed well enough for what they are, but it is most definitely West Portal food. It is nowhere near as good as what you'll find in any of the good restaurants in the predominantly Chinese neighborhoods in the Sunset or Richmond.", "author": "Timothy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "I was very impressed with the food, we sampled and shared and I'd order every item again.", "author": "L C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-27", "description": "My buddy was meeting me for lunch in West Postal and we decided to give Xiao Loong a try due to its proximity to our GTD choice of the day.  He was coming from the South Bay via public transportation so I got a good half hour to gaze at the menu and nurse my green tea and soup of the day.  It came in a really nice pot but at about $4, was definitely not cheap stuff for an inexpensive lunch and I found the tomatoes in the soup really spoiled the flavor and made it unpleasant to eat.  It would actually be a lot better without the tomatoes and with a shot of white pepper.\n\nWhen he finally arrived, I decided to try their spicy dry fried chicken, as recommended by other Yelpers.  It was well cooked but was a bit too sweet for my tooth and lacked a bit of spice. It was a little on the salty side as well.\n\nWhile the food wasn't anything to rave about, the prices are really affordable for lunch and the service was very good.  With the abundance of solid eateries I'm not sure I will be back anytime soon, but of you need a quick fix, it's worth giving a try.\n\nFood: 5/10\n\nService: 8/10\n\nPrice: $\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-23", "description": "To be honest,  this place is a pricey American style Chinese food. I took my mom here on a whim because I thought it was traditional Chinese food but when we showed it, it was all White people. Don't get me wrong, I'm in no way a racist.  I'm just stating the truth. Not a single Chinese person in a Chinese restaurant should have been my first red flag.\n\nThe food was only decent if you are looking for a classier version of Panda Express. Everything is pretty salty. I suppose if you like stuff like Lemon Chicken, Chicken Fried Rice, and Egg rolls, knock yourselves out.\n\nWe ended up spending about $50 for two people. Service was great but you can definitely say that I would never come back. Even if I was bringing an out of town friend to try Chinese food. Sorry", "author": "V W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-24", "description": "I have been to this restaurant two or three times and enjoyed the food every time. I would've given this restaurant four stars if it weren't for the snobbish and unfriendly attitude of people who work there. I've talked to several other people who have either been to the restaurant or had called and ordered food for take out. They all had experienced the same cold and unfriendly response.\nOne last thing that I didn't appreciate was the fact that I was charged five or six dollars when I asked for tea. I was under the impression that all Chinese restaurants served complimentary tea.", "author": "H. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "My boyfriend and I are quite addicted to this place. We have had a lot of bad Chinese food experiences in this city, especially this neighborhood, and Xiao Long continues to provide excellent food and wonderful service. It's by far the best hot and sour soup I've ever had! My boyfriend doesn't even like hot and sour, but he loves it here. I do admit that it's not the most authentic Chinese I've ever had, but it's not a total sell-out either. We will continue to patronize this restaurant for as long as we live in this city!", "author": "Seana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Great staff, friendly service, but a little over-price for Chinese food.  I mean considering the location it is a bit fancy, but most dishes are $10+, even string beans so I find that a bit ridiculous.\n\nHowever, food was overall delicious. Everything from appetizers to veggies to meat dish it was all flavorful, hits your palate in the right spot and nothing too over-seasoned and definitely no MSG (so I hope).", "author": "Willis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-15", "description": "Solid good quality food! House chicken is great! The delivery locally.  Some dishes can come very saucy. But food is tasty and not greasy. I would remind them to label the containers on the food to go. This is my favorite chinese restaurant on the West Portal strip.", "author": "Xela H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-16", "description": "Terrible. That's it. Xiao Long is basically over priced Panda Express. No Chinese would eat here.", "author": "Giovani T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "We had some family over for dinner tonight and decided to try Xiao Loong rather than our normal go-to, Emmy's.  We ordered:\nXiao Loong Bow\nWonton Soup\nXiao Loong's Steamed Fish \nBroccoli Beef     \nSpicy Dry Fried Chicken      \nXiao Loong's House Chicken      \nPork chow mein\nPork fried rice\nSnow Pea Sprouts and Garlic \n\nFirst, the bad: my family was disappointed by the lack of a Fish in Black Bean sauce and Honey Walnut Prawns on the menu. It's entirely possible the restaurant would have made a Fish in Black Bean sauce if I had asked, but since this was our first time ordering I figured I'd stick to what was on the menu. I get the sense that they are trying to make slightly more authentic Chinese food than your average run-of-the-mill Chinese joint, so that likely explains why there is no General Tsao's chicken or Honey Walnut Prawns on the menu. Also, it's definitely a $$ Chinese restaurant (at least for dinner) -- the above was just over $100, or $120 with the delivery tip included. From Emmy's, that would have been closer to $60. That said, $120 to feed 5 adults and one toddler isn't crazy money for SF. Ordering via phone was a little tough -- even at 5:15pm on a Sunday there was a ton of background noise which made it difficult to communicate with the woman taking the order (though she was very polite in not correcting me in what I am sure was a terrible butchering of the pronunciation of \"xiao\").\n\nDelivery took 45 minutes, which is fine, since that's exactly how long they said it would take.\n\nOn to the good!  The food was wonderful. Their XLB was delightful, even having been delivered -- I suspect it would be even better in the restaurant. Wonton Soup wasn't particularly flavorful - probably won't order it again - but the dumplings were gingery and the broth and greens were innocuous. Broccoli Beef was top-notch, with a deep brown sauce and pretty good broccoli florets (you could tell they came from the frozen food aisle, but hey, it's November!). My favorite was the Dry Fried Chicken -- they put the spicy sauce on the side which allowed the less spicy inclined members of my family to put just a dash, whereas I dunked each morsel of dry-fried breast meat in the chili-laden red sauce. The Xiao Loong house chicken was also good, with a pretty delicate flavor profile. In fact, nothing other than the red spicy sauce and the brown sauce in the broccoli beef had a particularly strong flavor, but the flavors the dishes did have were balanced and pleasant.  Also, they were happy to make 2 of the dishes from the menu that were marked as 'spicy' as mild instead -- very appreciative of their accommodation for the less-spicy loving members of the family.\n\nThe Snow Pea Sprouts and Garlic wasn't what I was expecting, and wasn't to my liking -- though that probably stems from a misunderstanding on my part of what a \"snow pea stem\" is. I read that and assumed it would be something like a snow pea -- which I love -- but it was moreso the leaf and stalk of -- what I presume is -- a snow pea plant. Won't order it again, but that's not to say it's a bad dish -- it's just not my thing.\n\nOverall, a very good experience with Xiao Loong Bow and I look forward to our next delivery.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-11", "description": "Lunch only, have not had dinner here in a while.\n\nSince when do Chinese restaurants start charging for tea from a menu.\n\nMay be another case of old man not adjusting well to modern world.  \n\nLunch menu says the meal comes with an appetizer:  pickled carrots?  \n\nKung Pao chicken was average.  Not special.  Better options close by.", "author": "Lou D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "Surprised to have a Chinese restaurant with 4 stars in West Portal, so we were excited to try it out.\n\nOur party of 4 came for lunch.  Service was good; restaurant is clean; food was okay.\n\nIf Taraval is too far, then this will do.", "author": "daphne w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Always a great meal at Xiao Loong Restaurant; customer service is outstanding and flavor is wonderful.  Often times I get headaches after eating Chinese food but NEVER from here.  One of my go to staples for authentic, GOOD, Chinese food.  Highly recommeneded when you're in the West Portal Area.", "author": "Annette G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-04", "description": "Not good and overpriced. I ordered for delivery.\n\nXiao loung bao- they were all smashed and on one side of the box. All the juice inside were gone since they were not handled properly. \n\nPotstickers- overpriced. Salty. The skin was so thick and bland.\n\nSnow peas and prawns- it was ok. A lot to pay for a small box.\n\nI do not plan to order from here again.", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "Its been a while for me since the last time I ate at Fresca at the West Portal area... Today I finally had a chance to eat at Xiao Loong Restaurant the place is not to bad at although the place is small anyways what, I ate was the Beef Fried Rice in which I chose the brown rice to be Beef Fried Rice!!! After eating up the Fried Rice at Xiao Loong...\n\n\n I had to say the Beef Fried Rice cooked with the brown tasted pretty good it may have been a little greasy but who cares if you are really really hungry go for it!!! Not only was the Beef Fried Rice really good the restroom Xiao Loong were really really clean!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Really good service. Kitchen was crazy fast on Tue night @ 8pm. Not too greasy.", "author": "Grant M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-10", "description": "Hmm. The food at this spot is very much for the people who live in the neighborhood, a certain kind of American palate. In that sense, not bad at all, and I actually eat here about once a month, because I live close by...\n\nI give it three stars, though, because although the owner is nice, the servers and food quality, composition and presentation is up and down. For example:\n\nThe potstickers: sometimes they are mammoth, saggy pockets that fall apart when you pick them up, other times they have either too much or too little ginger. \n\nThe fried asparagus: one day, perfectly peeled and cooked, with great pan-season, the next, huge chunks of semi-raw vegetable with peels and watery sauce.\n\nThe fried rice--packed with stuff one day, the next day, almost nothing. Cheng-bi chicken--sometimes overcooked with a bitter orange taste, others not. \n\nEggplant--cooked to a sweet mush, or cooked just right. The scallops--where to begin, because sometimes they're great and others, like tangy rubber. \n\nAs for the servers--just don't get it. Some days, very nice. Other days, really snobby and cold. It's incredibly odd and most of the folks I've brought here have noticed.\n\nI do get the sense that they infrequently have substitute cooks in the back, and that maybe is the reason for the inconsistency. The servers--who knows, wish it weren't so. In any case, I'll still go here because the place is clean and space is nice.", "author": "King E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "The short version: Above-average Chinese food in a lovely space with friendly servers. I will return. \n\nThe long version: We were a party of three, and we ordered Hot And Sour Soup, Dry Sautéed Green Beans w/chicken, and White Scallops w/broccoli. The soup was the best Hot & Sour soup I've had, with a fresh peppery flavor. The Green Beans w/chicken was also delicious. The menu says the White Scallops are \"a simple...dish that accentuates the essence of scallops.\" I found it fresh-tasting but dull. I'll return and try a different dish. I suspect there are many excellent dishes. Friendly servers and a lovely space.", "author": "Kurt A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Best Chinese food ever!  As a frequent restaurant diner this is a go to in SF!  The staff are amazing and the food... well it is truly outstanding.  You cannot go wrong with ordering anything off this menu.  Some of our favorites:  Hot and Sour Soup, Xiao Loong Fried Fish, green beans, pot stickers.... YUM!", "author": "Alicia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Great Chinese Food!  Oils are fresh and the dishes are hot!  \n\nSuggest:\nCheng Bi Chicken\n\nMongolian Beef\n \nSpicy Sichuan Harbor Pork", "author": "Klikety K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "Seriously the best pot stickers ever and won ton soup. Totally from scratch.. Reminds me of my dear friend from Shanghai, Shan Shan Wu's \nhomemade dumplings!!! Just moved into the neighborhood and am going to order from Xiao Loong again.  Also the spicy shrimp Xiao Long is delicious. What a great find! Thank you Yelpers!!!!", "author": "Julia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Still my favorite Chinese food restaurant in the area!\n\nThey now deliver.\n\nThey have brown rice.\n\nFavorites:\nCheng Bi Chicken\nShitake Mushrooms and Chicken\nXiao Loong Beef\nDry Sauteed Green Beans", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "Bf and I went here one night during HSB when we were craving dim sum  - we ordered xiao long bao, potstickers, prawn & chive dumplings, and a special: crab & shrimp dumplings. \n\nThe crab & shrimp dumplings were bland and skippable, but the rest of the dumplings were really delicious. We will definitely be going back.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "We liked everything tonight - starting from the soup, and finishing with several main dishes. Great and tasty food, pleasant service and nice atmosphere. Will come again soon.", "author": "Gregory F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Thoroughly enjoy this place.\nXiao Loong Bao are a must.\nLemon Pepper Prawns are amazing", "author": "Gunther C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "The hot and sour soup was outstanding, as were the brussells sprouts.  Unfortunately, the mu shu pork was mediocre at best.  Fatty pork in a bunch of cabbage and something was off with the pancakes too. I'd go back, but order something different.  Service is very friendly and waiter seemed appreciative when we gave him that feedback and said he'd share with chef.", "author": "Michele M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "A friend took my boyfriend and I here for dinner. I was really impressed!\n\nThe staff was very polite. \n\nThe potstickers were DELICIOUS. The filling was fantastic. There was a great balance of chewy and crispy skin. I put some chili oil on top of mine. I could eat them for lunch every day.\n\nOur other dishes, Mongolian Beef and Crispy Dry Fried Chicken, were very good. \n\nI had an enjoyable time here and hope to return again.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-03", "description": "we just had an experience here that is very hard to swallow, especially since previously it was a restaurant we enjoyed.\n\nWe ordered a chicken dish and received something which looked like beef (which my wife doesn't eat). We asked the server to verify. Never mind that he didn't take the dish w him, but he came back and said \"yes it's chicken.\" You can see where this is going.\n\nWe started eating it. it wasn't chicken. another server admitted it wasn't chicken, apologized and took it off our bill. meanwhile my wife had already eaten a few pieces of it.\n\nlook, she's not going to die but i can no longer trust these folks. I don't know if it was a new server or a momentary lapse of judgment but the worst thing you can do in a restaurant is to ignore someone's dietary needs.\n\nShame Xiao Loong, shame.", "author": "hunter w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "I love the Xiao Loong in the garden soup and the lemon chicken. The soups are so good and they are pretty big servings. Great service and a wonderful tea selection. I would definitely recommend eating here.", "author": "Corinne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "I order take out from this place all the time the food here is pretty delicious and consistent!", "author": "Marisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-14", "description": "Damn good northern style Chinese food. Great service too. The dry fried chicken is amazing.", "author": "Christopher Steven O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "My friends brought this home for our dinner and I was amazed at how fantastic the food was.\n\nThe most tender, fresh tofu; fat, tasty shitakes with baby bok choy, fresh chow fun noodles,  and the eggplant was to die for.  The food was just fabulous.", "author": "Pat P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "My rate is for the tri-tip sandwich. Just delicious!!! I am Brazilian and I loved it. I tried a sample of the feijoada and I believe it had too much bay leaves. A little less would be very good. Thanks for bringing the Brazilian taste to the Bay Area!!", "author": "Customer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "food quality is fantastic. service is great. hands down or favorite place in the area.", "author": "Lissette R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "we ate here a couple nights ago, and i was VERY happy with everything...from the service to the food, if we are in the neighborhood and in the mood for fresh Chinese food, we will return. we had fried pot stickers (outstanding), seaweed soup (very good, extremely fresh), steamed rice, green beans, twice fried chicken, and walnut prawns. everything was very yummy...timing was perfect, service was excellent. had leftovers for the next day too. it was a bit expensive, $104 for food above, plus four glasses of wine and one beer. but overall, wonderful.", "author": "Deb B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Had chilli prawns and wife had a spicy chicken dish. Both were excellent with perfect amount of spice, and the service was very friendly and fast.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-20", "description": "Fresh, wonderful, thoughtfully prepared food -- and the shrimp Chinese chive dumplings and hot and sour soup are tremendous!  The folks who work there are friendly, patient (we closed the place down tonight), and truly interested in how customers liked their meals.\n\nI've had consistently great experiences at Xiao Loong.  The restaurant is an asset to West Portal.", "author": "Margie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-21", "description": "I've been to this restaurant a couple of times. The food is good, and they have some original and seasonal items on the menu. The ambiance is nice, the place is clean (including the bathroom). My friend and I had dinner there the other night and they let us sit and talk long after the restaurant had closed. It feels a little more expensive than other Chinese restaurants.", "author": "J P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-14", "description": "What happened to xiao loong?   I have been back three more times after first asking myself that question.  I thought maybe it was a bad night, then nights, but now I can no longer blame the night.  I think they are at that culinary developmental stage where they just give up and ride the coattails of their former glory.  I have seen it happen many times -- the same recipes, but now prepared mechanically by disinterested cooks.  Everything -- food, service, atmosphere -- felt like the ghost of xiao loong past.", "author": "Maureen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "First time.. tried the won ton soup.  Loved it!  Broth had mushrooms and greens and the won ton wrapper seemed freshly made.  The ambiance is modern and the place is well lit and clean.  I am picky about chinese food since I don't like oily and heavy food.  I would return to try other dishes and would recommend it to my friends.", "author": "Diane V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-19", "description": "Man, I can't believe anyone would rate this place less than 5 stars.  It has been a while since I had quality chinese food, and this place offers it at the grubby chinese place prices!  We had Lemon Chicken (phenomenal - not too sweet, just lightly breaded / fried - yum), beef brocolli (nice beef strips - not fatty at all), Chicken Chow Mein - yummy, and some veggie dish that I didn't try but my wife seemed to like.  The service was great - super friendly, always stopping to refill the water, got the bill quickly, smiling / sincere faces....what is not to like!\n\nThis is my go to chinese spot from now on....", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "The pot-stickers and asparagus were really delicious as was the fish dish we had. All were recommended by the server. We also had the Mongolian Beef, which wasn't as flavorful as the other dishes. The service was very good, and the place very clean. I highly recommend, just be sure to listen to the server's recommendations.", "author": "Brett R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-01", "description": "I gained about 10 pounds when I lived in Taiwan and I blame the following culprits:\n \n75% xiao long bao\n25% excessive drinking, clubbing, working 6 days/week\n\nBack in the States, I've lost the weight, I believe, largely because I'm not surrounded by fabulous xiao long bao restaurants/venders (oh yes, even the night-markets offer this fabulous concoction for middle-of-the-night unnecessary but unavoidable foodie revelry).\n\nNot that I haven't tried to be surrounded, mind you!  This restaurant is a prime example of what I've come to expect of the average American-born xiao long bao: resembles the original form on sight, slightly thicker skin, with something not quite right about the interior.  In this case, not enough \"soup\" inside the dumpling, though still fairly tasty.  These XLB are of the larger variety, which, in my humble opinion doesn't diminish their authenticity, but I happen to prefer the smaller versions.\n\nOther dishes are standard to very good.  The jiaozi (pot-stickers) are decent, but the real show-stopper last Saturday was the spicy asparagus veggie side: perfectly flavored, not overcooked, not too greasy, just divine. \n\nAmbiance is quite pleasant, with prompt, efficient service.  Easily seated on a weekend night.\n\nI'll go back, but I'm still searching for the perfect xiao long bao.   (Prospects look dim, however, given that this restaurant that claims this coveted dish as its namesake is pretty average.)  \n\nOn the other hand, I s'pose I should thank them for helping me keep the xiao long bao pounds off!", "author": "Ravena F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-15", "description": "Came here for lunch and this place was great. $6 for a whole lunch with soup and a dish, what can be better. Its very clean and the service is supper fast. havent been here for dinner, but definetly a great place for lunch.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "We discovered Xiao Loong one day just after it opened at lunchtime. We have been back at least twice a month since.  We have tried many items on the menu and find the sauces to be excellent, the service is quick and polite and the locals from the area are all on a first-name basis with the staff. The food is cooked just right, the spicier dishes are flavorful without being too hot.\nWe will continue to go here on our \"no cooking\" nights.", "author": "Ken A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Went in last night for dinner last minute. The food was great!!! we ordered the viddes chow mein and the spicy dry fried chicken. Both were very amazing dishes. Full of flavor. The chicken had a little crunch to it, which i personal enjoy. The tea was very very good as well. It tasted very different from the generic tea you get at most chinese restaurants. The restaurant closed at 9 we were there until about 9:20. The staff was very friendly and polite. We did not feel at all rushed or pressured to leave. They we GREAT! I will definitely be coming again. Thank You for the great experience.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "great light and healthy Chinese food!  this is a regular spot for us.  I love the steamed veggie potstickers and the chicken and mushroom soup.", "author": "Amy Nicole W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "Disclosure: I know the owner of this place through my husband and yes... we've been known to get a few extra fortune cookies when the bill arrives. That said, I'm not the type to return to a place that I'm not crazy about. I've been a customer of theirs for more than 4 years now.\n\nLet's just put it this way: I rarely crave vegetable dishes. But their Vegetable Garden dish is something special. I would have eaten the whole dish by myself, except for the fact that I am trying to get the kid into veggies. Oh the sacrifice parents make!\n\nTheir dumplings are tasty (best if consumed at the restaurant - wouldn't recommend for take out). The dry fried chicken is addictive, as are the white prawns. The Gai Lan (chinese broccoli) is done just right - not to greasy. \n\nThe space is nicely designed and has a very clean, zen, modern feel to it. It is an intimate space, but what in SF isn't? Parking is relatively easy to come by. \n\nA definite must try if you are in the hood.", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-30", "description": "Should have had the xiao long bao, but didn't! Instead, I had the hot and sour soup, mongolian lamb, and szechuan eggplant. \n\nI think I ordered the wrong thing. Hot and sour soup is good. Mongolian lamb is good too, except the crispy rice noodle was a little stale. The eggplant is a no no. Very flat in taste and texture. Mushy all the way. I love eggplant, but not on this one. \n\nNot too impressed with the food. But good service, and surprisingly a good selection of wine and beer. \n\nSmall space, simple and nice decor. \n\nOverall it was a good experience.... will come back and hopefully order the right thing next time.", "author": "Marlis T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-25", "description": "Not exactly bad, but just a bit underwhelming and pricey for the quality of food you get.\n\nThe food wasn't very remarkable taste-wise but the sizzling rice soup did not sizzle, and the \"xiao\" long bao were the size of my fist. Really odd. There's a ton of other delicious, authentic Chinese places you could go to very close by along Taraval St.\n\nGood service and ambiance though.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-06", "description": "Went here for dinner the other night.  We ordered the Xiao Loong Beef, Combination fried rice, Spicy Dry Fried Chicken, and Spicy Sichuan Harbor Pork.  \n\nI thought the food was ok.  Seriously - if you can imagine PF Chang food in the West Portal area...well there you go.   Portions were on the small side.  We had a party of  three and I was still hungry after.  I just kept muttering - I'm going to need to eat again after this.\n\nI'll give them points for the service and the ambiance.  Very nice.  The food was a bit on the salty side.  I kept reaching for my water cause my tongue felt heavily coated.  The amount of salt in the dishes seriously felt like it  numbed my taste buds.  \n\nThe Xiao Loong Beef was marinated beef on top of shredded cabbage.  Too salty for my taste.  The Spicy Sichuan Harbor pork was forgettable.  The fried rice was well fried rice...with peas, carrots, eggs, shrimp, pork and chicken.   The only dish I liked was the Spicy Dry Fried Chicken...think Panda Express Orange Chicken stepped up 2 notches and you'll know what I mean.  \n\nThe service and ambiance were nice but not just not enough for me to return.", "author": "Cris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "Excellent Chines food, and phenomenal service. I came here with my Uncle and his friend, who were regulars, and they ordered for us. Everything we had was quite good, and as I said, the service was amazing. Jeff came and talked to us a few times, and was extremely friend, and the staff is definitely on top of their customers.\n\nOverall, the quality of the food was better than most, with typical options. I think that main selling point of the place is the service.\n\nIf you're looking for oddities and rare foods, this is nor your pick. But if you're looking for amazing service and friendly staff, definitely go here. It's worth the trip.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "I absolutely love Chinese food. I have no idea where my experiences live on the authenticity spectrum, but I do know tasty. \n\nThat being said, this is my new spot. Xiao Loong has great food at a good price. Their lunch special is fantastic if your dining alone, but even better if you're sharing with others. The lunch: One item, from a short list, with rice and soup for around $7. The short list, which is not that short, includes variations of veggies, chicken, pork, beef, tofu, and seafood. Everything I've tried is excellent but the house chicken stands out the most. I also enjoy their chicken chowmein, which features pieces of lightly fried chicken mixed into the noodles after they've been cooked. My favourite has to be the egg and corn soup they serve for lunch. It is not offered as a separate item on the menu, It only comes with lunch. \n\nThe location is quaint, clean, and modern. It feels like an upscale restaurant without the upscale prices. \n\nWhat makes this place my new favourite Chinese restaurant is the service. Matt is my waiter almost every time I eat here. He is super friendly and never hesitates to offer suggestions. The entire wait staff is hard working and friendly, but Matt makes you feel welcome. Although the food is enough to keep me coming back here, the service makes me a fan.", "author": "oscar m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "really enjoyed ourselves eating here.  friendly efficient staff with above average food.  the dry string bean is a must along with the seaweed soup.  fairly generous serving size with very decent prices.  gets a little crowded but worth the trek.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "Crispy Dry Fried Chicken, Green Beans, and House Won Tons! Haven't had it? GET IT! \nService is friendly, food is great, and  Restaurant is clean and I would love to come back!", "author": "Charlene K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "This is my long overdue review for Xiao Loong.  I love this place!  My fav dishes are the chili prawns and the pot stickers.  My family and I love coming here. The food is consistently good.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "If I could give it 6 stars, I would.\n\nThis place is always very nice to eat at, despite its location. I mostly ever go there when visiting friends at SF State. Parking isn't terrible on West Portal, but sometimes you have to be patient. I usually get a store-front space within 4 stores of Xiao Loong. \n\nWhenever I go, my friend(s) and I will order several plates and share them. It usually consists of prawns, fried rice, chow mein, and maybe some sort of pork dish. All of it is delicious. As for authenticity, I'm not so sure, but everything is *very* fresh.\n\nPricing isn't bad. I usually find that each dish is $6-8, which means 2-3 people can eat for $20-30 including the tip and beverages. Service is good as well.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Excellent food! We have been long-standing customers, especially like the Spicy Dry Fried Calamari and the Mongolian Beef.  I've eaten a lot of SF Chinese, and this is one of my favorite places.  More upscale than your average Chinese food restaurant, a little more expensive but well worth it!", "author": "T O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "We love Chinese food and have eaten at most of the top-ranked Chinese places in the City and this neighborhood spot is one of our favorites.  We have dined-in and had deliveries from Xiao Loong many times and it has always been terrific.  Our favorites are the dry fried prawns, the combination fried rice, the sizzling rice soup, and the dumplings.  We have also eaten at the other Chinese restaurant on the other side of West Portal Avenue, which strangely has a higher Yelp rating, which is not warranted at all.  It is not even in the same league as Xiao Loong.", "author": "Patrick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "Really good Chinese food. We ordered to go (thankfully b/c the place is small and hipster so it was PACKED!!) Very happily surprised. Good authentic Chinese food (a bit pricey) but not super greasy and yummy.", "author": "christy c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "We enjoyed dinner here recently and I was quite pleased. The ambiance was nice (a little bright) and the place was packed which always tends to be a good sign. The service was efficient and everything we ordered was quite tasty. I am pretty picky about Chinese food but I would definitely come here again - I loved that it wasn't a total grease bomb of a meal.", "author": "Anne Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "Been a couple more times since the first two.  The brown rice was kinda dried out, and the only thing I consistently enjoyed were the pot stickers.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-11", "description": "The food is just okay, and the Xiao Long Bows taste like steam buns coz the flour wrappers are way too thick. But the main reason I give 2 stars is that the waiter is not in the good manner. He asked us to leave the table because we weren't dinning in.", "author": "Meimei M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-22", "description": "I used to like this place but the service has fallen way off.   They hung up on me twice then placed me on hold - after 10 minutes I gave up.  I will never order from them or eat there again.  There are many better and no one deserves this type of crappy service.", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-05", "description": "LOVE this place. Non-greasy chinese food in a sleek, sophisticated little space. \n\nVegetable dishes, especially the spring mix, are perfectly sauteed: lightly in rice vinegar. The chili shrimp are fantastic, so tasty. You can ask for them spicier too, but I think they are just the right mix of sweet and spicy. \n\nThe Xiao-Loong bao are delicious, especially since this is really a lunch/dinner place, not a dumpling house or dim sum place. Service is always very prompt, if not very chatty. I'm a huge fan of their jasmine tea, super fragrant and a very nice quality - probably why its not free, as in many Chinese restaurants.", "author": "Maria A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-19", "description": "It was all right. My friend and I came here on the false pretense that their xiao long baos were going to be bomb (they were featured on 7x7). Unfortunately, they turned out to be mediocre at best. They were massive looking xiao long baos that had no soup in them. Sometimes, bigger is not better.\n\nBut, not to despair, because Xiao Loong had several other redeeming qualities. The decor inside was very nice; definitely not greasy and dirty like Shanghai Dumpling King or Kingdom of Dumpling. The jiaozi (potsickers) were really crispy and the won ton soup just hit the spot for the cold day. Would I venture out here again? I would say the chances are slim because it is out of the way and I know I can get a better xiao long bao fix for a cheaper price. However, if I were in the neighborhood, I'd definitely stop by for a hello and some jiaozi.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "Wonderful Dumplings with thin skin that allows you to taste the succulent filling. Great Mushu, not too oily! And the seafood is cooked just slightly and to perfection...Soo tender! \nWith such great food and attentive staff this place definitely has a solid future amongst SF's staple go to eats.", "author": "Julie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "I don't know why there are some shitty reviews down below, but I think this place was pretty delicious. The food was less greasy and more savory. \n\nA friend of mine recommended this place to me for dinner. We were greeted by two young hot looking ladies when we came in. I think I know why he loved coming here so much hehehe. We were seated swiftly and served a glass of ice water in under one minute. This place is nestled next to the Tat Wong Kung Fu school in West Portal. \n\nThe restaurant atmosphere was very welcoming and the floors were made of hard wood. What I noticed most about this restaurant was the food. Each item on the menu had a clear description of what each dish contained. Since I was famished, everything on the menu sounded really delicious too! \n\nWe ordered the Mushu Beef as an appetizer, followed by the Prawns in Lobster Sauce, the Shitake Mushrooms with Chicken and of course white rice. For the food we ordered, it was mouth watering and they gave us some huge portions! \n\nI was a bit curious so I ordered their Orchid Oolong tea which was subtle and had a sweet aftertaste. Being a tea connoisseur for so long, its always nice to try fusions other people put together and serve at their restaurants. \n\nXiao Loong's waitress staff were really attentive and prompt. They refilled our tea pot and glasses of water when it got down to half full. The dinner entrees are a bit pricey since the restaurant is a bit on the high end side, but you get what you pay for, which is a major plus in my book. I would definitely come here again if possible.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-10", "description": "I walked into this place, one of only two Chinese restaurants in West Portal, and was very impressed with the interior -- but that's where it stopped.  I ordered Chicken Chow Fun, price was very reasonable at $6.95, but got Chicken & Beef (ok, honest mistake on their part) -- but the dish was so bland so as not to have any flavor whatsoever.  I could barely eat it.  The only plus on this is that the food did not give me an upset stomach as some of these places can.  Admittedly, that's the only thing I tried, but that's such a basic dish that I'm not so sure I'm gonna try anything else.", "author": "Merrick W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-03", "description": "came back to this place to meet a friend for lunch. it was his choice since my first experience was so horrid. well the name of the restaurant is xiao loong, so why not order the xiao loong bao? it was good; not the best i've ever had but it was good. the skin was thin and freshly made. the soup inside the dumpling was savory and the size of the dumpling was larger than average. the spicy dry fried chicken with rice lunch special had FLAVOR!  much improved over my first experience here.  but back down to earth was my dining companion's choice of tofu and vegetables. Bland as can be. \nadvice to the chef. taste the food once in a while.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "Came here with our two kids and enjoyed everything we ordered. Our server was very nice and we never felt rushed or anything even when our 2 years old starting crying. Will definitely be back and excited it's close to our new home so we can try all their dishes.", "author": "Dawn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "I just moved to west portal recently and I've became a regular here. The food is really good any they are very accommodating. There is a really relaxed atmosphere in the restaurant and the staff are so helpful and friendly. I always get the tofu as in vegetarian and it is amazing, there are plenty if options for vegetarians too. I would highly recommend this place to anyone who wants Chinese food I'm West Portal.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-13", "description": "Very clean. Nice ambience, but that of a cafe, not a Chinese restaurant...not that this is bad.\n\nVery attentive and polite staff.\n\nNow to the food. Mediocre at best. Bland. Portion size was ok for lunch but not much meat in the dishes. Lunch menu said it came with soup and an appetizer. There was no appetizer, unless you count the stringy white vegetable on the side of the main dish.\n\nLunch prices not bad, but the dinner prices on menu were quite high for basic Chinese food.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-31", "description": "Let's face it - West Portal is no hip Soma, or culinary mecca Mission, or douchy (if I offend anybody, I apologize) Marina.  Most of my friends don't even know where West Portal is when I first told them I was moving to a 'neighborhood close to West Portal' (I didn't even bother mentioning the name of the other neighborhood bcos, if they don't know West Portal, there's even less chance they'd know where this neighborhood is). \n\nFor the first few weeks of living here, I found myself having to explain to people who are not as familiar with SF, \"So you go on Market St from the Financial District towards the Castro, then you keep going for another 2-3 miles past Twin Peaks.\" only to get something ranging from a completely puzzled look to 'ah!' \n\nLately I've just given new friends the standard answer of \"That's where old people live.  I'm old.  Get over it,\" when they ask me where I live.\n\nSo, I wasn't surprised to find out that the closest cluster of shops/restaurants, while extremely cute and charming, are not exactly offering up a million of alternatives when it comes to food.  And after considering the different options around after one of our evening walks, we walked into XIao Loong - it had just the right amount of crowd: crowded enough to suggest the place is decent, not too crowded such that we have to wait for a table. \n\nA quick glance at the menu suggested standard Chinese fare.  But that's ok - we weren't up for anything exotic.  We had the potstickers (6 for $8.95), which was decent, steamed fish fillet in a bamboo steamer, which was not what expected the dish to come out looking like (I was expecting whole fish with ginger, shallot, soy sauce and sesame oil - the works), and stir-fried chili garlic eggplant, which was tasty enough.  Service was prompt and the prices were decent - enough incentive to go back again!", "author": "Ange L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-13", "description": "Have loved almost every dish that I have tried but seem to have settled into a few staples over the years that we have gone.  Best hot and sour soup ever - their other soups look really tasty but I love this one so much that I cannot deprive myself.\n\nI love the Xiao Loong Baos (think steamed potstickers).  The string beans, tofu/shrimp clay pot, Xiao Loong beef - there are so many choices and I am always sad to only pick one or two.  Also, I enjoy the selection of teas and the fact that you are not stuck with one flavor.  There is a great selection of wines and beer as well but I love hot tea with Chinese food.\n\nJeff has created a wonderful atmosphere, great menu and hired a great staff.  You feel like you are eating with friends and family while having everything taken care of.", "author": "Jennie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-06", "description": "I've been going to this place regularly for dinner and it's been tasty, clean and consistent. \n\nUnfortunately, I just tried it for lunch for the first time and it was a rather disappointing and rushed experience.\n\nThere are some dinner staples such as the potstickers, the xiao loong beef and the spicy prawns that are always great. Also, know that you have to pay for your tea, but, oh well, at least the service is good and the atmosphere mellow. \n\nI don't think I'll be going for lunch again, they don't seem to take as good care of you or what they serve you, but I may be giving dinner another chance when I feel like a standard American-Chinese meal.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "Some of the best hot and sour soup I have ever had. You have to get it!\n\nThe restaurant is small, but adds to the experience.  It was nice to not have to yell across the table to have a conversation. The service was very good and food was served quickly.  We ordered (and would order again) the lemon chicken, chili prawns and Mongolian beef.\n\nWhen you have a craving for Chinese food, this is a great option.", "author": "Casey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "Very good, dependable food. Small interior, but efficient and modern feel with dramatic touches of Chinese culture (those tall, earthen soldiers). Good service and friendly owner and staff. Yummy, hearty dumplings.", "author": "Na m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "One of my favorite places for Chinese food. Love the pan fried asparagus, the xiao loong shrimp, and the shrimp with lobster sauce. It is expensive on comparison to other Chinese restaurants in the area but everything is super fresh and delicious.", "author": "Cynthia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "Amazing dumplings! I lived in Beijing for 6 months and this is some of the best I've had in SF. Very friendly staff with positive attitudes.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-27", "description": "Ordered Mongolian beef lunch. There were literally 3 pieces of beef.   Rice was hard.  Not cooked thur! service was ok since it was to go. not cheap either.  not going  back again.", "author": "Jo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-18", "description": "All I can say is, xiao loong beef, green beens, lemon pepper prawns.  \nThe food is excellent.  And the prices should be a little higher.  I have not had a bad experience in over 20 visits.", "author": "Obi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "The service is great, but it helps that we are great friends with the waitresses - they are such sweethearts. Stephanie & Lauren always remember to bring hot water instead of iced (the little details).  And we miss May May (that rebel).  As for the food, this is a great case for 'compliments to the chef': dishes are not overly adorned with things you didn't order so what you get is simple, great taste that keeps you coming back. Love the spicy eggplant!!!", "author": "Rupert W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "This is best chinese food restaurant in San Francisco. We've dined at this restaurant many times. The restaurant is very clean and well decorated. The staff is professional and nice. We also order from this restaurant weekly. We love the food and enjoy a wide range id dishes. If you want high quality chinese food and a good eating experience order from Xiao Long Restaurant. We love the dried fried string beans, chicken and calamari. There are also great vegetarian options.", "author": "X X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-25", "description": "i'm torn between 2 1/2 and 3.\n\nhad the sizzling rice soup, xiao loong beef and dry fried calamari.\n\nsizzling soup - ehhh and it didn't sizzle all too much? I dont know. whatever.\nxiao loong beef - extremely smoky tasting, which i didn't enjoy but the beef was tender and cooked perfectly. the seasoning just wasn't my cup of tea.\ndry fried calamari - good and i actually enjoyed this. however, it was a tad on the SALTY side. \n\ni'm really thirsty now. =(", "author": "Susy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-03", "description": "I walked in this place expecting an American Chinese restuarant and I wasn't off the mark.  But maybe my expectation for something decent was asking for too much.  All the dishes we order came with a gloopy sauce that was all sweet, sour, salty, and spicy that was not appealing.\n\nThe wait staff kind of hung around and pretty much ignored us most of the time.  And who the heck charges for rice when you order main dishes, that should just come with the food.  \n\nThis is not chinese food and I know I won't ever go back.", "author": "Twist' D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-03", "description": "We shared the Xiao Loong Bow appetizer and the Kung Pao Chicken with a round of Tsingtao .... we were both starving upon entry and satisfying stuffed upon exit.  \n\nvery good!", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-16", "description": "Of course it's Americanized Chinese food, just look at the place, but that doesn't make it negative at all.  I mean, consider the demographics of the neighborhood.\n\nAnyway, the xiao loong bow here are good.  So is the lamb mushu.  Just make sure you don't order the xiao loong bow to go, unless you want your car and house to stink like feet.  I do mind the smell, but it's just too good to pass up when I have that specific craving.\n\nAnd I think the service is pretty good.  One time I called ahead for pick up and they were about to close.  They offered to stay open until I could make it there.  Nice.", "author": "spiff e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-11", "description": "Best Chinese food ever. \nTake out is awesome, eating in is even better.\nMy personal favorites: \nbraised fish, house chicken, dry fried calamari and Xiao Loong beef.\n\nMy only regret is that since I moved from the Sunset to Pot Hill I don't get to eat here all that often.\n\nOh and the owner, Jeff, is a great guy.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "The food here is super consistent and always really good. True gourmet Chinese.  Also very nice friendly service.  Their take out is also fast and delicious. LOVE the Xiao Loong Chicken.", "author": "Bryon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "I've been going to this restaurant for probably 7 years now.  The items I love (pot stickers, combo rice, chicken salad, house chicken, dry fried calamari, dry fried shrimp, dry fried green beans, lemon chicken, and OMG, their steamed fish is great!) are consistently wonderful.  The wait staff is friendly and attentive, and the owner is frequently pitching in with the staff.  The place is clean and I just love eating here!", "author": "Jill T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-30", "description": "I tried Xiao Loong several times hoping, just HOPING, that I would have a nice lunch. My hopes never turned into reality. \n\nThe food is bland and oversauced (a bland sauce at that). I had an HK style noodle once, a spicy tofu dish over rice, and another dish that I can't even remember. I gave it several tries out of desperation and was disappointed every time. \n\nThe two stars is for the very nice and helpful staff.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-20", "description": "I've been to this place about 5 times.  We've had take out, we've been there with our friends with small kids.  We've been there during busy hours and we've been there during less busy hours.  \nXiao Loong is consistantly good.  They take care of their customers, and they have good food.  \nIs this authentic?  I don't know and I don't really care.  The food is good, the service is good, and the place is right.", "author": "Nelson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-18", "description": "I've been to this establishment twice and have been quite impressed both times.  I am welcomed right away and am escorted to my table.  Drinks are served almost immediately soon after.  I've had the pleasure of trying their chicken & shitake mushroom soup, shrimp dumplings, garlic eggplant, shitake mushroom and bok choy, sweet and sour pork and spicy dry fried chicken (not all on one visit, of course!).  \n\nThe decor is very modern, the staff very inviting. Their prices are very affordable, especially for lunch.  For less than $10, you'll be able to get an appetizer, soup, rice and sizable entree!\n\nSince moving to the Bay Area, I have never come close to finding chinese food as good as on the East coast.  It's just my luck that, three months before I move back, I finally find one.", "author": "PauLine R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-30", "description": "If you like San Tung on Irving and/or Panda Express served up more fancy, you will like this place!\n\nOk, that sounds reaaaally weird but 1) they have dry fried chicken & green beans just like San Tung (which we got and it was good) and 2) the food here is on the Americanized like Panda but it's more Chinese... and definitely not fast food... ok that was a bad comparison but you know what I mean!\n\nSmall, cute, cozy restaurant -- just like everything else along West Portal, and definitely not your typical greasy-feeling/smelling Chinese joint. Excellent service (thanks Rich!) and food comes out quickly. Also great selection of teas -- we had the chrysanthemum. Only downside is that there is no waiting area so you usually wait outside but they do give you a call when a table is ready.", "author": "Miss H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "This is what Chinese food should taste like.  Jeff knew what he was doing when he opened up this place.  The ambiance is classy and the service is phenomenal.  They have a great selection of dumplings, though personally I like the pot stickers.  They're huge and a little oily (but what do you expect?), but they are REALLY tasty.\n\nThey have a Mongolian Lamb to die for, with angry red chilies staring you down as you scoop up the delicious goodness onto your plate.    It is very easy to order too much food here because it all looks so darn good.  On the other hand, you get a tasty lunch (or breakfast) the next day so it's totally worth it.\n\nThe steamed fish seems to be a popular dish, but it is a big portion and usually it is too much for two people.  Good for family style though.  The spicy tofu and string beans are great as are ALL of their clay pot dishes.\n\nYou do have to pay for tea, which kind of bucks the trend of other Chinese restaurants, however the selection of tea is much better than what you'll find on Irving Street or Clement Street.  Incidentally, their tea selection is only to be outdone by their wine selection.  Jeff knows quite a bit about wine, and if you're a wine snob, you can definitely trust his selection.  \n\nAll in all, this is a great place to take a date, or go with your family (both of which I've done.)  I do wish they delivered, but c'est la vie.  I highly recommend this place.", "author": "Adam E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-01", "description": "Good food and ambience...\n\nI was amazed at how fast the food came out...\n\nThe waitress/hostess is pretty damned hot...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "We just happened upon this great little place while walking in West Portal one afternoon, and have fallen in love with the place.   The waitstaff is so attentive and very pleasant, and the food is very, very good.   I highly recommend their Mu Shu Pork and their Crab Dumplings, but everything has been consistently good when we've dined there.  And we ALWAYS have food left over for the next day or so.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-13", "description": "They were okay. Nothing spectacular. I would come here again. But am I beating their door down? Nah but they service was excellent!", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "My husband and I eat here often.  He likes Chinese food more than I but I really enjoy this restaurant.  The service is quick and very friendly and the staff remembers our favorite dishes.  I particularly like the sizzling rice soup.  Last night I had the lemon chicken that I enjoy but is a bit sweet for my husband's taste.  The decor is very clean and sleek.  Nice to have such a lovely restaurant nearby.", "author": "Vicki B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-16", "description": "Xiao Lung Bao Rating: 1 star\n\nI can't believe nobody mentioned that the Xiao Loong Bao served at \"XIAO LOONG\" restaurant cannot be classified as Xiao Loong Bao at all. Even 7X7 magazine did not catch that. We even asked for the dark Chinese Chinkiang vinegar with shredded ginger, (CATCH THIS) they do not have it. \n\nHowever, food was generally quite good. I thought the prawn and chives steamed dumplings were approaching San Tung's. Dumpling skin did not taste hand-made. Service was excellent. Friends were saying this is a notch up from PF Chang and I thought that was a bit harsh.", "author": "DANIEL T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "The food here rocks! Hot braised fish (fried and garlicky goodness) and pan pacific wontons (the flakiest pastry stuffed with cream cheese and crab) are the best in town by far!", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-15", "description": "Went here last night, had \n - potstickers - i don;t think you can ruin these\n - eggplant - tasty, the best dish\n - green beans - tasty but needs more chilli\n - beef Xiao Loong - kinda boring, but pretty good\n\nThe restaurant looks good, and we had good service.\n\nThe west portal location is too convenient, because its only 3 stops for us on the Muni tram, and it's serviced by 3 lines, so we can get there quickly, and back on the same ticket.", "author": "Ed R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-15", "description": "Been twice for dinner now, had good food and good service.  One dish was a bit too sweet, but everything else has been very tasty.  An interesting touch is the hot and sour soup has shrimp in it.  Highly recommend the lemon pepper prawns.\n\nMost recent experience - really different and I have to move the rating down.  Greasy, lacking in flavor, really odd soup broth (potentially burned.)  Oh well...", "author": "Spike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-17", "description": "Decent Chinese food--nothing spectacular, but nothing horrible either. The spicy dishes werent that spicy at all, but they give you hot sauce on the table to make your own heat. The tables are packed tightly together and I think we might have horrified the couple next to us with our conversation about this woman who claimed to have pus-filled diarrhea.  Yes, we should have shut-up.", "author": "brewgirl b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "We've been going here since it opened (and believe me, it's a vast improvement over the previous Chinese restaurant), and we usually go with 3 generations...my grandmother, my folks and me. It pleases all. And yes, we often are the only Chinese faces there.\n\nThings we always order: the xiao loong bow, the hot and sour soup (++), and the Hong Kong-style chow mein with chicken/mushrooms. You can't go wrong with these.", "author": "Leah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "The service is very attentive. The owner Jeff is always around to make sure everything is just as you had ordered. And if you do not know what to get, there are always the staff recommendations, which we have found to be very tasty.\n\nMy kids actually eat from this restaurant, so in our book, makes this place a utopic haven for culinary bliss in a manageable environment.\n\nThe favorites are the chicken salad, Xioa Loong bows,(excellent) and mushu prawns with the five extra pancakes. This is a great neighborhhod joint. Locals share info on everything from politics to whats hot and going on in the neighborhood.\n\nA very family friendly environment and though the restaurant can get crowded, it's never too crowded for the kids.\n\nA great option to the other chinese restaurants around town, parking is quite abundant in the neighborhood and we ofter find parking right in front... BONUS!!! Especially with two kids.\n\nKudos to the Xiao Loong team!!!", "author": "robert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-14", "description": "I've eaten there many times, love the original recipes and how they cook food very hot and fast. Love the strong, flavorful sauces. This is not the same experience as most other Chinese restaurants in the city, a couple of notches up, marginally more expensive but worth it.", "author": "Jairo W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-30", "description": "I can't even say how appalled I am with the food I had at this place. This restaurant is so far removed from Chinese food that I'm embarrassed for the owners. I am Chinese, and having just gotten back from a trip to China last week, eating at this place was excruciating. \n\nWe had the Spicy Chili Prawns, and it was basically a plate of de-shelled shrimps swimming in ketchup. I wish I were exaggerating, but I'm not. The other dish we had was Family Style Chili Pepper Tofu.  It was so overwhelmingly bland and watery from the sprouts, and the vegetables didn't taste like anything!!!! And I always hate Chinese restaurants that charge for rice. \n\nThis place sucks. Don't eat here. Trust me.", "author": "Linda Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "Well, first you might wanna know how to pronounce the name; it's \"shao lon.\"\n\nI don't even know how many times I've been there. One of my favorite restaurants in the city! The food is delicious, the atmosphere is nice, and the price is decent with a big portion. If you expect Chinese food, go elsewhere, because this is a Hong Kong style restaurant.\n\nIf you're going there for the first time, I'd recommend you try Mandarin Chicken. I like their Lemon Chicken too. Ma Por Tofu is spicy enough.\n\nA downside is, it's so small that you're likely to have to wait on weekends unless you have a reservation.", "author": "Haruki E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-23", "description": "If I was writing this review 2.5 years ago it would have been 5 stars. We discovered this little gem a couple of years ago and it's popularity was still relatively in check. Since then the secret of this little Chinese restaurant in West Portal\nis out and unfortunately I fear the quality of the food has gone down. The reason we went here religiously every week was for the freshness and intricacy of tastes. Now the food is still better than most standard Chinese restaurants but for the price I expect more. The one good thing, they truly don't use MSG. The house lamb dish is still delicious as is their chive and prawn dumplings. The chicken fried rice used to be quite good but they stopped seasoning the chicken and now it is quite bland. Even my foodie SF child won't eat it.  We still visit this restaurant but not with the same frequency and mostly as an excuse to make a run to Ambassador Toys at the end of\ndinner.", "author": "Halima T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-31", "description": "Eh.\n\nIt was good but kinda pricey.  Kinda what you expect in the West Portal.  However, the service was great and the atmosphere is very nice.  Enjoyed the Hunan Spicy Chicken but the beef chow mein was just weird tasting.", "author": "Mark O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "A solid \"meh.\"  Service was a little lacking - I asked about the tea selection and was met  with a blank stare.  I found the dishes to be bland.  That said, service was quick and friendly and the decor was charming.", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-05", "description": "Laundry done, time for an adventure.  Asparagus is just about in season.  Fog isn't quite yet.  A quick Le Mans drive up over Portola, I whisked myself, my laundry, and my buddy out of the urine-smelling mission and into the land of West Portal.  \n\nCrispy, savory, spicy \"dry fried\" asparagus.  Delicious.  \nWok-flashed szcheuan pork.  OK.\nCannon-ball sized pork/shrimp pot stickers.  Not as good as my cousins matzoh balls from Monday night but just as satisfying.  mmm.\n\nLoong drive is worth it", "author": "Jon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-16", "description": "A Chinese restaurant that doesn't serve tea. Very odd to me. I got the sweet and sour lunch special. Terrible. No flavor. The orange they provided was dirty! Just unacceptable. I have also been here for dinner and the prices are just way too high. $10 entrees doesn't justify the quality and quantity. Wonton soup is at least double the price of other restaurants.  I wasn't a fan of the atmosphere either. I felt as though I was in a cafeteria.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-04", "description": "Whoever thinks that Chinese food has to be greasy and without inspiration has not been to Xiao Loong. They do delicious Chinese food that offers the complete opposite of the cheap Chinese restaurants that populate the City. You will pay a bit more, but it's totally worth it. Their soups are warm and comforting, their noodles are tasty and their lemon chicken is fabulous. Try one of their many appetizers and you are sure not to be disappointed. They also deliver and when the food shows up it's hot and just like you're having it at the restaurant. After a dinner at Xiao Loong you'll have a whole different outlook on Chinese.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-05-12", "description": "The flavors aren't bad, but this isn't a \"real\" Chinese restaurant. The decor is non-descript, the restaurant is small but comfortable. It really caters to those who want a Chinese meal but isn't completely comfortable with the mom and pop style of Chinese cuisine. Xiao Loong serves up all the traditional types of dishes without the authentic flair. Dishes have been modified to give it more of a Western flair. Nice place to go with friends who aren't familiar with Chinese food, but for hard core Chinese food lovers, this is not the place for you.", "author": "Anita L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "I'm a fan!\n\nThe food was delicious, and appropriately priced. The service was amazing... they were on top of everything. The cups never ran dry, and that's huge for me. \n\nPros: Attentive friendly service, fair prices for portion sizes, convenient location, clean bright atmosphere.\n\nCons: My coke was served in a tiny little glass bottle, which was cute, but I lost 2 oz. from can size, Kung Pao chicken had no kick (If it says hot I want it to burn me).\n\nDefinitely a place I'll recommend to others, and go again myself! :)", "author": "Jonathan I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "Jeffrey & the entire staff at Xiao Loong do an outstanding job serving up piping-hot, fresh & delicious, Chinese food! The Chicken Salad (with the peanut dressing) is CRAZY GOOD & the lamb dishes are MUST TRIES! Oh, & don't forget the prawn dishes either! Writing this review is making me hungry for XIAO LOONG!", "author": "Jody A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-10", "description": "Tis all about about the mu shu pork and the giant pork dumplings. They are the size of a small lemon. Order them, and you shall be happy. That is all. Beep.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "I really like this place. It's a great spot to stop in with the kids. Great food. Nice place. Nice staff.  I eat there frequently.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-10", "description": "I've never been here for dinner but the lunch is something very special. \n\nIt's really cheap (like 6-8 dollars) for what should be a filling lunch to anyone with a healthy (ie not a compulsive or even consistent over-eater) appetite. \n\nI got some spicy prawns that were really good, and my friend got the calamari. Both were delicious. \n\nThe restaurant itself is pleasant and clean and zen as other's have mentioned. If you work near West Portal it's hard to beat the lunch special.", "author": "Jake R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "Visiting from So. CA and our son took us to Xiao Loong.  We all enjoyed it very much.  I had the Vegetarian Pot Stickers and Vegetable Mu Shu which I asked them to add tofu to, and they gladly did.  Even asked if I wanted the tofu fried or steamed.  My husband and son shared a small Sizzling Rice Soup (which was not so small), the regular Pot Stickers which have Pork, Xiao Loong Beef, Dry Sautéed Asparagus and Brown Rice.  Serving sizes were nice and we took home leftovers of everything except the soup.  My husband is always worried about getting beef dishes in Chinese restaurants because many times it is tough.  He said this was very good..", "author": "Caryn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-08", "description": "from my friend angela's review: I WAS \"THAT FRIEND\"  :)\n-1 -1 -1 -1 -1 (how can mess up the dish that you're named after???)\n\"It was all right. My friend and I came here on the false pretense that their xiao long baos were going to be bomb (they were featured on 7x7). Unfortunately, they turned out to be mediocre at best. They were massive looking xiao long baos that had no soup in them. Sometimes, bigger is not better. \"\n\n+1 decor is much nicer and cleaner than other dumpling houses\n+1 jiaozi were tasty, but not enough to drive back there\n\nlive and learn. kingdom of dumpling is still #1 for me!", "author": "Dora F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-16", "description": "I have not been disappointed here yet. Excellent to go food. Nice place to dine in as well. The shrimp w/lobster sauce is exceptional, fresh sauteed spinach cooked to perfection.(hard to do when ordering to go) Every item is always consistent and fresh. A nice addition to the West Portal area.", "author": "Dee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-09", "description": "One of my neighborhood favorites. I love their Spicy Chili Prawns and Dry Sauteed Green Beans. The restaurant is quite small though so be aware that it can get pretty loud at times, particularly when you have a boisterous birthday group next to you.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-13", "description": "This is one of SF's great hidden gems.  The owner (Jeff) is always a gracious host and has an incredible memory for faces and names.  It is a contemporary Chinese menu but comprised of all the classics.\n\nI would highly recommend their sizzling rice soup.  It is light and fresh and won't weigh you down.  \n\nI've tried just about every dish.  Some are heavier than others but they are all delicious.  Regardless of the entree you choose, the spicy green beans are a must have.", "author": "P K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "This is where I go for a change of pace from the Sunset and Richmond chinese restaurant dives. Yes, each plate is a couple bucks more but Xiao Loong makes some tasty americanized Chinese food. I always leave this place happy and content.  Another great thing is that you could get a glass of wine when dining in.\n\nThe potstickers and Xiao Loong baos with the homemade skin are a must to start (better in house vs. take-out).....the seaweed and garden soups are delicious if you're into brothy and light soups......and of course the tasty dishes like xiao loong beef, dry fried chicken/prawns, brocolli/tofu with the nice sesame seeds touch are all.....YUMMY!", "author": "BlissChic W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "This place is amazing! Anyone who's given it a mediocre view is clearly just unhappy with life. Usually, Chinese is my least favorite of Asian fare, because of the grease factor. But this place always delights! Food A+. Service A+", "author": "Maria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-03", "description": "This place is overpriced. The waiter came and took our soy sauce half way through our meal and gave it to another table, which I thought was a bit tacky. Otherwise, the service was good and the food was pretty tasty.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-20", "description": "Dry sautéed asparagus were fantastic. Also liked the steamed vegetarian pot stickers. The Xiao Loong's Steamed Fish was less successful as it was very bland, but several splashes of chili oil and soy sauce changed that. A very clean and serene atmosphere.", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "What mixed reviews.\n\nThe negatives are listed as Over Priced and Unauthentic.\n\nIts in the West Portal - an Upscale neighborhood, so the price reflects the rent of the building, not the greed of the owners.\n\nThe food is very good, and who wants 'authentic' at every meal. Wouldn't all the ethnic  restaurants taste the same if that was the only way to prepare a meal?", "author": "dan s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-24", "description": "Great place, great service and awesome food.  I really enjoy the Vegetarian Pot Stickers, it is worth waiting 15 minutes for them to be cooked.", "author": "Edwin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "We eat here regularly and think it's one of the best Chinese restaurants in the City.  Dishes are $10 or so - considerably more than the avg chinese greasy-spoon - but the food quality is very good.   Table space is small so be warned that it can get very crowded.  Service is good/competent.\n\nWe've noticed more variabiity in the sauces in the last few months, maybe kithcen turnover.  Even so, the quality remains high even if the dish is prepared differently than any previous visit.  Take-out is fast/reliable.", "author": "G T S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-22", "description": "The place was ok... customer service is better then average, food tasted ok, but not incredible. The shrimp they served us smelled really bad... they just gave us another place that was much better. Mongolian beef was good, but different than it usually is. Its a bit more pricy than most other Chinese restaurants, but still tolerable.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-15", "description": "Great food!  Great staff!  Great value.\n\nTheir lunch specials are off the hook.", "author": "Craig L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-12", "description": "While we are enormous fans of the West Portal neighborhood, this is the ONE restaurant that it makes sense for you to travel from anywhere in the Bay Area to visit. (And it is directly on the muni line (K,L,M or T to West Portal, or K & M to just about the front door). The design of the space is beautiful and the food is fantastic. An extraordinary find in any part of San Francisco.", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "We feel so lucky that this excellent restaurant is in our neighborhood--we go to it often! Fresh, well-flavored, never greasy, always high quality--Xiao Loong has spoiled us for most other Chinese restaurants. But it's not just the good food, it's the lovely service. All of the staff are warm, personable and professional. I always appreciated the service but this morning the service went above and beyond: last night my daughter had a friend visiting from out of town, and we took her Xiao Loong of course, because she wanted Chinese food.  The girl left her purse in the restaurant, which included her boarding pass for her flight the next afternoon (when the restaurant would be closed). I emailed the owner and he called me back immediately--on an early Sunday morning. They had the purse, they had tried to find us after we left the night before, AND he met me at the restaurant, on his morning off, to open up and give us the purse. Now, that is service--and a shout to West Portal too, for having such a lovely small town feel in the middle of our big city. Great good and great service--both the expected kind (in the restaurant) and the unexpected (on a Sunday morning, when it was closed!).", "author": "Sharon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-19", "description": "We just ate there again tonight and, as usual, it was absolutely wonderful. I'm always tempted to order the same fantastic dishes (mushu chicken, hot/sour soup, shrimp in lobster sauce to name a few) but then I go and try something new and it becomes a new favorite! The staff is super nice and the restaurant itself is very charming.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "Yummy place with a nice ambiance. We prefer it for Chinese food in the area.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "its not your typical chinese resturant.   its like grabbing for the fiji water bottler over the arrowhead.  its just water... do you really need the fancy bottle? sometimes, i like fancy things =) \n\ngreat food, great service great atmo, slightly overpriced for chinese food BUT THE QUALITY OF INGREDIANTS HOLDS THE 4STARS.  Ive had plenty of chinese food, and they all taste good going down, but how do you feel after?  disguted?  MSGed out?  dehydration?  Here... umm none of the above.  gets a thumbs up from me.  \n\ni also might be biased because i'm in love with the tattoo girl that work sthere... strait GANGSTA!", "author": "Doug .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-10", "description": "This is our go-to spot for the nights we just don't feel like cooking. We've been there dozens of times, and we've ALWAYS left perfectly satisfied. It might not be \"authentic,\" but that's not what they're trying to be. The quality is excellent and consistent, and service is very friendly and non-intimidating to those who aren't familiar with Chinese food, as Anita M. says. Our favorites are the House Chicken, Lemon Pepper Prawns, Dry Fried Calamari, and Hot Braised Fish, and Dry Sauteed Green Beans. CineArts movie theatre is a block away--perfect for a dinner-and-a-movie date night!", "author": "Jen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-27", "description": "This place is great.  Most chinese food tastes like takeout and this is the first chinese food place that actually tastes like a home made meal.  The pot stickers are amazing and so is the prawns and snow peas.", "author": "T D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "We love this restaurant because the food is fresh and delicious, the owner is often there  - ensuring all runs smoothly, and it's consistent.  Dining in, it can get a little loud (I like that it's kid-friendly but could be helpful to place some sound panels on the wall).  We pick-up to-go food often and the food stays hot (10 min drive) and is never greasy.  We always order the braised fish and also really like the mu shu. Enjoy!", "author": "lily k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "A and I came here for dinner yesterday.  Apparently he frequents this place a lot.  He was craving some Xiao Loong Bao, which is what he ordered as an appetizer.  They weren't bad.  I've had better, but they were pretty good.  We also had brown rice, Xiao Loong Beef, and Bok Choy with Shiitake Mushrooms.  The food was actually good.  You could tell this is more of an Americanized Chinese restaurant.  It's not to say that the food isn't authentic, but it's definitely Americanized.  The space is small, but really cute.  The service was great.  Everyone was super attentive and we got everything really fast.  It was probably about $30 for everything for the two of us.  If I were in the area and wanted some Chinese food, yes, I'd go back.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-17", "description": "We had dinner here tonight.  Tonight was the first time it was open when we've passed it after a Stern Grove concert so I was excited to try it, since I am a big fan of xiao long bao, and with the restaurant named after the dish, what else am I supposed to expect but great succulent baos, right?  It turned out that they were actually the most disappointing dish we ordered.  We were already forewarned when the server brought our order to us without the traditional dipping sauce of shredded young ginger in red vinegar.  They did make it for us when we asked for it.  But when we tried the dumplings, we knew immediately that they were quite off.  They were way to big, making them hard to eat in 1 bite, and the soup inside ended up leaking out instead of just bursting in your mouth.  The dough was also quite thick, more suitable for potstickers, which was a much better dish of the 2 that we ordered.  We also ordered the dry sauteed green beans, so fresh and crunchy, just the way I expected it to be.  The service is friendly, the decor is modern Chinese.  So, yes, I will be happy to go back, just not for the xiao long bows, but you knew that already...", "author": "Yvette F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-27", "description": "I have been to Xiao Loong Restaurant many times and it is always a nice experience. The decor is very modern, the staff very inviting. Their prices are very affordable and the food is always delicious. They have the best potstickers ever, I also love the hot and sour soup (portions are very generous) and the taste is incredible and this is just the appetizers that I am talking about. Now, for the main courses: I highly recommend a few items; such as the Mongolian Beef Tender sliced beef sautéed with green onions, julienned yellow onions, and roasted red. I also love the spicy Sichuan egg plant. Fresh Japanese eggplant, braised with our spicy Sichuan garlic sauce and last but not least the Hunan steamed fish ... simply to die for it is  fresh daily- fish steamed with roasted red hot peppers, fermented black beans, minced fresh ginger, and chopped garlic in their own house Chinese wine sauce. hot peppers in our house sauce served on a bed of crispy rice noodles.  \n\nThis is a great place to take a date and/or go with  family. I highly recommend this place.", "author": "Ernesto C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "What a treat! Very impressed all round. The ambiance was professional and elegant (not the typical Chinese restaurant decor); the service was efficient and expeditious, the prices were MORE THAN reasonable, but the food was the real star!!! Everything was flavorful, with clear flavor palettes and unmuddled taste profiles; The WON-TON soup was flavorful and delicious, a pleasant change from the limp dumplings in dishwater that so many Chinese restaurants pass off on unsuspecting eaters! The Mongolian Beef was very flavorful and well presented, with crisp yet not overpowering flavors; The shrimp with 5 Chinese spices was amazing: just the right combination of sweet/hot.. amazing flavor profile! And the Lemon chicken... I have to admit I wasn't the one in our group that ordered it because I am so used to lemon chicken being over-coated and drenched in lemon \"goop\" that tastes like lemon AJAX dish soap.. but THIS lemon chicken was moist, pleasantly lightly coated with a gentle batter, and the lemon sauce was a sauce and not a glop, with a crisp and cleansing citrus flavor that complimented the sweet hot of the shrimp and the deep flavor of the beef! Overall... a definite gem to add to your repertoire! The only reason I didn't give it five stars was that i don't give out 5 stars unless its a once-in a -lifetime experience.. Xiao Loong is awesome, but not quite THAT awesome LOL!!", "author": "Mark H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "Hey! A chinese restaurant that looks pretty nice.  It's in the fancy West Portal area, so it has to look the part.  The spring rolls are good.  And the rest of the food is pretty decent.  The menu is pricier than your run of the mill chinese restaurant.  So, you're paying for a better atmosphere with some tlc.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-31", "description": "We were at the Manor Coffee Shop and saw an article that talked about restaurants in the area which noted Xiao Loong. We are Din Tai Fung Foodies (Down in SoCal, Arcadia - best Dumpling House ever) so we are always interested in something out here. We only tried two items since we had just finished lunch but we somehow always have room to try out new stuff. The family ordered the Fried Won Ton which had a filling and the Xiao Long Bao, To- Go, of which we loved both items. The wrapper was a bit thicker on the Xiao Long Bao than what we prefer but the filling was very flavorful and good sized. Although, we live about 50 minutes away in the East Bay we plan to come back and try some of the other dishes. The menu sounded very good and hitting 2 out of 2 on the take-out, we suspect we will find other dishes that we will like. It is hard to find good Xiao Long Bao but we are always game to see something, stop, order it to go and eat it in the car...in search of great food. We liked Xiao Loong.", "author": "Henry D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-21", "description": "If you're expecting authentic chinese food, maybe you shouldn't be in west portal. I don't understand the 1-star reviews of this place, it really is not THAT bad. The atmosphere is really nice and the servers were friendly and awkwardly cute. My meal was good, nicely portioned, and very fresh tasting. Having said that, the little chile pepper icon in the menu warning that a particular item is \"hot\" is a joke. I've had ice cream that was spicier.", "author": "Wayne F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "I've only gotten food from here a few times, and i'm still trying to find my favorite main dishes; However, i already know what's going to keep bringing me back - the prawn and chinese chive dumplings. They are unbelievably good.", "author": "Grem W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-21", "description": "Very yummy and fresh Chinese food. They deliver in the area. You can order take out or eat in the cute restaurant on West Portal Avenue. My 5.5 year old son especially likes the fried won tons (not the cream cheese kind) and my daugher (3 years old) loves the chow mein. It doesn't have the bean sprout fillers that other restaurants include. We either take out or eat in 2x a month.", "author": "Beth A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-04", "description": "We have eaten in and gotten take out about a half-dozen times in the last few months, and have been consistently pleased. We used to live in Noe Valley, and Eric's and Alice's were staples for us. Since moving to Westlake, we hadnt found anything we liked as well until we stumbled onto Xiao Loong. West Portal isnt West Lake, but it is well worth the short ride for a delicious meal. Love love love the calamari.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-26", "description": "This restaurant is clean, tasty, and gives reasonable portions that won't make you have to throw away half your food. I recommend the Gao Lan lamb, the Chinese chicken salad and the Xiao Loong beef.", "author": "Jessica O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-11", "description": "It was my first time visit on a Friday night. Several tables were available and we were seated right away. We didn't know what to order and asked for a few more minutes because the waitress almost immediately returned after she gave us the menus. Big mistake because it took quite awhile to get the waitress' attention after wards. We ended up ordering the dry string beans, happy family seafood medley with vegetables, and the lemon chicken. The string beans was the highlight. The seafood medley was bland and the calamari did not taste fresh. The lemon chicken was a deep fried chicken breast on top of a gooey gelatinous mound of shredded cabbage. The portions were good but I would not order 2 out of the 3 dishes I had again. Service was okay.", "author": "Edmund W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-07", "description": "If I'd written this review 8 or 9 months ago it would be 4 or maybe even 5 stars.  The last few meals have been disappointing.  Rice was still tasty, but all the other dishes were off.  Stuff that was supposed to be spicy wasn't, the chicken that used to be nice pieces, is now scrawny unrecognizable bits.  As of now, I'm looking for a new easy to get to chinese place.  Xiao Loong does have a nice atmosphere though and I like the service.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-03", "description": "Mmmmmm !! I love this place! Their food is great and the place is clean! Service is always good too.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-13", "description": "the most f**k up chinese restaurant.  It is run by teenagers that don't have knowledge whatsoever with customer service, especially the guy with the glasses, he's rude, never admit his mistake, and looks and act childish.  I hate their food, service, and the atmosphere.", "author": "Albert W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "My favorite chinese restaurant!!\n\nI moved to the east coast a few years back and I've missed Xiao Loong ever since!  I've gotten take out since I've been gone and it's still the best.  Can't go wrong with anything on the menu!  \n\nI dream of the Xiao Loong Bao, dry fried chicken, tofu and broccoli, gai lan, lychee iced tea...i could go on forever!  \n\nThe service is GREAT and Jeff is fantastic.  Everyone is very attentive and so helpful.", "author": "Teresa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-28", "description": "I ordered out from this place today and found it to be not good. The pot stickers were better than the chicken chow fun . . . but I'd be hard pressed to return there for a full meal.", "author": "Todd F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-13", "description": "This is our favorite \"take-out\" chinese restaurant in our neighborhood.  Okay so as the other posters have commented its not that -authentic and not worth the trip across town if you live out of the area but the dishes are tasty, good quality, not greasy and the help is friendly.  We like lemon pepper prawns, soft tofu & brocoli, curry chicken, lemon chicken and mu shu pork.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-24", "description": "this is a great restaurant with delicious!!!! food, but when they closed the doors in front of me and 3 more of my friends recently 7!!!!! minutes BEFORE actual closing time... i was doubting if i ever come back.........", "author": "ina a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-12", "description": "This restaurant was a huge disappointment. My friend and I ordered the prawn mushu which was so-so, and then I ordered this pepper prawn dish while my friend ordered the Mongolian beef. Apparently the latter was decent, but my pepper prawn dish was pretty bad. To top it all, the waitresses seemed distant and the whole experience was unsatisfactory. Go to Eric's!", "author": "Matin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-26", "description": "We've been eating at Xiao Loong regularly for about 4 years now.  But I haven't reviewed it, because I'd rather keep it a secret.  Great food, and great service here!  Prices are reasonable.  And, for vegetarians, here's the best secret:  you can order just about anything on the menu with tofu substituted.  Our faves are: Cheng Bi Chicken, with fried tofu substituted, Hunan steamed fish (with tofu instead of fish).  Other favorites:  the potstickers (veggie variety available), pork bows (sorry, not veggie),  sauteed string beans with minced preserved turnip.  If you like mild fish, try the Shandong Braised Fish.  Everything here is flavorful and not overdone.", "author": "Penelope M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-29", "description": "i wish i can give this place \"0\" star !!!\n\nseriously, dont go to this mad rest. \n\n- taste: 0\n- cleanliness: 0\n- service: 0 ( can i put minus on zero ? )\n\nevery minute of my experience is just like domino effect. getting worse and worse. i cant believe that someone actually recommend me to this place ! \n\nRun and save your money and your ass, you'll thank me later.", "author": "sherly A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-29", "description": "Xiao Loong definitely beats out any other Chinese restaurant out there. The food is prepared freshly and serves all sauces on the side, rather than drenching any items with sauce. Xiao Loong also offers free delivery, and never takes more than one hour. Prices may be a little more than the typical Chinese restaurant, but the spectacular food is worth every cent! Parking in West Portal may be a little hard, especially at night, but the neighborhood offers multiple parking lots and residential parking.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-13", "description": "Good atmosphere, food, and service. My husband and I have eaten here several times and were happy with every dish we've had from the xiao loong biao to the green beans to the clay pot dishes. We pay a bit more than the average Chinese restaurant but it's worth it since the ingredients are always fresh and the service is always perfect! Plus, we never have to wait for a table. Or for extra water or tea since the service staff is always attentive to the customers! Would go back to eat any time!", "author": "Felicia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "It's no Dragonwell, but I really do like Xiao Loong. We moved to the area about a year ago and I would say that we order from here about once a week. It's totally consistent and they have some pretty delicious dishes (Sichuan Dry Fried Prawns) and their Mushu is pretty good, too.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "The food here is very good and very consistent. I have been here twice and just about every dish that we ordered was good and well received by our party. Oh, and we were all Asian, so I don't think that only non-Asian customers think the food is good here. Our parents are all great cooks so we know what good Asian food is supposed to taste like! The space is on the small side but very clean, modern, and zen. Oh and the fortune cookies are the best!!", "author": "Lori E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-19", "description": "I've eaten at this restaurant many times.... I don't any longer.  The so-called \"House Chicken\" is rarely prepared with the same level of consistency in flavor, sauce, and I counted 6 - yes, 6 - black beans the last time I ordered it. Disappointing to say the least.  Very, very laden with sodium (but then, isn't most Chinese food soaked in salt-laden sauce?) - an hour and a half later I'm chugging glass-after-glass of water.  On one account I returned the house chicken because it was badly overcooked and very tough.  Some of the pieces are far too large to put in your mouth - and no knives are provided to easily cut it (not with chopsticks, of course).  Few dishes are offered without soy sauce (an issue for wheat allergic or gluten intolerant).\n\nJeff, the owner, is pleasant and courteous although the wait staff is socially sterile and devoid of any pleasantries - not even a reciprocated smile. Crowded tables make for little privacy and intimacy.  I see similar behavior at most Chinese restaurants.\n\nPrices? You'll get a LOT more for your money at Eric's on Church St. with more choices (but substantially more rude waiters). Yes, Xiao Loong is pricey in contrast with MANY other nearby Chinese restaurants. Clean, yes, but NOT standout in ambience - whatsoever.  I REFUSE to buy a pot of Jeff's tea - outrageously overpriced.  Eric's: no charge for a pot.\n\nNonetheless, I'm finding myself gravitating elsewhere - largely back to Noe Valley - Church and Sanchez Chinese restaurants (despite even much worse parking!)", "author": "William S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-21", "description": "This isn't REAL Asian food but it is better than most!  The atmosphere is very relaxing.  The service is fantastic!  The wine and tea lists are extensive.  We especially like the green beans, the wontons, the dry fried chicken, the steamed fish, the....Oh, I guess we like the whole menu.  We've never had a bad meal at Xiao Loong.  It's hard to find because there's a big tree in front that blocks the whole store front.  Find it and you won't be disappointed.", "author": "Martin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-15", "description": "I think its one of the better chinese restaurants in the city (for my taste).\nTry the House Chicken, beans and spicy shrimp.\nThe place isn't too expensive either.", "author": "sachin n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "This is an excellent neighborhood Chinese restaurant.  They have a few outstanding dishes, such as the lemon pepper prawns and (of all things) vegetable chow mein.  The latter has large pieces of vegetables, not little diced pieces.  We have had mostly the vegetable entrees, so I can't comment on the rest of the menu.\n\nMany of the lunch specials are disappointing, with gloppy brown sauce on everything.", "author": "William W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-29", "description": "As long as you expect to get Chinese food for the American palate, this place is decent.  I came here for lunch which is a good deal for this \"trendy\" Chinese restaurant.  It came with soup and an appetizer.  I half thought they forgot to give us the appetizer but then looked at the other tables and realized others didn't get anything we didn't - though I'm not sure if the little bowl of pickled vegetables should qualify as an appetizer. For the price, I can't complain.  I ordered the clay pot shrimp and tofu and unfortunately, it was nothing like I expected.  It didn't come out in a claypot and had none of the aromatic goodness a clay pot dish usually has. It was pretty bland but at least, I felt like I was eating healthy.  A picture of his dish is posted. My friend had the spicy calamari which wasn't so spicy and had that sticky sweet sauce.  Not authentic but still tasty and satisfying in the same way that Panda Express orange chicken is.  As I walked out, I noticed a couple of other customers with noodle dishes that looked hearty and tasty.  Probably not somewhere I'd go for dinner, but I'd come back again at lunch for another rice plate or noodle dish.", "author": "Amina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-29", "description": "I don't know what the other reviewers are talkinga bout, because this place is fantastic.  I've been going there since they opened - they've been around for several years and you KNOW a chinese place doesn't stay open for long in SF if it's not good.  Maybe you have to know which dishes to order: Hong Kong style cripsy noodles, eggplant in garlic sauce, dry fried squid, moo shu pork - excellent, excellent", "author": "M T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-14", "description": "So the first time I wen here, the food was pretty good --been back a couple more times and have really been disappointed.  Maybe they got a new chef or something but the foods not that great.", "author": "Jane R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "I've eaten at Xiao Loong a few times now and I'm impressed.  The food has always been very good.  The service is excellent (friendly, attentive without being oppressive, etc).  A word of caution ... the dumplings on the appetizer list are HUGE!  They're wonderful, but the evening we ordered the dumplings AND entrees we were stuffed and we still took things home in boxes!  Enjoy!", "author": "Dwight S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-07", "description": "Food is great!  Atmosphere is clean and modern.  Management is professional and very personable.  A truly yummy experience without the grossness of chinatown.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-05", "description": "It was a brisk night, a light fog was kept away by the steady pace of the offshore coastal flow.  I was hungry.  To my left a homeless person let out a shriek that verified I was in the Mission.  It was time to leave.  A short walk later found me in Jon B.'s subaru looking for shelter from the chaos that my 'hood represents.  Jon knew what I was feeling, he didn't have to ask.  He felt it too.  We drove to the west portal because with a name like that, how could we not.  West we went, and quick, the Giants would soon finish losing against my beloved Padres, and the throngs of orange and black would hit the street angry and bitter.   A fearsome sight the depressed fair-weather fan... gnarled and broken like so many syringes on the MUNI tracks.  We hurried.  Parking was a pleasure, I commented to Jon as much, he laughed as though I had told him I just slept with his sister... awkward but understanding, with a hint of feined purpose.  We were seated quickly at Xiao Loong, the host was pleasant and brought water.  Pot stickers (the size of which I had never laid eyes on) arrived, followed by fresh asparagus and a forgettable pork dish, the collective of which soon justified our trek to the outer reaches of space-time, Gene Ray was right when he said that  creation occurs via opposites, some nights just go that way. No words were exchanged after the meal, nothing remained to be said, this was good, and although a return was inevitable, the mission awaited.  It was calling.  As was Lost.  Darkness had set, the Giants did lose... I kept the faith.", "author": "Darren R."}
