{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Note that they only take cash. \n\nOrdered the General Tso chicken. It was hands down the best version of it I've ever eaten. So good that I came back a week later and got it again.", "author": "Al L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "nice boss and nice food.\n\nbest chinese food in SFO. at least Best Street side style one.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "I chose this place based on the reviews and we were staying at the Hilton Financial District. We walked in around 730p and the place was not that busy. And it is small. A word of advice... Don't let that deter you. This place has THE BEST FOOD. I am not joking. We saw the reviews on the General Tso's chicken so we decided to order that. Wow... If you are close to this place you can't go wrong. Go there and eat. It is worth it.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "I went with a friend and we ordered two entrees, potstickers and soup. The soup was pretty good (hot and sour) and was spicy without needing to add much which was nice. The potstickers were good. We tried the beef with a garlic ginger sauce. I enjoyed it but the sauce came on the side which just felt weird to me. The orange chicken however was the best I've ever had and I will definitely be back for it soon. It was even good leftover. The employees were also sweet and helpful. Overall it was a great experience!", "author": "Sable B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "My friends and I are always looking around for some hole-in-the-wall, hearty Chinese food in the city and through my friend's recommendation, I came here to eat and it was everything I wanted and more! First off, this establishment is cash only and it's a bit older, so don't expect fancy eats or those hipster joint feels.\n\nI first came here with a friend and ordered three dishes to share between the two of us. We ordered the twice cooked pork, orange beef, and chicken chow mein. Wow, the flavors were spot on and it came out pretty quickly too! Did we finish it? Yes we did. More so my friend did and his stomach hurt the whole evening after. But that didn't stop us from coming back again but with more our friends. \n\nThe next time we came back with three more of our friends and we ordered the general Tsao, twice cooked pork, orange beef, Hunan shrimp, and Hunan beef! It tasted just as delicious as before and a lot of us were saying, thank goodness they add vegetables in their dishes so it makes us feel like it's a bit more healthier than just eating the meat. The Hunan shrimp wasn't all that great, but the General Tsao was just the right balance between meat and the fried coating. It was sweet but also had a little kick to it. MUST ORDER. As well as the twice cooked pork (but that's just my favorite dish = biased).", "author": "Ada C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "This is a cash only restaurant! Visited this place when the family was in town for vacay, and we didn't know what to expect because there was nobody inside eating when we went. The staff was a little odd but friendly. The food turned out to be absolutely delicious. The fried rice was buttery and incredible. We all tried something new and everything was excellent. I would recommend checking this place out while in the city of you're looking for really great Chinese food. By the way, my little sister are all of her orange chicken which never happens at any restaurant. She's typically a picky eater but gobbled this food down!!", "author": "Rhianna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-03", "description": "I ordered Chicken with String Beans ($8.25?) and a large Hot and Sour Soup ($6.45?). My friend ordered the Twice Cooked Pork ($8.75?).\n\nWe decided to go to this restaurant because of the high Yelp ratings. However, I think this place deserves 2 to 2.5 stars. \n\nWe came in at around 6:00 pm on a Friday night. We saw two other people sitting near us, but most of the time, we were the only people seated. When we got our menus, I noticed a pen was used to write new prices on top of the old prices. It was hard to tell how much our food costed. It was worse when we received our receipt. The receipt was in Chinese and we could not see the price of each individual item. We were only given one lump sum total. \n\nThere was no way of knowing if our food would include rice. Rice was not listed anywhere on the menu. When I asked the waitress, she said I was given three options that was not on the menu:\n1. Half a plate of rice, half the amount of Chicken with String Beans\n2. The full amount of Chicken with String Beans\n3. The full amount of Chicken with String Beans and a side of rice\nI assumed the third option would mean we would have to pay for an extra side of rice. I ended up choosing the first option. \n\nNow for the food... it was just average.\nChicken with String Beans: There was barely any sauce, but tons of oil in this dish. The dish also included garlic pieces and sliced carrots. The carrots and green beans were a bit hard and crunchy. They tasted fine to me but compared to other Chinese restaurants, I would consider them to be a little undercooked. The chicken just tasted average and a bit plain. \n\nHot and Sour Soup: This large soup included bamboo shoots, thin egg whites, small tofu slices, and fungi. Usually when I drink hot and sour soup, I would have to drink a lot of water. However, it was not really spicy even though I could see tons of little red pepper pieces. It was big enough to serve two people. \n\nTwice Cooked Pork: My friend tried to add chili sauce that was on the table to the pork because his dish wasn't spicy enough. He thought the chili sauce had a weird sour taste to it. He liked the cabbage in this dish though. The meat to vegetable (cabbage, broccoli, carrots, onions) ratio was really low. \n\nThere were no signs on the walls or near the entrance that said this place was cash only. Luckily, we had cash with us. \n\nThe waitress did not check up on us and we had to call her over for our bill. The two people who were sitting near us were going to pay for their meal. I noticed the waitress just stood next to them the whole time and waited until they paid after they were done eating. It was a bit awkward and I was concerned she was going to wait at our table the whole time after we finished our meals. When it came time to pay the bill, however, she ended up just setting the check on our table and left. We had to go up to the counter to pay. Furthermore, the waitress never asked us if we wanted water or tea. I think it is assumed you have to ask her for it. \n\nI don't think I will be coming back in the near future.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "My friend and I live in the area and decided to stop by at Yan's after seeing the good reviews on Yelp. We were a little nervous when we walked in because there were no customers inside but decided to give it a try anyways. I'm really glad we did because the food is great! \n\nWe particularly love the orange chicken, beef broccoli, and chicken chow mein. \n\nThe owners are so nice and make the food fresh for you. Please note that it is cash only. \n\nHighly recommend going here for Chinese food/ takeout!", "author": "C S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Delicious chicken and vegetables with fried rice!! About $10!! Affordable and good food. Also comes with appetizer", "author": "Cezanne B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "I had the orange tofu and egg fu young which were all right. They have cheap lunch specials and it is a bare bones spot...you just go here for the food. Was super slow when I was there, looked like they only had 1 chef.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "This place better have good food because everything about it sucks so far....\nAnd yes...the food was amazing!!", "author": "D.J. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "I had the kung pao chicken and it was delicious! My husband had the general Taos chicken. It was delicious. Very spicy which he likes.", "author": "Stacey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "We found this place on Yelp and thought we'd give it a try. It is a tiny little place and does not look like much to look at but WOW the food is good. So much flavor and so well cooked. I had the chicken ginger garlic and it was amazing. The vegetables were cooked perfectly where they still had a little crunch. The seasoning was packed full of flavor. \nMy wife had an eggplant dish that was also delicious. All the meals were so pretty too. \nMy teenage sons had the kung pao chicken and the salt and pepper chicken and raved about them although I didn't taste them so I can't vouch for those. \nI can't recommend this place more. Don't pass it up by its looks. You will miss an amazing meal. The owners are very nice people too.", "author": "Sherwin D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-12", "description": "Alright place a bit hit or miss tho. I got the general tso lunch combo which came with rice and choice of spring rolls, dumplings, or deep fried dumplings of which I selected the fried dumplings. The service was meh lukewarm water, they brought my food to the wrong table, and had to wait around for the check.\n\nThe fried dumplings were bomb and easily the highlight of the meal. They deep fry them in batter instead of your standard potstickers. The general tsos chciken itself was good but average and came with sliced jalapenos and sliced carrots which wernt cooked and were rock hard. I guess I cant complain for 10 bucks out the door but cmon.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-05", "description": "I'm really disappointed with you, Yelp. Yan's kitchen got 4 stars and I was really excited to try a new chinese spot close to my house, but it did not satisfy the cravings. The food lacked flavor and the meats were very chewy, thick and dry. For two girls, we ordered the chicken chow mein, beef with tofu and general tsao's chicken.\n\nChicken chow mein: very americanized, it was spaghetti noodles with very little sauce and the chicken was extremely dry. I did like that they gave generous vegetables like carrots and broccoli, but it tasted like eating we were just eating chicken with plain spaghetti\n\nBeef with tofu: this is normally my favorite thing to order so i was super excited to order this when I saw it on the menu, but boy... I was very very disappointed. It wasn't the right type of beef, it was thick and large pieces that were extremely chewy - pass\n\nGeneral tsao's chicken: this was the only redeeming part of the meal, I mean how could you messed up chicken that was battered and fried right? Thankfully, their sauce tasted alright and they had chili peppers to add some kick. It wasn't the best dish I've had, but it made the meal better - otherwise I would have been very angry.\n\nIn conclusion, save yourself some money and go to chinatown for some authentic chinese food please. The meal was very cheap in comparison to a lot of other fidi places, but ultimately not worth the pocket money or calories.", "author": "Anh Thu P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-24", "description": "I ordered the combination chow mein, and it was awful. Instead of chow mein noodles, they used over-boiled spaghetti, so it just tasted like old cabbage flavored pasta. The few meats they added were very low quality. I would recommend avoiding this restaurant and buying Chinese food elsewhere. Note: Yan's accepts cash only (tax evasion).", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Good spot. I go for the lunch specials they try their best to modify the meals if need be. Cash only though", "author": "Juan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "A Diamond in the Rough\n\nI came in around 5:30p on a Thursday for dinner and the restaurant was mostly full with only one table available. \n\nI ordered the Family Dinner for 2 to share and really enjoyed the flavors, texture, and aroma of the dishes. \n\nOverall\n\nThis place is a hole in the wall that delivers in flavor. I was only visiting the San Francisco area for a week but I never once regretted eating here. \n\nLooking forward to coming back on my next trip to the bay.", "author": "Nicholas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Came last night. Amazing place . great food. Satifactiing100% . We were so hurry. Long day for us.walking.traffic. but once we found this place. My joy. Came back . full of happiness in my mouth and belly..Great Food", "author": "Maria L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-05", "description": "Not as good as I would have hope for. I order three different dishes and they all weren't even close to tasty. Will not come back.", "author": "Mufasa O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "Food was alright, purchased the Kung Pao tofu but it was extremely salty. On the other hand, the spring rolls are what deterred me from a lower rating because I actually really enjoyed them. My friend also ordered vegetable chow mien and enjoyed that. \nUnfortunately the device wasn't all that, ordered water and never got them nor did they ever check in on us. I probably won't come back if not for a small order of spring rolls.", "author": "Divine V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-08", "description": "Just ate here with some friends and the food was way below par. I was spitting food back into my napkin. We had three dishes and each disappointed. Meat was gritty and sinewy, the fried rice was skimpy and bland, and everything tasted the same- salty and indistinguishable taste. It was one of the worst Chinese food I ever had. The older couple who run the place are nice folks and I do not want to disparage their restaurant but for the $10 a dish price I have to warn you, Chinatown as a whole is not the place to experience good quality Chinese food these days.", "author": "Skyler A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "If you come here, looking at yelp to see what to order here will definitely help!!! I highly highly recommend the Orange Chicken, Fried Rice, Mongolian Beef, and Shrimp & Vegetables. \n\nThe people working at the restaurant are very friendly, attentive, and diligent. We walked in as a party of 20, and they seated us right away and made room for us. If you order the dishes I recommend, you won't be sorry!!! Definitely coming back here when I'm back in town! Thanks Yan's Kitchen for making our tummy full and happy!", "author": "Bianca M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "I'm actually not sure how this place has such high reviews as it was Mediocre, at best, and actually more of a let down. Being here for only a couple evenings, I feel like we wasted an evening for fried chicken Chinese food. Per some other Review, I ordered the General Tso's Chicken (2) And we also got the Orange Chicken (3). They are pretty much the same thing but the Tso has a few Jalapeños in there and a little Sesame Seeds sprinkled on, that's it!!  Fried, with too much breading for sure. And rice doesn't come with it, so add another $5 for 2. Also, as noted, cash only. \n\nAgain, I'm not sure how or why this place has such high praise but I know I'll never be back and I suggest you skip it too!!", "author": "Gordo C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-11", "description": "No Chinese should ever try this place.  Unless you are in a pinch and need to get over a meal without thinking foods.  Then, you won't be reading this.\n\nI got the lunch special, since there is nothing Hunan or dishes that require real cooking skills.  The prawns and tofu were in this overly salty sauce over a slightly stale rice.  I wolf'ed it down so that I won't be hungry anymore and just walked out.", "author": "Sin-Yaw W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Delicious food and great customer service. My eleven year old son said it was the best Chinese food he had ever eaten. It was definitely delicious. I wish I lived in San Francisco so I could go there regularly.", "author": "Timothy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Great food, good price. Lunch specials are good, plenty of food, and at a great price. There does appear to be only one chef, so I would not come here during peak times. We came at about 2pm- the food came out relatively quickly and was obviously fresh. Good option if you are in Chinatown, somewhat out of the way from the real touristy shops and restaurants but not difficult to find, right next to the TransAmerica pyramid. CASH ONLY, but there is an ATM close by if needed. Staff were really friendly and appear to be a husband-wife team.\n\nOne note, the restaurant is small, old (but clean), and somewhat dark. Just know this before you go, not your typical restaurant atmosphere.", "author": "Thomas P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "This is the best place for the price. General Tso's Chicken was melt in your mouth! Chow Mein was delicious as well and lunch special includes egg roll. Seriously the BEST Chinese food at this price level in SF!", "author": "Mel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Came here on a Saturday night around 6:30 because my favorite cheap Chinese food restaurant was closed for renovations. When le bf and I came in, there was only 1 other person sitting inside. We had Yelped looking for Chinese food, and because of the price, and the fact that it was a hole in the wall, we were both up for it. \n\nAfter studying the menu and looking at what people recommended on Yelp, we decided to get:\n1. Salt and pepper fried fish special with white rice and fried dumplings\n2. Tofu and green bean special with white rice and fried dumplings\n3. General Tso's chicken special with white rice and egg rolls.\n4. Large hot and sour soup.\n\nThe portions were pretty big. Le bf and I ended up taking half of the bowl of hot and sour soup home along with basically the whole portion of General Tso's chicken and some fried dumplings. \n\nWe both added more vinegar to the hot and sour soup because we didn't think it was sour enough, it wasn't too spicy either (which I liked because I'm a total wuss when it comes to spice). The fried egg rolls were really small and thin, packed with veggies only. The fried dumplings were literally dumplings, that were battered, and then fried. I have never eaten fried dumplings in that way. Le bf really enjoyed them and you could tell they were homemade. \n\nMy favorite dish of the night was the tofu and green bean special. There were plenty of beans and tofu. The flavors really came together and the beans weren't soggy, they still had a crunch to them, which I enjoy. \n\nThe fried fish came out hot and somewhat crispy. I just wish that the chef would have fried the fish for longer so that the batter was crunchier. The fish was extremely tender, which is a good thing. \n\nLe bf ordered his General Tso's chicken. I think he thought it was good, definitely not the best, but not the worst either. I think that the batter on the chicken could have been crispier. \n\nOverall, the price was reasonable and the food tasted good. Our whole entire dinner was only around $34 and we had enough leftover for another meal or 2. It is definitely a hole in the wall run by a nice husband and wife team. This place is also very vegetarian friendly. By the time we left, the restaurant was about 85% full. I think we will be back.\n\nPro tip: This place is cash only.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-06", "description": "I just cannot give this place 3 stars. I don't even know how it got 4 stars.\n\nI came in during lunch. Americanized Chinese food btw. I noticed that this was going to take a while because there's only 1 cook and 1 waitress. But seeing as it's a mom and pop place I'll give it a pass. Our food took around 20 mins. Water and tea are served upon request. The fried dumpling that came with the lunch special wasn't bad. Only thing is the dumpling skin was pretty soggy.\n\nFor entree, I got the chicken with tofu over rice. Portion size was ok. It had chicken, tofu, broccoli, and carrots. First bite, SUPER SALTY. I'm a person who likes salty food but this was just too much. The broccoli and chicken were super salty as it soaked up a lot of the sauce. The tofu was bearable. The carrots were dry looking too. I had some leftovers so I took it back to work to eat later in the day; I don't waste food. Later on, I ate about 2 bites of my leftover and came a massive headache. My friend told me it's probably MSG overdose. I will have to agree. I still have said headache as I type this. \n\nMy friend that went with me claimed her noodles were super salty and greasy which gave her an upset stomach. Another friend said her salt and pepper chicken was good and tender. I don't know what to believe but I'm not coming back.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Authentic Chinese food. Humble setting and very nice owners. We had the general tsao, Kung pao, chicken chowmein and chicken fried rice. All were very tasty. They only use white meat for their chicken dishes which is a plus. \n\nCons:\nIt was a bit cold inside. \n\nPros:\nRestrooms available.\nLow prices.\nGood portions.", "author": "Érica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-10", "description": "Regardless of my rating, I would come back here again. The food was alright, but it's fresh and plentiful. I came here around lunchtime on a weekday. The line wasn't too bad. Enough to make me realize that I should have called ahead to order. I satisfied my craving of mapo tofu with white rice. Luckily I knew from my fellow Yelpers that this place is cash only. \n\nThe little carrots and peas that look like they came from a bag of frozen vegetables from Safeway weren't my favorite part, but I liked how sufficiently spicy the dish was. Again, it was a good sized portion. The rice was on the drier side (the way I like it) and the whole process from ordering to eating was quick. It's Chinese fast food without being Panda Express!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "Had General Tso's for lunch... it was phenomenal.  We had House of Nanking last night and we both agreed that this place was much better.  Little hole in the wall, family run restaurant.  $25 for 2 General Tso's and 2 sodas.  Small spot, great service, great food.  Can't ask for much better.", "author": "Chaz D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-19", "description": "Nice little Chinese place at the edge of Chinatown. The food is ok, not great but definitely not bad and a little pricey for what you get and they only accept cash. I came in late and the place was empty, but they still didn't let me sit wherever I wanted. Maybe they thought a ton of people will suddenly come in? it was still empty when I left... Anyway, a nice place for a quick Chinese bite - nothing special but also not bad.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-03", "description": "Pretty good Chinese food at a decent price.\n\nI ordered the General Tsao's chicken lunch special with rice and a deep-fried dumpling.  The flavor of the chicken was okay, but it tasted like it was fried a little too long.  The jalapeños added a nice kick.  The rice was also good but was a little lumpy.\n\nThe woman who took my order was very nice and there was not problem finding a table on a Monday.", "author": "Bob F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Good food great price definitely coming back to this place. I have had a lot of Chinese food in California, Nevada, Arizona, and Utah and I have to say this is one of the best places I have eaten at. I would recommend this place to all my friends and family.", "author": "Keith A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Great little place for a quick meal. Great value. Yummy food, family friendly. If I lived here in San Francisco, I'd visit all of the time.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "Food was great and relatively cheap. I really liked the old lady who cooked and served the food. She was very nice and delightful. The restroom was pretty small though.", "author": "Sydney X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "This place may not look like much from the outside, but it's amazing!!!! It's a little mom and pop type restaurant, the food is authentic Chinese food! My boyfriend and I both got the General tso chicken, so delicious!! I would come back here in a heartbeat.", "author": "Anne Marie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Stern in appearance and face in stoic contemplation, I stared as the masses yearned for my critique. Unbeknownst to them, there was a vulnerable tell to my shrouded deliberation. My hand gave way to the idyllic thoughts of a brave Chinese chef deep frying chicken in the name of his superior, General Tso. Immediately my mind was enveloped of thoughts of the food critic from Ratatouille.\n\nI would love to try other dishes here, but every time I come here I always order the General Tso's chicken. It is absolutely impeccable. The chefs themselves were trained by General Tso. The only way to describe the chicken is in layers. There is quite a bit of intricacy in how it's crafted. The outer layer is a delicious soft crunch, and as your teeth begin to penetrate this outer layer, they're met with a slightly harder crunch. It's quite subtle, but this is what makes their chicken so phenomenal. The precise reason is that it builds up an expectation, a familiar expectation from eating so much fried chicken, but instead of fulfilling that expectation, it comes at you like an M.Night Shyamalan twist. The twist is that slightly harder crunch. Normally you'd think after breaking through the first outer layer it would get softer, but nope. It was a minute increase in density that bypassed my expectations. \n\nBeyond the delicious and bewildering coating, the sauce was delicious but not overpowering, and the meat was incredibly tender and juicy. Their General Tso's Chicken is a paragon.", "author": "Ankur K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Cheap, good for what you pay for. Sweet lady that was on top of it. Mongolian beef & General Tso chicken decent.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-09", "description": "Oh man, I don't know. We came to Yan's kitchen and it appeared to be a sweet mom and pop style place. \n\nI hate writing this but they had so many dirty dishes piled up and it was empty besides my partner and I. I couldn't tell if they had picked up a clean pot for our dishes and once we got our food the noodles and chicken were swimming in oil. I do not exaggerate - I had to take bites without looking, hoping that it wasn't as bad as I thought. Also, they only take cash. I wish there were signs by the door or somewhere else besides the small one by the register so that we could've gone elsewhere. My husband had to walk all over to find an ATM while I sat there in silence enduring the stinging pain coming from my stomach. Which, by the way, we got sick pretty soon after we left Yan's kitchen. \n\nSo disappointing.", "author": "Abby M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Great inexpensive, family run, \"hole in the wall\" Americanized Chinese food. Everything was clean, service was friendly and quick, and the food was quick. The battered and fried dumplings were unique and very good as other yelpers have noted. The twice cooked pork was excellent but the broccoli chicken just ok. They offer anchor Steam beer which works well with Chinese.", "author": "Chris V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Found this restaurant on yelp and it was pretty close to my hotel so I thought I'd give it a try. There was nobody in the restaurant when I got there around 4-4:30 so I wasn't sure if they were open. I ordered the won ton soup and general tso's chicken with vegetable rolls. The soup was pretty flavorful and the dumplings cooked to perfection. I also enjoyed the vegetable egg rolls. I am conflicted about the general tso's chicken. The breading reminded me of funnel cake breading and had a similar taste. The sauce for the chicken was pretty good and not at all spicy. I'm just visiting the city, but I probably would not visit this restaurant again.", "author": "Nicki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Yan's Kitchen is the best Chinese place in San Francisco!\n\nIt is run by the nicest people ever and the food is delicious!", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Cheap, quick, and tasty. I especially like their fish dishes, which come with good portions and the fish is not breaded heavily like in other Chinese restaurants in the area. And the service is great! Definitely my go-to Chinese place in the neighborhood.", "author": "Carl W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Service isn't friendly nor decor something to write about, but the food is so good it makes up for the rest.", "author": "Cristobal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "This is a hidden jem, there prawns are amazing the fried dumplings are 10 stars and the fried rice and chow main are alright. Amazing spot", "author": "Kayla S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "The food was good, just wished there was a little more variety. Place was also small but you can taste the authentic taste.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "This is my go-to for Chinese food when I'm in the Financial District! My best friend showed me this place a few years back, and her boyfriend showed it to her, he has been going here for many years. Great prices, but remember cash! The best dish there is the Salt and Pepper Chicken. I had never tried this before, so was hesitant when my friends said I had to order it! But do it, you won't regret it. Pure AMAZINGNESS. :)", "author": "Bella C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "this place is amazing they have the best  Chinese  food I ever tasted! They treat you like family an are very nice.", "author": "Rosa V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "My company moved into the area recently and we are still exploring our lunch options, so we thought we would try Yan's. This is definitely a good bang for your buck lunch spot if you want Americanized Chinese food. I'll likely be back for takeout, but I don't think it will make the my usual lunch rotation. Overall a 3.5 from me.\n\n*this place is cash only\n\nFood: 3.5\nLunch specials give you a choice of white rice or fried rice (+$1.00), and an order of steamed dumplings, fried dumplings, or fried eggrolls.\nI ordered the orange chicken. It was decent, but nothing to write home about. It seemed like it was fried for a little too long. 3\nMy coworkers ordered the general tso's chicken, mongolian beef, and broccoli chicken. Their ratings for the food were 4, 4, and 3 respectively. So overall pretty good.\n\nService: 5\nThe place was empty (~11:50am On a Wednesday) so our group of 5 sat down immediately. Service was really quick as expected. No complaints.\n\nAmbience: 3\nThis place is fairly small, but had tables that could seat about 6 people. Decor is what you would expect for a hole in the wall kind of place like this. It never filled up for lunch so it stayed pretty quiet.", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "A small mom and pop shop that always offers fresh and tasty Chinese cuisine.  Found this place a few years back and always stop in when we're in the mood for some good food.", "author": "Auggie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "Do not believe the high reviews. This restaurant was terrible. Our table ordered two noodle dishes: the chicken noodle soup and the vegetable chow mein.  The noodles were not Asian noodles but spaghetti noodles. The chow mein was served with greasy, undercooked vegetables. The chicken soup was ok and the won ton soup was probably the best meal served.  I am fine with a hole in the wall that is a little dusty and the food is amazing. This place was grimy with food that lacked in flavor.", "author": "Meme B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "Cheap basic Chinese American food.  General Tsiu shrimp breeding fell apart with touch of chop stick.\n\nDumplings are bland.\nPlace smells like grease when you enter.", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-01", "description": "This place has great dumplings, everything else was just so/so. The women who was working seemed like she was very unhappy to be serving me. Not the best experience. I wasnt a fan of the hot and sour soup. The hot chili that they have sitting on the tables tasted awful, it seriously tasted expired!! The hot and sour soup clearly had this chili in it and the flavor was so strong I couldn't eat it. Definitely wont be returning.", "author": "Kelli N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Dear God, I haven't had Chicken Broccoli that good EVER!  Don't be fooled by the unassuming looks of this place.  I will gladly eat here again the next time I visit San Fran.  Just the kind of diamond in the rough that do it old school and folks like me love it!", "author": "Heath W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "This place made my day. After exploring the city by foot the food here hit the spot! I ordered General Tso's and the food was perfection!  Rice was Lightner hearty, the chicken was tender and the batter thin with just the right amount of sauce. Even though the sauce was generous the batter remained crispy. The fresh jalapeño wad to die for and added just the right amount of heat. So impressed with the food. \n\nYou may wonder why 4 stars then? The place struggles with cleanliness in the dining area. The waitress was disgruntled, did not bring water, and I had to wait 30 minutes for my order to be taken. Decided to walk up and pay, I would have been late to my flight otherwise! Cleanliness and some costumer service improvements would make this place a 5 star. \n\nHaving said that, I would still go back and perhaps get some takeout!", "author": "Blanka A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "The pork fried rice and lemon chicken were yummy yummy to my kiddos tummy.  Be back for more", "author": "Dyniece A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Place was good for a quick bite! People are nice and the food was about average. BBq Pork FR, Chicken w/Broc, Spring Rolls...all on par with most fast food Chinese!  Enjoy.", "author": "Ben Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "The good reviews here are to be believed, indeed. I didn't expect too much and got back amazing value for my dollar. This was one of the best Chinese food meals I've ever had. \nAccording to one family member I spoke to, Yan's has been here for 25 years. So, support local business in SF.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-25", "description": "Took absurdly long to serve us. Like 25 minutes before she even took out order, damn near an hour before we got our food. people that came after us were served and done with their food before we even got our appetizers.", "author": "Edward B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Wow we came to San Francisco fromTucson Az for our 20 year anniversary and had one chance to eat Chinese food in Chinatown. The food was so good. We we're very iffy because the outside looked a little worn. I'll change that to broken in. We enjoyed every bite and there was no up charge for the view like every where else in SF.", "author": "Mark I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Weary after slogging through a rainy Chinatown, finding Yan's outside of bustling Chinatown was a nice surprise (ok, not really a surprise, we found it on Yelp!).  As we had done so far at other restaurants, we decided to pick through the menu to try a few things - first the dumplings (very good, filled with meat) then an order of orange chicken (included a massive scoop of steamed rice).  \n\nI picked a nice cold Tsing Tao to wash down the snacks, which was the perfect touch for an early afternoon treat.", "author": "Patrick K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-19", "description": "$10 for standard Chinese takeout bok choy chicken? No way! Culinary profiteering at Yans. \n\nThe dish was good. Bok Choy was soft and well seasoned. The chicken was tender but its mouthfeel was uninteresting. Rice nicely soaked up the seasonings and was well executed.", "author": "Jack M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "This place is delicious!!! Cooked fresh and so good! Close walk from the financial district and China town! Would recommend to anyone.", "author": "Kelli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Perfect home cooked type of meal in a nice homey environment. Husband cooks wife serves with a smile that can light up the space ship! I've been eating here for a while, every time I craved a home cooking.\n\nGeneral Tso chicken -5/5\nChicken in ginger garlic sauce - 5/5\nPot stickers - 5/5\n\nThis place is a must try!", "author": "Vikas J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "I ordered the salt n pepper fish with white rice and 2x egg rolls. The fish was good but a tad too oily for me and the egg rolls were delicious!\n\nI'm definitely interested to try their other dishes.", "author": "Alice X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "The food was great. The fried dumplings were easily the best I've ever had. The service was quick and the bathroom was clean. Definitely recommend- get the fried dumplings !", "author": "Kenzie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-16", "description": "Was drawn to try this place by reviews of other fellow Yelpers and we weren't too disappointed. We ordered lunch plates: curry chicken, chicken with broccoli and a vegetable chow mein a la carte. The curry was on point. Right amount of curry flavor and vegetables and chicken breast pieces. It was delicious. The chicken with broccoli was good but not great. The lunch plates come with 2 vegetable egg rolls. The egg rolls were TOO GREASY! The chow mein was TOO GREASY too! The noodles looked and tasted like spaghetti noodles and he sauce was tasty but not enough soy sauce. The tea is in bulk which is better then a teabag but served in a small plastic water glass instead of a teapot and tea cups which was a let down. You will need extra napkins to drain the oil from the egg rolls. We had to keep asking the waitress for extra napkins as there are none on the table and We needed some extra ones to wipe our mouths and greasy fingers. The waitress was nice but skimpy with the napkins because we asked 2 times for some and each time we only got one. We were a party of 3. Other than that, the food was better then other places we've been to lately.  We would return if we were in the area.", "author": "Review L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "Yan's Kitchen is my favorite happy hour go-to restaurant near where I work. Note that they only accept cash here! Their happy hour is from Mondays through Fridays 11-3pm, and it starts from $7.35 which includes steamed rice with either steamed or fried dumplings.\n\nI ordered the salt and pepper chicken with fried dumplings and was not disappointed. The wait was a bit long (10 minutes), but that's because they were busy and only had one server and cook. I'm assuming that it's the husband and wife.\n\nI took my order to go and thank goodness they have huge servings! The chicken was freshly cooked, and it had the right texture. It wasn't overcooked nor undercooked - it was perfect! The fried dumplings were great too!\n\nOverall, I highly recommend checking this place out if you're looking for a restaurant that has happy hour and big portions.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "this place was great food - I was surprised because it doesnt look great\nbut nice friendly couple runnning the place and really good food. I had the hunan veggie rice plate which was great, nice sized portion and super cheap.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "This is the purest mom and pop spot imaginable. There are only two staff -- mom handles all the service and pop does all the cooking. Mom is incredibly sweet and kind -- she is always happy to see me and knows my order by heart. If you come mid-afternoon when business is slow, you'll spot pop reading a newspaper at one of the tables or the both of them hosting friends. I actually don't care how good the food is -- I just want these people to be successful.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Tried this place last night and it was good. The only thing that sucked was cash only. But it is worth coming back to.", "author": "Dante C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-29", "description": "1. Dirty nasty place.  Here's a tip... go the home depot and buy a box of Raid foggers.  Set off one night and get rid of all the nats and fruit flies that practically carried me away.\n\n2.  Food:  M'eh... Generals Chicken... think not. Mostly the fried batter..where's the chicken?  Spice rack on table... get a rag and clean the bottles.\n\n3.  Price:  Great price, you get what you pay for here.\n\n4.  I'm an avid yelper before going out to a place... Yelp you let me down on this place, I can't believe the great reviews here after my experience.", "author": "Keith M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "I wouldn't go to another place in the city. Whenever I'm in the area I stop by Yan's. It's something about the people and the food here. My favorite in the city!!!", "author": "Dominic D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-25", "description": "Make me sick... this place honestly tastes okay, but who knows what you're eating. Would much rather eat at Panda Express. Even the water here is gross. DO NOT EAT HERE. It will ruin you're stomach. Like I said, it does taste good, but the chicken isn't chicken.", "author": "Vinnie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "This is one of those places, \"don't judge a book by it's cover.\" Food was fantastic! Outside ignorable, only found this place through yelp reviews. Came here near closing time and no one was here, had seconds thought of going somewhere else but luckily didn't. \n\nThe shrimp fried rice has that wok flavor you can't get at home, top notch! General Tsao's chicken was crispy and full of flavor but mostly batter. The mongolian beef was great with rice.\n\nGreat place to order from to-go.", "author": "Hui L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "lol pretty much the most Americanized Chinese food I've had in recent memory. Is that a bad thing? No, not necessarily, as long as you know what to expect when you come in. They have a set of lunch specials from 11am-3pm that are all around $6.50, where you get a bowl of soup, your choice of dumplings or egg rolls, and your choice of one of roughly 15 American-Chinese entrees.\n\nI ended up going with the Hunan chicken, upgrading my dumplings to XLB, though, in hindsight, I really should have just straight up ordered the orange chicken instead (I think the Asian in me was trying to resist that urge). That said, they do also have a regular menu, which I imagine has more traditionally Chinese dishes.\n\nHow was the food though? It was okay. The XLB weren't really like XLB at all: just giant dumplings wrapped XLB style, minus the soupy goodness. The Hunan chicken itself was chock full of flavor, but definitely came in on the too-salty side (catering to more American taste buds, I imagine). Still, given the pricing, I could see myself coming again if I were in the mood, in the way that some people do actually crave Panda Express on occasion.\n\n***Accessibility Info***\n\nVenue - There's a single 2-3\" step to get in to this smaller restaurant, but, once in, you'll find that the majority of the seating is accessible, save for the counter/kitchen seating.\n\nBathroom - Didn't check them out, so no comment.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-16", "description": "We stopped in late night around 9pm right before they closed. I make a quick selection off the specials menu and went with the bok choy wtih chicken for about $10. We ordered to go. \n\nThe dish was thinly sliced grilled chicken squares, with steamed chopped bok choy atop white rice. The bok choy was good, cooked right and coated with chicken broth flavor. I liked how the chicken broth taste was present throughout the dish. The plate also came with 2 fried dumplings. These are'nt your typical fried dumplings,no. They are completely deep fried in hot oil until a golden crispy brown. They were pretty awesome.", "author": "Christopher M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "This place was recommended  by our landlord. Place is on a main street but was very dark and table was sticky. Price was reasonable.  They only accept cash. Large menu. Potsticker was overcooked but did not come with a sauce.best dish was the garlic chicken. Tried the general  tsao chicken. It was deep fried. It had a good flavor. The low me in was tasty but pork was mostly fat. We had back toy with garlic sauce but they forgot the gsrlic", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "This is one of my fav Chinese place. I used go there a lot when I was working in the city. The old lady and gentleman are both no nice. They were taking my custom orders like changing seafood to meat..etc. my fav dishes are Mongolian beef and slt&papepr chicken/beef/pork whatever. Mongolian is so flavorful and thick. It might be a bit salty for some people, but ask them before order, they would be happy to adjust. Also, they are supportingly quick as they are only two operating the restaurant. You guys rock!", "author": "Michael K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "Not very good. Food is ok but quality is not what we were expecting. We ordered Mongolian beef and it didn't look like beef.", "author": "Claudia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "Discovered this place kinda on accident while strolling through Chinatown. \n\nThe husband & wife team that runs Yan's Kitchen is truly a dynamic duo. You'll hardly see Yan glance up from his woks - leaving his wife, Mei, to (wo)man the front lines.\n\nWhile the decor leaves a bit to be desired (think of it as an exercise in simplicity!), the food itself is filling, tasty, and best of all...affordable for any budget. \n\nComing in the day after Bay To Breakers, the GF and I desperately needed some hangovers taken care of, and fast. To that end, Yan's did not disappoint. \n\nWe ordered an order of Combination Chow Fun, some Hunan Beef and a side of Fried Rice. \n\nThe Hunan Beef was well-seasoned and the vegetables retained their crunch very well. Also, the dish had just the right amount of heat - not too overwhelming, but a really subtle kick. \n\nThe Chow Fun was also delicious; there's something about the quality and freshness of the meat/poultry/vegetables at Yan's that surpasses that of other Chinese places. Similarly, the portions served were surprisingly large, even by Chinese restaurant standards. \n\nIn spite of the fact that we had come right in the middle of a busy lunch hour crowd, we were seated pretty quickly. To her credit, Mei was also very cheery in taking our order and making sure that we were well attended to. It was funny catching her and her husband having a quick laugh with one another after the restaurant cleared out; their teamwork is evident and very much admirable - they clearly have the formula for success down pat! \n\nKudos to the duo at Yan's, not only for turning out such a high-quality product, but for showing that it's entirely possible to make a living doing what you love. I wish them nothing but continued success and prosperity!", "author": "Mark V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "I had parked at the Portsmouth garage at Kearny and Washington because I knew we were going to be in San Fran for the better part of the day and I had planned on visiting Yan's Kitchen based on the many positive reviews on Yelp.  \n\nIt was basically around the block from where I had parked.  The place is exactly as how it was reviewed by many of the others here.  The place is dated and could use a make over but that's not what you have to worry about when you come to this place.  If you want ambiance go someplace else.  This place's strength is the food that the chef is pumping out all on his own.  \n\nThe place is really small.  We sat at a table for 6 because 2 other tables of 4 were not cleared from the previous customers.  The place only has maybe 8 to 10 tables?  The place is run by a couple and they are doing the best they can.  The female is taking orders and serving, clearing tables, cashing out while the male is pumping out all the dishes he can non stop.  \n\nThis is really a hard working couple and I knew that others had mentioned that the service may be a bit slow but until you go there for yourself you won't understand why.  The place is pretty busy and we saw couples, other tourists, locals come and go and you can see why locals would totally be enamored with this place.  Their food is amazing... period.\n\nWe were 3 adults and 1 child so I tried to order accordingly.  We ordered one bbq pork fried rice, combination chow mein, sesame beef and general tso chicken.  I saw many people say in their reviews that the General Tso's was the best they ever had so I was more than intrigued to try it myself.  \n\nWell eventually the General Tso's came to the table and it was absolutely true.  This was the best General Tso's ever.  It has a nice tang while having a nice crispy light batter to it.  The batter is so light it's sublime and the sesame beef wasn't that different as well.  The chicken has some fresh slices of jalapeno peppers which was a nice sting to the dish.  I took them all because I was the only one who likes jalapeno's but overall the food was nothing short of the perfect.  My wife who is very particular about Chinese food said this was the best she ever had and I can't say I disagree with her.  \n\nWe only had 4 dishes but the meat dishes were the best I can say.  We sort of ran out of fried rice so I had ordered a steamed rice to go with our left overs which we were going to take out with us.  \n\nI was very pleased that I went to Yan's because the reviews were absolutely spot on.  So 4 dishes and I had 2 beers and the bill was just over 40 bucks.  Talk about value as well...", "author": "Lambert P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-28", "description": "The reviews are right about one thing - the general tso is pretty good. However the orange chicken was soggy and falling apart. It was also a dark brown color not orange which was unnerving. The lemon chicken was alright but also very soggy which was just not appetizing. At least the chicken wasn't the usual diced, regurgitated looking stuff that most of these Chinese places serve. If anyone has tips for actual GOOD American/Hunan Chinese food in SF please message me! I have tried relentlessly to find a place. I think I'm just sticking to Panda Express for now.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-25", "description": "I was in San Francisco briefly and decided to find a Chinese place with good reviews. I ordered my peraonal favorite General Tso chicken with fried rice, my wife had Mongolian Beef.  In short her food was great if it was just her they would probably have 4 stars easy.  Unfortunately my chicken was overcooked (downright crunchy).  When\nI informed the lady helping us she informed me it's very popular and people like it that way.  Well I'm not people and I've had General Tso all over the country there's no justification for that.  I just paid the bill and left annoyed. Again my wife had no complaints so it's crap shoot if you're hungry, hopefully you have a meal more like my\nwife's and not mine. Ps they don't accept credit cards, it's cash only.", "author": "Andre A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-17", "description": "The food was reasonable but the woman working there tried to  short me on the change (5 dollars or so). When I accused her of it she immediately handed the money back to me, which is not something an innocent person would do, you'd expect there to be some hesitation. \n\nBad ethics, don't support these people.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "I love this place. The setting isn't fancy, the but couple who works here is so nice. The prices are good. I also find everything to be really fresh, and love all the veggies in the dishes I have ordered. My husband got Mongolian Beef an I got Broccoli Chicken (light on the sauce) and both were fantastic. I have been back a couple time and gotten the same order to go!", "author": "Laura T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "DELICIOUS!!\n\nAUTHENTIC!!\n\nCHEAP!!\n\nnow go and enjoy! haha friendly staff i think owned by wife and husband very good food i never eat soup but theirs was reallyyyyy good first time i eaten a whole soup, orange chicken was good also very crisp too i enjoyed that", "author": "Oscar D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "The food was delicious. We had the hot and sour soup and a few dishes and everything was simply outstanding.", "author": "Tegan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "We went today at about 4 and were the only ones there. The service was speedy and friendly. We both ordered from the specials list which came with dumplings or spring rolls. Get the fried dumplings. They were so good! After a long day of walking all over the city, this food was so good!", "author": "Brooke J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "Not bad, but I'll try it again and possibly update my review.  The dining room is definitely outdated, but my review will have nothing to do with that.\n\nThe food is good, and it is fresh.  The vegetables seemed fresh and I was glad that there were not huge chunks of near raw green bell pepper.  Lots of Chinese spots include those and I don't care for it.  I also like my onions to be cooked a little more, but now that I know, I'll ask them to cook the onions a little longer next time.\n\nMy original motivation for going here was my hankering for some noodles.  I didn't do a very thorough eval of this spot for going, so I guess it is my fault that they didn't have crispy noodles (hong kong style).\n\nThe quality of the chicken was really good, not fatty, not dry, and it seemed like white meat.  This is key.  Some inexpensive Chinese places have horrible almost inedible meat, chewy, fatty, and nasty.  I was glad that this place was nothing like this.\n\nThe people working there (I'm guessing the owners) were nice and were not rude like you can sometimes get from other Chinese places.  They both seemed to be easy going and not in a rush (in a good way, not in a lazy way).\n\nThe prices were decent for what it was, but seemed a little on the high side for this type of food, but I guess it is closer to the fidi, so it probably has higher overhead.  $10 for a plate of chow mein after tax and tip.  The dish was also a little light on the noodles.\n\nGive them a try, just don't go out of your way to come here if you are looking for a fancy or romantic meal.  If you want a quick lunch, it is worth a stop.", "author": "Ty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "We had American version \nOrange chicken fried rice and spring rolls \nIt was absolutely awesome this place is s hidden gem I'm very satisfied with the cuisine highly recommend you stop in for a quick bite not much seating and place fills up fast \nGood luck teller", "author": "John W R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "Unbelievable rude service. The lady who I assume is the owner looked bothered when we walked in. She basically threw the menus at us and did not greet us. She never asked us what we wanted to drink. I had to ask her for cups for water and she tried to charge me for water cups. I told her to just give me the cups because I had a huge bottle of water with me. Finally when the food came it turned out to be greasy and oily americanized chinese food. I was not expecting that from a place with 4 star ratings. I am convinced the reason it has such high ratings is because of all the foreign people who come to Chinatown and think this is good chinese food. We ordered 3 plates off the menu that we all planned to share, but she only gave us 1 spoon and fork! Again I had to ask her for more plates and silverware so we wouldn't have to eat with our hands. Will NEVER be back and guess who did not get a tip?", "author": "Kev N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "Hidden Gem that needs to be discovered by all...although I almost don't even want to tell people about it so it can remain a great secret! \n\nUncle wanted to come here after he got off his flight from LA, a cousin of ours recommended Yan's so we went here. Walked up and it looked like my favorite kind of restaurant, a hole in the wall. Walked in and my uncle already knew what he wanted, General Tsos Shrimp, Combo fried rice no veggies, extra egg along with an order of veggie rolls. \n\nA couple of sake shots later the food arrived and my uncle and I were very pleased. It is great to see a Chinese food place still making FRESH food at a beyond reasonable price!  The bill was so surprising the lady joked with us and said she gave us 50% off! I will recommend this place to many of my friends and will definitely be returning on my own very soon. \n\nYan's is the place to go!", "author": "Charles D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "Cash only! I found that out the hard way. The beef and broccoli was pretty good. The fried rice was decent, but I asked for no peas or carrots (why would anyone put peas and carrots in rice? It's not a pot pie!) The fried pork dumplings were awful. I was expecting something like P.F. Chang's pan-fried dumplings. What I received was a gob of tempura batter wrapped around what may have once been a dumpling, with very little filling. A grease ball. I couldn't eat it. The egg-flower soup was bland and tasteless as well.\n\nThe entrees all tasted very similar to each other; high in sodium and overly dressed with soy sauce. It's your average Chinese food place, probably perfect for satisfying a craving for Chinese food after a night of binge drinking or some adult extra-curricular activities. Just stick to the classic dishes. You won't be expressing culinary wonderment at the chef's deft hand in creating explosive flavors, but you also won't be hurling in disgust (unless you order the dumplings) or experiencing disintery either. If you order the dumplings, you're on your own and I'll just say, \"I told you so\" right now.\n\nBecause I was pleased regarding their willingness to make my rice without the peas and carrots, (which tells me their food is made-to-order), the prices are unbelievably LOW (three of us had lunch specials consisting of appetizer, soup, entree, and rice for under $20 total) and the food was definitely better than Panda Express, I would order from here again in the midst of a craving for a quick Chinese food meal. \n\nConvenient walk from the finanical district of downtown SF.", "author": "Heather A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "This place is a small mom and pop shop in Chinatown and it is pretty delicious! The restaurant was empty when we came in so no wait. \n\nCame with a group of friends and ordered General Tso chicken, orange chicken, broccoli beef, rice & chow mein. \n\nWe were completely full! \nHowever I would not recommend the broccoli beef, it's a little on the salty side. \n\nOther than that everything was great, definitely recommend!", "author": "Stephany Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "I had a quick stay in San Francisco and was looking for a tasty lunch spot so I hit up Yan's Kitchen, which was right around the corner from my hotel room.\n\nI started off with a small won ton soup. It certainly wasn't small. It had a tasty broth, a good dose of peas, carrots and other veggies, and 5 big won tons! My lunch platter came with 2 small spring rolls which were also delicious, and then the entree of General Gao's Chicken with rice. \n\nYan left me very pleased with my meal, and I would definitely seek them out again for lunch near Chinatown.", "author": "Keith H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "This place is a hole in a wall. Not too great of an ambiance but the food was delicious for the value of your money considering everywhere in SF is way overpriced. We had salt and pepper shrimp, general tzu chicken, beef broccoli, seafood medley on sizzling place. Everything except for salt and pepper was tasty. The shrimp came in a small portion and without the head and shell in it which makes the salt and pepper shrimp dish. The couple were very accommodating and hard working.", "author": "Chiarra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "We were in Chinatown for the first time and wanted to find a good Chinese food place. I came across Yan's Kitchen via Yelp. The reviews were good and the pictures provided a good image of the food. \nAs we arrived, we found a good parking spot.  The cook and the waitress were very humble people. Our order was promptly served and the taste of the food was amazing. The veggies were fresh and had good flavor.  We ordered from the lunch menu. \n\nMy husband had the #19; which had a combination of chicken, beef and shrimp in Mongolian sauce with vegetables. \n\nI had the #3; house special/beef with vegetables. \n\nBoth of our kids had the orange chicken lunch special. \n\nEach lunch special comes with your choice of rice and/or 2 dumplings/egg rolls. \n\nWe all chose egg rolls. They were very crispy and had a fresh flavor to them.", "author": "Veronica O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Chow fun\nMongolian beef\nOrange chicken\nFried dumplings\nShrimp egg foo young \n\nWe're all so flavorful and authentic! Remember to bring cash and be patient the food takes time to leave the kitchen since they cook with fresh ingredients.", "author": "Jeanette N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-07", "description": "General Tso's chicken was average at best, soup scalding hot, didn't receive lunch special dumplings until I asked about them a few minutes after the entree arrived. Service slow, asked for a beverage twice but never received it.  Place became very hectic as the lunch hour progressed due to parade of to-go orderers that left the older lady working the register and the floor overwhelmed.", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-27", "description": "I should have known it wasn't good when it was completely empty and the restaurants on either side were packed. Horribly bland, cold food, even worse service. The tall man that works there made me feel incredibly uncomfortable. With so many great choices in the neighborhood, I would never come back here.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "The food was so good. We ordered the general chicken...shrimp fried rice...and Mongolian beef. Fresh...and very tasty.", "author": "Kimberly O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-21", "description": "Nice little place to get some quick and tasty Chinese food. They have a pretty standard menu, but the thing that stood out the most were the fried pork dumplings. So delicious! Super crunchy and perfectly fried on the outside, but just like a regular dumpling on the inside. Definitely a must try.\n\nDon't forget it's cash only!", "author": "Jaymie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Great little gem!  This is a little mom and pop shop which holds true to what counts most... a great tasting meal.  We had a great experience at dinner. The food was delicious and the service was as expected.\n\nThe decor is a bit dated and has that charming hole-in-the-wall kinda feel... which I think makes the experience that much better. We also notice a lot of \"regulars\" coming in for a meal.  We had the combination fried rice and chicken and vegetables. Both had great flavor, the food was fresh and perfectly cooked and very well priced. \n\nEnjoy!", "author": "Frank C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "General Tso's chicken is amazing! Batter is all fresh light and crispy! Superb!\n\nOk embarrassing ending to my dinner time here. I go to pay my $15 for the Tso and fried rice and 2 Anchor Steams (amazing!) and they dont take credit card. So I ask where the ATM is and ask if they mind me heading up the street to get cash out and come back. I get to the ATM only to discover I had left my cash card back home on the East Coast and who remembers their PIN to their VISA. I go back to explain the situation. The wife is not there but the husband, the chef whom I had just praised for the best General Tso's chicken ever, I told. He graciously accepted the $5 dollars cash I had and said no worries! Wow is his wife ever going to kick his butt! Tomorrow I will head back with cash and a large tip.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-14", "description": "I came to this place tonight with a friend, got sat at a table for two and then proceeded to look at the menu. My friend really needed to use the restroom, so he got up to do that while I perused the menu. They had some good options and very reasonably priced. The decor wasn't much but sometimes those hole-in-the-wall type eateries have the best food.\n\nI was all set to order when my friend came back, eyes wide, and told me that there are COCKROACHES hanging out on the bathroom wall in full view. It goes without saying that we refused to eat there. We politely told the server we were leaving because of what we saw and he had the nerve to charge my friend $2 for using the bathroom without ordering food. He paid and we left because we couldn't get out of that place fast enough but for any current and future patrons, be warned. This place clearly isn't up to code.", "author": "Mikal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Decent, affordable Chinese food in a clean, above-average setting for a Chinatown-area restaurant. Helpings were plentiful, the taste was OK, and the two older folks here were *super* sweet and took care of me well (although, granted, I knew exactly what I wanted, could speak the language, and struck up a nice conversation with them).\n\nNot gourmet, mind-blowing food by any means, but it gets the job done well, and, all of the above considered, I'll be generous and bump up what would otherwise be a 3-star \"pass\" rating to a 4-star \"high pass\" review. You could do far worse for your money in Chinatown.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-26", "description": "Yan's makes your typical Americanized Chinese food--flavorful than most, but, like many Americanized Chinese restaurants, not the healthiest. It could be worse though.\n\nI ordered the chicken with vegetables and fried dumplings, but they made a mistake on our take-out order (which took forever, btw)... My friend ended up getting someone else's entree instead of his, and worse, they forgot our fried dumplings! We were pretty upset, but were ultimately able to feed ourselves with the large portions anyway.", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-11", "description": "Mediocre food. Don't touch the chilli condiment. It's suspiciously spoiled. Next time I'll go to Panda Express instead.", "author": "Putri I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "***Cash Only, No MSG***\n\nIf you spend $13.00 at this restaurant and if you are still hungry, you have an issue.\n\nTheir lunch special costs only $6.45 and you will get a small bowl of soup (weekday only), 2 pieces of dumplings or spring rolls and the main dish with rice. Yan's Kitchen gets 5 starts in my \"Cheap Chinese Eats\" category.\n\nComing to this restaurant is like seeing the movie \"Boyhood.\" Nothing spectacular or dramatic things occur but people find it heartwarming and soulful. \n\nThis restaurant is located on the edge of Chinatown, just 1 block from Transamerica Pyramid. Clearly, Godzilla fell down just 2 blocks from this restaurant in the latest movie but Mr. Yan's has been passionately cooking for more than 20 years like nothing happened. \n\nMr. Yan and his wife, Mei are some of the nicest people on earth. A lot of repeaters come back to this restaurant to enjoy the cheap but delicious food and to see their smiles. Every time I come to this restaurant, I feel like I were invited to a Chinese friend's house and their kitchen happened to be the size of a small restaurant. And the friend's parents cook the food for me. Even if you come here alone, they will be happy to welcome you. \nThe decor may be dated but that's a charm and we, repeating customers don't care. \n\nThe most popular dish here is \"General Tso's Chicken\" and it is really good. I also like to order \"Salt and Pepper Fish\", \"Fried Rice\" and any dish with broccoli because their broccoli is always cooked perfectly. If you order Shanghai Dumplings, you may find there is no soup in them. It may be affected by the unusual California drought. They still taste good! \n\nSometimes, fine dining at Michelin-starred restaurants gets boring. We pay hundreds of dollars and get food with the sous-vide meat, the foam and the spherification. Although, the dishes may have chef's creative passion, some dishes have no soul at all. \n\nHere at Yan's Kitchen, every dish is soulful and served with love. \n\nIf you are a lady and dumped by your boyfriend, come here even when you are in your sweat pants or in your pajamas and eat a lot. Mr.Yan and Mei's smiles and their food will comfort you.  \nMost of all, their food will give you plenty of energy to slap your ex-boyfriend's cheeks super hard. \n\nEnjoy!", "author": "Manabu M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-03", "description": "Excited to see a cheap Chinese restaurant, but sad that the portion for the combination chow fun was small and also quite bland. I had to add a lot of sriracha for it to taste like anything. It was also pretty greasy, but that might just be the nature of the chow fun.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Yan's is a great little place right in between China Town and Little Italy run by Husband and wife. Food is pretty good and not weird like some places in China Town. Lol\nJust make sure you take cash because it's \"CASH ONLY\".  Mr. and Mrs. Yan are very nice hard working people. General Tso Chicken and Orange Chicken taste delicious!", "author": "Eddie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-04", "description": "Old school, dirty, hole in the wall, greasy Chinese food. Novelty to sit at the bar. Nothing distinctive, but strangely nostalgic. Lots of old single guys eating there.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Boy, do I miss great Chinese food.  We got the General Tso's and combination fried rice.  I could eat this every day!  And on top of it all, really inexpensive.\n\nGeneral Tso's, really crispy and not that overly sweet flop you oftentimes get.  Fried rice, really hit it.  I don't know what exactly it was, it was just right.\n\nNext time I am in town I will certainly come back.  \n\nOh yeah, cash only.", "author": "Ann Beth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "I have to thank Yelp for this one. I searched Yelp for a Chinese restaurant and after reading a few reviews, we gave this place a try. \n\nWe went at 3 PM on a Sunday afternoon.  The mom and pop owners were the only two in the restaurant.   \n\nWe ordered general tsos chicken, broccoli beef, combination house chow mein.  We ate everything. It was fantastic. I would have easily paid more money for this food.\n\nCash only. Don't forget. Great food at an even greater price.  Generals tsos was the best I've ever had, anywhere. \n\nEven though the health rating is very high on this place... The only thing keeping it from five stars is the fact it can use a good cleaning.\n\nTheir one highchair was from the 80s.  Awesome, metal folding highchair. I haven't seen one of those in 20+ years.", "author": "Heather P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "While every other business in the area seems to be raising prices and offering more kale salads and blue bottle coffee than people know what to do with, Yan's is still serving up delicious and affordable meals for under $7. \n\nIt's the only place I know of where the namesake of the business is actually making your food. Yan is a boss with the wok, turning out more dishes than the entire cast of Hell's Kitchen has all season. His wife Mei is incredibly sweet and handles the register and tables. Highlights include Mongolian and General Tso's chicken and each dish is served with a side, either dumplings or egg rolls. If you dine in, you'll get a cup of soup and hot tea as well. \n\nThey are the real deal, an amazing couple who's been providing awesome food and great service for two decades. Do yourself a favor and read their full history under more info; you'll be glad you did.", "author": "Nick P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-28", "description": "Decent spot, lunch specials are super cheap. The general gaus chicken was pretty good. I haven't ordered it in about 20 years since I was in college. The hot and sour soup was very good. This is a decent spot, but nothing to write home about.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "A hidden gem!\n\nThere's nothing better than a quick, freshly-cooked lunch under $9 in the city. Usually I pick up the 'Lunch Special' order: 2 spring rolls and Kung Pao shrimp with rice. The service is always friendly and welcoming.\n\nCash only, so bring your bills.", "author": "Kim T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "I used to eat here a lot . Cheap and good quality . Woman and Man is very nice ! Small place but really good to have a quick lunch . Tasty enough . \n\nThanks !", "author": "Jay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "I went to Yan's Kitchen on a Tuesday evening with two friends visiting from out of town. It was very quiet, with just two customers sitting by the window. The server took our orders promptly, and we had them in under ten minutes: General Tso's chicken ($7.75), bok choy with shrimp and mushrooms ($7.75), and a side of white rice. Straightforward and flavorful, with fair portions (around 8oz chicken and 6oz shrimp), it was just what we expected. We left shortly after we finished; a quick, filling meal before spending the night out. If I ever had cash on me, I would return!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "This is a small restaurant run by what I assume is a husband and wife team. When we arrived, there was a large party going on that took up about half the restaurant. The other few tables hadn't been cleared, as the two people working were busy with the large party. They moved some things around to accommodate us and all was well. \n\nThe prices were very reasonable, we paid under $30 for three people. The food was super fresh and had none of the \"old oil\" flavor that often is found in smaller Chinese restaurants. We had the lemon chicken - different than any lemon chicken I have had before, I would describe it as more mildly citrus flavor than lemon, but it was super crispy and delicious. We had chow mien, fried rice, and wonton soup - American style Chinese staples, right? They were all full of meat and veggies, not overly salty. My dad asked for hot mustard and she brought him regular hot dog style mustard, which was odd but have may just been a \"lost in translation\" thing. If I lived in San Francisco, I would go back. \n\nNote: cash only!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "This place is literally right at the end of the Chinese New Years parade route. One of my favorite photography spots for the parade, its the end, the people in the parade are so happy to be done with the super long long walk. As I was hanging out I started to get hungry and think about going home, I looked around and found that this place scored better on yelp than all the rest. If ot for the circumstances I would have never sought out Yan's.\n\nThe place was totally packed out the door. I walked up to the window and looked at the menu then called without going inside. The place was so crowded the last thing they needed was someone else making a pick up order as the walked around taking care of the customers. I saw her pick up and answer the phone from the window. \n\nThe place smelled great and I saw all the customers happily picking away at their full plates. \n\n$24 and I got 2 entree beef s, rice plate and a appetizer. I thought this was a great deal. It was so much food I actually ended up eating it for lunch a few days at work. I don't like to eat the same thing day after day but it was not bad as a leftover meal.\n\nString Bean Beef\nChicken Cashews\nGarlic Shrimp \nEgg Rolls\nThe Garlic Shrimp was killer. The String Bean Beef was steady and true to an Americanized beef and vegetable dish but very good. The Egg rolls were also standard. The cashew Chicken had great flavor. \n\nThey have hot Mustard by the mustard bottle in the restaurant but do not have to go containers for it. They gave me a cup so I took a bunch. Good hot mustard.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Definitely a hidden gem with fantastic food. We ordered Chicken with bamboo, black mushrooms, and bamboo shoot. It was amazing, and the sauce is delicious! Everyone else in the group loved their meal. Huge fan of the dumplings, they are very flavorful. The owners are super nice, and service is quick. We have all made it official to visit every time we return to San Francisco!", "author": "Nikki S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "The orange chicken is AMAZING, the best dish I've had at any Chinese restaurant ever, and the service is awesome, but I had a chicken noodle soup was just meh. Still, I love this restaurant and HIGHLY RECOMMEND IT.\nSomething to remember though is that it is CASH ONLY!!!", "author": "Ella H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Cash only!\n\nOrdered the chicken chow mein to go, and it came pretty fast! Pretty good chow mein. Chicken was fresh and the noodles were thick and cooked to al dente. Quite cheap ($6-7) for a big portion. The restaurant is a bit dingy and small, but the people that run it are kind.\n\nI noticed a lot of businessmen coming here solo to eat after work. So I'm guessing if you are wandering around the area and craving Chinese food, it won't feel too awkward to come in and eat here by yourself.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-26", "description": "Are you kidding me???  Who are these people giving all the stars???      \n\nI stopped in here because I was starving and it was the closest restaurant with a good Yelp rating.   I had serious reservations walking in, just because the place looked beaten up, and I didn't see a health department posting in there.  It has this ugly, depressing look to it.  \n\nI ordered the Hunan Beef.  I don't think that was beef.   I really am wondering what that was.  It was barely edible.  It was mystery meat cooked in motor oil.   I don't know why I kept eating.  I just kept staring at the asbestos tile floor and the old lace curtains, and the chipping paint on the window, and the filth covering the vent above the door that probably has been stuck open since 1960, thinking about paying the check and getting the hell out of there.  \n \nIt was cheap.  Can't complain about the price.  You get what you pay for I guess.", "author": "J W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-28", "description": "Food was satisfying. The chicken was crispy and flavorful. The rice was really good.\nWe had a side order of string beans and I must say, they were WAY TOO SALTY. \nOverall, food is good.", "author": "Alexia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "If you have that hankering for classic take out Chinese food, then Yan's is your place. Good sized portions. It's the classic mom and pop restaurant with the standard Chinese menu recipes. Beer/wine available, including New Belgium Fat Tire. Dumplings are deep fried, instead of pan fried. CASH ONLY!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "I work in the city 2 days a week, on Montgomery at Jackson.  I took the office girls to lunch at Yan's, after checking the yelp reviews.  We wanted Chinese, and this place fit the bill....more on that later.  \n\nWe each got the rice plate specials(read lunch specials).  We all got soup....and let's just say Chinese minestrone is wrong on any level.  But that was the low point. \n\nI got the Kung Pao Chicken, the girls got combination(chicken, shrimp, beef) in Mongolian sauce.  Holy Moly, the food was so delicious!!  Some of the best Chinese food I have ever tasted.  We also got the vegetable egg rolls and the fried dumplings(pork and scallions) and they were the best ever, seriously.  \n\nBack to the bill: It was 29 bucks.  Id call that a steal for the financial district.   \n\nI recommend going, or calling ahead and taking it back as the place is small and gets crowded fast.", "author": "Jeffrey M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "We came here for some dinner as we were close to Chinatown/Little Italy. First thing we noticed about the restaurant is that it is very simple but clean. We then saw the husband and wife team running the kitchen. They were pretty cute working together while the Mr. Yan was cooking and Mrs. Yan was hosting and serving our food.\n\nWe got a dinner special with soup, rice, hunan beef and orange chicken. The food was good, but nothing out of the ordinary. The portions were pretty huge for the two of us, and prices were pretty cheap! Looking at the menu, it looks like the lunch specials are the way to go here. Next time we will have to try this place out for lunch.", "author": "Felicia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Lunch special here is really great value; A lot of bang for your buck. Nice little place. Though I always order for pick up. This place always hits the spot.", "author": "Gabriel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "Excellent value Chinese food. Made fresh to order. Line round the block at lunch time. Don't be deceived by its somewhat shabby appearance...", "author": "Hannah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "A chinese couple run the restaurant, so they serve as chef, waiter, cashier... I should have tried the general tso's chicken because there is no this dish at all in China but it turns out General Tso's is so well-known here... I had the eggplant and beef. The beef was a little weird, but its always nice to have some cheap chinese food when you are tired of sandwich, pizza, sushi...", "author": "Chang L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-22", "description": "I had a mission and that mission was Chinese food. I left Mr. wings and proceeded to walk out when walking down the street I noticed Yan's. I thought it may be hit or miss when walking through China Town like you may get some dog or cat so I really had my fingers crossed on it being some legit general two chicken, and I gotta tell you I was quite happy with my choice. The lady who cooked it was very nice and sweet and that came through in her dish, the chicken was cooked to perfection and hit the spot. I would come back", "author": "Rick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Looking for good food in chinatown can be tough since most of the places are junk.\n\nThe wifey and I had to visit the post office to take care of some biz. After handling our ish we both were very hungry.\n\nWe walked a few streets and nothing looked good to us, so we hit up the mighty yelp for assistance.\n\nFound this place and decided to give it a whirl.\n\nIt was an off time when we came, so the place was empty and uncle was eating his lunch.\n\nI took a quick peek around and the place is pretty greasy like your typical american greasy spoon diner. At this point I was a bit skeptical on the food.\n\nChecked out the menu and they had some rice plate specials.\n\nWifey got the General Tso's Chicken(she is embarrassing) and I got the Pepper & Salt Fish.\n\nEgg rolls came with our meal and after my first bite I was pleasantly surprised. The inside of the egg roll was full of bright and vibrant colors. Everything was super fresh! Honestly I did not expect it to be so tasty, but it was.\n\nOur dishes came and I was hoping it would be as great as the egg roll. Uncle Yan did not disappoint. My fish was light battered, crispy and perfectly seasoned. Damn Uncle can work that wok like a balla!\n\nI stole a piece of the wifey's chicken and it was bomb, so I took another piece when she wasn't looking.\n\nOverall experience was awesome and the food is so tasty. Honestly if you just walked pasted this place you would not give it a second look since its not all fancy and polished up like the other establishments in the area. But you would be missing out on a great experience.\n\nI'll be back for sure.", "author": "Jerry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "The NICEST cute couple was working here! Our kids were ridiculous and they were super accommodating. Love this place. Food was perfect and inexpensive.", "author": "Josh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Delicious General Tso's chicken! Food is made to order so it's extremely fresh. This was the best Chinese food I've ever had. The rice is also top notch. You can't beat the price either, we ordered two specials and paid just under $21 :) been here twice so far during our 5 day stay.", "author": "Katrina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "I'm surprised at all the good reviews. We came here on Saturday for lunch to try the General Tso chicken. I got a shrimp and egg rice plate, and added $.35 for the Shanghai dumplings. My sister got the General Tso plate with chicken spring roll. Other than the General Tso chicken, which was tender and flavorful, the rest of the food we got was not that good. I'm Chinese and I've eaten my share of good, so-so, and bad Chinese food, and sorry to say, this is probably near the bottom. The Shanghai dumplings had very thick gummy wrappers, and the meat wasn't fresh or flavorful. The shrimp with eggs was overcooked and bland - needed salt and seasoning.", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "Yan's Kitchen has the General Tso's Chicken by which all others must be measured.  Light and crisp with just the right amount of batter, and a great balance of sweetness and spice.  Dishes with string beans are quite nice as well with fresh, crisp beans that aren't overly cooked like you would find elsewhere.  The prices are cheap and this is probably the best value for dollar around.\n\nThe husband and wife owners fix things up quickly and are happy to please.  While on the edge of Chinatown/FiDi, you may miss it or pass right by it, it's definitely worth making a visit.  The only problem is that they may close early on days when they aren't busy, so you may want to call ahead to confirm that they're open.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Excellent food. Don't let the ordinary decor scare you; the place is clean and efficient. It's a mom and pop operation. Good menu, fresh ingredients, and a wry sense of humor if you watch for it. I went with 6 folks, a mix of coworkers, former coworkers, and my wife. My wife puts it in the top 3 Chinese we've ever had. \n\nWe shared dishes. Chicken rolls were awesome. Very good won ton soup. Garlic chicken was delicious. Probably the best general tso I've ever had.", "author": "J S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "Earnest. That  would be the word I pick if I had to sum up Yan's Kitchen in one word. Oh, that and a-whole-lotta-food-for-little-money. \n\nThey have a great lunch deal around $6-7 for the rice plates which gets you soup, fried dumplings, and a choice of an entree over rice. Basically the only decision you need to make is what meat to pair with which sauce. It's a lot of food for lunch that you might be tempted to have a little siesta after. I've tried several items here from Kung Pao Chicken to the Mongolian Beef (http://www.yelp.com/user_local_photos?userid=DvcAC_nlKaTDsHcA8Slagw) and they've been tasty although a tad greasy. It's not the most authentic Chinese food but as long as you remember that, it's ok. We all have our fried sweet and sour cravings sometimes. \n\nThe stars here though are the husband and wife team that run this cozy place. He cooks, she serves. It's not the quickest lunch but they try really hard and you can feel their genuine effort to ensure you enjoy your meal. For that, Yan's Kitchen is an option for a leisurely lunch in the fi-di.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-24", "description": "This place is super salty and only accepts cash. Of course they don't have a sign that says they only accept cash so they tell you there is an atm down the street when your are finished with your meal. Smh.", "author": "Colin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Very good food. I ordered the eggplant tofu lunch special. The eggplant was some of the best I've ever had . My husband had the orange chicken and said it was delicious. Very good food and very inexpensive. Only suggestion would be to do a little more with decor.", "author": "Lesley F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-07", "description": "I came here for my first meal of my day on the eve of the restaurant's closing time in the evening.\n\nIn broad daylight, the restaurant is a popular lunch spot for workers in the financial district. But at night (dinner time), the restaurant and area is really quiet. \n\nThe \"Fantastic-4\" has dined here many times in the past after our shopping in Chinatown and the food is great with a friendly husband (chef) & wife (waitress) operating the place. \n\nTo begin my working night, I was in the mood for Mongolian Chicken over rice to wake me up. And that is what I took for $6.50. The dish had chunks of chicken meat, onions, broccoli florets, spicy red peppers, assorted spices and Hoi sin Sauce over white rice. Initially I wanted brown rice for $.75 extra, but the chef forgot. No big thing. I still enjoyed my meal. \n\nBoring but good meal to start my day, I know. But that is how my graveyard shift starts for the last 1.5 decades!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "It's cheap & fast, americanized Chinese food. \n\nBut it's not bad. In fact, for the price and speed, they pull it off pretty darn well. Everything was decently well seasoned, the General Tso's chicken was quite tender, and it just -felt- right. They definitely took the generic sounding dishes on the menu and just... made them taste good.", "author": "Alan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-14", "description": "Ordered general tsos chicken and it was a scant amount! I did not feel full after eating this plate which took me only 5 minutes because there were only a very few pieces of overly breaded small scraps of chicken. I had asked her to go but she served me for here.  This was definitely not worth $9 of food.", "author": "Leelee E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "Best Chinese food I've ever had. It was cooked to order, severed incredibly crispy (but not greasy), the sauces were delicious and they were served with generous proportions. \n\nYou can tell everything was handmade because while we were there the the wife was rolling egg rolls and the husband was working the wok\n\nFor three people we ordered a wonton soup, 1 a la cart of general tso's (large portion of entree) and 2 entrees that had rice (mongolian beef and orange chicken) and had enough food for 5 people. General tso's was my favorite and was cooked with carrots and other veggies", "author": "Erica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "This little spot is pretty much what you would expect from a ma and pa run place.  Good quick food.  Not much to look at inside however the staff consisted of an older couple who were polite, patient, and very funny(the lady).  Try the Mongolian beef or orange chicken......Would definitely visit again when in the city.", "author": "Malcolm D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "Food was just mediocre.  Came here because it seemed to be best reviewed place in Chinatown in SF. It was a dirty little diner, with decently priced food.  We got orange chicken and general tso chicken.  Orange chicken was just okay as well as the general tso.  It was one of those places that you walk out of and you feel a little ill. Go here if you need a place in Chinatown, but don't go out of your way to get their food.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Love this place. It's run by a husband and wife, she cooks and serves, he cooks and buys the food... He often walks through the front door with the fresh vegetables. It's like going to he grandparent's place for dinner. Those of you in a hurry or are picky should go to  Panda Express!! Yan's is just cozy.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Great place! Very good atmosphere of family business. the food was amazing! Family diner 9.75$ gives soup and two dishes of awesomeness!\nNo public restroom, cash only, but it only makes it cuter.", "author": "Jagoda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Great food in a clean environment. The fried dumplings were delicious, and the Hunan chicken was fresh and flavorful. Service was friendly as well and it's located in a convenient spot on Columbus. Definitely some of the best Chinese food in SF. We walked it off strolling North Beach and Chinatown and that's always a plus!", "author": "Denis R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "It was sad when U Lee closed my Chinese eating coterie was forlorn.\nNo worries  found this joint that is even better, and really it is a joint: small unpretentious cash only preserved in time. The signage looks crica1950 as do the prices !!\n\nThe proprietresses /cashier/waitress/spiritual guide( yeah you can feel her joyful harmony) suggested  bringing the  gargantuan to go order to the car since parking isn't. \nGO there is garage across the street if need be,or a short walk from Montgomery street station.", "author": "Roxanne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Been there many times last year when I was living in SF. Family dinner is delicious, a lot of food and affordable.", "author": "Ricardo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "One of my favorite Chinese places in the city. This is a mom and pop place that's usually empty when I visit for some strange reason. It can't be the taste because it's delicious, if maybe a bit unhealthy. Greasy, basic dishes but deeply satisfying. Since it's usually empty time spent waiting for seating and food is none and very little. Extremely cheap and filling lunch specials as well. Great if you want a sit down place with quick turnaround time. I've gone in with a party of 4 and been seated, ordered, eaten, and paid in about half an hour.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "Fried dumplings,  general tso, chicken chow mein, chow fun.  The fried was way over cooked.  Tso not any spice.  Didn't bring any rice.  But it was cheap, it was late and I was hungry.   It is what it is.", "author": "Travis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "The sweet and sour pork was excellent, unlike most which only look the part!! Very friendly service too.:)", "author": "Joon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Incredibly fresh and light (Americanized) Chinese food. I say Americanized because it had the \"classics\" that we, Americans, love - Orange chicken, General Tso's Chicken, Beef & Broccoli, etc. We were originally looking for authentic Chinese restaurants but changed our minds when we realized that my in-laws and nieces/nephews may not be feeling too adventurous. \n\nThe vegetables in all of the dishes were cooked to perfection...I even ate the carrots! I hate carrots! The spring rolls and wonton soup had huge chunks of vegetable that we could clearly see. The fried rice that came with my husband's General Tso's was light, fluffy, and delicious. The chicken was fried very well and not breaded too heavily. My Beef & Broccoli was very rich in flavor but not greasy or overwhelming. \n\n\"The best Chinese food we've ever had\" was everyone's responses. Coming from New York natives, I think that speaks volumes!", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "Best inexpensive Chinese food you can get in the neighborhood! Owned by a sweet older couple, you can see the husband cook the food in the small kitchen behind the counter. They have really good vegetarian options. My favorite is the eggplant with tofu and the veggie spring rolls - such a good, filling meal! Cash only, but the prices are super reasonable especially considering the quality and portion size!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "BEST CHINESE FOOD I'VE EVER HAD IN MY LIFE. The couple who owns the place are always cheerful and do their best to provide great service and make awesome food! I'm sad that I live so far away from SF and I can't just drive up the street to get some food at Yan's Kitchen when I'm craving it, but when I do visit San Francisco, it's a must to eat here!", "author": "Alyssa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Amazing Chinese food great prices very affordable and the sweetest service by the cute couple they have been here for 22 years! A must come!!!yummy food try Hunan beef and orange chicken, clean and quiet atmosphere", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-11", "description": "Went for lunch and it was ok.  I split a beef with scramble egg and chicken with eggplant lunch special with a coworker.  They did include a bowl of hot and sour soup, deep fried dumplings for $8 (after tax and tip, $6.75 pre tax/tip) but the food was pretty bland.  I had to add chili sauce to give it an extra oomph, which for hunan food shouldn't have to happen.\n\nService was unremarkable.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Yan's was incredible. i had the orange chicken with spring rolls and fried rice and it was some of the best I've ever had. Yan and her husband do all the cooking. and the hot and sour soup was awesome. the atmosphere is lackluster but the overall experience was great. thanks Yan and Mr. Yan!", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Amazing. If your not sure where to go...GO HERE. If you are sure where to go...CHANGE YOUR PLANS. The general tsos was the best I've had. The wife got chow mein and it's her new favorite. Do yourself a favor and eat here, you don't deserve it, it's too good for you.", "author": "Will L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Always looking for great Chinese food. Found some here. Mr. Y does the cooking while Mrs. Y waits tables at this unpretentious hole-in-the-wall. All the dishes we had were good, but must note the Phoenix Sesame Chicken was remarkable - Salty, spicy (not meaning peppery) and full of fried goodness. I'd go back for that alone.", "author": "Marc D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "I nearly make trips to San Francisco from Chicago just for this Chinese food. I think the Yans are a humble couple that kick out amazing food.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-21", "description": "BEST PLACE EVER!!!\n\n1. REALLY GOOD FOOD\n2. HELLLLLLLAAA CHEEAAP\n3. friendly staff!!\n\nyou can't beat this place, really good food and great prices. mom and pop shop at its best!", "author": "Jaime D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "This was the best tasting Chinese food I've ever had. Good service, good prices, and soooo yummy. A hidden little gem!", "author": "Katie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "And just remember, if Yan can cook, so can... hey, wait a minute! What do I mean IF Yan can cook? He can, he can... Sure, he ain't no Iron Chef, but he does down-home Chinese comfort food like nobody's bizness. Jamie W. and I came here quite by accident because Pickles was closed... for good apparently (who knew?). I checked Yelp on the ol' iPhone and discovered the four-star average that Yan's has earned. \n\nIt was a Wednesday night, and we have to admit the mix-and-match rice plates were just calling our names. I went for the Pork and Scrambled Eggs over Fried Rice (see photo). It was a bit greasy, but honestly, I wouldn't have had it any other way. So good at 9:30PM when all you want is no-fuss food. Jamie went for the General Tso's Chicken over the same Fried Rice (see photo). I think I did better if you ask me, but don't tell him. Both plates were $6.99, and the portions were more than generous. \n\nI forgot to mention we started with a couple of Fried Shrimp Dumplings (see photo). Really crunchy with a tasty filling and a sweet-and-sour sauce you can drizzle on top. I notice they sell cheeseburgers and even a chicken caesar if you're really confused by where you are. Now that's accommodating. The husband and wife who own the place are really terrific, and I get the sense they really appreciate the patronage. And at no extra cost, she takes photos of tourists with the panache of Annie Liebowitz. \n\nFOOD - 4 stars...homemade rice plates, really good like I made it myself! \nAMBIANCE - 3 stars...lunch counterish, but it fits \nSERVICE - 4.5 stars...terrific couple always smiling \nTOTAL - 4 stars...pork and scrambled eggs sound good to me right now", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "If you are working in the area and happen to get a slightly early jump on lunch, you should try Yan's Kitchen at least once in your life.  I was doing 3 day's worth of training in a building next to the pyramid, and found this place on Yelp.  The first day was so good, I went back there for lunch every day I was in town.\n\nFirst day:  General Tso's Chicken Lunch Special -- Absolutely as perfect as a crispy, sweet, and lightly spicy chicken dish as you could expect.  I got the fried rice on the side, and it also came with a couple dumplings.  I upgraded to the Shanghai style for 35 cents.  Different than other Shanghai dumplings I've had in the past, but excellent.\n\nSecond day:  I ordered off the dinner menu.  I got the Combination Egg Fu Yung with a side of white rice.  It was some of the very best egg fu yung I've ever had.  (I always have to get it when I see it on a dinner menu.)\n\nThird day:  Orange Chicken Lunch Special -- Not as good as the General Tso's, but still awesomely crispy.  I ordered the chow mein as my side this time.  It's a very light chow mein... I sometimes like mine to be ever so slightly heavier.  Again with the Shanghai dumplings.  Perfect with hot sauce, vinegar, and a little soy sauce.\n\nEvery lunch comes with a small bowl of soup.  They seem to rotate through a different soup every day.  All are tasty, if not very rich.\n\nI quickly noticed that this place has regulars.  I saw another guy there all three days in a row, ordering a big bowl of the soup of the day and a batch of dumplings.  The value of what you get for what you pay is beyond exemplary.  Please note:  It's cash only.  The place is a little run-down.  And if you wait too long to go to lunch, the small dining room will fill up.  It's just two employees... a waitress and a chef.  They're very quick.\n\nI dare you to try it and not go back.", "author": "Walter P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "My husband and I were looking for highly rated Chinese food near Chinatown in SF. This place was listed as mom and pop with great food. They get 5 stars. The pot stickers were the best I've ever had and I lived in South Korea for a year where it was a staple. My husband and I shared the General Tso's chicken which had the perfect amount of batter and flavor. Excellent food overall. The egg rolls were only so so and not worth the calories. Get some dumplings instead. Loves this place!", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Solid Chinese hole in the wall place at the outer edge of Chinatown. Had the Kung Pao Chicken, and my companion had the chicken with cashews. Both dishes were great, but I would give the edge to chicken and cashews. The fried dumplings were also delicious. I would definitely come here again.", "author": "Jack M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-20", "description": "I can't believe how good this place actually was.  For only $7.50, I was given General Tso's Chicken, Egg Drop Soup, Tea and Thai Iced Tea.  \n\nNow, as for the taste and quality, I am again astounded.  Especially at such a low price, I walked out from this restaurant full and feeling like I had just robbed them a little.\n\nI was sure to tell their chef it was the best General Tso's chicken I'd ever had.", "author": "Antonio A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "This place is really good from what I have had. I have only been there once and all I got was general tso's chicken. In my opinion, if you mess up on this dish the rest is probably bad. Lucky for me that was not the case. The chicken was extremely crunchy. It was like fried chicken from popeyes crispy but with amazing tender white meat on the inside. My waitress was an extremely sweet asian lady that was very attentive. The food came out really fast and I did not feel like I was being rushed out of the place. She only came over when I looked at her and when my water was getting low. When it came to payment I didn't realize that it was a cash only place. There was a ATM machine around the corner and she trusted me enough to come back and pay my bill which I immediately did. This is a really nice casual place to come for chinese american food. I like the fact that they don't put a ton of sugar in their dish that usually come with a cup of sweetness. The people seem nice and whenever I am back in town I will come here again. Just wish they had a debit/credit card option.", "author": "Billy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-16", "description": "My Chinese husband hated the food because he was looking for authentic Chinese food.  Very Americanized Chinese food.  I honestly didn't dislike the taste.  But all of 6 dishes we ordered look so similar and the sauce tasted the same.  They gave so much rice and too little main.  More than 2/3 rice and less than 1/3 main.  So many vegetables and few pieces of meat/fish.", "author": "Chieko A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Yan's Kitchen is probably the most underrated Chinese place in the city. Its unassuming facade and off-Chinatown location probably make this restaurant an easy miss for most people. We are so glad we found it coz boy, were we pleasantly surprised how good the food were. \n\nI ordered the ever-popular General Tso's Chicken with vegetarian spring rolls and white rice - while the hubster ordered Pepper Salt Fish with chicken spring rolls and white rice. Though the dishes  may sound standard (in Chinese restaurants) - we think they were wayyy above average. The batter on the chicken was light and very crispy - it didn't taste overly oily. The batter was also pretty thin - so batter didn't overpower the meat. The sauce was a good balance between sweet and sour, and wasn't too thick. The Pepper Salt Fish also had light and crispy batter with the right amount of saltiness.\n\nThe hubster was impressed with the spring rolls too :D. It was crispy and fresh from the fryer. All that food and we spent less than $20! Great food at great prices - that is such a rare thing to stumble upon in this super expensive city!\n\nYan's Kitchen has won our hearts and we're definitely gonna come back soon. The owners are very friendly - a great plus. I'm always a sucker for family-run businesses with great food - they put a big smile to my face :D.", "author": "Priscillia I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Best fried dumplings I've ever had, no question. The general tso's was indescribable. Fluffy breading and great sauce. Some of the best Chinese I've ever had!", "author": "Jacob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "After walking through Chinatown and seeing all the horrible 2 and 3 star reviews of chinese food inlcuding one of a COCKROACH, we finally found this place. \nThe lunch crowd had passed and it was just us Yan and the wife. \nWe ordered fried dumplings, which were crispy, delicious and very flavorful with pork and a few vegetables.\nThe orange chicken was fried but had an actual orange rind taste, not the fake orange lotion flavor that most orange chicken has. White rice was plain and worked perfectly with the orange sauce that the fried chicken pieces were doused in.\nI got the thick noodles with chicken and they were sooo light and robust with flavor.\nWalk the extra mile uphill and downhill to this place !", "author": "Isabel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-24", "description": "Food was good, along with the service, but the building was a wee bit nasty. Looking to have not been cleaned for a while. \nGood Chinese place.", "author": "Ethan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Excellent place to relish Chinese cuisine, esp. the friendly couple draws me back to the restaurant. Great food. All items are freshely made instantly by the husband and the wife servers it. Must visit place. Not a great physical ambience but mentally great and awesome food negates everything", "author": "Pradeep R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Cheap, authentic and scrumpsh. Had the Kung pao and general tso. Both were among the best I've ever had, without being overly saturated with fried goodness or sweet and sour sauce. More chicken, less fat and filler. \n\nFyi, it's cash only", "author": "Jonah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "If you're looking for awesome, authentic Chinese food - this is the way to go. Yan's is run by a Chinese couple, and they really know stuff about food.\n\nLunch specials are the way to go - they include a choice of 2 spring rolls or dumplings, as well as a generous portion of food. I'm a big fan of the tofu and eggplant special (awesome for vegetarians), and often times they even let you get the cheaper lunch specials for dinner.\n\nIf you're going for lunch, try to get there before noon - it starts to really fill up and gets a ton of to-go orders, so try to beat the rush. But even if you can't, just put your order in and kill some time: it's totally worth the wait.\n\nI know I mentioned the authenticity of the place, but it also has the more American-y favorites. So you can get whatever you like.", "author": "Amaresh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "I'd come back. \n\nSmall hole in the wall.  Came here on a weekday at 5 and had no problem getting a seat.  Ordered Kung pao chicken, and it was only $6.25!!  With rice!!\n\nAnd it wasn't some crap-ola either, nuh uh!  This was some solid Kung pao chicken.  Large portion too.  \n\nThe service is slow but there are only two people who own / work there, and they are both very nice.  I was in hurry so I ordered at counter and paid there, but if you're not there is table service.  Food came out hella quick though.\n\nI am full and my wallet is happy.", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "This is 100 times better than House of Nanking. Sure the place doesn't look too glamorous but the dishes speak for themselves. The couple that runs the place is friendly and efficient. I absolutely love their Sweet and Sour Pork.  One day I decided to order Sweet and Sour Chicken.  The nice lady who was serving me suggested that I order the General Tso Chicken instead because it has a little spicy kick to it.  How did she know that I enjoy spicy dishes? Hmmmm.... thankfully I listened to her recommendation because the General Tso chicken was delicious!\n\nTheir fried rice has just the right amount of grease. It's almost like they read my mind! They use a lot if sauce on the dish so I started asking for less sauce, for which they were happy to oblige. The best part? They cook to order! I'm a super fan!", "author": "Shirleyanne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-01", "description": "We were looking for a good small place to eat in Chinatown and found this place through Yelp. Don't let the appearance fool you. The mandarin beef and egg flower soup was delicious. I would definitely return to try other dishes.", "author": "Johanna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "A little hole in the wall type restaurant. I love the charm of this place, the decor is so out of date but cozy!\n\nThe food is amazing and the prices are even better!\n\nWe ordered the wontons with onion and cream cheese for starters, very crisp and tasty.\n\nMy husband ordered the General Tsao chicken and said it was crispy and the sauce was great. I ordered the salt and pepper chicken which has no sauce but the batter they use on the chicken is so tasty! \n\nI can't wait for our next trip downtown, we will be eating there again for sure!", "author": "Don And Peggy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "This place was delicious! We had Mongolian beef and general tso chicken fried dumplings and spring rolls. Everyone was pleased portions are large enough to share. Service was good the waitress was super sweet. Cash only. Would definitely be back!!", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "I'm sitting at home in Vancouver, looking at the prices of the eateries here and cursing myself for not moving to California.\n\nIt's cheap, delicious, filling, and the couple that runs this place is adorable. I've only been there once but I'll definitely be visiting again the next time I'm in San Francisco.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "So this is the first 5-star review that we've passed out since arriving in the city 6 months ago.  Everything we ordered was delicious and you can't beat the prices!  Just  a heads up, cash only.\n\nWe got the potstickers and soup to start, both were good.  Then for dinner we had the curry fried rice (awesome) and general tso's.  Nicole loved the chicken because it was real, not that brown tendon filled stuff you find at so many Chinese places.  \n\nFamily owned & you can tell.  If you're looking for a good meal and amazing value, look no further!", "author": "Nick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "4 stars for the food! The general tso chicken was the best I've had. Great price and large portions. Not the cleanest of places if you're looking for something nicer, but if you want quick and great Chinese food in the area, this place is for you.", "author": "Carla V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "I've only ordered their combo specials (1 entree + rice + dumplings), so my review is limited to that. I've been here twice, and ordered the general tso's chicken combo, and orange chicken combo. It's the exact cooking method, but just different flavoring at the end. \n\nTheir combo is pretty cheap, about $7.50, and you get a decent amount of food for that price. The thing that makes this place awesome though is just how perfect the crisp is on their fried meats and dumplings. I've don't think I've ever had truly authentic Hunan food before, so I can't really attribute the goodness of this place to authenticity. However, whatever this is, it's good. It kind of reminds me of Panda Express, except it's the right flavor and the perfect texture of deep fried chinese food. It's crispy, but not too crispy, making a very delicate and perfected bite. I don't really know how else to describe it hahahaha. Anyway, try this place out if you're ever nearby.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "Had the kung pao chicken. They cook it up fresh on the spot  when you order. Right in the wok. It is very nice and hot when they give it to you. I like a substantial amount of peanuts in my kung pao. This place has it down! Loved  the crunch of the peanuts. Good amount of chicken. Veggies were tasty. I loved the heat on the dish!!!!! Nice and spicy. Where i come from everything is too bland. I travel here for work and will be back many times! I will pass it on to the co workers! The owners were smiles and very pleasant.", "author": "M P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "This place is fantastic. It's owned and run by a Chinese couple; the husband cooked and the wife managed the floor. Authentic and delicious! Will definitely eat here again", "author": "Christine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "This is the very last mom and pop shop you see in the city! Great price and great food. The general chicken is off the hook!", "author": "Will W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "Came in late, about 15 minutes before closing time, and the lady was very welcoming. She actually took another table after us. Anyways, we ordered from the dinner special menu: general tso and beef with garlic ginger sauce. The price did not match the quality of the food at all. The food was DELICIOUS and it was very filling, and it was about 7$ per order. I definitely think I'm going to be a regular here!!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-17", "description": "I arrived well after the late lunch rush and before the dinner crowd and was the only patron in the place.  The man who cooks who apparently owns and operates the place was taking a break at one of his tables in front of the diner, presumably reading the latest news from Hong Kong.  Since I was ordering to go, he motioned for me to grab a menu and let his wife know what I wanted.  No muss, no fuss, and no charades to seat me, tell me what the specials were, or anything.  Make up your mind a tell the lady.  Simple.  I liked that.\n\nI decided upon Beef with Garlic in Ginger Sauce, and requested it extra spicy.  The woman looked at me with an eyebrow cocked and a gaze that said, \"Do you know what you're asking for, white boy?\"  Indeed, I did.  So much so I mentioned it again.  She seemed ambivalent.  I also ordered a hot and sour soup, made extra hot as well.  \n\nI paid for my food (cash only!) and the gentleman put down his paper and went to work.  I took a seat opposite the beverage refrigerator and listened to sound of sizzle, stir-frying, and steaming.  In about five minutes, she kindly announced, \"Ready!\" \n\nI traipsed back to my hotel and dove in.  The soup was fresh and light.  No overpowering saltiness, and veggies and tofu and egg ribbons abounded.  Good stuff.  I am a tough sell on hot and sour soup.  I give it a 6/10- above average.\n\nThe entree, which I ordered without rice, was hot and clearly freshly cooked.  It also contained huge broccoli florets, which I was not expecting but enjoyed thoroughly.  They were cooked to absolute perfection, that harmonious blend of crisp yet tender.  The beef was flavorful and thoroughly coated with diced garlic and ginger.  Red pepper flakes, too.  The sauce could have been a little more gingery-spicy but it was good without being too thick and goopy.  \n\nThe spiciness?  This was a zero-napkin dish.  I know the chef must have added extra red pepper for me, but it simply didn't register any heat.  Some places make their food so fiery that my brow creates it own precipitation.  Not today.  No napkins needed to soak up the sweatstorm I was expecting.  Try again, Yan's.  \n\nDespite the lack of heat, I would give the dish a 6/10 as well.  I would come back, but I will know to add my own liquid fire.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Very simple, fresh, cheap Chinese food. Run by   a nice Chinese couple. You can see the chef cooking. I loved the ginger fish.", "author": "Eve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "The BEST Chinese food I have EVER had! A husband and wife own it and they are the only ones who work there. So sweet and adorable. General Tso's chicken is a MUST. The veggie spring rolls are a MUST and so is the chow mein! Everything is a must!", "author": "Katharine O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Hole in the wall mom n' pop.  Great food, had the special with hunan beef and general tso.  Not a super clean ambiance. So I was nervous, but it's very yummy.", "author": "B J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-02", "description": "Great little hole-in-the-wall place that was cheap, filling and satisfying.  A mom and pop shop that does standard Chinese fare with fresh ingredients.  \n\nOnce the lunch crowd left, the dynamic duo started teasing each other a bit in Chinese and laughing.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "So good and super cheap. I've had the orange chicken and general tso's chicken. Good portions. Fried dumplings are amazing", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Stumbled upon this gem while taking friends to dinner. A sweet older couple took our order and cooked our food. The service wasn't 'fast' but we weren't in a hurry and the reasonable wait was worth it because the food was delicious and fresh. The portions were perfect to share and the prices were great. If you're into fancy places and waiters checking on you every two minutes this isn't for you. We appreciated the mom and pop feel and the simple yet delicious food. Will definitely come back :)", "author": "Laura G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-05", "description": "It was a moment of weakness for me. After months from home and my mother's cooking without so much as a plate of rice, I was craving Chinese food, even the stereotypical American-tourist kind. I saw the reviews on Yelp and decided to go to Yan's but this is the first time the food didn't match up to the reviews. I got the orange chicken, and maybe that was my first mistake. It barely tasted the chicken beyond all the batter and whatnot they put on it. The sauce was too sour and didn't go well with the pepper. Sure, it was filling, but it just made me miss home more.", "author": "Sophie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Very good hole in the wall place with very cheap prices, especially for San Francisco.", "author": "Brutus G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "A late quiet dinner, ordered the eggs beef over rice.  Not bad at all and escaped under $7.00.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-04", "description": "I try to write down something good here, while I have no idea how to describe what I ate here. It wasn't busy, but my friend and me were waiting for over half an hour. I ordered the Mongolian beef, it tasted like soy sauce beef. (I think I could cook it better than the chef) I have no idea why the restaurant have 4 stars. It is super incredible. Even if returning my money back, I won't come back again. The first time is my last time.", "author": "Shilong Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "Food was fresh and very tasty. Not a 5 but good enough for that 4 star life.\n\nRunning beans in XO sauce was my favorite!", "author": "Gary M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-25", "description": "We went here because we're Jews on Christmas looking for a Chinese place and this one had good Yelp! reviews.  \n\nWe were seated quickly on walking in, but then sat at a filthy table with the last party's dirty dishes for a good 15 minutes.  The lady came and ***spilled some of the water from the dirty glasses on the table and then used that to wipe the table top WITH THE LAST PARTY'S USED NAPKINS!****\n\nWe should have gotten up and left, but we were hungry and had just made a trip from the East Bay.  So we waited...and waited...and finally ordered 15 minutes later.  And then we waited...and waited...and waited...and a half hour later finally the first dish arrived.  (With me so far?  Almost an hour from sitting to getting our food?)  About 20 minutes after that, the last member of our party was served his sauteed eggplant in broccoli...BUT THEY FORGOT THE EGGPLANT!  By the time he was settled, the the first dish (mine, which I hadn't eaten while waiting for my friend to be served) had gotten cold.  \n\nBy the way, they had RUN OUT OF TOFU *and* brown rice!  A Chinese restaurant out of tofu!  \n\nThe food was decent, but forgettable.  I swear the Hoisin sauce comes out of a Sisco bottle.  The sauce on the General Tso's Chicken was very nice; a bit different from what I get in most Chinese restaurants.\n\n(I might mention that during this, I saw a few parties come in, sit down, wait for service, not get any, get up, and leave.)\n\nAnd then we waited 20 minutes for the check.  At that point we were calculating it ourselves and we were just going to leave money and walk out when she finally screamed out the total at us.  We paid, tipping the one waiter who at least apologized to us and acknowledged the poor service, and left.\n\n...and won't be back.  Sorry, but you can't run a restaurant with three employees in the entire building.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-14", "description": "The food is tasty but I wouldn't say amazing.\nThe prices are great though ($7) and for lunch you get two great dumplings as a starter.\nI tried the general Tso chicken, the sauce is nice but the meat was not that great", "author": "Sophie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-06", "description": "Food: 3\nDecor: 2\nService: 4\n\nCame here for dinner on a weeknight.\n\n1. Chicken, mongolian style, 6\n~Okay. Chicken and veggies were cooked well, although there was too much onion. The ginger was chopped up very finely, so it's pretty strong.\n\nService was friendly. It's a mom and pop restaurant.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "I am so happy we \"stumbled\" across this place! The owners/cooks are so sweet and the food was spectacular. I would say that it is Americanized Chinese food, however, it's the best Americanized Chinese food!  Try the garlic ginger chicken! So flavorful and the vegetables were so fresh! I will be back next time I'm in town!", "author": "Dee H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-06", "description": "After seeing so many positive reviews about this place, I thought it would be an awesome spot to go later in the evening (especially since most of the other Chinese restaurants in that area were closed).  This place seems like it would be more of a hot lunch spot than a dinner spot, with more of a \"diner\" feel to it.  My friend and I arrived there probably 45 minutes before closing time, and got our food pretty fast.  I was pretty disappointed with the General Tso's, the coating was burned and the flavor overpowered the sauce, which seemed decent.  The fried rice wasn't anything to go crazy over, though I thought the Egg Foo Yung was fine.  Everything seemed significantly more salty than what I'm used to, even at the most shopping-mall quality Chinese stands.  \n\nIt could have been because we came in around closing time that the quality of food wasn't up to the reviews here, but I don't think I would risk it by going back and rather just try to think about dinner sooner than I did and go somewhere more renowned for their dinner menu.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "We were in town showing my grandma(visiting from overseas) the city. She got hungry and wanted chinese food, so being in a neighborhood full of restaurants I decided to park and look for something good. We parked in the underground lot close to Pacific & Columbus. While we unloaded her wheelchair from the car I quickly Yelped \"chinese food\" in the area I was in and Yan's was the first one on the list with a good review. \n\nIm giving 3/5 stars because the food itself was alright and the restaurant was a little dirty when we went.  There are only 2 people that run this place, its hard to serve customers, clean, and cook at the same time. The place is run by Mr & Mrs Yan. A husband and wife team that were very nice and accommodating. Their customer service is excellent and they answered every question we had with a big smile on their faces. We ordered mongolian chicken, kung pao chicken, salt & pepper fish, and a few orders of chicken fried rice. Food was cooked fresh and came out fast. Everything was cooked properly and tasted good except for the sauce they use on the Mongolian and kung Pao. It tasted a little to salty for me. I don't usually eat much salt so that could be the reason why, but ive been to many other chinese restaurants and their food was never as salty. For some reason despite it being a little too salty for me, I couldnt put the fork down. Its not the best chinese food ive had but still good enough for me to keep eating it (weird right??) The salt & pepper fish was good and the chicken fried rice was VERY good. This is a good place to grab a quick inexpensive bite and I think I might give it another shot to see if the food got better. 3 out of 5 stars for great customer service, good fried rice and fish, and OKAY mongolian and kung pao chicken. The restaurant itself could have been a little cleaner.", "author": "Vince N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Phoenix Sesame Chicken is to die for!!! What a great dish!!! The side of steamed rice was awesome - hubby had curry beef and loved every bite!! Great little spot!!", "author": "Allison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "The best orange chicken I've ever had. Period. $6.95 for a huge plate of chicken and rice along with two dumplings. Would recommend 100%. Came here for lunch & I would come back for dinner!", "author": "Alayne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Such a good little Chinese Restaraunt... I did not expect such great food to come from here and amazing service!", "author": "Bret R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "Great lunch special served until 3:00. Soup, appetizer and a huge selection of entrees all for under $7!\nGood food, nothing earth shattering but it comes with a smile. Got to love that.", "author": "Jim U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Food was amazing! We got the wontons, fried rice and the #19. Would definitely recommend! It is just a little hole in the wall restaurant, and it must have just been the husband and wife that owned it working - they were both so kind the entire time! Even when we had To go find an ATM since it was cash only. Would definitely come back!", "author": "Steven S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-23", "description": "Meh. Meh is the best I can give Yan's kitchen. I went there for lunch today, 9/23/15, and while there was nothing about my experience that would qualify as unpleasant, neither was there anything that would qualify as pleasant. The place is dirty, the tables for two were crowded and a little dirty, the portion size was so-so and my general Tso's chicken was unremarkable as were my lunch combo spring rolls. The service was slow, and we had to take the initiative to order and pay.\n\nI would only recommend Yans if you were in a hurry for lunch and didn't want move from your spot more than like, 40 feet.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Great solid hole in the wall.  Got a ton of food for a great price.  Be aware that they only take cash.  I got the meat mix in Mongolian sauce.  A tad spicy and very flavorful.  It came with white rice and 2 steamed pork dumplings that are simply amazing.  I'd eat here numerous times if I were in the Bay Area more.", "author": "Jared M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Amazing traditional Chinese food great prices a must try! Next time I'm back in sf I will.be here!!", "author": "stephani l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-24", "description": "Pretty great food and serving size. Great prices. \nThe shop was mostly full and jolly, but the interiors leave something to be desired.\n\nAnd no duck on the menu!! Where is my duck??", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-02", "description": "The lunch special is the only thing I have ever tried.  It was $7 even, and it included soup, egg rolls, rice and the entree, as well as hot tea.  It was a decent meal for $7.  I have no idea how the regular food is there but would recommend this place for cheap Chinese food.\n\nI had the orange chicken.  The outside was crunchy and the inside tender and juicy.  Rice was good. There was plenty of the food, as I couldn't eat it all.", "author": "Ola P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "I've likely been here at least 7 to 10 times. They never fail to impress me with their quality, quantity, and price. \n\nThe atmosphere is relaxed and quiet, and the service is timely and warm. \n\nOthers have mentioned it, but so will I - this place has the best General Tso's chicken you'll ever have. The flavor is perfect, the outside is light and crispy without being soggy from the sauce, and the inside is perfectly cooked. Never chewy, so jt basically melts in your mouth.\n\nThe Hunan beef is similarly well cooked and soft and tender.\n\nThe pot stickers are probably what you'd expect. It's very hard to mess them up, so they naturally have them done properly here.\n\nThe biggest draw really is the price. You get a full meal you may not even finish, done very well, and it'll probably amount up to half he price you'd pay most anywhere else. \n\nCome and treat yourself. Beware, it is CASH ONLY.", "author": "Mihail D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "Currently, the best Chinese food we've found in SF!!\n\nThey are 'famous' for their General Tso's Chicken, which is what I always get. My wife gets the hunan beef which is also really good.\n\nBesides the food being great, the old couple that runs it are wonderful too! You can tell they take pride in their food and what you to have a good experience!", "author": "Rob F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-25", "description": "While the food here is extremely cheap ($6-$7 for entrees), I'm quite disappointed in a restaurant that takes after my last name. \n\nMy friend and I ordered the Kung Pao Chicken special (we ordered it with a side of Shanghai Dumplings). The Shanghai Dumplings came out first - they were very course, comparable to what you'd find in low quality package from the frozen section in a Chinese supermarket. The dumplings came out cold, the dumpling wrapping was way too thick, the pork stuffing was sub-par, and there was no need for a spoon since all the juice already spilled before the dumplings were touched.\n\nIn addition to the Kung Pao Chicken, we ordered a Bok Choi / Mushroom dish, and the Sliced Fish in Garlic Ginger Sauce (chinese name \"Yu Xian Yu\"). Overall the dishes all tasted fairly similar (consistently soy sauce flavor) and overly greasy.\n\nCommunication was not much of an issue with the waitress because my friend and I speak Chinese. I also noticed that my chopsticks were a tad sticky before I used it so I asked for another pair and that one was equally sticky (so I just sucked it up and wiped it down).\n\nOverall I was quite unimpressed with this place that is rated 4 solid stars, but my hunch is that people are swayed by the cheap price. Granted I paid $18 bucks (split the 3 dishes with my friend), and had plenty of leftovers for another 1.5 meals. But if you're going for quality Chinese food, this isn't the place.", "author": "Heather Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-05", "description": "Came here with friends for dinner last night after the line at nearby R & G lounge was too long. I really wanted this to be a hole in the wall that I could say has really good food but... It just wasn't. Based off of raving yelp reviews about the General Tso chicken, we ordered it and it was very good -- flavorful and crisp. However our other dish was Beef and Bok Choy and the beef was nowhere near edible! It was so chewy I had to keep questioning if it was beef or not... Sadly probably the worst beef dish I've had. I love mom and pop places so it made me happy to see they had a good flow of customers, but given how many other Chinese restaurants are in the area I probably won't be back.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "REALLY good. I always judge Chinese food by two main factors: 1) quality of the meat and 2) quality of the sauce (doesn't break, favorful, etc). This place hits on place and it's inexpensive. Would highly recommend.", "author": "Ian P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-13", "description": "For having such good reviews, I expected more. The chicken I ordered (orange?) was extremely greasy. My friend who went with me had an upset stomach for a few hours afterward. Needless to say, I will continue my search for fabulous Chinese food elsewhere.", "author": "Karen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "Oooohhhh Weeeee....YAN REALLY CAN COOK! I had the chicken & shrimp soup...DA BOMB! Orange chicken was crispy on the outside, tender & juicy inside. Mmmm Mmmm! Combo fried rice was perfectly fresh & delicious. Mongolian beef was tender & tasty. BRAVO!", "author": "Antoinette H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "Currently having the mongolian beef and veggie fried rice - AMAZING! \n\nBursting with flavors!", "author": "Liza B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "Tried this place out because of the rating and reviews. The place is small, and the kitchen is visible like a small cafe. Ordered combo fried rice and Mongolian style shrimp, beef, and chicken. The food was ok, but it wasn't hot. I really wanted to rate higher because the owner was really nice. For a better dining experience, you are better off going to bigger restaurants near Jackson or Grant Streets.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "This is the place I go to for cheap, tasty, greasy Americanized Chinese food in my neighborhood. Cash only! I've had the General Tso's, the Orange Chicken and Salt and Pepper Chicken. Price is between $6-7 with big portions. All three are flavorful and cooked fresh, although quite a bit on the oily side. I also wish they included a different vegetable medley with the food. It always seems to be carrots, onions, bell peppers and jalapenos. The dishes need some broccoli or mustard greens to cut through the oil. What else...their pot stickers are really great -- big, pan fried to perfection, and stuffed full of pork and veggies. \n\nThe restaurant itself is a bit on the dingy side so I always get takeout. It's possible that this place serves some authentic food as well, since I often see large groups of Chinese folks ordering family style dishes and jabbering away in Cantonese. I've never tried to order anything besides those Chinese fast food staples, so I can't say for sure. The couple that run this place are nice folks. I keep coming back!", "author": "Jasper P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-17", "description": "The food wasn't too bad. However, there is only two people working there one cook and the lady that helps cooking and serving so the wait was quite a bit. It took about 45 minutes to get my appetizer and another 30 minutes to get my food which was about an hour and 15 minutes total wait. Don't know if I'll go back there again but if you don't mind waiting in an I'm not in a rush Then the food isn't too bad for what you pay for cash only", "author": "Bryan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Stopped in on a random Tuesday. The place was fairly occupied, but we found a table immediately. We knew we wanted to try the General Tsao's Chicken since everybody posted about it through Yelp. So with an order of chicken fried rice, our meal was fantastic! The chicken was prepared with jalapeños which you don't really see but still good with carrots and bel peppers. The chicken was nice and crunchy on the outside and tender in the center. Definitely going to be back again!", "author": "Jessie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Excellent! Love this place. Thank goodness for Yelp, otherwise I don't know that we would have come here. Great little hole in the wall with excellent food. My wife said best General Tsos she's ever had. And they have General Tsos shrimp too! That's what I had and it was really good. And I like the genuine character of the place.", "author": "Craig W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Amazing food! Short walk from Chinatown and cash only. Definitely recommend if you're in the mood for chinese food in San Fran.", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Very delicious authentic Chinese food at great prices! Family owned and authentic. Worth the stop and prices were great!", "author": "Doug W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "My boyfriend and I were craving Chinese food, and found this gem. The owners are so sweet, and the food was great.", "author": "Tran L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Picky eater approved. I had the Cashew Chicken, no veggies. It took a little while, but it was cooked to order! Looking forward to another visit.", "author": "Holly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "In SF for the week looking for great Chinese and found this place on Yelp.  Awesome food with great flavor (had Hunan beef and potstickers), cheap ($7-$9 entrees), and good service (owner Mei was very nice and talked to me for a bit).  Basic but clean interior.  Definitely my new Chinese go-to for SF!", "author": "Mark H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "The couple that runs the store is very nice. The wife talked to us while we waited for our take-out. They were very welcoming to a tourist couple that haven't been to San Francisco before. They prepared the food quickly and the prices are more than fair. It was cool to walk out and have them smile and exchange thank-you's with us. Would definitely frequent this place if I were to commonly be in the area.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "This place was bad! Granted, it was Christmas Day but it wasn't that busy yet we waited more than one hour! I am not lying, more than one hour! When the food came was so subpar compared to just about any other Chinese restaurant in the city except for panda express that it is something my wife said I had to let people know about. The rice was OK and we can't give less than one star so I'll give them one star for the rice. 1970s I'm beyond, and restaurant owners seem to be just sleepy that day, the young kid that was helping was pretty confused, and that place is a place that needs to be repurposed for something else or taken over by someone else.", "author": "Tim H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-02", "description": "Oh my god, this was just bad all around.  Is it better during lunch?  We came for dinner... not my preference but the person I was with was craving \"Americanized\" chinese food. Our usual place, Tai Chi on Polk, was closed.  Yan's was close by and had good reviews - couldn't hurt, right?\n\nWe ordered the dinner combos that came with soup, egg roll, 2 entrees, rice. Soup was hot and sour soup, nothing special but nothing horrible.  Not much flavor so I covered it with white pepper. From there, it was all down hill. \n\nLet's discuss the egg rolls. They were practically brown and no, that doesn't mean they were overfried, it means they were fried in non-fresh oil.  Like oil that's been sitting around all day, possibly multiple days.  Filling was meh.  But I love my sweet and sour sauce poured all over my egg rolls so I figured I'd drown the dark brown skin of the egg roll in sauce.  We asked for sauce which came in a red ketchup bottle.  As soon as I poured out the sauce all over my egg roll, I instantly regretted my enthusiasm.  It was HOT PINK. Like highlighter pink.  It was disgusting.  No wonder it was in some red ketchup bottle.  We were both horrified.  What was this Red No. 3 + sugar, lemon juice, and corn starch?  Come on, it's not that hard to make your own sweet and sour sauce.\n\nThen came the food.  Ugh, it tasted like old grease.  We ordered the general tsao's chicken and I think Mongolian chicken? I don't remember but it was completely not memorable.  The General Tso's chicken had meat chunks that consisted of 75% batter, 25% dry crappy meat.  And remember that \"non-fresh oil\" I discussed above?  That was obviously used to deep fry all the meat chunks so everything just tasted like bad grease.  I had to stop after a few bites.  Usually, I love drowning my rice in whatever sticky sauce the food comes in.  Couldn't do that either. Why? The rice was day old and also really bad.\n\nYelp, I'm disappointed in your judgment.  I contemplated trying it again for lunch but frankly, that highlighter pink sauce was a HUGE turn-off.  Never coming back. Ever.", "author": "Joanne L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-06", "description": "This is not a hidden gem - this place is simply one grease fire away from putting a dirty, and decrepit throwback from years ago out of its misery. I came for lunch and sat down at a half-eaten termite table that was wedged into the corner where one of the chairs was obstructed by some pipe. The menus prices were \"updated\" with some illegible scribbled over numbers in crayon. \n\nSo I went with something very simple - beef noodle soup and pot stickers. What arrived at the table was this bowl of chef boyardee-like noodles heated up with some sort of canned carrots and peas. Forget the canned part, what beef noodle soup place do you know services this bowl with carrots and peas? The beef was unbearable. It was near inedible - chewy...and not the tender chewy but more like the chewy that relates to meat that has been associated with the side of a carcass and frozen for decades, only to finally be thawed when an unsuspecting customer who finds a \"hidden gem\" four-star yelp review enters their establishment for the first time. \n\nOh, the pot stickers were sub-par but would not have been so bad if there were not fried over 3 times with gritty bits of cancer causing agents from the old pots.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "If you're looking for good quality chicken, meats, chow mien, and all food Asian and Hunan, come here. Really delicious food. Not too much sauce and not too little. Perfect amounts of everything. We came in with 4 guys and finished everything down to the last vegetables. Highly recommend. It's one of those small hole in a wall places you only find rarely.", "author": "Serge T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "I like to stop by this place on my way home from work when I am feeling Chinese. It's a small mom and pop restaurant owned by a cute old Asian couple that is always extremely nice. Overall this place serves pretty good Chinese food at super cheap prices. Think $6 entrees that include rice!\n\nThe things I usually get here are the hot and sour soup and the ma po tofu. Both are delicious! I have also tried the wonton soup, Mongolian beef, and fried fish that are good as well, but not my favorites. \n\nOne dish to avoid though is the shanghainese dumplings. They were dry, the skin was thick, and there was no soup inside. \n\nWhen dining in, the service can be pretty slow at times if they're busy. However, I can tell they are trying to serve people as quickly as they can but it's hard when it's just the two of them running the whole place.", "author": "Pamela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "the BEST genera' tso I have ever had, hands down. Crunchy and amazing sauce! The rest wasn't too bad either- the family dinner meal was only 10 for each person and we had enough for another meal later. AMAZING place, so glad we looked it up on Yelp and went!", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-28", "description": "The taste was predictable, fried rice tastes like fried rice, bbq pork tastes like bbq pork.\nNo complain here.\nFood was priced per Lbs.\nThe waiter could improve her listening skills, but everything else is ok.", "author": "Samuel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "Excellent food, great value, filling portions.  We had the Hunan Chicken and it was not only delicious, it also got my Chinese girlfriend's stamp of authenticity:  she said it tasted like home cooking.  A lot of the menu did seem to cater to western tastes, but I'm sure it all tastes great, and if you are that worried about \"authenticity\" buy a plane ticket.  The fried rice was so good we ordered a second plate even though we were full.  It has a hole in the wall intimate feel.  It seems like a family operation and the service gets a 3.5 out of 5, but the food and atmosphere more than compensate.  In summation, eat here!!!  You will not be disappointed.", "author": "Bob H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "We love this place, they have become like family to us. Food is fantastic.\nI order orange chicken and fried rice, best I ever had.  Please come reopen in Texas lol", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Yan's did not disappoint. The food was fresh and delicious. The restaurant is small and old but the service and food makes up for that. If you want the best Orange Chicken you have to try Yan's.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "If you like \"whole in the wall\" places, this is the place for you.  Food was good, service was great.  The reason for the three stars is the cleanliness of the restaurant.  Could use some scrubbing!", "author": "Andrea P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "I think the food is very good and fresh, but the ambience of one chef and the one woman running the front of the house is endearing. I believe it's husband and wife and they do a great job with the orders. Take your time eating and there may be a wait for the food. Bathrooms and dining area are weathered.", "author": "S H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Wonderful experience. Quaint little establishment with many food options. We ordered the sesame chicken and general tso chicken and both were delicious. Not like many other chinese restaurants where the breading is thick and coated with sauce. Here it was slightly crispy and delicious. Great service and even better food.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-12", "description": "I love Yan's Kitchen! and the sweetest hardworking couple that work there and own it. \n\nNot only do I order my own lunch there often, I also order dinner for 5-9 people 1-2 times a month from Yan's! I work right next door and they are always an affordable dinner option for some of our late work nights! The only time we don't order from them for work dinners is when we don't have cash! \n\nI've tried numerous dishes but my absolute favorite is the spicy garlic fish or, for that matter, the fish with any of the sauce choices! The fish is always lightly crispy and never over drenched with sauce.\nI also recommend the shrimp fried rice, eggplant, general tso's chicken and anything with their spicy garlic sauce!", "author": "A b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-14", "description": "Let me start off by saying we call this place Shticky... why.. because you stick to the table while you eat here.  That being said I LOVE this place.  I have been eating here for almost 3 years and I have never had a bad meal.  I recommend you try the Ginger Chicken and the General Tso's Chicken!  They are both heaven on your plate.  \n\nMake sure you start your meal with the pot stickers.  They are the best I have ever had.  This past Christmas I took 30 people from my office here and took over the place.  It was the best Shtickmas party ever!  Yan even wore a Santa hat for us.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "If you're looking for a fancy Chinese food place, this isn't it. This is a no frills, real mom-and-pop Chinese food eatery that's both affordable and delicious. The mom takes your order and the dad is the chef. Once you get your order, they don't really bother you and leave you to your meal. Again, no frills, just good food.", "author": "Ty L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "I am a traveller from NYC and I had numerous Chinese foods from all over the world including NYC. By far, Yan's general Tso's chicken is the best I had! It's crisp, flavorful and not greasy. I have to say awesome price, good ingredients and phenomenal taste. I don't necessarily believe that expensive establishments offer better food because you simply pay for good ingredients and other stuffs to make you feel like you are having a good meal. In other words if basic ingredients are good, then the food has to be good. I cant really tell if a chef has skill to impress if he/she is given top quality ingredients. My belief is that a good chef should be able to bring out good food even with limited resources. \n\nI know Yan's is not a place where you want to have a fancy date at. It's an establishment that is being run by a couple, who are extremely nice btw.\n\n Hell- a restaurant should have good food and food should be their focus not other stuffs. \n\nLike I said before Yan's do offer awesome taste, good quality and good price and do deserve five stars. I went to this place two days in a row and will be visiting tomorrow as well.", "author": "Peter J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "This place is a staple around here. Always delicious. Family owned and run. Cash only but you won't need much. Limited seating during lunch rush. Best to come during off times. Food comes out quick though. Gluttonously delicious. Don't let the humble looks fool you.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Best Chinese food I've ever had! Too bad we were just visiting and live in Southern California. :(", "author": "J P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Wow! I was a little hesitant to try this place, as I always am when it comes to trying new places, I'm sure glad I did, the food was delicious! !!", "author": "Frances C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "Good, cheap Chinese food. Right off the bat, I have to give minus 1 for only OK chow fun (my standard for all Chinese restaurants). However, let's move on to the good.\n\nCheap. Did I mention that already? Plus Tsing Tao. Quite possibly the best sesame beef I've ever had (order it--it is extremely light and crispy despite the heavy sauce... how do they do that?). We tried a few other dishes which were also ok, even if I can't really remember...\n\nThis is good, unpretentious Chinese food in a humble setting. Now if they could make their chow fun up to par, this could be a solid 5 for me.", "author": "Justin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "This is a mom and pop restaurant so consider that going in.  Just a couple whose owned the restaurant forever.  I am a native San Franciscan and the food is excellent.  A hidden gem indeed.  I personally love the mongolian pork.  Anything battered is really battered but good.  Nothing fancy if you're looking for that.  Just plain old good food.", "author": "Lily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "The food here was incredible! HIghly recommend. Only thing you should know is it is cash only. We went for lunch and loved everything.", "author": "Debbie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Great food, but pretty rough setting. The building had not been cleaned since the 60s. They only clean the tables from previous guest when a new guest arrives, which was a bit annoying. If you don't mind the \"hole in the wall\" theme and love great food, this is the place for you!", "author": "Ira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Fantastic hole in the wall. Dumplings then shrimp with bokchoy and black mushroom was great. Order a Tsingtao beer to go with. It's my new go to when I visit SF.", "author": "Bob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "In the absence of a personal chef to have a meal waiting for me when I stumble hangrily home from work, there is Yan's. I eat there about once a week. \n\nThe couple that work there, although they don't say much, are always there to greet me with a smile and a hot bowl of wonton soup. It's no-nonsense but quick, cheap and the brown rice is awesome - halfway between brown rice and wild rice. Oddly enough, I don't have a problem ordering a huge plate of veggies since everything is delicious and it makes me feel like I've made at least one positive nutritional decision in my hypoglycemic stupor.", "author": "Eli B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "I was pleasantly surprised with this place! I had never been to San Francisco. We realized we were on the edge of Chinatown and were wanting lunch so I searched best cheap food in Chinatown San Francisco and came up with this place. A party was coming out as we were going in and they asked if we had ever eaten there and when we said no they started going off about how it was the best food. They were right, it was fantastic. It is a hole in the wall, no thrills, restaurant with good portions and cheap prices. The three of us ate for $25. If you get the chance, check them out!", "author": "Nikki Lee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Yan's is great for those looking for decent meals at a great price. The lunch pricing at Yan's is unbeatable, especially in the financial district/Chinatown area. The solitary waitress and cook are a husband & wife team who have run the place for the past 15+ years. Don't expect frills - it's a hole in the wall diner experience. Expect sizable amounts of food at a great pricing, and Enjoy!", "author": "Michael T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-12", "description": "I really like these folks along with the others who happen to be in the area within a 2block radius.  generals chicken is great during the lunch hour w/an iced coffee\n\nive gotten the chance to try quite a few dishes as it's consistent.  hell i even got a burger and fries once, not their forte but still finished it of course\n\nhard to beat given the price you pay", "author": "Clark G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-05", "description": "Ummm my friends and I decided to come here for dinner as we saw pretty good reviews for this place. We had three different dishes and they were all terrible...which made me wonder who gave this place all the stars...\n\nEverything we had was really plain and tasteless. My friend had to put a lot of salt in her dish just to make it edible. Don't order any beef dishes. They taste like the vegetarian beef thing that you can find in a local store.\n\nThe staff was nice though.", "author": "Long H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Don't pass this place up because of the appearance.  Food is good, and very fresh! Very friendly staff.  Prices are affordable!", "author": "Cherise M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "This place is BOMB. Amazing General Zhao chicken. Super nice service. All around excellent.", "author": "Nate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Excellent Chinese food. I'm amazed that it is run by only 2 people but they are quick. The orange chicken was very good and it was extremely cheap. It is cash only.", "author": "Nick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "I had an absolutely fab lunch here - the eggplant dish was amazing. I def recommend.", "author": "Jill C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-20", "description": "Ate here yesterday based on Yelp recommendation. Definite \"Mom and Pop Shop\" feel. Food was ok / average. Location next to Transamerica and Hilton feels a little more like Financial District then Chinatown. Storefront and accommodations are a bit dated. Cash only - wouldn't take credit cards!", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "We went on the recommendation of other yelpers and were not disappointed. Don't expect to be waited on hand and foot, but if you are looking for a great cheap dive of a Chinese restaurant this place is perfect. There is one server and one cook, less than ten tables, and the food comes quick and hot. I had to remind myself mid meal that I should set my fork down and take a breather because I was eating so fast. We had the General Tso's Chicken and the Combination Fried Rice and both were phenomenal. Highly recommended and I will certainly return.", "author": "Drew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "Best kept secret in the city.  Fresh food, great prices and a very nice couple runs the place.\n\nThe garlic ginger chicken is my favorite, but everything I've had there is good.", "author": "Gary F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-16", "description": "This place did not live up to the 4 star reviews. Ordered egg rolls and got spring rolls that seemed like they were bought at Costco. Wonton Soup is chicken soup with bad wontons in it. Kung Pau chicken had good flavor but not enough sauce and didn't come with white rice. They charged me extra when I asked. Steamed dumplings lacked flavor and they have no thing but soy sauce to dip them in. Overall, I was expecting more.", "author": "Kristin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Delicious food, Yan is an amazing cook- all by himself in the kitchen with his wife doing the serving! The place may not look like much but dont let that fool you. Truly delicious!", "author": "Samba S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "We loved this place.   There food is not very expensive and really impressed with how good there food is.   You will leave here stuffed.  They weren't very busy but it was late   Service was great.  Nice when someone actually appreciates you coming to their restaurant.  If I lived here I'd never cook Chinese food again.", "author": "Joel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-05", "description": "Gets three stars for being cheap.  Dumplings had a REALLY rotten onion flavor, and the rest of the food was ok, but greasy.  Not terrible, but the location is nasty, which I can tolerate if the food is fantastic.   This was definitely not.", "author": "Custm R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "This place is AMAZING!!! Mom and Pop, home cooked chinese food for a very decent price (tip well, please. they deserve it!) Vegetables were sooo fresh, and I can't get enough of the salt and pepper fish. It's too good!! Thanks Mr and Mrs Yan :)", "author": "Babs J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-02", "description": "Whoever said Yan's Kitchen is \"authentic\" is wrong. So wrong! Yan's Kitchen is a hole in the wall type Chinese restaurant catered to tourists. How do I know? My boyfriend pointed out that there were no chopsticks on the table and only forks. What \"authentic\" Chinese restaurant doesn't have chopsticks?! That aside, the place is a stone's throw away from Chinatown and right under the beautiful TransAmerica Building. My boyfriend and I came here because we wanted something cheap and delicious and Yan's Kitchen gives you that! We both ordered the General Tso's Chicken Rice Plate on the Lunch Special Menu and it came with a choice of fried or steamed dumplings, eggrolls, or something else (sorry, I forgot!) It also came with a cup of cream corned soup which was delicious! The older lady, who I am assuming is the owner, was very sweet and always made sure our water glasses were constantly being refilled.\n\nGeneral Tso's Chicken with white rice - Honestly, this was the most amazing General Tso's Chicken I've ever had. It was PERFECTLY breaded and I was in awe at how every bite had a nice fluffy, yet crispy texture. The sweet yet spicy (not really) sauce was very good and they definitely did not skimp on the sauce! It was so good that I am salivating thinking about it.\n\nI can't tell you what the total was because my boyfriend paid, but I'm assuming it was under $20 and I think it's worth it to mention that Yan's Kitchen is cash only. Overall, I wouldn't hesitate to come back!", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "The atmosphere leaves a lot to be desired but the food is spot on. The have the best bbq pork fried rice I have ever had. A great take out place!", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Nothing fancy; quick and tasty chinese food.  This is the right place for it. For being a small cash only restaurant they have a good variety of plates. Prices are pretty cheap for the amount of food they offer, so that is definitely a plus. Go try this place. You won't regret it. Expect lines during lunch time.", "author": "H C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "$7 for two egg rolls and kung pao? So great on price and tasted even better than I would have expected. Family run, clean, lots of choices. Whats not to love? I would be here often if I lived nearby.", "author": "Greg L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "Awesome Hunan Chicken! I stay in SFO a lot and have eaten at many places around Chinatown and this is the best. Good food Cheap prices and the Yan's are very nice and friendly! I am an airline pilot and love to find good cheap places to eat while on the road. This is the place!", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Amazing food individually prepared while you wait and well worth it. A small, 9 tables, family restaurant, but some of the best Chinese food my wife and I have ever had. Unfortunately we could not talk them into relocating to Arizona so can only highly suggest for those who visit or live there do not miss out on this opportunity.", "author": "Gary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "The decor is a bit underwhelming, but don't let that steer you away. The service was friendly and efficient, bringing out plate after plate of food. We were a table of 8, and ordered the family style meal, which was soup, egg rolls and a nice variety of dishes. The spicy General Tso's chicken went super fast! Highly recommend this restaurant for takeout or for a quick bite to sit in.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "This place is incredible. Upon visiting San Fran, one of the things on my bucket list was to eat authentic Chinese food from Chinatown. This place did not disappoint! The prices are super cheap and you get very large portion sizes. The food is to die for! I loved having leftovers! It's a nice quiet place ran my an older couple or as like to call Ma and Pop shop! If you are ever looking for a great mean in Chinatown, check this place out!", "author": "Becky S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Very yummy. Lovely husband and wife running it. The chicken was delicious as was the soup but the beef was a bit gristly.", "author": "Mindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-20", "description": "Nice little hole in the wall Chinese dine in and take out. Only wife and husband running the place, service was definitely lacking. When I entered, dirty plates and dishes were all over the tables. I chose to sit at the bar table. Ordered eggplant with chicken and shrimp with ginger sauce. Eggplant dish was tasty but lacked color/balance. Shrimp dish was prepared a little too quickly as the onions were still quite raw. Ate my meal but was never given any water. Owners were quite nice and we talked for a bit but to please visitors, I think a bit of hired help would have done them a great deal. If not so messy I would come again.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-23", "description": "Just wanted to praise the other yelpers for their reviews on this spot. So my friends tend to put me in charge of coordinating things to do and places to eat. They once again said \"Alvin, find something to eat, and it better be good!\" We were out on broadway and a friend suggested New Sun Hong Kong, but I knew I could find something better. Then we came across this diamond in the rough.\n\nOnly several blocks from broadway and columbus, we came across Yan's kitchen, which even had the \"People on Yelp Love Us\" sticker, so I knew it was legit. All the dishes were awesomely priced. We got some wonton soup to warm us up. Then got some eggplant shrimp, mongolian beef, chicken chowfun, bbq pork fried rice and General Tso's chicken. All the dishes were awesome! Not too much of certain things, ie salty, oil, etc. Super yummy after a day of walking and drinking. We left with these words from my friend Hubert : \"That General Tso probably lost every battle, but they kept him in office because his chicken is just too amazing. Genghis Khan and his mongolian beef had better retreat if he squares off with the General!\"", "author": "Alvin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "I've had the Mongolian Vegetarian, the Mongolian Beef, and the Kung Pao Beef.  I've had the vegetarian eggrolls.  I've also had the white and brown rice   It's worth the wait.  This is fresh food.  You will love it.  Be patient and you will be rewarded.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Combo chow mien was delsih as was the sizzling soup. Came on Christmas not sure if that's why the service was bad...took awhile to pay bill and a couple tables were dirty upon entering. Otherwise good food!", "author": "Lannete E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "I was in the city and had an hour to kill during lunchtime and found Yan's Kitchen through Yelp.  The restaurant doesn't look like much, but the food is pretty solid (and very reasonably priced for SF).  I tried the General Tsao's Chicken and was tremendously impressed.  Fried, spicy, sweet goodness.  The meal came with soup (which wasn't terribly good), but I got out for under $10 bucks and was full and happy).", "author": "Mac P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "Orange chicken is like chicken candy. So crispy yet light and flavorful. Best orange chicken I've ever had! The appetizers were superb as well.", "author": "Amber R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-13", "description": "This place is literally a \"mom-and-pop.\" Although, I don't actually know if the couple has children. If they do, they're probably all over 250 pounds, having eaten like kings and queens their whole childhood.\n\nThe husband and wife that run Yan's complement each other well. The husband is an efficient maestro of the wok and the wife is the nicest front-of-the-house person you'll meet.\n\nNo matter how many times you go to Yan's, you'll never try all of the combinations on their lunch special menu. That said, you probably won't find too many that you dislike. A few recommendations:\n\nChicken / Cilantro Scallion\nChicken / Broccoli\nChicken / General's\nBeef / Mixed Vegetables\nPork / Salt & Pepper\nFish / Bok Choy\nVegetable / Egg\n\nYou know what, just bring some dice to pick your lunch. You really can't go wrong.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "Very divey buy good food. Had the chicken, calamari and shrimp on iron plate, combination egg full yung and pork fried rice with hot tea.  Total came to about $25 but there was enough to take home.", "author": "Joey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Ordered a take out of sweet&sour shrimp, not bad at all. The order was ready really fast, and it tastes good. The price is good too $7.45. Will come back most likely. I liked that it's open when most places are closed - between lunch and dinner times", "author": "Aleksandra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "So close to China town, while practically bordering the Financial District, this is little gem of a mom&pop Chinese restaurant. For my first visit I tried, on the recommendation of Yelper's, as well as the dish being my typical favorite, the General Tso's chicken.\nI ordered the rice plate, which was available with rice. Along with the complimentary hot and sour soup that was quite good, I thoroughly enjoyed my meal. \nThe chicken was sweet, a little tangy, with a small afterburn. So, for under $7 the serving was surprisingly large as well, always a pleasant surprise for trash disposal stomachs like mine.\n\nMy favorite thing about Yan's is that it's Americanized Chinese cuisine, which I genuinely like. While the authenticity of nearby China town is great, Yan's is the kind of food I grew up on. I'll be back. Maybe tomorrow. And the day after.", "author": "Muz H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "Loved this place! It isn't much to look at, but don't let that discourage you. The sizzling rice soup is some of the best that I have ever had and the dumplings where to die for. You should really give it a try.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "I have to say that Yan's is one of the best Cheap and quick Chinese food joints in the NorthBeach/Chinatown area. Trust me..... I tried enough to know. Every time I veer off and try another restaurant, I'm always disappointed and wish I just picked up Yan's. It's cheap, delicious, and the couple that own the place are very warm. I hope they don't go out of business anytime soon!", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-10", "description": "Kind of salty. Hella food and hella cheap. Sweetest old couple. Americanized Chinese food and the portions are Americanized too. Quick bite for cheap? This is the spot.", "author": "That Dad Life -."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "I ordered three potstickers and general tso's chicken. I waited 35 minutes in a non crowded restaurant and finally left without eating. No reason it should have taken so long. No long line. The place wasn't even busy. I finally left when I decided I had to meet friends. I will never return.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "Used to go here with my family as a kid back in the mid-90s, but haven't been in over 10 years. Finally decided to go back yesterday and the food is just as great as I remembered. I would get the lemon chicken as a kid so I wanted to remind myself how bomb it is. It still tastes like candy! The General Tsao Chicken is like butter with the perfect crunch. Also, all the food is cooked fresh to order.\n\nThough the decor is a little outdated the food is definitely worth. Ignore the 1 star reviews, this is the best chinese food I've ever had in my life!", "author": "James N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "Loved this hole in the wall place! Brought my Argentine in laws for an authentic Chinese experience and everyone was satisfied and impressed. Service was earnest but not very efficient. Tables were dirty and chaotic when we arrived but the food made up for it.", "author": "Tim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-03", "description": "Excellent General Tso's chicken. It was crispy and spicy and utterly delicious. This place was super clean and the owners were also very sweet and helpful. \n\nGreat for when you're in the mood for something less than healthy!", "author": "Rosie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Great prices, Fresh, tasty food. My favorite Chinese in the financial district", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-22", "description": "I was really in the mood for \"Chinese\" food (read: Americanized Chinese food).\n\nThe older couple who runs this place is really, really smart. And very nice, too.\n\nThe main dishes are standard Americanized Chinese fare done well at a wonderful price. The dumplings, however, retain their Chinese roots, and are a nice treat alongside a huge plate of not-as-Chinese food.\n\n$6 lunch special gets you two dumplings, bowl of soup, and choice of main over white rice. The General Tso's is really, really good. The dude here can cook.\n\nConveniently located, price is right, food is good. Service can be slow because it's literally the guy cooking, and the lady serving, but it's well worth it. Don't hate on this place for service - walk in there, and you know what to expect.", "author": "Conrad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "This place LITERALLY has the best General Tso chicken I have ever tasted.  So good.  Their lunch specials are killer ($6.50 for a giant plate of food with rice and dumpling or egg roll appetizer). Definitely not healthy but definitely tasty when you need a Chinese food fix. Not too far from the Fidi for easy access to tastiness during the work day when needed. :)", "author": "Erin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "I have a hard time giving anyplace 5 stars but this is definitely a strong contender.  Wonderfully authentic and fresh Chinese chow.  Not sure how it could be any better.  Bring cash though - they don't take credit cards.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "The food here was delicious!  We were looking for a place in San Francisco where we could get General Tso Chicken that was actually spicy. My husband and I each ordered the General Tso for lunch. It was reasonably priced and it came with pot stickers or spring rolls before the main meal. The chicken was actually spicy unlike most we've had which are just sweet. It wasn't overly spicy though where you couldn't eat it. I think the best part about this meal though was how it was cooked. It was cooked to perfection. The chicken seemed to be quality, the breeding was crispy and fried perfectly. While we were there I told my husband that I don't know if I'll be able to get Chinese food at home again because I will always be disappointed that it didn't live up to Yan's Kitchen. My only complaint is that the service was kind of slow. But I think that was because they only have one cook and everything was made fresh to order. We will definitely return here whenever we're in San Francisco.", "author": "Meghan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-26", "description": "Why do people keep giving this place 4 and 5 stars?!?!?\n\nWhere to begin...\n\nMy sweetheart and I are major foodies and always use Yelp to find restaurants. So far the ratings and descriptions have been pretty on point, but not today. We are currently on a small vacation in San Francisco, up from L.A., and decided to grab some cheap Chinese food for lunch while in Chinatown. So we yelped...\n\nWe ordered two lunch specials: The Mongolian style Chicken and an Orange Chicken plate, both with fried rice.\n\nThe Mongolian Chicken was way too salty and made with cheap yellow onion instead of green onion like normal. The flavor was to strong and not very good.\n\nThe Orange Chicken was more fried batter than chicken, no joke. It was maybe about 30% meat with the rest being deep fried batter. The orange sauce was also not very good, kind of sugary.\n\nThe fried rice was the worst part: It was partially reheated clumps of cold white rice halfheartedly tossed with soy sauce, not fried, but warmed up. We were biting into cold clumps of rice where the soy sauce didn't make it.\n\nThe dining area was just terrible. When we walked in, half the tables were dirty with used cups and plates. We figured they would be picked up by the time we left but they were not, even though no one else was in the restaurant eating. The floor was dirty, the walls were dusty, the bottles of spices were sticky and coagulated in a way that made us feel like they had NEVER been cleaned. When we sat, the table was dirty and the older woman wiped it down with a mildewy towel, leaving a nasty smell until it dried . We don't really mind a lack of imaginative decor, especially when looking for a budget meal, but hygiene is a must. Also, there are no restrooms available. Despite seeing all of this walking in, we stayed because the yelp score was 4 stars and WE LOVE Mom and Pops spots...\n\nThere goes $22, and opportunity to enjoy good eats, way misspent, and heartburn for the rest of the evening...\n\nSo I ask again: Why do people keep giving this place 4 and 5 stars?!?!?", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-29", "description": "This place is fantastic!  Came here for the late night menu, and the garlic fries were awesome!  Lots and lots of garlic, just the way I like them.  They also have an interesting selection of beers, and the service was great. \n\nVery casual environment, and incredibly comfortable.  The warm lights and laid back decor make me feel right at home.  Definitely recommend!", "author": "Cora L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "Freshest Chinese I can remember. The breading on the chicken in the General Tso's was fresh even though it was covered in sauce. They make the Tso's with jalapenos but the heat was fried out of the peppers themselves and into the sauce, so it was very good. Incredibly priced for San Francisco - less than $7 for a plate.", "author": "Don V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "Basic Chinese takeout that's a pretty good value. Low prices, but a lot of what you get is rice. Was staying nearby on a holiday, so the choices were limited and I was too tired from traveling to go exploring. It's a family operation with the harried wife/mother taking the orders--don't expect warm & fuzzy. I had Kung Pao shrimp--I think the shrimp were frozen. The veggies were cut large. The sauce is pretty much what you'd get anywhere. No chopsticks!\n\nI give it 3 stars because it was fine for fueling up on a holiday and convenient to the Hilton. I wouldn't go here at all if I wanted authentic Chinese (easily found a couple blocks away) or if this was a special occasion.", "author": "Rich J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "cheap yet high quality and tasty! The atmosphere is busy, boring but the food is amazing. Good for a lunch.", "author": "Marina Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "Had hot and sour soup, singapore curry chicken noodles, curry fried rice and mongolian beef.  Everything was perfect except the curry fried rice. WAY too much curry.  The portions are huge.  I would recommend because it's cheap and tasty.", "author": "Carol S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "Solid tasty well prepared Chinese food. There is nothing fancy here just good solid fare at a really good price. I had the Shanghai dumplings and the curry chicken both were very good. Lunch was $10 with tip. Hard to beat that in the city.", "author": "Lee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "Great food at a great price. The food is FRESH, owners are friendly, and they cooked the dish right in front of me! (I got the mongolian beef) \n\nProbably the best chinese food i've had in the Financial district.", "author": "Petar B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-17", "description": "Amazing. My wife and I came here based on yelp reviews and the food exceeded our expectations.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "The Shanghai dumplings and curry chicken are fantastic.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "Awesome food. Had the Mongolian pork with shanghai dumplings, fried spring rolls and hot and sour soup. Everything was amazing. Was not busy during lunch hour and the service was fast and friendly. Will definitely return.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "Great value for the price, I don't recommend the fried dumplings tho, they're like deep fried tempura style, not pan fried", "author": "Andy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "Really Authentic Chinese Food. The service is a little slow but that is because they are only two people working. It's CASH ONlY so be prepared. I really liked all the food except for the orange chicken but besides that it is all really good", "author": "Raul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "So we wanted to eat Chinese food before we left and randomly found this place because we were close to the Embarcadero Center and didn't want to walk far. I won't lie as we approached the place I was skeptical bc the outside sign is very worn out but decided we would still give it a try, we had the General chicken and orange chicken lunch special with chicken and vegetable spring rolls. Let's just say we had to make ourselves not finish the rice so we wouldn't be so full, this little hole in the wall place is so so good. The only two workers are the owners who also cook and serve the food. There's no music playing, a quite little GEM right by financial district! 2 thumbs up!", "author": "Eve E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-10", "description": "This place gets 5 star for being an incredible value. \n\nIt's one of those picturesque chinese mom and pop hole in the walls that serves up amazingly delicious food at really great prices.\n\nIf I'm ever in the area, I always pick up a chicken fried rice and won ton soup to go!", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-22", "description": "Good place with solid food options. \nThey have brown rice too for just extra 50c. Try their mongolian chicken. They are also super quick and nice they get my business time after time", "author": "Try E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "I was longing for some decent Chinese take-out tonight (literally does not exist in my neighborhood) and it made me think of Yan's. The ONE good thing about my days living in North Beach (don't speak to me of Bistros and Ristorantes and Caffes. I can't afford that shit.)\n\nVery decent food in huge portions for a very-reasonable-for-downtown-SF price. The Yans are sweet people too. It's probably \"Westernized\", I don't know, I've never been to China. If it tastes good and pleases you, who cares? All I know is, at Panda Express and other crap-tier places, their idea of Orange Chicken is to pour melted Smuckers over fried bits of dough. Mr. Yan cooks you up an honest-to-goodness decent, balanced meal that I wish I could get for dinner right now.\n\nI miss you Yan's Kitchen :(", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "We came here based on the \"best general tso's ever\" reviews. The general tso was just okay for us. We weren't huge fans of the breading and it tasted more sweet than spicy.The hunan beef was better. But you can't complain about $9.95 each for dinner in FiDi! You get quite a bit of food too...soup, egg rolls, rice and two beef dishes. We added some pan fried dumplings and those were my favorite part of the whole meal.", "author": "Ashleigh M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "Fast, fresh, tasty Chinese food. And cheap! Cash only, but I'm sure that just keeps it simple. Mongolian style chicken, shrimp, and beef was awesome!", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Yan's Kitchen was one of my favorite lunch spots when I worked in the neighborhood 2006-2008 (along with Tri Colore). I went back for dinner tonight and remember why. The couple who run the place are very friendly and prompt with service. They greet me with a smile and the server already knows my order: their delicious Kung Pao Chicken. Since they give such generous portions, I take home half, which means, yes, two meals for $6. She serves tea with the meal at no extra charge and gives a fortune cookie with the bill. \n\nAll these simple, non-pretentious touches make a big difference and will keep me coming back for more delicious Hunan from the heart.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "THIS PLACE IS AMAZING!!!!! I am astounded by the quality of the ingredients. The brown rice and quality of food is 5 star quality! I even think I tasted coconut oil in it (Coconut oil is one of the best - if not the best - cooking oil one can use). No signs of MSG at all. Their character speaks volumes in the quality, portions and pricing; OUTSTANDING! They also have extra virgin olive oil in one of the broccoli dishes but they are kind people, so I know they can add it into another dish if you prefer it. The serving portions are HUGE and they don't skimp you on the chicken/beef/proteins AT ALL and they only charge 7.50 or less for these entrees and 1.75 for the brown rice. Words will not do this place justice, this is by far the best restaurant food I have had in San Francisco and they stayed open for people even after 9:30 (closing for them), I'd say until at least 10:30 not denying anyone; gentle souls. I was thinking of ordering a second entree with broccoli and the kind woman said it's okay you'll have plenty of broccoli with your chicken and broccoli order, so you don't have to order a second one if you don't prefer to; PURE HUMILITY! They sincerely enjoy serving the people, so ethical... you can tell by the ingredients and standard of cooking. I hope we can help this beautiful husband and wife out as they are of exceptional character. The interior could use some work, but their presence more than makes up for it with the pricing and huge portion sizes and the quality is amazing too. Coconut oil/extra virgin olive oil and I received two big servings of brown rice and chicken broccoli for under 10 dollars.  I cannot say enough kind words of this place. I hope we can help them open up a beautiful restaurant. The chef is the husband and he's such a humble man, the slightest compliment makes him smile so brightly. Make sure to compliment him on the way out, you can tell it warms his heart as he is working back there by himself and serving all of the customers. He is a very talented chef and deserves our service. They have take-out as well and it is cash-only.  I wish I lived closer by because I would love to give this beautiful ownership my money for the delicious food they serve. I am blessed to have given it a chance; Thank you Jesus Christ! Hahaha :)", "author": "Deepa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-08", "description": "If I just had the General Tso's I would have given them 5 stars. It was crispy, juicy, and delicious. But their noodles with shrimp and hunan beef wasn't very flavorful. Their potstickers were okay. The service was good, although a bit slow. Worth going to for their General Tso's.", "author": "M T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-09", "description": "The only great thing is that its cheap. Nothing too great about the food. Nothing personal against the owners because there are heart warmingly nice, but some of the dishes I tried there were bland and dry. Its a small cozy atmosphere, so it can get crowded.\n\nA great value to fill your tummy, but its nothing gourmet. I did try the dumplings and they were very juicy and flavorful so try those!\n\n**cash only when I went**", "author": "Arthur C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "I've only been to Yan's Kitchen once and I really enjoyed the food.  Not to mention this place has low prices and fantastic customer service.  \n\nMy friend and I ordered their Family Dinner that comes with Eggrolls, Soup, Rice, a Chicken dish and the Hunan Beef dish (which they let us switch to Hunan Chicken).  The Eggrolls, the Soup, and the first Chicken dish were all pretty good, but the Hunan Chicken was excellent.  \n\nLike I said earlier, the service was great - the Chicken dishes came out about 2 minutes after I finished my soup and the waitress apologized for the dishes coming out so late.  Then the chef came out a few minutes later to apologize.  They also were filling up our drinks quite often. \n\nI will definitely be going back to this place.", "author": "Dipesh G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-04", "description": "I am really concerned with the amount of people who state the food here was good. The place is a little cramped and run by what seems to be a husband and wife.\n\nService wise the wife is trying all she can especially with it being as packed as it was. We ended up waiting an hour to get our lunch dishes which wasn't of too much concern considering there were only two people working and probably 20 people waiting for food.\n\nNow aside from the cramped, wait, and uncleanliness I would've given this place an easy 4 stars had the food been good. I knew what to expect going into Yan's as far as cleanliness and space but was hoping to be wowed by the food.\n\nWe ordered the general tso's chicken lunch as many yelpers have mentioned and I ordered the hunan beef lunch. What I really liked was that the food is made fresh. You have an open view of the kitchen and get to watch the cook do his thing. The problem was there was no flavor in the beef and the chicken was overly battered and the sauce wasn't that good. The hunan beef was meant to be spicy but was actually a little sweet with no spice.\n\nThe free tea and soup along with the good service is why this place got 2 stars. I would look elsewhere for Chinese food.", "author": "Nicholas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "A proverbial hole-in-the-wall, it's easy to walk down Columbus Avenue and miss this place. Just a hop, skip and jump away from the glaring neon lights of the Columbus/Broadway intersection, it's very accessible for anyone hanging out in North Beach looking for some cheap and good eats. \n\nIt's a mom and pop team working the crowd, so you might have to wait a bit if it's crowded because it's just the two of them (he cooks, she does everything else). Very nice people. \n\nOnce your order comes, you'll find that the food is good, not too salty, and they give you decent sized portions. Sometimes, I just can't finish what's on my plate but that's okay, because I don't mind leftovers. I generally come for lunch and try to avoid the business crowd lunch rush, so my wait is not bad at all.\n\nStop by if you're in the neighborhood. Make sure you have some cash because they don't take cards. Eat it there, get it to go; either way, you can't go wrong.", "author": "J N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "I couldn't stop eating the General Tso's chicken and I HATE General Tso's chicken. I ordered it sort of as a joke and ended up killing it.", "author": "Dawn M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-23", "description": "I hate to have to do this but I feel like I was really mislead by the 4 star rating on this restaurant.  I can usually trust Yelp but was definitely disappointed this time.\n\nNow - let me preface this by saying that the owners seem very sweet and hardworking and this, in no way, is a slam against them.  But the food itself is not 4 or 5 star quality like many of the Yelpers claim.\n\nMy husband and I wanted a quick dinner last night and were in the area so we looked on Yelp to find an inexpensive Chinese place that had high ratings.  Maybe we should have known to go elsewhere because it was completely empty at  7:30pm on a Friday night (on Columbus St).  True many Chinese places do more business in take-out but I didn't hear a lot of calls coming in and didn't see take-out orders ready while we were there.\n\nLong story short, the prices are really low.  I guess you can say you get what you pay for.  Ambiance was def lacking - not that we expected much.  We are very down to earth and really don't require much when we're grabbing a quick low-cost dinner.  The condiment containers on the table looked like they hadn't been cleaned or refilled in a really long time.  The sweet and sour sauce for the spring rolls was served in a plastic ketchup bottle coated in stickiness and the contents looked like melted strawberry candy... a really light pink sugary liquid.  Not like any sweet and sour sauce I've experienced.  I ordered hot tea and it was served to me in a small plastic water cup.  Never seen that before and I can tell you that drinking hot liquid out of plastic just feels wrong.  We weren't given or offered water.  We were each given one paper napkin and one fork.  Chopsticks weren't available (maybe she just didn't give them to us).  \n\nWe ordered the pot stickers & spring rolls for starters.  Flavors were pretty bland on both items.  For entrees we had the bbq pork fried rice and chicken in garlic ginger sauce.  The chicken dish was probably the best of all 4 items but it was still just mediocre.  Panda Express would be better.  The worst thing was the fried rice.  It really didn't have much flavor.  My husband, who has a very forgiving palate and will eat almost anything, said it had a flavor reminiscent of \"wet dog.\" Sad because I typically love fried rice and will usually finish it off or at least take the leftovers home for later.  We left at least 1/3 of the rice on the serving plate.\n\nMaybe this is more of a financial district quick lunch spot... seems like they'd be better for that kind of service and that people eating a cheap lunch have lower expectations.  Not sure but I can say it's definitely on the lower end of Chinese food experiences I've had and I've eaten Chinese food my entire life at least once a month.", "author": "Alisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "Mom and pop place that makes cheap/bomb Chinese food for lunch. It is very hard to finish the rice plate lunch specials (price range $4-6)....soooooo cheap and sooo good. May, the waitress, is very nice and some how manages to serve everyone for their packed lunch service. \n\nGet the general Tao's chicken rice plate. Its crispy, tangy and spicy with cuts of carrots and jalapenos. YUM! \n\nAlso I suggest calling in your order and eating at the place, because you don't get the soup of the day or tea to go. Calling in helps for me to try and fit in lunch in my crammed 30 minute allotment. Also you get a choice of rolls or dumplings for starter - get the dumpling.", "author": "Brandon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Easily my favorite Chinese restaurant in San Francisco. While the atmosphere isn't nice, the two owners are very friendly, hardworking people who create some delicious food! I regularly grab take-out (they only take the dish off the burner once you arrive to ensure your food is hot) and occasionally sit down to eat. Don't go in expecting great service (there's only two people there and they both cook) or a fancy table (to be honest, it's a bit dirty in there). Do go in expecting great prices, portions, and dishes.\n\nI recommend the Kung Pao chicken and the orange chicken (best I've ever had!).", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "I was a little fooled by the 4-star rating, expecting great quality food. As soon as I walked in for lunch, I realized that people gave the rating due to the low prices and friendly staff. The food was very oily, overcooked, and had way too much salt.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "I was craving some Chinese good and decided to go here based on a coworker's recommendation. I ordered the kung pao chicken. It was a bit of a wait but sooo worth it. The food tasted fresh and I appreciated that it was chicken breast meat that was used. Go here if you are looking for fresh tasting and cheap Chinese food. Next time, I think I will try their General Tso's chicken which every one seems to be talking about.", "author": "Zannie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-03", "description": "Affordable original Chinese food.  The service was quick. We had the curry mixed vegetables and bok choy and mushrooms in garlic sauce.  The food was somewhat on the salty side. But overall not bad, for a famished couple looking to grab a quick bite.", "author": "Emma B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "Love the food here!  My favorite is the Fish with ginger, garlic and onions.  There is something about the sauce that makes it so addicting that you keep craving it.  The General Tsos chicken is yummy too.  Great service and very nice owners.", "author": "Jeff E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-11", "description": "Anyone who gives this place more than 2 stars has never had authentic Chinese food.  I lived in the Bay area and NYC for many years so I know good Chinese food.  I had one day in San Francisco after many years of being away so I wanted a really good meal.  I walked nearly half mile out of my way because Yan's Kitchen had 4 stars.  What a mistake!  I probably would have done better just walking blindly into almost any other place.  The pot stickers were tasteless served without sauce other than the standards on the table.  The chicken dish was served on a bed of rice rather than in separate dishes and was so salty it was barely edible.  It was marked as hot but was very mild.  This is a city with dozens of amazing Chinese restaurants.  If you're looking for good, authentic Chinese food stay away from Yan's Kitchen.", "author": "Arleen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Great authentic cheap Chinese.  The broccolli with garlic and ginger is legit!   Salt and pepper shrimp not best I've had but my daughter loved the beef and veggies", "author": "Jay R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-30", "description": "Incredible Chinese food. I've lived in China for more than a year and this place is the most authentic and traditional Chinese food I've ever had in the United States. Great spot with excellent service and the nicest owners.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "Food was great! Not as clean as you would want, but it is kind of a hole in the wall place.  I had the shrimp with garlic sauce and it was wonderful.  Service was a little slow.  I gave it 4 stars because of the food and the price.", "author": "Eddie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-20", "description": "Been eating lunch here for 5 years (not every day)\n\nPepper and salt chicken is awesome.\n\nPlace is basic, inexpensive, the food is great and Mr. and Mrs. Yan always have a smile and a hello.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-05", "description": "Cute little mom & pop shop. That I'll be avoiding at all costs. Decent tasting food at reasonable price.. that gave me explosive diarrhea 30 minutes later!!!!", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "The food isn't really that amazing. A lot of it tastes the same. Atmosphere isn't anything worthy of taking a cute chick on a first date either. But I really do love the service, and they will do anything to make your experience better. When I used to work in the area, Mei would make me this spicy egg scramble with bbq pork. Nothing even remotely close to anything on the menu. They even make buffalo wings and hamburgers too that aren't that bad. Mei and her family are very nice people that will really go the extra mile to ensure you leave happy.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "The food was excellent and the welcome warm.  Three of us ate a delicious lynch with drinks for under $30.", "author": "Patty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Very small mom and pop place ! Very nice people ! The food was delicious and fresh !!! Great place !", "author": "Irene B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "The owner was quite conscientious, and made a couple of menu suggestions that were both on point.  I had heard great things about the General Tso here, so that is what I ordered.  I can see where the excitement comes from, as the sauce was really top notch.  One complaint I would have is that the chicken pieces inside the breading were quite small, so you could say there was a high breading to chicken ratio.  Also, the portion size with this dish wasn't as huge as I generally expect from Chinese, and I felt a bit hungry after eating, which is rarely the case with Chinese food.  The person I ate with got a vegetarian tofu dish that was definitely over average and flavorful, and the portion size was more generous.  Yan's kitchen has brown rice as well, which is a nice addition if you are looking to eat more healthy. Overall this is a good destination, and the price is right.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "LOVE LOVE LOVE Yan's Kitchen.\n\nGreat hole in the wall Chinese restaurant. My boyfriend and I tried out this place on a trip to SF, and here is a basic rundown of how the meal went:\n\n1. Hm, kinda small...but look how cheap the food is!\n2. Oh. My. Gosh. This is delicious.\n3. *Looks at receipt.* Wow! All this food for only $27?!?\n4. *Coming back after paying at the register...* Guess what, the receipt said $21, not $27!\n\nNeedless to say, we're definitely fans of Yan's. :D", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "This was totally impromptu as I only had 30minutes to find a quick bite to eat and happen on this quaint little restaurant.  I liked that it was run by a husband/wife duo. The place looks a little sketchy but it was clean enough.  I would have liked to see the usage of gloves on at least someone in there as they handled the food.  I asked for the house specialty (ok..I had no idea what to order) and asked they pick something for me.  She suggested stir fried vegetables with chicken in a garlic sauce over rice.  It came out pretty quick, hot, and was pretty good.  Best part?  My plate costs only $6.50.  When was the last time dinner costs you $6.50?  I was so thrilled with the novelty of it all.  I was happy I found this place by accident and I would recommend it if you happen to be standing on the same block.  While it is not a place I would go out of my way to visit, it was one of those places I will chalk up as part of my SFO experience.  Warning - Cash only, but because it is so reasonable, you won't need much.", "author": "Evelyn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-09", "description": "Friendly service, cheap plentiful and delicious food (for the most part) - had the Mongolian beef for lunch - will be back soon !", "author": "Corey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Had the General and it was really good.  Was hoping for a little extra sauce to drown my rice in but other than that it was awesome.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "Reliable and cheap-this is a great lunch option when you are looking for Americanized Chinese food.  I would definitely never call the items here authentic, but it is what it is, and if you are looking for cheap, fast, Americanized Chinese food, then this is it.  Recommend the garlic chicken and steamed dumplings.  Cash only.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-11", "description": "Hubs yelps for Chinese food and took me here feeling confident I could eat here.  First impression is worry since no one Chinese- looking is in there - not a promising sign.  Then I look at the menu - immediately I know the type of Chinese food it is but I trudge on and am a good sport.  We order the mushu pork and bok choy/mushroom dish.  Visibly, dishes don't look right but still open-minded, I try them.....Holy Crapola, how the hell can this place have an averaged rating of anything but the worst available? W-H-A-T are you Yelpers talking about with these high ratings?!! This is SanFran afterall - averaged out, you all should have distinguishing palates. Both of our dishes were utterly abhorrent.  If I took my Chinese mom here, she'd consider disowning me.  I couldn't muster the fortitude to eat much of it.  \n\nDespite the friendly couple who I assume owns this place (pains me to ding them like this but truth must prevail), I cannot be kind or generous in this review because it is blasphemous to call this Chinese food.  People, it is horrible, horrendous, shameful to label this Chinese food.  \n\nOur bill was $17 plus $4 tip so yes, true it's dirty, dirt cheap but it's cheap that you get, believe me.  The pork in the mushu \"pork\", rather meat-like substance of questionable consistency, tasted like it was mostly gristle and fat.  The mushroom dish had that annoying overly corn-starched gravy.  I felt reluctant to review the place because the older Chinese lady who owns this place (I think) was nice and I was brought up to respect my elderly but ultimately, I felt compelled to do my part to right this ship after we both had the sh*ts the next morning (sorry, TMI but need to offer rationale).  Go forewarned.   I myself will never step in there again. Damn, it was crap.  (Sorry to the owners)", "author": "Liz K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "The soup was really good, as were the dumplings.  My garlic ginger chicken was only okay.  The tea was also good.  I guess since 3 out of 4 things were good, it gets 4 stars. \n\nThe restaurant is a bit dingy.", "author": "Niniane W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Orange chicken definitely worth going back for. Fresher than most Chinese food I've had in my life. Clean white chicken. Retains crispness unlike other orange chicken I've tried. Service was fast also!", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-10", "description": "I don't know why everyone is so overly excited about this place. I've had chinese food before and this is whatever. It's good, but its not fantastic. I wouldn't go back for this, but I think it was worth its trip. It's cheap and the owners are nice!", "author": "Linda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "The lunch special is delicious (I always get general tsos) and the price is unbeatable. I love the couple who runs the place. I've been a lot because its by my work and have always left pleased.", "author": "Jocelyn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-26", "description": "Our semi-weekly \"cheap lunch\" typey inny thingy in the fi-di here at work. Typey inny \"cheap lunch\" and see what yelp has to offer. Today we had Yan's, and Yan can cook. Okay, that was a bad pun, not berry punny at all.\n General's was a bit sweet, and the soup was a bit cold, but overall for six dollars, I am stuffed, was only able to eat half my plate, and Yan has my vote for a possible second try.", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Really good Tso's Chicken and pot stickers. I was in SF for a conference and used yelp to find the best Chinese food on short notice, and Yan's was great.", "author": "Marcus F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Try the General Tso's Chicken - it's lightly crispy, absolutely delicious, best I've had anywhere!", "author": "Bryce T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-08", "description": "Wow, that was bad.  The salt and pepper shrimp was breaded and amount of shrimp was scant.  The curried vegetable makes me want to brush my teeth.\nThe guoba tang (puffed rice soup) wasn't bad, but could have been a bit hotter.\nWill not return there.", "author": "N P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Loved the General Tso's and Lemon Chicken!  Loved watching my meal being made too!  The chef had not read his reviews and I showed him and he was so happy.  Amazing prices!  My new fave place:)", "author": "Kristi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "Their orange chicken is delicious. Great lunch prices. Delicious egg rolls", "author": "Kat U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "We chose this place to buy lunch for some friends from Australia who came to the USA on a business trip.  To quote the announcer from Quake 3 Arena, \"IMPRESSIVE.\"\n\nWhile they have your typical selection of Chinese food, one thing that stood out was the Mushu Chicken.  Now the flavor was generally good, but the rice tortillas were very high quality.  I have had Mushu-this many other places and one of the biggest problems is that the tortillas tend to crack after they have oxidized for a few minutes or when you load the ingredients they crack, and that was not the case here.  They sat on the plate for several minutes while my daughter attempted to make as much noise as possible in the metal high chair that was provided.  Each tortilla had the same soft texture and didn't break.  The hot and sour soup was good.  The drink selection was good too, not just water and tea, but several types of soda (in a can), beer and of course anyone who stocks Raspberry tea (Snapple) automatically gets a minimum of two stars even if the food is awful.  \n\nThey do have a Yelp sticker on their door AND best of all they seem to know about it, unlike some other restaurants I have been to.  There is a 4-level parking garage within two blocks if you can't get public parking.", "author": "Rob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "Cheap, fast, greasy delicious Chinese food. I wouldn't have it any other way. Plus you get large portions. Also, 1 minute away from where I work.\n\nFirst dish - Salt & Pepper fish. I loved the flavor of the fish. My only qualm was that I wanted more fish. I could do without the bell pepper and onions and all that jazz.\nSecond go - General Tso's chicken. Crunchy, tender, yummy.  They put jalapenos in it :) +1 yum.\n\nOnly thing I have to say is their prices are kind of confusing to me on their menu. I am actually still not sure how much anything costs. There's like 2 or 3 menus or something like that, and the prices don't seem to match. For example, the menu (one on the sheet of paper) says 5.99 and also choice of spring rolls... but I think the spring rolls were extra because the total ended up being more like 6.75? I dunno, maybe I'm the only one confused. I just order what I want and pay what they tell me to w/o looking at the menu anyway. It usually ends up around the 5-7 dollar range which is still cheap regardless.\n\nAlso the place isn't exactly the cleanest looking establishment in the world if you got issues with that (which I don't).", "author": "Melody S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-24", "description": "Another case of love beyond frontier! :-)\n\nI have tried almost every Chinese restaurant in Chinatown on a mission to find the best beef and broccoli. All types of holes in the wall, all sorts of prices,  different portion sizes....but one thing was always guaranteed - lousy service. Yan's Kitchen is a very refreshing surprise in the middle of the chaos of Chinatown, and is a 'must' for someone who is a sucker for great service. Like me.\n\nI always order take-out when leaving the office and it's always ready for me on my way home. I started out with the beef and broccoli, but then began venturing on almost the whole menu. I've had hot and sour soup, chicken shrimp soup, all sorts of seafood, beef, chicken and pork. Everything has always been fresh, full of flavors and no MSG.  I always get 'a la carte', which is a huge portion without the rice, then I add a salad  and brown rice at home.......and ta-da: I have a fabulous meal for two! \n\nNow the best part for someone like me: these people are just ADORABLE! They always have a big smile on their faces, they cook right there in front of you, they encourage me to try different things, they make sure it's not too spicy for me, they make a comment when I forget to call and need to order right there......I feel like it's kinda mom and dad taking care of me!\n\nGlad they are here. These people know what kindness and love is all about! :-)", "author": "Simone W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "Great food. We came here as a second option after our first place was closed. Food was fantastic. There were 4 of us and we did the \"family\" option, almost didn't finish it. Don't expect great service or top notch cleanliness but do come for the food!", "author": "Kelsey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "My visiting friends from Atlanta found this place on Yelp and wanted to go for some food. I was very pleasantly surprised! The people who work at the restaurant are super friendly and it seems family owned and operated.\n\nThe potstickers were sooooo good. Perfectly filled and fried to crispy perfection. I had the combination chow mein and loved how the chicken, shrimp and veggies were tender and juicy. My friend's had some other dishes and everyone was very happy with the amount of food and price. I'm definitely going to come back for take-out often!", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "Years ago my parents had been here. Liked it, and remembered it. I was play tour guide with my parents and played the \"where do you want to eat game\"\n\nMy Dad had remembered this place. I looked for the address/name and found it. He was surprised it was still around.\n\nWhen we walked in, I thought oh man, where are we. We sat down at a rather sticky table. Ordered a variety of things and I must have inhaled my food. It was good. If I knew more people who like Chinese dive restaurants, I would go back.\n\njust to clarify, I don't really like Chinese dive restaurants but this one makes an exception.", "author": "Heather C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "I've been going to this place for years whenever I've been in town, and the food is always delicious and consistent.  It's the same adorable couple running the place, and they are the friendliest and sweetest folks who still remember me whenever I come even if it's been a year-long hiatus. They are fast, and the quality of the food is fresh and authentic. My go-tos are usually the Beef Chow Fun and Beef with Ginger, Onion, Mongolian style. Highly recommended and a great place to grab food for lunch for those who work in the financial districct", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "I go here for lunch quite frequently and I must say that I've never been disappointed. I always get huge portions of very tasty food for under $8. This isn't a super-fancy, high-quality restaurant by any means but if you're looking for fast and tasty food for under $10, this place just can't be beat.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "Food: great. Price: unbeatable. I know some people wouldn't like the ambience but it reminded me a bit of my grandmother's table cloth which gave me a feeling of coziness.", "author": "Rudi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-23", "description": "Wow this place is a legit lunch choice.  The lunch special is less than $7 and comes with tea, noodle soup, a side dish (like dumplings or egg rolls), and a rice plate.  I just had the much-heralded General Tso's sauce with beef, and it was *really* good.  The beef is just lightly fried so it's a little crispy, and the sauce is a little sweet and a little spicy.  I am definitely going back for more.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-14", "description": "There's something charming about this spot that makes me want to give it a better review, but the food just wasn't good. The service is fast and efficient. \n\nIf you want to totally stuff yourself for $6-7 this is definitely the place to do it. The lunch special comes with your choice of two veggie or chicken spring rolls or 2 dumplings, and a rice plate with your choice of meat or add another $1 for seafood. \n\nI ordered the orange chicken and a few minutes later I had a giant steaming mound of food in front of me. The spring rolls were actually pretty okay, but the chicken just tasted weird. I think the base for the orange sauce was actually orange soda, no joke. It didn't taste like any other orange chicken I've ever had and took me a minute to get used to. The vegetables (just some carrots and green peppers) tasted freezer burnt. \n\nThey have a little counter / bar so if you're dining alone this is a good spot to sit, get in and get out. Try for the far end, otherwise you will have to endure droves of obnoxious and rude people placing and picking up to-go orders. One of them was screaming into her cell phone in my ear. Ahh, ambiance. \n\nThere were so many good reviews I feel like I should try it again, but I also feel like my stomach is going to revolt from this greasy mess in about 15 minutes.", "author": "Beth D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-11", "description": "Bug in my food. Bug in my food. \n\nIt was lunch, and the Hunan Beef was actually pretty tasty. Didn't find the bug until the very end. If you go here, you might want to order the white rice to make it easier to spot the bug in your food.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "Yes, Yan's Kitchen offers faux Chinese fare, but as long as you're comfortable with that, then it's alright for a quick bite.  Don't eat there if you're a squeamish diner or if you require clean premises.", "author": "Yo U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-03", "description": "Yan's Kitchen is cheap and delicious! Located right next to the Transamerica Pyramid, this small restaurant serves some very tasty food at a very affordable price!", "author": "Alvin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "We had just arrived in SF and were looking for some good chinese food! We parked and started wandering around china town and before we even got there we stumbled upon this small place. They were closing soon but the couple who owned it let us in. They are cash only, so make sure you have cash on you. I only had 13 dollars on me, and we got 2 meals out of it. Pretty good. The woman came over and accommodated us, and told us what would be good. I ordered spicy chicken with garlic and my bf ordered kung pao beef. So good, and had extra to bring home. The couple was also really nice in suggesting where to go/what to do in SF. Love it! would definitely come back if in SF again!", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "I ate here with a coworker on a Monday night.  About as authentic of a family-run chinese restaurant as you can ask for.  We opted to order their family dinner special, which included hot & sour soup, spring rolls, steamed rice, hunan beef, and general tso's chicken, for 8.99 per person.  Excellent deal, as each course was very good, food was flavorful, and we both left very full.  Atmosphere was not fancy-  the interior was small (~10 tables), but everything was clean and the chinese talk radio station playing in the background reminded us just how genuine this business is.  Very good experience.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "Delightful little place--wonderful, friendly service--orange chicken was fantastic!", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "I live for places like this! Small, mom and pop with delicious, generous portions. Fresh and affordable. Plenty of hot sauce and hot mustard! Our food was made to order and lots of veggies included. We will definitely be coming back for more!", "author": "Yesenia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-07", "description": "Amazing! Came based on yelp reviews. Does not look like much on arrival, but wow!! Some of the best Chinese food I've ever had. Reasonable prices. Sweet couple running the place. Highly recommended. Not fancy, just delicious!!!!", "author": "Waid A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "I can't say enough good things about this food. It's been said, but the general tso's is the best I've ever had. The chicken with broccoli is also phenomenal.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "I stumbled upon this little gem on Columbus when I was out for a late lunch looking for a decent asian soup.  I couldn't decide between the two soups and got both  hot and sour soup and a sizzling rice soup. Both of which were SO good.  The soup was filled with vegetables, tender chicken, shrimp and greens. Very reasonably priced. I took a soup home in the spillproof container to my mom, who was sick and she liked it! She who is normally very picky...   I was comforted by the homestyle food - I would try the stirfrys next, but i have been trying to eat smaller portions lately. The couple that runs the place are sweet too. Cash only. But worth going to the ATM.", "author": "ana m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-11", "description": "The fried dumplings inspire faith in fried dough I didn't even know I had.  \n\nThe rice plates are too big for me to finish without discomfort.  \n\nI may never wait for lunch at Henry's again.", "author": "Jared L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "Really friendly, great prices. A very non-intimidating restaurant in china town. There were travelers and locals alike. \n\nI had the garlic ginger chicken: really fresh and flavorful. I would also highly recommend the fried spring rolls.", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "great food and location (near hilton). took us in 30 min before closing graciously - not like some other chinese restaurants i have been to.  only bad point was cash only - but this is throughout chinatown sf.. most everything we had was good on the vegetarian part of the menu so we even ordered to go!", "author": "Cherisse L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "This is a great little mom and pop restaurant. We had the beef noodle soup, beef with string beans, bbq pork with tofu, and chicken with bok choy and mushrooms. All were very tasty.", "author": "Doug F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "We found this place on the Yelp iPhone app when on our way back to the hotel after a great comedy show at about 1am. We were skeptical from the initial look of the place. The two individuals staffing the place were surprisingly young. They were very helpful and suggested a great vegetable dish for me. We also ordered the chicken chow mien. \nThe food was great! And the prices were lower than expected.", "author": "Audrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Had the pleasure of eating at Yan's the other night while I was in San Francisco. Found it on Yelp, reviews were good, and it was open till 9:30. \n\nAll I can say is awesome. I had the shrimp noodle soup and beef and veggies rice plate mongolian style. My girlfriend had the wonton soup and sweet and sour pork rice plate. The meals were each 7 bucks, total bill with a couple of sodas and soups was 25 bucks. Such a deal, and authentic. Mom and pop hole in the wall restaurants are always the best, and the small older lady is so cute and cool. Support local business and visit Yan's. Great undiscovered restaurant.\n\nOne more thing. BRING CASH! They don't accept credit or debit.", "author": "T P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-13", "description": "I eat here at least 3 times a week and there food is awesome.  I am really enjoying their new menu Yan's @ Night.  Keep up the good work guys and I will see you soon! \n\nP.S.  Try the chicken and bacon sandwich :)", "author": "Michael R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "Cute Mom and Pop spot close to Transamerica.  $6.50 for a large rice plate and side of dumplings is a great deal this close to the financial district.  It's really greasy though and the garlic is a little much.  Tasty dumplings.  I'll try this place again but it's just so-so.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-01", "description": "Good. Quick. Cheap. Bummer that the Moo Shoo pancakes were too thin they don't hold the veggies. Inexpensive. Will come back in a pinch.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "One of the better human rest. of the area. Very fast service and cheap prices. If u like spicy they are very light in that area but you can always add more. Ultra basic decor so not a place to impress your date.", "author": "Anthony D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "A family of five looking for a restaurant in Chinatown - found Yan's on Yelp and sounded like a good bet.  Many of the restaurants that we passed were crowded but when we arrived at Yan's it was very quiet (it was just a couple blocks away from Chinatown).  Yes it was nothing fancy and maybe a little rundown but the food was amazing as was the friendly service.  We had the lunch special which you couldn't beat for under $7.00.  Our choices included General Tso's, Mongolian Beef, Hunan Chicken and Beef, Shrimp and Chicken over rice mongolian style - everything was excellent and the portions were big.", "author": "Joyce N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Great food and great service at a low price. I highly recommend it and will personally return. A cozy and comfortable place with basic decor. Bottom line: delicious!", "author": "Clifford C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-06", "description": "Awesomely delicious with friendly service and very inexpensive.\n\nI probably would have just walked by this unassuming place if it hadn't been for the solid reviews that I read on Yelp.\n\nThe Mom and Pop atmosphere was a welcome change from the busy streets of San Fran. The pot stickers and General Tsao's chicken were made to order and the steamed rice was cooked perfectly and all for less than $10.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "Went here based on Yelp reviews.  Not at all disappointed.  Great food at a great price.  Had the Hunan beef, hot and sour soup and crab ranggon. Great bargain and gracious service.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "Nicknamed \"Cheap & Cheerful\" by my office buds, I paid my first visit, or so I thought, to Yan's Kitchen.  Once we got to the door, I knew I'd been here before.  Way back when I moonlighted at Tower Records in the 1980's and 90's and we needed some cheap eatz, this was a place that got visited (as well as Yuet Lee).\n\nSo, I can't comment on my past visits, but yesterday was pretty darn good.  The little soup served with the lunch plate was, well, weird.  A bit of potato, a bit of kidney beans and a bit of carrot in a broth that tasted like dishwater, pass on that if they hand it to you.  I ordered Mongolian Chicken.  Not as garlicky as I like, but a nice kick from the red chili and the veg were plentiful and f-r-e-s-h.  No MSG is a real plus and the service was fine and it was cheap and cheerful.  I'll be back, the menu is huge.\n\nCash only, they don't ask for much, but no plastic and no atm really close by, so be prepared with cash in hand.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-30", "description": "Yans Kitchen is always fresh and they are priced to perfection. Not your avg. Chinese food place. The owner and his mother run the joint together, I believe. Always super friendly and the food is always freshly cooked. I usually get the General Tso pork with Fried Rice. Amazing! Go there at least once a week. Try there egg rolls as well!", "author": "Shawn O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-17", "description": "When my foodie friend first took me to Yan's, I knew I was in for some good food. I wasn't expecting great food for such a great low price. I had the chicken with cilantro & scallion sauce, accompanying egg rolls & soup, and we split a plate of won tons. Everything was super fresh and very tasty. The main dish portions are large enough for two full meals, so I end up with leftovers that are still good the second time around. It's cash only, yet so worth it.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-20", "description": "+5 for the awesome sweet potato/chicken thing I got take out.\n\n-1 for each roach that crawled across the table during my business lunch.  5-1-1-1-1=1 star.", "author": "Bobby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Excellent hole-in-the-wall w/ the beloved name of \"Salty Chinese\" for me and my cohorts.  The food is average, but for some odd reason, I, we, keep coming back to this place.  The prices are very reasonable, and you get a lot of food.\n\nGo during lunch time, and try the salt and pepper pork.  It'll give you a heart attack ;-)", "author": "Rod '."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Don't let the shabby decor fool you!  I've eaten Chinese food in a lot of different cities, including Seattle and Portland and Yan's Kitchen is one of the best!  The string beans in XO sauce, Kung Pao shrimp and General Tso's chicken are to die for!  The only down side is the decor, but who cares!", "author": "Eric K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "Great food, great people!  I've been going to Yan's now and again (for awhile when I worked closer to them it was more \"now\" then \"again\") and they have never disappointed. Very much the hole-in-the-wall type place, they concentrate on the freshness of their ingredients and solid prep of their dishes.  Standout include their fantastic spring rolls and pot stickers along with a variety of superior quality dishes including Kung Pao Chicken, Orange Chicken, Curry Chicken, the list goes on from there.\n\nNo Chinese place can do every last thing the way every last person likes it, but Yan's does it very well and the owners and staff are as nice a group of people as you could hope to see for lunch or dinner.  Quick, polite service, easy on the wallet prices, always a smile when you walk in, and they pay great attention to all that they do.\n\nThere's many places to choose from when it comes to Chinese food in San Francisco and some really stand out.  Yan's should be one of those places for you.", "author": "MJ M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "I. Love. This. Place. \n\nI went there for the first time on the second day of Chinese New Year. It has been a miserable one for me: being far away from family, feeling ill, working 11hour days. It was the equivalent of a present/family-less Christmas and all you could do is get a rotisserie chicken from Costco. \n\nI stepped in here on my way home, just looking for an alright-looking Chinese place for take out so I can eat in front of my TV and sob. It was way beyond my expectation. \n\nThe food itself was great. Hot and sour soup delicious and definitely hits the spot (Tai Chi is the only place where I've had decent hot n' sour soup). The pork dish with eggplant and tofu was recommended to me over the Ma Pao tofu, and it was absolutely delicious. Soft eggplants, flavorful tofu (I hate it when the sauce isn't cook through), delicious sauce with just the right amount of heat but not too thick with corn starch like most Chinese restaurants in the area. \n\nThe couple that own that place were just the nicest, smilest people. I think they felt bad for me and definitely gave me a little bit extra food and just the getlest smile and greetings despite our language barriers (I can't speak Cantonese, they can barely do Mandarin). \n\nLove love love this place. Came back again the next day with my best friend. The couple probably felt really, really bad for me.", "author": "Fiona S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "GO HERE FOR CHEAP CHINESE FOOD.\n\nI was craving cheap chinese food and wuddyaknow...Yan's is down the street from my work (my boss recommended it since I just moved up here). \n\nWhen I placed the order on the phone, they were nice to ask how \"spicy\" we wanted the food. I love spicy food and adding \"a little bit\" was just enough to make my sinus clear up and my nose a little runny. I ordered the veggie chow mein and my co-worker got the beef chow fun. \n\nThe place is humble, typical \"authentic\" chinese restaurant. They only take cash and I didn't know that at the time. The woman at the counter recommended I go to the bank down the street instead of the ATM across the stress because it charges less. How sweet of her to watch my back; she's down for the cause. You can also see the cook right behind the counter and they were all super sweet and nice. \n\nMy food was pretty decent: noodles were a little mushy than what I had hoped, veggies were good, flavors were yummy. They even included a sesame red bean ball (a dim sum/chinese delicacy) .....YUM.\n\nFor the buck, hell yeah it's good. Things somehow taste better when it's cheap. I have yet to try the lunch specials. Perhaps then my star rankings shall increase. Give it a try, I say.", "author": "Geneva X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-09", "description": "YUM! Delicious, authentic Chinese food for a bargain! Not only is the food awesome, but the staff seems very sweet as well. So glad to have a healthy dinner option when I have to work late.", "author": "Anonymous F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Yan's Kitchen is absolutely delicious. The food is perfectly seasoned and comes to your table piping hot. As you dine, you really believe that the pleasant duo of server and chef really care about your dining experience. My sister and I and her 2 year old boy were the only 2 people in the entire place at 9:30 pm on a Tuesday night. That was really fantastic. It was truly a private dining experience. I felt almost like I was enjoying a private tasting menu. It is definitely a Mom and Pap styled set up. A fantastic experience in San Francisco. I strongly recommend Yan's Kitchen, especially if one is looking for a quiet meal in a conservative setting. As I sat at the dining table and looked beyond the drapes that seemed to be hanging there for over 30 years and admired the view out doors, I truly felt like I was sitting on one of the sets at Paramount Pictures. Really magical experience. Once again, I cannot imagine one not having an enjoyable experience at this truly delicious restaurant. The night we dined there, even the weather was mysteriously perfect, as a side note. Witness the culinary perfection!", "author": "Vivi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-12", "description": "GARLIC!!!\n\nOverall I did enjoy my lunch here and it was $6.50 for soup, potstickers, and General's Chicken with rice.\n\nThe soup was ok. The pot stickers were excellent. The General's Chicken was also ok but it had way too much garlic. The service was fast and very friendly. But I still can't believe how much garlic was on my plate... I love garlic too but this was just overkill.", "author": "Thel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-16", "description": "I doubt very much I would try this place if not for Yelp.  First, I wouldn't know its existence and I really don't think I would go in based on the way it looks but then we all know to not judge a book by its cover or a restaurant by its look...blah blah blah.\n\nThe place was empty when we got there around 7:15pm.  I stopped and asked hubby if we should go in or turn.  Bless him for forging ahead and so we did and took our seat and remain the only customers.  \n\nThe waitress was nice and friendly.  We were given 2 menus - the regular and a Special.  The Special one page has 2 sides - one is asparagus in black bean sauce with a choice of various meat or seafood at various price over rice or a la carte.  The other side is a variety of items from mixed seafood in spicy sauce, blean bean sauce...pork chops.  \n\nHubby wanted chow mein, specifically the fat noodle - that's why we decided to try this place.  Anyway, we got:\n\npot stickers (home made, I always ask before I order) - 6/$4.25 - it was pretty good.\n\nbeef chow mein in Hunan sauce - $5.39 - this is what chow mein is all about.  It's a mixture of onion, celery, broccoli, cabbage, bean sprouts, carrots, our favorite type of fat noodles, and some tender slices of beef.  Good portion and very tasty.  \n\nMixed seafood (shrimp, calamari & fish) in spicy garlic sauce - $7.99 a la carte - first I regretted ordering this thinking it'll be terrible frozen seafood but I'm one to admit if I'm wrong and I was wrong to think that.  The calamari was very good, as was the fish.  I loved the sauce with the chunks of garlic...next time, we'll order over the rice...that sauce was begging for some rice to soak it all up!\n\nWe also got a cup of the soup of the day, it was blah but it was free so can't complain.  They also make and package their own peanuts in garlic or spicy flavor at $2/bag, which promptly forgot to pick up when leaving.\n\nAll this for under $20 and we were full.  \n\nWe will definitely be coming back so until then...", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "Yan's Kitchen has the honor of being the first restaurant I've ever reviewed on Yelp.\n\nYan's is great. I just went for the first time. I had do go in, because how often do you see a Chinese restaurant with red/white checkered tablecloths? I looked at the menu and my first thought was, this place is cheap. Actually, i said it out loud. It made the couple running the place laugh.\n\nFrom the Specials menu I got chicken, rice and 2 spring rolls.. for about $6. I'm a big guy, but for $6 this was too much food for even me to eat. And not only is there a lot of food, but it actually tastes good. Maybe not the best Chinese I've ever had, but certainly flavorful.\n\nAlso, the couple running the place are two of the friendliest people I've ever been helped by in a Chinese place.", "author": "jared c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-21", "description": "BEST food in the city hands down!  Ok, maybe not the best in the city, but for the prices you can not beat it!  If you are looking for \"authentic\" General Tso's Chicken I have news for you (Jacob).....  They do not have General Tso's Chicken in CHINA!  \n\nIf you are looking for Great Potstickers and the best General Tso's Chicken this side of the Great Wall, check this place out!", "author": "Billy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "It's a mom & pop place and even though it's a little scary, there's a simple charm in that, so give it a chance.  Don't know about authentic, but for a cheap lunch this place rocks.  Try the dumplings for sure.", "author": "Sean O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "Yan's Kitchen is the best take out Chinese food on Broadway. The menu is full of of selections and every item I have tried has been excellent. Rice plates with brown rice and entree are affordable $6-7 each. Their potstickers are excellent and made fresh to order. Good ingredients, ample wok firepower, and a solid cook makes this place my go to joint for late nights at work.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-15", "description": "Awesome, orange chicken, good price.  Very Nice Mom and pop type of shop.  Service was excellent!", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-28", "description": "Went here for lunch today. I've been before and had the General's Chicken. Not too exciting. It was the standard greasy fare to be had at any of the quick Chinese food grub hubs. \nToday I chose wisely and ordered the garlic chicken which was tasty. Not too oily, a fair amount of white meat chicken, fresh veggies, and a good garlicky sauce. poured generously over a heap of white rice.  \nI suppose that the food isn't the best I've ever had, but the couple that own the place are nice beyond belief and I want to see them with a steady stream of business. The food is standard but the owners keep me coming back.", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "This is a good place to eat for lunch. I had the dumpling and it was fantastically good. Never had a fried dumpling before. . . I'm a fan.\n\nI had the garlic chicken, WHOA garlic. It was good. Lots of fresh veggies. \n\nGreat econo-meal. I'll definitely go back again.", "author": "Cat B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "This place is a hidden gem.  You would never think of going inside based on the looks, but the food here is excellent.\n\nThe lunch plates are delicious and the prices are cheap.  The service seemed so so but the food was so good I didn't mind.  \n\nI would definitely take this place over House of Naan king any day.....", "author": "Amul A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-10", "description": "This is balls to the wall cheap, amazingly tasty, and not regrettable-10-minutes-later Chinese food.  It is absolutely one of my favorite places to go, and the family who runs it is so sweet.  \n\nThe General Tso's Chicken is the best dish there, I think, and it is --- and I do not say this lightly -- the best I've ever had.  There. I said it! (Hope I don't regret it in the morning...). The noodles (chow mein or otherwise) are also really good.  The lady who waits on you will also tell you honestly what their best dishes are, and she is not trying to pawn off some old food on you, she is honest and she is accurate as first response. \n\nIt is close enough to the Financial District that those of you who work downtown should go.  Given the lack of pre- or post-Embarcadero Cinema food, this is a great choice.  Enjoy! Just writing this review has given me a craving.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-17", "description": "The perfect little mom and pop chinese lunch place. One of my favorites is the hunan shrimp.  \nthe soups are also very good here, especially the hot and sour and then there is the one with the toasted rice in it. mmmmmmmm I think I'll go back tomorrow.", "author": "Art S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Great value for your money. I've probably been here upwards of ten times, and I get a rice plate take-out every time. Costs around six dollars and it's quite a bit of food! Mongolian Style chicken (or the combo with shrimp) and Broccoli beef are my favorites.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-18", "description": "Never got to try the food because all I did was WAIT!!!! I was by myself and just ordered Mongolian beef? Waited 40 mins and nothing. Only people working were husband and wife.", "author": "Yelper H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "Great food. Prompt service. First time in San Francisco and I'd recommend it to anyone", "author": "Cameron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-15", "description": "They say if it walks like a duck, talks like a duck, it must be a duck. In regards to Yan's kitchen... the restaurant has a chinese name, the cooks are chinese, even the waitress can't speak english well, but oddly enough the food ain't all that chinese. I guess I shouldn't be too shocked since in past reviews some people refer to the food as americanized chinese. I for one am a big fan of panda express so I have no hate for fake chinese. It can be f-ing delicious in its own right. Even my mom a legit 100% taiwanese woman loves panda.  \n\nNot quite sure how to exactly feel about this place. There were a couple odd balls thrown at me. The restaurant itself is not bad for a hole in the wall. The tables weren't sticky, which is the standard I measure for chinese hole in the walls. As long as the table is not sticky and there are no cockroaches running around or in my food I can bear it. \n\nCame for lunch with a friend on a workday. I ordered off the lunch special menu. Got pork cooked with egg over fried rice which comes with sweet and sour soup and 2 dumplings. My friend ordered shrimp chowfun. The soup was decent and my dish was satisfactory in portion and taste. I love my pork and egg over rice so I was perfectly content. My friend's dish on the other hand was cooked in a gallon of oil. By no means am I scared of a generous dose of oil but the noodles were lightly wadding in a pool of it. Funny thing is she managed to finish most of the noodles, but mentally she was not for the better. At the end of the meal I noticed they had not served me the dumpling appetizer and I requested it. Out came these 2 massively fried and battered dumplings. It was incredibly odd and not appetizing. I HAVE been to countless chinese places in my life time and not one has ever battered and deep fried their dumplings. It is most common to pan fry them. Funny thing being the beast I am I ate them anyways. The filling was ok, but the batter was gross and I peeled off what I could.\n\nLike I said earlier I really don't know how to feel about this place. The portion you get for the price you pay is generous. I have yet to try any of the other dishes so I don't want to completely rule it out. I take it if you order the americanized dishes like General's chicken it might be a better experience. My pork and rice dish I would actually order and eat again happily.  Come not expecting the world of this place. It's not authentic by any means, but it's cheap and filling. A man can not ask for any more.", "author": "Jack C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-17", "description": "I love this place. It doesn't look too special from the outside (or the inside) but you've got to try it. It's good for lunch, where you can get tea, a soup, dumplings or spring rolls, and a main dish (with rice) for about $7. Most importantly, though, the food is delicious. You should order the number 19. Big, juicy shrimp, tender beef and chicken, with perfectly cooked vegetables in a nicely gingery, a little spicy, mongolian sauce, over rice. \n\nThe restaurant is small, and the kitchen takes up about a third of a space, but it's pretty cool that you can see Mr Yan cooking everything fresh for you. Mrs Yan is the server. It can get really busy there but they are some sort of dream team. It never gets shouty or stressful. They're just there cooking delicious food and serving it to the lucky customers that know about this place.", "author": "Laura J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "Wonderful mom and pop shop.  Charming.  Great dumplings and spring rolls. I'm coming back.", "author": "Cindy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "Best Chinese food I have ever eaten. The Hot and Sour soup is delicious. Best General Tsao's chicken I've ever eaten. Great owners who run it.", "author": "Brittany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "Inexpensive, good food! Try their new Shar Char Chicken Noodle Soup. It is heavenly.\n\nHole in a wall place but you can't go wrong with the prices or the quality of food. I highly recommend it.", "author": "Bubba S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "i work right around the corner of yan's and i pretty much eat lunch here everyday (and dinner if i have to work late)...  the restaurant is family owned...  the husband is the chef, the wife is the cashier/waitress/dishwasher...  their stir fry dishes in shar char sauce, hot garlic sauce, and mongolian style are really good...  their home made pot stickers are really good too...  \n\ni can either have a $5.00 sub at subway or have a nice hot cooked chinese lunch for $6.00...  10 out of 10 times, i'd rather eat a nice hot cooked chinese lunch...", "author": "Herb F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "Great spot! The value is very good, and the staff is very welcoming. My regular is the ginger and garlic sauce chicken.", "author": "Earl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "Super awesome, glad I tried it. Don't let the exterior fool you, this place is Da Bombdiggity.", "author": "John A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Love this place!!! Found this place on yelp cause the day we were going to the city our usual spot was closed. This is our new usual spot now!!! Mr. and Mrs. Yan are super sweet just like the reviews said. We had pot-stickers to start and they were hot, and well, just good. My mom had the chicken and vegi plate with brown rice (50cents ex) cause it was not spicy and it had plenty of fresh veg! Yum. Her only complaint was the hot tea was served in a little brown plastic cup (like kindergarten). I had the general Tsao's chicken cause of all the raving and it was great!!! One of my girl's had the orange chicken and that was really great too (spicier than the general)!! My other girl had the dish that we all agreed was the best dish hands down!! Sweet and sour chicken Yuummm!!! Best we've ever had in the history of sweet and sour!!! Nobody really mentioned it in the reviews (surprised). The coating was just shatteringly good and crunchy and the sauce was great!!!! Definitely gonna get that A la Carte sweet and sour next time!!! The Thai tea was ok must not be a big fan. The bill was so surprisingly cheap I tipped 30%. This place is so great that I even ignored the sticky condiment jar of hot chili oil. Hahaha!!! Just go!!! it's wonderful, fresh, cheerful, and cheap!!!", "author": "Carolynn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "Tiny little place, but tasty Chinese! This place is a good value, no surprises (the food is your typical Americanized Chinese fare) and reasonably priced. One small hitch was that my companion ordered red wine, and the waitress (who I believe was also the proprietor) gave her a glass of sherry! I haven't tried this place for take-out yet, but am planning on doing so.", "author": "Katrina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-29", "description": "Ugh.  I just got back from lunch with a colleague at Yan's Kitchen.  I tried it based on the other yelp reviews, and I wanted to like it. I really did.  The owners seemed nice.  Maybe they were having a bad day.  I ordered General Tso's chicken.  The sauce was tasty but the chicken was barely noticeable in the over abundance of breading which was over fried to the point it was dark brown/black and completely inedible.  I ate two pieces and gave up.   I did eat the fried dumplings which were overdone - but I didn't have much of a choice.  I was so hungry.  I thought the overcooking was just me, but the next table had the same problem with a similar dish.  My colleague's lunch was OK - Kung Pao Chicken, which was sautéed.  Service was very slow due to only one lady waiting tables. To be fair, she was going as fast as possible.  I'm now working on a pretty bad stomach ache, which hopefully will be gone by dinner.  Ugh.  Serious lunch bummer.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-30", "description": "I always walk by this place and finally stopped in to have some Take Out. I got the Combo Chow Mein and Combo Fried Rice...  Both were very tasty and spicy. The staff was really friendly and made me feel very welcome even just getting take-out.  Only down side is that it's Cash only and the ATM across the street charges 3.50 for a transaction.. On a plus side the girl behind the counter is pretty cute =)", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-05", "description": "A hidden jem on the boarder of chinatown and northbeach", "author": "Mitch F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-12", "description": "Just had dinner here by myself. Went by House of Nanking but line was too long.  This is a small place but friendly and perfect for me since I was alone.  I ordered a small Hot and Sour soup which was good and LOADED with ingredients; a large bowl would have made a meal!  I also ordered the Salt and Pepper beef which is a dish I had never had before but it sounded good. Now, I am not a fan of the deep fried chinese dishes like Gen Tso's and Orange chick so, to my dismay, the salt/pepper beef turned out to be deep fried!  It was my fault for not knowing but I ate it anyway since I was hungry.  I would not order it again because of the health aspect of deep fried food, however, the rice and veggies with it were good and it had lots of yummy fried garlic pieces.  One customer near me had a dish of Curry Vegetables which looked great and another couple had a dish of Vegetables with Noodles and also a dish of non-fried beef that also looked good.  I would return but next time will try healthier items. Soup, entree with rice, and a Fat Tire beer was $15.75", "author": "Jmarc P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "two words:  sesame beef\n\noh wait! five more words:  salt and pepper pork chops\n\nsorry - one more:  cheap", "author": "mia s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-12", "description": "You'd never think to dare step through the door, but inside find good, fresh, and *cheap* Chinese food.  Lunch special will leave you sufficient left overs for dinner.", "author": "kellan e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-13", "description": "I enjoy seeing Yan and her husband's kind faces whenever I walk through the door.  They have delicious fresh food, and generous portions that I can make 2 meals out of 1 - presto!  I recommend it!", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-20", "description": "5 STARS.  Salivatin' good!  Enough said.  Just got to go to know fo sho.  Best asset here is the genuinely hospitable husband and wife team AND watch while he fires up the wok and cooks right in front of you while you can whiff his good cookin!  Everything else is oh joy after the meal with a nice satisfied smile on your content lil' face!", "author": "Carmel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-10", "description": "Yan's is a big favorite of mine. If they get to know you they will cook things off-menu for you. It is tough to spend more than $10 here and the quality is top-hole.", "author": "George S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-08", "description": "Wow.  Disappointing.  \n\nI was in SF for two days and getting randomly fantastic Chinese food was part of the plan.  After several false starts, found this place.  I always trust such a high yelp, but man oh man.  \n\nI'll grant that the portions were large and I liked the little fried greasy things.  That's the only nice stuff I can say.  The cup of ice for my soda had something unappealing floating in it and microbugs crawled across the table.  The soup was warm water with beans in it.  The string bean chicken was nearly inedibly salty (and I like salt more than anyone I know).  The Mongolian chicken was just a pile of pressed boring blah with pepper flakes sprinkled on.  \n\nThis is the kind of \"Chinese\" food you get at a Best Western restaurant in Utah.  I'd take gross freaking Panda Express over this any day.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-21", "description": "the portions are very large and the (generally fried) appetizers were tasty (granted, they're fried).\n\nhowever, my kung pao tofu was lacking in pao.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-29", "description": "their chicken noodle soup was barely better than ramen. the hot tea came in a plastic cup and without a little metal pot for refills.  staff was super nice and the egg flower soup that was the appetizer was really good but my actual meal? super eh. sorry Yan's.", "author": "Cindy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "Super inexpensive (and good) chinese food. For around $5, you can enjoy lunchtime goodness, which includes tea, soup, egg roll, and the fantastic dish of your choice. A few favorites include salt & pepper fish, general tao's chix, orange beef, and chicken chow mein. May & hubby wok up these wonders fresh, delivering them hot to your table with impressive efficiency, considering they have no other wait staff and get quite a noontime crowd.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-05", "description": "Yep... Pretty much what the others before me have already said; fresh and delicious food at wonderfully inexpensive prices! But above all, the folks working here are extremely sweet and kind! Don't mark my words, but I'm pretty sure that like many places in SF they're cash only... So if I've got some cash in my pocket when I need to have food in my stomach, I'll stop by this place!", "author": "P A U L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "Super yummy, great value.  Friendly service.", "author": "Emily A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "This place gets a Gold Star for 'Cheap (edible) Chinese'\n\nThe couple that run the place are super nice and always friendly.  I guess that's Yan in the kitchen, he's always smiling and the woman is always bustling about.  The menu is very no-frills.  It's not the best Chinese food in the world - but it's not the greasiest or the worst.   I've always left pleased and satisfied with what I got for what I paid and have never gotten a belly ache or anything.  In fact, I used to have to go here regularly for their yummy egg drop soup - which was about the only thing I could eat when I was really sick last year with a tropical stomach bug.  They were so nice and would just ask me if I wanted the soup when I walked in - I eventually moved on to the simple, but yummy, chicken and veggies rice plate.  I can now, thankfully, enjoy the full array of their  menu.\n\nTheir lunch specials are a fantastic deal.  I work half a block away and go here at least once a week.  I like it because the portions are huge, and leave me enough to take away to either eat for dinner or for lunch the next day - which is not bad at all for $6.  The daily soup which comes with the lunch special is always different and very tasty.  I will say that the egg rolls are rather greasy - but I've learned to just roll them in an extra napkin first before eating them.\n\nThey can be a bit slow and swamped during the lunch rush, but it looks like they've hired another women to work in the kitchen during this time.  This has appeared to help them out a lot.  Getting food for take-out is alright too, but I prefer to eat in so that you get the soup and egg rolls (and hot tea in silly plastic cups).  Sometimes I get the same thing I always get.  Sometimes, I'll get something new.  Either way, I'm usually pleased.\n\nOverall, I like to support this place and it makes me happy to get good, simple honest food.  Be sure to tip the woman extra - the food is so cheap, so 15% of $5 doesn't do justice to the quality and warmth of the service.", "author": "Miscia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "Wonderful super cheap Chinese diner. Great lunch special. I recommend going with friends/dishes are big and it's always nice to mix them.", "author": "Scott J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-25", "description": "This is definitely my favorite Chinese place in SF. Used to come here for lunch all the time when I worked near the Transamerica Building. The couple that own the place are the nicest people you will ever meet in your life. Anyone who has gone there knows about \"number 19\" so if you're a first timer and you want a safe, delicious dish, don't look at the menus, as there are like 5-6 different ones all with different numbers, just say \"number 19\" and you won't be disappointed... unless you're a vegetarian, but then again you live a terrible life anyways.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-31", "description": "We went last night to enjoy some authentic Chinese Food.  My son is 9 and doesn't like anything but burgers and hot dogs.  After last night he's converted.  The General Tsao's Chicken is the best Chinese dish my wife and I have ever tasted.  Enjoy!", "author": "Amy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "remarkably fresh food from this mom and pop, hunan-style, no-msg, chinese joint. $10 also goes a long way. i likie.", "author": "rahmin s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-28", "description": "I tried Yan's because of Yelp. It was really good. I was in the mood for chicken with ginger and scallions and it was different from what I usually get in a really good way. Like they added their own twist. I was a little afraid of getting an MSG hangover in the afternoon, but it never came on, so maybe they do not use it. I will ask next time. The owners are very kind. The place was really clean. I felt comfortable and good about patronizing the place. I would like to tell them to raise their prices, because it seems a little strange that you would pay more for a cold sandwich than a huge and really delicious hot meal at Yan's. I have always thought it unfair that we expect Chinese food to be super cheap, under 10 bucks for a entree, while we pay $25 for an entree of a piece of protein, veg and starch at a European restaurant. Granted the surroundings are part of what we pay for, but there are fairly strong societal prejudices invloved here that are associated with worth of European culture versus others.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-25", "description": "Best General Tso's ever?  Are you F'ing kidding?  Just made the drive down there, parked illegally, and rushed home to eat what I thought was going to be some amazing General Tso's.  What I got was mushy, slimy, and questionable mystery meat.  I'm not quite sure what it was???  It took about three bites before I gave up.  I'm beginning to think that there isn't good Chinese food in this city.  I've tried about twenty places and all of them have been horrible.  Do Chinese people in SF know what CHICKEN is???", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-11", "description": "hmm...i really don't think this is the hole in the wall i was looking for. but the lady behind the counter was super nice. the place was pretty empty during lunch hour. the hot and sour soup was not good. =( noodles were okay but soggy!! it is on the cheap side...", "author": "Z A."}
