{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Love Yee's!!! Reminds me of the old school Chinese restaurants we frequented as kids.  Where you go for the food and not necessarily the ambiance or service.  And the food here is really good.  We stop in every time we are in SF usually more than once.\nMust haves:\nAnything from the deli case.  Best roast duck in SF.\nRoast duck wonton mein.  \nTofu-seafood hotpot.  \nSalt-pepper chicken wings.\nAnything off their 3 items for $23 menu.  (I love this price).\n\nA must visit if you're in SF Chinatown.", "author": "Iakona C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-01", "description": "My partner and I were walking in the neighborhood around 1am and we peered inside the restaurant to see a cat walking all over the cutting boards and counters. Would definitely be cautious if choosing to dine there", "author": "Margaux Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "I've been coming to this restaurant since I was a kid but I think they've changed ownership a couple time through the years. On this day I came in for just something specific, Jook. That's rice porridge. I brought my girlfriend who is Hispanic and had never had rice porridge. She wanted to try it out and I took her here. I ended up not regretting that decision because we ordered the Jook with cod and it was fantastic. The fish was perfect and the rice and soup mixture was dead on. The thing that stand out is that the soup didn't taste like they used anything to make the porridge think. See some places will use gelatin to thicken up the porridge but not here. I also ordered a Singapore rice noodle, this is one of my favorite dishes to order when I go place and it was fantastic. Tons of shrimp and chashu in it. The price is one of the cheapest in the neighborhood (see my review for Yuet Lee). My girlfriend now is a fan of Jook and a fan of Yee's. So give this place a chance.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "Food was nothing exceptional. We ordered the roast pork over rice and wonton noodle. 2 plates shared between 3 people. It filled us up. But the charged us $2 for sharing!!!! The service was poor, as they were rude to us. And the wonton noodle soup tasted plain. Soup base has no flavor, it was like sipping water. The wonton was basically just plain meat wrapped in wonton.", "author": "Uyen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Very fresh duck in the delicious soup...The vegetables over rice was very nice too.\nI have never eaten in Chinatown, and this was a great 1st time ezperience", "author": "Les G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "This place is the place to go for authentic Chinese food. Don't expect it to taste like Panda Express. This is an authentic Guangdong style restaurant and serves authentic Guangdong style food. Typical of most Chinese restaurants, this place is noisy, which might be unsettling to tourists. The servers are nothing but nice to me, but they may come off as ride because of language barriers between them and their guests. They don't speak fluent English, since they are immigrants, so give them a break!", "author": "Kelli T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Finally have roast goose in USA！The taste of it is average. Roast duck and soy chicken is good！Worth trying it！Staffs are nice and cash only.", "author": "Viki C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Not only was the food good at this place, but it was a unique experience as well. I was drawn in by the ducks in the window. I saw them and had to try it. When I went I was by myself. I was seated at a big table with other lone diners. That made it fun. They brought me very hot, perfect tea. I had a bowl of wonton soup that was hot and delicious. I also had the duck rice plate. It was huge and tasted good too. The rice plates are very reasonably priced, especially for the mountain of food they are. It was fun to sit with the locals and see what everyone was getting.\nThere was a counter where you could order all kinds of roasted meats and unique items. There were also tanks at the back with big live fish and turtles. \nI felt like I really found a local jewel in this place.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Authentic Chinese/Cantonese cuisine. Large portions, great deals and clean establishment. I absolutely love their three dishes for $20 special. I ordered the following and it was more than enough to feed four adults. The meal also comes with a complimentary soup as well. \n\nFried chicken: plump chicken, crispy skin and very moist. \n\nBlack bean clams: clams galore! More clams than the actual shells. Oh my! \n\nFried flounder: crispy deliciousness paired with an amazing sauce. Mix that sauce with white rice and you are set.\n\nCASH ONLY", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I'm laughing all the way to the BANK thanks to Yee's. \n\nYee's is where you can find authentic Chinese/Cantonese food that won't burn a hole in your wallet. No need to waste time looking for any other Chinese/Cantonese cuisine restaurant in Chinatown; just come to Yee's. \n\nMust try: \nSalt and Pepper Pork Chop\nRoast Duck Won Ton Soup\n\nThey're also very generous with the portions and I almost always have leftovers for another meal. \n\nCash only - you guessed it.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "We stumbled upon Yee's and we were so happy we did! The food was amazing and authentically Chinese! The prices were perfect! Thank you!! We will be back!!", "author": "Mrs. Diane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Been here twice now and has not disappointed!  Love the roast goose! Wish we could get this dish in LA or OC!", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "In the Chinatown area, this is my go to spot for barbecued meat. I've eaten in and done takeout a number of times. If it's your first time at the restaurant & you don't know what to order, go for the barbecued meat section of the menu. The barbecued pork (char siu), roast pork, & duck are all delicious. It's pretty packed during lunch time but the food comes out quickly. Cash only.", "author": "Ruby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Love the 23 menu, you choose 3 dishes and included house soup of the day.\nDefinitely stopping by again.", "author": "Maria H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-29", "description": "Huge disappointment. After reading reviews and seeing this place serves goose I came here to try it out. Had the goose and rice plate and got about 10 pieces of goose. Decent amount of meat until I picked it up. Mostly bones and it was super gamey. I love having sauce on my rice, but I wasnt able to eat the rice that had sauce it in. The goose was tough and hard to pull off whatever meat it had. The complimentary soup that came was good.", "author": "Henry T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "The only place I SF we go to for Chinese food until today...just finished a nice lunch with my husband, paid for our meal, started gathering our things and were discussing how much of a tip to leave on the table when we were approached by a waiter telling us the bill did not include the tip and that we needed to give him $3.00, less than we anticipated leaving.. he was rude and loud and didn't give us a chance to make the decision ourselves.. well guess what??? You're gonna get loud and tell me what I HAVE to do? We walked out all the while he was  getting louder.. as far as I know tipping is OPTIONAL mr!  If you had kept your mouth shut you would have had your tip.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-09", "description": "TL;DR - Do you like a serving of second hand smoke while you eat? If so, this could be the place for you.\n\nI know chinese restaurants are not known for amazing service or gourmet quality food... but this place kinda lacked everything. \n\nThe food was overly salty. The service was abysmal. The inside felt sticky and gross. \n\nBut the biggest kicker was the fact that if you're sitting inside, you can breathe in that amazing second hand smoke from the 10 or so old asian guys smoking outside. \n\nPass. Hard pass.", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-16", "description": "Eating here after a golf practice on Sunday, \nI ordered a wonton soup and beef, brocolis noodles. The soup was not bad but not more to say. The noodles are crispy as I wanted, beef is tender but they don't give me broccolis but long vegetables not cut ! Sauce is just an usual Chinese sauce.\nFor me this restaurant was the souvenir to be glad to see in front of my table, a family with 3 children giving hands for blessing their meal. Yeah, for me it's the first time to see this and not watching this on TV ! Children - 2 years old, ten years old - were quiet, not disturbing a lot the restaurant.", "author": "Marie-Claire L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-16", "description": "Had the standard BBQ combo plate with duck and BBQ pork. Price was fair. Flavors were legit. Portion was fine, although could have had more meat and less rice. Overall, not shabby.", "author": "Yu Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "We parked in Chinatown after visiting the Mammal Center and Bonita lighthouse.  The traffic was crazy but we found a spot in front of Yee's Restaurant.  We first walked up and down Grant Street but then decided that this was the best option.  My dad and mom did the ordering for us and we made some good choices of seafood hot pot as well as beef and chinese broccoli.  Price was very reasonable and food was hot at our table.  Overall, we were happy with our choices but the traffic can be tough to beat for prime parking spot.", "author": "Phillip Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Having BBQ goose here is the main reason to come to SF from LA! I love it! It's the taste from my home town! The servers are very nice, too!", "author": "Jamie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "Typical chaotic Cantonese BBQ restaurant. I actually enjoyed my food here. Best thing I had was the wonton noodle soup. The noodles weren't the best quality, but it was passable.\n\nMy dad (decades of cooking experience) thinks some of the flavors were a little off, but nothing egregious. Stir-fried clams were a deal, but they were loaded with sand. Roast duck was okay. \n\nService was about what you'd expect, but there's still a method to the madness.", "author": "Warren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "Service - 3 stars.  Quick and efficient but not rude\n\nFood - 4 stars. Authentic Cantonese staples. We ordered the pork and preserved egg porridge, wonton and char sui noodles, and a double roasted meat platter. We are pleased with the generous portion size.  The tea is meh but you don't come to a place like this for its tea.\n\nCleanliness - 3 stars. Clean enough but floor feels grease and bathroom is less desirable.", "author": "PK L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "Our lunch looked like pig glop and didn't taste much better.\n\nNormally when I got out with my pal at PG&E, we go to Broadway Dim Sum.  But they were doing remodeling and were in hurry as my pal had a 1 PM meeting.  We walked down Grant Street and came across Yee's.\n\nWe were seated right away by a man who looked like a manager type.  We ordered the 2 lunch specials ($9.25).  That was our mistake as we didn't try any of the bbq items or what the Chinese contractors around us were eating.  The plate consisted of sweet and sour pork, a fried chicken leg, fried rice, chow mein, and some non-descript vegetables which may be Napa cabbage.  The order came quickly, but the presentation was poor.  I've worked in many restaurants when I was younger as a dishwasher and scrapped many plates of food into the garbage.  Our meal looked like it was scooped out of the trash can.  \n\nWe asked our waiter/manager twice for the bill, but he took his time.  When I have him a $20 bill for the tab, he never returned with the change.  I suppose he thought he would keep it.  Since the $1.50 change wasn't that much we left additional monies for a tip.  But then again, we thought they were presumptuous and took back our monies and left the place.\n\nWith a health score of 68, the poor presentation and service, and so-so taste, it is unlikely that we will return here.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "I wouldn't consider this a tourist destination nor a place to bring new friends. The only thing you'll impress them with is the authentic  cooking geared towards locals with light wallets. If it's not on the menu they can make anything you want. It's noisy and service can be abrupt and or nonexistent at times. Face it, it's a local dive and it wears the moniker proudly, they're not trying to impress anyone. It's good food for a good price, and they do it well.", "author": "Gary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "Price is reasonable and food is good. We ordered the special 3 dishes and soup of the day for $20.99 back in summer last year when we visited SF. We also ordered yellow watermelon juice which was very refreshing.  We went back again another day too.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Ok, so I'm not really into Chinese food because most of it is Americanized and expensive. This place surprised me, it was very authentic tasting and good prices. I wish we had more Chinese restaurants like this. I guess if we are craving Chinese we'll just have to go an hour to China Town. Nothing near home can compete.", "author": "Buenafe S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "Terrible. Food was plain. Service was rude. The restaurant was dirty. I would not recommend.bad", "author": "Kc N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "Solid Cantonese joint in Chinatown that does 3 big entrees for $22. None of their bbq items are on there though.  We've only gone for lunch time, so I'm not sure if the deal works for dinner. It's served with a big bowl of plain chicken or pork bone soup and rice. I usually go with 2 of my other coworkers and we each choose a dish. The entrees aren't your small lunch special plates, they're giant heaping plates of whatever you're ordering, so worth it! \n\nOur favorites:\n\nSeafood and tofu clay plot\nSalt and pepper spare ribs\n\nDefinitely one of the grungy Chinese places in Chinatown, but such a great deal!  Cash only.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-11", "description": "I normally often go in here with my family before and we do really like the food in here, however, since I got busy, I barely come in here to hang out with my family. The instance happened to me was the staff was so arrogant and he even trynna' raise his voice towards me just because I dont get what he was saying at first. Then when we done with our order, he went to the kitchen and seems like he was talking shit about me/us because when he started talking to his co-workers, they all looked at us.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Chow mien Noodles have a really nice smoky flavor. They are thinner similar to the wonton noodles. Came in as one and sat at a table with no condiments or chopsticks. They just gave a fork and a napkin. They also serve a complimentary hot tea. Portion is pretty big. Around 8pm now and there is no bbq item available :(", "author": "Stacey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "I've been coming here since 2010 and it's hit or miss.\n\nThe consistent things to get are the barbqued duck, and white chicken bak cheet guy with ginger and scallion sauce\n\nThe chow mein and chow fun are good here portions are huge\n\nSweet and sour ribs are consistent\nFish filet with tender greens are good here\nCurry chow fun without bell peppers is also good here.\n\nThey do off the menu items to if you call them ahead of time .\n\nI was here once and had a chicken and black bean sauce rice dish and the chicken tasted weird other than that experience it's been consistent . This place has large portions and is fairly priced !!", "author": "DOM d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-06", "description": "Came in with the fam after shopping around Chinatown last week. There's no greeting or sitting us down so we gotta find an empty table ourselves. Food was okay ain't that all great. \n\nI only saw 2 or maybe 3 servers. There isn't a particular server than covers certain tables so you gotta hunt one down/get their attention. So all in all service ain't all that great. Then we asked for our bill. \n\nSo one would assume it's normal to expect crappy tip (or lack thereof) for crappy service. I am NOT joking when the lady handed our bill (still on her hands), stood there waiting WHILE we count our money!!!! Who does that $hit unless the customer wants you to wait there (place is cash only ugh).\n\nService is already crappy yet she has the decency to ask for more tips??!! Listen, I'll gladly give you a tip (of advice): TIPS ARE OPTIONAL NOT MANDATORY!!!!! You're lucky that we even tip at all!  That made me so argh! Ugh seriously?! I should've took back the tips instead!\n\nI would rather have personally tipped the guy server with classes who somewhat seated us and prompt service instead of her.\n\nBtw, the deli workers don't wash their hands after handling money. Bad hygiene and def unsanitary! Bleh! And make sure to double check your itemized bill because the way I saw ours really looks illegible. Double check it!\n \nFellow Yelpers, you are warned of this bad greedy practice and my experience with that waitress!!!", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-27", "description": "A lot of food for the money on the main tourist street in Chinatown, but by Broadway, not near the curio shops.\n\nThis place gets crowded but the food is mediocre. Many dishes are salty, without enough seasoning.  Very popular with people from Asia.\n\nChinese barbecue and deep fried foods are the strong suits.\n\nGood place for college aged men who like large portions for low prices.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "Overall this place was interesting. Your usual Chinese dine in or take out type of restaurant where you go seat yourself and the waiter comes moments later. The food was bounce passed to the table and it arrived fast. I ordered the two types of meats (Roasted Pork and duck) over rice and cabbage and it was pretty good. The pork has a good ratio of meat, fat and that super crispy skin! The duck was good but not as much meat and kind of dry. Both of the meat portions were given a decent amount. I would most likely come back again!", "author": "Devin T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-29", "description": "Perfectly average but decent Cantonese food along the main road in Chinatown. I was overwhelmed by just how many restaurants there were to choose from in SF Chinatown, but I decided on this one because of the tempting barbecued and roast meats hanging in the front window, the decent reviews, and the really cheap prices. We were quickly shown a seat inside and eventually caught the eye of someone who would take our order. Service is definitely not their strong point, but I wasn't expecting much for a Chinatown restaurant to start with, so eh. \n\nMy boyfriend and I split a two-meat combo plate of barbecued pork and roast duck, as well as the pan-fried noodles with seafood. I grew up eating pan-fried noodles with seafood at my favorite local Chinese restaurant, so this brought back fond memories, though I have to admit the fried noodles in their rendition were on the greasy side and the seafood sauce on top was pretty bland. My boyfriend didn't like it at all, but it was also his first time having this particular dish. We were satisfied with the amount of seafood in it though, and all of it was cooked well. The barbecued pork and roast duck were both delicious but very fatty compared to what I'm used to. Also, some pieces that had been sitting on the bottom in the salty greasy sauce they poured on top ended up being too salty, and by the end of our meal, it was just too much.  \n\nAll in all, I think we paid something like $15 total for our meal, not including tax + tip (can't remember anymore). Really cheap considering these were two plates full of food, and we had plenty of leftovers to take home. If you have more people, the 3 dishes for $20 deal is a real steal, but the menu for that doesn't include any bbq/roast meats, and that was what I was really there for. The inside is your typical Chinatown dump, but it seemed clean enough. The health score of 65 is a little concerning, but I didn't get sick from eating here, so I guess I won that game of Russian roulette. This place got packed around dinner-time, so it seems to be popular with the locals. It's nothing to travel out of your way for, but if you're hungry and want a quick, cheap, decent meal, this isn't a bad choice.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Accessibility (Parking / Wait Time)\n\n1/1 Star: \n\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n1/1 Star: \n\n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n3/3 Stars: \n\n_____\n\nOverall Experience\n\n5/5 Stars \n\n_____\n\nLast Words\nGreat place to eat in or take out", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-10", "description": "Stumbled in here on a rainy day and sat down at a communal table for a quick bite.  I ordered the lunch combo and it was alright, nothing to write home about. But upon finishing, I noticed that their health card was posted right next to me. According to the health dept. they scored an 83 out of 100 and so far I am not sick. Stay tuned folks\n\nUpdate:  I did not get sick!", "author": "Ricardo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "We were brought to this restaurant by an elderly gentleman that insisted this was authentic Chinese food.  He said to notice the Chinese eating at the restaurant, and that is how you would know it was authentic Chinese.  It was packed with a lot of Chinese people.  We just weren't that impressed with the food.\n\n We ordered the Kung Pao chicken, sweet and sour chicken, noodles, shrimp with veggies, and some sliced pork.  Tea was brought to the table right away which was great.  The best things we ordered were the sweet and sour chicken and Kung Pao chicken.  The noodles were horrible.  They were super rubbery and hard to eat.\n\nThe food was brought super fast and the waitress was very friendly.  The prices were very cheap, but the food wasn't anything to write home about.", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Like others have said, VERY authentic Cantonese restaurant!! It's loud, crowded, tables and chairs are plain/basic, lacks \"Western\" customer service, you order & get your meal FAST (they want you IN and OUT fast!), there's meat hanging at the window, bathrooms are at the back so you have to walk through kitchen where they wash, all space is used up... AUTHENTIC!! Chinese people do not put effort into ambiance, customer service, and stuff Westerner's care about; and that's what makes it absolutely amazing!\n\nFood is fantastic!!! If you want truly yummy Chinese food, not overpriced \"Westernized Chinese\" food, and generous portions, come here. Their prices are also appropriately set, you won't go broke after a well proportioned meal. [Tip: get the 3 dishes for a set price (I forget the price, around $23) it's the best deal]\n\nGive this place a try, don't be shy!! As a take home, get their Sticky Rice Dumplings for $2-3, amazing breakfast!!!", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "I used to come here ALL THE TIME with my god-grandma and family. Food was tasty and super cheap. A lot of favs under the 3 for $20 menu including salted fish eggplant claypot. YUM. My mom ordered a small roast pig from here for my wedding reception. It was really good. The meat was flavorful unlike much roast pig where the skin is good but the meat is bland. \n\nThe roast pig and 1-2 entrees that supplemented the other food at the reception fed 120 people for $200. The other bbq/roasted items are good. We always took home a few zhong (sticky rice in banana leaf) for the week. \n\nIt's a Chinese restaurant so it's great for large groups and causing a ruckus. The English menu is the same as the Chinese menu, however they have more offerings in Chinese.\n\nCome here if you can navigate a dirty cheapo Chinese restaurant that belongs on Stockton, not on Grant. I've seen many non-Chinese people come through here and happily gorge.", "author": "Rena J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "The food is authentic and delicious. Go with an appetite! My friend and I left with extremely full stomachs for under $20. \nYou can go ahead and sit yourself. There is a cooler for drinks against the wall. Feel free to help yourself to drinks; you don't have to wait for a waiter to bring it to you. They do provide complimentary hot tea -which is also delicious: and free sliced oranges for dessert. \nI ordered beef wonton noodle soup-so good. I left stuffed and I couldn't even finish it; and I made it a point to go with hunger. The broth was also delicious which I think was the star of the meal that gave everything flavor. \nIt is spacious and can accommodate parties of 6 as well.", "author": "Ara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-14", "description": "Very authentic Hong Kong style Cantonese food and service - Efficient, taste good and make you full at a very reasonable price.\nTheir barbecued meat is tasty and not greesy (I tried duck and soy sauce chicken). Generous portion for dishes.\nTo my surprise, there are complimentary soup and orange. The soup itself will not be very impressive, but it is a very traditional practice in HK style Cantonese BBQ restaurant. These two already worth my tips!\nThe restaurant is quite busy so it would be good to eat quick and return the table. If you would like to have a good seating and good service, it would not be an ideal place for you. If you are looking for a quick eat and authentic Cantonese food, here would be a good choice.\nFor hygienic concerns, I don't see a problem. The restroom is acceptably clean, no incensts were seen and I didn't feel unwell after eating.", "author": "Shirley K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-07", "description": "Nothing extraordinary about this place, but it's a decent bang for your buck.\n\nWe ordered 3 entrees & received a complimentary large bowl of soup. Mostly liquid/ broth, but eh, it was complimentary. \n\nLike most Chinese restaurants, you'll have to ask repeatedly for more water, tea, utensils etc. The service is average. We came around lunch time, so it was packed & expectedly noisy. \n\nI also ordered a bunch of stuff to go. I asked for \"Garlic crab\" & the wait took about 20-25 minutes. I double checked the box, and found a crab over rice, with a bunch of curry. It turns out that they thought I said \"'Gālí' crab\"......which means \"curry\" in Chinese. Language / enunciation fail. \n\nSo, I guess it would be helpful to have someone who knows how to speak Chinese with you.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-17", "description": "Not much I could talk about this place since I came here for an umpteenth time with my family.  Just one of the very useful Chinese restaurants for lunchtime.  There are times when I start having lunch with my wife at 3pm.  I used to like fried calamari; that's one of my favorite appetizers.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "One of the best restaurants in Chinatown. The servers/owners are soooo friendly and make the best food for a really good price. Don't go to any bougie restaurants downtown when you could find a place like this where the meal plates are $9.", "author": "Calvin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "We have been to this place twice. Why? It's hidden in Chinatown and you come across it when you least expect it. The first time we were here was when it was the four of us. My dad, my brother when he was just a child, my mom and I. It's been nearly 20 years and we made a return. Unfortunately my dad is not around to enjoy the wondeful cuisine provided by this place. He's with God. God Bless. So in honor of him, I do this review. I would recommend this place for anyone looking to eat some quality Chinese food. It was our last day in S.F. and what to eat for dinner. Well, how about the place we dined here almost 20 years ago. Well, we came here by chance. We were strolling through chinatown and came across here. This is where we dined during our last night in S.F. on 2nd of Jan, 2017. Just come by and order the 3 dishes for  XX amount of dollars. They have the promotion where you order 3 dishes, you pay a certain price. of course we were hungry so we ordered 6 dishes. Soup is complimentary. We ate the Seafood tofu pot, Fish with bok choy, and some other dishes. The food is great. It's not your 5 star type restaurant, but it's definitely a family restaurant. The prices of the food is cheap, but the taste of the food is definitely good. During the day, there's a line outside waiting to get the BBQ food. They must be doing something right.", "author": "Arthur W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "great deal on the take away - choose 3 dishes for $6.5 and 4 dishes for $8. afternoon special -\n 3 dishes for $6.\nwe bought 4 dishes for $8 - lotus root vege, lo-duck, BBQ pork and crispy roasted pork. All tasted great and reasonably bg portion ! will surely come back again.", "author": "Joyce T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Don't be frightened by the roast duck and bbq pork hanging in the window.  My first time here I watched a group of tourist pointing towards the duck hanging in the window before scurrying off into the night.\n\nThis visit I tried the yang chow fried rice.  The bbq pork was very good but this dish was too salty and not very good.  I also had the zongzi/Chinese tamale.  It was not very good as there were too many peanuts and that was the main flavor to the dish.\n\nFrom another visit:\nI ordered half a roast duck for $8 and bbq pork pan fried noodles for $6.  The roast duck was awesome!  Nice crispy skin with awesome flavor.  The meat was tender and delicious.  This is one of the best plates of roast duck I have ever had!  The pan fried noodles were very good.  This dish is similar to bbq pork chow mein dry style from Hong Kong bbq.\n\nFrom a previous trip:\nI tried the 3 dishes for $18 deal.  I picked mongolian beef, peking spareribs, and the salt and pepper wings.  The mongolian beef was tender, had good flavor, and a little kick to it.  The peking spareribs had a nice crust and tasty sauce drizzled on them.  This was my fav dish of the three.  The salt and pepper wings tasted like they may have been marinated in soy sauce before frying.  Very tasty.  This was alot of food with the addition of white rice and more than we could finish.  The only disappointing thing here is the tea.  I'm really picky about tea and I'm willing to pay for good loose leaf tea.  This tea was a real generic prebewed stuff that was sitting around in a warmer.\n\nOverall the bbq meats are awesome here but the other dishes are a bit off.  This place has great bang for the buck but you will find more refined non bbq meat dishes at places like Great Eastern.", "author": "Soo H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "An ok chinese bbq shop in c-town\n\nVisitors to c-town will likely have walked by this place at least once or twice. The prominent location means that I've walked past this place numerous times, but this is the first time I went in. I ordered the main dish (bbq pork with rice), and the portions are Huge! One dish of rice can last me 2 meals, and as expected the price is very reasonable.\n\nIn terms of decor, the inside is definitely not one of the nicest, but it does look like the place has seen its fair share of history and stood the test of time.\n\nOverall, a not bad place to visit for chinese bbq.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "After an adventurous day of walking all over Chinatown my fiancé wanted a whole duck from somewhere that had them in the window. We walked in and were seated right away. We ordered the whole duck, combination fried rice, combination chow mien, and Kung pao chicken. When we ordered the server recommended that we move to a bigger table because it was going to be a lot of food and it was! All the food was good but the duck and the chow mien were AMAZING. And even better the bill was less then $50! We ate so much food and still had leftovers for 2 days. This place is awesome and we will definitely be back next time we're in Chinatown.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "we have been here twice with some friends for dinner it is pretty good and they give you a good amount .they have specials 3 plates for $25 I think .on a set menu. but they do have other items also.I use to come here for the sweet & sour pork and afternoon specials which was good too. i'm sure we will be back.", "author": "Nellie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "This place is good for a home cooked Cantonese meal. We had the tofu chicken /salty fish, bock Choy w/cod fillet & seafood tofu dish.", "author": "Rowland W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-09", "description": "We were told to visit this place prior to visiting Chinatown in San Fran.  I suppose Yee's has been around for quite sometimes and the older generation seems to know a lot about them.  There is even a counterfeit restaurant with similar Chinese name around the corner on Broadway St.\n\nOne of their specialties here was the so-called Cantonese Roast Goose, and they were probably the only place that served them around here.  However, our traveling companion who is also a Chinese BBQ expert informed us that the goose was really a larger breed of duck with the beak trimmed off, and then they jacked up the price to like $20ish each, while duck was have sold for half as much.  Not off to a good start.\n\nRegardless, we tried some of their dishes.  The house veggie was ok.  Char Siu was a bit disappointing with an amateur usage of all part of the pig, but flavor was ok. House Noodles looked like a big mess, but it tasted ok though.  Their Roasted Duck was decent with crisp skin.  Soy Chicken was good as well.  We got the Sturgeon Deluxe, which came in a stir-fried dish and another cooked in soup.  The fish was a bit small though and the soup was not very good.\n\nI really want to like these traditional old town Chinese joint, they definitely has a lot of rich culture touch to them.  However, when they got questionable business practices and integrity like selling ducks pretending to be goose, it really got me thinking about the rest of things they sell.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-06", "description": "This restaurant is rated the worst ever for me, worst service, worst food and cashier asked for tips when handed me the changes", "author": "Harley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "One of the best Chinese food restaurants in Chinatown. The thing with this area is you gotta weed out the restaurants that are just purely attracting tourists and the ones that have genuine good authentic Chinese food \n\nThis is good authentic Chinese food served \"dirty and plentiful yet delicious\" if you know what I mean\n\nThey give generous proportions for all dishes and all dishes are GOOD \n\nThis restaurant is also alot bigger than others too in tiny cramped Chinatown and this allows alot of comfortable space inside to sit with Alot of big sized family tables \n\nThis is also a half served restaurant and also a small section that allowed you to order food and take out. They have trays and trays of heaping chicken and duck and everything that you can order to take out\n\nTheir menu is huge and is pretty much like a legit Chinese restaurant that has almost everything \n\nGreat place for family, friends, kids", "author": "Cuc N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "I found the ambiance fascinating with the meat cleavers flailing about and the roast meat hanging in the window. Grungy place so it's not surprising the health inspector wasn't happy recently. Had two Chinese beers and a generous bowl of See Sum Fun soup which is just chicken noodle soup with some pork thrown in for $13.60 before tip and that includes tea. Soup was mild so I added chili sauce which they had out. Don't expect fast service because it's rather chaotic but that was the charm for me, a white guy from Wisconsin. Open tables mid-afternoon on a Sunday but it's a relatively large place. Worth a peek inside of nothing else of you haven't been to Chinatown before.", "author": "John M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "This place is my grandparents' fave restaurant, and up to this day I still don't get why.\n\nThe restrooms are very dirty. Food is pretty average Chinese food. Nothing special about it. Our last time there, there was a hair in one of the sticky rice chicken dish. Gross.\n\nMy grandparents always rave about this place, and almost always picks this one for our big family dinners. \n\nI don't think I'll be attending anymore family dinners if it's held here.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Came in the other day for dinner with a friend. They have a 3-entree + soup of the day deal for around $17, and it's a pretty good deal! (doesn't come with rice thou!)\nI ordered their honey walnut shrimp, salt pepper eggplant, and seafood/tofu pot. Portions were generous. The honey walnut shrimp is pretty standard, it was really good and has just the right amount of sauce/mayonnaise. The salt pepper eggplant has a pretty thick batter, and was too greasy for me. The seafood pot was okay. It has squid, shrimp, tofu, mushroom, and fish. This place is family friendly and has big tables. Service was quick too. It is totally recommended for a dinner with the family.", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-11", "description": "If you're  looking for cheap good Chinese food, you should go here. Aesthetically the place looks sketchy inside but you can basically see the whole kitchen from your table. They have a separate menu which you can choose 3 items for $16.99 with big portions, probably good enough for 5 people. I give this place a 3.5. A la carte items range from $5-6.50. \n\nIf you like pork, I really enjoyed the peking spare ribs. This is one of my favorite Chinese dishes. And for some green in your meal you should order bok choy with garlic. Simple but very tasty.", "author": "Thee N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Simple, authentic, and inexpensive.  Perfect place to take to take the family.  We ordered one plate each ($7-9 each) and it was way too much food.  3 plates between the 5 of us would have been more than enough.", "author": "Bob R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-14", "description": "I was reading the menu outside...\n\nWTH!  $4 won tons?!!  Unheard of in San Francisco.  You had me at $4 won tons...\n\nIronically, we didn't end up ordering the $4 won tons.  Instead, we saw a meal deal.  \n\nWTH!  3 items for $15.99?!!!  Holy crappers!  That's dirt cheap.  You had me at 3 for $15.99.  And that is what we ended up ordering.  \n\n! - Shrimp with scramble eggs - it was a shame, this is one of my favorite dishes to eat.  The scramble eggs were over cooked or wasn't cooked the way I like them.  Usually, the eggs are soft and enhanced with chives with shrimp being the dominate flavor.  \n! - Beef and Chinese broccoli - this actually came out good.  I thought the broccoli was cooked perfectly and was fresh.  \n! - Seafood claypot - I guess you can't really go wrong with seafood clay pots.  They just dump everything in and cook it in some lovely sauce and BAM!  the flavors are all there.  This claypot had shrimp, calamari, cod fish, black mushrooms and 2 types of tofu.  \n\nI thought the food was a tad salty and I ended up ordering a diet coke for burpage.  I wanted to make sure the MSG didn't hit my head right away, I think bubbly coke can prevent headaches and potential stomach aches.  Otherwise, the portions are huge, the food comes out quickly, and the service is typical to all Chinese restaurants.  Okay and can be better.\n\nNOTES: Hole in the wall decor.  I saw fresh seafood swimming in a tank, so, it might be worth a try someday...especially with 'WTH' rock bottom prices.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "I must say that reading thru numerous reviews here on this establishment, I was taken aback.\n\nUpon entering this restaurant one is greeted by specials written with black marker and scotch taped to the walls....  expectations should be set accordingly.  If you want mother of pearl inlaid rosewood panels on the wall and gold chopstick rests with attentive service you should go to Tommy Toys.....  oh THATS right.....  all the cheap asians wouldnt pay the prices they charged to support that kind of superlative service so they closed.....they now expect it at Yee's for $9.99 entrees....interesting.....  \n\nThis being said my dinner companion and I came here in the late evening on a week night.  Lengthy standard menu and a three items for $19.99 special with complimentary soup.  VERY REASONABLE INDEED!  \nAll dishes provided were large portioned, hot and fresh (the shrimp in particular were large plump and crispy-fresh in the dishes requiring them).  Vegetables were fresh and the sauces sublte and flavorful.\n\nAs for the service, it was very good indeed.  Our waiter actually acknowledged smiled and greeted us.  I must say I almost lost my footing i was so taken aback at this behavior in Chinatown in the tourist area of Grant street.  Food was brought quickly, tea was replenished often, dishes cleared efficiently, and the waiter brought me EXTRA NAPKINS WITHOUT ASKING upon seeing they might be appreciated......  need i say more....\n\nVery good experience.  I strongly recommend this establishment for an informal lunch or dinner for good food  and excellent service at a very good price", "author": "Charles S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "We have been coming for years! The fresh duck and roasted pig is something not too miss! The beer is ice cold and the service is like you were in China! If you look around and your the only white people in the place, you know the Chinese is going to be great!  The BBQ PORK served by the pound is also a great dish! Great value and a fun experience!", "author": "neal w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-28", "description": "Dirty, below average chinese food. There was no one to seat us nor anyone to take our order unless we got up and asked for them. \n\nLeft 3.5 as tip since we were not served well. Server stops us and demand for 5 saying it is required by US law lol.\n\nDefinitely not worth your time and appetite.", "author": "Xinwu Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-28", "description": "The restaurant looked decent from outside, so I was expecting to have some good food. But I was grated with some awful attitude from the server. Well, this is not my first time for this kind of situation, but I could generally stand this if the food is good. \n\nHowever, the food there tend out to be quite mediocre, or to be honest, much lower than even the average level of some Chinese fast food restaurant. So I was wondering why I had to stand the cold and unwelcome face of their waiter for this piece of shit. \n\nOk, I would probably still give them two stars if that was just it. What made me so disgusted was their attitude when I paid. Tips? Ok, I would pay you some considering you still deliver my food to my table. $3ish, not that much but definitely not little considering the poor poor service. But the waiter apparently thought I was some visitor to the States and lied that the US law demanded $5 minimum for tips. Ok if you could lie about this, I m wondering how you actually treat your food and etc. So definitely one star for this, and I strongly discourage you to try this restaurant.", "author": "Ziyi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "Yee's is one of my favorite restaurants in the world. It's a simple place where the local Chinese-American population get refueled. The food here is the star, and our favorites were the seasonal vegetables. Don't be put off by the Chinese-only writing on the walls, the menus are in English.\n\n5 stars to Yee's incredible cuisine!", "author": "ArchaeoFiero S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Dude the best walnut prawn ever. I never like that dish in my life because it is just too American for me. All other restaurants fried the shrimp like tempura. But this 1 was done perfectly not too thick and crispy. And the Mayo isn't too sweet that I would get diabetes. It is the first time I actually like it. And the ginger chicken is awesome. \nIt looks like a hole in the wall, but the food and the price is awesome.", "author": "Clement H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "This is a great place to go for some cheap, authentic Chinese food. You can tell by the low key setting and how the restaurant is always crowded and filled with Cantonese and Chinese speakers. We have been here several times, always on weekend nights, and they were always able to give us a table fairly quickly without a long wait. They have a huge and comprehensive menu, ranging from very affordable rice plates to some of the more specialty dishes. We were particularly impressed by the selection of congee they offered, which is more than we have seen at most restaurants. It's also great that they have some of the authentic Hong Kong style rotisserie meats. We have tried several congee bowls, the roast duck, crispy pork, and some other dishes. They were all delicious and and portions were very large.  The waiters were nice and efficient, and we were always happy with our dining experience there. Definitely keeping this restaurant on our list of low-key places to eat authentic Chinese food in Chinatown.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "The Cantonese Roast Goose at Yee's is excellent.\nAfter having roast goose in Hong Kong, I've been scouring North American Chinese restaurants for goose to no avail. So I was elated to discover this place on yelp. The goose here was moist, meaty, flavorful and was served in a sauce which smells pleasantly of cinnamon. Just as good as in HK.\nThe fried pigeon is, if anything, even better. Crispy and juicy, mostly boneless, it was some of the best fowl of any kind I've had. \n\nWe also ordered a serving of broccoli which was more than ample.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "I now consider Yee's Restaurant as one of my favorite go to restaurant... When I am at the San Francisco Chinatown Area!!! My most favorite rice plate that always like to order when I like sit back and relax and just forget about everything else!!! While eating my Mince Beef W/ Raw Egg Over Steam Rice!!! And I have mentioned this on my previous yelp review of Yee's Restaurant and I say it again... I have eaten at Yee's Restaurant so many many times over the years and I have never never experience any stomach aches or diarrhea when I finish eating at Yee's Restaurant...", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "We were in SF for 3 days and we dined here THREE TIMES!!!  We had a roast duck EVERY DAY!  That plus other fare of course!  Itis a fine establishment which was also close to our hotel... sigh.  WHat can I say?  The flavors were perfect and the staff actually cheerful and family-like with me/us!?  So... FIVE STARS!!!!", "author": "Tom G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "Crispy pork, duck, won ton soup, jook, and red pork, everything here is so \"typical Chinese\" and just unbelievably delicious. If you are looking for a really tasty Chinese restaurant in San Francisco, this is your spot. It's super casual, so it's perfect if you want to pop in by yourself for a quick bite or come in with a big group. \n\nThe won ton soup with noodles... it's just divine. It's possibly one of the best won ton soups I've ever had. Only made with the best ingredients in the tastiest hot broth. \n\nCrispy pork... that is such a treat. I'm not talking bacon here, I'm taking about a whole pig, roasted for hours where the skin is crispy crunchy and so delicious with the most delectable meat. This is no secret to the Chinese because on Chinese New Year's I saw whole pigs getting ready to be picked up or delivered. Dreaming about Yee's crispy pork and won ton soup.", "author": "Trisha W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Delicious option in Chinatown with an extensive menu featuring traditional fare.  They feature cold Tsingtao which pairs great with their spicy dishes.  Friendly, quick service and pleasant atmosphere.  Be aware that they only accept cash.", "author": "Wild J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "Good food that is fairly priced. 3 plates for $21 plus rice feeds three people. Crowded, but that is to be expected in a cheaper place where many of the locals go.  This is not for dim sum or a nice relaxing atmosphere. This is to get full on as little money as possible. Think about it, 3 dishes and soup for $21. And I'm including tax too.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "There's no denying it. I love BBQ Pork. So when I was walking down Grant in Chinatown and saw Roasted Ducks and Pigs through Yee's Restaurant's front window, nothing could stop me from walking in.\n\nSo I picked up half a pound of BBQ Pork, grabbed some toothpicks, and out I went. Yum! Nothing like sightseeing with a box of BBQ Pork in my hands. I do have to say while I really liked the flavor of the marinade, some of it was a bit fatty which I don't like too much. Whatever. BBQ Pork!", "author": "Ray I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-08", "description": "PLEASE DO NOT GO HERE. I REPEAT: DO NOT GO HERE.\n\nMy boyfriend has severe food poisoning and has been throwing up the past 2 hours since consuming the roasted goose from here. I only had 1 piece and am feeling okay, but he has been nauseated ever since. I had my suspicions about this place because when we walked in, they were handling the meats with their hands AFTER handling money exchanges with customers. Disgusting. Unsanitary. This place has been marked on Yelp as having a very low food safety score - yes, this should have been a tell tale sign. \n\nWhile we were there waiting for the food, the very rude butcher folks screamed at a woman in a Cantonese to get the he,k out of their restaurant because she didn't have money. The butcher woman with the short hair (looks like other Yelpers have reported her rudeness and not letting people out of the restaurant until they have tipped her) - it is the same woman who was screaming at the other older woman to get out of the restaurant.\n\nEat here at your own risk. \n\nI will be locating the SF food inspection website to alert them of this unsanitary restaurant. I beg of you, do not eat here.", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "I stumbled in here one evening after a North Beach pub crawl, and although I only stopped in to soak up the booze, I immediately fell in love with this place before I ever walked through the doors. For me, authenticity is a big part of my cultural dining experiences, I hate chain restaurants (for the most part), and yuppie twists on traditional dishes, which worked in my favor here, because this place bleeds authentic Cantonese fare. As soon as you approach this place, all your senses start working in unison with one another;faster and faster as you quickly become enveloped in this world of deliciousness. your eyes are immediately drawn to the beautifully roasted pork and poultry items hanging in the window and as you make your way further into the restaurant; you can see even more delicious  slow roasted items being sliced and sold per pound. \n   The scents that travel through the air in this restaurant are magnificent enough to lift you off your feet, I can't say that any one scent is more recognizable than the others, but I can say that the collective culmination of all these together; will have your nose begging for more. Once you taste the food, everything will start to make sense, you will see just exactly why this place is always busy. I literally love every item here, but the chicken chow mein is always a favorite of mine, it's always made to order, seasoned/prepared well, and very filling. Also, I like that they use thin noodles as opposed to thicker ones like many places around. Be sure to also try the pigeon, it's got an excellent flavor and about half as much grease/oil as the duck.", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "Like many Chinatown restaurants, it ain't fancy looking but Yee's Restaurant offers family style dinner (3 dishes, rice, and soup) for under $20 as well as a plethora of roast meats that are the subject of many tourists' photos on Grant Street. \n\nI've only eaten in once and I had the beef brisket wonton noodle soup. Adequately sized but I wished the bowl was bigger so I could have more soup. I was obviously hungover. All in all decent but nothing spectacular.\n\n Take-out is where it's at.\n\nThe big news here and my big tip... much of their roast meats and dishes go on sale around 3ish-4 in the afternoon. It's a popular deal with the elderly locals so you know it's got cred. Single plates for $2.25 or three for $6. I typically pick between the soy sauce chicken, roast pork, bbq pork, fried chicken but there are quite a few other choices. Point and choose and you're got quite the variety for dinner at home.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Filled with locals celebrating birthdays, the food was tasty, seemed fresh and well prepared, and tasted great!  We were looking for a good local Chinese restaurant and I think we found it.", "author": "Jay J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "We ate here in a couples trip last year lured in by the ducks hanging in the window.  \n\nThis year came back with the kids on a family trip.  Grabbed a duck and some pork to go this time and couldn't be more happy.  Love love love the duck.  Skin is crispy and meat is tender!", "author": "Anita A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "I really liked this restaurant. The food is cheap and absolutely authentic.\n\nI normally have high standards for Chinese food and let me say that this place did not disappoint. It is also super cheap - when can you find such cheap Chinese food (for both lunch and dinner prices) in Seattle? Walking around Chinatown in San Francisco made me very upset - majority of the Chinese restaurants have super cheap dishes there!\n\nMy friend and I had the 3-dish special for $16.99 and the food was delicious. The portion is huge and my friend and I could barely finish half of the food we ordered (NO KIDDING). It also came with a complimentary Chinese soup dish - I am not sure what the name of the soup dish was but the soup was tasty. For the 3-dish special thing, I had to order rice as a side dish for $1 per bowl - but the amount was huge! \n\nI think I can understand how other yelpers would give such low ratings because of bad services. I normally really look into services as well. But (fortunately?) the services were not particularly bad during my visit and I would come back again.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-15", "description": "Wandering around chinatown and found this place. Ordered roasted duck - 80% of the duck they gave us was fat and bones. Skin wasn't crispy. Also ordered fried squid, too much batter, too greasy. \n\nBeef brisket noodle was alright, probably the healthiest thing we ordered haha. \n\nOverall, the restaurant wasn't very sanitary, they had a bunch of little plates sitting out for their 3-5pm afternoon special. The special is a very good deal, but it's just not sure if I would want to eat that. \n\nI wasn't expecting much out if this place so 3 stars is sufficient.", "author": "ChingWa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Nice staff! Great food selection if you like  authentic Chinese cuisine. BBQ pork is to die for!!", "author": "Nate E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "In two short trips to SF, I've found Chinatown to be right up my alley. I was hobbling on one foot, having sprained an ankle, but my wife and I weren't going to stop until we found some barbecue pork.\n\nWe ordered some chinese broccoli with oyster sauce, barbecue pork, and roast duck. Portions were huge, the meal was cheap, and we got exactly what we came for. The veggies are not to be skipped. Order that broccoli!\n\nThe duck and the bbq pork were both excellent, and served over some cabbage with rice. I wish I could bring this place back home.", "author": "Dylan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-15", "description": "While the health score of 83 does not instil confidence, this little hole in the wall hit the right spot for a couple young starving folks.", "author": "Drew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-09", "description": "It's in Chinatown +\n\nThey all sqawked some Cantonese dialect +\n\nBBQ meats hanging in the window +\n\nEqually as clean as an equivalent in Vancouver, meaning dirty floors and kinda filthy looking = \n\nAUTHENTIC.\n\nSo I stroll in.  Ordered chicken chow mein for my daughter and curry beef brisket.  Also came with the standard soup of the day like at most Chinese eateries.\n\nSoup.  It was some kind of melon soup, with pork and nuts.  Bland as F.U.C.ing hell.  There was no flavour in this at all.\n\nChicken chow mein\nhttp://www.yelp.ca/biz_photos/yees-restaurant-san-francisco?select=tLAMpmsmiDO6PBn_OhBFtg#BBWhy2iWi2LADicmzqIwcA\nThis was not good either.  It was prepared in a similar manner to food court chow mein.  I did the ordering in Canto.  I have no idea how I ended up with this plate prepared in this style.  Didn't matter to my daughter, she ate it.\n\nCurry beef brisket.\nhttp://www.yelp.ca/biz_photos/yees-restaurant-san-francisco#oWyURDE-mEI86THVI4fYdA\nThis was actually quite good.  The spicing in the curry was quite flavourful and had a nice amount of heat, but not overwhelming.  I would come back for this dish.", "author": "Herman E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-25", "description": "Call this the hidden gem of mom and pop Chinese food restaurant.  Nestled in historic Chinatown is Yee's Restaurant.  From the outside, this place looks like a dirty, dirty dive place.  A place where you mother would advice you not to enter since it does not look clean.  However, if you can escape that stereotype, Yee's restaurant serves excellent food.  \n\nMy friends did the ordering since I do not speak Chinese (bad Asian).  We ordered Chinese cabbage, a noodle dish and goose.  Yes, I said goose.  What does goose taste like?  It taste like duck, but not as fatty.  I can review the other dishes we ordered but the goose was the absolute winner.  Juicy and tender and not fatty.  I could order a whole goose for myself and not share it with my friends.  And, guess what?  It wasn't that expensive.  \n\nAs for the ambiance and décor, it is a dive restaurant.  I did wipe my tableware with my napkin (force of habit). The service here is good.  Our server kept coming around to check on us.\n\nLike all diamonds in the rough, they are hard to find.  But, when you find one, you know you found an investment.", "author": "Dean N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "I'll make this short and sweet.  This place is amazing!\n\n1. Cheap prices:  This place is extremely affordable, even for the cash strapped.  Definitely a plus in San Francisco, where almost everything is expensive.\n\n2. Quality:  For the cheap prices, you get amazing food.  I had the goose noodle soup and it was delicious.  The goose itself was perfectly cooked and very tasty.  I sampled my some of the roast duck noodle soup, the chicken noodle soup, and the BBQ pork noodle soup (all with flat rice noodles) and all were amazing.  The meats here are really top notch.  \n\n3. Portion size:  For the aforementioned low prices, you get a huge amount that will leave you very, very full and satisfied.  If you get the noodle bowls, they'll give you a large amount of meat and plenty of noodles.  You will definitely leave here weighing a little more than when you entered.\n\n4.  Service isn't really anything too great honestly.  After getting our food, it took forever for them to refill our tea pot once we emptied it and raised the lid.  However, we got our food really fast, so that's what mattered to us the most.  \n\nBasically, this place is a great value, but after getting your food quickly, expect to play \"catch the waitstaff\" for anything else.", "author": "Christine W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-10", "description": "3 stars just because it wasn't spectacular but it wasn't awful- just average.\n\nI came here with family before noontime so it wasn't busy at all, only a couple other tables were occupied. I ordered the roasted duck wonton noodle soup and for the portion, the price was pretty good. For about $7-8 you get a full bowl of about 5 wontons and a whole lot of roast duck which was pretty tasty. \n\nHowever, above all, it's not something I would rave about, just something mediocre if you need a quick wonton noodle soup fix or just noodles. It's pretty cheap so I mean, why not? \n\nThe workers were nice and the food came out fairly quickly, but that might be because of the fact that it wasn't busy.", "author": "Vi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Well what a great place to eat while in San Francisco.  I ate here twice in my week here. The place doesnt look like very much from the outside but the food and value for money is excellent.  Quick service and very good staff.", "author": "John N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-22", "description": "Yee's had 2 tables of roasted turkey available with pricing on them ($42, $37, $38, etc). \n\nmenu: 3 fer deals, bbq deli items, rice plates, usual chinatown menu, white board specials. \n\neats: won ton soup (4)\n-14 won tons, with lettuce in salty msg broth\nbland meat, bland crunchy shrimp\nmsg attack afterwards though i drank very little broth\n$$ value-4 stars, food value-2 stars.\n\nleftovers:\n-msg use may be heavy here.\n-good value but poor tasting\n-food took a while to show up.\n-skipping the food next time,  deli unsure...", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Wow, this place is not a romantic date spot for sure. But if you want no frills, just good chinese eats, you need to go here. Damn I will travel from Haight to North Beach to get take out from this place. Try the roast goose, roast pork, salt and pepper fish, and i  love that pork/wonton soup. Just blindfold yourself and pick something off the menu, you'll still most certainly end up with a great choice! Go Yee's", "author": "Rouz E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "At this point this place has become a family tradition. No matter where we're traveling, even if we have a day layover in SF we make it a point to dine here. Great authentic meals! Very traditional, fast paced dining and an adventure. Love this place!", "author": "Ruth J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-25", "description": "Came with my family to eat. The food was okay, but took around 30 minutes to bring 1 or 2 dishes. Then one dish hasn't came within 45 minutes, after my family told them the situation, then another 15 minutes later, they still haven't brought it. So we just told them to not cook it at all and just left. Definitely wouldn't come back to this restaurant.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-20", "description": "Food quality was average. Ordered the bbq pork rice noodle soup. Soup was oily with a few green onions sprinkled on top. Not the best but for the price it was medicore at best.", "author": "Mai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-30", "description": "My husband's grandmother lives around the area and we always walked by this place seeing those roast duck and roast pork hung behind the glass.  On this trip with my parents, we finally got to try this place.  There was this dinner special where you can order 3 items for $16.99.  With my mother in law, there were 5 adults so we ordered 6 dishes plus a roast duck.\n\nTo my surprise the dishes that came out were super huge!  We thought $16.99 for 3 items, the portion would be small but nope it was a full dinner portion.  We were saying in OC, 1 dish is probably around $12.  So $16.99 for 3 items is a steal!\n\nThe food was very tasty.  Their salted pepper wings are super tasty!  My husband's grand aunt would order 10lbs when she comes to visit SF.  They served all wings and no drummettes at all unlike some restaurants tell you chicken wings but they included the drummettes.  Their roast duck is super juicy and definitely fattening.  We also ordered a fried flounder with sauce and the fish was huge.  Everything was very good for a very good price.\n\nAround evening time, they would chop up all the roasted stuff and sell it for $2.50 per plate.  You see a lot of people come in to pick up the plate to add for dinner.  \n\nDecor wise, this place isn't like 5-star decoration but the food is really good.  I saw they have roast goose and would like to try it next time when we visit.\n\nNote: this place is cash only!\n\n-------------\nAlmost forgot to add, we tried their breakfast menu.  We had the congee and stir fry soy noodle.  Both very good and very Chinese breakfast too!", "author": "Abbe W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "It's excellent restaurant for roasted duck, pork in affordable price. The waiters are all polite and keep smiling. I had never visited a Chinese restaurant with all the people keeping a smiling faces. Not many tables there, but a lot of people buying to go order, then you know the food there is really good. \n\nThe bad, \ntoilet is not really clean. but, who cares, I am not gonna eating things inside :).", "author": "Swergar T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "We visited this restaurant in a trip to San Francisco in July 2016. We were advised by a friend that there is a place that we can eat real Chinese food and it was so. The restaurant might be in poor health but the food is what you can find in China and most of the costumers seemed Chinese. The portion of the food was large and the price was around 7 bucks for it. We ordered a bowl of sower sweet soup, a plate of noddles, and fish. I recommend the soup.", "author": "Azita R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "OMG!  If you are here in china town visiting you need this to be where you eat!  The portions are for a small army but all so good.  $18.99 will feed 6 people!", "author": "Tessa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "Went with friends for a banquet dinner. The food is solid, portions are ample and the prices are reasonable. One dish in particular was the abalone with gai lan; the abalone was sliced thin, but in rarher large pieces, the gai lan was in very large pieces about 6 inches long. This made for a little awkward eating. The BBQ items were spot on, as was the flounder/sole. The orange wedges for dessert were really sweet! Service was fairly decent. They had  sign up near the register about free parking. They offer marked down items after 5pm.", "author": "Dennis Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "Yee's makes a killer salted chicken (not really salty at all). You can 1/4 chicken, rice, streamed veggies, and great homemade house soup for $4.25++. The chicken is cooked perfectly and the breast is extremely tender. Alternatively, try the soy sauce chicken for a bit more savory flavor. This place is always packed with locals, and it can get quite busy during peak hours, but it is well worth it for the food and ambience. Another excellent lunch under5bux addition!", "author": "Brian J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "I can't tell you how the food tastes. They do not take food allergies seriously. I asked the waiter to ask the chef if the food that I am allergic to was in the food I ordered.  He said he didn't think so. I told him I need to know so I don't get ill. He wouldn't ask. I got up and left.", "author": "Micah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Was craving some slimy chow fun with beef and veggies for the past couple of days and found this place on Yelp. Also got a char siu rice with veggies for my husband. Char siu was fatty, tender, and sweet, with just the right amount of crunchiness at the charred ends. Chow fun was slimy - could've been a little more veggie-heavy but still satisfying. Their chicken thighs in the window looked amazing - I would try that next time, plus they have a lot of seafood dishes written on the wall in Chinese. For $13 including the complementary soup, this place is pretty great. If you want fancy bathrooms, try Crystal Jade.", "author": "Andrea P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "Food is the real deal        fresh hot and good          service was quick        bathroom wasnt pretty but who cares      id eat here 4x a week if i lived here", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "What a memorable evening. We combined a great Chinese banquet dinner with the SF Giants winning Game 3 of the World Series during our dining experience. After the Giants win, our table cheered the loudest. Our foodie friend organized a group of us comprising of eleven individuals for this great meal.\n\nThe showcase featured a suckling pig. It was roasted perfectly.  Tender pork morsels with very crispy pork skin.  The pig was cut into bite size pieces and pieced back together.\n\nThe restaurant paced it so that we could enjoy the pig at a leisurely pace.  The our other dishes came out accordingly.\n\nThe other highlight dish was the quail.  As with other fowl, usually the head and the tail is kept and served.  This quail was deep fried and presented whole with the head attached.  That's a first for me.  The quail was very moist.  \n\nWe had a total of eight courses and all were scrumptious.  \n\nWhat the restaurant lacked in ambiance it made up for with the food.  Maybe it helped that my foodie friend is a regular here.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "Whenever I'm in S.F., I never know a good Chinese place to eat at.  I happened upon this place, looked at the menu, and peeked inside.  \n\nI just felt like a bowl of won ton soup with noodles and cha shu.  For $5, it was such a big bowl with a good broth, an adequate number of won tons, plenty of noodles, some napa, and a very generous portion of cha shu slices on top.  What a bargain!!  This is definitely a place for good and cheap eats!", "author": "Julie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "I've been coming here frequently because the food is tasty and the portions are generous.  The price is right.   The negatives are:  the service--inattentive and slow if you take too long to decide what you want --it seems to throw a kink into their assembly line service.  If you're not ready to order, they go away and forget about you until you have to flag them down.  No checking in on you, no refilling of tea or water.  And forget about ordering take out!!  If you call in your order and say you'll be picking up in half an hour and they respond, yes it'll be ready.  Come by, 40 min later and they STILL have to COOK part of the order.  What's up with that??  I spent 15 minutes waiting, double parked, for a pick up ordered almost an hour ago.  I would have better luck coming in to eat.  This has happened twice before when ordering takeout.  They make you wait as if they weren't sure you were going to show up so the chef gets the order only when you come in to pay.\nWhy give a time frame for pickup if you're not going to have it ready???", "author": "mizzy b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-01", "description": "When I was in college, I used to volunteer for he CNY fesitvals. The Chinese Chamber of Commerce usually treats us to lunch for our help. I remember we could order anything off the menu - for a starving college student, that's a good thing. Their chow mein and other dishes were excellent. \n\nToday, after more than 20 years, I come back here with my family for an assn lunch. This was a full 8 course meal - Peking ribs, walnut shrimp, ginger chicken, lobster and crab the works. Food portions were ginormous. Everything came out in big platters. I really loved the walnut shrimp. Not too heavy on the mayo and the nuts were crunchy!\n\nYes place is dive-y but it makes up in food. They also have a deli take out section. This is the best place to eat in C-town when you're on a budget!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Authentic Chinatown experience, and amazing cuisine!  A MUST STOP if you're in Chinatown, SF, CA.", "author": "Eyrie Jammer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "Went lunches with co-worker. Lunch time is crowded and noisy, needs to share table with others. But still going for the good number of options on the menu/wall, low price and authentic Chinese (Cantonese) dishes. They re-modeled the floor and price were not changed, surprisingly.", "author": "Tina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-05", "description": "Compare to other restaurants in Chinatown, the services here are decent.  They're actually nice.  Their portion are huge.  The prices are decent as well.  \n\nMy friend and I ordered the wonton soup, beef pan fried noodle, BBQ pork & roast duck over rice and a can soda.  All these for under $20.  \n\nThe taste wise, it was only ok but decent for the price.  I would probably come here again next time I'm in SF.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-28", "description": "The food is usually good but when my wife check out the chicken and its cleanliness she said she did not want to eat here again.  A health score of 53 confirms this so we will stay away til they clean it up.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-14", "description": "3.5 stars\n\nWow is what I said when I walked into Yee's. There was food on tables, food on the counter, all for the grabbing at 2-3 bucks each. It is premade food left for customers to just grab, pay and go. My friends and I opted for the 3 entrees for 20 bucks deal which was definitely a recession buster.\n\nWe had ordered walnut shrimp, Mongolian beef, and Hainese chicken. We had also grabbed some fried chicken from the ala carte tables for 3 bucks. The walnut shrimp and Mongolian beef were my favs. They had tons of flavor and tasted very fresh. I love it when beef is tender with every bite and not dry. The walnut shrimp had the perfect amount of mayo and the walnuts were definitely candied. However, the Hainese chicken was boring and bland. I have never been a fan of it and just never had good steamed or poached chicken. The fried chicken was cold, cold, and mushy. It was a waste of 3 bucks lol...\n\nThe service was good and the place was definitely filled with customers hitting up the ala carte tables. The complimentary soup was just msg water but tasted more like tasteless water. I would come back again for the 3 entree deal but skip the ala carte tables because you don't know how long those little dishes have been sitting there. See my pictures to see what I mean.", "author": "Danster L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-10", "description": "Came here for family dinner and the food was complete crap. Bland. Flavorless. & Leftovers.  3 words that literally summed up ALL of the dishes. The best thing I had that night were the oranges they served.\n\nFish - came out very undercooked, had to send it back to re-cook it. Still wasn't even good\n\nquail - taste like leftover chicken. extremely dry\n\nsweet and sour pork - not sour nor sweet enough. too bland\n\nhoney walnut shrimp - walnuts were stale, shrimp were overly drenched in the mediocre sauce\n\nHad a bunch of other dishes, but since everything was terrible already, I don't even want to bother with the details. \n\nCompletely regret coming here. My parents could've made all these things 10x better at home.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-25", "description": "This place looks  like a foodies paradise with the ducks being displayed at the window but shall I caution you that the food isn't that great. I would suggest Hong Kong Clay Pot down the street. Cheap prices, horrible service (waited 40 min for my food ) and  food wasn't good. I ended up taking most of the food to go and giving it to a homeless person. They get a one star for multiple reasons... First being they brought out a wrong plate, but after waiting I accepted it Bc I was starving.... Secondly, the cashier told my husband he better leave a tip on the table... For what? Horrible service, wrong order and nasty food? Needless to say, we left without tipping due to the pushy cashier.", "author": "Franchesca S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-01", "description": "This restaurant only deserves one star for the honey walnut prawns and cheap prices for food. This restaurant is terrible with service and need more servers and someone to ensure meals are coming out in order based on when people have arrived.\n\nMy group arrived at the restaurant with no one to greet us or guidance on how seating was arranged. It looked like a busy restaurant but there were some open tables. I had to approach the lady working and ask if we had to seat ourselves or if someone would show us where we would sit. We already had a prediction that the service was not going to be good based on previous experiences at Asian restaurants but not that terrible! It took them awhile to give us plates and hot tea but they did not ask if we wanted anything else to drink - not even water. We finally got our order in and then we were wondering why there was such a long wait. Also we noticed a Chinese family sitting a table next to us come in after us and already get served soup and their entrees and our table didn't get one thing. We also noticed a table behind us that was NOT Chinese and they also got their food late around the same time we finally received our food. Other tables around us that were Chinese did get their food and came in after us. We should be treated the same way and get our food at a fair time prior to people that have already come in after us. The waiter also did not update us on why the food was taking a long time. At this point, after seeing others that came in after us get all their food, being hungry, not receiving good service, we were close to walking out but then we got our food and it was piping hot so it shows that our food was fresh off pan but it really does not take that long to cook shrimp fried rice, TERRIBLE \"Mongolina\" beef or whatever that was, salt and pepper chicken that only had legs available and no wings, and honey walnut prawns. Overall, our food was $25.55 so I gave the cashier $26 and left.\nDo NOT come to this restaurant if you expect good service, great food, and fair treatment based on your ethnicity.", "author": "Antoinette H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-30", "description": "My wife and I decided to eat here on a whim based on our hunger.  We ordered the soy sauce chicken, roast duck, and Chinese broccoli.  \n\nThe chicken -  flavorful, moist , succulent.  5 stars!\n\nDuck - had better.  They limited the amount of breast meat and was a little salty for our take.\n\nBroccoli - salty with the oyster sauce but better when coupled with rice.\n\nService - typical.  Not too friendly - never want to go out of their way.  \n\nSurprisingly we have had better duck in Dallas so essentially we don't recommend it unless you are really hungry like we were.", "author": "Art R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "I typically dine at Yee's once every other month.  Living 60 miles away, always look forward to a great tasting and affordable meal.   \n\nWe ordered the 3 item lunch special, comes with complementary house soup. The soup was watered down, so bad we didn't touch it. \n\nWhen the main course was served, one item was not what was ordered.\nDecided not to make a big deal and enjoy the meal.  Few minutes later the waiter came by (without explanation) gave us the correct item and took what we were eating to the other customer.\n\nOverall the taste (favor, temperature, portion) and service was lacking compared to past experience.", "author": "Benn H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-24", "description": "NEVER GO HERE EVER even in wake of an apocalypse and Yee is standing at the door greeting you with piles of noodles DO NOT TAKE THEM. I ate pan fried noodles here and was deathly ill from food poisoning the day after. Had to go to the ER and get hooked up to an IV. Do not submit yourself to Yee's wrath", "author": "Trace T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "Not sure how my parents discovered this place but the past few years they've been bringing out of town guests to Yee's. Some Chinese-American friends also randomly took me here and I just wondered how people would find this place out of the hundreds of restaurants in Chinatown - not all restaurants with hanging ducks are created equally. It's a little less touristy since it's on the northern end, almost in North Beach. \n\nWhen my family goes, everyone orders the $4 wonton noodle soup and then share the roast meats on the side - duck, pork, pork spare ribs, soy sauce chicken. I always hope the broth will be better but it is pretty unremarkable and bland. The wontons are decent and plump. Just add the meats to help flavor the broth. The roast duck is obviously oily but the ducks they use aren't grossly fatty. The other meats are flavorful and tender. Everyone eats for less than $10/person including a good tip.\n\nThey also have a 3 item special for under $20 for a lot of typical Cantonese dishes. You can feed 3-5 people this way. Jook is delicious and cheap. One of my fave dishes ended up being a simple shrimp egg omelet which was well seasoned and thin yet not overcooked. Around 2 or 3 pm, they start setting out small dishes of their excess roast meats and other dishes for a few bucks. They've started wrapping the dishes individually with saran wrap so people aren't breathing all over the food as they forage. \n\nService can be pretty bad. You think the waiter is totally looking at you but when you start talking to them they walk away. So no shame in vigorously flagging someone down.", "author": "Mimi L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-14", "description": "cash only. bad service. BBQ duck is too salty. CHEAP, very CHEAP, of course don't expect 5 star quality when it's that cheap. They have afternoon special with chinese BBQ dishes, I think its $2.70 a dish. YES dumb ass cheap... but very greasy and salty...", "author": "Kris J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-24", "description": "We like coming whenever we're in China Town because service is decent, food quality good and prices per dish are very cheap.  \n\nIt's amazing how you can get a meal plate for only $5 (portions are quite big).  You can't find cheaper and good quality anywhere.  \n\nIt's usually busy at lunch but we did come here last Sunday for dinner and was seated immediately. \n\nWhat we ordered:\n1 Singapore vermicelli curry \n1 Lotus root with pork\n1 wonton soup with BBQ pork\n1 large beer\nAll of this came to about $23.  Oh, and they even give you slices of oranges after your meal. \n\nDefinitely a place to try if you've never been.  I guarantee you won't be disappointed with the food.", "author": "Rosetta C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-05", "description": "This place has really gone down in value. The Roast Pork used to be really good now it tastes very bland in flavor and just salty. The goose is decent but not much of an expert on that since I usually only get it from this place. \n\nOther than the roast pork and the goose, the food here is expensive and just tasteless.  The portions are pretty small for the price you are paying. They ding you for everything like rice and tea. Maybe it is an SF thing but I am from LA and rice comes with your food, especially if your food is so freakn expensive. Also it takes a long time for the food to come out.\nLast but not least,  remember the server brought a dish and spilled the sauce from the food on the table close to my parents cause he was careless. I understand that but the least he could have done was say sorry or attempt to clean it up. Nope just left it there on the table.", "author": "Willis W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "Picked up 1lb. Barbeque pork (char siu). Decent, not extraordinary. Think it was actually too lean. Ok service. Cannot complain. Will try others next time.", "author": "Cari S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "After walking around Chinatown for a while on our 1st day in San Francisco looking for a place to have dinner, we stumbled upon this very reasonably priced cantonese style BBQ restaurant. You can order the BBQ meats hanging in the window by the plate ($8-9), or order 1 or 2 meats over rice ($5-8). The food was pretty good and this place did get crowded on the Saturday night we were here. This place is cash only, like most of the places in Chinatown so don't come with just plastic! I would definitely return again if in San Francisco! We actually tried coming a few days later but it was too late in the evening and they had already closed (8:30ish pm)", "author": "Brian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "We usually eat at Grant Place but had wanted to try Yee's since we couldn't get a table the last time we were in town. We got in right at noon and could get a table. The waiter was a bit slow in taking our order but the roast duck and roast pig were great. We also got the mixed veggies and an order of wonton noodle soup. Also very good. You can tell a restaurant is good in China town when they have the roast ducks hanging in the window. The price was under $35.00 for all of this which I consider a good deal. No dim sum, though, like Grant Place but we enjoyed the food and had a little to take home. By 12:30 there was a line out the door so get there early.", "author": "Lee O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "Best roast pork I've ever had.  \n\nEven my parents say that they've only the tasted the same flavor only in China/Hong Kong.\n\nI make exclusive trips to Nor Cal just for this!!!", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "Actually, this place is pretty good. I grew up Cantonese, so this reminds me of Cantonese down-home cooking. My parents and I come up to The City about once a month, and we've been here a few times. If my picky mother likes a place, then the quality measure is high and \"they must be good.\"\n\nLike someone said here - \"soul food Chinese style\" - and I think that they're pretty right-on, esp for the price.\n\nWe always get our roast pork from the deli here, and I'd venture to guess that the pigs that they use to roast seem smaller/younger, thus making the meat more tender and smooth, rather than the rough cardboard texture that you might get with an older/larger pig. It's almost always got the right amount of fat and the skin is consistently thick and crispy.\n\nThis might be considered a hole-in-the-wall, but I think is considered a step-above.\ni.e. \nno grime on the walls and a wait-staff that sits you down and serves you the food ;-)\n\nI've only tried one thing here, and that is the - ngow nam mein - fatty beef brisket/belly with thin egg noodles in soup. Not sure if it's on the menu, but my mom usually tells the waiter that's what we want. All I can say is that it comes out really good, and I think for what you get at $4.95 (the price that I remember), you get a good healthy bowl of it!\n\nI think that if you confidently know what you want (from having grown up Chinese!), and don't have reservations about ordering something that's not on the menu, see if they can do it! \n\nThrough the grapevine, I have heard that you can order (gee yuk biang) steamed pork hash if you ask for it!", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "My father-in-law is a Chinese restaurant chef in Chicago and all he could do was rave about this place.  He made the claim that their menu items taste just like when he was back in Hong Kong.\n\nDuck noodles, salty pork congee and thousand year egg congee for $15 was a steal and fed 5 people happily!\n\nFlat noodles and tripe to go were about $2 a pound.  Very, very tasty.\n\nFor dinner we ordered salt and pepper flounder, honey walnut shrimp and a vegetable dish... $15.99.\n\nA whole goose is $32.", "author": "Cathaleya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-19", "description": "Roasted goose. Only place in San Francisco that has roasted goose. Super cheap and super quick service. Their chinese bbq ribs are good. I would never order from the tables though that the food on the tables are not clean. and random customers touch and prod at the plates. I would definitely not recommend getting those unless you see the butcher put them down fresh.", "author": "Janet D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-02", "description": "It is correct to call this place authentic (dirty, walls plastered with menu items but written only in Chinese). But authentic is not always a good thing.\n\nThe good: Cheap and huge portions. We paid $40 (after tax and tip) for eight people and struggled to finish everything.\n\nThe bad: The place is dirty.\nThe food is just salty and greasy. I can't be sure if they used a lot of MSG, but they might as well have.", "author": "AloisSchicklgruber H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "I saw this place on Food Network after we went there. Great food..owner a lil suspect, but great food. lol. \nIf you go to Chinatown in San Fran, you gotta hit this spot...hey...what happen to our coke...he forgot again. dang...", "author": "Duvell D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-04", "description": "Yee's seems to get a lot of flak about the overall cleanliness of the restaurant... so to start off my 5-star review, I've added a disclaimer:\n\nAs a general rule at Canto restaurants, you just don't ask about the details of your food, as any honest answer is probably undesirable, ie:\n\n\"Is the pigeon meat fresh?\"\n\"Yes... probably. Locally-grown too.\"\n\nI personally love this place with all my heart. This is as authentic & tasty as Chinese food gets north of the Silicon Valley. Don't be fooled by its \"touristy\" location on Grant Ave. If you can't read Chinese, it's going to be pretty hard to order anything. \n\nAs a college student, I'm a sucker for the 3 for $15 meals, complete w/ soup, fruit & tea. My favorite 3 for $15 items are the salt&pepper pork spareribs, (fatty, salty, peppery soul food at its best) the ginger-scallion fried tilapia ($5 whole fish... enough said) the dry-cooked sichuan string beans, and the seafood-veggie pot (bubbling hot w/ bok choy, various mushrooms, fried soft tofu, squid & fish.) \n\nI've never gotten sick off the food; my (disclaimer: white) fiance has been here countless times and he's never gotten sick/nauseous either. I've taken my extended family here, and they all love it & agree that this sort of authentic Canto food can hardly be found anymore... :( Plus, when you branch off the $15 3-course meal and loosen your purse strings a little, the food is excellent! Stewed clams, tender braised pork, perfectly roasted duck... Yee's has an orgiastic selection of meats that correctly earned it mention in Frommers as one of the best Chinese \"meat delis\" in SF.\n\nFor the strong-stomached... keep coming. :) There's this incredible feeling of validation you get when you've come for the umpteenth time and the manager actually deigns to flash you a smile... it's as if you're one of them now! And when that happens, the food comes promptly, the orders aren't mixed up and you're even honored with a scrap or two of meat & squash floating in your complimentary soup. Major bragging rights for an ABC.\n\nOn the flip side, you should gauge your dining companions carefully before taking them here. As much fun as it is to introduce everyone & their mom to culinary Asia, it can be disconcerting to order your meal (over a formica tabletop plus the din of 100 other hungry, loud diners) and have it come out with head, innards & ovaries attached. Yee's is delicious, but the dining experience isn't for everyone. That being said, if you're Chinese, you have to like it. Seriously... it's like your birthright. \n\nTips: Come early during the day if you want fish- they sell out fast. Be nice & order in Chinese (if you can.) Try everything- it's all yummy. And...\n\nBottom Line: In the words of Josh D'Aluisio-Guerrieri- \"Find comfort in the fact that a billion people eat at places like this every day, but it isn't solving the probblem of overpopulation.\"", "author": "Tianyi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-16", "description": "Came here with 3 other people the other day. A co-worker of mine told me this place has a really good lobster yee mein. When we looked at the special menu, there was a $15.99 deal for 3 dishes. It looked pretty good so we picked salt and pepper shrimp, green bell pepper beef, and garlic baby bok choi. We also ordered the lobster yee mein too. \n\nThe food itself was definitely worth it. It came with free soup and we had rice with the dishes. Between the four of us we couldn't finish all the food and we're big guys. Extra plus for the prompt service because our waiter was ready to take our order and the food came out quick. I liked the lobster but there wasn't a whole lot of meat in it. I was pleasantly surprised that they include the shell. It was stir fried and battered with the noodles. \n\nI'll be back to try the other items on the menu. There is quite an extensive list and it's recommended that you bring several people along or else you won't finish the food.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-24", "description": "What a great looking display window!!!  I took a pic just cause it looked so yummy! :)\n\nMy friends and I stopped in today for some lunch.  It was quite busy because of the Moon Festival but they were able to seat us with minimal wait.  The lady who prepared our table was friendly (which is not so common in some Asian joints) and so I was quite happy with our random lunch restaurant choice.  I was even more pleased when she told us to pick 3 items and for 15$.  Wow!  What a deal. :)  We didn't really use that menu though because everything was had great prices.  \n\nWe ordered 4 dishes.  The first to arrive was a preserved egg porridge which was great!  Everyone at the table really liked it, even our '1st time to China town friend'. Haha.  Next up was combination noodles.  The meats and seafood in the noodles were very good but the noodles themselves were way too salty.  We picked at the noodles after we finished the porridge and then waited for our roast duck/bbq pork and soy sauce chicken.... and waited and waited and waited... \n\nIt took us a while to flag down nice lady but when we did she immediatly went to prepare our duck and pork.  We finished that and decided to go ahead and go, though the soy sauce chicken hadn't arrived. \n\nAll in all, I'd definitely go back.  The food was good and everything was under 20$!!  I think the forgetfulness was just because it was so busy with the festival.  The nice lady even apologized., though we weren't really put out by the wait... which again, I don't expect in an Asian restaurant. Haha!  \n\nI bet next time I go it's a 4 or 5 star!  I'll update...", "author": "Susan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-08", "description": "Terrific place!  We come here every Xmas night for the roasted goose in the window! Amazingly cheap delicious Xmas dinner!", "author": "Chrys K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-27", "description": "I think not!\n\nYes, I think a lot of their food was good and cheap but lemme tell you something...I've only had bad food diarrhea from two places: 1) Once from food in a supermarket in China. 2) Here at Yee's Restaurant. \n\nMaybe this was a fluke since this was my first time here. On the other hand, my cousin that I went with got diarrhea the same time as I did.", "author": "Dennis H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-12", "description": "Hugh portion with good price!  Food is Cantonese style.  We had special sauce chicken which taste well and chicken meat is not tough.  Veggies dishes are average.  Nice place for large group and save money.", "author": "Yue Wing C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "So the first time I went here, I was too distraught to truly appreciate the awesomeness of Yee's (my good friend bought me here following a bad break up and to get me out of the house for Chinese New Year). Somehow it took me over a year to come back to this place.  How did I not realize they had the best deal ever of three dishes for $15.99?! We added a fourth dish and some beverages and the bill came out to just over $30. We were all stuffed for $10 per person including tip. \n\nThe food is tasty and the service swift and friendly and the prices are amazing -- how can you go wrong?! The salt and pepper flounder is my favorite, but I also enjoyed the honey walnut shrimp, beef with chinese broccoli, and ginger chicken (and I vaguely recall the roasted duck briefly pulling me out of my dull drums on the first visit, but don't quote me on that).", "author": "Dani D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "Service is mediocre, like it is at most Chinese restaurants.\n\nI got the wonton noodle soup ($4.00). There were a lot a shrimp, so I was happy. For the price? Hell yeah! They ran out of duck, which my friend ordered. The kung pao chicken was apparently a little bland (according 3 out of 4 at the table), so for those who like drizzling your shit with soy sauce, you're going to need a lot more. I thought it was fine. \n\nBonus: a slice of watermelon for dessert. YESSSSS!", "author": "Cathy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "Our family stopped here yesterday on a quick trip into the city.  I found this restaurant via another site's recommendation (I felt guilty for cheating on Yelp, of course) -- it fit the bill for location, price range and ratings, and if we go somewhere unfamiliar without a destination in mind, we tend to wander aimlessly until we finally turn on each other in a low-blood-sugar rage, like crazed jackals.  \n\nYee's was not the absolute best Chinese food I've ever had in my life (that was in a hole-in-the-wall somewhere in the city which I'll never find again ... sort of a Brigadoon thing, I suspect), but it was very good.  Everyone found something they liked, there was a wide variety of dishes, the waiter was helpful, the food wasn't greasy (one of my pet peeves), we didn't feel rushed or ignored even though it was close to closing time, and the price?  Phenomenal.  Four of us -- all big strapping corn-fed hearty eaters of Chinese food -- ate until we were stuffed, with two containers of leftovers, for *forty dollars*.  Srsly.  \n\n- Pot stickers:  these were the weakest link, since they were sort of doughy, but the flavor was excellent and the price was right\n- Char siu:  big portion, very juicy, holds up favorably to my companion's exacting char siu standards (he's kind of a char siu maven)\n- Eggplant with salted fish and chicken:  the waiter warned us that this was \"smelly\", but we braved it.  Smelly, yes, but the flavor is good and the eggplant's flavor and texture were especially nice\n- Some kind of rice noodle dish with beef:  again, great flavor; a little light on the beef\n- Mongolian beef:  excellent, albeit an awful lot of onions\n- Green beans with minced pork:  fantastic!  spicy without being overwhelming, more meat than we expected (and little slices of pork, not hamburger-sized-crumbly-bits as the name might suggest\n\nThey brought us some amazing melon (in lieu of fortune cookies) with the check, which made a good contrast to the meal.  Also, free melon! \n\nI'd definitely recommend Yee's just for the food, but the location is also excellent -- easy to find (near Grant and Columbus) and close to other interesting stuff.", "author": "Sue G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-01", "description": "My go to place in Chinatown.\n\nYou can read the other reviews to get an idea of what this place is like, the one thing people seem to leave out is their breakfast and afternoon specials.\n\nTheir breakfast menu is not translated into english but if you don't read Chinese you can figure it out by comparing it to their main menu.  It's mostly things like congee and sandwiches; I always get the congee.  It's a little cheaper than their regular menu price but it comes with a side of noodles!  Very filling breakfast.\n\nTheir happy hour is 3-5:30 and it's awesome!  First, the menu is in English!  Second, it's cheap!  All the items on the menu are $2.50!  You can get a bowl of noodles with beef stew for only $2.50!  There are things like congee, noodle soups, chicken wings, and other stuff on the menu, seriously good food and very inexpensive.  They also have plates of stuff out on the table; just grab whatever plate you want and eat!  Here you get things like roast pork (one of my favorites), fried rice, chicken wings, and other stuff.\n\nMy only complaint is the lack of chicken feet, I love chicken feet and they don't have them. : (", "author": "D D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-14", "description": "I'm so hungry I can eat a whole pig right now! A whole suckling pig. Roasted over an open flame. Crispy glistening skin, lean tender meat. Crunch, crunch, crunch. Wow! \n\nThose of you who are pig lovers, you know what I'm talking about. Yee's will deliver the best damn roasted pig on the planet. Is that my appetite talking or can it be true. It doesn't matter because I'm sitting in Las Vegas, starving, and reminiscing of my roasted pork at Yee's Restaurant. \n\nNo one does it better when it comes to roasting a pig to perfection. If you over cook, the skin gets tough and the meat is dry. If you under cook the skin and fat gets chewy. But if you do it perfect like Yee's, you will stuff yourself with so much meat you will oink.", "author": "My T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-15", "description": "I thought that this place was worth a try....but I was wrong. All I wanted was to try out a new place for cheap lunch. Did I get that? Oh I got cheap lunch alright. First off, when we first walk in...no one is even greeting us or leading us to a table. The workers there were just sitting there, watching us but not even saying anything. Then finally, this one guy comes up to us and finally serves us. My boyfriend ordered Beef with Broccoli and I ordered Beef with bell peppers in black bean sauce. It was $5 for each so I thought that it couldn't be that bad considering that there were many people in there. When we got the rice plates, it looked decent. Though looks can be deceiving! The meat was hot but the rice was warm. The sauce was very bland and it seemed like they just put soy sauce over the warm rice that they probably just microwaved. My boyfriend's plate was a bit better than mine...considering the fact that I found a bell pepper produce sticker still attached to the bell pepper piece that I almost ate. I was absolutely petrified because I don't know where that's been. Also, if there was a sticker on the bell pepper, maybe they didn't even wash the bell pepper before they cooked it! Anyways, I complained to the lady that was working there and she didn't really say much about it. She didn't even try to take responsibility for it at all or offer a refund. She tried to offer me another plate...but I didn't want to eat anymore of that garbage. I'll give her props for trying to offer me another plate though. It was a cheap lunch, but it was far beyond what I had expected...in a bad way! I'm never coming back here again. Worst experience ever.", "author": "Coco L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "Just a great job on the BBQ pork wonton noodle soup. Earlier I got it and the quality of pork was sub par, but every other time has been excellent quality so they get a few more stars from me.  For less than $6, this is a great bargain! I also enjoy getting an order of potstickers for less than $6. They serve it with a vinegar sauce that was surprising at first (it's a red sauce and most Americanized places serve potstickers with a sweet red sauce) but I'll admit the vinegar paired well with the potsticker filling", "author": "Ross I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-05", "description": "Not the cleanest or fanciest restaurant I've been to, but I'd say it's right on par with the rest of Chinatown.  However; they definitely make up it with their food quality and prices!\n\nThe food was good, particularly the shoyu chicken.  Even better was the price- dinner for five people was just under $30!!  The portions were right, and we managed to stuff ourselves full without any leftovers.\n\nParking (or lack thereof) is another downside, but again, it's the same as any other restaurant in Chinatown.  Get lucky and find a spot on the street, or pay an arm and a leg at a nearby garage.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-21", "description": "I was glad my friend and I happened upon this place after walking all the way through Chinatown! The ducks hanging by the window were a draw since I was looking for legit Chinese food.\n\nI ordered the roasted duck, which was super tender and juicy, while also being nice and crisp on the outside. My friend ordered beef & broccoli that was tender as well. We shared the hot & sour soup and had leftovers to take home. I think we ended up paying around $10 each + tip.", "author": "Beth P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "Yee's = Oh Em Gee!\n\n\nYou tell me... What's better than:\n--------------------------------------------\n\n* Massive, generous portions?\n\n* Amazingly low Chinatown prices (per dish)?\n\n* Extra extra friendly service?\n\n* A comforting/warm interior atmosphere?\n\n* Free yummy hot tea?\n\n* A menu w/ lots of variety (& seafood!)?\n\n* Some of the best tasting food you've ever had???\n\nThe Answer = Nothing!!!!\n\n\nGo to Yee's the next time you're in C-Town...\nUnless you hate food, uh, you won't regret it!\n\n^_^", "author": "Kai S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-30", "description": "One of my go to after noon tee place. The after noon tea menu here is $2.5 for food and ~$1.5 for drinks (not sure on drinks) The food is prepared very quickly. \n\nMy favorite is always the Porkchop noodle (you can choose from many different kinds of noodle) \nSalt and pepper wings are great too!", "author": "Frederick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "My son had the deep fried flounder, my Uncle the beef chow mien and I had soy chicken over white rice. All for under $20. Well worth it!", "author": "Marylou P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "I had high hopes when I saw the roast duck hanging at the window. We were on our way to get Thai food, but decided to give this place a try. I wanted some legit canto food to bring me back to HK for a little bit, and the only legit dish we had was the roast duck. Between the two of us, we ordered:\n\nMongolian beef\nBeef mi-fun with shrimp sauce\nStir-fry garlic big bean sprouts\nHalf a roast duck\n\nThe mongolian beef was pretty americanized. The mi-fun was too wet. The big bean sprouts were not in season and too oily. The roast duck was oily too, but it was good. We walked out satisfied only paying $35 for the meal.", "author": "Evangelline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Oops wrong place\nDo love the duck n pork and old Chinese people that clam our in and out", "author": "Sara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "What can I say...awesome!  They had an interesting 'to-go' sale going on in the late afternoon when I arrived. (I'm on East Coast time).  Wanted to buy it all...but took a table instead.\n\nI went to order soup, Combo BBQ plate and greens, and \"Kenny\" told me that was enough for about 5 people...so I said, \"Please, just feed me\".  I received this \"Jethro\" bowl of soup with about 8 won-tons, a bunch of Chinese greens, and about 8-9 slices each of pork Char-siu and Roast Duck.  AWESOME!!!\n\nWait...it gets better - total $6.50!!!  Considering I spent $70 on lunch at Swan, I guess it evens out...I think Chinatown ROCKS!", "author": "Don M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-19", "description": "Cheap prices\nBtw, this review is NOT based on their bbq\nWe ordered chicken item and beef item and they somehow tasted very.... Rubbery like there was no real meat. After reading about how Chinese have synthetically made food including eggs, I really dont know what to say.... Prices are cheap but I think I could see why... But portions are big and the staff there do speak English\n\nWith wealth of Chinese options available nearby, will not be returning here.", "author": "Christina P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-06", "description": "This restaurant is a favorite of my aunt & uncle that live in the area.  This restaurant seems very affordable if I would venture a guess I think it was about $50-$60 to feed 4 people.  We had the tea, white rice, a clear soup, as well as 2 types of fish (one whole the other might have been steamed), we also had duck, roast pork, and chicken.  The food was good.  One thing to note is that the chicken and duck still had all the bones in it.  I think this is traditionally how it is served, but for me I can not try enjoy the meat trying to avoid all of the little bones.", "author": "Kris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-22", "description": "A friend and i go out a couple times a week and try new spots. We were heading for clay pots, but ran across Yee's on Grant and took a look at the butchers table, watching them cut up the fresh killed goose, ducks and pork.. After watching for a while we asked the price of each and it was really low so thought we'd give it a shot.\n\nGoose over rice: $7\nComplete wok seared fish:   $7\nChinese greens (bok choy)  $6\n\nPricing was great, service was on the spot, and food was tasty with non-heavy sauces. Mustard is freshly made but i couldn't tell if the condiments were on the table for a day or a year. I realized while i was sitting there that this was it felt a bit like a cafeteria with servers (or so it seemed). They were cleaning out the large tea brewers at the end of the night so i have a feeling they keep it clean, but after looking at clean scores i know there are several violations (only one major). \n\nAll and all a good experience.", "author": "Adam X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "Only place in chinatown that you can get whole roasted goose at 10:00am and roasted pig even earlier st 9:30am. Go there on Sunday morning and you can imagine Anthony bourdain there talking about pork for breakfast with the locals", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "Crispy and delicious Peking duck ( for two people) with steamed buns, scallions, gravy and watermelon for dessert for $13. So, am I coming back to eat here? Yes!", "author": "Evelyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-01", "description": "If we want a satisfying home styled meal, this place doesn't disappoint.  We come back over and over again for their 3 ala carte dishes for $15.99.  The complimentary house soup is always piping hot and the kind that's good for the soul.  Each meal ends with a plate of sweet oranges so can you go wrong?  Best part?  Always have extras to take home so you are basically paying for 2-3 meals.  \n\nOur recent visits, we had chayote w/ pork and white bean soup and hairy melon w/ pork and white bean.  Both were flavorful.\n\nEntrees we had:\nstir fry thin slices of lotus root with sweet peas, black fungus and preserved bacon that were mostly fat - flavorful but the fatty bacon was a major turn off\n\nseafood tofu pot - chunks of cod, shrimps and squid stewed with crispy soft tofu - love the tofu but it was a little salty\n\nchicken with ginger and scallion - love this dish, tender chicken and I really love the finely sliced ginger and scallion\n\nbitter melon sparerib - soul food at its best - huge portion - the bitter melon is sliced correctly, the spareribs are tender\n\ngreen bean w/ chopped dried shrimp and preserved radish - this was SO good!  the dried shrimp and preserved radish added so much flavor to the dish, it was addicting...\n\nfried soft tofu w/ shredded pork and preserved mustard green - this is ALWAYS good - the tofu is great and the pork is always so tender", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-15", "description": "I would give this place 0 stars if I could.\n\nI came here to pick up goose on several occasions.  My grandmother loves to eat goose and this is one of the few places that sells it.\n\nUnfortunately, time and time again, they've always tried to pull a fast one on me by either attempting to sell me:\n\n1) subpar (day old) goose \n2) giving me impertinent/surly attitude (insisting the goose is fresh when it clearly isn't- thanks for showing contempt by making a mockery of my intelligence)\n3) refusing to sell me half a goose and insisting I buy the entire goose\n\nI've also noticed that I am a victim of age discrimination as they treat their older customers nicer than their younger \"unknowledgeable\" counterparts.\n\nAfter putting up with their wretched service repeatedly for my grandmother's sake, I refuse to allow myself to be treated this way again.  \n\nI'll be damned if I step foot in this sorry excuse of a restaurant again.", "author": "Dorothy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "Hard to tell from the outside, but this place is actually really good and inexpensive. Around $6 for a roast duck with fried rice is not bad at all! Food tasted great, portion was huge and you can see right in the kitchen where they prepare it.", "author": "Robert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "I love how they display their MEAT.  Tables and tables covered in small plates of MEAT.  BBQ pork, crispy pork skin, roasted duck, soy sauce chicken, chow fun, chow mein, duck feet, duck wings, fried chicken, duck gizzards and much more, all displayed, laid out for all to see.  Patrons ( picky chinese people^^) walk from table to table deciding which plate they'd like to take home.\n\nI like the duck here.  The duck here (compared to san jose) are leaner and more meaty.  Duck in san jose have a higher fat content.  Whenever i bite into a piece of duck, grease would just drip from the corners of my mouth.  But the duck here are more lean but still delicious.  I bought two whole ducks for the road.  HEHE.Roasted duck in sf Chinatown are much cheaper than San Jose's =[ no fair.\n\nI didn't like the BBQ pork here though, parts of it were dry.", "author": "Ronnie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "Delicious food, amazing duck; really enjoyed our lunch here.  We will definitely return.", "author": "katinka p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-13", "description": "Do not eat here! The portion and price was ok but there is no taste to the food. I think they gave us old meat and it stinks! My soup was cold as well! It is a \"never return\" for me.", "author": "Tracy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "We stumbled across this restaurant and decided to take a chance. Their menu was extensive, service was friendly and efficient. We ordered 3 dishes for $16.99 (deep fried flounder, seafood with tofu hot pot and walnut & butter prawn) and egg flower soup. \nOur bill was $22 and we took home leftovers. I was very pleased. It was a delicious meal... maybe just stay away from the toilets, though and bring cash. No card accepted!", "author": "Joy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "People that knock this place dont know what they are talking about, and have no experience in judging a dining experience....The best food, in my travels are always in small and authentic places with no ambiance, and quite frankly, look a little shady....the focus is on food.  This place offers some good old school Cantonese style cooking at very good prices.....This is not a tourist restaurant, that is why there are so many local Chinese patrons inside - thats a good sign you freaking idiots! I havent been on Yelp in a while...reading some of your lame rookie reviews, I recall exactly why I dont read Yelp reviews...most of you are kids with no experience and no taste whatsoever....\n\nThis place has alot to offer at great rates...and yes the duck is good....one other thing....one of the little girls who rated this place said you cannot order if you cant read Chinese .....not true little one....the menu is very much in English as well. Of course, there may be some things not listed  in the menu...that is the case with most authentic Cantonese / Chinese restaurants such as this.....2 people can dine really well here for 20 bucks....amateur, chain restaurant,  chi chi slaves need not apply.", "author": "Gomerio G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "Amazing roast duck, roast pig, Mongolian beef, egg rolls etc.  Server was upbeat and nice, and the 24oz Tsingtaos are only $5.", "author": "David R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-28", "description": "You walk by here and you wonder, \"Is this a tourist place?\"  It has a good location for tourists.  But then there's tons of Chinese in there, and the requisite fowl carcasses hanging so it can't be bad.  We just wanted a quick snack because we were starvin' Marvin, and this place is quite generous.  The food is cheap, they give you a big complimentary soup to share, which is perfect for the cold winter days, and the food is cheap... yeah that was worth mentioning again.\n\nOverall the food is above average as Chinese food goes.  If you are a college student then 4 stars for sure.  Oh yeah, and the big plate of oranges were a nice finish.  I thought we got the good treatment because my friend spoke Chinese, but really they do that for everyone.", "author": "Bryan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "Let's see, I came here during the mid afternoon in search for something good cheap and authentic...after all everyone talks about food (in Chinatown and in the world in general.......) ........\n\nI've never been served tea in a coffee mug before, and it looked as dark as coffee.  Maybe just because the mug was dark.\n\nI ordered the combination pan fried noodles...wow large portion, lots of soy sauce-y taste, bonus pieces of octopus (buried on the bottom, didn't see it until the end when I packed the rest to go), cha sieu, regular chicken, fish pieces, and what else... well there were a lot of \"combinations\".  \n\nNext time I should order duck or pork, I guess those are popular huh..", "author": "Christina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-19", "description": "\"It's OK\".  I miss what used to be here 'tho. Growing up in SF, it was the site of Ping Yuen, a bakery which sold yummy fluffy cakes filled with strawberries or mandarin oranges and whipped cream.  Spend a \"hangin with GF\" morning at the North Beach Festival which is a hop and skip  from this joint.  She says her uncle loves coming here for lunch, so I agreed to try it.  \n\nDidn't get a chance to try their BB items but she told me their roast goose is good.  We shared a fish congee - a huge scalding hot bowl of porridge cooked just the way I like it with a generous amt of thick slivers of fish.  Also tried their house fried chow mein.  The noodles were crispy fried and topped with sauce, vegts, squid and meats.  Not bad either.\n\nService was adequate. They take your order, serve you and leave you alone until you ask for the bill.  The bathroom is into and past the kitchen. It beats using a port-0-potty but beware, it's pretty old, in need of remodeling and doesn't look that clean.  The meal came to about $15 for the 2 of us.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-14", "description": "they have some good deals here, which drew me in to try this restaurant.\nthe food i ordered wasnt tasty and left my craving for chinese food unsatisfied.\ni felt the food was inconsistent; some were salty and some were bland tasting.\nthey also had a section for meats for cheap for people to grab themselves, but how long were they sitting there for?!\n\nanother thing that pulled me in was that they serve GOOSE! sadly, this place didn't make it tasty either.", "author": "Anita W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "Whoa...I thought this was my best kept secret. Secret's out I guess. This is my favorite restaurant in SF Chinatown. My family originally used to go to the deli to buy the roast goose, which is actually surprisingly difficult to find, even in Chinatown. Then we discovered the 3 item (plus soup) for $15.99 deal. We always order the salt and pepper spareribs and the fried flounder. It's delicious and a bargain. \n\nYou may notice that at around 3 or so, the restaurant starts to get relatively crowded, which is counterintuitive because 3 o'clock is between mealtimes. This is because at 3, the restaurant puts food from the deli (chow mein, bbq pork, chicken wings, etc.) on dishes. The plates are then placed on a table only to be quickly claimed by various customers. Why. you may ask? The plates are sold for ridiculously cheap prices. I'm talking China cheap, like $2 a plate. \n\nJoin the frenzy but don't you dare get in between me and my wings. :P", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "Great food, nice service! Locals eat here so quality is high and the price is right. I'll come back again", "author": "Karl M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-03", "description": "The restaurant never really stood out for me until one day I checked the posted menu and saw one particular \"rare\" item: roast goose. Just the site of the item's name makes me think of being in Hong Kong. So I made a point of visiting the restaurant and ordering that item over rice (which at $7, is at least $2 higher than the other rice plates.\n\nThe roast goose didn't disappoint, and it came with a decent bowl of house soup. The service did greatly disappoint, however, because they sat me down and forgot about me. There was no menu or anything until I called out to somebody. At least he apologized. However, for that they get a reduced rating. If I go again and it improves, them I might raise it back up.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "Closes at 9pm as we happen to make our way thru chinatown and stumbled into this restaurant after some bar hoping adventures. We ordered and with lighting quick reflex the food showed up on out table in less then 4 minutes. great Food will be back for sure!!!!", "author": "Peter B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-14", "description": "I would say it's okay.  But definitely order some veggie dishes.  The veggies in SF are FRESH (i.e. bitter melons, ong-choy, pea sprouts, and many extremely Asian veggies).  The meats were okay, but not bad.  The seafood oddly cost more than our area.\n\nTip: If you see Chinese restaurants that puts out folks, rice in a bowl instead of rice in a covered pot, you're in the wrong \"Chinese\" restaurant.\n\nComing from the LA county from the city of Alhambra, CA, I'm surprised there aren't the grading system in restaurants, eateries, markets, and shops that carry foods.", "author": "LilMiss S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "The suckling pig banquet dinner is still really good.  We did complain about the incident reported here in 2010.  It has not happened again (4 pig dinners, later!).   Redeemed!", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "Abundant tasty food - inside a busy establishment. The menu seemed inexpensive (and it was) and the food was tasty and plentiful for the price. We had the Snow Peas and Prawns, the Kung Pow Chicken, Spring Rolls and Shrimp Fried rice - and soon realized that we had enough food for at least 4 HUNGRY people.  Good value and would go again to try other items.", "author": "Tim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "This place rocks. Stumbled upon it during my most recent trip to SF. Good, cheap  authentic chinese food and excellent service. Order the shredded pork wonton noodle soup, you won't regret it. Fast and efficient service. I will definitely return someday.", "author": "Katie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "Excellent food.  We tried the pot stickers, several noodle dishes, a fresh fish and veggie dish, a noodle soup with duck and egg rolls. For seven people, each with their own dish, one beer and a soda. Incredibly the bill came out to $40!!!  \nReally truly Chinatown atmosphere. I swear the Chinese mafia sat at a table next to us. They ordered a fish. The cook came out with one huge fish, wiggling in a net. REALLY fresh!  \n\nOnly thing that was a bit of a strange thing was they had ducks hanging in the window and a woman constantly zapping the flies with a sort of electrified handball racket thing. I was grossed out and fascinated at the same time. Totally recommend. We had so much left over for lunch the next day too.", "author": "Roxanne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "What a deal! 3 entrees for $15.99. We added a vegetable dish and total came out to be $22. Fed three people with enough to spare.\n\nWe had salt and pepper spare ribs, honey walnut prawns, mongolian beef, and a mixed vegetables plate.  Food was delicious and a great value.  I'll be back!", "author": "Linda P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-22", "description": "Perfect for what it is: fast, cheap, filling Chinese food.\n\nI got vegetable chow mein noodles and some hot tea: $5. Plus, there's enough for another entire serving (cold, leftover noodles are very satisfying, if you didn't already know. Especially at 2am!)\n\nI went here with my Chinese coworker and I think we got good treatment because she spoke to them in Cantonese. Not that they were openly discriminating against non-Asian folk, but I'm just sayin'...our tea came out *very* fast.", "author": "Hannah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-04", "description": "Had planned on coming here the other day and after standing inside for a minute, decided to eat some where else. We were waiting to be seated and was ignored. \n\nThe place wasn't that clean for a place trying to attract tourist. It had this smell of intestines being cleaned in the back.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "Food came out in less than 10 minutes, u can stop in as early as 9a for somethin to eat and it's as authentic china as u can get with even the roast ducks in the window.", "author": "Jo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "Went there with three other persons. We shared a soup with duck, a rice dish with pork and shrimp sauce, a rice dish with beef and fried noodles with shrimps. Everything was delicious, service was very friendly and quick and above all the price was very competitive (ca. 50 USD including tip). I had the impression we got pretty authentic chinese food. The interior is not very fancy, if you want that, go somewhere else. But if you want to experience great chinese food you won't be disappointed.", "author": "Oliver M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "Holy dang!  I heart this place a lot.  This is now a pit stop when I am in SF.\n\nI can order a hefty load of food and pay under 35 bucks!  Cheap and delicious is what we dubbed this place.  I am not Chinese (nor are my dinning partners, typically) so when we get here we look around and order a dish that is not on the menu that our neighbor had order (right?  wouldn't you want something the table next to you is eating?).  What's good: chowfun, hk chowmien, duck (but you can't really mess that up), fish dishes, and mix veggies.\n\nThe folks here speaks only Cantonese to me and my party every time we go!  So use hand gestures and smile a lot of you want fast and nice service.  I like how the waitress will even come over to laugh with us (or  laugh at us laughing).\n\nI can't wait to head back.  Yummy.  (Oh, one note: bathroom is scary).", "author": "MSee Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "One of my grandma's favorite joints, but you have to know what to order.  This is not a sweet and sour pork with eggroll joint.  \n\nTheir won ton is really good (which I have found is surprisingly hard to fine, even in Chinatown).  I also really like their beef with bittermelon, and their hom yee fried rice.  They also have some well-done down-home dishes like pork hash (with hom yee, why not!). \n\nPretty fast for take-out too, so if you don't want the whole experience of eating at a Chinatown hole-in-the-wall, you can still have their tasty food in the comfort of your own home. \n\nAlso, they have this special menu with some plentiful selections --  three dishes for like $16 or something crazy like that.  Comes with house soup too, which is savory broth that has been simmering a long time with some little bits of stuff in it (whatever they feel like at the moment, e.g., some beef, wintermelon, lotus root, etc.).", "author": "Kimberly Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-19", "description": "Their 3 for $15.99 is an all right deal.  If you order more than three, you get some broth/soup to go with your meal.  The price is pretty cheap, but the food is super bland and plain.  It's a good place to go if you just need something quick to fill your belly, but look elsewhere if you want a delicious meal.\n\nI was disappointed by the flavor the first time but I gave it a second chance.  My second trip, I decided to order different items on the menu and I was still disappointed by the food.  The meal size is decent and the service is pretty fast, however the food was incredibly bland.  I must be spoiled by my mom's delicious home cooking.", "author": "A V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-30", "description": "We got the cooked dishes, rather than the bbq, which was a big mistake. The fish was tough and overlooked, shrimp was also tough and not how seafood should taste, and the pork ribs were flavorless. Would only recommend/ come back for BBQ and not anything from the kitchen.", "author": "Ming Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-23", "description": "I would love to give it Four stars but this place is so dirty! Cramping 13 ppl in one of their largest tables was the least uncomfortable, especially with unstable-like chairs! \n\nI come here for family gatherings because the price is very reasonable and we have a family friend here whom is very accomadating and friendly whenever we're there.\n\nCame here three times in total, two out of three times the food is delicious. Dishes to recommend: Sweet Spare Ribs \"Ging doe Gwut\", Sturgeon fish cooked into two dishes, one mixed with veggies, and the other one mixed with the fish bones & tofu and mushroom, Spinach with egg, Honey Walnut Prawns, Stir Fried Clams ( big sized clams full of flavor), Garlic Pea Sprouts, Braised Tofu with Veggies, Bitter melon with spareribs (beware, bitter melon is bitter...if you like that type of vegetable, you will appreciate the bitterness) \n\nDishes to pass on: Beef Pan-fried noodle (beef were bland, noodles were crunchy good though), Fried pork intestine ( some pieces seemed raw & was not crunchy like other places), the Cold Steamed Chicken from the front ( dry, no flavor, and was served to us raw before)\n\nUnfortunately whenever we eat here for dinner, the roasted pork is either \"old\" or out so we didn't get a chance to try.\n\nUnlimited Rice! not served per bowls.", "author": "Shirley A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "I remember coming to this place every once in awhile with my family when I was younger. Haven't been here in awhile because my grandparents moved closer to us but we did stop by today for a late lunch after taking my grandma to her appointments around the corner. Not much has changed. The food is still legit. Great Chinese bbq/deli up front. Big portions and its cheap! We ordered seafood chow mein, beef chow fun with gravy and westlake style jook. Everybody left full and we still had leftovers. Where else can you get lunch for 4 including tip for $18 and change?", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-02", "description": "Not special or anything, just plain humble blue collar Hong Kong style Chinese food. It is tasty and filling, but not spectacular or even special in any way, but then again, that's part of the appeal of this place. This is a good place to have an inexpensive lunch in the city, portions are big, food is 3 stars, but value is 4 stars. I wish I cold give half stars.", "author": "Winston W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "Soul food - Chinese style. Can't beat the prices. When you want to get real, eat here. Roast duck, ese.", "author": "André C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Three items for $16.99 means very good comfort food.  nothing fancy.  soup is free.  rice is extra.  good comfort food.  good company and you have all the right ingredients for a great meal", "author": "Bill L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-22", "description": "Yum! Chinese food after a long day walking around at the Chocolate Festival. This is a place my boyfriend used to frequent when he lived in SF and I was really craving some sort of noodle soup for cheap. We walked in and were greeted right away and given a table. Our waiter was real nice and when my boyfriend asked in one dish came with vegetables (which it didn't) he told the cooks to put bok choy in it for us! Sweet jeebies! \n\nWe ordered a noodle soup with beef, some pork jook, and lai fun with bok choy. \n\nNoodle soup with beef: Delicious. The noodles were glass noodles but still tasty. The meat had nice tendons attached, which always give great flavor. It was my 2nd favorite dish.\n\nPork Jook with preserved egg: The preserved egg gives the jook a lot of tastiness but I don't eat the egg itself, that's for my boyfriend. it was a bit thick for a jook, but still tasty. The pork was salty (in a good way) and fell apart in the jook. NOM! I loved this dish. It was so filling and tasty! MY favorite dish of the night.\n\nLai Fun: This was alright. It was my first time trying lai fun and it reminded me of chow mein that was chopped crudely and covered in soy sauce. It was tasty, yes, but it was hard to eat with chopsticks. I'd probably avoid getting it next time I come. Kudos for the bok choy, which was clean and really absorbed the flavor of the noodles and sauce.", "author": "squishy b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-28", "description": "My boyfriend and I spent a long weekend in San Francisco and on the top of our to-do list was to go to a great little hole-in-the wall Chinese restaurant in Chinatown,  We found Yee's and were very hopeful considering it looked like it catered to a lot of locals. Inside was very simple and kinda dirty.  We were seated right away and everything sounded great on the menu. We were really bummed when the waiter came around to take our order and we were told that almost everything we were planning on getting was sold out or they no longer made it.  No big deal, we just ordered the Mongolian beef, pig intestines, half of a duck, and shrimp fried rice. \n\nWe got our food very quickly, I don't even think it was 3 minutes since we had ordered.  The Mongolian beef and shrimp fried rice left much to be desired.  Both dishes had absolutely no flavor, which surprised me.  I din't try the pig intestine or the duck (those were my bf's dishes), but he said he's had better.  \n\nOverall it was a pretty disappointing, but maybe we just came on an off-night.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "The best place to get duck in Chinatown.  The roast duck is tender and delicious. The won ton soup is to die for, a large portion that can be shared between two people.  Fried rice is good and not greasy.  Very reasonable prices.  Quick service.  Serves beer and wine.  Casual, family style.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "I am not a big fan of Chinese restaurants in general.  When I crave Chinese food, I prefer the great cooking of my parents.  But there are some occasions that we have to go out to eat and I have long ago, given up on trying new places with my parents.  They want cheap, big portions and fast service (aka...Chinese Food).  That is where Yee's come in.  They are close to home, they are well staffed and never short handed, they have good prices, and they have good portions.", "author": "Stella C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-19", "description": "My buddy and I strolled into Yee's restaurant on a whim. First noticeable thing is all the dirty, old Chinese men eating all over the restaurant. \n\nWe sat down and everything on the menu was pretty much under $5. We ended up getting two bowls of wonton soup and they were each like $4. Not a bad deal. We didn't specify wonton noodle soup in one of them, and when we consulted the waitress, she advised us to just order another side of noodles instead because they would take some of the wontons out. thanks for the tip!\n\nthe food was pretty good. i think everyone else has it right: what you see and pay for is what you get. that goes for the service too. i swear i saw our server pick his nose on the way out of the kitchen. gross. i'm a big germaphobe. and that is not okay to me.\n\nwe ordered another chicken, boiled, and the check came out to be $18. kinda surprisingly pricey, but i think it was because of the chicken which we ended up taking home anyway. \n\nanyway, i would definitely stop by for a quick meal if i needed a meal in the city. not a bad deal if the server's boogers don't land in my meal", "author": "stacy c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-19", "description": "Yee's Restaurant is a good value Chinese dining experience.  Saw outside their posted menu three items for USD 15.99.  There is a on display food items to go.  We got seated inside and given menus but not the one we saw outside.  I asked about the menu with three dishes for USD 15.99.  Another menu was brought to us with that offer.  We ordered a roasted pigeon, tofu with preserved vegetables, and a fish, but instead of deep fried on the menu, the waiter suggested I could order it steamed with ginger and scallions instead.  The fish was great, the pigeon was too salty, the tofu was very delicate and the preserved vegetables on it way too salty.\n\nWe tried coming here another time but they said they were closed even though there was still another twenty minutes before their stated closing time of 9pm, need to be seated at least half an hour before their stated closing time from that experience.", "author": "George L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "The three choices for $16.99 can't beat that. Peking spareribs, fried flounder and salt and pepper wing goooood stuff. House rice was disapointing. The place was packed. The service was ok, I seen the waiters getting messed up lol good times good times.", "author": "Sothary C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-08", "description": "This place has CHEAP Chinese food. For a table of 6 with 6 plates, dinner with tax came out to $50! They also have this special menu for 3 items on the list for $16.\n----------------------------------------\nHot and Sour soup- 3.5 stars. It was interesting the stuff they put in here. I've never had this soup with raddish before. It actually tasted pretty good and it was the perfect spicy/sour ratio.\n\nBBQ pork- 3.5 stars. Yum.\n\nRoasted pork- 4.5 stars. The best dish of the entire meal. Who can resist that fatty, crunchy, fried pig skin? Mmmmmm.\n\nWalnut shrimp- 1 star. This was horrible IMO. It had too much mayonnaise and the shrimp tasted FISHY. YUCK.\n\nSalt and pepper fried chicken- 2 stars. It tasted ok, but a little dry. I've had better chicken wings.\n\nClams with black bean sauce- 3 stars. Comparable to other places, but still tastes a little fishy to me. On the plus side, the clams seemed to be on steriods.\n------------------------------------------\nAnd it IS a Chinese restaurant so service is a little spotty. The waiter was nice enough though and even suggested 1.5 bowls of soup for the whole table when we asked if one was enough. That was a first! And instead of fortune cookies, they give out sweet, tastes like liquid sugar watermelon! YUM.\n-----\nOh, and CASH only!", "author": "Ling H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "When I saw this place is full of local Chinese I know this must be a very original Hong Kong restaurant. Most of the customers here speak Cantonese that makes me feel I was eating food somewhere at HK. I love it! The Roast duck and ginger fried seafood tastes great. They serve free fruits for you as dessert when you finished your meal. The price is so reasonable! However, be aware of the \"a little bit dirty\" environment.", "author": "Jessica Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-25", "description": "Came here twice. My overall rating? THIS PLACE SUCKS. \nIf I were you, I'd go anywhere but here. \n\nThe first time, the food was LUKE WARM. The only thing that was hot was the tea. The floors are hella sticky too. \n\nThe 2nd time, we got some shitty service. I swear though the food here is either stir fried or deep fried and nothing else. The waiters totally ignored us, and when we asked for a small box, they give you this \"we hate our own Asian kind\" look, they ignored us. We left without paying them a tip. \n\nYee's service, food and atmosphere SUCKS. The only reason their open is because its on Broadway and Grant, right smack in the middle of the tourist area. I feel sorry for tourists who end up eating here, then see them dart for a bathroom. \n\nLastly 3 out of 5 of my friends got sick here. They had upset stomach for a week.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-26", "description": "2009-12-25\n\nBeen there many times, place is bad and really bad... as usual, but what makes it really bad this time around is this\n\n1. I ordered a roast goose with rice, usually it comes as leg quarter and believe or not it come just the \"drumstick\" this time around and it is $7 now... price increase\n\n2. Food volume seems to be decreasing much more than before.\n\nIt was really a good budget restaurant before, but makes no mistake, this time they really screw one loyal customer....", "author": "Wils G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "Came here with my dad, walking through on our way to the waterfront touristy stuff. We hadn't looked up anywhere to eat and were looking in the windows of places, trying to decide, when my dad was about to give up and just buy a piece of fruit. I laid eyes on Yee's and decided we would go there. \n\nIt looked full of locals, so we figured it must be pretty good. Opened the menu and were very pleased with the prices. My dad had the \"Vegetarian,\" which included seaweed, and he was pretty stoked about that.\n\nI asked the waiter what the most popular thing was that people ordered, and he said the roasted meats, namely the duck, goose, pork. I ordered the duck with rice, and there was not quite enough rice, but the duck was excellent (though very fatty - I got a bit of a stomach ache later on. Think Whitecastle's sliders...yeah). I forgot to ask whether they used MSG, but I couldn't taste any, and I didn't get that weird sleepy feeling afterward that MSG gives me.\n\nUnlimited tea, though I guess pretty typical, was a nice treat on a long day of walking.\n\nI'd recommend it if you'd like a low-cost Chinatown lunch to offset the cost of those pricey Ghiradelli ice cream treats and boat rides around the bay. My dad and I certainly found our Yee's experience to be satisfying.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "We waited in line for about half an hour granted that it was 7pm on a Saturday night, nonetheless during Mother's Day weekend. It's definitely a place where you have to stand your ground and make sure that you get your table. People aren't going to be nice to you here.\n\nWe ordered the $138 dinner special and the food was AMAZING! Everything came in big quantities and we had 5 take home boxes after the night was over. I must say that it was the most I've eaten in a very long time.\n\nThe staff was excellent too, catering to whatever we needed even though it was extremely busy in the restaurant. I'm giving it five stars for the food and the service.", "author": "Teresa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-11", "description": "All around the world, there are apparently multiple ways to say something along the lines of\n\n\"Ehhhh, it was just alright\" \n\nor \n\n\"Well it wasn't earth shattering (referring to food or sex, or food porn for that matter), but it wasn't like it made me cry afterewards, I don't need a tissue, dear.\"\n\nIn Cantonese one might say\n\n\"Ma Ma Dei\" (which is just bordering a bit on the bad side) or \"ma ma fu fu\" (with a slight emphasis on clumsiness and lack of care or putting one's heart into improving the outcome)\n\nIn Mandarin, the equivalent would be \"ma ma hu hu\"\n\nAnd in French from what I remember, it's \"comme ci, comme ca\" (pronounced comme si, comme sa) which sounds a lot more snotty.\n\nYee's is one of those neighborhood type eats, no nonsense. The Chinese name is pronounced Mun Jai Gei Siu Lap Cha Chaan Teng. First three characters is like \"Little Mun's\" (or \"Mun-chan\" in Japanese speak). Siu Lap referring to the fact that this place specializes in Cantonese style ROASTIES. Cha Chaan Teng is a Hong Kong style cafe that typically serves a mish mash of Cantonese Chinese and HK style western. \n\nSo once again, a generic name like Yee's Restaurant doesn't tell you anything else.\n\nFrom what I remember about Yee's, they don't have a HK style western side to their menu, and perhaps the substitute to that is roasties.  I can't remember if they have HK milk tea and if they did, whether it was worth the bother.\n\nSo if you're here to cure hunger pains, prefer something that's good value (i.e. half decent to decent portions but not sextacular refinement) then Little Mun's will roast and pork you in the stomach.\n\nCongee was not earth shattering here, just hit the spot, but didn't produce those orgasms like at Hing Lung (which they are more well known for orgasmic creamy congee that takes your high to the clouds).\n\nIf this place were in the South Bay or Peninsula, for sure it would rate a lot higher.", "author": "Ken K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "Saw this on Shirley Fong-Torres's website; it was one of many restaurants she took one of her tour groups to and well no frills, it makes up for it in the low prices, friendly but brisk service, and simple Cantonese food.  The pot stickers are crispy golden with a wonderful ground pork, cabbage, and ginger filling; perfect with the rice vinegar.  The beef ly fun is to die for with tender marinaded beef and light ly fun with that golden wok taste.  The kung pao chicken is tender with mushrooms, peppers, celery, carrots, and peanuts in a chili sauce that packs a bit of spice but not like at a Szechwan restaurant as this is a Cantonese restaurant.  I would definitely come back.  So, for excellent simple Cantonese food at low prices with brisk but nice service in a friendly no frills atmosphere, Yee's cannot beat beat.  Keep up the good work guys.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-09", "description": "This place is Chinatown cheap!!  You can't beat it.  At first i didn't get what was going on.  Plates were being placed on a table, and you just get what you want.  Each plate is 2.60!  - they had plates of chicken, fried rice, noodles, etc.  All the usual chinese foods.  There's no ambiance here - it's like a cafeteria but if you are craving chinese food, and in the neighborhood, with only a few dollars in your pocket, you will eat well here.", "author": "Bebe W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-02", "description": "My friends and family all agree on this: Most Chinese people will not opt to eat Chinese food in Chinatown when they are in San Francisco... especially if the restaurant in question is on Grant Ave. We never, ever eat on Grant Ave. since almost every single store on it caters to tourists (okay, so maybe not the live poultry shop, but...). \n\nI came here with coworkers while I was working remotely the other day, and the food was definitely just okay to sub-par. The beef chao fun was really greasy, the sweet and sour pork heavy on the cornstarch, and the pot stickers pretty unremarkable, especially in comparison to the ones I love in New York. The beef stew, a dish that I chose, was a good dish, but it was still a little oily. \n\nIt also didn't help that the bathroom was flooded and I had to nearly swim to get to the toilet. Not good.", "author": "Yvonne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "Remember Chinatown is not where you want to be for great Chinese food..........but when in Rome..............\n\nThis place is good..............just don't order the food that is on display.  They have your basic foods out there.  Chicken, pork, goose, duck, intestines...........etc.  Order food that the chef have to make to order.\n\nSalt and pepper chicken wings with extra peppers\n\nSalt and pepper spare ribs\n\nCrispy fried chicken\n\nAny of the vegetables of the day\n\nI even had curry chicken today and it was great.\n\nPrice is very reasonable...............will always come back here.  \n\nI actually walked by on Jackson St. and they have this special for 5.95 for all you can eat dim sum.  Sounds very scary and looked very interesting.  It is alluring enough where you will say.............sure..........why not.....  6 dollars for all you can eat.  hahahaha.  \nI need to get a dozen shots of grey goose at Mr bings or Reds before I will eat over here.  You never know.............i just might.", "author": "jason g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-11", "description": "Wow, I'm truly surprised by such a high star rating. \n\nEvery time I've been there (it's been awhile since the last time I went, and for good reason too), I ALWAYS end up with a stomach ache.. ALWAYS. I don't know if it's me or what. I just have bad experience with this place. The food was decent for Chinatown, but it's the after effects that are the reasons that I'm giving such a low star count.\n\nEven though my bad experiences with this place happened awhile back (at least 3 years), it has placed a long-lasting impression on me. I'm sorry, I cannot in MY right mind come back ever again. I sincerely hope this restaurant has changed a lot since I last went.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-02", "description": "Cheap, but the duck was not that great.  Upset my stomach and my son wasn't well the next day.  It wasn't food poisoning, but it wasn't pleasant either!", "author": "Kristin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "I had the best salt and pepper fried chicken wings I have ever had here. The Colonel Harland Sanders should run and hide because his do not compare. \n\nThere were noodles on the seats, a roasted pig on the counter, Budweiser served out of the can, and millions of people crowded into this restaurant and I loved every minute of it. Although I found the plastic chop sticks nearly impossible to use (compared to the wood ones) I struggled through it and finally just started eating the delicious pot-stickers, egg rolls, and chicken wings with my hands. \n\nThe food is so incredibly cheap. If you have a choice, which I am sure you won't, try to sit by the butcher. You see tons of chickens, ducks, and meat being chopped and served. At one point I saw a chicken head, beak and all, be chopped and I swear we made eye contact. It was quite an experience. \n\nWe left with tons of leftovers and full bellies. It was just $30 for three of us to eat a ton! Now that I know they have take-out I may be back for those wings mid-week. The window display says it all... authentic and good!", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "Every time I come to SF via BART we walk here and grub!\nCheap but good eats and their economy plates are filling. \nInside they usually have a couple of large tables with plates of roasted, fried and other items you can just grab and bring to your table.", "author": "Beezy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "Passed by Yee and saw the perfectly glazed roast duck screaming my name telling me to eat her....\n\nHow can I resist?\n\nSo I sat down with my coworker, we both ordered the irresistable-looking roast duck with rice noodle soup.  OMG, generous portion of duck and bouncy rice noodle in nice tasty broth.  The best duck noodle soup I had in a LONG while.\n\nAnd the best part is?  Including tax, it was only $5.50....  Wow...", "author": "Gigi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-11", "description": "This is your typical, delicious Chinese restaurant. I was disappointed though because they didn't have any roasted duck left - seriously disappointing. But everything else was delicious and good prices.", "author": "Diana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "Yee Yee!! :)   I am giddy from my visit here for dinner. Unsure of what to pick, we decided to go with Yee's ...boy was it a wise choice! \n\nThe food: excellent.  All very flavorful and chinese greasiness at its best! The meal consisted of Salt & Pepper chicken wings (VERY flavorful), Hong Kong Style Chow Mein, Eggrolls, Potstickers, Broccoli Beef, & of course rice. All recommended plates that were full of flavor. And best of it, good portions for a reasonable price. The 3 of us engorged in all this food for merely $30. WOW.    \n\nMost exciting umm okay maybe weird: Pigeon. I was actually a bit disgusted considering I see like swarm of them dirtifying their selves on the street daily. I just hope they're not finding these birds on the street! I'm too much of a wuss to try that out. \n\nEnvironment was very busy. Crowded, and full of many chinese families, which was good to see! All them hanging out, drinking Budweisers out of cans, whole pigs chillin, & whole chickens hanging on skewers..occasionally the butcher comin around to chop em up. Cleanliness....well it's an Asian restaurant, it's not the cleanest, but not the dirtiest! \n\nI definitely had fun here. The service was nothing to complain about and they were pretty nice & served us fairly quickly. I'll be back for more chicken wing action...and maybe suck it up and try one of those pigeons......  \n\njust maybe....", "author": "Catherine O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "My dad cooked all his life for a living in Hong Kong and the Bay Area, and we always come here whenever we go out for dinner - so much that the staff knows them! Enough said ;)", "author": "Lois W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-02", "description": "Went there on a whim one Sunday evening, when most other restaurants and bakeries were closed. They had a good selection of entrees on their 3 for $15.99 menu. The portions were very generous for the price that we paid, and the service was quick. Our order of pigeon meat with sugar snap peas, beef with Chinese broccoli, and seafood tofu hot pot came with a bowl of yellow bean soup. To no surprise, they charged us extra for steamed white rice, but the meal still came out to be just $22 including tax + tip, and we had plenty of leftovers!", "author": "Tina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-11", "description": "NOT GOOD. I feel like I would get sick from the food -- SOOOOO much oil!!!!! GROSS CHINESE FOOD. I had the peking duck with rice. EEEHHH... anyway not coming back here again.", "author": "Vera W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Very VERY authentic. Probably a bit too authentic for my taste and I'm a fairly adventurous eater. The roast duck was phenomenal but the beef was mushy, slimy and fatty. Steer clear of pork & beef. Pot stickers were good and doughy.", "author": "Cassie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-31", "description": "Food - 4\nService - 3.5\nAmbience - 3\n\nOn a rare warm San Francisco night, my husband and I  ventured forth to show his 20 year-old cousin around the City (he had just moved up here for school). We tried to go to R&G Lounge, where I was told that they were \"full\" when I inquired how long the wait would be. Hmph ...\n\nSo, onward we pushed with our empty stomachs for some din-din. Lucky for us, the cuz had a trick up his sleeve and took us to Yee's Restaurant. After getting over the initial shame of letting him down and having to rely on a kid who had only been in the City a mere 4 days to show US around ... I stepped boldly into Yee's with a skeptical mind. After all, what did a 20-year old Caucasian boy know about good Chinese food, right?!\n\nWell, I could not be more proud of him! Yee's is a GREAT family restaurant with flavorful, authentic food at incredible prices. If you go there, you MUST have an open mind about the service & decor - neither of which is anything to write home about. Their seating system, or lack thereof, can be a bit frustrating as it basically consists of standing around waiting for a table to open and hoping that the staff remembers you were here before the people next to you. The chairs & tables receive the cursory wipe down after each patron leaves.\n\nBUT if you can see past these two elements, you are in for a treat. We dined on the 3 for $15.99 dinner menu. The cuz really wanted the char siu, which was good - a little fatty but cooked perfectly so that it wasn't dry. We also had the mixed seafood with vegetables dish - squid (again, cooked perfectly and not chewy), shrimp & bok choy - fresh & flavorful. The final dish was the black pepper chicken (or was it pork?). Regardless, it was DEE-LISH. Very peppery.\n\nAdd to that incredible value, the free soup at the start of the meal (any place that will include the chicken head in the soup means serious business, I say) and free watermelon at the end of the meal (who needs fortune cookies?!), and you've got yourself one heck of a meal for under $20.", "author": "Lynn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-09", "description": "I love this place for lunch. Perhaps it's the equivalent of an HK greasy spoon or chopstick but the roast duck and assorted canto dishes are awesome. Service is fast especially if you know what you want. If you use the restroom, you have to go through the rest of the building, and um, don't look around too much in the back. hahahaha.", "author": "Miguel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-05", "description": "So I went to SF about 2 months ago with my girlfriends and Jamie D. highly suggested this restaurant.  I was sooo darn hungry that night and I remembered ordering my all time favorite, bittermelon cooked with black bean sauced spareribs.  IT was YUMMM!!  The next day, my family went to the same restaurant too!  From what I hear from my aunt, there were actually commercials in Hong Kong promoting this restaurant.  I guess word gets around.  The plate sizes are HUGE and it's a great deal for the price that you pay.  I believe it's cheaper than the restaurants in Monterey Park.  \n\nTrue, this is not a place you take on a first date because there's no ambiance here whatsoever.", "author": "Jacqueline T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-16", "description": "I've been walking by Yee's several times a day for several months so I finally stopped in... Nothing really that special. The food was cheap but overall just mediocre.\n\nI doubt I'll go back.", "author": "Thel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "DO WANT!\n\nThis place is extremely overcrowded, which means you have to fight for your food like a gladiator. Fortunately, it's worth it - their roasted/bbq meats are delicious. Although the duck wasn't torched enough, so it had a little too much fat left on it. Prices are dirt cheap: for under $5 I can get a big ass plate of bbq meat and rice. They also have great garlic bok choy - very tender and delicious broth.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-01", "description": "Yee's is a great spot for cheap Chinese food in Chinatown.  I took a Chinese friend who was visiting the city and she felt that the place was very good.  She commented on the won ton soup, which I have to agree is especially good here.\n\nI am not a big fan of the ducks and what not hanging in the window, but if you can get over that, the food is very flavorful.  The portions are also large for the price.  The atmosphere isn't worthy of 4 stars, but who cares if the food is good and cheap, right?  Personally, I find this restaurant to be very entertaining.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-30", "description": "It's where to go for cheap-but-good Chinese. They have a $5 menu that has tons of great dishes; I got a pan-fried fish here that would cost $10 anywhere else. When I'm feeling too lazy to cook in the winter I come  for a massive container of jook that serves as both dinner and the next day's lunch. \r\n\r\nThe decor here is nothing to brag about. They've got flimsy tables and duct tape on the chairs, but with such good value for the food, I can't complain.", "author": "Lorenzo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-02", "description": "Good food,great price,moody service and hard to find parking but it\"s worth it.", "author": "jose m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-27", "description": "Can we give this place a a negative star. Restaurant maybe less than half full. Early to lunch. Seated and served tea. Waiter took time to get order. Sat and sat and sat and watched everyone else who came later got their food. We waited patiently for close to half hour before flagging the waiter. Waiter mumbled that we were to wait (even longer). We upped and left.", "author": "Rrr X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "Superior won tons in the won ton soup with perfectly cooked greens. Not-the-best-quality-but-not-terrible beef in the otherwise delicious beef with bitter melon. In short, everyday delicious Cantonese food the way it's supposed to be. Yum.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "Are you in Chinatown and wanting cheap excellent Chinese Food , then this place is it. It has a wide selection of seafood with mixed Chinese BBQ such as roast duck char su (BBQ pork) roasted pork and a good selection of seafood. One fault it has is the specials are in Chinese and there is a hidden menu that has 3 items for 16 bucks ( you can add extra dishes on that menu for just 6 bucks more) which comes with soup, rice is optional at 1 buck per person all you can cram in your mouth. I've taken many of my of friends here and it never fails to amaze the quality of the food for the price they charge. This place is cash only and if you get there by 830 they'll cook up your meal and close shop.", "author": "Jorm K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-10-31", "description": "Well, I had to give 1 star somehow... the chicken was uncooked, bland, no salt and had a few drops of soy sauce...the chowmein was cold, half cooked and the chicken smelled... the fish curry had a few peices except there was no curry and humongous vegetable peices. At 3, they line up the left overs of the day for $2, which is a culinary suicide.\n\nDont even think about going here", "author": "Sav B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-16", "description": "don't patronized this place, they are thieves.\n\nhere's our story, i drove my mom here after work to pick up some dinner to take home.  she decided to buy 1/2 of a duck last minute, they are the ones just hanging by the window.  it cost $6.50 for the 1/2 of the duck.  the man took the duck to chop up.  he does this behind a metal screen of some sort.  when my mom got home, she looked for her absolute favorite piece to eat, the shoulder and wing.  you guessed it, it was missing.  she bought 1/2 a duck, it was attached when the man took it behind the screen to chop.  why is it not in her box?  we hear about this a lot on the chinese radio station about other restaurants.  the workers steal a piece here and there and add up the pieces to put on a rice plate.  it's so dishonest of these people, give me what i paid for.  GIVE EVERYBODY WHAT THEY PAID FOR.", "author": "Jeanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-21", "description": "Beef chow fun for $5?  \n\nBeef chow fun portions large enough to feed two people?  \n\nBeef chow fun large enough for two people for $5.  \n\nWhere do you get this?  At Yee's Restaurant.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-04", "description": "This place offers pretty authentic Cantonese dishes. The mune is huge so you will definitely find something you like. The best deal for a group or family is the three dish plus rice option. You get to choose three dishes from a long menu for a extremely reasonable price and it comes with steamed rice. The portions are very generous and I always leave with leftovers. They also have a counter that sells cooked food and roast ducks and the sorts. If you go in late afternoon, they have discounted dishes lined up on the table. Whenever I don't feel like cooking dinner, I stop by there to see what's out. This is definitely not a tourist trap.", "author": "Alva L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "i sort of have a love/hate relationship with yee's... the kind you have where, as a kid, your parents drag you here every week without fail, whether it's for breakfast, afternoon tea, or dinner. you get so used to their 3 dishes for $16 and set menus that it drives you nuts, but your parents still come here because it's a good value.\n\nbut tonight i was reminded of the perks of being regulars here: kind service and decent quality. tonight we ordered some special things for my mom's birthday, including:\n\n- shrimp and fruit salad (special request) consisting of fresh shrimp, white peaches, asian pears, cantaloupe and lichee mixed with mayonnaise... you may think it's weird, but it's frickin' genius!\n- deep fried quail... delectable, especially with a little squeeze of lemon\n- mince squab in lettuce cups... usually you get maybe 8 nicely trimmed lettuce cups if you're lucky, but since we're regulars we nearly got a whole head!\n- fresh stir fried fish with crispy bones... very nicely done with crunchy deep fried fins to nibble on\n- stir fried yam leaves with bamboo pith... delicious! yam leaves look like spinach but without the iron-y taste. i guess it's in season now.\n\nwe also had clams, crab, sweet and sour spare ribs, and e-noodles... all for a great price. and of course there were plenty of leftovers afterwards!\n\nso although we come here too many times for our own good and are usually served pretty standard fare, it's nice to know that they can whip up a spectacular meal every so often.\n\n***\nfyi, my company often orders huge pans of food from here for lunch... they're really good about pulling things together for us and even delivering (ymmv... it may be that we're \"regulars\" again). around thanksgiving time, they also sell roast-duck style roast turkey... pretty good! also one of the few places in chinatown that has roast goose.", "author": "Andrey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-27", "description": "The best kept secret in Chinatown at 3pm they put out several dishes at $2.50 each.  Succulent duck, wings, fried rice, noodles, stir fry veggies, fish.  One dish is enough to be full but I usually get two dishes like the soy sauce duck wings and vegetables.  Eat half of each and take home the rest.  It is a dive place but if you are looking for lunch under $5 try it out.  Greasy yes, noisy yes, not intimate or private yes, decent food yes.  \nI love the chicken chow mien they go heavy on the bean sprouts.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-30", "description": "A group of us were looking for some Chinese food and thinking that since we're in China Town we should surely get great Chinese food wherever we went. We saw the good review in the front of the restaurant and was interested in the Peking Duck because the review claimed that it was the best in the city. \n\nWell the review was badly mistaken, unfortunately. The duck was salty and the skin was not crispy. Everything we ordered was too salty including the fried tofu. To boot, the service was horrible. There were probably only three tables occupied and yet we waited and waited for service. \n\nThe only good thing I have to say is that it was cheap and there was fresh cut watermelon in the end. But that's it. \n\nSave your money and go somewhere else.", "author": "Lena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-18", "description": "Two words ... ROAST PORK ... heaven!  The meat is tender and amazing, the skin is crisp like a potato chip, but so much better.  We always get the same thing, Roast Pork, Rice Porridge and Potstickers, so good.  Service here is dicey at best, but who cares when the pork is perfection!", "author": "Troy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-28", "description": "Second visit here and last.\n\nI ordered off of their 3 item menu for $16 thinking it's a good bargain.  I found out why...the food was spoiled.  Salt & Pepper shrimp was ok, except for the 3 or 4 in there that were rotten.  It was absolutely disgusting.  Thanks for ruining my day...I was nauseous for the next 24 hours, but at least I didn't throw up.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-06", "description": "Unbelievable how some of the staff are useless. We waited 30 min for our spare ribs and we asked three times to check on it. One of the servers just walked and came back to sit on his assigned chair. That's his job. Sit there. Then after we paid that useless derp had the nerve to insist we pay more tip. Just about blew steam from my ears.", "author": "gemste g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "My wife and I took a time out for a day in Chinatown in San Francisco.  As always,\nwhenever we are in Chinatown, we make a point of having lunch at Yee's Restaurant.  It is not a tourist restaurant, but a local eatery. The atmosphere is\ntypical of a local restaurant and not at all fancy. The food is what constantly draws us\nto this delicious restaurant. The portions are large, the service is good, and the prices are very friendly. The set menu for a three course lunch is under $7.00.\nWe always order a big bowl of their wonton, noodle, and pork soup and that is\nunder $7.00 (that is in itself a meal for two). The last trip there, we had the soup,\na  ala carte dish of sweet and sour pork, and a bowl of rice. We had enough\nleft over for a doggie bag. The price of this banquet was under $15.00. This\nincluded the tea (which comes with the meal) and tax. The tip was extra.\nI can't say enough good about this place, except go and enjoy -- I think\nyou would like it !!!", "author": "Joseph Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-22", "description": "Chinese BBQ finger licking good. Try the roast pork, or 3 items for $15. I have never left this place hungry... neither will you.  Best Chinese BBQ I have found in Chinatown. Its a kitchen/cafe so dont expect extravagent decor. Cha siu anyone?\n\nThe way I guage a chinese restaurant is by the number of patrons, and how many of the patrons are actually chinese... this place gets an A+. Place is packed with locals during lunch... \n\n\nDont expect the waiter to come to you when you need something. Holler at em and wave em down chinese style. =)", "author": "Jay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "Come here for good size portions, value for the $, and free soup of the day if you ask nice.  Favorite thing to get here is the duck!", "author": "Marcus L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "Went to Yee's twice last week while on business in SF.  This place is cheap - especially with their 3 entrees for $15.99 deal though with a catch that I will go into later.\n\nFirst visit came after a whole day of sightseeing throughout the SF area.  Lots of walking from Nob Hill to Fisherman's Wharf, Ghiradelli Square, Pier 39, North Beach, and all over Chinatown.  Finally decided on Yee's as we wanted to dine at a \"hole-in-the-wall\" place full of locals.  Placed two take-out orders of their roast duck + roast pork over rice combos ($7.50 with tax each as of 6/19).  Unfortunately, they were out of roast pork so substituted with bbq pork (i.e. the red pork).  The pork was good, no complaints there.  Although the duck was tasty and cooked well, they were on the extremely small/not meaty side.  One thing we really liked about the take out order was that they actually included bok choy with the rice!  The veggie made the takeout order into a more complete meal, i.e. meats, rice, and veggie.  The sauce that was poured over the rice was quite good as well, just wished the duck was meatier.\n\nSecond visit was a sit-down dinner.  Went for the 3 entrees for $15.99 deal plus a couple of additional dishes.  Before I go into that, we were pleasantly surprised that we were given a free bowl of artichoke soup/broth.  It was a very simple soup with a couple of pieces of artichokes, but good.  As for the dinner, we got 1) Deep Fried Flounder with sauce 2) Salt & Pepper Shrimp 3) Seafood Tofu Clay Pot  4) Kong Xin Cai 5) Whole Roast Duck.  The last two items were not from the $15.99 deal.  First, the fish was quite small while the salt/pepper shrimp was overcooked as they came out soaking in oil.  The seafood tofu claypot, though good, was NOT a claypot.  It was a mere mini metal wok.  The most disappointing was the duck.  For a whole duck, it was really devoid of meats.  It actually looked like half a duck - for $7/duck I guess that is to be expected.\n\nAs with most \"hole-in-the-wall\" restaurants in Chinatown, there was only one bathroom per sex and it was essentially a closet.  To get to it, you must walk through the dish-washing part of the kitchen with dirty/used plate/bowls stacked everywhere.  I got so tired of waiting to wash my hands in the bathroom that I just washed them over the industrial sized kitchen sink.  \n\nOverall, the dinner was somewhat disappointing, not bad, but also not great.  Came out to about $45.  Decent meal - A-OK.  Bear in mind - cash only.", "author": "Melvin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-16", "description": "Shrimp with scrambled egg. Try it.\n\nWent to SF several months ago and wanted to eat Chinatown for sure. This place was filled with locals so you know what that means. Prices were great and there are alot of items on the menu. What it would take  2 chinatown restaurants in Chicago was accomplished here if that makes any sense.", "author": "Marcus Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-11", "description": "Yee's restaurant is a solid, unpretentious Cantonese restaurant in the heart of Chinatown where you can get a good, simple meal at an extremely reasonable price.   The restaurant is popular with Chinatown residents, which speaks volumes about the quality.  There is also a Chinese BBQ on the premises, with the usual \nchar siu pork, duck, chicken, and cuttlefish gracing the front window.\n\nSure, you can get sweet-and-sour pork, but during lunchtime, most folks gravitate towards the rice plates; the fish fillet and vegetables over rice seem popular, while I prefer the BBQ pork and duck with rice.  Most rice plates are $7 or less and include a large bowl of soup (the composition of which seems to vary day by day, but seems to include\nlotus root and pork neck bones; it's always quite good). You can watch as the BBQ meats are unhooked, chopped, and plated for your table, so the meats are a low-risk path to a good meal.\n\nthere is also a $15-for-3-dishes option, where you select from any 3 items from a substantial menu.  I've only tried a few of them (Chinese broccoli, BBQ pork, and braised tofu), but they were all solid and the ingredients were fresh. there are many more items on the menu, and I bet there are several culinary gems hidden within.\n\nall in all, if you're looking for a good, unpretentious meal,  try Yee's.  As with many authentic Chinese restaurants, the menu rewards the open-minded eater.", "author": "Rob Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-21", "description": "Still not my favorite little Hong Kong cafe (next to Washington Bakery), but it is definitely up-and-coming on my list.  The real draw to Yee's for me has always been their breakfast jok special.  For the ungodly price of $2.50 (if my memory serves me right), one gets a HUGE bowl of jok with yao ja guai on the side (or cut-up into the jok).  Additionally, one can have anything from shredded pork to thousand-year egg in your jok.  So, for your two-fifty, you tend to get a lot.  As well, Yee's duck is a treat, either to eat there or to take home.\n  So, Yee's is yet my favorite little place but, who knows, if I find myself going there more and more, the tides may turn!", "author": "Scott N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-20", "description": "Good chinese food.  Portions were hearty especially for the price.  I got a bowl of noodles for under $5.  It didn't look that big when it came, but man was it PACKED with noodles, meat, preserved vegetables, sprouts.  A little salty for my taste.  But we ordered a plate of duck for the table and it was also a lot of meat for the price.  I'd go back...would not order the pork/preserved veg noodles again tho.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-31", "description": "I am definitely not impressed with this particular restaurant. Let's just say the service sucks. We wanted to add a particular item to a dish, and no matter how hard we tried, he would not accommodate to our liking. He just kept nodding, NO! NO! NO!.  A bit rude I would say. A lady came out with all kinds of dishes for a special price, like goose feet, chicken wings, and sweet and sour pork, which was all set up on two large tables. I noticed everyone was grabbing something, so I went up to the lady who was preparing the plates what were these particular dishes. And she stared me like I was crazy. I did spoke to her in cantonese, but she seemed disturbed like I have the nerve to ask her about the dish or the prices of each item. Eventually I took a plate home for my dad to eat cause he loves goose feet. The food was pretty good, but the service leaves me totally disturbed. I have never encounter such rudeness in my life. My husband plate had arrived 20 minutes earlier while I sat there watching him eat, before my plate arrives. I enjoyed my dish, and It was pretty tasty, and the prices are pretty reasonable, but I would not ever go back, Next time, I'm in Chinatown, I'm going to search around a bit longer instead of going to the first place I see. That was my mistake.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-28", "description": "food here is really cheap, no kidding.  some dishes were $4.75!...  =o\n\nabsolutely tasty, most of them hong kong derived, dishes u dont normally find in other chinese restaurants, mmm...\n\njook was full of flavor, maybe the best i've ever had, mmm...  that 1000-year old egg, coulda been 10,000-year old, so f-ing gooooood.  each slurp of gruel, orgasmic... \n\nduck was pretty fatty though.  a lot of oil in their food (like i said, hong kong).  interior could use a cleaning.  \n\nsome drunk 60-yr old farts across the room were arguing pretty loud.  all the kitchen staff in their aprons swarmed out, and just stood there and observed, like indecisive meerkats, haha...", "author": "Ethan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "This  one of the oldest business in Chinatown. My wife and family go there often because I live in north beach. it is very average looking restaurant and lunch time gets crowded so get there a few minutes before lunch. they have a large menu and serve everything from 3 dishes for $15.00 to more typical dishes around 5-7dollars. I notice many people order beef dishes apparently regular favorites and roast duck over rice, won ton is (not now) backward and they do have that.  OK the NEGS  no parking don't think about it, orders come out from the kitchens all different time, who every your eating with may have to wait 10 minutes longer while your eating now. noisy and bathroom is 3 out of 10. table of 7people cost us $40.00 without tips.", "author": "Howard J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "I stumbled in here today for some rice porridge to go since I'm sick as hell.  As I was waiting for my order, I noticed two large tables with dishes set out - chicken, chow mein, veggies, tofu mushroom, EVERYTHING!  People were eyeing the dishes, taking what they wanted, and getting it to go.  For $2.50-$3.50 per dish. OMFG. If I wasn't so sick and could eat normal food, I would have totally gotten a few dishes to go because they looked well cooked.  As for the porridge, the ingredients were quality, it wasn't oily and so very cheap at $3.  The staff was also super friendly, seeing that I was pale and near death.  Definitely going to come here again if I make it through the week!", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-04", "description": "My visit here was a nightmare.  I wasn't given a menu - I had to get one myself. I was given tea in an old coffee mug.  The waiter took my order and then ignored me.  The simple noodle dish I ordered took over 20 minutes to come out, although the place wasn't busy by any means.  And lastly, I wasn't given a tab - I had to go to the counter to explain to the lady there what I had ordered so that I could pay and get the hell out of there...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-18", "description": "The chicken is wicked good.  It's cheap.  The quality is definitely better than what you pay for.  For $17.00 including tip I had enough food to feed me for two more meals.", "author": "Po L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "Good basic Chinese Food without the frills. Fresh food, high turnover of dishes seem to show with the freshness of the food. \nInexpensive and a great smattering of dishes to choose from\n\nDefinitely worth returning to", "author": "C Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-04", "description": "I was always wondering why this place has so many people always.  Either it must be 1) very cheap for their food or 2) very good for the price...  It was 1) this case.  \n\nAh by the way I saw the chef cutting ducks picking his nose without even thinking whether he should hide it.  Wonderful, that's Chinatown...\n\nPricing is incredible that you will want to act you didn't see the chef picking his nose and going back to cut more ducks and pigs...", "author": "T T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-22", "description": "Oh my freaking god this place smells something awful! I don't know how people sit there like the stench is okay!\n\nI peeked in and saw a good number of people. So maybe the place is good, since they've got customers. So I took about 7 steps in and then noticed the smell. I think maybe I went too far into the restaurant, it'd be weird if I turned and left. I thought maybe after a few minutes my nose will get used to the smell. So I sat down at a small table a ways in. My god, it was like day old cuttlefish odor in the air.\n\nI got combo crispy noodle. The plate was huge for $6/$7. Lots of stuff. But OHH the humanity!! That horrible smell came from my food too! It's everywhere. The plate looked decent (though I don't care too much for the gooey light brown sauce, yeck). Every single bite was filled with the odor that just made me sick. I managed to take several bites and took the rest to go (thinking I may be able to salvage some of the meats then toss the now-soggy noodles). There was a lot left over. Normally, I would have half left over of such a large plate. \n\nI ended up tossing the food. Realistically, there's no way I'll be touching it again. The thought of the food and restaurant made me queasy.\n\nOf course I felt bad for tossing the food. But man, I can't stand to think of the SMELL!\n\nNever going back there again. Cheap or not.\n\nSide note: when you enter, there's a small station with roasted fowls and whatever else. There was a container of raw dried  duck leg and thighs just sitting next to the counter. Pretty gross. I'm all good with roast duck, chicken, whatever. But seeing the dried raw meat was just EWWW!", "author": "Hmmm O K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-08", "description": "I've never had a bad meal here but be forewarned that the service is sometimes non-existent.\n\nThey also have platters of food for take out spread out on a large table by 3:00 pm; you pick the dish you want, take it to the cashier, she boxes it,  takes your $3.00 (?), and off you go.", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-12", "description": "Not bad. Not the best Chinese in the city, but definitely not the worst. Cheap, good and filling. If you want better Chinese, pay more at the upscale places like Chef Jias or R&G  or venture into the more authentic places that tend to cater to the Chinese immigrants who live up in the buildings overlooking Chinatown.", "author": "Hal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-09", "description": "Lots of average tasting food for about $5.  I had the steam chicken with ginger sauce and comes with house soup on the side.  It wasn't so cheap since they had waiters, and I ended up spending $8 for an average, large portioned dish with tip.  I drank the free tea.\n\nThe plates of food they put out on the tables for people to pick up is to move their inventory so the next day has fresh food.  It's priced low, for many folks who want to take it to go.\n\nI would come here again if i wanted a cheap, decent tasting eat.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "check out the goose over rice \"economy plate.\"  cheap and filling, less than usd $6 and try with the plum (light yellow in color) dipping sauce.  it is sweet and sour.  if you want the most \"bang\" for your buck, go in after 1500hrs for the \"happy hour.\"  taste is not that great, but quantity makes up for it.  less then usd $2.50 for a huge plate of bbq meats (pork and chicken).  best, bt.\n\np.s. location is near the top of grant street (before chinatown turns into little italy) on the same side as \"yoogo gelato\" keep walking down sidewalk for less than 5 mins)", "author": "beijing t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-13", "description": "Cheep and Yammy. I strongly reccomend roast duck. Combo menu for 3 dishes is very reasonable. I am a big fan of this noisy restaurant!", "author": "Takako O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-04", "description": "This is a recent discovery & now one of my favorite inexpensive, casual Chinese restaurants in Chinatown with really good food. \n\nWent there for lunch the other day & was underwhelmed by the beef w/tomato rice dish -- not their specialty, but I don't usually order that dish at most restaurants anyway so it was a crap shoot. My dining partner was happy with his Singapore Mai Fun & he's pretty hard to please.\n\nAs for dinner, this place rocks. They have a special menu where you can order 3 dishes for about $20 & the portions are generous! We ordered the shrimp w/walnuts, chinese broccoli with oyster sauce, and the chicken w/ginger & onions -- OMG that was good. We ordered a 4th dish on the side since there were four of us -- curry beef -- and that turned out to be nothing special.\n\nI will definitely be eating here again in the future. Good food & inexpensive. Otherwise clean & good service. Nothing fancy in terms of ambience but you're coming for the good food & cheap eats!", "author": "D L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-16", "description": "this is one of my favorite chinatown restaurants! the service was very fast and the food was EXCELLENT!!!\n\nI ordered a plate of SNAILS, POT of RICE, GREENS, hot tea\n\nthe snails were very good, lots of sauce and you have to use a tooth pick to get the meat out after sucking out the delicious sauce", "author": "Mr Bolo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "I stumbled upon this restaurant on Grant, close to Broadway. In terms of price, it's almost unmatched by any Chinese restaurants I ever visited. For $15.99, you can get 3 dishes. The selection is quite large. The portion of each dish is simply amazing. I ordered crispy chicken. I was expecting the usual  1/2 chicken. But they served up the whole chicken. Deep fried flat fish, walnut prawn, pan fried noodles are all amazingly big portioned. I have seen other tables that orders broccoli beef, portion is almost 50% more than other restaurants. I have been there twice, will definitely go back again next time I am in Chinatown. It's not a place for atmosphere. It's loud and a bit dirty too. Go there for the food only, after a long day of shopping in San Francisco.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "one of the best noodle houses in SF Chinatown. i had the wonton egg noodle soup with fish ball. vivid memories of Hong Kong da pai don's came back.  the noodles were crunchy, the wonton's are so fresh, and the fish ball very savory. parking is a pain, of course. we also ordered the Chinese donut with fish fillet rice porridge.  we kept on eating while the porridge was too hot.  i think my tongue was also cooked.", "author": "Agent X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "pretty good authentic chinese food", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "Mainly a place where Chinese locals come for their Chinese food.  Once in a while you'll see a tourist venture in and order a small sampler of their roast or bbq pork, but that is about it.  I read some comments about Yee's food being greasy but I'm going to have to disagree.  They do use oil like most Chinese restaurants, but it's not over the top.  I love their wonton soup for $3.75 ... it's great tasting and there is plenty of wontons.  Can't find wonton soup in the OC for $3.75.", "author": "Jo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-02", "description": "This restaurant is a great choice if you find yourself in Chinatown and want to have an economical family dinner that is truly representative of fresh Cantonese/Hong Kong food. We had a dinner party of six, composed of some pretty picky Chinese relatives, and we were amazed that we could get 6 generous-sized, well-prepared dishes and a soup for $32 (we ordered from the \"3 dishes for $15.99\" menu).  We couldn't finish it all. There was even watermelon for desert, for a nice touch. As mentioned elsewhere, the decor is nothing special, but that, to me, adds to its authenticity - this is not a restaurant that has sold its soul to the tourists.", "author": "Oh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "the family always eats here for chinese new year.  good portions.  really, really good crispy pork and bbq pork (cha-siu), and standard chicken.  never have the goose available - eva c. says below to reserve in advance - we'll have to try that next year.  have eaten the standard chinese food here too, and it's good and plentiful.  not touristy either - more chinese than euro faces is always a good sign in chinatown!", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "It's too easy for people to criticize Yee's.  I love the faces and comments from the tourists as they photograph the window display.  Sure, a neon orange octopus is something to write home about.  But you have to go in and order take out a few times to experience the place.  The first time, you'll wait patiently as everyone cuts in front of you.  You'll initially be offended but the feeling of victory from stopping your first regular from cutting in line is priceless.  It has nothing to do with race.  It's all about who wants their bbq pork first.  At least that's what I usually order along with fried chicken wings or peking duck.  I'm too chicken to experiment there.  You'll feel bad about the prices because something must have been lost in translation.  $5 for all that food?  Oh, trying to order a small order of rice is fun too.  I ended up with a family size order one time.  Now I think they just know me and pretend to understand me.", "author": "Ivan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "Good ol' greasy Chinese food done authentic. Don't expect a posh/sterile environment. Just good food at a reasonable price. I recommend the roasted pig and duck.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "well, i'd give it three and a half if i could, but... so my friend took me here for dinner last night and we did the three dishes for $15.99 deal. can i just say that the fried flounder was amazing (especially for that price) and a good size! the salt and pepper spare ribs were yummy, but my friend unfortunately got the piece slathered in MSG - you could actually see it all over the meat - so she thought it was too salty. we also got beef and broccoli - very fresh veggies cooked just right. the free soup was good as well - i think it was some kind of melon soup. service friendly and efficient, but everyone in the service industry seems to love my friend wherever we go, so that was no surprise. other notes: 1) it helps if you speak cantonese or go with someone who does - this will greatly enhance your dining experience. 2) the place was kind of dirty, so you need to block it out of your mind. my friend and i agree that if you don't get sick afterwards, then it's ok, given the prices and quantity of food. and i'm a virgo, so you know i know what i'm talking about.", "author": "Dorothy W."}
