{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "One gallery on the 1st floor, one gallery on the 2nd floor, and a performance space. \n\nAdmission is free on the 1st Tuesday of the month and from 4-8pm on the 3rd Thursday of the month.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Swung by first-time on their free day (1st Tues of the month), after visiting SFMOMA just across the street. A very pleasant surprise! \n\nHighlights include:\n\n- Ambiance is cozy, welcoming, lively, authentic, playful. Sleek, urban interiors, w/ pastel-colored pamphlets & a modern, well-designed identity system across the museum space & its acessories. \n\n- Octagon, white Ping pong table at the entrance! Cubed, mobile couches in vibrant colors, designed w/ outlets. Floral decors & plants in front of a yoga multi-purpose room. Very aesthetic & functional & interactive interiors!\n\n-The most recent architecture exhibition is amazing by CCA Alumni (shown in pictures). They are small-scale models of architectures hung by wires, delicately & elegantly paired w/ little plants. Very impressed by the quality of design, and the level of professionalism of the staff at the showroom.\n\n- Friendly staff who showed us around & even brought my forgotten phone charger to me while I headed out to the building exit.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Wonderful, well organized, and community-focused arts center!  Each and every time I come to YBCA I am impressed and leave feeling fulfilled and calm.  Highly recommend checking out YBCA!", "author": "Grace P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "I hate buzzword-sounding phrases as much as every other person does, but YBCA is a truly multidisciplinary contemporary arts center, hosting exhibitions and performances in the visual arts, performing arts, and film.\n\nAs for the visual arts, this isn't a museum. Instead, there can be multiple exhibitions on display at any given time in the galleries. They rotate often, so there's always something new for everyone. There is a modest admission fee for the galleries. As for the performing arts, there's a gorgeous, large, modern theater on the campus that hosts anything from modern dance and ballet performances to Apple product rollouts. And as for film, there's even a special screening room for contemporary productions.\n\nEven better, there are interactive art workshops for time to time. Quite innovative is the \"pay what you can\" membership, in addition to regular memberships, that promotes maximum inclusivity in YBCA's activities. Overall, this is a campus well worth visiting and supporting.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-04", "description": "Came here during the free day and after walking into the one-room display, was so happy it was free. A major disappointment when the only place open is a 10X10 room that looks more like a jungle gym.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "I have lived in the city for like 10 years and go to museums like MOMA quite a bit, but I hadn't been to Yerba Buena until today during a free museum day. I saw the Lynn Hershman Leeson: Civic Radar exhibit. It was the only exhibit today. The other one opens this weekend. The exhibit was extensive and provocative. Leeson's work involves technology and the digital age, as well as feminism. The museum dude stopped me, greeted me, and talked to me. That goes a long way. This center is halfway between an art museum and art gallery. It's a very big space. They have local and international artists, and there is not permanent collection. Admission is generally $10 and 10% off for some like students, seniors, and teachers.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "I felt super lucky to catch the Tom Sach's space show to Europa on the exhibit's last day at YBCA. TS is one of my favorite contemporary artists who simply showed in a creative way that art and engineering are not two separate things at all, maybe the same by origin. \n\nSeveral years ago, the whole day I spent at New York's Park Avenue Armory for his space show to Mars has been one of the most unforgettable and happiest day I had in New York and I was so inspired by the mise en place philosophy of his work and has sort of adapted to his Always Be Knolling, ABK style since then. So this time, when I walked into YBCA's space for this show to Europa, the whole memory just flashed back like an old friend. Actually I found YBCA's show is a great retrospective to let me review a lot of details that I was not able to look at the New York show at all, such as how those small cameras work to put together the whole picture of the launch pad. I was also able to have a very close look at the space shuttle this time. Although this show at YBCA is much smaller than the one in New York, I have to say that there is something unique in this exhibit space that New York's Park Avenue Armory will never be able to catch up, oh year, the California sunshine lightening up everything in the room. \n\nIn my impression, YBCA is small but always has very cool exhibits. I can't remember what was the last show I saw exactly. But I remember that when I walked out, I saw a pile of plastic containers with food in it in the corner. I was wondering they were part of the art and was told that the dried seafood from Thailand was from the artist who invited people to take away to try. I did take a box away and the art was very delicious.\n\nOh one thing I really like about YBCA - I was charged less for the admission because I went there by public transportation. I think all the other museums in the world should adapt the same rule, especially those in New York!", "author": "Cecille C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Enjoyed my experience at Yerba Buena Center for the Arts. The venue is not too small or too big. Yesterday, I had the pleasure of experiencing the most epic performance that I've seen in a year. It was Alonzo King's LINES ballet company performing SUTRA. Loved it.", "author": "Yolanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "YBCA houses some pretty weird art concepts. It freaked me out a little because I'm not used to seeing such abstract things, but it's definitely somewhere I would take out of town guests if they wanted to check out a local museum. There is so much to see in all the rooms and on all the floors. You can spend a good hour or two here. \n\nSome other things to note... ladies need to check in their purses at the front desk, and YBCA would be a great space for a special event! I have not yet checked out the theater, but I really want to see a performance here. Like with any museum, I could have coincidentally visited during an awesome season, but I would come back here (probably on a Free Admission First Tuesday) to check out more of the art pieces.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "A friend and I were passing by, and we noticed a sign saying that their gallery was free today. So we decided to check it out. The front desk explained that the main gallery was closed for installation, but the galleries upstairs were available to be explored. \n\nWe were asked to check out backpacks in and we were on our merry way upstairs. We were excited because we had never been there before and wanted to see what they had to offer. \n\nThe curator upstairs approaches us, and begins to explain the display we were looking at, we even explained that we had no idea what it was about but we were excited to learn about it. She spoke for a little bit more, and then suddenly stops mid-sentence and says \"you're not even listening, maybe you're better off exploring on your own and reading the descriptions yourselves\", and before we could say anything she walks away from us. \n\nHow unbelievably rude. We decided to leave after that; we went back to the front desk downstairs to claim our bags, and we shared what had just happened. And from above, we see the curator shooting dirty looks at us. The only redeeming thing was that the receptionist at the front desk was friendly, funny, and overall pleasant; she was awesome, she even apologized for the curator upstairs \"... I'm sorry for that, maybe she's having a bad day\". Unfortunately, more than likely we're never coming back after that experience.", "author": "Aiko H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "Wonderful, well-organized, if small gallery of modern, politically-engaged art. Not very expensive to get in ($10 normally, $8 for students and teachers), with about four large galleries to go through. I remember all of them making an impression-- from the parody music video advocating for trans rights and racial equality to the 3D printing of gun components to the wall of posters of victims of police brutality to the mock museum art imagining what would have been if Obama had closed Guantanamo Bay... it was all really excellent, really impactful, really inventive. This is art that does something, acts in the world. It's an inspiring place, in a great part of the city for exploring, relaxing, and eating good food.", "author": "Allison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "The YBCA is always changing, which is pretty awesome.  I was lucky enough to venutre into their latest exhibit, Dissident Futures, opening weekend and I have to say I was pretty impressed.  The YBCA has commissioned some very well-timed art about what to do with the old Bay Bridge (turn it into a giant hydropnic farming community), future and stem cell regeneration, and strange possibilities for the future.  Even someone with almost zero artistic background could appreciate these exhibits that seem to appeal more to science fiction types without being pretentious (I'm looking at you, Paul Laffoley).\n\nAlso, they have the most awesome setpiece in their background.  It reminds me of Studio Ghibli meets Little Shop of Horrors.  Swing by and see!", "author": "Mike P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-14", "description": "On first Tuesday of each month, they have free admission and thank goodness I didn't pay for this art gallery... Well if you can even call it that... Vancouver art gallery is pretty small but this was far worse.. \nThey had some weird photos of random messy beds framed, a copy of knitted designer purses, and not much else. Don't spend your money here if paying to get in but worth the look on free days just to see..\nOutside is much Keller than what is inside the glass building\n\nValue 3/5 only cause it was free otherwise 1/5\nAtmosphere 3/5\nService 2/5\nQuality 1/5\n\n9/20", "author": "Nina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "It was a rainy day after finishing up the Jewish museum and was told this was a great museum as well. Honestly, I didn't think too much of it. I haven't seen this place at it's best but there was only two small exhibits (one was a video streaming political news bits) and another one on the gold rush. They were interactive and couldn't take good photos. Best thing was that ticket was free. I would have felt more ripped off if I had to pay cause there was so little. There's an exhibit set to open a week after I left and the lower floor is being renovated. I've heard great things about the museum so I'm sure there were at times much more. A real pity I didn't get the chance to see much more, I wouldn't have minded paying a nominal fee to see some great exhibits. Maybe another time is better to see Yerba Buena, not now!", "author": "Vikram V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "I never felt that I was quite cool or hip enough for SF and Yerba Buena is the epitome of all that is cool and hip.\n\nAnd the perfect destination for an art seeker on a Thursday afternoon after a few exhausting days of conferencing. From my understanding, there are no permanent exhibitions here, which meant the spirit of change is part of the atmosphere at all times. Thursday nights at Yerba Buena is free and the exhibition at the time was Radical Presence, featuring some of the most thought provoking media forms and subjects which makes you ponder about the artists' thoughts, your own reactions to it, and other subconscious relationships and feelings you have about them. \n\nUnique and thought provoking, the essence of art.", "author": "Sharon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "It's always an adventure to walk inside the YBCA. The building itself by Fumihiko Maki is a wonderful place, perfect for the organization's mission. Over the years I have come to expect the unexpected and to be filled with a sense of wonder and delight at YBCA. I cannot say that this is a given  for every single exhibition but nearly so.\n\nMy favorite exhibition / installation at YBCA was the \"Listening Post\" created by Mark Hansen and Ben Rubin. I saw it first at the Skirball in Los Angeles and when it arrived in the Bay Area I could not resist an encore. \n\nThere are several YouTube videos of Listening Post, but none of them captures the atmospheric excitement of the piece. It's just impossible because it was an environment with extraordinary spatial and acoustic properties. Add to that it all took place in a dark room, with only the LED displays illuminating that space. All of these things are impossible to represent with any degree of fidelity on YouTube.\n\nThe spirit of creative exploration seems to infuse most art that often comes to YBCA. Robotics is one example, and on one occasion in particular it was the work of Alan Rath, who always has an excellent eye for his electronic constructions. \n\nIf Jean Tinguely were alive today he would be showing his work at YBCA.", "author": "Noe B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "Went after Cartoon Museum on Fri 4/12/13 to kill time.  It's a bigger museum with a bunch of artwork.\n\nShowing now: Without Reality There Is No Utopia - I didn't read most of the captions so it was just ok for me.  Lots of work from artist from Spain, Colombia, etc.  We could take photos - no FLASH.  I liked the artwork with the tractor trailer with fake fruit spilling out all around it.  Zhou Xiaohu \"The Crowd of Bystanders\" - neat handmade ceramic diormas was interesting.\n\nShih Chieh Huang: Synthetic Seduction - Upstairs his artwork is neat.  Lots of homemade gadgets  with lights that air that blow up & show off bright lights that look like sea creatures.  I liked his work.\n\nWorth a visit if you really like art I guess or to kill time.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "I finally came here for an ODC modern dance ballet performance, and this is a really great venue for the Arts.  We had seats in the Orchestra and the view of the stage was perfect.  Acoustics are good and check in is easy.  They could use a few more restroom stalls as the line gets quite long for the ladies (but what's new, right?).  I will definitely be back for more performances very soon!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "Yerba Buena Center for the Arts (YBCA). I remember hearing the news about its formation in the late-80s-early-90s. An arts complex with a park, museum, outdoor stage, theatre, fountain and a park where people could relax. I knew of an engaged couple who were getting married at St. Patrick's (across the street, next to the Contemporary Jewish Museum) who were very sure the park would be in existence by the time of their wedding. (NOT!) \n\nNext to the YBCA is the Metreon, the home of the new Target store, a City Target as well as Sanraku, Cako, a food court with various eateries, and the AMC Metreon.\n\nHere is the 411 on Yerba Buena Center for the Arts:  http://www.ybca.org/about/history\n\nI have sauntered through the park to go to SF MOMA, the CJM, Moscone Center, the Metreon, and to various establishments within the proximity. I walked through the fountain dedicated to the late Dr. Martin Luther King; remembered being in awe looking at the photos and the text about him.\n\nI have visited the museum a couple of times on free days. The last time I was there, much of the exhibits were dedicated to the local occupy movement and abstract works by various artists. I regret to say I was not too impressed with what was being exhibited at the time. I am overdue for a return revisit. \n\nThe Lam Research Theater (formerly known as the Novellus Theater) is a state of the art modern theater.  Straight, simple clean lines.  This theater relies on modern computer technology in setting the miss-en-scene (mood, lighting, background) of what ever is needed.\n\nI was amongst a group of students who were invited to watch the final dress rehearsal of Opera Parallèle's production of AINADAMAR by the composer Osvaldo Golijov performing this weekend, February 15-17.  It was good fun watching a dress rehearsal and observing the goings-on before the official opening in making sure everything runs smoothly like clockwork.  \n\nSo the Yerba Buena Center for the Arts has something for everybody here: a park, a museum, a theatre, outdoor theatre, a fountain, and the Metreon. Centrally located within the shopping meccas, the museums, and within the Financial District.\n\nFresh Review #23 of 100 Yelps! for 2013.", "author": "Chiara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "The staff were incredibly unhelpful the last time I was here. Nobody seemed to know anything about the exhibits, let alone what they meant or embodied. \n\nThe layout felt very disjointed and in the end I felt like I was being snickered at by hipsters with bad haircuts. \n\nLots of really abstract art and video when I was here. The museum itself was pretty nondescript building wise. I much prefer the de Young. \n\nIf you're interested in coming but aren't sure it's your cup of tea, wait until the first Tuesday of the month, when admission is free. Also, the MoMa is nearby in case you are underwhelmed.", "author": "Bianca U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "I have to admit that every performance is the best, but that isn't the point! The venues are great places where artists are supported and allowed to really express themselves.  We mostly go for modern dance performances and have not been disappointed yet.", "author": "Greg F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Thanks to my love affair with my DVR I now watch television commercials only twice annually:  Super Bowl Sunday and the British Television Advertising Awards (now called the Arrow Awards) currently screening at YBCA.  \n\nThe Arrow Awards screening gives me a reason to go to YBCA which, I can't seem to make a priority at any other time of year.  Their programming and installations are international, diverse, and interesting but other than the Arrows, nothing just screams at me as a must see.  \n\nI don't know whether this is legit, but each time I've gone to YBCA for a screening I've also been able to walk through the art/installation gallery at no additional expense which makes for a very reasonable deal.  It's a big, airy gallery, with lots of installations and performance spaces (but no permanent collection).  Both times I've been they've featured artists from outside North America (currently featuring artists from India, in multiple disciplines).  Their whole offering is a little different -  a little less \"accessible\" to the masses and a little more challenging than art at, say MOMA - but that's not to say it's not good or worthy.  It is.    \n\nWithin the gallery their \"docents\" take the approach of engaging patrons not by explaining the art but rather by questioning them on what the art says to them, or what they think it's about, which can lead to some interesting dialogue.  If you like (or think you might like) being challenged by art in many different disciplines, pick a film off their calendar then follow up with a wander through the gallery.  The whole experience is somewhat outside the box but it's nothing to fear.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "This is an amazing art space and event venue. If you're in the area, drop in and check out the exhibits. On a nice day, you should also swing over and have lunch in their garden or just roam the center grounds. I attended a work event here and had a blast - cool facilities.", "author": "Farrah A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-07", "description": "First time here to see The Velveteen Rabbit. Kind staff who gave accessible seats for my dear senior friend. Main crux is that online it doesn't state the entrance is on Howard. Upon walking through the plaza I approached a guard to ask for guidance on which building to enter and seeing I was with a senior citizen, she did not inform us the ramp was around the corner, but instead directed us to \"go to the other side.\" The other side of what? We figured it out, but my friend had to climb stairs, which was difficult. All this could have been avoided if we were given better directions and addressed with compassion.", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-20", "description": "Yerba Buena Center of the Arts really strives to produce innovative, relevant, and accessible shows on the regular.\n\nFrom profound dance performances, to retro 70's video art installations, to thought provoking abstract art - the Yerba Buena Center of the Arts is continually in touch with their audience and seeking to grow and challenge them.\n\nIf you're looking for something to do on the weekend - it's always well worth seeing what Yerba Buena Center of the Arts has going on. From a series dedicated to dialogue provoking Bay area 70's adult movies to recycled art - Yerba Buena is always utilizing their space in a consistent and creative way.\n\nTheir exhibit openings are always fun affairs and you can expect a hip stylish diverse crowd, as well as solid music and performances throughout the evening.\n\nYerba Buena Center of the Arts recognizes local and developing art around us and beyond us. I'm thankful I'm so close this establishment and have always enjoyed my encounters with this space.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "Yerba Buena Center for the Arts hosted the ballet interpretation of Scheherazade & we were completely impressed w/ the venue & dancers alike \n\nVery unique & modern interpretation of the 1001 Arabian Nights story.....started out w/ an opening piece called Dust & this really featured the dancers agility, grace & physiques.....they were so incredibly fit & graceful, & fluid - each muscle group was prominent and defined & this was apparent even to those of us seated in the balcony. \n\nThen came more colorful costumes, albeit minimalistic, for Scheherazade - couldn't really tell the actual storyline (although Sis said she could follow) but enjoyed the movements & dancing nonetheless. \n\nNo set design except for a covering above the troupe that moved up & down which was actually nice as it made the sole focus on the dancing \n\nVenue is setup much like a highschool auditorium - really cool, modern foyer w/ high ceilings, open stairways & railings lead you into a plush-ish theater. Views from the balcony were full-on (which is NICE) and seats were okay-comfy. Not a lot of leg room but it was adequate w/out feeling cramped \n\nWould totally come back for another artsy-venture & in fact, we are excited to do so!", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "'A great venue space for rotating exhibits of both local and far off exhibitions not \"in line\" for the MOMA down the way. If seen things like the Art of Star Wars to the exhibits of my photography professor who I used to TA for. If you've finished with the more established works across the street, opt for something edgier here", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "YBCA is a wonderful place to visit for both visual and performing arts. The location is right across the street from several other museums such as the MOMA and the Jewish Museum. It's also right next to the Metreon and behind the Moscone Center. It also connects to the Ice Skating Rink and the Carousel. They have several galleries and performance halls. I've been there for theater performances as well as holiday parties. They also have performing and visual arts festivals year round. I once went to a drama-type of festival on the weekend with a friend. The facilities are kept new and clean. Everything is mapped out around a nice court yard area.  Another great SF landmark in the downtown area!", "author": "Liv A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-08", "description": "Definitely not good for kids. We can't believe they actually charge you for entrance.", "author": "KWANG L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-21", "description": "I used to frequent the MoMA but because its still in construction, I finally went in here on a free day. Most of the exhibits were still in construction so there were only 2-3 rooms to see. But hey, it was free can't complain. The exhibits were pretty interesting the place feels fairly empty though. Some of the interaction installations were also broken. Would be filling to give it another try when everything is open and paid admission.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-29", "description": "Last time I visited, the water features were turned off, so I am guessing they are doing some renovation. Still a nice little oasis to stop at in the middle of a downtown trip, but definitely not as nice as when it is operating normally.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "\"Big Idea Night\" was full of San Francisco naked charm. It's a night you can be in a competition as a drunk dancer among making Madonna 80s bras, hats, and redesigning your shoes. What a great night to wrap up a day, which one had only 3 hours of sleep the night before.", "author": "Moua L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "It's a handsome space. Great galleries, good light. The few times I've been here, though, the exhibits were too outre for my taste and sensibilities. Especially the videos which are often performance art. Weird, in my opinion. I know, Art is subjective. I don't live far from this neighborhood and find myself over here on occasion. Perhaps on my next visit, I'll be able to give a higher rating.", "author": "Paula H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Dance! It inspires me and makes me think. \n\nThis review is for the Novellus Theater at YBCA. \n\nOK, maybe I think too much. If I were trained in choreography and semiotics I would have plenty to analyze, because modern dance always says something. And when My Lady and I accepted comps for the Paul Taylor Dance Company on March 30th, I started the evening trying to match all the dance numbers to the descriptions in the program. \n\nForget it. At the first intermission I loosened up with a glass of chardonnay ($8 + tip), and from then on the dance flowed smoothly across my eyes and brain. From the unusual, iconic characters that raised memories of Greek and Roman legends, to hip hop and parodies of various dance styles, to one piece that the lead dancer performed completely en pointe -- because modern dance and ballet are bff's you know -- to the costuming, everything flowed beautifully. \n\nWe had perfect seats to see it all, in Orchestra Left, but the theater has no bad site lines. Pretty much the cube you see on the outside is the cube you see on the inside, with the exception of there being a full traditional seating arrangement. Yes, there are balconies and boxes. \n\nI wanted to post their promo picture of men in black briefs leaping at each other, but it doesn't do the program justice. The dancers are simply fantastic, and watching pure muscle fly effortlessly through the air inspired me to resume my own training program. \n\nVisiting companies are performing constantly. See sfperformances.org for details.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "Great place to see contemporary art and performances. Compared to the more visited neighbor across the street, YBCA has more cutting edge shows that feature artists that aren't the big names (yet?) that get the spotlight at SFMOMA.\n\nA shout out to the great membership staff. I joined recently and they were so great to help me out with questions and a request.\n\nVerdict: If you like contemporary art, make sure to walk across the street and visit YBCA. Support the smaller art institutions too!", "author": "Zoom Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Great place to go for a quick dip into the arts.", "author": "Glenn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-10", "description": "Yerba Buena Center For the Arts is a pretty awesome little spot to work so close to. There's the gardens, there's the party space, there's some tasty dining and drinking options near it and did I mention the party space? :)\n\nI went to one of their fundraisers here last weekend and it was a hoot hollerin' good time. Mostly because I was the chick in the dress in front of the stage hootin and hollerin and lusting over the oh so fine ass of one Mos Def. Good lawdy lawd, that man is finer that foine. And I challenge any chica or dude for that matter, not to feel sexy, sexy, sexy in the pants when he is on stage doin' his thang. \n\nBesides that it was a lovely gathering of people and each and every time I've been to an event here, i've had a dandy of a fine time. The only reason they lose a point is for the ridiculous performance art (and i use that term lightly) they have going right now with the various people miming in front of the Volkswagen. What the hell is that noise about?", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-06", "description": "This gallery specializes in modern art. Some of the exhibits were not too great, but there were some memorable ones. \n\nThe one that sticks out forever in my memory was one that consisted of a butt, peni5, and boobs mounted to a wall. When you walk by, they suddenly start wiggling! Hahahaha ridiculous I tell you! \n\nThere were also a few really cool paintings. But in my opinion, they could do much better than the selection I saw.", "author": "Julie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-13", "description": "Before wandering into the Yerba Buena Center for the Arts yesterday, my experience with these guys was limited to my Dream House Raffle ticket. It's a big modern space, and I enjoyed the inviting Lobby, the cool little gift shop, and of course the exhibits. I could definitely see why YBCA makes an excellent venue space and why it should be part of a walkable art museum tour that would also include the CJM and the SF MOMA.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "Love the environment in general. The only issue is the chairs in front of the fountain: some of them need good cleaning works. There are usually a bunch of visitors around and could make newbies a bit overwhelmed about the surroundings. Wish there are more sculpture works out there in the sun shine.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-28", "description": "I would like to say that I was very disappointed that we did not get to see the show after paying $65 a ticket, because after driving 1 hour, we had a hard time finding parking and we were about 6 minutes late. We were told we could not have our seats and there was no room for us. We were very disappointed as this was an outing for two people's birthdays. Why would I ever go there again?", "author": "Anne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "I always enjoy the modern dance performances at YBCA.", "author": "Tom W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Such a great little museum. Kind of hard to find the entrance if you are a retard, which I clearly was/am.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "This place has some pretty sick parties. It has some well lets just say ultra modern art. It keeps pushing your brain to think differently, like the Frankenstein chairs.\nIt is great that the place makes me think of music, dance and good times or better yet... creating art! Its always a good time!", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "Went this past weekend for the Dissident Futures Art exhibit.. it was free! Nice space, good exhibit. It's on the smaller side but I think it's fine.", "author": "Vol T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-07", "description": "I don't remember too much about the YBCA party in 2001, cos all my drink tix were used up on lemon drops, and then everybody gave me their leftover tix which i used on more lemon drops. I think I had fun. The r. crumb exhibit, now that was great, and that was probably a couple years ago already, then the Minutemen movie screening...\n\nNow it's 3 am after the YBCA Late Nite party of 2009 and it's time to bestow 5 long overdue stars. Nick Cave's art, food from Mission Street Food, the 70's trash movie trailers, the tattoos for a lifetime membership, the awesome drinks, all the bands and the Sisters of Perpetual Indulgence.  Yeah...this place is an institution.", "author": "Henry Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-31", "description": "(This review selectively targets the film curation at the YBCA.)\n\nWalk -- don't run -- to see the latest independent films at the YBCA. If you run, you'll only be left to wait in the dark.\n\nThat's because the theater is run like a catamaran excursion at the wharf: in order to get more folks on board, the captain departs only when the last passenger arrives. So if you're the kind of guy who shows up on time to movies, be prepared to wait five, 10 -- even 15 -- minutes and expect to tell your next appointment that you'll be late. Do I resent having my time wasted so that the maximum number of disorganized stragglers may be accommodated? Not anymore. This time I remembered to bring a pen and paper and have used the time to write this review.\n\nBut like sights seen from a sailboat on a fine day, the films presented here are beautiful glimpses of important and moving things! And because this city only has Yelp to tell its denizens about worthy art events, most screenings are terribly underattended. Only arts hounds like me who deliberately investigate the YBCA's inscrutable web site even know what's going on. (Seeing Pina Bausch, Rem Koolhaas, the Muppets? That's my idea of a cruise!) So, er, there's no need to arrive on time to guarantee you get a seat.", "author": "V. J. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "ODC Rocked this last night with their latest repertoire of pieces, including \"River\", \"Grasslands\" and their world premier \"A Guide To Elegance\".  \n\nAgain, I chose to splurge on orchestra seating as I enjoy watching the facial expressions of the dancers.  But, as I said last time, there isn't a bad seat in the house.\n\nAnd, the best part of last night was discovering the concessions upstairs on the second level.  No wine, but they've got tea, coffee, cookies and candy.  But, don't be mad if they don't let you bring it inside the theatre.  There were 2 dumb asses giving the ushers a hard time complaining about how their tea was going to be cold if they couldn't bring it inside.  How rude.", "author": "Jacquie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-24", "description": "Saw the exhibit  by Song Dong \"Dad and Mom, Don't Worry About Us, We Are All Well\". Very touching story about a Chinese man, his family, his heritage and his father. I recommend it.", "author": "Virlie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "catered private event space really nice place for large grand parties.  I've been here as a guest and catered here several times behind the scene.  This place is huge and can easily fit 800 people.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "Bhangra lessons to shake my shoulders into a cramp on a Saturday night?\n\nFree entrance = beautiful music to my unemployed ears!\n\nI'm so there. And definitely coming back again for any other adventures in cultural enthusiasm.", "author": "Alita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-10", "description": "THIS IS A REVIEW ON YOUR ANNUAL DREAM HOME RAFFLE: \n\nOU CLAIM THAT ODDS OF WINNING A PRIZE IS 1:50. NOT TRUE! BOUGHT TOTAL OF 160 TIX (for 4 family members) LAST YEAR FOR SF DREAM HOME RAFFLE - AND NOBODY WON! True that odds are not guarantee... So why claim this 1:50 chance of winning a prize ?!?! THIS IS PLAIN TRICKERY & SCAM! \n\nFOR EVERYONE OUT THERE - PLEASE DON'T BE FOOLED! \n\nHere is the response from the Raffle director: Yes, statistically that many tickets should translated into at least three prizes to you.  It certainly would if for every 50 tickets, a prize was chosen rather than having all the tickets in the raffle drum and one winner chosen per prize, as we are required to do by the State of California.  In this case, though, it appears that the probability of winning more than one prize didn't lead to that actually happening.  I'm sorry your luck wasn't better for this drawing considering the substantial investment. \n\nREGARDING THE DRAWING & AUDITING PROCESS: All ticket stubs are printed by a third party vendor based on a spreadsheet containing all ticket information associated with each purchase (ticket number, name, address, city, state, phone, alternative phone, and email).  Those ticket stubs are printed, bound, and sealed in a box and sent to the organization shortly before each drawing.  The box remains sealed until our auditor arrives on the day of the drawing to conduct the audit of the tickets.  She opens the box, puts the tickets in numerical order, and unbundles them (they come in bundles of 250).  Once the tickets are laid out in order, voided tickets are removed from the group (for tickets that have been paid with insufficient funds such as a bounced check or in the case of a refund after a ticket has been issued).  Then she takes a random sampling of ticket numbers based on the spreadsheet of all ticket purchasers.  She does a reconciliation between the spreadhsheet information and the ticket stub information to make sure they match.  She chooses a statistically relevant sample to ensure that all ticket stubs fairly reflect all ticket purchases.  Once the reconciliation has been conducted and approved she then takes the ticket stubs down to the public location of the drawing (early bird drawings take place in the YBCA Foyer and the grand prize drawing took place in the YBCA Theater building).  She then places the tickets in a transparent, acrylic raffle drum.  She locks the drum, spins the drum, and picks out the winning ticket(s) in front of the public.   After the winning tickets have been chosen and recorded, all tickets from the drawing are placed in storage bags and retained by the charity for 10 years in the event that someone challenges the authenticity of the drawing or the inclusion of their ticket.  \n\nUNLESS THIS PROCESS IS RECORDED THEN SHOWN TO THE PUBLIC, THIS PROCESS IS JUST BS !!! BEWARE !!!", "author": "M F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "I love that YBCA is so accessible in the city.  I recently saw a modern dance performance there, and really enjoyed myself.  The theater itself is really small and intimate, and there isn't a bad seat in the house.  The ambiance is just casual enough -- not stuffy at all, which I really like.  I hope to be back to check out more soon.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "I can't help but smile as I walk through here.  I love it when they have music and dance performances going on -- it just makes it that much more beautiful.\n\nIt specializes in modern art and has some great artwork.\n\nHey, it's free, so go and enjoy yourself =P", "author": "Pia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "awesome venue. \nI've been here numerous times to see dance performances and for an event they had called the bay area guide to independent fashion. The all day event was so much fun because they had fashion and trunk shows by local designers (I got to walk for an awesome designer hellyn teng/ ht habitus). The YBCA offers so much.. they have dance performances, film screenings, exhibitions and other special programs. It's worth checking out..", "author": "Raquel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "The Novellus Theater is a great venue for ballet and other types of dance. It is the perfect size so that pretty much every seat is a good seat. I have been here twice, and both performances were great. Will call was easy, the events started pretty much on time, and the acts were great (SMUIN Christmas Ballet) and ODC Dance.\n\nNew information: you are now allowed to bring beverages into the theater, so no need to chug that coffee before arriving!", "author": "Caitlin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "Mr took me to see the grand opening of Dalai Lama Arts last Friday.\n\nIt was pretty interesting. Coat checks are free (tips pls.) Security are very tight,they won't allow you to take pictures. \n\nMy fav's and must see Laurie Anderson (clay & visual projector), Yoko Inoue (waterbottle collection), Katarina wong (fingertips arts), Long-Bin Chen (phonebook sculpture) our fav! & El Anatsui (bottlecap collection) and yeah the big inflatable buddha. (had the urge the jump up & down).\n\nStop by the Bio Technique collection on the second floor, it's like a little shop of horrow, quite a sight.", "author": "jubi l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "YBC is often overlooked when you have MoMa, the De Young, Legion of Honor, Asian Art Museum and the Palace of Fine Arts, but they are proving their mettle by some recent great exhibitions.  I highly recommend that you check out Song Dong's \"Dad and Mom, don't worry about us. We are well.\"\n\nSong Dong is one of the most important contemporary artist from China.  His work will go down as part of history.  This exhibit is about his connection with his family and extremely touching.  The Waste Not installation is the highlight of this exhibit and includes all of the personal belongings that his mother had collected over her life.  Definitely check this out.", "author": "Laurence H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "Amazing exhibit.. Very relevent to our times.  I would subtitle the main floor exhibit: How a country was sold out from under the People or Collapse of a Super Power (USSR)", "author": "Sarah Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "This was the last museum that my sister and I visited for the Yerba Buena Free4All. It as cool to see how plants were alive based on special generators or techniques that didn't require soil. The most interesting exhibit was the BioTechnique. There were x-ray pictures of tree frogs with additional limbs or misfigured bodies. The bones of the tree frogs had a teal and maroon dye. Very cool.\n\nBy the end of the day, I was so tired that I had to sit down and relax my feet. The museum was a decent size, but I wish there were more to exhibits to see.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "I went here with a couple of friends to a Wired Magazine party and Range Rover Evoque unveiling last month  This is by far the chicest party I have ever been to.  The place was setup with awesome lighting and music, very modern tables, chairs, and lounge sectionals near the center.  They served a few appetizers and had two open bars with some special holiday drinks with Knob Creek Bourbon.  My favorite desserts here were the assortment of scones and cupcakes.\n\nThe venue is truly impressive for a party such as this, Wired had set out the latest tech gadgets including the new Samsung Galaxy Tab which was not even officially for sale yet.  So I got to see this highly anticipated device here for the first time.  Other gadgets included a Panasonic 3D TV, B&W headphones, and a handheld 3D Panasonic Camcorder.  Was really glad to make it to an event like this here, and hopefully I'll be able to view an art exhibit here in the future.", "author": "Kenny P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-06", "description": "We came here to see Jim Jefferies. Everything was as it should be as we waded through the lobby of two fisted white wine drinking out of plastic cups fellow comedy fans. I do wish venues like these would let you take your drink to your seat but I understand. The layout was terrific and we got some pretty great seating in the balcony where the grumpy old men muppets would sit and heckle. We didn't heckle. Great show and venue for it, although JJ had some words for his disappointment at the end. Apparently they don't support his brand of comedy. You will have to purchase the DVD.", "author": "William R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "I really love the Yerba Buena area. The garden is beautiful and this center is too! When you step in the lobby, everything looks very clean and modern. I volunteered here for the MLK event/parade, and it got super busy! But I got to know the area better and I was also able to explore the museum. The museum has very...interesting displays. Haha. It's not my type of museum, but it's cool nonetheless!", "author": "Ivy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "Ah, the beauty of living in San Francisco - waterfall erected in homage to our most influential leaders, open grassy knolls on which to rest our heads in the middle of the hustle and bustle of downtown, theaters where you can see children put on skits or adults mime...this is YBCA.\n\nTonight I had the pleasure of accompanying a friend to an installation called \"Global Lives Project\" for which she volunteered as one of the interpreters for Portuguese.  It was opening night, and YBCA did a bang-up job of introducing it to the masses.  The DJ was great, the set-up was cool, and the vibe was young and chillaxin'.  AND, I got to bang on instruments in one of the installations.  That was SUH-weet.\n\nNot only that, I ran into a fellow Yelper (Kimberly B - holla!), a guy I used to work with who now works at YBCA, and 3 of the Sisters of Perpetual Indulgence.\n\nSee...the beauty of living in San Francisco.", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-18", "description": "I wish they'd find a new curator for the gallery because the space is really nice but the art usually isn't.\n\nTheir performances and cinema however is consistently good and the programming is top notch.  Every dance event that i've been to has been excellent", "author": "M. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-29", "description": "I love being that someone mysterious solo person going to watch movies or performances at the Yerba Buena Center for the Arts.  Every time I'm in SFO for work, I love checking out the outrageous shows they have here.  From a watching a 'movie' that was practically porn with a room full of strangers to an Asian dance troupe... to me, this establishment screams San Francisco ART.  As a 'tourist' I love it.  So I'm not a total tourist as I don't walk around with a map.... but I don't live here and only come 2x a year for work conferences.\n\n\nbe well,\ncarolyn", "author": "Carolyn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "I came to the YBCA awhile back for Nick Cave's Soundsuits exhibition. I won't lag off into a tangent of his art but the overall exhibition was artfully complicated, ornate and awe-inspiring. The exhibit was definitely one of those exhibitions where you just want to touch the art (everything was made out of fur/ buttons/ cloth).\n\nAs for YBCA in general-- there is a small fee involved ($7 for adults) but I personally think it's well worth it. I'm used to going to museums for free (yay DC) so when a monetary surrender is made, I can only hope the museum/ art space/ exhibit is justified. YBCA isn't the biggest of art spaces but it manages to pack a punch by offering a wide variety of art, so many art palettes will be satisfied with a trip here. It's conveniently located/ easily accessible via public transportation too so if you're in the neighborhood, you might want to think about making a stop at YBCA.", "author": "Laura L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "Went to see the Audience as Subject gallery today and am pleasantly surprised at how much I enjoyed it.\n\nI think the fee is worth it and though it's small there's some great and interesting things to see there.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-26", "description": "In recovery of my liver and my autonomy, I fed my brain today.  I plan on doing this far more often than I have as of late.  Between the cube, the laptop and the partying, I have been feeling a little (okay, a lot) uninspired and dispassionate.\n\nHuman Rights Watch International Film Festival presented Project Kashmir tonight and it was an excellent documentary. As intended, I was inspired and motivated by the strength and perseverance of these 2 women and the people of Kashmir.  \n\nTomorrow night, I may come back to see the incredible work of Nick Cave.  \n\nMy brain was starving!! Thank you, YBCA for feeding me today.  \np.s. Thanks for being so close to Icebee's too - they fed my ever-growing belly!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "I've always liked this place. Came here the other day to watch a film on photography (I think it was the last of 6th series). Parts of it were interesting and the other parts were a bore (but that's a review for the film and not the actual place itself).", "author": "Lily W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-23", "description": "Buying tickets online: easy. \nForgetting where the show is: easier still.\nChecking the confirmation email for an address: easy, but lacking in said address.\nArriving late as was lost in the gardens: born to do it. \nNot allowed in while the support act was playing: easy for the usherettes. In fact, I was terrified to want to use the restroom once I was in there, for as far as I knew, I would have to leave, and then not be allowed back in again. \n\nI was a little frustrated with the house staff at YB. Although they shushed us outside, when I got in, there was plenty of noise at the back of the auditorium which drowned out the performance at times. Did the temporary bar staff get shushed up? Nope! Did the said house staff stand in front of me and dance to the music? Yup! Did you pay 25 dollars for a ticket? I seem to think you actually were paid to watch this performance, so get out of my way as I had to spend money to not watch you sway ecstatically to the rather poor support act that was playing.\n\nThe headline act, Juana Molina, was fantastic, and I was over the moon to see her play. But sitting down? Her music is full of beats and rhythm - it felt so stilted. As a venue, I wasn't that impressed, in fact it was just pretty poor.", "author": "Catriona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-14", "description": "Love love love this place... Randomly stumbled upon the Zeum Theatre and into Ron Lytle's \"Oh My Godmother!\" The theatre is small and intimate and although we came last minute, the tickets allowed us to sit anywhere and so we had very good seats in the center. Such a wonderful musical it was as well, talented cast, original songs, great music, had me laughing and enjoying every bit of it.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "I have seen some of the best dance performances of my life here. Perhaps that's not saying too much, as I'm pretty fair-weather modern dance fan, but I do have high-standards technically as well as stylistically. My partner and I have attended a number of dances at $15/head, and lately noticed a rise in price, which is a sever bummer. Hopefully this is just a reflection of the past few shows we've looked into, and not a larger sign of times to come. But, the theater is large enough to accommodate many, but still intimate enough to afford even the cheapest seats (*us*) spectacular views.  \n\nI've only seen dance here, so cannot speak to the many other events that have come through, but I've never been let down. The area isn't great at night, so know where you're headed before you set out on foot. But during the day there's a park in the rear of the theater that is lovely to lounge in on a sunny day.", "author": "Monique B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-25", "description": "The Yerba Buena Center has done some good work promoting art activities that really engage young people.  It's too bad they associate themselves w gambling hustle raffles to fund raise.  Who needs that phony hype appearing unwanted in their mail box?", "author": "Cris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "Not such a big deal of a review but I thought I'd throw it in anyway. I went to see a cool flick, 'Favela On Blast', last Saturday with some friends at the theater and it was my first time. The movie was dope! I actually been waiting for it to screen in San Francisco for the longest time and I finally got to see it. Props to Diplo & Leandro HBL for putting together a nice little documentary about Baile Funk.\n\nAnywho, we got there a bit early so we got to check out the current exhibit that coincides with the film (one of several that screened for the duration of the exhibit). Entitled, 'When Lives Become Form: Contemporary Brazilian Art, 1960's to the Present', the exhibit featured works by artists of the Tropicalia movement (just like the music) such as: Helio Oiticica, Marepe, Cildo Meireles, Lygia Pape, and my favorites, os gemeos. If you aren't familiar with these names, I suggest you wiki them, that is, if you're interested. At least os gemeos.\n\nOn with my review. The staff was really nice and helpful. The theater albeit small was nice. Since the movie was about music I wished they cranked the sound up a little more but I guess since there old fogies in the audience (most likely members of YBCA) they didn't want 'em to have heart attacks. Overall a great experience. Hope they continue to provide really good programming like this.", "author": "Ivan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-15", "description": "The Yerba Buena Center For the Arts creates a space for learning and entertainment. This weekend I went to see The Living Word Project with Marc Bamuthi Joseph, following by opening night of a new installation of art from India. Both were amazing, but the Living Word Project was particularly amazing. Apparently Yerba Buena has supported development of the piece and I would encourage anyone reading this in time to go see it. It seems as though a veil has been lifted with the cleansing of The Metreon; this area is due for a major rebirth (or acknowledgment).", "author": "Robert M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-10", "description": "I went to the Big Idea party here past weekend, and spent a Sunday morning swearing at my phone as friends tried to rouse me from my bed before noon. Assholes...can't they feel when my head is just pounding like crazy?\n\nEasily the best part about this place was the people there. I came in wearing a EL wire lit glowing blue top. It attracted no end of attention (as I expected, and have seen in the past when I wear this dud around). The best part was that all of it was from genuinely interesting/awesome people from pretty much every background you could ever guess. The highlight was getting a business card from a sister of perpetual indulgence near the end of the night. I totally feel like a cool kid now :).\n\nI was totally bummed that I didn't get a chance to see the upstairs here...it closed pretty early in the night (midnight maybe?), thus making the big idea party a slightly smaller idea party. I loved the concept of the zany ass costumes in the big atrium, and some of the acts on stage were mind bending, and trippy: perfect.\n\nHowever, there were some downers too - honey soundsystem was trying to push way too much juice through the speakers they had available, thus making the music sound bad, and actually painful in your ears. Some of the acts on stage were kind of derivative, and bars featuring only campari and vodka is a questionable idea in my book. Granted, the bartenders worked wonders with only these liquors available.\n\nFor a free door, I really can't complain too much though. Its an art museum, so of *course* there are going to be some things that don't suit your fancy, right?! I'm intrigued enough to come back again and pay for entry, and we'll see how it stacks up when I'm not glowing on the outside and fuzzy on the inside.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "Great space for galleries, exhibition and shows. \n\nCaught a dance performance and showcase with a few friends here a few years ago to support my good friend, MikeyDisko's SS crew. \n\nI enjoyed my visit here. I would come back.", "author": "Mika D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "The first Tuesday of the month is free admission day at YB Center for the Arts.  It also happens to be the only Tuesday of the month that they are open on.  I'd really only go on this day.  While the space is well laid out, the exhibits were tepid at best.  Granted I am not a huge fan of contemporary art.  It made for a good start to a date, but it is not a destination.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "Buying my YBCA membership was the best decision I ever made. I'm a huge fan of modern and performing art, and this is one of the best places to get it! Recently went there for the BAN6 opening party, and had a great time. What could be better than music, art, and drinks?", "author": "Bridget B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "This whole center is really fantastic.  The theater where I got to see the Stephen Petronio Company performance for the Yelp Elite event was awesome.  Cozy movie theater like quality with killer sound.  For a minute i was convinced that Rufus Wainright was actually there singing the songs that the dances were choreographed to.  The live girls choir that backed up his recordings were fantastic, and the dancers were definitely gifted.  Their main focus is live art, and with a motto like \"Join us and experience life---amplified\", how can you go wrong?\n\nI would come back to the theater to see another show, but building aside, I didn't even know how much Yerba Buena had to offer.  Right next to Moscone and the Metreon, this square block has a garden, an ice skating rink, a bowling alley, a children's playground (apparently with a squishy floor, but i haven't seen that yet), a cute bar B, fountains, art sculptures, and great views of the downtown skyscape.  \n\nI work around the corner, and am now tempted on a nice day to grab my lunch and sit outside, watching life happen. \nA somewhat hidden gem, worth checking out.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-12", "description": "This is my ultimate top event space. We filled the forum with 500 attendees for a charitable event. The outcome was astonishing for it's second year running.\n\nThe space is large and accommodating for any type of an event. Although it is architecturally boring. There isn't much character to the buildings in the center as well as the inside. In that aspect it's fine because for the most part you want to add your own character. \n\nThis location truly has everything. Theaters, Forum, Restaurants, hotels, clubs, art, gardens, and the list goes on...", "author": "Dee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-17", "description": "As an artist, I truly appreciate all forms of art and admire the work that fellow artists put on display. I was really excited that Yelp had invited us to see the Cosmic Wonder/Sampling Oakland exhibit here on opening night. \r\n\r\nWe were able to peruse the galleries and view the interesting art. I was particularly wowed by one really large piece that was made up of detailed paint strokes and stenciled cut-outs. What was really cool was that several pieces had audio descriptions that you could access with your cell phone. However, if you're caught talking back on your cell phone, the security guard will tell you to get off your phone. \r\n\r\nI especially liked the cute deer made entirely out of bars of Irish Spring soap. It's not wrong that I wanted to wash myself with the little deer, is it?", "author": "Connie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-17", "description": "something interesting's always going on here.\n\nEXHIBITS: they have great exhibits that are worthy of competing w/SF's bigger museums. the dalai lama exhibit is neat, & the biolife exhibit is even cooler. i remember visiting the oaklandish exhibit a year ago, & it really gave me a sense of oakland pride. their exhibits are thoughtfully curated, & there are usually interactive pieces that let you immerse urself into the experience.\n\nDECOR: nice, modern, clean.\n\nEVENTS:~i saw the taiko drum performance here, which was awesome! the heart-pounding drums filled the small space in a thunderous way.\n\n~i've seen the smuin christmas ballet here twice & it is fabulous!! great venue for a delightful dance gem that gets u in the perfect holiday mood. much less intimidating than sf ballet & more intimate & special.\n\n~i've been dying to see the dance-along nutcracker here, but i'm always unavailable. tell me how it is!\n\n~the yelp holiday party this year was so hilariously fun, i can't even tell u. my friends & i had a blast, & it was a perfect venue for the event! the main hall got so crowded at times we felt like we were in a nightclub, but the upstairs exhibits were a delightful, rewarding retreat. the back room reminded us of a high school gym, which was a good thing, & made us feel giddy remembering high school dances. the energy was pumping, & the crowd was palpably excited. fun time for all!\n\nOVERALL: a truly great center for the arts & a wonderful part of the city's art scene. wow, yelping about it makes me realize how much i appreciate it!", "author": "miss b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "Magnificent exhibit that closed today, \"Public Intimacy,\" with numerous South African artists. Highlight of my visit was meeting Ashley, a gallery guide who is smart, helpful, educated in the arts. I had a thought provoking conversation with her, this young woman who is wise beyond her years. What a perfect place to experience art.", "author": "Tellinya O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "Interesting property. Gardens are really pretty. Didn't see any butterflies in the butterfly garden though. Exhibits in the galleries were interesting. Audience as Subject 2 was cool. Wish I was around to see the \"Great Directors Speak\" presentation!", "author": "Suzi L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-26", "description": "Edit: any curator/director even suggesting the use of the term \"Mixtape\" in an exhibition or performance title should be put down. \n\nThey really need to put just a little focus on the quality of the art work and not on just special interests and passing social trends. Last I looked it was a contemporary art space and not a hipster dive bar.\n\nWhen you see the occasional great art work there it is in the context of a social agenda (Basquiat and Pettibon in the Beautiful Losers show) or out of context altogether such as a Joseph Beuys multiple in the middle of a Black Panthers Exhibiton.\n\nEven witihin their obvious agendas they could show at least a few good, serious works at any given time.\nThe Berkeley art museum's Matrix series shows 10 times  more serious contemporary art than YBCA.\n\nEdit: I got the new catalog in the mail. Not one serious project involving art. If I see one more cutesy art-school collective there I am going to puke, and nothing against R. Crumb but there is a cartoon art museum around the corner!!!\nI wish Yelp would go lower than one Star.", "author": "Damon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-17", "description": "Always a well-rounded presentation whether an art exhibition or performance. Approachable, vibrant displays regardless of the topic. The weakness is not the establishment or how its run, but the dramatically inconsistent execution of the artwork that will be within one exhibit - a general problem with group exhibits.\n\nAs for the Cosmic Wonder opening...well...luckily the Oakland exhibit was powerful and moving. The display of grazing deers made of Irish Spring is much appreciated. In ag industries such as wine country - chunks of the soap is hung in fields to keep the deer away.", "author": "Tanya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-07", "description": "YBCA is one of the nicer places in SF, it's refined without being pretentious and is an oasis of beauty within the hubbub of the Mission district.  I've been to a handful of parties here, from a charity event, company holiday party, to the Yelp Holiday party on Dec 5.  Fortunately I've been here with fewer than 1000 people.  It's a very open and airy environment that you just can't appreciate with a large crowd inside, but the fact that you can fit several hundred people in here is a testament to its spacious interior and efficient design.\n\nThe Dalai Lama exhibit is rather small but inspiring.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-16", "description": "Pontificating wildly about the bleeding-edge modern art installations here is great Friday night fun. Opening night parties bring out an eclectic crowd that truly epitomizes the diversity of San Francisco.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-19", "description": "YBCA is the \"other\" contemporary art museum, plus three performance venues, across the street from SFMOMA.\n\nThe highlight is the theater, a cube-shaped 750 seat performance space, comfy inside with catwalks and lighting banks for decor.  Black instead of foofy means it's dark during the show.  The design, shape, and modest size guarantee good sound and sight-lines.  Performers tell me it's got a great stage set-up.  There's also the \"forum,\" a slightly smaller flex space cube, and a much smaller screening room.\n\nThe programming comes from several sources but it's always innovative and relevant.  You might see a dance, jazz show, poetry reading, orchestra concert, perhaps a corporate event or a wine tasting.  It's all world class professional stuff, just , a little new or esoteric to fill the symphony hall.\n\nPlus a decent parking scene, public transportation, downtown / SOMA location, nearby bars and restaurants, and strolling around the gardens.  Whatever is playing, just turn off your computer and cell phone a couple hours and go.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "I love seeing shows at YBCA, as the theater is small and you can see and hear well from any seat in the house.\n\nI recently saw \"HMS Pinafore\" by the Lamplighters there (delightful production), and since I had bought tickets on Goldstar, I wasn't sure where we would be sitting.  Turns out we were high up in the balcony, second to last row.  \n\nThe sound was crystal clear, and we could see everything, including the expressions on the performers' faces.  I have seen several Smuin Ballet productions here, and my experience has been the same.  The only caution I would put out there is that there is that the stairs in the balcony can be a little tricky as there are no railings, so that could be an issue for someone who needed extra assistance.\n\nSo nice to stand on the balcony during intermission and get a breath of fresh air.  The only thing I would change about the space is putting a bathroom on a second floor, but the first floor one is large so the wait is not long.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-31", "description": "If you feel like being \"arty\" YBCA is a good place to start.  Feel like a museum visit?  Want to watch a performance?  Make the choice when you get there!  Several years ago (somewhere in the 2000-2001 range) they had a very cool exhibit on the history of surfing.  Of course, I was fortunate enough to check out the \"Sampling Oakland/Cosmic Wonder\" exhibit (Thanks, Yelp)  Among the things I like about it is that you can visit all of the museum in one trip without being overwhelmed.\n\nAbout a month later, Man Candy, cultured fellow that he is, suggested we take in \"SuperVison\" by the Builder's Association.  He's a member there, so off we went to check out the theater portion.  We were in the very last row, but it's a small venue, so that's totally fine. Seats were comfortable, bathrooms were clean.  They even held onto his hat that he left in his seat so we could pick it up the following day.\n\nI really liked the show-this year it's played in New Zealand, Australia and the UK.  It was truly unlike anything that I've seen, with its interplay of tech and human.  It was something different-so thanks, YBCA, for continuing to broaden my horizons.", "author": "Beth V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-21", "description": "This review is only for the Orchestra Pit of the Nouvellus theater, not for the performer:  I saw Marc Bamuthi Joseph there tonight, and he was fantastic.\n\nBottom line:  Orchestra Pit is the Armpit of the Nouvellus theater.\n\nThe seats on the side are best described as obstructed, which means they're charging you more for inferior views.  MOREOVER, and this is really bad, the speakers are mounted BEHIND the pit.  I could hardly hear anything at all.  The only sound was coming from the on-stage monitors.  Terrible.\n\nNever buy pit, unless sound quality is unimportant, and you don't mind an obstructed view.\n\nI ended up moving back and sitting on the steps after about three minutes.\n\nOh yeah, I almost forgot - they rip you off in online purchase fees.  They charged 7 bucks! for a 20 or 30 dollar ticket!  You do the math.  Someone's way greedy here, methinks.\n--------\nUpdate 6/24/08:  I wrote to the box office about the above problems, and they were very courteous and generous in offering either a refund or complimentary tickets to an upcoming performance.  \n\nI still wouldn't recommend sitting in the Orchestra Pit, however, for the above reasons.", "author": "Ravi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-15", "description": "Another Yelp Event!  YBCA is such a cool place.  Different than the other art exhibit venues I've been to; lots of creative little hallways, two separate levels, lofts  and wings to explore.\r\n\r\nIt's a bright, upbeat place.  \r\n\r\nI went to see Cosmic Wonder.  Very diverse and (of course) creative.  A little something for everyone and a bit avant-garde - definitely my style!\r\n\r\nThank you San Francisco and the Yerba Buena Center for such a decent venue.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "Came here for the first time a few weeks ago to see Smuin's \"The Christmas Ballet\". It was a beautiful show and all of the dancers were very talented. My date and I got lucky with our front row seats-yay leg room!-and the staff were very helpful when it came time to locate our seats. YBCA was easy to get to via public transit and very relaxing inside and outside. It was also smaller inside than I expected, which actually made it more intimate and enjoyable. All in all we had a great experience and will definitely be back for future events!", "author": "Leigh W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-07", "description": "Bummer. Thats the only way I can describe the phone call I just finished with their facility staff. What a great place for a wedding we thought on the way home from the Yelp! party, and they rent themselves out on a regular basis too! So off we go like chumps pouring over the website and talking to their nice coordinator person. But here's the deal: want to rent out the YBCA? Okay, that'll only be 10,000 dollars. 10,000 DOLLARS! ARE YOU CRAZY?! Well fine, its a huge space, high class and all of that, and while not EXACTLY in our budget, its not that far off, we might be able to sacrifice something else (a small mammal maybe?) and swing it. Oh, and by the way, all of our labor is handled by a union. WHAT?!?! Yeah, that'll be probably another 10,000. WHATWHATWHAT?!?! A $10,000 UNION TO TURN ON THE LIGHTS? \nWTF STFU. \n\nOh forget it.\n\nIts nice though.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-08", "description": "No problem crowds here even on free days.  Not a terribly diverse collection (especially in the interactive gallery).  I seem to remember the exhibits on the second floor not being so...uninteresting a few years ago.  I don't remember the pretentious staff either.  The create-a-chair exhibit did show real imagination.  However, if I'd be seriously disappointed if I'd paid admission.", "author": "Poet D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-04", "description": "Outstanding spot for a special event!\n\nA reception and sit down diner for 350-400 people?  No problem!  The staff are great to work with and the venue has a hip feel to it.  Accessible by public transportation and with a variety of hotels nearby, make this site easy to hold an event. The exhibits are always changing. Lots of variety here!", "author": "Eileen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-13", "description": "If you're into emerging performing arts or unusual film, this is the place for you!  Many local performing arts organizations, such as ODC or visiting performers, such as Mark Morris Dance, perform here. The film curator includes a wide range, from heavy metal films to Pier Paolo Pasolini's banned films.  I love walking around in the gardens before a show.", "author": "Vera D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-08", "description": "I don't know why it's taken me so long to write a review for Yerba Buena.  It's one of my favorite places to see art in San Francisco.\n\nTheir shows are consistently well thought out and well executed.  They usually showcase less traditional, more experimental, cutting edge and up and coming contemporary artists as well as local artists.\n\nThey've hosted classics such as The Beautiful Losers exhibit focusing on the \"Mission School\" (straight outta SF) where they built an actual skateboarding park in one of the galleries and invited local skaters to use and interact with the piece.  The show went on to tour the country.\n\nThis next show: \"DARK MATTERS\" Jul 28-Nov 11, 2007 is a wonderful showcase of  various video installations each one extremely fascinating both visually and conceptually.  Make sure you spend some time with Listening Post by Ben Rubin and Mark Hansen in the first gallery to the left.  It's amazing!\n\nI love Yerba Buena because they take risks in the work they show and give contemporary artists a venue within which to show their work. and it's always free the First Tuesday of every month!", "author": "Shayna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-17", "description": "I just went there on Friday for the Cosmic Wonder opening, wow, what an amazing crowd and atmosphere, and that was before I even checked out the art!\n\nThe galleries are well designed for mingling and interaction, I can already see myself coming for some of their other events. I'm not sure how the museum is on weekdays but I will definitely be coming to any future art happenings they have!", "author": "April M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-23", "description": "Went here to see \"Da Vinci, an Exhibition of Genius\". So inspiring, he was an Inventor, Architect, Engineer, Scientist, Psychologist, Mathematician and Artist, yet wasn't educated and couldn't write properly.\n\nNot sure if you're allowed to, but I stepped inside his \"room of mirrors\" an octagonal room where you can peek through a hole and see the human body from every angle imaginable. It enabled him to paint from different perspectives and allowed the subject to relax, possibly opening up the window to their soul. I would love to have one of these in my home for getting changed. Yes, those jeans did look too tight on my behind and I admired the back of my new hair cut!\n\nSuch a relaxing place, I don't know why I didn't spend more time here when I used to work in the area :(", "author": "Anastasia Beaver Housand J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "The Patron of the Arts leg of my SF trip.\n\nWhen I let my friends know I would be coming up to SF for the weekend, they told me that we would be going to the play Mikado on Saturday night. \n\nMy response: F**k, you f**ken retards. F**k, sh*t. I am coming up to SF and you guys want to go a f-in play. I want to get drunk and party, not drink tea and watch old people on stage.\n\nBoy was I wrong (as I usually am).  The Lamplight Theater and Yerba Buena is amazing. Great venue where every seat in the house is a good seat. \n\nThe play itself was one of the best I have ever seen and the actors were really good. They threw in some modern references to make it more relevant and funny. The actor playing the lead was hilarious but still managed to be dignified. \n\nFunny thing, my friends that suggested seeing the play walked out during the intermission. I watched the second half alone, it was that good. My friends couldn't grasp Victorian English and fell asleep, while I watched attentively and clapped at every chance (yes I am a tool).\n\nOnly regret, I did not have a top-hat and monocle like the Monopoly guy, that would have made me fit in with the crowd better. However, I did make some friends with the people sitting around me after my friends ditched me. \n\nI will definitely return to see other showings by this small yet dedicated theater troupe.", "author": "Arin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-13", "description": "This is a great venue.  In all my years i have never been in this performance space, although I have been to the exhibit /museum space many times.\n\nThe Yelp Elite field trip to watch the Stephen Petronio Dance Company was lots of fun.  I think it was most interesting to see so many Yelpers so sober!\n\nOh the dancing was fun too..great asses all of them!  Damn I need to do so more squats!  I could care less for what's his face's music...you know Rufus Wainright.  He's just not my cup o' tea.  But the San Francisco Girls Chorus were in TOP form!  Great and lovely voices!\n\nThanks Yelp for hosting another great Elite Event! Jessica and Nish always the hostesses with the mostestes!", "author": "A P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "Attended a two day HTML5 New Game conference #ngc11 in November.  Good stuff.", "author": "Hoala G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-14", "description": "Just went to the box office to purchase tickets for the opening party tonight. Staff was efficient, fast and no hassle. No shipping or handling fees. \r\n\r\nAttended the opening night of the exhibitions Cosmic Wonder and Sampling Oakland and it was an interesting yet bizarre display. There were some cool art display and my favorite was the prizm-like setup with flashing lights! Dizzfying but somewhat different.", "author": "Yan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-15", "description": "Let me just say this:  they give you discount admissions if you're a public transit rider.  $5 entry to the galleries.  Yup.  That's $2 off for showing your Muni-Pass-toting pride.  And even cooler: they even gave the discount to my friend who had a Boston \"Charlie Card\".\n\nCurrent Exhibit: Dark Matter:  Listening Post was seriously engrossing.  I sat there watching it for 20+ min, even slightly passed its cycle point.  And Libraries of Dust was just down right creepy / disturbing, but still visually stunning. \n\nThe photography exhibit upstairs seems to have inspired the movie Amelie.  Its all about \"found\" photos.  Also very cool.", "author": "Hilary K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "I recently attended the transPOP: Korea Vietnam Remix opening reception.  There were a couple of bands and free Campari drinks.  The very laid back crow seemed pretty nice.  The current exhibition is pretty good.  Some of the artwork is a lot better than others.  It's not the most mind-boggling exhibition, but if you're really craving some contemporary Korean and Vietnamese artwork it's a slight breath of fresh air.  I'd advise heading to the De Young Museum for their Asian American exhibit.\n\nUpstairs there's another exhibit on urban gardens.  It was kinda arbitrary.  I didn't really understand the point of it.  But, there are some really cool star shaped inner tube type things you can lay on.\n\nYBCA is still a great space for the arts.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-25", "description": "YBCA is a fabulous venue.  I've been there on a few occasions and most recently for a private event.  As an attendee, the staff support was good, except for the fact that we got a number of wanderers from off the street looking for general YBCA info, but there wasn't any in sight (maybe they should have a stand for YBCA brochures near the door or even outside?) - In any event, the venue was great, the sound system worked perfectly for what we needed and the foyer was perfect for the size crowd that we had (a few hundred).", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-14", "description": "This is a pretty interesting museum...\n\nIt isn't very big, but the things they show are fantastic!!  I recently came through and saw the Nick Cave Sound Suits, and was pleased (and ecstatic!!) to see the small room up front dedicated to the 30 year anniversary of the Sisters of Perpetual Indulgences!!!  *BIG* kudos for that!\n\nI've yet to see a performance, but I love their choices in exhibits.  Always innovative and on the cusp of what's relevant.\n\nMinus a star for the meanie-pants security guard who was hounding me to \"DELETE THE PICTURES\" I took when I was actually just looking stuff up on the internet while waiting for the bathroom...  Thanks for assuming I'm a bad person, guy....   Surely I can't be the first person he's seen with an iPhone!", "author": "Jess R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-05", "description": "I l-o-v-e love taking a long lunch on the first Tuesday of the month to take advantage of the YBCA free day!  I was really feeling the latest show from the Royal Art Lodge including the oh so cute and scary but not annoying paintings by Marcel Dzama and friends.\n\nThe space itself is great and provides just enough art-- I do not feel overwhelmed as there are never more than a few shows going on at once.  A neat pace to explore some visual candies.  Also, it is very peaceful and certainly less crowded than the SFMOMA.\n\nAlso, I was sad to miss a Miranda July event a few months ago--it was sold out too soon!", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-07", "description": "I LOOOOVVVEE this place! I've been working here in the YAAW program (young artist at work) and was given the opportunity to curate an exhibition on the top floor with my peers. We are all in high school, and we have spent the last 9 months on this exhibition please come to our opening night party! =D\n\nThrough Future Eyes: Endurance of Humanity! April 23, 2009 5-8pm!", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "I just went to an event for Public Advocates, a public interest law firm, last night at the Forum in the Center.  I didn't realize they had this space, having been to the gallery before.\n\nThey turned the Forum into banquet style seating and had the cocktail reception in the outside common area.\n\nOne of the speakers said \"we wanted to spare you another chicken dinner at the Marriott\" -- here! here!", "author": "Keith K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "The actual performances are great but opening night parties can suck as they turn into a singles scene and as soon as the person finds out you're married they don't want to talk anymore (what ever happened to making friends a-wipe).\n\nThe venue is amazing but one point off for the sex crazed idiots.", "author": "Valerie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "i love ybca. it's a great space with innovative programming. Just saw a performance and it was magnificent! Warm staff, clean theater, and great exhibition space. I love the Bay Area Now series and their public programs (parties etc) are fun too!\n\nIf you're thinking about taking someone on a date- a nice performance, or visit to the exhibition is perfect.", "author": "Patricia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-13", "description": "Like many of the other recent reviewers, I attended the recent Stephen Petronio event for my first visit of the Yerba Buena Center for the Arts.  \n\nI really enjoyed the performance, but I'm doing my best to separate the performance from the venue (which is what I'm clearly actually reviewing).    The sound was great, and the location and exterior are simply beautiful.  However, the interior slightly reminded me of a slightly glorified high school auditorium.  The seats felt slightly crowded and the space lacked a little \"something\".  All and all, not bad, and they host some really creative, unusual, and interesting events here.  \n\nMy summary: the calendar would win a full 5 stars, but I'm not including that into my review.  The Stephen Petronio Yelp Event (Bloom) receives a big five stars, but I'm also not factoring that into my review.  The theatre itself walks away with a better than satisfactory four stars.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-14", "description": "I like the spacious feel of the art museum, and they bring some interesting and eclectic artists through -- both visual and performing.\n\nIt's a cool complex with some great views of downtown throughout.\n\nDefinitely a good place to take out-of-towners (especially parental types), because it has gardens, restaurants, museums, etc.", "author": "Vandana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-10", "description": "so tiny! the first floor is currently being renovated. but fun!\nmy preferences lie in the way of whitney (NYC) museum worship. the oddities, the fringe, the modern, the ridiculous. \nthere's a frame-tape-your-walls exhibit. there are some interesting takes on architecture, or the lack thereof. i went on free tuesday (first tuesday of the month). nothing taken, nothing left. like the whitney, no photos allowed.\n\ni'm glad this place exists, but again, am surprised at how little it really is.\n\nand the ad with the kid and the spaghetti -- YES!", "author": "Annie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-24", "description": "YBCA tends to have more cutting edge & local art than it's more grown up & sophisticated cousin across the street. \r\n\r\nThe work you'll see here definitely has a more local flavor, but occasionally seems like college student work to me. \r\n\r\nSome installations that were particularly memorable were actually form years ago: Thomas Friedman, and also--though I can't remember the name of the artist, it was rather SRL-ish in its sheer mechanical nature: A circle of sheet metal on hydraulic lifts that popped the sheet metal leaves up at random moments. \r\n\r\nWith memebrship you get free entry and a guest too. Oh, and in case you didn't know, I was informed that YBCA is a non-profit.", "author": "N B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-11", "description": "The rain sucked but the show was fantastic.  I haven't been to a dance performance in a long time but after watching the Stephen Petronio Dance Co., I'm ready for more.  I especially liked the first half with the music of Rufus Wainright, accompanied by a girls' choir.\n\nThe theater itself was comfortable and clean and the volunteer ushers were really helpful and nice.\n\nI didn't see any art but I will definitely go back for more exhibits and performances.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-28", "description": "The important thing to note about YBCA is that it has two distinct parts, in two different buildings, so don't forget to check them both out.  \n\nFirst there's the Performing Arts Center, at 3rd & Howard, a concert hall where I had the pleasure of seeing a bizarre and esoteric Diamanda Galas concert.  \n\nThen there's the galleries at 3rd & Mission, essentially a museum of rotating exhibits.  The current exhibit is an excellent collection of art inspired by the Dalai Lama--perfect for an urban Zen wannabe like myself.  I especially liked the video mosaic with the 120 monks saying prayers.  The mingled audio is supposed to sound like a waterfall, but to me it sounded more fitting for the last 20 minutes of 2001--an otherworldly murmur-chorus.  And the little glass-walled gallery that juts out into the street is modern design at its best.  There's also a second floor where the current exhibit is a showcase of Anna Halprin, the 87-year-old \"Performance Art\" pioneer.  Not really my thing so I only skimmed.  Note the little theater up here where they screen various art films.\n\nLastly, don't forget to take a quick stroll around the gardens after your visit, it's a great place to contemplate the profound art or theater you just saw.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-30", "description": "This review is on the galleries only.\nThe exhibitions can be a hit or miss so I recommend going online to see what the current exhibitions are before going. The galleries are rather small so plan on visiting the Museum of Modern Art (MOMA) across the street as well.  The Yerba Buena Gardens are a nice place to have a picnic lunch if it's a warm day.\n\nTIPS: The galleries are free on the first Tuesday of every month.\nDiscounted admission to seniors, students and teachers.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "YBCA was a client of mine for many years and I always enjoyed their bold programming and experimental attitude. They show a tremendous range of work and whenever I visited I found fun surprises. The new \"big themes\" are a refreshing, thoughtful pause from the constant flow of events.", "author": "ari s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "I came out here a few weeks back for the Dali Lama (Tenzin Gyatso with some work representing Mao Zedong) and the BioTechnique exhibits and enjoyed the collection of up and coming artist.  Some of it I had seen already in NYC already which was nice to see they getting the exposure in SF.  I was a little disappointed in the BioTechnique because several of the pieces were \"not working\" or unflattering as living works of art and wasn't very impressed with the background put into it.   \n\nRegarding the space, I think it's a great size to stop in for a few hours between activities or just to hang out in the gardens but I never enjoy getting around this area, especially around the holidays. \n\nDefinitely check it out and Thank you! for the free coat check.", "author": "Austin V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-10", "description": "Almost always has an interesting exhibit/instillation. I've seen everything from Black Panthers memorabilia to old skateboards and punk records. The  actual skateboarding bowl during one exhibit was an exciting touch. \n\nI hate drum circles but I once caught a piece here that featured a life-sized teepee (sp?) with a circle of televisions featuring drummers. Excellent po-mo work. \n\nThe place is so great/diverse I even got the chance to  write an article about the R. Crumb exhibit. Fabulousness.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "NARRATIVE\nSo many emails come into my inbox, but I was excited about the Art Savvy program at Yerba Buena Center for the Arts in partnership with Visual Thinking Strategies (VTS) as a 101 to interpreting and understanding modern art. \n\nCONTACT INFORMATION\n701 Mission St @ 3rd\nSan Francisco, CA 94103-3138\nph: 415.978.ARTS (2787)\n\nPRICE RANGE\nFree  - Decadent\n\nSUMMARY\nYerba Buena Center for the Arts is a gem in San Francisco that is a dynamic art space. I've been there for skateboarding and hip-hop exhibits, youth film festivals, theater and dance performances.\n\nTheir Art Savvy program is a once a month program to introduce community members to modern art through the use of Visual Thinking Strategies. By partnering with VTS, YCBA opens the gallery on a Thursday evening. Participants are guided through a discussion of a variety of pieces to open up the sensibility to modern pieces. (Which is great if you are not an expert.) Afterward, we are led through the gallery's current show and spend about an hour responding to the pieces as a group.\n\nGreat way to spend an evening and approach modern art in a completely non-pretentious way. The facilitators really were helpful in sharing their knowledge with the participants. Participants ranged from working artists/educators to novices, such as myself, who may have a sense of aesthetics, but lack formal training in \"capital A\" art.\n\nDecember 2008's exhibit featured works from Viet Nam and Korea. It is \"transPOP: Korea Vietnam Remix.\"\n\nSERVICE\nYCBA and VTS staff were excellent facilitators for the evening. We had a separate classroom for the \"instructional\" portion of the session and then went down into the gallery space to view some of the work. \n\nThey were really encouraging of participation, offered their expertise, but also elicited the knowledge of the participants to create an impression of the works.\n\n\nRESTROOMS\nLovely restrooms at the YCBA.\n\nSUGGESTION\nArt Savvy is an excellent idea! Perhaps each month targets specific groups? Professionals, students, youth, artists, dancers, techies, etc. to get their take on art and to also open the space up to more community members.", "author": "Eriqua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-09", "description": "i really enjoyed going here a couple couple couple years back. ive been wanting to come back SO much, but no one ever wants to accompany me :(. well upon my last experience! Though  it was amazing it is a modern art museum, they were able to capture all the essence of art anyways. \n\nthey had a whole display from this one artist that made all these different pieces from an orange. there were orange peels hanging everywhere and shaped and molded into different forms. \n\nThen there was a whole bunch of surfboards all over the exhibit with different illustrations all over it. \n\ni know they had a whole bunch of other stuff, but i cant remember. \nbut the one thing that got me the most was definitely the exhibit with the oranges.", "author": "fionion f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-07", "description": "This is an awesome place, no doubt, but I find the exhibits here hit-or-miss.  You have to consider the building itself is not all that big and they *do* manage to put on great exhibitions in spite of it.  I would say to definitely watch the calendar to see what is going on.\n\nTimes visited: 3+", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-07", "description": "Very compelling art exhibits! The two exhibitions were based on Vietnam and Korea with their relation to the Vietnam war and greenifying urban space. The piece with Vietnamese people retelling their encounters with helicopter's destruction and symbol of national pride during the war was very moving. \n\nThroughout the gallery, you use your cell phone to hear the meaning behind certain pieces, which was neat. It would be even better if they had daily exhibition tours since they tend to make everything 10x more meaningful. \n\nOutside the museum is a gorgeous garden with a lovely inspiring water features. Who can complain about that?", "author": "Wing P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-20", "description": "SFMOMA rocks it, but for some truly contemporary art particularly art from the Bay Area, the Yerba Buena Center rocks the Casbah. One of the best series they have is the Bay Area Now shows. It features some of the best emerging artists of the Bay Area (including Neck Face!!!). This is also where you can find awesome off-beat shows like \"Beautiful Losers\", the Erwin Wurm exhibit and the Creative Growth show. \n\nSome of the best curatorial work in San Francisco is done here. The shows have a great flow to them and the space is excellent for the work both large and small scale.", "author": "Jackie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-20", "description": "Five stars for this wonderful performing arts space and garden. The events I've attended here:\n\nLive Dangerously: An evening celebrating freedom of expression with SF poet laurette's reading Alan Ginsberg's poem Howl and displaying the censored works of Lawrence Ferlenghetti\n\nIsrael in the Gardens: A whole day festival outside with music, food and local businesses celebrating Israel's 60th Anniversary.\n\nBreaks: Marc Bamuthi Joseph's multimedia performance - tribute to hip hop and revisits themes of dual consciousness, identity/ self discovery and expression.  Preeminent hip hop artist and essential performer / educator of our time.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "If it is still on at the time you read the review....... check out the fake handbag exhibit. .......So clever.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-25", "description": "I loved going to the porn flicks screening last year from CineKink festival, for some reason I didn't hear about it this year and missed it. Anyway, I went to the What's the Big Idea? Night Party 2009, and it was horrible. Pure lame. Displays/ \"ART\" were absolutely boring and amateur, music was trash (where was the Cuban band?) nobody was dancing, some security people were rude. I am giving it 3 stars because this is their first party and they were offering free (real) tattoo's and free cover charge. No henna though like they claimed to have.  The patio was nice and that's where most hung out.  I'd rather they charged 5-10 bucks and do a better job in this venue, it's a waste of precious space and potential positive ambiance here.", "author": "Celine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-12", "description": "Yesterday I was lucky enough to get to go see the Stephen Petronio Company performance at the Yerba Buena Center for the Arts. I've been here before, but only to the galleries, where I have seen some pretty amazing art shows. This event was in the beautiful performance space, and was one of the most amazing performances I have seen. There were three pieces in all, each one with its own amazing lighting, music, costuming, and especially wonderful choreography and music. I was so excited to be there, and everything was above and beyond any expectations I had. The dancers were incredible, especially the soloist that performed near the end. I really really loved every part of it.\nThe middle piece, I think it was called Bloom, had some very covetable music, by Rufus Wainright and the female dancers were wearing the cutest dresses. All my friends and I agreed that we would love to be in possession of the dresses and the music! \nIf anyone gets a chance, I would suggest seeing a performance here, or the Stephen Petronio Company, wherever they may be performing.", "author": "Cyrelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-09", "description": "The exhibit on Mexican street graphics was simply outstanding. All kinds of signage, lettering, paintings. All hand done, yet with exquisite attention to detail--or if not, at least a very refined sense of sloppiness. The show setup seemed improvised, with a lot of work hanging on wooden dividers. But this totally fit with the mood. I didn't even check out the rest of the center, because I have a time limit on how much art I can absorb--anything more than an hour and my brain reels from too much stimuli.", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "Checked out the Big Idea night party. Free entrance, modern exhibits and bhangra music 'til midnight? I'm there!", "author": "Celeste P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-11", "description": "The opening parties are too much of a scene for my tastes. A real distraction for art lovers trying to avoid a singles party.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-26", "description": "Dude, the seats are so close that I could smell what people ate for breakfast, lunch and dinner. Joking aside, it is a wonderful place to go to see amazingly talented people. The location is perfect as it is right across the street from the SF MOMA. So, you can always pay the center a visit before or after you get your artsy fix. The YBCA is another reason to get more involved with the community as well. Many of the events held bring in people that you wouldn't normally meet and to find commonalities facilitated by the activities and events from one place -- definitely deserves 5 stars.", "author": "Dorothy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "YBCA, what can I say.  This has been my employer for the last 6yrs and it holds a very special place in my heart.  I have gone from working as a preparator to the administration offices and I feel as though I have grown with this organization.  We are always questioning the boundaries of art and concept.  For a long time I only attended the galleries, but since I've started working closer to the other curators I have found myself attending many more wonderful performances and off the wall films.  If you haven't been here yet I don't know where you've been, but I would suggest widening your horizons by attending more of our mind tickling events.", "author": "Wren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-13", "description": "i dont have any grandparents. never did. so when i need a fix of old people i go to art events on sundays. and im not being agest. im completely serious. its like a portal into a generation i will never really come close to. so i lurk with the seniors. so what. im weird.\n\ntoday is mothers day. took my mom here cause she likes this piece.\n\ncarmenina burana with modern ballet on a sunday afternoon. wicked.\n\nthis was after i gave my mom a salt lamp and a blue and yellow shiny scarf.\n\n it was worth taking the 6 downtown and smelling all the foulness. \n\ni felt underdressed in my hoodie and flip flops but fuck it, its a sunday.\n\nnice box office guy.", "author": "coffeecake j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-02-02", "description": "If you're looking for truly modern art, stuff that pushes the limits and boundaries, YBCA is the place. They have a great performance and film series, plus some kick-ass opening parties as well!", "author": "Nish N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-08", "description": "I've only been inside here once years ago to check out a hip hop exhibit. It seemed to be okay but from what I can remember, it was nothing spectacular. There are definitely better museums/art centers in San Francisco to visit besides this one. I would go again though definitely..and when I do, I will update!", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-12", "description": "Sweet little theater in which to see performances & art shows. I've seen ODC here before and a ballet. In the summertime they put on free lunchtime shows in the gardens, it's always a great time! Last year I saw a Rosa Parks homage dance thing with teenage girls, they were so talented!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "We saw Rachel Maddow here, who deserves 10 stars herself.  YBCA was a nice, new space - modern, but cozy. There were quite a substantial nubmer of chairs in rows in a big auditorium.  As comfortable as chairs fastened together can be. Was a lovely evening, but I would have thought seeing Maddow in a sewer would have been a lovely evening.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-10", "description": "Consistently excellent curation, and a beautiful contemporary space make this one of my favorite places to while away a rainy Sunday afternoon.. The Opening night parties are possibly my favorite art party in the city.", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-12", "description": "The BF and I caught a Cypress String Quartet performance here.  Reasonable acoustics but they were recording and had a weird mic setup that made it feel like the performers were in another room.  Also, they gave away a lot of tickets to school groups which is admirable but I think about half of them had TB based on the coughing.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "A great space for contemporary art, unusually exhibitions that are small but extraordinary.  It's also nice to go to a museum where you don't have to fight the crowd and feel their breath over your shoulder.  Definitely worth checking out when the entrance is free on the 1st Tuesday of the month for all and the 1st weekend of the month for Bank of America customers.", "author": "S. I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "Super fun and free on 1st tuesdays.  I really feel like they are on the bleeding edge and I love them.", "author": "Monera M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-17", "description": "The seats are narrow with hardly any legroom and sound wasn't consistent both times I've been there - I expect better from such a new facility.", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-09", "description": "i saw the ballet here and it was perfect. everyone is very sweet and i think it's best to  sit  in  the front row on the terrace so you can see the music.  \n\non the way in tonight there was a man outside selling his poetry for  five dollars. if you can, buy it before  you go in.", "author": "aerin w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "Went to party\nWith luchadors and drag queens\nAlso there was art?", "author": "Balboa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-04", "description": "I went to YBCA for the Nick Cave sound suits performance and I was really inspired by the way the space welcomed such an unusually fanciful, comfortable  and also raucous event.  I saw a lot of people I know there which is always great--especially when its random and unexpected.  But truly, the suits are so ornate and delicious to look at.  I loved watching the dancers make their way through the crowd and watching the crowd respond to the dancers.  So glad YBCA hosted all this.", "author": "Ariel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-08", "description": "I've seen so many great things here, Stephen Petronio Dance Company, Paul Taylor, Cullberg Ballet, Bill T. Jones/Arnie Zane Dance Company, Batsheva and most recently Pappa Tarahumara. Five stars for any place that brings in great and diverse independent art!", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-11", "description": "Come here to see Nick Cave's ornate, gorgeous creations.  They're testaments to the imagination in the form of heffalumps, weird sequined yetis with anthropomorphic reed carriages, beavers with mittens building a sweater-noodle-dam, intricate beadwork on amorphous giants, headdresses made out of doilies, and general shininess everywhere.  (Oddly enough, the photographs and videos of the soundsuits also hold their own, even when you've got the real things right there.)\n\nI actually saw the Nick Cave exhibition at the \"What's the Big Idea?\" party.  Attend a party here.  Just...wow.  I arrived at around midnight so I missed a lot of the performances, but I caught the end of some aerial acrobatics.  I got to see a bit of the Sisters of Perpetual Indulgence with their punk-vampire-drag act, gurgling fake blood and being generally amazing.   My favorite was one of the backup singers: whitefaced, with strange clown-diamond abysses for eyes and an unnatural cock to the head, spewing blood from the mouth and then smearing it on his own face.  And that was just the beginning.\n\nHalf the fun is checking out what other attendees are wearing.  One guy, completely spangled in silver sequins, told us he was a superhero raising money to \"remove the self-loathing from children in a beam.\"  Yeah, that's an exact quote, but he got a couple of bucks out of us to take a picture with him because he looked like a magpie's nest AND spoke in a robot voice.  \n\nAnd as we were standing on the street outside after exiting the party, we saw a guy striding by grumbling and strewing tinsel (????) behind him, like a disaffected elf.  A fitting ending to a night at YBCA.", "author": "S P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-23", "description": "This is a great museum with an ever-changing host of artists and exhibitions. You will always find some cutting-edge and thought-provoking works here. It's a convenient location and the price is quite reasonable. They also have the service where you can call on your cell phone to find out about the works.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-01", "description": "I like the building, but I think they could stand to curate better exhibits. And their Big Idea party was nice.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-17", "description": "Such a great place in the city.\n-wonderful galley exhibits\n-amazing dance performances\n-interesting films\n-live theater (xoxo)\n-beautiful gardens\n\nA fantastic resource for parents with young children.", "author": "A W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-15", "description": "Right next to MOMA but much cheaper.  Don't let that fool you, this little museum searches for only the best, most relevant work and, at that price, aims to make it accessible to everyone.  We need more museums with this spirit and attitude towards bringing important art to more people.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-20", "description": "I went to see Cosmic Wonder/Sampling Oakland last week courtesy of Yelp. Also because of the 2 for 1 deal, I got a few friends to jump on the bandwagon! Some of the art was mesmerizing with detail and unusual media. However, I'd between my group of 7, only a few us actually thought the art was something \"great.\"", "author": "Anita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-28", "description": "YBCA is by far one of the most innovative and energetic performance venues open to the public in SF. After a year and a half of a steady diet of their brand of art, I now blindly buy tickets for anything and everything they offer. I am never disappointed. Fantastic, inventive, engaging, powerful, funny, global and professional on every level. We are so lucky to have access to them. Best art membership in the Bay Area!", "author": "Monster B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-07", "description": "Love this very versatile center. Ice skating ! The Zeum ! Theatre! There are so many things to do here.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-14", "description": "YBCA is such an amazing venue to see live performance in SF.  There's a great view from any seat in the house, although I'd avoid the boxes if you're seeing dance - the perspective's a little wonky.  I especially recommend checking out the \"YBCA Presents\" series - these are performers from around the world that Yerba Buena finds and makes it possible for them to come to San Francisco.  BTW, subscribing to a series makes the tickets super cheap.", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-03", "description": "Good venue space. I came here for one of the yelp holiday parties and I was impressed the YBCA was bigger than expected. I was able to look at some exhibits and I would agree that this has more interested stuff than the SF MOMA. I think they also gave free tickets for another visit too (that don't expire ever), so that was pretty generous.", "author": "Retired B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-16", "description": "I was here twice a week at least when the Beautiful Losers / Free Basin exhibit was running late last year.  It was in a word incredible!  The artwork, the photography, sculpture all were top notch especially the Free Basin skateboard bowl.  I applaud the museum for their efforts in this project!  I just wish they'd build another bowl inside for me to skate!", "author": "Derek D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-25", "description": "I recently went to a Design Series lecture here and the speaker - Clodagh - was just magnificent! Her presence, knowledge and spirit surrounding interior design and life was just mesmerizing. Great job by Yerba Buena for the presentation and subject!", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-24", "description": "This is a great institution that has really good activities in addition to its museum.  Recently I participated in their gallery walk which was 6 smaller galleries in the vicinity that opened up their spaces for free.  There was wine and appetizers and the art was diverse, interesting and in some cases very affordable.", "author": "Gwyneth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-09", "description": "I saw the HMS Pinafore here, a Gilbert & Sullivan Production, during my stay in San Francisco. It was an absolutely delightful night! Hilarious and entertaining, I would love to see it again! Very well-done and great actors!", "author": "S. F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-14", "description": "YBCA! My favorite!  I've seen so many great exhibits here - the Beautiful Losers show, The Royal Art Lodge, Cosmic Wonder......the list goes on. And the films series are amazing.  My message to the film curator: \"I love you!\"  I've also seen some great music there - the Asha Boshle with the Cronos Quartet, Diamanda Galas to mention just a couple.", "author": "Super H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "An appealing place to relax with a great view of the skyline in middle of SOMA", "author": "Joey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-08", "description": "-there's something sexay about a boy who knows his public transportation. if you're bad at direction like i am, there's nothing better than a man leading your way\n-watani and i decide to go to SF all thru some footaction and public transpo with the goal to go to YBCA and use the pass i got from the yelp christmas bash '07\n-i love walking, i am thankful someone does too and is down\n-we go in and leave our touristy backpacks at the front desk as our tickets were issued\n-we were greeted pleasantly.... seemed like almost all the security/guides were my \"kababayan\"s\n-art always moves me, since i am hyper and can't keep still, doesn't mean i don't run thru my head the kazillion possiblilties of what, if and how, or just plain wow\n-laying flat on our backs on the cushions looking up at some sliding photography bout 3 feet infront of us from a flat screen dangling from the ceiling was great and somewhat romantic\n-the \"psycho room\" (was going thru my head) was awesome.....felt like i was in the movie hostel and they were sharpening the tool of choice for my demise below me as i feel the vibrations, hear the sounds and see the passing lights from the cracks on the floor\n-i remember the restrooms from the xmas party....very vital knowing how my bladder gets, clean...both upstairs (1 person) and down (a few stalls)\n-the peephole grass carpet walkway was fun, esp. with the people outside looking at you thru the glass like you were on crack. watani: i don't get it (as he sticks his head into a hole)....\nme: dood.....there's no peephole in that one.\n-the vibrating buttocks, penis and boobage was a little bit surprising but i so wanted to womanhandle them so i just turned around and moved toward the room with \"the book\".\n-too much awesomeness to mention, it was fun times with great company.\n-focus on local......gotta love that\n-thelma, one of the gracious guides told us it's FREE EVERY 2'ND TUESDAY! go! go! go!\n-while enjoying the sight of the lush gardens from the inside i recognized someone as i knock on the glass and get his attention with an invisible blow .....cobber san lucas! awwww he joined us for a few in the spacious lobby and walked out with us\n=PPPSSSSSTTT, CAN I HAVE YOUR PASS IF YOU STILL HAVE IT? THANK YOU YELP FOR GREAT FREE SHIEYT!", "author": "serbelle i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-19", "description": "i love art.\r\nit's that simple and ybca satisfies.... you're not going to get your rockstar shows here (wait, beautiful losers, well, and fela kuti, oh and the rank and file : black panthers show : and i guess the whole bay area now cult), well, it's more accessible rockstar, without the limos and beefy security teams. security here is volunteer docents from the suburbs on opening night, really, really, really determined to stop you from taking that picture of that AMAZING poster \"by any means available\" while 4 OTHER PEOPLE! are posing next to the weird native sculpture....!\r\noh, but back to the (he)art.....\r\ngreat venue, excellent curatorial team, relevant shows to the bay area, lots of natural light, really quite friendly security, great staff that makes that place happen! and WORKING ARTIST memberships. big deal, folks! \r\nopening night parties are slamming everytime and you CAN see the art, be patient, and 100s of beautiful people as well, and i promise you'll run into at least 3 you know personally.\r\ndon't forget the first tuesdays of the month are free, and finally, they keep a rotating exhibition schedule, so there will be art either in the upstairs galleries or downstairs galleries, but really, you want both... check the website before you head out", "author": "Scatha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-28", "description": "first visit was okay. they had closed a bunch of the galleries though, so i couldn't have a much fuller experience. will visit again though.", "author": "Kenneth H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-13", "description": "This is a great spot and could be a great theater. I just wish there was more!  For some reason I used to attend events here all the time years ago and then not so much.  The Steve Petrionio event was fantastic.", "author": "Misti L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-21", "description": "i love forum at ybca; it's an excellent space for dance. it's intimate in feel, and every seat is a good seat. this is the place to go for regional, national, and international dance that's looking forward towards what's possible and beyond.", "author": "Bee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-11", "description": "spending a saturday night at the YBCA made me feel like a tru culture vulture.  seong p and i braved the rain last night to check out the stephen petronio dance co, and it was great.  what dance troupe wouldn't be great when moving to the music of rufus wainwright?  god, i love him.  anyhow, definitely come check out other shows as well, such as the ODC shows, which are always great!  i'm not really into the classical musical performances, but there are always great dance companies that come thru here!", "author": "Helen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-15", "description": "I went to the Cosmic Wonder opening last night with two of my roommates and I'm still trying to digest the entire experience.  There was quite a few interesting exhibits, like the television showing a continuous video of various other televisions.  And there was also the television surrounded by grocery store items, showing a video of a shopping cart traveling through a grocery store with nobody pushing it.  And I can't forget the large room where the drinks we're being served....I watched a man dressed in head to toe neon dance around doing violent movements as he tried to expel fear from the room to the ringtones of the Dirty South's very own -- Bone Crusher.  If you're confused, so was I?  The Cosmic Wonder exhibit  was the epitome of freedom of expression and seemed to fit perfectly in the fine city of San Francisco.  The technology was state of the art and the place was very spacious and the prints and performanes were interesting to say the least..  I'd definitely go back for future exhibits.", "author": "LaSha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-11", "description": "i give out only a few 5 star reviews. this place gets one of them. what a fantastic space for taking in arts/culture, food and r&r.  they have a great theater program, cool cafes with views of the city, and a fantastic lawn that also serves as a the summer time music series concert ground.  modern, refreshing and clean. should be on everyone's list of to-do's several times a year.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-29", "description": "it's the place where i work, and also the place where i fell in-love with the arts. from independent films to bowl skaters to ballet, we have em all! the people that works here will always go way and beyond the call of duty and will support you in every aspect of your life. This place rocks!", "author": "Joremel A."}
