{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "I came here for dinner for my first time and the place was packed! However, my party did not have to wait too long because the staff was quick to clean up the table after the last party left. They seated us right away.\n\nFood - 5/5\nThe menu has a lot of variety, but not too overwhelming with choices.\n\nMy table of 4 ordered ( *** = our favorites ) :\n- Truffle Edamame***\n- Miso Soup\n- Grilled Whole Calamari***\n- Tuna Poke Nacho***\n- Fire Cracker\n- Seasonal Mixed Sashimi***\n- Uni Nigiri***\n- Spicy Bazzar Roll***\n- Yoji Kanro Roll***\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\nThe fish and seafood here is so fresh especially for its price! Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\nService - 5/5\nThe service was great and the staff was super friendly! The staff gave excellent recommendations on what to order for our first time here. They also checked up on us and refilled our tea often. Even the sushi chef asked how we liked everything.\n\nOverall -\nYoji Sushi House is my new go to sushi spot in SF with the freshest quality of fish with an affordable price! I will definitely come back for more. Especially since they told us about their Happy Hour menu on Mondays-Saturdays from 4pm-6pm. ;)", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Experience:\n\nOrdered delivery-- The sushi is not only good; but tastes spectacular! Now is one of my favorite sushi places in the Bay Area. I was hesitant at first because of some of the reviews, but glad I didn't. Don't be fooled by them. In my experience within the delivery order, they were fast and under 1 hour waiting period. \n\nFood: \n\nGolden Gate-- 5/5. Super fresh and tastes super authentic unlike other places I've been to in the Bay Area! Super super good! \n\nRed Rocket Roll-- 5/5. This one was my favorite one out of the 2 I ordered. Tastes fresh, sauce was on point and the way they prepared the food is beyond good. I can see they really took the time and prepared it right for their customers. \n\nOverall: \n\nI'd come back-- not for the delivery but maybe to the actual place. They seem to serve damn good Sushi and non of the BS. I'm definitely going to order again. Keep up the great work! \n\nThis place is definitely worth a try and I will definitely return without hesitation! 5/5!", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-13", "description": "Not sure about the food. Never got it. Delivery driver shows up 45min late, hands me a pink box that weighs as much as air (I ordered like 5 rolls and chicken karaage). He insists I take the box and that it must be right. I vehemently disagree and refuse to take the bag back. He starts walking away and tells me to call the restaurant (I'm assuming he had no other deliveries in his car that might have been mine?). Call the restaurant, woman is hella rude. \"It's not here. We're busy. D you still want your order?\" Lol nah. I shouldn't have strayed from Oyogu.\n\n\n*update* I am weak and tried again later. The food was pretty good and the service was nothing like the first time. I've ordered again since.", "author": "Matthew I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Good experience at Yoji, sashimi and nigiri is very yummy and the price is unbeatable! especially during happy hour!! Oyster only $1 at happy hour. Everything​ else like grilled items and ramen is yummy too, even come here for a ramen also is a good choice.", "author": "Faye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "This is the most favorite sushi restaurant by far, especially the tuna, very fresh! Nice interior! Good service.", "author": "Vincent H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "This restaurant has modern decor. Lovely surroundings and made to feel so welcome. The service was responsive and friendly. The food was beautiful and delicious. Great food at a great price! All in all an excellent experience, highly recommended.", "author": "Elwing Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "This is my first time to this restaurant and can't wait to share the experience. The sushi tasted fresh and unique, the meat tasted juicy and delicious and the service is so amazing too. It might be my new favorite spot. No doubt that they serve authentic Japanese cusine. I highly recommend.", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "A hidden sushi bar gem in the Forest Hill.\n\nThey have a wide selection of fish, excellent quality similar to Amami!\n\nGreat service! Very attentive servers, didn't have to hunt them down for a refill. Also gave good and honest recommendations for us.\n\nClean, newly remodeled restaurant with cool, quiet atmosphere. Not a lot of dine-ins so there wasn't a wait but they have loads of orders to go!\n\nWill definitely come back again!", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "New owners, OMG so excited we didn't even know they changed hands. The best rolls, plum wine, food and service. Now this is our spot!", "author": "Dee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "New favorite sushi spot! We've passed this place many times and finally came in and it is now our staple sushi place. Amazing food and service. Apparently ownership has changed (which we didn't know) and the new owner made us a special dish and even brought out the tuna so we could see where he took the meat of the fish from. Quality of the fish is amazing and we were beyond satisfied with everything ordered.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I live a few blocks away and after seeing the great reviews since the ownership change I decided to try Yoji Sushi House.  What a great surprise!  Pleasant attentive service, nice design and best of all REALLY GOOD sushi.  I also tried the agadashi tofu which was yummy.  I will be back again and I'm excited about taking advantage of the Happy Hour specials.", "author": "Roberta B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Been here few times and we got surprised tonight. We came a little late like around 9pm. They kinda slowed down already. We sat by the bar, and chief Sam ( very nice guy)was serving us tonight. He introduced the fresh fishes of the day, and he made some special dishes for us that were not on the menu. All dishes were soooo good!!!!! And looked sooooo beautiful!!!!! Fishes were very fresh! The combination of each foods with the fishes were so tasty! Love all the dishes so much!!! Will definitely come back and ask for some chiefs specials.", "author": "Kate Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "I think this is the best sushi place in San Francisco. The red rocket roll is so yummy. As a salmon lover，Love their sake maki，the salmon is real fresh！！！lionking taste soooooooo good. I will definitely order again.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-02", "description": "This place is ok, not bad, not great. My partner had sushi which was average and quality, but I had a Donburi bowl, and it was flavorless. I don't think they put any seasoning in it. since it's a local place I would consider going again, but the \"suggested\" tips they had printed were were based on the FINAL bill total, not the pretax amount. If you followed it you'd give a significantly higher tip - a good 10% more. Seems a bit dishonest.", "author": "Cate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Definitely coming back! This place have the best selection of fish! Everything was on point! \n\nStaff was great and very attentive!\nFish was fresh and tasty!!!\nPlating was very good! \nThe rolls were made perfectly! \n\nTotally coming back! It's a perfect neighborhood sushi joint!", "author": "Gio A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "These rolls are a bit pricier than your average sushi spot, but they are REALLY good.  The Lemon Drop roll is to die for and so is the Hot Night roll.  We also order the Crazy roll, the Rainbox roll and the Rock n Roll - all really fresh, perfect temperature and carefully packaged.  One of my pet peeves with sushi is when it comes to you slopped in the box and this is not the case for Sushi Shoh, they packaged my to-go order as neatly as I would expect to have for a dine in order.  I'll definitely order again (but I will not use Postmates for it because we had to go on an Easter egg hunt to find our Postmate who didn't speak English and tried to pawn our order off on a neighbor -_-)", "author": "Emma H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "We've ordered take out before and it was great but tonight we dined in and it was fantastic! They have a lot of interesting items on the menu and everything we ordered tasted great! The staff is super friendly. The new owner is the nicest person and took time out of his night to chat with us about the fish he orders and how the cut the sushi. This is truly an SF gem! Food is great, prices are reasonable, service is top notch!", "author": "Meagan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "AMAZNG SERVICE- very unassuming but they gave us free edamame and green tea ice cream. Rolls were reasonably priced and the staff was so sweet! Very home-intimate feel.", "author": "Alia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Have been to this store for many times. It getting much better after changed ownership. The food was so good and the service was excellent. Will be back again and even more.", "author": "Eric Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Came here for the new opening! The restaurant looks awesome with the new look and staff. Besides the place being small I had a great time. Staff is super friendly and quick. Definitely would come back! The food was 10/10 stick to the sushi!!!!", "author": "Andy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-11", "description": "The place is lame. Dimly lit, the sushi bar is dirty AF and the fish didn't even seem that great/fresh. They also forgot to include my drink in the pickup order.\n\nNot coming back.  shell out the extra bucks and go to a well established sushi spot. \n\nThe guy rolling the rolls behind the bar seemed shady.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "The service and food here are fantastic! All three times I have eaten here the sushi was some of the best I've had and brought out timely. Personal favorites include the spider hand roll and the lion king roll. After my friend had gotten a little too ambitious at the beach and ended up wet, the owners here lent her a personal heater to keep next to her so she could dry and stay warm while we eat. Highly recommend", "author": "Jake C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-28", "description": "Sushi took 2 hours to deliver. It wasn't even that big of an an order or that far away.", "author": "T. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I have lived up the street for almost 7 months now and always pass it going to the Forest Hill Station and never tried it.\n\nMy boyfriend and I decided to do take out one night and it was pretty good! Their rolls were super tasty and they give generous portions of miso soup, which is always a plus.\n\nDefinitely recommend!", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-18", "description": "The folks are all nice enough but the fish is very mediocre.  If you want value Japanese this is fine.  If you want excellent sushi-  not so much.   Scallop nigiri tasted more of water (from freezer) as opposed to scallop.  Rice was no seasoned and had barely any taste of vinegar.  Hamachi was fine.   Rolls are large but again, the fish or lack of fish flavor is hidden under all the sauces.", "author": "Steinbeck H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "If you're already in the area, maybe try Ebisu. \n\nThe pricing was a little expensive. \n\nThe sushi was definitely tasty and pretty aesthetically pleasing; however, for the price, you could go down the street and get Ebisu. \n\nWe did enjoy it, but I'm not sure we will return.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Our 1st time here.\nWe like it!\nCan walk here from miraloma park. \nPrices are fair n reasonable. \nFood very tasty. Great service.\n\nTryed 2 lunch specials, very good.\n\nWe added a hand roll each. These were Very Fresh and seaweed nice and crisp \nAll the raw fish was very fresh: salmon was Really Outstanding!", "author": "Nat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "I love this place!! Every time I eat here my stomach is like \" three thumbs up!!\" All of the staff is amazing. Dorris takes great care of me and brings a surprise from the bar. Their specials are fantastic and the specialty rolls are creative and delicious!\n\nI highly recommend the lemon drop roll and if you are feeling adventurous try the salmon skin roll.", "author": "Jesse W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "I came in a few month ago with my friend to grab a few rolls and a sashimi combo for to go since she live near by and we didn't know what else to eat. The sashimi didn't taste like fresh fish. The rolls were okay, but we had a roll with salmon. The sashimi didn't taste fresh so we didn't even finish that roll. Today I feel some sushi when I was getting off work so went in and order a few rolls for to go and I told them about what happen the last time I order here and the cashier told me he is the new owner. I was surprise when he said he just took over this place a few week ago. He told me to sit down and wait while my order was being made, he asked if I want water or tea and then said would I like to try the blue fin that they just open. I said yes, so he gave me 2 pieces and delicious  . I told him right away add the 12 pieces combo. I came home and first thing I try was the sashimi, all the fish tasted fresh and vinegar rice was cooked just right. Then I try the rolls and I had nothing to say beside delicious! Definitely coming back with my family next time. I think I just found a new place for sushi. Definitely comparable to a few other good sushi bar in San Francisco.", "author": "Edmond C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Came here on a Friday night and it was a great experience! \n\nGot greeted instantly and sat down, ordered the dragon roll and the cherry blossom roll and a whole bunch of sashimi and everything was fresh! Small little cozy place perfect for date nights or family outings! They have a good selection of beer and sake to pair with the fish.  I was taking notes on this place all night and they have A LOT of ubereats and doordash orders as delivery drivers came by literally every 5 minutes so you can get it to go if you do not want to eat there.  \n\nParking there shouldn't be too hard to find as there are a lot of residential spots very closeby.  I definitely will be back and I will highly recommend this place for sushi!!", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "This is a super solid spot for take out or delivery. I did dine in one time here and the atmosphere was very lacking, and we were the only customers in the small restaurant, plus parking is iffy. But if you do get delivery, they are usually very fast, the order is always accurate, and the quality of the the fish is surprisingly good! Would recommend the Chirachi Don or Salmon Don if you like fresh Salmon.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Long time neighbor who finally made it in here and wish I had come in earlier. The fish here is fantastic. The service was friendly and efficient. We will be back!!", "author": "Vince H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-16", "description": "OK, this was bad. I've ordered delivery 8-9 times before because the menu is interesting and the location is close. Tonight's order was gross, and was final straw in orders of diminishing quality.\n\nShrimp tempura in Firebomb roll looked and tasted like it was deep-fried three days ago. Spicy tuna, also elderly. The asparagus used in the yaki asparagus was made of stringy, barely edible stems - the parts I cut off when making any asparagus dish. The kicker? My $6 cheesecake was a SLIVER... Like half the size of most restaurants. Comically small but also sad because this used to be reliable delivery. In total, the order had all the trappings of a struggling restaurant fighting to keep pace. Adding an extra point (from absolute worst) because they've been better.", "author": "Jon P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "This was the worst sushi I have ever eaten. I read the yelp reviews and being new to the neighborhood, thought I'd give it a go. Yuck. 82.00 worth of garbage. The spicy tuna roll was mush. The tuna was literally mashed, which I suspect was a cost saving measure in order to use all the little crappy bits. The California snd SF rolls were literally fake crab salad. I've never eaten a roll with mayo in it. The nigiri was super tiny. I would rate this place a zero but yelp doesn't offer me that option.", "author": "Linda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "I live right down the street so this is my go to for ordering in sushi. \n\nThe sushi always arrives fresh and the gyoza is just how I like it. I usually have to throw it in the over for a few minutes to make it crispy again.\n\nHaven't had a bad roll yet!", "author": "Emily E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "It should be called \"Sushi No Show\".  I've had good food from them in the past , but I've ordered twice in past 2 wks and they didn't deliver. Anything.  At all!  Weren't really even apologetic when I called after they were 1hr+ late.", "author": "V J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Very good . Everyone was very nice . They were out of plumb wine when my girlfriend ordered, which was ok but then they went and got plumb wine from the store they went above and beyond", "author": "Brad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "I ordered delivery for 3 combo boxes and super sashimi combo, very fastest delivery and reasonable price. I'm so surprised that the delivery guy was delivered my order in a warm box!! The sashimi is fresh and delicious. 5 starts for sure.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "This place is great!! Their handrolls are amazing and on top of that almost everytime we go they offer us free ice cream with our meal! this place is definitely a cute, little place you can get great food and great customer service.", "author": "Amber C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "I love this place and eat hear at least once a month. Their rolls are incredible and they are great with delivery as well. For the quality of sushi you cannot do better.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-06", "description": "The first time I came with my girlfriend the food was really good, standard sushi nothing too exciting. The time after that it was totally different, some of the fish was not as fresh as I am accustomed to from other places and the fish katsu as well as the salmon, definitely frozen. Light on the pockets for sushi, 3 star's for the owner's hospitality. Also, don't deliver from here takes a while and it will NOT be hot and fresh upon arrival.", "author": "Isaiah E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Fresh fish is the best fish! The food here is delicious. I especially like the spice bazaar and the hotate bacon maki! Looooove the scallops so much. Will definitely be eating here again.", "author": "Jeannie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "Worst service!!! Ordered through Eat24 and the food arrived over 2 hours late. It would have never been delivered unless we started the help chat with Eat24 after waiting the initial first 1.5 hours. We called the restaurant as a follow up and was told that they never got the order from Eat24. Eat24 chat said that's not the same excuse they were told by the restaurant.. I've never had a problem with Eat24 before and this was the first instance on a mishap. I order using Eat24  on a weekly basis and promptly receive the order confirmation receipt via email. I don't believe the restaurant was being truthful or honest.\n\nNever ordering from this place again!!! So much from giving the local neighborhood restaurant a chance.. at least the restaurant gave me a 20% discount on the order and Eat24 gave me a $5 credit on my account. I'm not giving a tip...", "author": "Alexei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "This place is amazing!!! My group did the Korean BBQ all you can eat and everything was delicious; you can't leave without at least trying the jab-chae! The service was just as great at the food. If you come ask for Jennifer and Jay. Not only are they quick, but they are very personable. They made sure that we were well taken care of the entire time, switching out our grills several times as well as checking on us multiple times & they accommodated/ made recommendations for my vegan friend! Will definitely be coming back!", "author": "Kirsti D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Solid place for delivery. Food is fresh and arrives on time. Have ordered for delivery about three times- so far, so good.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "{review from experience 3 months ago}\n\nI ordered the Firebomb roll, spicy tuna, California, and seaweed salad delivery. It took 35 min to arrive (for reference, I live ~15 minutes away).\n\nOverall, the food was OK but not great. The spicy tuna was definitely not my favorite. It tasted like gochujang (spicy red pepper paste) with tuna instead of the standard Sriracha sauce flavor. Maybe you're into that. But I was not. That said, the California roll and wakame salad were good. And the prices are low, so that was my initial draw. \n\nMaybe their sashimi and/or other items on their menu are good, but as a \"standard\" spicy tuna fan, I'm not sure when I'll be back...", "author": "Julia N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "The food came surprisingly quickly, but it was way too salty and you couldn't taste the ingredients. The delivery man was also very rude, and he sent me a mean text AFTER the delivery because he didn't like the tip I gave him! Unbelievable!", "author": "Michèle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "This review is for delivery. I have to admit that this place is one of the best for sushi delivery. I was hesitant at first esp with the prior Yelp reviews about delivery service but I still went ahead and did it anyway. And I'm glad I did! Ordered the lemon drop, mango sp and spicy scallop rolls. Also the hamachi and tuna nigiris. We even got a spicy tuna roll for free! It was all delicious and soooo yummy! Everything arrived on time and was so fresh! Will definitely order delivery again!", "author": "Stacey M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "This is my first time order here.I ordered Chicken teriyaki and salmon teriyaki，Salmon teryaki was ok，but chicken teriyaki was not fresh，such as put in the refrigerator for a long time。never back！！", "author": "Segi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "Ordered the \"bento box\" for delivery from primenow, specifically asked for sauce on the side but instead they drowned everything in it. The food was completely cold and I may be getting sick from it. Would not recommend at all", "author": "Cai L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-17", "description": "We order online from here a lot. It's one of the better delivery services in the neighborhood.", "author": "p v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-18", "description": "Called this place 10-15 times during day time when Yelp, eat24 and Internet says they are open and their line was either busy or just kept ringing.\n\nHorrible.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "Came here for din din last night and ordered\n-Shitake mushroom yakitori\n-Veggie Sushi Combo\n\nThe shitake yakitori was nothing spectacular, but they were tasty and plated well for a good IG photo haha so thats extra points in my book.\n\nMy main dish was the vegetarian sushi combo which was actually pretty good. \nIt came with a cucumber avocado roll, and six pieces of veggie nigiri sushi.  I've never had veggie nigiri sushi before it was pretty good! \n\nThey even gave us some edamame first, I had to explain to my boyfriend the difference between these and peas because he thinks they're the same thing....and still thinks I'm lying.  It's pretty amazing. \n\nWas it an amazing experience? No, but I was full and satisfied for a decent price.  Plus I live one block away! New-lazy-go-to-sushi-place-check.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "They're so nice! I went in at non-business hours, and they offered to make me food and deliver it to my apartment", "author": "Lina H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-29", "description": "Delivery took really long at 1 hour and 10 minutes. The food was not hot when it got here. Ehhhh. I am disappointed.\n\nUpdate: ugh, I got sick from the food.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "I'm unable to have rice due to a dietary restriction. They refuse to make sushi rolls without rice. Other sushi shops are glad to make cucumber wrapped rolls instead of rice wrapped rolls.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "I used to order from this place and I was upset by the new owner( I guess) coz I dun see the people I used to see , but I am glad that the chef that in the kitchen is still here, I tried to order couple things but they don't have it like gyu hire I believe is call like that. Shishito, grill mushroom are my favorite , but they dun have it.", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Food very, very tasty! I love Gyutan and Gyu hire yaku. Personal are very friendly. Would recommend.", "author": "Yelena T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-12", "description": "First let me say this has been our go to sushi delivery for over two years, and it has always been great. The prices are good, and the quality was top notch. Saba sashimi, which is generally my test of a good sushi chef - always marinated just right, and never over \"cooked\". They let you customize and add extras to rolls. We love(d) all the Makimono rolls - all creative, unique and delicious... Tonight though? Something was unmistakably different. The baked salmon on top the Lion King was way overcooked, dry and hard. The unagi was chewy. Reminiscent to a badly rolled burrito, half the fillings of literally every roll were all the way at one end and missing from the opposite. This was not the sushi I knew and loved, but something far more inferior. So, because inquiring minds must know, I called the restaurant to ask what gives - Did someone call in sick? Is there a new apprentice? Is it take your kid to work day? Unfortunately, I was informed, it was something far worse - It turns out the chef has been replaced, permanently. So there's a new chef in town, who with carelessness or inexperience has taken my go to and made it boo boo. Bad move Sushi Shoh, bad move. The is the kind of stuff that can ruin restaurants.. I wish you the best, as you've been good to me, but for now our paths must part.", "author": "Phil J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "Sushi Shoh is my current favorite Japanese restaurant ~ I've had their Salmon Teriyaki dinner twice and was impressed by the portion size and quality. For $13.50 you get two generous slabs with rice and steamed vegetables with a nice crunch. On my initial visit, the teriyaki sauce came on the side which I preferred. If you want yours on the side, be sure to request it since it came on the fish on my 2nd visit. My entree also came with a salad (love their gingery dressing), miso soup, and edamame. All this food was enough for two meals! \n\nMy friend enjoyed her Unagi-don (grilled eel over rice with Japanese pickles) and another friend enjoyed the Chirashi-sushi. I tried a bite of the sashimi and it was delicious. As for dessert, the mango ice cream and NY cheesecake were hard to resist, so we indulged in those too.\n\nThe service is friendly and helpful, the ambiance comfortable to enjoy a relaxed conversation. It wasn't too busy, but I did see a bunch of orders headed out for delivery. For added entertainment, they have a TV and serve beer (Sapporo and Asahi on draft), sake, wine, and non-alcoholic beverages. Their website has a menu.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-27", "description": "We went here for a friend's birthday and they were so accommodating for such a big party. \n\nThis place is pretty small and has limited parking, but I think it was worth it. \n\nWe tried the yakitori sampler, deep fried spicy tuna roll, and the pokimon salad. \n\nI like the yakitori sampler because it gave a great selection of skewers. There were so many on the menu that I had trouble picking. I like the beef tongue and the salmon with bacon the best. Order those if you want individual skewers. I would really waste my time with the vegetable skewers unless you are a vegetarian. \n\nThe pokimon salad is one of their most popular dishes, but I think it was okay. It was a little sour and not worth 6 dollars. It was made of raw salmon, seaweed, and other stuff. \n\nMy absolute fave though was the deep fried spicy tuna roll. I don't like raw anything so when I saw this, I jump at the chance. It was soooooo good! I can't even describe it. They put this orange sauce all over it and I could not stop eating. Best deep fried spicy tuna roll I've ever tried!\n\nYummy in my tummy! This place is really good, reasonable prices, and has great service!", "author": "Hang T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "Had a salmon, ikura, sweet shrimp, and maguro nigiri! All tasted fantastic! Japanese approved:P \nOh! Gyu-tan(cow tongue) yakitori is great, too! \nAlso, i liked friendly servers:)\nI'll be back soon:)", "author": "Mii L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-11", "description": "Well, This used to be one of our favorite Sushi/Japanese food delivered options. Apparently, they are under new ownership. Now, when you click on the menu bar on their website, it refers you to Eat24 HELL. That sucks. even more sucky is when you try to tell the guy on the phone what the problem is with their menu, he just doesn't understand. I asked him to send a printed menu with my order and he says they only have old out of date menus - no can do. Well, oops, if you can't provide a menu to customers who want to order food, that seems like a broken business model. I'm sad because this used to be one of our favorite places to order food. The guy who answers the phone can't speak clearly and doesn't understand you when you are talking, so you have to repeat everything at least twice.  And, no, I didn't vote for Trump...this guy just doesn't have the communication skills necessary to answer the phone and take orders, and sends us the wrong food. I think I just made my last order with this place...just too damn hard!", "author": "Wolfram A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "Never ever order food from this place! Ordered Teriyaki chicken and it had a looooong hair in it..for 12,5 dollars. Are you even serious?", "author": "Victoria N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Had a late evening delivery that took 60 minutes but arrived warm and fresh. Tried the fried tofu which wasn't bad, the spices really brought good flavors into it. The chicken teryaki was a little greasy but I suppose that's to be expected. Sodas are canned and a little pricy at $2. Gyoza was excellent and there was a sauce to accompany each dish. \n\nAll in all, a nice and seemingly reliable source of Chinese food with a good variety of available dishes.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "Just order this: Delivery \nChirashi Sushi $14\nGyu Hire Yaki $6.95 \nNatural Vegetarian Anniversary Roll $8\nButaniku Yaki $ 4.50 \nFree Edamame with purchase of $25 or more\n\nOK. you prob want to know about the food, and delivery huh?\n\nDELIVERY\nwas about 20 minutes earlier than Grub Hub predicted which was great.\n \nFOOD\nGyu Hire Yaki & Butaniku Yaki \nMy Yaki's were cold (*sad face) but SO flavourful w/slice of lemon. Pork Yaki has some nice stripes of flavourful fat with green onions. Steak was cooked to perfection, for me, nice and rare with a brilliant char. I would think that the Yaki chef knows what they are doing so all Yakis may be good.\n\nNatural Vegetarian Anniversary Roll\nThis roll tastes so fresh and so green. Asparagus, avo and tomato & cucumber. The freshness of it was what was impressive. \n\nChirashi Sushi\nSO many delicious thick pieces of chef special Sashimi. Very fresh and each fish tasted like the freshest of its variety. \nBonus at delivery Sushi Shoh....Cute driver", "author": "emma g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "Driving by yesterday in the neighborhood, saw this little place and the \"open\" sign, pulled over to get a sashimi combo to go.\n\nServer/waitress who greeted me, very nice. No other customers in the place. Stood there while two guys prepared my dinner; neither one of them could have bothered to look up and acknowledge me even though it's a tiny place and there were no other customers. \n\nNice lady sitting at the end of the counter thanked me when I was handed my order/bag and I paid my check for $25. Tipped $2 for service.\n\nDrank the miso soup and it was good. Ate the green dinner salad next and it was good. Started my sashimi off with the maguro. Immediately had to spit it back out into a napkin because it was RANCID. WTF?? I picked the remaining pieces of maguro up with my chopsticks and they STUNK. How in the HELL could TWO guys with no other customers in the house cut and pack up and sell me fish that was clearly TOO OLD and NOT REFRIGERATED PROPERLY?? I HAVE NEVER HAD AN EXPERIENCE LIKE THIS IN OVER FORTY YEARS OF EATING SUSHI/SASHIMI. EVER.\n\nI carefully picked through the rest of my sashimi and it was just the maguro that was bad. None of it was very flavorful but it was acceptable. Won't be going back, needless to say.", "author": "C. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "I ordered Togo and Really loved everything!!! I ordered chicken and beef skewers, the spice bazaar roll, California rolls, and the cucumber and avocado roll. Everything was delicious and I would definitely order from them again! I also like how we can customize or sushi to our liking. Love!", "author": "Thanh V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "Loved the yakatori here! everything is fresh and very tasty. I love local small restaurants where its obvious if you dine enough, they'll remember you and your family by name. \n\nWe ordered fresh hamachi, yakatori pork belly and tongue. The service was also very good and attentive. I loved being able to sit down and enjoy a good meal without feeling like we were rushed.", "author": "Serena L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "We ordered delivery. It was really awful. The teriyaki was in edible. How hard is it to mess that up? The potstickers were really mushy and had no flavor. The worst meal we have had in a long time.", "author": "J J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "Had the salmon nigri, the grilled lamb, california, and spider roll.\n\nIt was all fairly done well.  The grilled lamb was done pretty good at a medium.  very flavorful and juicy.\nThe salmon was fresh on the nigri, the california was good.\nThe crab in the sprider was lightly breaded and was a good portion.\n\nThe server was nice and the place was very modern looking, just a odd location to find parking.  Also free edamame beans peas was a plus.\n\nwill be back!", "author": "Steph Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "Really happy about my first order and delivery!\n\nPrice was a little on the steep side, but it was fresh.\n\nWill definitely order again for you.", "author": "Lee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "My husband and I are huge fans of this place. Both our eat in and delivery experiences have been great. We're lucky that is so close to our apartment. Great sushi and it's inexpensive compared to most places in the city! Highly recommend.", "author": "Annie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-27", "description": "The service is a 5, attentive, polite, & accommodating. \n\nThe food is just okay for me. I find the raw options for specialty rolls to be very limited. \nThe fish seems fresh enough, but doesn't strike me as superior. \n\nThe nice thing is that this spot is never packed, I haven't seen a wait on a week-end ever.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-01", "description": "Ordered delivery from GrubHub. Food arrived 45 minutes earlier than GH estimated. Mixed Tempura was great, Gyoza were perfect, Crunchy Spicy Tuna was good, Agedashi Tofu was terrible. They forgot to bring me the free Seaweed Salad that I was supposed to get for spending more than $25. I'll give them a second chance and update my review.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-06", "description": "So I picked this japanese restaurant because I wanted delivery at a decent price. I was stunned to see that my delivery fee was free when my order was over $20. In that regard I give this place a 5 star rating.\n\nAs far as the food goes, it was only so so for me. We order a teriyaki dinner which was more like a Chinese fried chicken with the skin on and the sauce on the side. It was good, but interesting. Along with the dinner we order three rolls; a yellow tail roll, a speciality roll, and some nigiri. I was surprised to see for the price that we paid how little the rolls were. But the on the other hand the quality was good. \n\nI would say that I will try this place again because they are close to where I live, but I think I will go into the restaurant next time to see if the quality and portion size of the food is different when you dine in.", "author": "Victoria Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "This little unassuming place was a total surprise regarding the quality of the meal. The portions were large and everything was very fresh and very tasty. We asked the waitress how long they have been open and she said five years. We live in the neighborhood and I  don't know why we have never stopped in there before but we are glad we did. It isn't fancy but the service was excellent and the food was really good. And one extra feature is that we ordered plum wine and they served us the largest glass of plum wine I think I've ever received. Altogether I highly recommend the place and we will definitely be going back.", "author": "Marsha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "This review is for their other menu items, not for the sushi. Hehe.. I know, what? Its a sushi restaurant?? Well, let me explain.\n\nSo this \"Japanese\" restaurant should definitely change their name (yes, it is a Chinese run restaurant not Japanese). On a sushi rating, its just ok, maybe a 5 out of 10. However, for their other dishes, I'd rate it a 9. Of course we ordered some sushi since you'd think they have great sushi since its in their name. Its good that we ordered a variety including sushi. I'll elaborate.\n\nFor starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. Not many places do gyutan so this is worth it if you are into that. We also got the ankimo appetizer, but it could be a bit fresher.\n\nOur main meal planned to be sushi so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. All were just ok, not mind blowing like I had hoped. After that tasting, we didn't expand to more of the menu.\n\nInstead, we had the dinner combos - tempura udon and a tonkatsu dinner. Now talk about a deal! The tempura was loaded with 2 shrimp and a myriad of veggies. This was like a double load at other restaurants. Plus, the tempura coating was perfect, not too heavy. Double thumbs up! My tonkatsu dinner was just as loaded. instead of just a single pork cutlet, there were 2! Definitely worth the price. From these 2 items alone, we would ultimately be back for more.\n\nParking can be a walk, but way easier than your Richmond/Sunset restaurant parking situation.\n\nTo wrap up, If you want some great Japanese food at reasonable prices, go to Sushi Shoh. For sushi however, you might want to pass.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "Surprised to see the latest negative reviews.  I ordered through Grubhub and the ordered arrived 30 mins earlier than estimated time.  Good presentation of sushi, very decent quantity of chicken teriyaki dish, and even the salad is pretty good.  Will order again soon:)", "author": "Annie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "I love Sushi Shoh!  I've been here a few times (sit down and delivery) and it's been great for both of those options.  It's a nice little spot to go out for a quiet dinner near Forrest Hill station.  If you like sweet and salty, I'd recommend the Nemo roll.  It's my favorite!  My boyfriend is also a big fan of the Sake Nigiri.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "Got it for delivery tonight, pretty good! \n\nGot the California roll with sliced lemon and sriracha on top (TRY IT) \n\nThe 49er roll, \nAnd the tuna and salmon.\n\nAlso a side of rice.\n\nAll in all, with a 2$ coupon from eat24, it was 19.55 $$$ \nNot to bad!! It was a lot of food.\n\nFood was pretty fresh, they gave a lot of soy sauce and two chopstick sets, white ginger (always a good sign).\n\nWould order again! Came in about 30 minutes!", "author": "Emily F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "I finally came by this restaurant earlier this week about wanting to check it out for some time.  I've driven by a few times before and notice how empty it is, and therefore there was some hesitation.  However, after visiting there I realize they probably do much of their business as take out or delivery.\n\nFor $22 they serve a pretty good 15-piece sashimi dinner combo with rice and miso soup.  Their sushi selection is fairly ordinary and they taste pretty fresh.  I also enjoyed the spicy hamachi roll I ordered, especially the sushi rice and the amount of vinegar taste coming from it.\n\nThe young lady who was servicing the tables was pretty attentive and smiling also once you settle into the table.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "Have ordered mostly non-sushi items a dozen times through GrubHub so this is my default when I want delivery. Can't judge the sushi yet (it takes me awhile before I trust a place for sushi and if you live in the city, you know WHY. It's difficult to find good sushi places unlike the peninsula.)\n\nBut for non-sushi, this place rocks.  \n\nPortions were generous and the skewers were creative.\n\nRecommend: Sauteed Seafood Udon, Salmon Dinner", "author": "Yohdaddy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-10", "description": "To-go is a big NO-NO.\n\nThis place has been my default sushi place because I get off from work and pass through Forest HIll Station on a daily basis. The dining experience has always been mediocre and occasionally enjoyable. This was my first time ordering through the Eat 24 process. I picked up the food and brought it back to share with my family. The to-go quality is below average. All the rolls tasted \"off\". The fish wasn't fresh and the meat was soggy. My whole family felt ill after the initial bites and we had to throw it away.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-27", "description": "10.26.10\n\nIt's NBA season.  Two big whammy games were on (Heat/Celtics, Rockets/Lakers).  But I made dinner plans a week ago.  And can't cancel.\n\nSushi Shoh to the rescue.  Their TV was off, but she turned it on to the game just for me.  BONUS POINTS!\n\nYou get a free butaniku yaki [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=tDGKgGeWYSwKfCTanrPiiA] when you buy two draft beers or sake.  What better way to watch a game than with cold draft Sapporo?  SIgn me up.  The pork was juicy, tender and fatty.  The scallion was a nice balance.\n\nSince they're known for their yakitoris, we had to order another one.  My friend wasn't adventurous enough to try the beef tongue, so we had the gyu hire yaki [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=Fm-L-phSmNlBwPunX_WZyw] instead.  It was peppery, and a bit too salty for my taste.  I like a filet mignon on a plate, not on a stick.  Next time, beef tongue!\n\nOnto the rolls.  We had the Flaming Torch [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=VmW6cirUWvSf5ofDYFMOug] and the Ha-ma Ha-ma [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=90t7_d9PTdFnqXbwOWGkCw].  I highly recommend the latter.  Baked hamachi.  Yum.  Sliced jalapeno on top.  Double yum.\n\nTotal damage: less than $50.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-31", "description": "I have give them 5 star for sushi shoh.  I been here twice for dinner with friends. We all love it here. \n\n1)The food was good & fresh. That most important thing for sushi place.\n2)The service is good.\n3)Sushi Shoh is clean, good for groups, and the most the have the T.V.  on for the games. \n\nAnd there grill food was the best.  I have to give them 5 star for it. \nkeep up the good work.", "author": "mike l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-22", "description": "Food was okay. Nothing really special about the sushi or yaki tori. My main deal was about the place. I understand you can't blast the heater because it's a sushi place but this place was so cold inside that I could not even enjoy my food. I had to hold onto my hot tea the whole time due to constant shaking because it was so cold.\n\nUnless it's the summer time, I would not recommend this place. It was very uncomfortable to sit here and eat. Even the servers looked like they were freezing.", "author": "Diane Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Very good! Inexpensive and they had good miso soup, veggie nigiri and otherwise fresh. Didn't have to wait long for the food and they have preferable green tea. Nice little Forest Hill neighborhood hangout. Would definitely recommend.", "author": "Katie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "I love their salmon teriyaki dinner. It's grilled until the skin is crispy and the meat is still juicy. The salmon also tastes lightly charred and has nice grill marks.  The steamed veggies are never over cooked and it comes with rice and salad.  Their ginger soy sald dressing is homemade and is so delicious.", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-18", "description": "First I'd like to start with the condensation trays that were brought to my door.  Food was on frio! Keep in mind that you probably will have to preheat your oven and be prepared to accept a meal that feels like it came out of the refrigerator.. I must say their salad dressing was some of the best I've had... tempura was on point even though it rakes a complete idiot to fuck that up... chicken katsu- never again! I found the lump of rice more pleasant than the chicken itself... So if you want to spend $30 on mediocre, cold, wet, condensation these are your go to guys", "author": "Mannie's O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "After driving by this place for the bajillionth time, we have finally tried Sushi Shoh. It's a small restaurant hidden nearby the Forest Hill Station and is truly a gem in the neighborhood. \n\nI was pleased to find that they had tapa style dishes in addition to the \"usual\" Japanese things (e.g. rolls, teriyaki stuff, etc...). From the tapas section, we ordered:\n\n1. Agedashi Tofu - Very smooth tofu that was fried the right amount. Don't let it sit in the sauce too long or it gets a bit soggy.\n\n2. Gyu Kire Yaki - My favorite item of the item -- angus beef skewers. The meat is not tough and cooked just enough that you can tear the beef off with ease. I wish there were more than two pieces.\n\n3. Hamachi Kama - Delicious roasted yellow tail fish. I didn't use the lemon or sauce they provided. Didn't feel it was necessary. The meat next to the bone and fins are the best parts, of course. \n\nIn addition to these tapa items, we had the following:\n\n1. Chicken Teriyaki - This is a pretty great item to have in a meal by itself. The chicken skin is crispy but not burnt. The meat is juicy and the sauce is a great complement. It also comes with salad, rice, and miso soup.\n\n2. Caterpillar Roll - Tasty but pretty typical compared to other Japanese venues.\n\n3. Sashimi Omakase (for four people) - Very fresh fish! I enjoyed the salmon and tuna the most. \n\nService is great. Waitress smiles and provides a friendly atmosphere for her guest.  \n\nOverall, I'm very happy with this place. The food presentation is fantastic. I'd prefer sticking with their tapa dishes over their entrees. A very different experience for people who eat \"American Japanese\" cuisine. 4 stars.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-03", "description": "Good! Not flashy enough that you'd take a date to impress him or her, or push your palate into new territory; it's more in the realm of the trustworthy utility place around the corner that you end up visiting a dozen times a year. The sushi itself is tasty and nicely presented, and the service is friendly although a little on the compulsive side. That's not a bad thing - the wait-staff was young, so it's possible that one of them was in training, and bottom line: we were well-cared for. \n\nPrices are reasonable, and they have a nice selection of Yakitori - we added some grilled asparagus to our rolls, and it was tasty. Recommended.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-13", "description": "Fruit flies buzzing around, having a good time completely unmolested. No hello. No goodbye. Mediocre fish-- not good, not bad. I dropped $60 and tipped 20%, and given the experience, I won't be back.", "author": "A B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-02", "description": "We had the omakase sushi and the only fish that was fresh was the salmon.  All the other fish was a bit mushy/watery and you can tell it's frozen fish that was defrosted.  \n\nThe only other thing that was decent was the tuna poki.\n\nThe hamachi kama tasted ok but the outside was burnt black and they left the label on the lemon that came with it.  I know, it doesn't affect the food, but then come on now, take the second to take the sticker off the lemon.  The rolls were not good.  The spicy scallop was not even a tad spicy.  The yakitori was nothing special.\n\nThe service was decent but the food was definitely below par.", "author": "Irene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "My new favorite delivery Sushi place in West Portal area. On a lazy Friday night I was searching for a new sushi delivery place around 94127 zip code.\n\n Was quite surprised that there are not that many options. Thanks to yelp reviews i have found Shoh. \nExcellent choice! The delivery man arrived within 45 min as advertised. The chefs specials were very good. \n\nDefinitely will be ordering from this guys on a regular basis from now on. \nThe only downside was the hostess who answered the phone had a very thick and hard to understand accent. But on the brite side their website was easy to navigate and I was able to order without any problems whatsoever.", "author": "Xela H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-13", "description": "A couple of months ago, I would've happily given Sushi Shoh 4 stars.  I still remember the excitement or opening that big paper bag, and pulling out 21 fresh, generously portioned pieces of sashimi.  And for just $28!  The rolls were strong too.  I mean, nothing life changing, but a quality place I pictured myself ordering from all the time.\n\nHow times have changed.  The pieces of sashimi are now significantly smaller than average, the rolls are puny and falling apart.  I wish I took a picture of the seaweed salad they sent us.  Embarrassing, really.  I'm not sure whether all of this is a consequence of our ordering fairly frequently over a short period of time and the restaurant taking us for granted, or a more general decline.  Either way, I'm shoh done.\n\nAlso, the yakitori is kind of gross.", "author": "Craig M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-02", "description": "I placed my order at 8:35pm and the website said it will be delivered approximately 9:30pm. I also received an email saying that if I have any questions, then call this number listed(which is the restaurant's number) and a confirmation email will be sent out in a few minutes(which I never received). \n\n9:35pm: I called to check up on the status of my order. The girl over the phone said it would take another 30 minutes. I said okay, that's fine. \n\n10:19pm: I called again to check up on the status again. I asked for a refund, and she said I would have to call the number listed on the website. I told her that I did and it directed me to here. I read her the number out loud and she said she will call her manager to talk about refunding me the money..I asked her if she had my number and she said she does have it.\n\n10:29pm: I called to ask for the manager directly. The girl over the phone stated that the manager is in Hong Kong. She asked what am I calling for. I reminded her about my order and she said she left a message for her manager. I said \"But she's in Hong Kong, so she won't be able to see it until tomorrow then, right?\" she said, \"Yes that's right.\" Knowing that I won't get my refund back, I just simply asked her what can we both do to resolve this problem then, since it's been 2 hours already. She said she will have someone make it right away. I said \"okay, that's all I wanted.\"\n\nThe food finally arrived at 10:56pm. The food were poorly put together, mushed together, and the tempura was not a tempura but it was just a flat fried batter. Overall, I was really disappointed not only in the service, but the food as well. I was really hungry, I paid my tip before they even delivered--expecting they would deliver it on time...but they didn't.  I would NEVER eat here again. For those going to try this place out, I wouldn't recommend this place.", "author": "Lilly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-20", "description": "This is NOT a place for sushi. This is a place for yakatori. The sushi is pretty terrible from the taste/texture of the rice to the quality of the fish. The hamachi tasted of nothing but iron-y protein. Edamame was even overcooked & mealy.\n\nI was ready to walk but the genius server asked if we'd like some free grilled pork? Oh Yes. I never turn down pork. But then I started to worry that it was off or something because it was free. \n\nThen it came and it was delicious. Then I took a close look at the menu and there is a good list of yakatori-they even made us chicken skin. The beef tongue was fantastic. Whole grilled squid was excellent too. The yakatori menu items were almost all perfectly grilled but the chicken skin. Not crispy enough. \n\nDont bother with sushi-let the yakatori chef in back take care of you.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-18", "description": "Came here some time ago, but just getting a chance now to write the review.\n\nExtremely slow in getting my plate of a few slices of sashimi! We came here during off hours and there was practically no one here. The cuts of the fish were pretty stingy for the price. Sashimi for two is what I think they call it. Seriously? I was still hungry after my sashimi slices, so I ordered amaebi nigiri, saba nigiri and one salmon skin hand roll. Those took forever to arrive too! The quality was okay, but I've had worse elsewhere. Nice decorative interior though.\n\nI probably won't be going back there again. I would recommend it to people who have a lot of time and want to come here with friends to drink a lot of sake and chillax while they wait for their food to arrive.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "My friend and I finally found time in our busy schedules to have dinner and catch up so we yelped a few places and decided to try out Sushi Shoh. We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. The deep fried spicy tuna roll was fairly scrumptious. The star of the show was the Giants roll with the butterfish and tobiko... It was delicious! The service was decent and it helped that we had free pork skewers with our order of Sapporo. Overall the food was three stars, but the service and free skewers boosted it to four stars. It may not be a home run, but the restaurant is definitely a must try at least once. It also helped the fact that it was open later than other sushi restaurants.", "author": "Rosanna N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I never write reviews but I definitely use Yelp for every restaurant I go to so here's to paying it back! New to the neighborhood and I have to say- this place is great. The sushi is solid, they have both the classic rolls and some great variety on specialty rolls (Flaming Torch and Nemo rolls being 2 cult favorites from this spicy tuna loving household) and the veggie tempura and pot stickers are always cooked to perfection. We've done both sit down and delivery. Enjoy this neighborhood gem!", "author": "Alexa J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-04", "description": "Sad to have to edit my review.\n\nI ordered this place probably around once a week give or take and would sometimes go in.  i've seen a decrease in quality of their food.  \nOrdered delivery from them tonight and when i opened my sushi container, it smelled very foul as if the fish had gone bad.  It was the 49er roll and the salmon was definitely not fresh let alone edible.  Ate one  bite and already regret it.  Sucks to throw away an $11 roll when I'm still hungry.....\n\nUnfortunately it looks like this will be the last time i order from Sushi Shoh.", "author": "Chantel B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-06", "description": "Wished I had found my sushi place since they have soy wrap. But, no. Ordered delivery and waited almost an hour and a half. Rolls were so loosely rolled I may as well have used a spoon to scope it up like a bowl of rice with vegis. I mean, falling apart! The egg plant was undercooked, which is never a good flavor. Sad since it is rare to find a Sunset/Parkside sushi place around Taraval with soy paper.", "author": "Jeremy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "I love this place! Lots of fresh vegetarian rolls!!", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-27", "description": "BEST CHICKEN TERIYAKI EVER!!! (dine in better than takeout)\n\nI've been coming to this place for months. I ordered the chicken teriyaki as take out and it was delicious, but when I dined in this evening boy was I in for a treat. \n\nThe chicken had this crispness to it and the sesame seeds and teriyaki sauce was a perfect blend. \n\nAlso had some gyoza which was tasty and my entree came with a delicious salad that was enough to share for 2 and miso soup, yum!\n\nFor sushi we had the Spice Bazar and Spicy Tuna, also delicious and highly recommended. \n\nSUSHI SHOH FO SHO!!!", "author": "Dip G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-09", "description": "I've had several deliveries from this restaurant. I've gotten food poisoning every single time.\n\nThe first few times I thought it just may have been something else I ate that day because the food was so delicious, but after about 3 times ordering from here, I realized it couldn't be coincidental anymore-- particularly because this time my sake nigiri had a silvery worm underneath it. I first thought it was daikon but no, it was moving. I know it sounds gross and I should've asked for a refund but I do understand mistakes happen, especially when the establishment has only been around for a little while. Maybe they're still working things out.\n\nI don't know how to feel anymore. It sucks when something tastes really good, but makes you sick :(\n\nI probably won't be ordering from here for a while.", "author": "Lin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "Easy to get into on a Saturday night, and the sushi roll we ordered was quite good! We were pretty disappointed in the yakitori, which seemed to be their specialty. We'll be back, but next time we'll focus on the sushi.", "author": "Shannon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "The fact that they deliver makes my life that much better. Love the teriyaki salmon and the specialty rolls. Awesome miso. Awesome rice. We order delivery from here like once a week because we just get cravings for it!", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-25", "description": "We have been passing by this sushi spot for about a year and have always wanted to give it a try. Well, we did and we were not disappointed. They have a great selection of Japanese tapas as well as sushi rolls. The service was impecable and the price points cannot be beaten. The fish was extremely fresh and the food came out very quickly!! We have definitely found our new neighborhood sushi spot!!", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "Great value- they give you more salmon than any other place I've been in years; and I should know... Ive ordered Japanese takeout from at least 30 restaurants in SF and Marin County for my job in the Japanese TV Production Industry.", "author": "Ryan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "I ordered delivery from here.\n\nI am generally extremely wary of ordering sushi delivery - seems like a recipe for disaster, but I read the yelp reviews and took the plunge.\n\nI got the chef's choice sashimi, halibut collar, and beef skewers. the skewers were meh/whatever, but the halibut collar was good and the sashimi was very good quality for a delivery joint - somewhere between whole foods and koo.\n\nI would def order delivery from this place again - it was also super fast (took half an hour for them to get to my house in the lower haight on a Friday night).", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-09", "description": "I live nearby and so have tried this place many times.  Sushi is not good.  Teriyaki is not so good - the sauce is an odd color.  Yakitori is OK and is the best choice.  \nI really wanted to like this place but can't.", "author": "Deann F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Preface: I am not damning with faint praise! This is much better than you might think.\n\nIf I am taking the MUNI and getting off at Forest Hill/Laguna Honda, I am always tempted to stop in.\n\nIt's not remarkable. But anyone with high standards for sushi likely would pass this by.\n\nAnd that's too bad. It's better than serviceable. Very good fish. Other items also high quality. Friendly service. Casual.\n\nThey also have various deals with freebies, usually if you buy beer. They throw in a skewer. That sort of thing.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "The service and food was very good. The seating was not fancy and it was cold inside.", "author": "Dustin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-04", "description": "This is added to my favorite sushi spot. Quaint, friendly,clean,attentive and delicious.  Came in on a Sunday around 8. Not busy at all. I can't wait to come back and I'm still sitting here eating lol.", "author": "m l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-14", "description": "My bestie took me here for dinner on my bday, and I must say I was impressed.  Considering we are living so close to the water, I will say that I have become a bit discouraged by the lack of amazing hole in the wall sushi places.   This place (andy Ryoko's) has changed my mind a bit.   \n\nWe had the Dinner Special Sashimi plate and the Dinner Special Beef Teriayki.  When we ordered the Beef Terriyaki, the waitress asked us how we wanted our meat (I always order my meat rare), which caught me off guard.  Besides habachi style, I've never been asked that at a Japanese restaurant.  The Beef came with a miso soup and a really large side salad (enough for us to split), that was green and leafy with that amazing ginger dressing (not the white mayonaisey places try to serve you in a miso soup dish).  The sashimi plate came with soup, but the highlight was definitely the fish.  It was soooo fresh and amazing and they even had super white tuna (my favorite).  The beef came out with broccoli and rice and everything was awesome.  For just around $50 bucks we left full and satisfied.\n\nThey also deliver, which is something I'm definitely looking forward to taking advantage of!  :)", "author": "Brandy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-02", "description": "Got delivery from eat24. Had to order $20 worth, the only thing worth eating was the miso soup. Got the pork katsu dinner special, huge portion. came with buncha rice and broccoli and carrots. The pork itself was terrible. Too much batter, dry meat, not any real flavour. Also got a salmon nigiri, bad farmed salmon, pretty warm which is pretty icky for sushi. And a salmon and avocado roll, super mediocre. I had a bite of everything and threw most of it out. The salad that comes with the dinner special might be ok too, I got bored of eating totally subpar food so that's in the fridge. meh.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Took the time to read my Gluten Free Card (in Chinese) and washed the knife and cutting board and wife the knife with paper towels during the cutting of my nigiri orders to avoid any chance of contamination from the wheat in soy sauce or other source.\n\nNot too crowded yet, so got to enjoy the funky decor (check out the hanging art) and friendly staff.\n\nThe nigiri I ordered was quite good and the others I was with enjoyed their rolls.", "author": "Bo D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "I ordered from Eat 24 with a coupon code. I ordered a sashimi plate, rock-n-roll, tebasaki, and got a free seaweed salad. I had scheduled the delivery for 6PM, and they arrived right on time! I was impressed, since I wasn't sure what to expect after reading some of the reviews about their delivery. \nThe presentation was also better than expected, and the food was not bad. The chicken wasn't hot anymore, but I always expect that from delivery. Sashimi was good, and the Rock-N-Roll was just okay (I had to get something with unagi!). The seaweed salad wasn't a huge portion, but it was free so I don't mind. \nWould order again.", "author": "Florence A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-26", "description": "What happened tonight? We've ordered from here many times and tonight's order was the worst. Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. What the hell happened?!?! We spent a lot of money on this order and now we fear for our health! Our last and final order! Sayonara Sushi Shoh!", "author": "Denny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-19", "description": "I had some craving for cooked sushi on MLK Day. Not many places were opened on that day.  So I dragged my husband out for dinner.\n\nThe parking was okay for us that nite, but it was a little difficult to figure out how to cross the street without getting hit by cars going 40mph instead of the usual 25 mph.  But we eventually got across safety.\n\nOn the outside, the place looks small, and can hardly see their sign cuz no light, but it was the only place open at that street.  When we walked in, we got to pick our own seats away from the cold door. The decor was very nice, and chairs were comfortable. \n\nI'm not sure about how fresh the fresh sushi was cuz we didn't have any.  I was only craving for some cooked dishes.\n\nWe were debating between the Salmon or the Chicken Teriyaki, but we ended having the Chicken teriyaki ( the sauce wasn't thick and gooey but perfect), Lion king sushi (it was a tad small, but about 9 pieces of them) The salmon was cooked all the through, Vegetarian Evergreen roll (it didn't sound pleasing with eggplant and zucchini in the same dish, but that was the best), and also the Hamachi Kama (perfectly cooked, very juicy).  \n\nWe were filled up. cuz the teriyaki had a bowl of rice (unlimited refills! and a large plate of mixed greens for salad)  \n\nAt the end of our meal,  what thought that was weird, since we normally have mochi ice-cream or ice-cream at the end of our Sushi dinners. The server gave us half an orange sliced up.  So we ended up having the orange than having an ice-cream dessert.  Overall, the food was good, filling, and the total price is not bad.  \n\nWe will be coming back here again on my next sushi cravings", "author": "Kathleen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-20", "description": "Was staying at a friend's place in the area and wanted some delivery. Wouldn't usually go for delivery sushi but the reviews seemed good enough. Ordered the shrimp tempura roll, spicy tuna roll, and rainbow roll, and got a free order of edamame. Took about 45-50 min for the delivery to arrive. Everything was decent, nothing offensively bad but nothing mindblowing. About what you'd expect for delivery sushi at this price", "author": "Lucas V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "The sashimi was just average.  The Dragon roll was good, but not special.  We also tried a couple yakitori items.  The bacon wrapped scallops you can't go wrong with.  The bacon was a little soft and the scallops were not great,  but there were 6 for 7.50 so good enough.  Now the great.  The shiitake mushrooms were really good.  Cheap,  but not at all what I expected,  and better than I would have imagined!  The butaniku yakitori was listed simplyas grilled pork and scallions on a skewer, but the tender,  crispy,  salty,  lemony slices of amazingly prefect pork belly were one of the best things I have ever eaten!  Maybe not on par with French laundry Oyster and pearls orthe crispy pork shank at Smith and wollensky in Chicago,  but it will be seated memory as a destination deliciousness.", "author": "Damian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "yakitori is so good. \n\ndisclaimer: I LOVE beef tongue!\n\nfree pork skewer if u order two drinks..\n\nsushi is always good. and so is service. :)", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "Highly recommended, beef teriyaki, medium rare ribeye, yummy!  \nMiso soup is okay, amazing salad dressing!", "author": "Sydney L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-24", "description": "One of my most enjoyable Japanese restaurant dining experience in San Francisco.  I especially love that this is a neighborhood restaurant. I feel as if I'm supporting the local community!\n\n- Loved their sashimi - the freshest ones I've had!\n\n- Owner Kathleen was welcoming, warm, friendly.\n\n- Restaurant was thoughtfully decorated, clean and well-kept.\n  Check out the gorgeous restroom! \n\n\nSummary:\nOn a scale of 1 (lowest score) to 5 (highest):\n\nFood = 5  (Sushi always fresh; generous cut. Love the rolls!)\n\nService = 4\n\nAmbiance/Decor = 5", "author": "Keira C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "Reliably good and affordable sushi.  Their salmon and avocado roll in particular is one of my favorites.  Their seaweed salad is also quite good.  My husband and I get take out from Sushi Shoh at least once or twice a month, and it's always delicious.  We ate in the restaurant once, which was a bit odd -- slow service.  But, their take-out is always on time (whether it's pick up or delivery) and very fresh.  I think it's the best sushi in the West Portal area.", "author": "Kate K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "This is the first time I've had sashimi that taste like high quality fish!  I've ordered food from them via GrubHub a few times now and I am amazed with the quality of sushi and sashimi delivered to my home.  I always ordered the \"Sashimi Omakase for Four\" and two orders of sushi rice (just for me).  Their sushi rolls are also amazing and fresh.  Best in San Francisco!!!", "author": "Jack M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-02", "description": "Do not ever buy this s*** again. The sushis are pricey, they look like they have been made a week ago, the yakitori are cold (I ordered deliver food). My first time with them was disappointing, yesterday was definitely my last.", "author": "Thomas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "Oh yeah!  Definitely a sweet spot to hit with friends; the Yakitori menu is the best in the area and they have a Salmon Kama (not regularly...) that'll rock your taste buds!  \nPricing is fantastic and service is fabulous!  They've only been out there for approximately 6 months and by 7:30 PM on a Saturday the place was packed to the brim.  The only reason (at this point) I don't give them a full five is they're still coming up to speed and don't have a full sushi menu that other sushi bars have....but what they do have absolutely rocks and I would recommend this as a great local spot for all in the area!  Don't tell too many people, we wouldn't want to wait too long once this place gains a local crew.\nSushi is excellent, the Yakitori is out of this world and the service can't be beat.  Let's hope the quality and the expanding menu continues!\n\nBottomline:  Definitely a great spot to decompress or grab and go\n\nT", "author": "Toneman's S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-27", "description": "We used to order there and that wasn't bad at all until we received some literally frozen sashimis.\nPretty disappointed, this is the last time we'll order food from them.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-05", "description": "After receiving their menu hanging on my door I order some of their food. I got diarrhea for my reward.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "Yay! I like it! I've been waiting for the restaurant to open and then was thinking, \"oh no, what if I don't like it? What if I'm totally disappointed?\" We were a bit bummed when the restaurant that was previously at that location was closing but were looking forward to Sushi Shou opening. Thank goodness not only do I like Sushi Shou, it's even better than I expected! \n\nWe ordered a good amount of food. I just tried some of their basic sushi, which was great. Their special rolls that other customers got looked really good. The miso shuru was tasty. I rarely like the salad from Japanese restaurants, but this one was delicious and I ate the whole thing. It wasn't drowning in the dressing. The tomatoes were ripe and tasty. The dressing was light and gingery. Yum. \n\nI have to say that the beef teriyaki was my favorite of the night. It was nicely grilled. Although there was teriyaki sauce all over the plate, you could actually taste the beef and it was good. \n\nThe tonkatsu (had to try a bite... or two...) was just as good. It was nice and crispy and didn't seem greasy at all. The entrees come with salad, miso soup, and sauteed veggies, and of course rice. The veggies were a little buttery for my taste, but not really all that buttery - it was pretty light. (I just don't like butter w/ my veggies at all.) They were well cooked (al dente... not overcooked at all). \n\nWe also had edamame and agedashi tofu. Both were very good. To top it off, we had fried bananas with coconut ice cream. YUM. There was a light honey coating over the bananas. A nice sliced strawberry with the ice cream. YUM. YUM. YUM. \n\nAND not only was the food good, the service was great. The service was timely and the server was super nice to my family. She made a kid's hashi for my son to use and had lots of smiles. We're definitely eating there again.\n\nIt's in a bit of an odd location, but right near the Forest Hill muni station. There's a small parking lot to the side, right next to Chou Chou and some street parking.  It's a small restaurant, but nice and comfortable. They have high chairs, but no changing tables. Aside from that, although it isn't a restaurant designed for kids, they are kid frendly in the sense that they are accomodating and the service is very friendly.", "author": "lynn t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-01", "description": "Love love love to come here.  This is such a great neighborhood restaurant!\n\nThe service is great, and the waitress is always so kind!  Don't expect your food to come out like a fast food service, that isn't what this place is about.  It is a great place to take a friend, have drinks and edamame, and hang out.  Very casual.  \n\nThey have very fresh sashimi and interesting rolls.  Their tempura is perfectly battered and portions are good.  Also, all their food comes out so well presented.  Prices are reasonable and comparable to most casual sushi restaurants.  \n\nThis place seems to take a lot of pride if their food and I applaud that!", "author": "Danika W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "I ordered delivery from this place for the first time tonight.  So my review is based on ONE experience.  But the experience was great!\n\nHere's what we got:\n\nGyu Hire Yaki - chunks of grilled peppered steak on a stick.  It was delicious, but I probably won't get it again because it's a LOT of meat on two skewers and I wasn't very hungry for anything else afterwards.\n\nAvocado roll - I don't eat raw fish so I only order veggie sushi.  These rolls were pretty good and the nori was not too chewy, so, thumbs up.\n\nTeriyaki salmon entree - Miso soup, check.  Salad with yummy ginger dressing, check.  Rice and lightly steamed veggies, check.  The salmon was AMAZING.  Two huge fillets, grilled to perfection (for me--I like my fish pretty well cooked) with crispy edges and sesame seeds.  The teriyaki sauce was on the side in a cup, which prevented the fish from getting soggy.  Brilliant.\n\nIt was a busy Friday night according to the delivery guy, but we got our food in 35 minutes and everything was fresh and the hot things were still hot.  I will definitely be ordering from Sushi Shoh again!", "author": "Lorelei S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-25", "description": "Yes Yes Yes! \n\nJust moved to this hood and was delighted to find this spot. The fish was high quality and the prices reasonable. Also had a a beef kebab which was perfectly cooked and seasoned. \n\nQuaint, tastefully decorated, and very friendly service; everything you want in your neighborhood place.  \n\nThe chef even sent over a complimentary garlic pork kebab that was really great.\n\nThe cherry on top: They deliver! \n\nI will most certainly be back.", "author": "Dustin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "Very nice place. The place has a comfortable decor and the service was friendly and responsive. There's a lot of things on the menu I would try next time, but we had the tonkatsu, rolls, and were going to order the poki. But the chef gave us a complimentary one presented attractively in a martini glass.\nI will be sure to upgrade my review the more I visit the place. So far, I am a fan and happy that it's within walking distance.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-16", "description": "I've never set foot in Sushi Shoh but can say something about their delivery.\n\nWe've ordered a couple times from S.S. and can say that their tempura, unagi-don and bentos are pretty darn good. Add free delivery (for, I think $20 or more) and I'm all about this place.", "author": "Deann M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "I'd been anxiously awaiting the arrival of a new sushi place in my neck of the woods and this was it.\n\nThe food was good, but not awesome. \n\nI will be back for sure, because the service was great and the pricing was reasonable.\n\nI saw a lot of fakesushi on the menu which kinda bugged me, but whatever, its California and we eat lots of fake stuff :)", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-13", "description": "Always great! I order from here at least once a week. They are always on time or early for delivery. Their food is always hot, tasty and quality ingredients. I love this place.", "author": "Sara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Having seen the crazy turnover  of restaurants that struggled in the same spot over the years, it's a little dubious how sushi shoh will do.  It wasn't until they started passing out advertisement in our neighborhood, when we decided to give a try because of its \"free delivery\".\n\nThe nice surprise is that you can order online. Anytime I don't have to \ndeal with a live human being, I am in bliss.  It seemed really easy: just add items to the cart, enter your credit card number, and supposedly food will arrive in 45 minutes.\n\nThe downside is that sometimes not all items on menu are available. They called us right after we placed the order and made some suggestions of substitute because they didn't have black cod or fluke nigiri.  D'oh! Still had to talk to a real person!\n\nAnd it took almost an hour for our food to come, which got us really hungry and antsy.\n\nFood was good.  We had hamachi, hotate and snow crab nigiri.  Rock n roll was delicious. Salmon skin roll and tuna roll were decent.\n\nThe highlight was the grilled hamachi collar. A generous portion, grilled perfectly. Juicy, tender, flavorful, and fresh. I would get it again.", "author": "Candice B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "So hard to find to find good Yakitori restaurants in the bay area, and this is one of them.  The service was great: fast, and attentive.  The waitress was very knowledgeable about the menu, and offered some delicious suggestions.  Order two beers and get a free yakitori plate on the house!  The rolls and sashimi were just average quality, but it is mainly known for their yakitori!", "author": "Edward N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-07", "description": "Go-To place for Japanese delivery!\n\n4 stars because delivery takes FOREVER but the food is worth it!\n\nDefinitely go for their special rolls. Particularly the Firebomb roll and Spice Bazaar Roll.  The fish is fresh, the sushi doesn't taste gross like some delivery does.\n\nCooked foods - Was really surprised at how they use free range chicken and high quality salmon and beef as well. For the cost, you are getting quality, great taste, freshness and a portion that two people could easily split. Tempura was also great and it is always delivered hot! Which is impressive. No soggy tempura for us!\n\nDefinitely worth a try. I haven't been to the actual restaurant but if you're too lazy to leave the house and have a hankering for japanese food - go for Sushi Shoh!", "author": "Liz S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-01", "description": "So I was in a huge rush for a meeting and this was the closest sushi place to my friends house. I ordered Togo and said please hurry up which they requested the chef to do. I was very disappointed, the California roll had hard rice, all my nigiri had wasabi holding the rice and fish together, I hate wasabi!! Yuck. The raw fishes tasted just ok not too fresh. I wasn't impressed.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "So it was parents of an only child night with our daughter off at a party, and that means Sushi night for the Z man and parents. I've been tracking Sushi Shou's reviews and generally positive responses and close proximity to Chez Moi make a trial at is place a must. \nSo rule one of a sushi bar is just that. Sushi is to be eaten at the bar allowing for interaction with the sushi chef and observation of the product for easy scrutiny. There are 5 slightly uncomfortable high seats at the bar, all vacant when we arrived so we saddled up. One chair was backless Nd mismatched, which would normally be a negative, but it also spun around, allowing for great mid course fun by the Z-man. \n\nSo we tried to say hello to the sushi chef and his assistant. Well unfortunately Mr. Grumpalicious wanted nothing of conversation or ordering from him directly. (immediate minus one star). His Asst. Was nice nice enough, but powerless under his fearless leader to bring any sushi joy our way. \n\nThe gals waiting tables took our order, brought us Asahi on draft in mismatched but chilled glasses and generally were very nice and provided very good service. \n\nWe had gomae, agidashitofu, a couple of rolls and gyoza for the z-man, albacore, spicy tuna roll.  I know all pretty pedestrian stuff, but that was really what this place offers. They comped us a couple of pork belly yakitori skewers since it \"came with the beer special\". which were fine if slightly under seasoned. \n\nEverything was ..... Fine.  Ok leaning toward Meh\n\nWould I come back.   I would be pretty hard pressed. \n\nIf it wasn't for the close locale and the friendly service, probably would have given fewer stars.", "author": "Aaron N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "I really hate it when my girlfriends are on a diet.  Not the same diet, unfortunately, but different diets with unique twists and turns that obliterate common sense.  I especially hate it when my girlfriends are on a diet and I'm on a fat.  Yes.  A fat.  Sometimes, I just eat too healthy and work out too efficiently.  Rippling abs and sculpted toosh are just part and parcel of this fine specimen.  Hench, I like to indulge in a little fried tempura every now and again.  \n\nAlright, I tend to like a little tempura with sashimi.  It's because these are two things that I generally cannot do at home.  I do not posses the skill necessary to slice sashimi.  Instead, my knife work rivals that of Jack the Ripper.  Or a bald eagle.  And I do not posses a fry-a-lator (and please stop offering to buy me one for your birthday).  \n\nOn a sunday night that was neither too cold nor warm, I met up with Val at this place.  And since one of us was on a diet, the other one felt bad about ordering tempura.  Instead I got the seafood sunomono salad and the chirashi dinner entree.  Val got the rainbow roll, miso soup and edamame.  \n\nSeafood sunomono - tart, delicious, correct cucumber usage.  This salad should be made with persian cucumbers or english cucumbers, not the fat, bloated american things that have tough, waxy peels and warts.  The seafood presented was plentiful, wide in variety and tender in texture.  It was $5.\n\nChirashi dinner - came with soup.  It had lots of fish.  I've started this stupid habit of eating before I go out for food.  I will eat an orange, a pear, a bell pepper.  And a liter of water.  Which means that when I arrived for dinner, I was not exactly hungry anymore.  The chirashi was no YuZen.  But the serving was large.  The fish was wide in variety.  There was a lot of tamago.  And the fish was sliced rather thick.  Sashimi style.  I brought it home for dinner the next day.  It was $14.  \n\nThe place did a lot more business in delivery, with many black-clad men scurrying in and out with plastic bags.  They had a plentiful yakitori menu but I was too unhungry to try it.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "We've passed by Sushi Shoh a number of times now since it opened a few months ago and I've been curious to try it.  It was fairly empty when we got there, which was a little alarming, but it's probably because it just opened, it was a Sunday night, and in grand San Francisco tradition, it was DAMN cold.\n\nAfter perusing through the large selection of tapas, sushi, entrees and rolls, we decided on the hama hama roll (baked hamachi with gobo and spicy mayo), a spicy tuna roll, and the lobster flower.  \n\nWe were quite pleased with our selections.  They were each fresh,  flavorful, and pleasing to the palate.  The hama hama was perfectly crunchy and spicy, and the lobster flower had a nice balance of tuna and lobster such that neither flavor was overpowering.  I love a good spicy tuna, and Sushi Shoh did not disappoint. We were also pleasantly surprised by the free miso soup and edimame that we received before our meal - I didn't realize sushi restaurants still did this.\n\nWe ordered the fried banana and ice cream for dessert and loved it!  A word of caution: they use wasabi to stick the ice cream dish to the plate, so don't pull a Julie and curiously try some on a spoon.  That was not the best way to start dessert.  \n\nTakeaway: DO go expecting decent sushi at decent prices with great service.  Don't go expecting a wonderful ambiance and fine decor.  Sushi Shoh is a pretty standard sushi restaurant in that regard, so probably not the best first date spot.", "author": "Julie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-05", "description": "just finished my delivery dinner.\nI ordered Hamachi Sashimi (5pcs) + Chirashi Don + Sweet Gum (veggie tempura roll) \n\nPro: \ntimely. I ordered my delivery via Eat24hours. Clear and simple online order website.\nSweet Gum is delicious. I asked for special adding more avocado and tobiko on top.  Tempura veggie are fresh and crisp inside the roll.  lots of avocado and tobiko are also what I love.\n\nCon:\nLack of freshness. the salmon in chirashi is bad and chewy because the tendon or membrane?? anyway, it's hard to chew. I throw all salmon away :(\nShiso leaves are soft and saggy.  so not fresh.  \n\n\ndon't want to order any sashimi raw fish anymore.  If there is a next visit, I will only order cooked dishes.", "author": "JustinE Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "This place is a dream come true. I've been 3 times in 2 weeks - which is a lot. We aren't regulars anywhere.\n\nFirst time I ordered take out teriyaki chicken, just to be safe.  The salad was crisp with a very nice dressing.  The chicken was excellent.\n\nSecond and third time we got a combination of rolls and dinner plates (kobe beef teriyaki then tonkatsu.)  Each time the food has been excellent.  The rice is perfect.  The fish is fresh.  Their spicy scallop is just right.\n\nThe service is great.  Very nice people and very attentive waitress.  \n\nAnd oh yeah, $2 pints of Sapporo! \n\nWhile we never get a spot in the lot, we always find something on Dewey.  Worst case - keep going on Dewey, turn right on Pacheco, and then 1st right on Magellan. Park just after Sola Ave. There's a path down to the Forest Hill Muni station, which gets you very close to the restaurant.", "author": "Kylie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-04", "description": "A group of ravenous friends and I ordered delivery from here on a Monday night. The woman on the phone said it would arrive in about 45 minutes - 1 hour. Okay, we could wait. Let's just throw on a couple of episodes of Arrested Development.....4 episodes later (2.5 hours after we ordered), we FINALLY got our food. \n\n I can't really comment on the quality of food since we basically snatched the food out of the delivery guy's hands and devoured all our food in milliseconds. But, from what I remember it wasn't too bad, but not great either.", "author": "Eme L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "This is going to be short and sweet!!!! This place is the bomb!!!!! Love it!!!!!!! Michelle talks of the great Yakatori but I LOVE the sushi, I have had good sushi and this place is def. up in my top 10 places. And the delivery rocks - quick and great packaged food hot if suppose to be and cold if a cold type of dish, serving sizes are great. Lion King roll is awesome, Ice cream for desert.  yummmm. it's ALL GREAT,  Thank Sushi Shoh for ALWAYS being the best.", "author": "Steve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "Fresh sushi, yummy & Japanese cuisine in my neighborhood, fairly priced & delivered to my door within an hour! Fantastic!", "author": "Maria T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-05", "description": "Sushi was delicious! However, time was not on their side.  Apparently overrun with takeout orders at 6:30 on a Tuesday night, Sushi Shoh had a difficult time filling our order of 3 rolls and one appetizer. \nOrdered Ankimo, Crystal Water, Lion King, and Spice Bazaar.  All rolls were delicious, especially the Crystal Water...very fresh. Other two were warm rolls; a tastiness that that could appeal to many flavor palates. Ankimo (the APPETIZER) came last...cold..in a margarita glass served with dipping sauce by side. Good quality but have had better. \n\nIn short; they deny you yummy menu items and substitute roll components to give you the freshest fish available; can't hate on that. Time could be an issue, but also super courteous wait staff and food makes the wait a little easier. Definitely try, apparently popular for pick up.", "author": "Julie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "Ordered delivery, came to us quite promptly. Delicious rolls and sashimi. We got a online ordering deal for a freebie california rolls, and even though it was free it tasted like real crab instead of surimi. The rolls were all delicious - our favourite was the flaming torch roll.", "author": "johnson c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "This is my go-to on Grubhub when I am looking for sushi. They have wonderful rolls, and their deliveries are always on time. The Lion King roll is by far my favorite.", "author": "T M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "really good neighborhood Japanese restaurant.  The food is good (and I'm Japanese!), the staff are consistently nice, and the place is reasonably priced.   Best of all, it's kid-friendly.  The other night we went there and the waitress saw my child fumbling with chopsticks so she brought over some training chop sticks.  They always give us free edamame too.  \n\ngreat chicken Katsu; tempura; vegetable soba; and vegetarian rolls.  \nOishii desu ne!", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-16", "description": "The fish just wasn't up to par. We went hoping this could become our new local spot for a sushi fix, but ended up crossing it off the list.\n\nWe ordered nigiri escolar, mackerel, and scallops. The scallops were good, the other two only mediocre.\n\nWe also tried the miso-glazed gindara (black cod), which is grilled. What we received was most definitely *not* gindara. It was some other white fish with a totally different texture and flavor. \n\nThe service was fast and cheerful, but it just doesn't make up for the low quality of the food. In the future we'll be going back to Koo or Ariake instead.", "author": "Tabitha Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "I'm always skeptical when a new place opens up, especially new sushi restaurants. As you all know there are TONS and TONS of sushi joints to go to, and a lot of them are not good to just okay. Despite preconceived negative notions of this place, it actually delivers pretty good sushi. When judging sushi I go based on 2 criteria, 1st: taste, and 2nd: originality.\n\nTaste: 3.5-4 STARS, crunchy rolls are crunchy and not oily. avocado is fresh, rice is pretty good.\n\nOriginality: 3-4 STARS, they have the usual california rolls and spicy tuna rolls, but they have a couple that are unique and deliver on taste.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-06", "description": "This place is great, quaint neighborhood spot with a very friendly staff. Nice specials, excellent value. Not sure what others were complaining about,  guess all places can have their off nights. If  you live in the hood and like sushi you've gotta check it out.  For the person who complained about parking there is always ample parking on Woodside.", "author": "Vince S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "ADDED NOTE:  Just a few hours after writing this review, the person who worked on our table wrote a lovely response showing a sincere interest in making us happy.  I was impressed with her willingness to take responsibility on behalf of the restaurant and to look into my concerns.  This prompts me to raise the rating from two to three stars.\n\nAlso, when looking at my review below, please note my concern over the service was actually with the team behind the sushi counter and not really the food server.  I have grown accustomed that the people behind the counter often set the tone for the restaurant with warm greetings and so forth.  To be fair, I now understand from the response letter that they had an unusually high volume of delivery orders.  (I can understand that as the food is truly very good.)\n\nBased on the response, I will be sure to come back!\n\nWhen Sushi Shoh was about to open, I would peek into the restaurant  through the plate glass windows with great anticipation.  As they were ramping up for the opening I sensed they were taking care to create a pleasing, even zen environment.  They put in very nice lighting fixtures and a pretty window with bamboo etchings on the glass.  \n\nI will start with the positives, and it really is a positive- the food quality.\nWe had sashimi for two and yakitori for two, and both were very good.  The quality of the fish was very good, and the yakitori was nicely prepared, except for the beef which was slightly overcooked.\n\nNow for the disaapointments:\n\nThe placement of an unnecessary flat screen tv with sports playing dampens the potential to make it a pleasant dining spot.  There is something about the flickering lights from television that cheapens the atmosphere of a restaurant- especially a small one.  It almost felt like its placement was for the entertainment of the people working there.\n\nAnother thing they did was they took the lovely glass they put up for the restaurant and cheapened it with scotch taping menus and other announcements which makes it feel like a low end restaurant though the prices are moderately high.\n\nThe other challenge is it seems like no thought was placed on service warmth or style.  There was an almost sluggish disinterest in whether we were enjoying our experience.  I have grown accustomed to the warm greeting and send off that often comes with dining in a nice Japanese restaurant.  Here, eventhough only two other tables were occupied we left without even being noticed or thanked.  \n\nBottom line- I like the food but would consider travelling farther from home to avoid the lack of warmth and a blah atmosphere. \n\nI think this restaurant has very good potential if they work on these items.", "author": "Emanuel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "Still great place for delivery haven't stopped in yet but the delivery is always fast fresh and hot. So far I've tried a lot of their menu and have only had one thing that I didn't like. The Nigiri is always fresh and isn't fishy, ton katsu is great, and salmon or beef terriyaki!", "author": "Ashley K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": ".San Francisco seems to lack that perfect combination of a decent Japanese restaurant at a reasonable price.  Sushi Shoh is close by and we pass it often enough that we decided to try it out with low expectations.  We have been there on several occasions and I suppose we think it is worthy of return visits, it just lacks that missing ingredient that draws you back in without even thinking about it.  Granted, we have only tried the combination dinners and some of the sushi.  Prices are reasonable and you will go away more or less satisfied.  But the wow to value ratio is just average.", "author": "barry a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "I love my neighborhood Sushi place!  Great quality, friendly staff.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-05", "description": "Don't do it. This place is garbage. They are completely disorganized, provide no customer service and the food is inedible. Go to Fuji on West Portal instead.", "author": "Marivic T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-28", "description": "GF and I tried this place out as we were in the neighborhood.  The sushi didnt really impress me and there wasnt anything different then the other sushi places.  They dont serve brown rice with the sushi... but.. the dinner was worth it.  We had Chicken katsu, or was it Tonkatsu? not sure but either way it was good tasting and a good portion.  The service was decent and its a nice quaint place, I may have to come back and try again.", "author": "ed c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "Love this place...close to home plus they deliver.  Free rolls when you spend a certain amount and the sushi is fresh.", "author": "Dawn D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-02", "description": "I order from GrubHub a lot... Of all the places I have ordered food delivered, THIS place was one of the most overpriced. The food wasnt bad, it was merely unremarkable. What WAS remarkable was that we spent $40 for 2 people (incuding tip) and we were hungry when we finished the paultry servings that were provided. We ordered sushi, some skewers and an appetizer. Never again. There are other way better choices!", "author": "Will G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Their delivery service rocks, especially if you call early. They usually arrive within 30 minutes. The dinner entrees are big portions, the sushi rolls are smaller. My favorites are the unagi and salmon teriyaki entrees. They come with miso and a salad.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "Great neighborhood spot.  Super friendly without hovering, delish grilled shishinto peppers and generous portions (gave us extra sashimi on a slow night).  Not the trendiest or most authentic place in the city, but not trying to be either.  Good stuff.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-09", "description": "I really liked the menu, which was a well balanced mix of sushi and other Japanese tastiness. I highly recommend the bacon wrapped scallops, but everything was great down to the vegetables they served with the chicken katsu. Although I didn't have room for the sushi the fried bananas had a tempura batter that was teh noms. Good food, nice decor, and still really affordable. It's kind of hidden away behind Twin Peaks but it's well worth the trip for the best Japanese I've had in the City so far. I feel so lucky to have been the last customer of their first day. I missed the banner out front that said \"Grand Opening\" and I was surprised when I didn't see them on Yelp yet. If it's this good now I can't wait to see what it's like when they hit their groove, but don't wait cause once it's discovered this place is going to be packed. Will definitely be going back.", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Had some sushi delivered the other night and had to say it was pretty darn good! Saved over night pretty well too for some left over lunch the next day. Decently priced and they have specials that are cheaper too. The only thing that bothered me was that I ordered a seaweed salad and it came in a tiny container which wasn't even half full. It felt more like a sample than an actual side, kinda disappointing, but otherwise good.", "author": "Jenelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). It was delicious, fresh and tasty.....even my friend who doesn't like eating raw fish loves it. \n\nAfter trying that, we got another appetizer, I forgot what the name is, but is like some squid with wasabi served on the ice, it's so great. I was kinda surprised that I would be able to have these dishes I have never tried before in this new Japanese restaurant. \nWe ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\nThey are good, especially the beef tarayaki and lamb rack it was amazingly  delicious, even better than some famous steak house.\n\nTamago is wrapped in a really fancy way....I love it. I guess the Sushi Chief is an expert. Just love their stuff\n\nNow they offer delivery, its even better\nJust ordered yesterday, they delivered in 15 mins which is way faster than what they have suggested (45 mins). Nice packing ......I love it!\nThey are the best!! :P", "author": "Chun Him L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-12", "description": "I want very much to like this restaurant: it's conveniently located down the street from my apartment, the decor is modern and fashionable and the service is very friendly. My boyfriend and I stopped in for a  quick bite before a movie and ended up waiting over an hour for one sashimi combi, one unagi nigiri and two rolls. We inquired about the order after we noticed that tables seated after us had already been served their food and the waitress apologized and promised to bring out the order quickly. The sushi rice was completely overcooked, soggy, condensed mush although the sashimi was fresh and tasted just fine. I hope that as a new restaurant they are working out their kinks and that when I try them again the rice will have improved but for now I'd rather wait outside Tekka or Okina for my sushi.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Sushi delivery, not many. Tried Sushi Shoh, was delish. For comparison, tried Takara Sushi SF, wasnt impressed at all. When in Noe and looking for sushi delivery, Sushi Shoh wins hands down. When in the marina, Enoshima is my spot!", "author": "sarah c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-21", "description": "How lucky we are that this wonderful japanese restaurant opened up right in our neighborhood.  Food is great, love the steak teriyaki and the salmon teriyaki!  Sushi is tasty and fresh.  Portions are good for the price. I've eaten here alone and with up to a party of five and they are always accommodating.  We have been back several times and the food quality and good service have been consistently great.  It is sometimes empty because they deliver too, but I would rather eat there because it is a real comfortable, clean place and it's still easy to get a table.    Even if I lived across town I would take the drive to eat here, it's a great spot!", "author": "Felicia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "This place is excellent.  I'm very happy that a sushi restaurant has opened here in the neighborhood.  The fish was fresh and tasty; the service was attentive and they kept trying to give us free stuff.", "author": "Jorm .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "This order is for delivery.  I ordered the crunchy spicy tuna and spice bazaar rolls.  The rolls were okay but pretty soggy and not crunchy.  For this price, I won't order delivery again.  I will give them one more chance to see how the food is at dine in.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Great sushi. Rolls are huge, pretty, and delicious! Seaweed salad is crunchy and tasty. Prices are great. Service is super fast and friendly.The server even asked someone smoking right outside the door to move for me. Their fried banana dessert is one of the best I've had too! Small restaurant but I always find a table no problem. They just need some background music and it would be perfect.", "author": "Casai D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "Delivery always on time. Probably the best sushi place that delivers. I love the Lion King roll and the crunchy California roll. Sooooooo good!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-21", "description": "Sushi Shoh is located in a little shopping center that people walk by on the way home from Forest Hill Station. With the exception of Chouchou and Kathy's, which has a lot of regulars, it has always been tough for the third restaurant in this five store shopping center. There was a Mexican restaurant that seemed promising but I did not have a chance to try it before Sushi Shoh took its place. \n\nOne exciting thing about Sushi Shoh is that they offer yakitori, which is lacking in the bay area, even if you count the San Jose region. So I ordered the Yakitori Moriwase (combo) and my husband ordered the Chirashi dinner. The yakitori was six skewers chef's choice and they gave us: Butaniku Yaki, Gyu Hire Yaki, shishito, shitake, Namajake Sumiyaki, and Tebasaki. They were all good but not great in comparison to a specialized yakitori restaurant. It was mentioned on the menu that they use real Japanese charcoal, which is great, because it imparts a different flavor than regular American charcoal. \n\nWe knew right away when we walked in that this was a Chinese owned and operated Japanese restaurant and that was fine by us. We eat a lot of great Japanese food, from Japanese restaurants that are owned and operated by Japanese, to others that are Japanese owned but have a lot of Chinese cooks/staff, and this would fall into the third category, Japanese restaurants owned and operated by Chinese folk. It may seem petty if you do not eat Japanese food often but there are nuances. And of course, you really have to try it before you judge. Not all Japanese owned restaurants are great and Chinese owned places medicore. One thing you will find is that Japanese places tend to have a higher grade of fish, better knife execution, better tea and being Japanese, also smaller portions and higher prices. Sushi Shoh, like other good Chinese sushi joints we have been too, had good sushi quality and nice fat pieces. Everything was creamy, fresh, and cut well enough that you did not bite into ligaments that can make the fish chewy. Someone did mention they had a lot of \"fakesushi\" on the menu and that pretty much means rolls. Rolls are generally more emphasized at Chinese owned places than Japanese ones. We also ordered a salmon skin roll which was decent as well. \n\nSo the next time we feel like some good, decently affordable sushi near our house we will come here. If we want sashimi focused places there are other Japanese joints available in the city. Someone also wrote that the decor was sparse but I found it to be pretty nice for a casual spot.", "author": "Empress C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-09", "description": "Great Services! Great Food!! The owner is very creative! I like how they put the desserts! Go TRY IT! I will sure go back again and again!!", "author": "Tammy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-08", "description": "My husband and I came here very recently and loved it.  The service was great, and the yakitori, which I have never eaten before, was wonderful.  I would most definitely come back here.  I agree with one of the reviews about ditching the big screen TV though.", "author": "Prabha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-15", "description": "Recently visited again. They're slipping. Quality isn't as good and freshness just isn't what I'd like. There's still time, guys. Pick it up a little or else you'll risk losing us for good.", "author": "Al M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "Lovely staff- food was ok.  The CA roll is made with imitation crab meat- you can get real for $2.00 but it is not listed on the menu.  I would have rather paid for the real!!!  Sushi rolls are fresh, but they shouldn't sear the fish on top of the rolls.  The fried bananas and sesame ice cream were to die for!!!!", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-26", "description": "Super fast and fresh delivery! Sushi Shoh has saved me from standing in those 2 hour lines at other sushi places. Have you tried the Lion King roll? If you haven't, you really should.", "author": "Emily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "This place is awesome for delivery. I've never dined in as I'm always with my kid and he refuses to eat any type of asian food. So, I've tried more than half their menu and nearly everything has been really good. \nThe highlights, their specialty rolls are all very good, right now I'm a fan of the firebomb. Their udon nebeyaki is super delish, I love the poached egg and huge pieces of chicken. I didn't like their chicken terriaki too much, but I love love love their steak terriaki. It's not a bunch of tiny shaved beef strips I've had other places. It's a full on thin cut of rib eye. The only way it could be better is if they shaved the extra fat off for you, but it is always tender and perfectly cooked. Their tempura is pretty crispy for delivery and there is always a great variety of veggies.\nSo if you are looking for a good sushi delivery place, this place is the bomb. The only reason why it's not five stars is because their fish could be a little fresher.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-01", "description": "what a great sushi restaurant. came here recommended by a friend and glad that we did. The decor was very modern and clean. Food was great too. Had the tofu specialty which was soft inside and light crunch outside- sauce was yummy. tempera udon was really tasty and lots of different type of tempura. My son loved it. Hubby got the steak teriyaki- it was a huge portion and again very tasty. Order few different type of raw fishes and they were very fresh. Service was great and they were very accommodating to our 3 year old. And they deliver!!!! We need some more delivery restaurants in Seattle. Oh- did I mention that this place was far better than places we went in japantown where we were staying?", "author": "Shy z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-02", "description": "My new favorite sushi place!! I've eaten from here twice and each time was very enjoyable!! This is the cutest little restaurant and the service is great!! The people are really nice, and they're always giving out free samples when you eat in!! What I like about this place is that they have these sushi rolls that sound like strange combinations, but they taste amazing!! My favorites are the crystal water roll, and the lobster flower roll. they both have really unique tastes. Last night, I got the steak teriyaki to go and it was delicious!!! Oh and they have delivery!! How cool is that?! I've never heard of a sushi place that delivers!!!", "author": "S M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "Service was great, sushi was good. Stand out was the tofu. Caters to the west of twin peaks crowd.", "author": "James M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-28", "description": "Tried going back there yesterday but it was closed because of a private party.  Ate there when they first opened and the service was great.  The sushi was fresh and had a somewhat good variety.  Will head back to give it another try.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-12", "description": "My family and I came here for dinner recently and were pleasantly surprised by the quality of food here. I loved the Evergreen roll and my husband enjoyed the chicken meatballs and several other tapas dishes.The waitstaff is very nice, although a bit slow at time. The restaurant is tiny but very comfortable and charming. I am looking forward to coming back and trying some more things.", "author": "Keromi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-20", "description": "Food is great. Charcoal flown in from Japan gives the Yakitori an unique flavor. Their scallops are also a must try !!!", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-11", "description": "I was pleasantly surprised by this sushi restaurant.  The fish was high quality and tasty.", "author": "Anne F."}
