{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Got the pomegranate tart, vanilla, and caramel yogurt. I liked the tartness of the yogurt, but it was a bit too sharp. The vanilla was solid and the caramel was light and yummy. They have around eight flavors so it was sort of limited in selection. I liked how they let you sample all the flavors though and you could sample yourself.", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-27", "description": "it's not one of the better fro-yo places, but okay in a pinch as there aren't many (any?) options in FiDi near Embarcadaro. seems one or more machines are out of service and there aren't many toppings available", "author": "Bob U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "Yoppi is the only self-serve fro-yo place in downtown. Its entrance is on Pine even though the formal address points to California Street. It is supposed to be open till 5 pm but a lot of time I've found it to be closed after 4 pm.  \n\n It has about 7 to 8 rotating flavors on tap at a time. The fro-yo here is a little too runny for my liking. As there aren't too many options around I have to make do. Current price is .69c an ounce which is high but fine for the area. A half full small bowl will run you just under $5. I think they have a 10% discount in the last 1 hr before they close, but that is if you manage to get them open at that time. The only other fro-yo place that I know of in downtown in Caffe Ambrosia which has even more limited flavors, is not self-serve and is more expensive and of-course has much better quality than Yoppi, but Yoppi will do the job that it is intended to do.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "Standing outside the locked door at 5:15 watching someone clean everything up even though the sign says Mon-Fri til 6PM\n\nwalked here with a dream \n\nnow it's ded", "author": "Biscuits N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "As one of the only froyo places in the area, it'll get the job done.  But is it extraordinary?  No.\n\nNothing was standout, but nothing was bad.  There weren't a ton of flavors (or at least as many as I'm used to down in San Diego) but there were probably 5 or 6.  I added cake batter to mine, and it was very very sweet.  Expected, but still sweet!\n\nThe employees are not particularly helpful or friendly, but simply do their job.  Would probably not come back here unless I was in dire need of some frozen yogurt.", "author": "Kenna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Their service is very good! I come here quite often to get their yoggurt and one day, I saw a sign saying that they have Matcha Milk Tea. So I was asking the guy at the cashier:\n\nMe: Do you have sample for the Matcha Milk Tea?\nHe: No, but I can make you one.\nMe: What?!\nHe: Yes, do you want any toppings?\n\nThen ... I got Matcha Milk Tea for free! Compared to other boba places, the Matcha Milk Tea is just OK. But, you can't expect a great milk tea at a yoggurt place. The yogurt is VERY GOOD though.", "author": "Euodia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-07", "description": "This place used to be fine but something is a bit off now.....we went today and only half of the machines were working.  My friend inquired if there were any sugar free options and the cashier replied \"no\".  When I paid, I have no idea what my total was because she never said a word to me, only took my card.  Half of the chairs in the shop were stacked up like they were getting ready to close (it was around 1pm).  I asked her if they were closing (either for the day or permanently) since it just seemed so barren in there, she rolled her eyes and told me \"no\".", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Their froyo quality is creamier than other places! My favorite is the caramel cream and cake batter flavor they have. You can also vote on the board for next week's flavor, and they also have happy hour of 20% from 4-6pm!", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-20", "description": "Standard yogurt place  and they have about 8 flavors if I recall correctly. I had the standard tart and it was solid  (not great/not bad). Price seemed a little bit higher than expected but to be expected given the location.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-19", "description": "Yoppi Yogurt is just OK! Nothing great and nothng bad! I wanted a froyo as was craving after work, and SF fidi is pretty low on these options (what the helk, SF). I guess because of the cold weather and non-LA esque need for ice cream on every stop, I figure. \n\nI usually go to Yogurtland (holla Dublin location you are the best) and PinkBerry or something related if around. Both were far so I checked this out for the first time. First let's say location was fine but hard to spot! It's more off Market St and Pine than it is address wise. The girl was very nice on the phone helping me locate :) \n\nThe actual place is pretty spacious with a handful of machine and flavors, but the setup is meh! I don't like the jars you have to reach in A) for cleanliness and B) it looks old. The froyo was kind of mushy already and not that great, TBH. \n\nOverall was OK and maybe maybe if desperate would be back but definitely would like to try the other (lacked) options in SF! Suburb yogurt wins!", "author": "Mahsa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-23", "description": "Glad to see a lot of lighter, fruity options as we enter into summer here in the city (but that they kept chocolate around - classic!).  I voted for the taro option on the board to the left of the cash register, and I hope to see it available next week!\n\nLoved their tart & lychee tart flavors!  \n\nMy friend and I shared a 13.6 oz cup.  Why is that significant?  Well at 0.49/oz... just do the math.\n\n*Seemed ridiculous to make another update just to include these notes, so I'll just edit this one*\n\nCame by on 7/30/14, and tried out their taro tart and passion fruit tart.  Really like the passion fruit, but I have no idea why they didn't just name the first one \"taro.\"  No tart flavor at all.  And really not a lot of taro, either.  At least, not like any taro I've ever tasted.  :/  Will definitely pass on that one next time around.", "author": "Iona C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-08", "description": "I'm standing in front of the place right now at 5:30 pm says on the door hours are 10am - 6pm and it's closed. Super irritating.", "author": "Melanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "Solid Froyo place here. I had a huge craving for some frozen yogurt and found that this place is a quick 5 minute walk from my building. The place is small, but well kept. The guy behind the counter was really nice as well. I would say they don't have too many out there flavored like at Yogurtland or Pinkberry, but they have more basic flavored. I got the cake batter one and dropped a ton of toppings on it. I really like that they have the marshmallow topping it's so good. Overall it's really close and it tasted created I will be sure to come back again!", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "Yoppi Yogurt seems to be \"THE\" yogurt chain of San Fran. Well relatively enough, since San Fran Snooty (JK love you San Fran) seems to shun yogurt in favor of its higher fat, buttery tasting sister, ice cream. \n\nI wasn't too enthused about the Yoppi closer to my apartment, but this Yoppi has restored faith in humanity...oh wait, yogurtmanity!\n\nYogurt - The yogurt quality was smooth and melt in your mouth. The flavors, especially the peanut butter and cake batter were vivacious and immediately hit all your senses. I am not usually even a cake batter fan, but this one was too good to pass up. \n\nToppings - The toppings here were some of my faves with cheesecake bits, oreos, little brownies (not the homemade circular ones but the little squares), cinnamon toast crunch (with a whole lotta that sweet childhood cinnamon sugar), mini Reeses pieces, and last but not least those smores bits (so hard to find). The Yoppi locations vary slightly in topping selection.\n\nSample cups - As many as you want. AKA the best policy! (Am I right Candice G?)\n\nPrice - ehh whatever. You know I am getting it anyway.\n\nWi-fi - Yes!\nSeating - lots!\nConvenience - Yep!\n\nYogurt bliss! - Ab-so-yogurt-lutely", "author": "Libby J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-06", "description": "I love froyo, no secret here. This is a good spot since they have a bigger selection than the one in Westfield. They have 8 flavors and a good variety of toppings. The strawberry tart is very good.\nWhy only 3 stars? They are expensive (69c/oz) and the froyo often isn't frozen enough so it is too liquid for my taste, I like it creamy.", "author": "Michèle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "My co-worker and I tried Yoppi yesterday. The best thing about it is that it is 'Self-Served' unlike Cafe Ambrosia. Yoppi had some interesting flavors like Mint and Cake Batter. They were all sooooo good! The wide variety of toppings are also great! From cereal to cookies and crackers (they got chopped ice cream cones!) to chocolate chips to fruits - you name it, they have it. The guy who was working then also was super nice to us. My co-worker asked him if she can add the topping that she wanted since she didn't see the first time we walked in. He gave it to her for FREE at No Charge! We got there around 3pm and they got busier when were just about done. I got half Original Tart and half Chocolate with Reeses, Oreos, Kiwis and Mangoes. I will definitely come back here again! It's not very far from our offices (3 blocks away) so definitely a WIN. Thanks Yoppi!", "author": "Anna Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "My review is strictly for the cashier gal that processed my transaction. After getting my froyo, I headed over to the cashier and said hello and the cashier just looked at me as if she saw the ever so rare pokemon...MEWTWO!  but nope, it was just me trying to pay for my froyo. She did not say a word! She took her hand out to signal to me to give my debit card to her and I said thanks, I hope you find Mewtwo....just like the rest of us on Pokemon Go.\n\nMaybe a little bit of cashier to customer interaction would be nice or maybe even a smile? Instead being mute. \n\nOverall, the place is clean and tidy. Just don't expect the cashiers to talk to you lol.", "author": "Robin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Now $.69/oz. Why they raise price... I thought $.49/oz was expensive...\n\nI like this place because they put the sample cups out instead of requiring you to ask. They have 8 different flavors there. The ones I liked were Sugar-free Boysenberry (Tastes like raspberry, yum), French Vanilla (tastes like ice cream!), and Strawberry Tart.\n\nA nice selection of toppings on the side. The staff is nice. They give you plastic covers in case you're on the go. There's inside and outside seating. Very nice place to hang around.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "I'm not a big ice cream fan, so frozen yogurt is a logical alternative while looking for dessert. Yoppi is close by and they have a decent promotion after 4 pm which makes it my preferred place. Usually they have about 5-6 yogurt options available, half of them fruity and I have seen a board where customers can leave their suggestions for the next change. In terms of add ons and toppings, they have a good collection of chocolate tidbits, granola bits, fruits slices, etc. I would prefer more fruit add ons, just my preference.\nI am yet to find another froyo place in FiDi, so for now this is my  go-to place.", "author": "Shobhan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Awesome Frozen Yogurt, and a great alternative to normal ice cream. Best varieties are Peanut Butter and Yellow Cake Batter, which are both not available at all time, because customers rate which types are produced each week!", "author": "Lennart W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "I am on a froyo trip right now. Something about it being healthy makes me feel I can eat as much as I want with as many topping as I want. Whatever man, don't judge me.\n\nYoppi is pretty decent. They have around 8 flavors and a reasonable amount of toppings.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "Yes, this place is still here! I called before I went today to make sure, but either they have the wrong phone number listed, or don't answer their phone. While technically part of 101 California I guess, the entrance is on Pine Street, between Front and Davis. Asides from the difficultly tracking them down, the yogurt and topic selection itself is fantastic. The atmosphere is bright, interactive, and fun. Perfect for an afternoon pick-me-up.", "author": "Tessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "Straight up, Pinkberry can eat a d.  I am an American and as such I have the right to tap my own frozen yogurt.\n\nYoppi is the real deal, and now that the one on Montgomery closed (and took my rewards points with it [damn you independent franchisors!]) the California one is the main spot.  The best part is never having to spend more than $5 for all the yogurt you can handle.\n\nThe flavors are always amazing and the toppings are usually stocked aside from the fresh fruit, but lets be honest...you came for the chocolate chips and cheesecake bites.  I'm pretty sure if everyone complains about the Montgomery store's rewards points not being honored, they'll have to give us all free yogurt.  Or something.  Go here.", "author": "Frank R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "FINALLY FOUND YOPPI YOGURT TODAY! Solid selection of frozen yogurt and toppings, plus they offer 10% off every purchase. You guys should update your location, because putting 101 California St in Maps will not lead you here.", "author": "Allison D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Not only does Yoppi have the best selection and quality of frozen yogurt in the FiDi, but their team is incredibly honest. I accidentally left my camera on the counter there last week and when I returned today, they had it for me. Thank you, I'll be back for yogurt there real soon!", "author": "Ron N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "Great excuse to leave the office for thirty minutes. \n\nGets crowded in the summer, but always has something that you want on the flavor rotation, and tons of toppings to boot. \n\nLove their tart flavors.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-22", "description": "I am a sucker for do it yourself frozen yogurt places. My main complaint with Yoppi is how fast their yogurt melts. I swear it becomes liquid in 2 minutes, even if it's not hot outside. Plus I feel like Yoppi is really expensive for what it is. I am always a little shocked when I get my total at the front.", "author": "Gina G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-09", "description": "Yoppi Yogurt has so much potential - good location, and a clean, well-lit space with plenty of tables and chairs to enjoy the yogurt plus lots of choices at the toppings station. But it's the yogurt that's lacking in texture, taste, and as other Yelpers have noted, the yogurt is runny and not creamy. There are interesting flavors, but the yogurt itself needs improvement. Also, at .69/oz., it's not worth the price.", "author": "Grayson E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "When I thought all hope was lost on finding a Self Serve fro yo place, my co worker introduced me to this wonderful place.\nNow I can live happily in SF forever.\nThey even have toppings and more than 2 flavors.\nAlthough its no Yogurtland, this place is just as satisfactory!", "author": "Brittini S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "Love this place!  Though I wish they had more fruity flavors...I guess it's because the general mass tend to lean toward sweeter tastes?  \n\nBTW does anyone know what happened to their website...used to go on there to look up calorie and other nutrition info but now I can't find it anymore.  Such a bummer!", "author": "Chris K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-01", "description": "Hot mess express. I tried coming here twice to find machines not working, popular flavors gone, and no A/C. Why even have a yogurt shop if you don't serve any? \n\nIn all seriousness, stop with the crappy flavors and have 2 or more machines serve the classic tart. You're welcome.", "author": "William V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "French vanilla + strawberries + mango + coconut + graham cracker crumbs + caramel = almost forgetting how work sucks a lot sometimes.\n\nI love the variety of toppings (pretty much everything that you can think of is there), although I'm not really that crazy about froyo flavors in general other than french vanilla.", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "I got their cake batter and plain tart with mochi and the cake batter was delicious! It's a nice, clean place and in a convenient location for people working in FiDi who want a quick after lunch snack to take back to work. They also let people vote on what their flavor of the week should be in the upcoming week, which also just makes it fun for regulars.", "author": "Maureen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "After a less than stellar experience at yogorina, i stumbled across this HEAVEN of a fro yo spot today. So good! Salted. Caramel. Fro. Yo.\n\nFlavors were great and I thought in general the froyo was colder than other places I've been--didn't melt very fast. Great toppings selection! They have Cap'n Crunch and Mochi which are two tell tale signs of a great froyo place...and Jelly Belly Jelly Beans too!\n\nIt's dangerously close to my summer internship and my bus stop so I'll have to limit myself to one-a-week but it's definitely my favorite place in the city right now.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "I stopped by here on my way home from the 2012 US Open. I am not sure if they usually have the Mango Tart but they did that day! If they do, I may have to constantly come to this location and get my Mango Fro-Yo and load it with sweet ripe mangoes!\n\nIt was a nice day, so I decided to eat it out in the sun.", "author": "Lora M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "Great pit stop for quick sweet intake to ward off mid-day work blues. Also relatively healthy if you argue the probiotic angle. This particular yopi has the best flavor selection of the FiDi (if I'm wrong please inform me). I use to wonder if the froyo clerk was surly or painfully demure and reticent, but as of today I've decided that she is painfully shy. \n\nI also dig the artwork with the shaded cool-guy next to the cute lady in the red party dress who he's either hitting on or robbing-- my guess is the former. I've been tempted to run off with that cool-guy cutout and may or may not be planning an elaborate heist to capture it (message me if you want part in this potential caper).  \n\nFlavor Update:\n- Salted caramel tastes way to artificial.\n- Green Tea alone is a bit much but mixed with Blueberry Tart and French Vanilla it adds a great earthy undercurrent to Tart and sweet.\n- Blueberry Tart is arguably good alone but best paired with something else.", "author": "Quentin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "There was a Yoppi directly downstairs in my old office, so naturally when we moved buildings the first thing we did was go in search of the nearest Yoppi location. Not to be traitorous to my old Yoppi, but this location is SO much better.\n\nI'm not sure if it's the physical layout, the fact that they have sour gummy worms as a topping, or that they have pink spoons (because let's be honest, the spoon color makes a difference), but whatever it is, I LOVE THIS PLACE.\n\nEvery week you can vote for the flavors you want next week. They always have the standards like original tart, chocolate, etc... but sometimes they have really unusual flavors like green tea, boysenberry, and salted caramel. The fruity ones are usually a safe bet. I sampled the salted caramel today and that is a mistake I won't be making again... The peanut butter is my favorite.\n\nThe one downside about this location is that the girls at the cash register can be pretty rude at times. They are also very stingy with the sample cups which they keep hidden in the drawer.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "Love this place! \n\nThey have so many fro-yo flavor and topping options - more than YoCup or Yogen Fruz. And the fruit toppings are really fresh.\n\nThere's a chart near the register where customers can vote (as many times as they want) for next week's fro-yo flavor selection. I voted for cookies and cream, peanut butter, and pomegranate :) So now I have to check them out next week to see which flavors made the cut. \n\nYoppi has lots of seating, including some outdoor tables. And their bright, colorful plastic spoons make me happy inside :)\n\nBeware that although their address is 101 California, the entrance is actually on Pine near Davis St.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Much better than the average frozen yogurt shop, because they have a very large variety of base flavors, that have some rotation / specials to them, and a huge variety of things to put on top.  I'm extremely partial to their \"tart\" flavors, because frozen yogurt is always too sugary / not creamy enough for me (I prefer ice cream) and the sour / tart flavor works really well with the toppings.  \n\nToppings include a lot of standards (cookie bits, etc), but also a variety of candies, cereals, frozen fruit, and fresh fruit.\n\nPrice is $0.49 an ounce, which feels reasonable to me.  A decent serving will cost like $4.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-18", "description": "Outrageous prices. I was a regular customer, until today. Got my usual cup, 1/3 full with no topping. When the cashier rang it up at $4.65 and said \"prices have gone up\", I put the cup down and left. I'll never go back.", "author": "Mark N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "This Yoppi location has singlehandedly made me fall in love with froyo all over again. It's located right next to my office, so I've been getting it almost every day during my lunch break because it's just that good. \n\nThey have a decent variety of flavors (I want to say more than most froyo places), and I'm particularly impressed by their signature tart. Other than that, I usually go straight for their fruit flavors which never disappoint. However, I think what sets Yoppi apart from your typical froyo place is its toppings. They have tons and tons of toppings that I haven't seen in many other places. My favorites are the white chocolate chips and crumbled waffle cones. Their pricing is pretty on par with most froyo places as well, so no complaints there. Be sure to also take note that their entrance is on Pine Street, and not California. \n\nI'm glad that they have a rewards program where they give you $5 after you've spent $50. However, I think I'll feel quite sad the day that I find out I've spent over $50 on froyo alone haha. No regrets though - this place is great!", "author": "Sunny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "Super close to my office which I loooove. It's \"winter\" so I can only imagine how often I'll be here in the \"summer\" (it's sf- what summer?!) 2-3 flavors are featured every week - I always sample them but I stick with my vanilla bean/ chocolate swirl. They have a frequent buyer system although I'm not exactly sure how it works...", "author": "Angela C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "Best self-serve froyo shop in the Financial District. This Yoppi location has 8 different flavors that rotate weekly, which is the most variety you can get in the area. Plus they have the largest number of toppings. I'm particularly fond of the caramel-y nut concoction and the crumbled reese's cups. \n\nOnly two problems at this Yoppi:\n1. They close at 6pm and on weekends\n2. They're very stingy with their tasting cups. The lady at the register guards like her life depends on it. If you ask, they'll give you one tasting cup, so you better either make that cup last, only try one flavor, or just stick your mouth under each dispenser. I'd recommend avoiding the last one; don't think it'd go over very well.\n\nThey're also not particularly inventive with their flavors or toppings, but it's the Financial District, what do you expect?\n\nIf you give them your phone number after you pay, they'll keep track of your purchases and give you a $5 credit after each $50 spent. Not much, but better than nothing!", "author": "Talia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-11", "description": "As another recent reviewer has noted, the prices here have jumped by 40% an ounce.....my usual ~$3.50 yogurt was $5.  might not seem like that big of a deal, but that's the same price as a pint of ice cream at Safeway -  i'll go that route and skip this Yoppi going forward.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "I still really like this place because of all the options on froyo and the toppings, but just FYI the prices went from $0.49/oz to $0.69/oz recently :/", "author": "Jacquelyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "Our boss takes us here for Froyo Fridays. Always a nice time to bond with our colleagues. I definitely appreciate the rotating tart offerings. Pomegranate and green apple have been my favorite so far. \n\nAnd they have carob chips!  Total win!", "author": "Valerie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-29", "description": "It's like any other yogurt place. You have your chocolate, vanilla, special tasting flavors. You also have your fruits, cereal, and candy choices for toppings.", "author": "Vinson H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "Froyo by the pound in the financial district.\nGood for a small break in the afternoon.\n\nI chose something simple, vanilla ice cream and strawberries, which was good.\n\nBut god! The employee was incredibly rude! I had never seen this in my life. Crazy thing is, I'm not the only reviewer talking about this.", "author": "Alizee M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "I'm kinda bummed out today and needed a little pick me up. Jenn and I went out for a walk (in my case - a limp due to my hurt knee). Yeah, I'm broken. :'(\n\nWe stopped into Yoppi. The whole idea of self serve fro-yo to me is like a salad bar, your eyes get huge and pile up. Cha-Ching, $6 bucks for frozen yogurt. \n\nI got a coconut, orange creamsicle and pineapple flavored fro-yo's (a little of each) with pieces of mango, strawberries and shredded coconut. Very good.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-30", "description": "Stumbled across this very adorable build-your-own-yogurt shop walking back to work after lunch one day. Full from lunch, but I still manage to make room for dessert. That seems to always be the case w/ me.\n\nLocated right there on California Street, literally across the street from the Bart station, the Embarcadero, and a few bus lines (ahem, those who catch the 38 daily should DEFINITELY become a regular here).\n\nAmbiance/Service: OCD clean & utterly adorable. Representing them are two cute little what-looks-like Japanese yogurt caricatures standing near grass and a statement that says: Healthy You Healthy Planet. Ugh, too \"i want to pinch your cheeks\" type of cute!!!!\n\nTHE Yogurt: lots of flavors!! There's the classic French Vanilla, Pink Grapefruit (which my friend raved it tastes like a nice rich champagne mmmm), Cappacino, my favorite Coconut, and many many more! They have new flavors tested out randomly which they have their customers rate on for feedback. Nice!\n\nTHE Sides: woah, I was in Topping Heaven. Other yogurt spots have fake frozen toppings, but that's not the case here. All the fruits are served completely fresh and bite-sized: bananas, mangoes, pineapples, strawberries, raspberries, basically anything ending in 'berries, and  even those little yummy Tapioca balls that you find in Pearl drinks. The other topppings were also massive, so much that I had to really try & narrow my options down: granola, almonds, chocolate almonds, dark and white chocolate chips, gummy bars, and whatever else you name they probably have it. Sigh, rememer: Topping Heaven!!?? I'm not lying.    \n\nBottom line: at .45cents an ounce and seeing the great selection available, I see Yoppi in my very very very near future... hmmm Monday again? Dangit, I think I'm hooked. \n\nGot Yoppi????", "author": "Joy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-16", "description": "I got the french vanilla and banana. This place is decent. I'm a Yogurtland (which is cheaper) fan. They have a good selection and enough treats to add to your cup. Not bad, but not good enough for me.", "author": "MARTHINA C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "This is a great close place for cheat day during the work week (instead of afternoon coffee break) the entrance is really on Pine St FYI, it lists the building's address but you cannot enter from California. They let you vote for the flavors that will change the following week, and have some sort of rewards program however I have yet to be awarded anything. Sugarfree, and tart options as well as full fat. Good selection of fruit/nut/cereal/candy toppings. Staff is always friendly.", "author": "Cody H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-19", "description": "OMG this new Yoppi rocks! A lot more spacious than the one on Clay and Sansome AND more flavors!. The Irish Mint was good as was the Pineapple Tart. The Green Apple Tart and the Peanut Butter was pretty gross though. \n\nThey have of course the Natural Tart with all the delicious fruit toppings (raspberries, strawberries, kiwi, mango) and of course MOCHI.  Rainbow colored mochi gets me so excited. \n\nBest of all you can vote for your favorite flavor for next week. I voted for the Acai Blackberry Tart but the Yellow Cake Batter seems to be the leader.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "On my first visit I discovered Yoppi Yogurt had pineapple frozen yogurt, easily netting them five-stars. On subsequent visits the amazing pineapple frozen yogurt appears to have been removed, dropping Yoppi Yogurt back into the \"just another frozen yogurt place\" range. \n\nI miss that pineapple frozen yogurt. I hope I get to upgrade back to five stars some day. :)", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-31", "description": "I have a froyo problem. When I bought a new wallet, I realized that I am scared of being pickpocketed not because of identity theft or my money being stolen, but what the hypothetical thief would think of my collection of stamp cards at locations all around the Bay Area. At least when I'm downtown I can relax, knowing that Yoppi's frequent buyer program is tied to my phone number instead of a piece of paper, leaving one less froyo stamp card for my hypothetical pickpocket to snicker at. That alone wouldn't keep me coming back, but Yoppi offers fresh, convenient, and modestly priced froyo solution if you work in the area. \n\nI am boring and usually stick to their non rotating flavors of Vanilla or Original Tart, but I've tried their Taro, Peanut Butter, Caramel, and Pumpkin Pie flavors, and they're all delicious! They offer a nice variety of toppings whether you want to go for candy and chocolate  or the nominally healthier tons of fresh fruit route. If I only went to Yoppi, no pickpocket would know the extent of my froyo dependence, but unfortunately its lack of locations in non-downtown areas makes that impossible. I wish they'd open a location in every neighborhood, like Quickly has!", "author": "Aaron Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-12", "description": "The best froyo, so lucky to have this place in my builiding.  \n\nDownside, lack of customer service.  The ladies at the register just stare with lack of experession or sad face, no greeting when you walk in.  Anyone else notice that?  They don't even chat amongst each other.  Looks like a very boring job.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "Friendly face as soon as I entered and was greeted. And I sincerely don't even love frozen yogurt, it's alright, really, but I wouldn't marry it. I was especially deprived of sugar one day, though, so frozen yogurt sounded like a good idea. Another plus was that the company I work for gets me a bit of a discount through ChoicePass, so that reeled me in even more.It was also late in the afternoon, about 5 or 6pm, and I noted that the ambiance of the place seemed swell. \nThe yogurt was tasty, the place was lovely, the experience was good.", "author": "Michele E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-22", "description": "I don't know about you, but I don't feel like there are a ton of things that can make one yogurt place better over another. Since toppings are usually pretty standard across the board, the only things that I personally think that will set a yogurt place apart from the others is 1) the variety of yogurt flavors 2) environment (i.e: cool place that likes to play awesome music and maybe even music videos vs. a lame-o place that is silent) 3) the service.\n\nSo, Yoppi Yogurt didn't wow me with their variety of yogurt flavors or toppings. It was pretty standard in my book.  But the service was unbelievably horrible.  Now, I don't feel like I'm the type of person to use yelp as a venue to just complain about my terrible experience at a place, but the girl who was working on Thursday, November 10th, 2011, evening shift (roughly around 5:30pm) had probably the worst attitude I've encountered. EVER. (Yes, it was so bad, that I actually remember the details of the date and time).  Her bitchy, snappy, and eye-rolling attitude definitely didn't enhance my experience.  This was further confirmed by another customer who also got a lovely taste of this girl's poor attitude.  \n\nSan Francisco has a ton of yogurt places, and I don't plan on coming back here ever.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "Yoppi Fro-Yo.  Just about as good as it gets for an afternoon pick-me-up.  It certainly helps that  Yoppi is conveniently located just below my offices.  They have the standard Fro-Yo flavors and great toppings to choose from.  These range from the healthier fruit, nuts, and granola, to the not-so-healthy brownies, cookie dough, cheesecake, and Oreo crumbles!  I even saw Soy Protein Nuggets (not sure I'll be trying those, though...)\n\nLove that you can vote for which new flavors they will debut each Monday.\n\nLove that you can acrue 'points' for each dollar you spend, and after you hit $50 spent there, you get a $5.00 credit.\n\nEspecially love that they have pink spoons!!", "author": "Christina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "I dig the self-serve because I like to sample different flavors and be in control of the topping-to-froyo ratio.  This place is a great deal.  I had a generous serving of froyo (Irish Mint, Yellow Cake Batter, and Chocolate since you're asking) topped with mini M&Ms and Thin Mint crumbs and it only set me back $2.97!\n\nAdd in the \"spend $50 and get $5 credit\" incentive, the variety of flavors and toppings, the cleanliness (no kids putting their hands in the toppings like at Cultive on Union St....ick), and the proximity to my work and we have a winner!\n\nI'm sure it's healthy, too, right?", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "3 stars is for the tasty yogurt.  The 2 stars is the service.  I was there with a friend getting yogurt.  We wanted to enjoy the yogurt inside as it is windy and cold on the street.  However, we were kicked out because they are closing.  Heck, if you are closing, could you say something when we were getting the yogurt in the dispenser?  Never going back to this shop.", "author": "Sel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-23", "description": "This place is literally across from where I work but I just went here for the first time last week.  First impressions, a big place for a froyo shop.  Lots of flavors to choose from and tons of toppings.   They leave an \"option\" to taste every flavor, enough that if you're satisfied you won't need to fill your cup too much.  Well I just like tasting froyo.  The day I went they had banana (not impressed), cheesecake (great) and yellow cake batter (my friend loved it).  They also had other flavors like original tart, vanilla, chocolate, pomegranate and blueberry.  I will probably have to check out the other flavors another day since they change often.\n\nThere are a TON of toppings.  After getting chocolate, cheesecake, vanilla and tart all mixed together in my cup, I opted to be healthy and only covered it in cherries and strawberries for toppings.  They didn't have lychee which is my favorite, so I was a bit disappointed.  I look proud of my $3.50 cup.  Then I look at my friend's cup - yellow cake batter and chocolate completely drenched in sprinkles, colorful candy and sugar of every kind.  I swear hers was a scene from Willy Wonka.  She had a major sugar crash after that.\n\nOverall, it's okay but I've had better.  The froyo was a little watery for my taste.  In fact, it almost melted by the time I crossed the street and headed back to work.  I normally prefer Yocup.  The yogurt there is more dense and lasts longer.  Yoppi is good if you just want a self-serve and are prepared to eat quickly.  But at Yoppi, you can vote on the flavor of the week.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "Love the flavors they have and the toppings. I think I went for French Vanilla and then went crazy with the toppings! They have a nice bar stool set up where you can relax with the yogurt and watch the madness outside, especially during evening office hours. Will definitely keep revisiting.", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "Good variety of flavors.  Great selection of toppings (from the expected granola and chocolate chips, to fresh fruits and various cereals).  They charge by weight so filler up.  \n\nSilly, I know, but you get to pick your fave color spoon.  You also get to 'vote' on your fave future fro yo flavors. \n\nSimple, close to work, cheap (depending on how much you cram into the cup)... a great place for a quick and healthy afternoon snack.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "Don't buy the hype, this is not THAT healthy unless you only take a few ounces then load up on fresh fruit and plain nuts.  At 25 calories per ounce, a 12 ounces swirl will yield more calories than a package of Twix.  That is, of course, without any toppings... add some cheesecake and welcome to FatVille!  The choices for froyo flavor and topping selection options are mind boggling, a real conundrum for those of us that like to try it all.  I appreciate the variety, but can't say any one particular flavor or topping (except maybe the yogurt poppers) really excited me.\n\nYoppi Signature Tart: Good sour tartness, though Pink Berry's original is way better.\n\nCreamsicle: Really tasted like an old fashioned creamsicle pop, though lost its novelty after a few bites.\n\nCoconut: Wasn't a fan, I believe coconut should taste creamier.\n\nPink Grapefruit Tart: Probably my favorite of what I tried, the sour citrus burst pairs with the natural tartness for a froyo experience unlike anything TCBY ever imagined!\n\nPineapple Tart: Didn't capture the essence of fresh pineapple.\n\nCookie Dough Topping: Pretty yucky, so pasty and nothing like real cookie dough.\n\nCheesecake Topping: No Junior's, but at least the little squares tasted like cheesecake.  I could probably pop these without any frozen treat.\n\nMochi: Not as a soft as large mochi you'd get in Japantown, but still tasty and adding a great chewy texture to the dessert.\n\nYogurt Popper: These little guys are REALLY cool.  Never had such a thing.  A seemingly gelatinous bulb that bursts with tart juice when you bite in.  So cool, I want to buy these in stores now!!!", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "Sweet! Frozen yogurt within a 2 minute walk from my office :) Here's the rundown: \n\nSelf-serve, as in serve yourself from a choice of about 6 flavors of frozen yogurt, then cover it with as many of the plethora of toppings, including candies and chocolates, fresh and preserved fruits, nuts and syrups. \n\nPay 45 cents per ounce. \n\nGive them your phone number so you can get credit and maybe get credit for a free yogurt sometime in the future. \n\nVote for a flavor for next week! Last week I voted for Orangsicle and my wishes came true. Treated myself to some yummy orangsicle yogurt -- Yes, it tastes like the Orange Creamsicle Popsicles! \n\nMy only complaint is they only have one cup size. I say get some smaller cup sizes for those of us that want a tiny afternoon delight, and not a full on yogurt mini-meal. This will also be environmentally conscious because paper will be saved!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-16", "description": "I stumbled across this place when I went to Sellers Market to buy a salad and stopped by for a little dessert ;). I was thrilled a FroYo shop opened up so close to my office!! I will definitely be a frequent visitor.\n\nWhile the place seemed new, bright and clean and had an ample selection of yogurt flavors and toppings, I was a little put off by the size of the cups. There were two size options: X-Large and XX-Large from my point of view. While you pay by weight and not size, it's not that big of a deal, but it's a waste to fill a super-sized tub about 1/3 full.\n\nI know that portions are one of the reasons the U.S. has such a high level of obesity and this place clearly demonstrates why we are a country obsessed with super sizing everything. Clearly Yoppi's management wants to encourage the ever expanding American waste line.\n\nI only tried the Peanut Butter, as it's my favorite flavor, and have to say \nthat it was good, but the Peanut Butter Frozen Yogurt at Working Girl's cafe is better - it's creamier and less grainy in texture than the PB at Yoppi.\n\nThat being said, since it's close and convenient, I will be a frequent consumer of small portions in ridiculously giant containers.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-10", "description": "I was a bit generous in my initial review.  Lowering because I agree the staff is not that friendly and they don't post their daily flavors online, which in this day and age is lame.  Still, it's good and nice price and good toppings.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "I love fro-yo. And this place is right across the st from me. I don't think I've gone a week without it, fresh fruit, and mochi please! \n\nI don't fancy all the flavored stuff, I just like the plain yogurt.\n\nI always have a huge smile on my face when I come here, shit-matter of fact, maybe I'll go now.", "author": "Thao L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "Love coming here after lunch or in the afternoon! The flavors change every Monday and you can vote for next week's flavors. It can get pricey at 45 cents/oz if you like to add toppings, but it's such a good pick-me-up from the daily grind. Plus their yogurt is pretty good quality and they do a good job maintaining the cleanliness.\n\nThis particular location has a frequent buyer program. Not sure how many you have to buy to get a free one but at the rate I'm visiting, I'm sure I'll find out soon :)!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-23", "description": "I went around lunch hour yesterday with a friend who wanted to get yogurt. It was empty when we got there so I just got a sample since I didn't feel like spending on yogurt on an empty stomach.\n\nI felt attitude from the staff. There is free wi-fi but no plugs anywhere in sight. I needed to charge my phone but that didn't happen. Don't even get me started about voting for next week's flavors having no magnets.", "author": "Dominic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "In 2011, I have discovered here and maybe it was my first frozen yoghurt experience and I definitely love it :)", "author": "Angela K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "Self-serve yogurt is sneaky. You feel like you're getting away with a good deal since you can eat slightly less and not pay out so many dollars on each visit.\n\nBut Yoppi Yogurt has taken the old-fashioned loyalty program of punching cards and run with the underlying concept. They take your phone number and record every dollar and cent you spend, rewarding you with $5 once you've accumulated $50. You feel like you're saving money, but you also feel like you're accomplishing something when you manage to spend enough for the reward.\n\nI think someone over at corporate picked up on the gamification of, well, everything and realized that the generation weaned on video games has grown up and works in the Financial District. And that we like to vote on our favorite flavors for next week's rotation. The bright colors and routine novelty are perfectly engineered to keep us coming back for more. Thanks, Asia, for another addiction.", "author": "Sharon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-09", "description": "busy day at work and have a sweet tooth. this is the place to go in the financial district. \n\nnot sure which flavor to try, ask the cashier for a sample cup and try them out.", "author": "Isa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "This is the biggest Yoppi I've been to and has the most variety.\nThat's a good thing as the flavors are yummy.\nOnce though, the froyo dripped out which was nasty so beware of that and they don't have test cups, you have to use a spoon.....\n\nThis is our go to brand of froyo. Love that they change flavors regularly.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-10", "description": "Mmm, I'm eating my Yoppi froyo as I'm writing this review...\n\n45 cents is a little pricey for self-serve froyo, but Yoppi has atypical flavors I haven't seen elsewhere! On tap today was their original tart, green apple, French vanilla, chocolate, pink grapefruit, boysenberry, pumpkin, and yellow cake batter. Original tart is generally my favorite froyo flavor, but the one here is icy and could use a more tartness and creaminess. Other than that, their non-traditional flavors are great!\n\nYoppi has plenty of wet and dry toppings to choose from. Just when you think your decision-making is complete, you step up to the cash registers only to find out that you get to choose from five colorful spoons. Decisions, decisions... Which spoon color will go best with my mood and match my froyo? Ah, the simple pleasures in life!", "author": "Sylvia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-03", "description": "OH EM GEE. Pay-per-ounce froyo? YES PLEASE.\n\nI had often gotten frozen yogurt at other places and felt their prices were reasonable....until I came here. I have never paid over 2 dollars for my frozen yogurt and always have gotten as much as I needed. I love how you can choose how much you want to get that day and not have to have the pre-portioned sizes of other places. Also, this means adding multiple toppings, which is awesome because other places limit you to 1 or 2 before paying extra. Plus, they have every topping you can think of and some I never thought of. (rainbow mochi anyone??)\n\nPlus they rotate their flavors and you can vote on which one you want next week, so it is very customer-decision-run type of place. \n\nAvoid the weird orange balls...", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "45 cents for an ounce of yogurt is pretty steep compared to other yogurt shops but for being 1 block from work, I'll allow it. \n\nYoppi yogurt has a good selection ranging from regular non-tart yogurt (i.e. yellow cake batter) to tart yogurt (peach tart, etc.). Their toppings are always stocked and hellooo mangoes! They're always ripe and soft. I hate it when yogurt places put out mangoes that are hard and crunchy. Ew. \n\nAt times I wish they had a system like buy 12 cups of yogurt get 1 free but they have this other point system in place. Spend $50, get $5 free of yogurt. All you have to do is tell them your phone number everytime you purchase yogurt from them. Annoying? Kinda. \n\nDon't forget to vote for next week's flavors on their magnetic board by the cashiers!", "author": "Heidi C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-18", "description": "I have to say I think things have gone downhill. At my last visit the yogurt was super sweet and artificially flavored tasting...I didn't even finish it.", "author": "Romeo And Lola K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "I HEART YOPPI!!!  \n\nAlthough they change flavors every week, I always get the same thing (which must be the most popular because they always have the flavor)... YELLOW CAKE BATTER. Love it! That mixed with heath and cheesecake bites lightly drizzled with chocolate................ . Mmmmm.....!\n\nNote: Become party of their frequent customer program and you get a free $5 after so few visits. Def worth it!", "author": "Resa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-09", "description": "my 300th froyo review  is a shoutout to yoppi, a pioneer in high end soft serve froyo marketing. yoppi uses premium ingredients in their froyo and extraordinary array of better than average toppings (poppers).\n\nthis yoppi is facing first republic bank on the pine street side of 101 california.. yoppi's interior is dark beige and  yellow. there's some seating by the windows and some aluminum chairs and tables outside. \n\nmusic: instrumental\n\nfroyo avaiability:\n-classic chocolate: dense ghiradelli chocolate taste\n-french vanilla: out\n-strawberry bananae:lite strawberry taste with bananae prescene\n-yoppi signature tart\n-peanut butter\n-green apple tart: apple taste and tartness\n-pink grapefruit tart: taste like pink grapefruit juice\n-pecan praline:sweet, creamy, pecan nutty taste\n\npricing: self serve, .45 cents froyo and toppings. 25 dry toppings (usual chocolates, nuts, cereals, candies in hanging silos and sitting jars), 18 toppings in trays (poppers(4), mochi (2), jellies (2), fruits and crumbled cookies)., 5 kinds of sprinkles in a small trays, 5 syrups. \n\nfrodrips:\n-taylor froyo machines, yoppi customized cups\n-the froyo flavors present tasted pretty good, natural.\n-froyo texture creamy\n-go early to avoid the lines.\n-wacky wabbit wating: 5 stars. mikey will need to get a part time job so he can eat here.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "Yoppi is by far one of my favorite go-to's for frozen yogurt.  Find me here at least once a week or more (depending on how stressful my workload is). \n\nI've only been to 2 locations so far, but neither has ever disappointed (though each place varies in what toppings and yogurt flavors they offer).\n\nHowever, from what I've read/heard, this location is the best.  I concur.\n\n***\n\nWhat makes Yoppi more unique than most yogurt places?\n- They're environmentally friendly\n- They don't have tacky decors\n- They provide huge/tall topping dispensers\n- They're CLEAN\n- Their yogurt is so fresh/delicious that you'll still crave them on chilly days :)\n\nMy personal favorite: 1/2 vanilla yogurt + 1/2 chocolate yogurt with white chocolate chips, fresh strawberries, & toffee bits.\n\nYum.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-29", "description": "I had an epiphany. \n\nIf you have a semi-decent food business in the financial district, you will survive this dip in the economy. Why? Because business people like me... need food and fresh air outside of the sad gray cubes we sit in all day. \n\nYou have CHOICES at Yoppi. Yes, not the BEST but you have CHOICES.\n\nYou pick your flavor of fro-yo. You pick your toppings and HOW MUCH you want... and consume this yummy snack to your heart's desire.\n\nI love choices. I love fro-yo. I love YOPPI! \n\nWhy not 5 stars... some of their favors are weird, like yellow cake batter... gross.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "This place is horrible... for my diet! It's right down the street from work and everyday it's a temptation. Sigh! \n\nI do like that they have a variety of flavors to choose from as well as a voting board for the next featured flavor. I really like their peanut butter and definitely can't resist when they have it! \n\nThey always have their original tart, cake batter, vanilla, and chocolate. The rest of the flavors change out. 8 total flavors. I'm more sweet than tart, so this place works for me. \n\nToppings are almost limitless. There are SO many, it's ridiculous. \n\nThis place is pretty clean. Sometimes after a big rush, it's a mess but it's understandable. Get here a little before 3pm and you'll be ok. After 3pm, it's a long time. Obviously, everyone needs a Yoppi break sometime!\n\nThe only incident that I've seen was a rude cashier who wouldn't deal with a complaining customer. Not cool. Other than that, this place is a go to place any time! \n\nAnd if you come here a lot, give them your number. For every $50 you spend, you get $5 back. Not the best frequent buyer deal, but it's something so you can't complain too much.", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "Your solid, 4-star frozen-yogurt place.\n\nI think there's roughly 10 different flavors of froyo, and the usual toppings to choose from.\n\nThey charge by the weight here so its great that you can get a big or small of a froyo that you want.", "author": "Noah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-17", "description": "Mmm. Just had peanut butter, mint ( I had to put some green in there for St Patrick's day), and tart with ample toppings for $1.66.  They had about 8 flavors, and they have sample cups out for you to try them out. They also have over 12 toppings - reeses cups, granola, almonds, peanut butter cups, sprinkles, yogurt chips, etc and sauces. This might be bad news being so close to work, but I'm glad it's now there :) Also, they have 10% discount coupons next to the register (not like it makes a huge difference, but hey) and you can vote on next weeks flavor next to the register.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "Oh man, this stuff is good. I love the plain tart mixed with some cake batter.... and then the insanely weirdly delicious \"yogurt poppers\" on top. (They're these little pearl-like things that burst in your mouth and have flavoured liquid inside....better than they sound, really). \n\nIt's very clean, the people are nice, they have RAINBOW SPRINKLES.\n\nWhat's not to like? Except how fat my ass is going to get, considering this is around the corner from my office.", "author": "Brody .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "Frozen yogurt is my primary way of getting my calcium intake- I've never broken a bone so I know it works.  Yoppi Yogurt opened strategically smack dab right in the middle of my walking route from my place of work to my apartment so it's pretty hard to avoid. Although I often find myself actually going out of my way to stop in here on a regular basis even when  I'm not walking home- it's that good! \n\nYoppi has become my absolute favorite frozen yogurt shop. They have a multitude of rotating flavors and toppings to choose from.  Best of all it's self serve!! This is customization to the max for me!  No worries about annoying the employees when I try to divide my one topping into small amounts of three different toppings with each topping placed on a different flavor.  Now I have the sole authority of what my frozen yogurt cup will contain.  Be ware the cup sized are large and extra large.  The charge by the weight so they want you load it up!   \n\nThere is one incredible flavor is consistently available and that is my beloved, heavenly, desired cake batter! I don't know what it is about this flavor maybe it's the childhood flashbacks I get remembering when as I child I would try desperately to eat as much of the cake batter mix as I could before my mom was able to get the cake in the oven. With this cake batter frozen yogurt flavor it's like the taboo of eating raw cake batter has been released because suddenly it's actually OK for you to eat and maybe even healthy for you! Oh and the best part is that I think it's one of the low- fat or non- fat flavors but if it's not I don't want to know and who cares anyway! I can't get enough of this stuff!  \n\nThank goodness Yoppi has one of those preferred customer programs where you rack up the points with each purchase.  Except Yoppi does the preferred customer program right where they just store your phone number to keep track of your purchases.  This is great because who can ever save or find those little stamper cards.  At other frozen yogurt places I find myself frantically looking for my stamper card while my frozen yogurt melts on the scale.  Plus this is more green!  To top off the amazing experience you will have at Yoppi you get to pick the color of your spoon maybe you would like to coordinate with your outfit gotta love that!", "author": "Marlene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-12", "description": "I work equidistant from this Yoppi and the Yoppi on Sansome.. and... it's really hard to decide which one to frequent.\n\nThis place is bigger and has a wider range of flavors, which many people  may appreciate. About 8 flavors, compared to the Sansome location's 4. And they have this cute board where you get to vote for next week's flavors.\n\nOf course, like its Sansome counterpart, the yogurt is delicious, especially the plain tart. \n\nWhere this location loses to Sansome is in its topping--- just granola, that is-- but I am a huge fan of granola. The Sansome location has 3 or 4 choices of granola, including plain and other yummy ones like apple granola. This Yoppi only had granola.. am i a picky granola eater? maybe.\n\nOverall, I love it, as you can tell from the 5 stars I gave it. Don't forget to \"sign up\" for their frequent buyer program if they forget to ask you. They just track your purchases by your phone number. So no more having to remember which purse you put that stamp card in..", "author": "Saori E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-26", "description": "So as we're all aware, tart fro yo has hit the US hard.  Pinkberry, Tuttimelon, Red Mango and the like... but to be honest, the tart stuff tastes yucky to me.  I'll take plain old vanilla chocolate swirl, please.\n\nYoppi is the perfect solution to the fro yo paradox.  Catering to those with a tongue for tang, a variety of tart options are available.  But for the sweethearts like me, a number of classics (french vanilla, chocolate, mmm!) are also among the 8 flavors \"on tap.\"\n\nI love the \"self serve\" component of Yoppi as you can do exactly what you want to it.  Want to try every single topping?  No one is stopping you!  Want to mix pomegranate with peanut butter cups?  No one is going to judge you.  \n\nThe most dangerous part?  This place is at my bus stop at Pine and Front.  I have a feeling many mediocre days are going to end here!", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "My favorite self-service yogurt shop, hands down.  Not only do they have good selection of flavors, they have a plethora of toppings, which are always fresh and neatly organized.   I can't believe there are still places that don't even let you sample yogurt! \n\nDefinitely recommend!", "author": "NOEMI N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "Looooooove the cake batter flavor.\n\nLooooooove the Red Velvet Cake flavor even more (when they have it).\n\nLooooooove to vote for next week's flavor (right beside the cashier).\n\nLooooooove the frequent buyer reward program (just give them your phone number).", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-02", "description": "Yay for FINALLY opening!  I didn't like having to trek over to Rincon for frozen yogurt, and the stuff at Front Street Cafe isn't REAL fro yo (to me anyway).  And for being prego, I love the fact that I can get a healthy treat within a block :o). I started on their frequent yogurt buyer program at the Yoppi in Walnut Creek and even happpier I can continue it when I'm at work.\n\nLove all their tart flavors, and self serve toppings is the best.  No more asking, can you put a little more on there please?  The  only drawback is it's pretty easy to go overboard, my last trip cost me 6 bucks, tee hee.  But YAY I'm such a happy girl!", "author": "Riza A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-28", "description": "I've had better. It was too watery for my liking. The flavors are defintely explosive and too sweet. $.45 per ounce- which is expensive for fro-yo but considering I am in the financial district..They also had 6 or 8 flavors and tons of toppings. Beware of the toppings on the wall with the turning knob! I tried it and my cup was filled with LOTS of carob chips...\n\n I wouldn't go here again.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-30", "description": "Good yogurt, terrible customer service. I have been to this store about 6 times and each time I have to interact with the staff makes me not want to go back. Today was the last time. I had called ahead to find out if they have a certain flavor. The recording said they did so I walked all the way there only to find out they didn't have the flavor the recording said they did. I asked the woman behind the counter, \"Your recording said you have peanut butter but it seems you don't, did you have it earlier today.\" Staff person barked, \"no.\" I asked, \"Do you update your recording,\" staff person barks again, \"no.\"  A product has to be exceptional for me to subject myself to this level of customer service...or lack there of. Both the live person and the recording provided poor customer service and therefore I will not be going back.", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "Why must this place be open across from my office?  It's bad enough I can see it from my window tempting me everyday, I can't even get some exercise getting there!  \n\nI love the red velvet cake and their occasional non-dairy yogurt.  I also love the bursting balls FUN!", "author": "Yun C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-23", "description": "This place has the best STRAWBERRY-flavored frozen yogurt that I have ever had...it literally tastes like I'm eating a bowl of frozen strawberry Yoplait creamy bliss...sooo creamy & yummy...the strangers who were sample-tasting it alongside me were like \"got DAYUMM...that's good!\"\n\n...But on the other hand this place is suuuuper expensive...especially if you're used to Yogurtland prices like I am....", "author": "Always H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "45 cents an ounce isn't a bad deal. Especially when you get to choose flavors and toppings.\n\nI like this place. It's cute and yummy. I tried the coconut yogurt. It really tasted like coconut and it was really good. It did leave a funny aftertaste in my mouth, which is why I took off one star. \n\nI'm still waiting for taro. They change their flavors really often and you can vote for next weeks flavors. I voted for taro a few weeks back. Taro wasn't up for voting this time.  :( but pina colada was!", "author": "Analisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Great selection of flavors and toppings!\n\nI was a regular Yoppi customer for a while. I went there almost once a week when I was working in the neighborhood. It's a surprise that I haven't reviewed them until now. It was conveniently on the way for me during my really short lunch break so I loved to stop by for a quick froyo break. There were always new flavors for me to try every time. Some of the cool flavors included: grapefruit, peach, mint, etc.. I almost always ended up with my favorite combo of original tart and chocolate with chocolate sprinkles. Never failed me : )\n\nI'll visit again when I'm in the neighborhood!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-26", "description": "Love this location!  It is better than the one on Montgomery St and the one on Clay Street.  Bigger, more yogurt flavors (8 different flavors), more seats, more topping choices and cleaner.  \n\nYogurt flavors change every week and you can able to vote your favorite flavor for next week :-)", "author": "Liza T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "Self-serve = genius. \nChoose your fro-yo flavor (after samples), choose your own toppings. The liberalization of choice allows you to make your fro-yo exactly how you want it. I go so often that the girl behind the counter asked me if I worked nearby.  \n\nDon't forget about the free wifi (you have to ask the people at the counter for the wifi code). \n\nAlso, if you go around closing time on Friday, you might be able to get some free froyo since they have to empty the machines to clean them (they're sadly closed on the weekends).", "author": "Connie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "I LOVE LOVE this concept of Frozen Yogurt! I like the self serve with the mixing and matching of flavors as well as toppings. When I just want a small serving- I can get fro yo for less than a Starbucks latte with a fixings of fresh fruit toppings. And when I REALLLLLY need my fro yo fix- I can get a large one for around $5 to $6. That is pretty much what it costs for a small at many of the other frozen yogurt shops in San Francisco with just one or 2 toppings. \n\nI am only giving 4 STARS because of the line and the slow service when checking out. There have been times that I have had to wait 10 minutes to pay- ok my yogurt is MELTING and I am standing in the long line as my deliciousness is such a tease as I watch it melt. \n\nI visit Yoppi regularly and it is a great 3pm break from the office to get my sugar fix- especially on a nice day!!", "author": "Kimberly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "Of the 3 Yoppi Yogurts in FiDi, this location has the most flavours - 8 of them - to choose from.\n\nObviously, I sampled them all before buying. Their original tart, chocolate, cappuccino, and yellow cake batter are fan-tabulous! They tasted creamy but are supposedly non-fat (at least according to the nutritional info on their website). I'd skip any of the sugar-free options though - unless you actually like the taste of diet sodas...", "author": "Steph L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-05", "description": "HORRIBLE CUSTOMER SERVICE!!! I've been here a few times but the last was definitely the worst ever.  They have a decent selection of yogurt but the customer service is horrible.The workers have a bad attitude and really don't want to help you do anything.  I rather spend my money on a real yogurt place that appreciates my business.", "author": "H M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-25", "description": "I love chocolate. Chocolate makes the world go round for me, and it can cure all ills. But I like my chocolate rich and creamy, which is why I never developed much of a taste for frozen yogurt.  I know it's all the rage now, and it's healthier than ice cream, but unless\nyou can make yogurt as creamy and rich-tasting as ice cream, you ain't getting much business from me. And unfortunately, Yoppi's chocolate-flavored yogurt falls short, just like all the other fro yo places I've tried. Sorry, Yoppi, you get one star for flavor choices (the cheesecake flavor and yellow cake batter flavor are unusual) and another star just because I don't dislike you enough to give you just one star.", "author": "Meg P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "I love how many flavors they have here, and they're all pretty tasty. Probably one of my favorite fro yo places in SF... so many of them just have a weird ambiance and/or limited flavor options each day.  Plus they post their nutritional information online which I always appreciate.", "author": "Richa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-25", "description": "Several things.  First of all, I found this place quite difficult to locate.  I even called to see where exactly they were located.  Yes, they are at 101 California, but i didn't realize that i had to scale the walls of the 101 California to locate this.  I finally found it. It was okay.  I mean, it's one of the closest locations to my work that offers the traditional self-serve froyo.  They had some okay flavors but i felt that their toppings were quite limited.  And maybe i came in on a really off day, but their staff wasn't very friendly.  They do not have a frequent buyer card.  They do have something similar... they track it with your phone number.  Its:  Spend $50.00 and get a $5.00 gift certificate.  Really?  FIFTY DOLLARS?!?  \n\nProbably the best thing is that i found a booming Plant Cafe located next to it.  Nice to see another Plant Cafe option other than the Pier 3 location.  \n\nWhat can i say, i love froyo... i'll go back.", "author": "Brenda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "I had a 2:30pm craving for sweets at work a few weeks ago, and lucky for me...Yoppi's is just a few blocks away.  I like that they have the taster cups out and you don't have to ask for them.  I hate feeling like I am being judged when I ask for multiple taster cups...who cares if I want to try it all before i buy a bucket size cup to eat!!!???\n\nGreat flavors, and good selections of toppings, but I was bummed that they didn't have rainbow sprinkles...I like each bite of fro-yo to be filled with a large does of rainbow tastiness....i went with the chocolate ones, but it was then the same.  But, it all hit the spot, non the less!", "author": "Kelsey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-17", "description": "Decent.   Priced by weight.   Good variety of mix inns and toppings.   They also have a reward program.", "author": "Price L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "Yoppi, to me, doesn't really stick out from the abundance of fro-yo places that have sprung up in the last couple of years in the bay area.\n\nIt's a pay by weight fro-yo.  The flavors that I found were pretty standard: Tart, mango, blueberry, vanilla, chocolate.\n\nUnlike yogurtland, there weren't very many 'unique' flavors like taro or green tea.\n\nI had the yellow cake batter, which was probably the best out of the 3.  Also they had like 2 kinds of  mochi, plain colored and multi-colored.\n\nThere is very limited seating inside, a couple of tables and a 'bar' type seating to sit at.\n\nMajority of the people here are on their break for some fro-yo in the fidi.\n\nYoppi doesn't really stick out as unique, but it isn't horrible.", "author": "Kameron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "Woo hoo! Finally a self serve yogurt place ONE block from my work! At 45 cent an oz, it's not as cheap as Irving street but it is decent.  Out of all the flavor I actually only like Pomegranate tart. It has enough tartness without being overly sour. The rest of the flavors like vanilla, chocolate, cake batter etc. just taste too sweet and fatty. Wish they had more fruity flavors. Yoppi has most of the add ins like regular mochi, multi colored/flavored mochi, fresh fruit, cereal, and other chocolaty toppings. Their fresh strawberries actually taste really fresh and sweet.\n\n4 stars in my book because of location and good taste. Minus 1 point for long lines and lack of fruity flavors. (By the way, I usually wait for the line to die down before I fill my cup because I don't want soup by the time im done paying. Just a tip yall).", "author": "Terry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-06", "description": "Had the 'Yellow Cake Batter' and 'Cappuccino' flavors and they were rich and delicious. No artificial taste. The topping selection was one of the most expansive I've seen in the bay area. \n\nPlus you get to vote on the next weeks flavors on a board right in the store. We're going back for the peanut butter next week...", "author": "Jen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "Who says you can't have cookies and cream froyo for lunch? Not me.\n\nJust like their other locations, tons of amazing flavors, all you can sample samples (a theory tested and validated), and clever little bonuses like a board asking customers to choose a flavor of the week. \n\nIs all the above an option?", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-16", "description": "Not bad I guess, but I still prefer Yogurtland or Pinkberry for sure. It is 45 cents an oz and there are tons of toppings available. I basically only like tart, but the consistency of the yogurt at Yoppi was a little too watery for my liking. It wasn't too tart or too sweet which I liked. The fresh mangoes and strawberries were ripe so that was a plus. They even having popping yakult boba here which I was very surprised about!", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-25", "description": "It's not really good. There's definitely better yogurt places than this. Not sweet very bland. But my friends enjoyed it. I guess it depends on the flavor of yogurt and the toppings.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "I am here way way too much. The cake batter is excellent. Add some waffle cone bits and a few shavings of white chocolate and you have a definite sweet tooth winner.", "author": "Dan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "for nearly two years this spot has been my go to for all things yogurt.  When I;m outta town and I crave frozen yogurt, and I get some, I always go, this ain't yoppi,", "author": "a k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-16", "description": "This is just for convenience but I still prefer the Miam Miam over in Oakland. They have organic frozen yogurt which I prefer because they only use fruit of the current season. I've only been here twice and the staff wasn't very friendly. I'll still come here but will prefer Miam Miam any day!", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "I had hit the 3:30 slump in the work day. It was time for fro-yo.\n\nWalked over to Yoppi Yogurt with the co-workers and was immediately impressed. Originally we had been going to IceeBee, and it was always the same flavors and nothing really special.\n\nYoppi was great! First off, the decorations were refreshing and inviting. There were about 8 flavors to chose from, and one of my only standards for frozen yogurt is that I always have to get raspberry/boysenberry or some tart-y fruit one. Yoppi had the best kind!\n\nAlong with that, they had some fantastic toppings! sour gummies, m&m's, anything you could think of.\n\nGreat place! will definitely be going back!", "author": "Jenna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "yay! so happy they opened up this place in my building! Now I will be spending an exhorbitant amount of money on FroYo. At least this is better for me than ice cream, right? I've already spent enough to get the $5 credit after buying $50 in yogurt.\n\nThe place is always very clean. They are quick to replenish toppings, and the flavors rotate frequently to keep things exciting. The only reason they don't get five stars is the line can get pretty long in the afternoons, and they are a tiny bit slow at the cashier. maybe it's their computer, idk, but I've decided to forego on a few occasions when I see the line is more than 8-10 customers deep. So far that's happened twice since they opened a month ago.\n\nOverall, this will be one hopping place come summertime!", "author": "Jen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-22", "description": "What a load of artificial and sugar loaded junk. Brush your teeth. You'll probably also want to brush your tongue after tasting.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "I shouldn't be eating this for lunch, but it's so good. I'm glad I can get my fix with just $2. This place is clean with a good variety of flavors, toppings and sauces. They also have a frequent buyer program which is a plus.", "author": "Clar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-23", "description": "I loooove Yoppi Yogurt! First of all they have an adorable logo/cartoon thing to represent their cuteness inside the yogurt shop.  Second, they have a pretty big variety of flavors both tart and savory (I'm a tart fan my self.)  And third, they let you vote for flavors for the next week by using cool buttons on a wall!  Price is average/the same for froyo in SF and although this location isn't exactly close to my office, I think I'm starting to favor their fresh and tart flavors and am willing to take a walk to get to it!", "author": "Tracy N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-18", "description": "Would someone please open another one nearby with the following flavors:  Coffee, Peanut butter, Chocolate.\n\nEach week this place takes a tally for what ONE new flavor they MIGHT bring in next week.  Over the last three months, the most votes ever registered were for Coffee and Peanut butter.  And they had us vote for those on the same week. Instead of bringing both flavors in, they only brought in peanut butter for five days.  They  still have not carried coffee.   They carry 8 flavors at a time, nearly all of them belonging to the pineapple sherbert  family. \n\nLong live peanut butter, and show us your coffee.", "author": "A K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "I'm not a real frozen yogurt nut but I think this place is great! \n\nEasy in, easy out, no muss, no fuss, self serve. The flavors are great, I'm usually a chocolate and vanilla swirl guy. I know- boring; but, at this place I throw in a lot of the cake batter flavor. There are lots of other really interesting flavors as well.\n\nFor those that like to sit and eat, there's plenty of seating both inside and out. \n\n There are two cashiers and when they're busy you get out almost as quickly as you can fill your container. It hits the spot when I have an afternoon snack attack.", "author": "Jim L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-20", "description": "LOVE LOVE LOVE Yoppi!! But I'm a little disappointed in the customer service and the cheapness.  For instance, today I went with two gal pals and one of my friends was a Yoppi virgin and I was disappointed that you had to go to the front counter to ask for little tester cups! Come on man! Also, when I asked where they were (obviously a new development) the lady that was cleaning the machines flicked water on my from her cleaning cloth and just grunted and pointed. SIGH its my fav place but the experience was kinda SAID....", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "Best Fro Yo I've ever had. By far better quality than Yogurtland in LA. Thick, creamy, and most importantly, the flavor never seems to fade. Every bite tasted just like the first, godly. I recommend the red velvet and coconut. Cold, creamy bliss.", "author": "Ra N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-26", "description": "You got that second register, your pineapple and grapefruit tart are delicious.  Well done Yoppi.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "WOW!\n\nMy co-workers were raving about Yoppi Yogurt for months so today I tried it and now I'm hooked. Staff was extremely nice in helping me pick a froyo. I feel with the selection of froyo and toppings I'll never get bored.. \n\nI highly recommend this place!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-10", "description": "I had a meeting in the 101 California building a couple weeks ago and stumbled onto this place.   I've had self serve yogurt at a couple different places and their mixture is by far my favorite.   None of the cheap stuff here.   For a quick and relatively healthy treat...done deal.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-10", "description": "Found this place on yelp while looking for something with more choices than YoCup (and hopefully cheaper).  The yogurt isn't quite as good as other places I've been, but not bad, and I love having a ton of flavors & toppings to pick from.  Now, if only I was better at picking what I want instead of putting a little bit of everything on and paying 5 bucks for a cup of yogurt!  If you're looking to save money, this probably isn't the place for you, but if you like lots of choices, it's the perfect place to go.", "author": "Shaun K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "I'd say this is in fact as good as it gets for frozen yogurt: many flavors and do it yourself, with a frequent-customer-program (spend $50 and get a free one... I'm a sucker for those types of things)\n\nThey have 8 flavors (maybe 10? I think it's 8) and tons of toppings.  Also, the flavors are 2 per machine, but then there is a third handle in the middle where there is a swirl of the two flavors, great idea.  They also switch the flavors up while always keeping vanilla and chocolate.\n\nI'd say their only downfall is that the cups are huge, which tricks you into thinking that you need more than you actually do. Oh well, smart move on their part.", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-30", "description": "I have no complaints about the yogurt or the toppings. I like the flavors they have, I like that it's soft instead of super hard and the toppings and self-service are excellent.\n\nMy issues with this place are with their logistics. Checking out is pretty slow even when nobody's waiting. Perhaps it's the \"remove it from the scale\" step coupled with everyone giving their phone numbers and paying with a credit cards (really, people keep $5 in cash in your wallet and stop nickel-and-diming small businesses) but it can take a while. Multiply that by 15 people in line in front of you and it's a nightmare. You stand there for 10 minutes+ with melting yogurt that you can't eat because it's sold by weight so once you finally pay you have melted yogurt with soggy toppings.\n\nI'd give it 4 stars when it's not busy and 2 when it is. At this point if I peek in and there's many more than 5 people in line I skip it.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-18", "description": "A perfect afternoon fix! Awesome flavor and toping selection. Everything is so fresh too!", "author": "M Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-19", "description": "Made the mistake, yes, mistake of purchasing GroupOn Coupons for Yoppi.  Tried to use and was told only good at the place several blocks away.  Go there, that location has closed!  Mentioned I had a free card when visiting the 101 Cal location on another occasion and was told, oh, bring it here, we'll honor.  Today, went back, created a lovely looking treat and as soon as I took the card out of my wallet, was told We Don't Take That Card Here.  WHAT?!! The other day I was told you did.  Get your story straight people! Have to agree w/ the reviews that THE CUSTOMER SERVICE IS TERRIBLE and I will not be going back.  Left my treat on the counter and walked out for the last time.", "author": "Kerrie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-30", "description": "A new yogurt joint opening up close to home...!  Looking forward to it...", "author": "Burrito M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "Yogen Fruz who??? Any place that has yellow cake batter flavored frozen yogurt is automatically my favorite. They say it's non-fat but I have a feeling it's the same premise as the Seinfeld episode (where everyone was loving the non-fat yogurt place but, after lab testing, it wasn't non-fat at all) but who cares, it's delicious and you can go topping crazy! I'm pretty sure it's better alternative than a McDonald's sundae, as long as you don't go too hogwild on the toppings which is hard to do, they have so many options! Cereal, sprinkles, graham cracker crumbs, these little fruit flavored explosions. This place makes me appreciate my work surroundings that much more.", "author": "Tatiana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-21", "description": "Excellent selection of flavors and toppings (love the little juice beads).  I also love the fact that you can control your portion size.  The only complaint I have is the fact that they only have one register.  The line got long, quick.", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "Love the yogurt at this place.  The best-looking self-serve froyo place I've seen.  Love the sample cups and the tart flavors.  I suspect that the voting board has very little to do with which flavors they pick each week, but thats good because every time I'm in there green apple tart has no votes and they had it this week! (yay!)  I wish they had sig tart plus 2 other tart flavors at all times.  I also think its annoying that you have to remove the cup from the scale in order to find out how much it costs AND using the phone numbers to keep track of purchases is a bad idea.  Thats a pretty long string of numbers to type in and folks don't exactly love giving out their phone numbers.  But none of that will stop me from coming here.  How bout opening some stores NOT in the financial district, though, that are open on weekends too.", "author": "Maureen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-10", "description": "The place is huge, clean and the tart flavors are good.  I would give them a higher rating but I think something's wrong with their scales.  I pretty much get the same amount each time but it jumps from $2 to over $4 every other time.  They have this annoying thing where they keep reminding you to take the yogurt off the scale - please put up a sign or something - I think it would save the staff from having to repeat the same thing to every customer.", "author": "Nin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "Stopped by today after lunch today and had a bowl of Signature Tart and Mango Tart. It's much more sour that how I usually like my yogurt. I was a bit confused at first by how the pricing works - basically they weigh the bowl (at 45 cents per ounce). My bowl today sets me back $3.50, not too shabby being a little picker-upper for Monday.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-08", "description": "Alright. I'll admit it.  A decent portion of my paycheck is allocated for frozen yogurt.  I'd like to think I'm an afficionado rather than an addict, and Yoppi is definitely at the top of my list.  They have 8 different flavors(5 of which rotate out on a weekly basis) and a wide variety of toppings, so there's something for everyone.  Yoppi is best known for their yellow cake batter fro yo, so if it's your first time here, you MUST try it!", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "God damn, the yellow cake batter and cheesecake are to die for.  I like that they charge by-the-weight, so if you need just a little something sweet in the afternoon, you dont have to pay a lot.", "author": "brewgirl b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-12", "description": "I'm only going to rate one flavor because that was the best flavor that I chose for today, which is their classic chocolate.  I am a fiend on sourness so most of the condiments were out of the question because I wanted something really sour.   I just grabbed some strawberry and kiwi.  Personally, I think this flavor can stand out on its own without the condiments . It's 45 cent per ounce.  I am curious about the ingredients in the yogurt.", "author": "pengrin .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "Yummy Yoppi yogurt!!!  I love the self-serve aspect; let's me try a little of everything.  Loved the topping of the mango-flavored caviar thingies.  So good with the mango and regular tart yogurt.  Definitely worth checking out!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-20", "description": "This review makes me sad but it must be done. I was a regular at Yogi, often going 2-3x/week.  Unfortunately the increasing rudeness of the main store staffer has curtailed my visits.  Perhaps the manager, you'll recognize her immediately she the one who looks full time miserable and always there.   She hates Yoppi, her life, and most of all you.  Consistently nasty and rude she behavior hit a new low last week when at 5:55pm she came up behind me and mumbled \"We're closing, get out \". I thought I must have misheard her, but then she repeated the same message hateful tone and all to the other group of customers.  How can someone surrounded by yummy candy treats be so unhappy?", "author": "lisa g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "Holy cow, I just had the most delicious banana frozen yogurt, topped with Reese's Peanut Butter Cup crumbles!  Every flavor I sampled was great, and really tasted like what it was - such as the Red Velvet Cake and the Yellow Cake Mix.  This was my first visit to Yoppi, and I will definitely be going back.  The price is good and the yogurt is only 100 calories per 4 oz serving.  And they change the flavors up every week!", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "I am a fro-yo fan and I love this place! They charge by weight, I think something like 45 cents per ounce. They have great flavors that you can vote on weekly and I always find something new and delicious. Oh and they also have a great assortment of toppings! Today I had white chocolate raspberry and chocolate fro-yo with nuts and chocolate chips. Definitely a great escape from my computer!", "author": "Cherie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "Had the yellow cake batter on their first day open.  A fairly generous helping for under $3. Working so close to it could be dangerous.", "author": "L. Renee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "I love Yoppi!  I go there nearly every single day, since they are in my building.  It is my guilt-free pleasure.  The cake batter flavor is wonderful, especially if you add a dolop of French vanilla, chocolate and sprinkle it with cake sprinkles.  Unlike what someone else said, I like the little orange ball toppings.  They are called \"fruit caviar\" and give a little burst of fruit flavor when you chew them.  I wish they didn't have Red Velvet at the same time as they have chocolate because the flavors are identical and they'd have room for another flavor if they omitted it, but that's a small thing compared to the yumminess of the experience.", "author": "Jo Anne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-18", "description": "This place is good.  I tried their signature tart which was amazing.  I also loved the yellow cake batter, that's right -- yellow cake batter frozen yogurt!!  It hit the spot for my sweet tooth and I'll definitely go back.  I wish they'd drop the 45 cent an ounce price and help out my recession wallet.", "author": "Cabo G."}
