{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Yukol is my neighborhood Thai takeout place. They're always super nice and on time with pickup orders. The spring rolls are delicious, and I usually either get pineapple fried rice or pad see ew with tofu. \n\nNote: Pad See Ew is not on the menu, but they can definitely make it for you!", "author": "Alison Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "We stopped by randomly on a Tuesday night. The food was delicious and the service attentive. We had #19, chicken and prawns with mushrooms and bell peppers, a curry dish with beef, and shared a soup. All that plus a side of rice and a Thai beer added up to $47. \n\nThe most memorable part was when our waitress said she'd worked there since she was 15. I'm guessing that was almost 20 years ago. Astonishing. Impressive. I hope this means they treat the employees well!", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "My sister from NY was Airbnb-ing it in the area and decided to give this place a try since my niece is a huge Thai fan. Flash forward one year and countless visits from both my NY local Bay Area family and let's just say we go out of our way to eat here as much as we can! For appetizers we order the Poh Pier Tod #1, the Garden Rolls #14, the Satay #2, and the Katong Thong #8. Honestly, we could probably get full of these appetizers and end our day BUT their dishes are to die for too. Our go to dish every time we visit is the #21 Pad Kee Maou and ask for it medium spicy or spicy if you yourself is feeling spicy! For the less adventurous, #37 is essentially a Thai dish similar to Beef and Broccoli and tasty as well. \nHonestly, you can't go wrong at this place...plus the waiters and waitresses are so kind and helpful with suggestions based on what you like and don't like!", "author": "Vanessa O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "My hubby and I had dinner at this place since it was within walking distance of our hotel when we stayed in the city for a couple days.  We came around 6 and it was not crowded yet and very small and cute.  We order the following #9 angel wings, #37 Chinese w broccoli with beef and # 68 assorted veggies pineapple tofu tomatoes in sweet and sour sauce song with some steamed rice.  The chicken wings came out and it was stuffed with something but wow I really liked it and I liked all the veggies and noodles it came with. I have to admit when our main entrees came out we practically devoured the Chinese broccoli with beef dish. I so would come back for just that alone!  The sweet and sour dish was just ok to me as I felt like it was too sweet for me but I still ate it. Our waitress always kept our glasses of water topped off and she checked on us just enough too. We ended up sharing dessert with was fried banana and coconut ice cream!  Wow that dish was more than enough for the both of us and the best way to end a good dinner too.  I definitely will be back to this place if ever in the area again.  Oh and as we were finishing up the crowd started coming in as well as lots of to go order pickups around 7 as it starts to get noisy and crowded.", "author": "Tanya M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-11", "description": "They refuse to take my order I'm not sure why call me back said it's 20 bucks for something that is clearly not there's something wrong with this place", "author": "Bobbi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "A fun dinner outing after a day of tailgating/bar hopping in the marina\n\nPrices are fair\nPortions are good\nFlavors are robust \nVariety is definitely not a problem\n\nOverall Thoughts\n\nWould come back the next time I was in the area and needed a bite", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Yukol is the best thai food I have had hands down ever. I don't even like Thai food and this place has me addicted. The spring rolls are fresh. The yellow curry is divine. Tom Kha soup is awesome. Their rice could be slightly better but Im not complaining.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Randomly decided to try this place out and was surprisingly surprised my how good everything was! When we walked in on a Saturday night the restaurant was empty but we decided to try it anyways. We noticed a lot of pick up orders and soon after it began to fill out. Im glad we decided to stay and try it out. Probably my favorite Thai spot in SF. \n\nHighly recommend:\n- Tom yum seafood soup- sweet, spicy and sour with bold flavors and lots of shrimp and mushroom\n- Roti and curry dipping sauce- almost pancake like roti with a good crispy to the bite, curry sauce was delicious and had some bits of meat and potato. We had to ask for a second sauce bowl because it was so good!\n- grilled pork with house made spicy sauce - the pork was thinly sliced and grilled perfectly but the sauce was the home runner!", "author": "Judy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "I can't believe this place is not on my radar. It's located on a weird stretch of Lumbard so it's not very busy, but the food here is excellent. We started with the appetizer special, the you and me. It's basically a fried spring roll that's wrapped in steamed rice roll. The texture is amazing and the filling is flavorful. It's definitely a must order. \n\nI got the pad Thai while my friend the pad see ew\n- both were very good. There's plenty of meat and tofu in my dish. \n\nI can't wait to come back and try their other dishes. The service was attentive and our water was filled regularly. Me like!", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Best Thai food in SF! We order from Yukol at least once a week. Friendly service and delicious food. Highly recommend!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Yukol Place is my go-to Thai spot in San Francisco. Trust me, I have tried the green curry at pretty much every place north of Market. The green curry comes piping hot (this is really important to me), great spicy heat (pretty spicy, but not uncomfortable), and the chicken is high quality. I have tried with beef too and would probably get it again. \n\nOther things I have had:\n\nThe #62 soup - it's delicious, but I think it was a bit lemony for me or maybe was too much salt. Hard to tell - I give it a 3/5 and worth trying if you love Thai soup, but not something I would order over the pad see ew or the green curry. \n\nPad See Ew - not on the menu, but it's a classic Thai dish that they can make and it's also the best in the city (my opinion). I have had the green curry and pad see ew at Lemongrass and it's just not quite on the same level as Yukol Place. \n\nGreat wait staff that pours you enough Thai Tea to put you in the stratosphere. Ambiance in there is very old school zen. \n\nP.S. if you google some of the top Thai places in SF, you'll come across Kin Khao which is delicious, but I waited over an hour and every dish was over $25. It's not somewhere I would rush back to. However, if you don't mind spending a little extra and you can get a reservation on open table, you will enjoy, but I don't think it's better than Yukol. Yukol is much more traditional and it's everything you want in a Thai restaurant.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "After a great Yelp Elite event on Wed. night I decided to grab some late night eats near my house and was \"feelin\" some noodles. I'd never been to Yokol before but, have driven/walked past it a million times so I figured why the heck not. My order was pretty close to their \"quittin time\" so, I took my food to go and ate at the neighboring bar, Monohans. \n\nMy order (chicken pad thai, cucumber salad) took all of 5 mins to prep (one of the many reasons I love Thai food) and it was piping hot when I opened it. I started with the salad and found their traditional dressing to be pretty good. Let's be honest, it's sugar, vinegar, and lime juice. Yum. The pad thai was cooked really well and the noodles were really comforting. I'm usually not a huge fan of tofu but, that was also solid. I'm aware that pad thai is probably the most \"gringo\" order at a Thai restaurant but, it's an easy go to and tough to screw up. \n\nAll in all, it's a good option for cheap eats in the Marina area. I believe my total bill was around $15 bucks, so you can't beat that. The service was friendly and seems like it's a family run spot. I'll be back...", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Thai food here is amazing and authentic, I got take out from here that took a little longer than expected but totally worth it! Service was great and all the staffs we dealt with were super friendly. Food is reasonably priced and portioned. Atmosphere was calm and inviting, definitely would come again for a sit down!", "author": "Dara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Some of the best Thai I've had in the city. Kind service, warm atmosphere. Will definitely return", "author": "Jesse T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-07", "description": "The food was good,but not the best Thai... the House of Thai was amazing!!! I ordered 4 dishes and it came out to be over $60.  Not worth trying this place again...  like I said, after eating at The House of Thai, it's hard to beat that place!  I am Asian so I know my Asian food! \n\n-papaya salad was pretty good here. \n-pad se ew, just ok... had it better in other places\n- soup, meh\n- brown rice... weird bore. Rice that I was charged $5\n-duck, good but small portion for the price. \n\nOverall the portions doesn't add up to the cost of their dishes and it kind of lacks authentic taste.  Go to House of Thai!  Food is amazing and not overly price.", "author": "KendraHA B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "The best Thai place I've had in San Francisco so far. The food is sophisticated and one notch above your regular Thai restaurant. Fresh ingredients and good service. This restaurant is a little gem in the neighborhood. It is usually not very crowded and seating is quick. Furthermore, they do delivery for $1 if you live close by. Highly recommend!", "author": "Sugar S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Great Thai food and very friendly staff. The green curry is fantastic, as is the pad kee mao.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "We ordered take out last night and the food was fantastic.\nVERY flavorful  I would give five stars but the website needs work and when we ordered, i learned there were other options that I didn't see online. But the food was delicious and the guy on the phone was helpful and courteous. We will definitely order from here again.", "author": "susan a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Only live three blocks away and have never been. It was terrific. It was very tasty and good. Great service. I had an entree, brown rice and a beer and it came to $22.00\n\nI will definitely go back.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Very good restaurant ! \nThe waitresses are more than nice. I spent two nights in SF and we ate there every dinner.", "author": "Léa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "We were a party of 11 on a busy Saturday evening and the service was fantastic, and the food absolutely delicious! Nice wine and beer selection as well. Thank you Yukol Place!", "author": "Monique H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "One of my favorite Thai places in SF. The red curry is my goto dish and if you're carbo-loading go for the Roti bread too. The staff here are among some of the nicest people.", "author": "Marwan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Great Thai Food in Cow Hollow neighborhood... SF Marina area.  Nice place, great service.", "author": "F A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Simply fabulous.  Thank you for being open and feeding us so well late on a Friday night!", "author": "Ali L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "THE BEST THAI FOOD I HAVE EVER HAD in my life yet!!\n\nOn one of my last days in San Francisco, I was getting a little homesick and a little worn from walking, traveling, and etc. I decided to go for the Thai restaurant right next to my hotel on Lombard Street, and I am sooo happy that I did!!\n\nWe first received a complimentary salad - I loved the slightly sweet vinaigrette on it!! It was a very simple salad with nuts, but the vinaigrette made it special.\n\nI also had the You and Me Spring Rolls! This is very, very similar to a dim sum dish in which basically a steam roll skin is wrapped outside of a regular spring roll. This gives more texture/distinction with the soft and fluffy skin of the steam roll and the crunch of a spring roll! I would say that this is one of the must-trys, although a little bit pricy for what it is.\n\nAnother appetizer we had is the duck larb (cooked in chilli pepper, onions, fresh mint leaves, and lime dressing with a touch of rice powder). Oh my, this is probably one of the best dishes I have ever had in my life. The duck skin was crispy, crunchy, and the meat was incredibly tender. The dish was just full of herbs, spices and was savory - a true appetizer in the sense that it completely \"open your stomach and appetite.\" This is a must try from this restaurant.\n\nI also ordered the Tom Yum Goong (Spicy and sour prawn soup with mushroom, onion, lemongrass, slices of tomatoes and lemon leaves). This was very surprising because I was expecting the thick, coconuty type of soup base, but this is very light and without the coconut flavor. It still retained the spicy and sour essences of Thai food.\n\nOn top of the food, the service was excellent. I felt like I was having a three course meal with the server bringing salad, appetizer, and then entrees out timely.\n\nI want to go back to San Fran to go to this place again :(", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Searching for dinner before our movie we picked this restaurant based on previous Yelpers. Could not have been happier we did. \n\nService was amazing, friendly and prompt. The restaurant was nicely decorated, very clean, and extremely well-kept given the building age. \n\nFood was fab-u-lous. We had the Panang Chicken Curry and Chili Garlic Beef - housemade chili sauce is a must try. Presentation, prep, and quality was amazing -very apparent it was all made from scratch with fresh ingredients.", "author": "Jocelyn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "A friend and I were craving Thai so we decided to give this place a try. To sum it up, food was 3 stars but service was 5.\nThe pad thai was prettily presented and our food came out quickly, which was important because we were famished. But my dish, #20, was flavored like a garlicky diluted ketchup and the chicken was a bit dry. I would recommend trying a different dish.", "author": "Tina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "Highly recommend. Satay and a shrimp appetizer was great. Service was great. Food was fresh and delicious.", "author": "D C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Super fast delivery + ah-mazing food! My favorites are pumpkin curry with vegetables and their crispy egg rolls. I could eat these two for the rest of my life!!", "author": "Hande D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "Very good service and food. Setting is very nice and relaxing. Love the beef satay, the fish cakes, and the cashew chicken. Not very crowded but lots of take out orders. Many other restaurants could learn from the attentive and friendly service offered at this place.", "author": "R T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "I hated to be one of those last minutes customers coming in before closing time. But I was one of them yesterday night. Thankful that they welcomed us in without hesitation. \n\nI ordered a Beef Pad Krapao with a side of rice. Loved the way the beef tasted with the sauté sauce. It comes mildly spicy (although I would want it extra spicy but my fiancé can not handle any sort of spice) but it tasted good nonetheless! And of course we had to try their Pad Thai too. Loved how it was a great sharing portion and importantly, it tasted amazing! The waitresses were extremely nice. Loved the atmosphere inside. I would definitely come back to try other things on the menu, but not near closing hours next time lol.", "author": "Kim F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-25", "description": "Good option whenever looking to get diner on a busy night without reservations anyplace else.  Food is consistently good and service even better.  While not the best Thai  I have had it is definitely acceptable.  Spring Rolls where made in house (amazing how often they are not, be sure to always ask).  We didn't have desert but they did have several interesting options which for some reason surprised us.", "author": "Nick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Yukon Place Thai was very good. The waitresses were very attentive and accommodating. I love Thai food and the aromas of the spices but unfortunately I can't hang...  the waitress made sure to have the kitchen prep our order with milder spice. The dishes came out with the perfect amount of spice that I can tolerate but I was still sweating and had to take mini breaks. \n\nI have been craving egg rolls so my friend and I ordered #1 which had shrimp, ground pork, silver noodles and veggies. They served them on a bed of shredded cabbage and carrots with sweet chili sauce. It definitely fulfilled my cravings. We also ordered the coconut milk and chicken soup which has mushrooms, ginger and lemongrass served in a clay pot. The coconut soup broth was smooth in texture and was so flavorful. My friend had been craving green curry which we also requested on the milder side. She loved it. I had a couple bites and it was delicious. \n\nThank goodness mangoes are in season. For dessert we ordered the sticky rice w mango and a scoop of coconut ice cream. Best ever! We wanted a tub of their coconut ice cream. It wasn't too sweet and had little shreds of coconut meat. Yummy. The mango and sticky rice was warm not to sticky. I'm craving for some now... \n\nWe definitely will be coming back.", "author": "Annie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "High quality Thai food and wonderful attentive service as well. It was a very comfortable and enjoyable atmosphere to sit in- quiet and a bit of respite from the city but still a bunch of other people there for a social vibe. The curry was delightful. Hits the spot if looking for solid Thai in a expected \"old school\" Thai restaurant vibe.", "author": "J K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "Food is too authentic for me. Not for everyone. Fish oil is used in almost all dishes. \n\nThe merits \nQuiet ambiance \nPolite waitresses \nDimly lit romantic aura about the place \nNot crowded", "author": "Vaishnav D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "From bottom left to right: pad Thai, beef with cabbage and peanut sauce, green curry with chicken. AMAZING, delicious food! Great service too!", "author": "Cathryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "I rarely write reviews for restaurants but Yukol has gone above and beyond in service, friendliness and damn good Thai food. \n\nHave dined in and ordered delivery/ take-out several times . The ambience of the restaurant is as many have described: comfy, warm and inviting. The entire staff is very well versed on the menu items, the food is authentic and fresh and the service is fast and inexpensive for the zip code. This is probably my highest ranked favorite neighborhood spot for great take-out. \n\nTom Kha Gai is rich and creamy and full of flavorful chicken and fresh mushrooms. Pad Thai is perfectly portioned with a more than decent amount of tofu and shrimp. You + Me rolls = super yummy. \n\nOh, and speedy delivery. A+++", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "My favorite neighborhood Thai spot. I come here often after a long day of work and the wait staff  is always so polite and friendly. Always seat me in the same seat too :) pad see ew is great and their beef salad with cabbage are my go-tos. \n\nWe get delivery often as my boyfriend and I live less than 10 blocks away and the delivery man is always so nice too! He remembers that our door is ground level and always comes directly instead of calling us.", "author": "Zara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "drunken noooooooooooodles! Theirs wasn't overly sweet and it came out piping hot! attentive waitress and an overall great dining experience.  decor is not 4stars but service and food is great", "author": "Paul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "My go-to Thai place down the street from my house. Always delicious and always friendly service!", "author": "kittCAT L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Dinner here hit the spot! Service was friendly and the food came out quickly. I ordered my go to Thai dish I often get the first time I go to Thai  restaurants (Drunken Noodles) and it compared favorably with other places I like. It had just the right amount of heat that I asked for. I'd go here again when in SF looking for Thai food.", "author": "Sheila M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "We got take out from here tonight and will now be loyal customers. We ordered #1, #21 made spicy, and #29. All we absolutely delicious and we're the perfect Thai food fix. Can't wait to comeback and eat in the restaurant because the staff all seemed lovely.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "Yukol is easily my go-to place for dinner in the Marina. The service and food here is on point, and it's only a few blocks away from me. There hasn't been a bad dish I've ordered yet. My house favorites are the pad kee mao, red curry with duck, and the minced beef. If you're ever unsure of what to get, the wait staff has never done me wrong. They also deliver with a minimum purchase of $15. Make sure you check this place out!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Best yellow curry I've had thus far.\nFlavorful and creamy with TONS of succulent chicken pieces!! It tasted like it was slow cooked on the bone all day (bones were not included, don't worry)!! I personally am not a fan of the chopped chicken breast since it tends to have a rubbery texture, so I was pleasantly surprised to see huge chunks of tender juicy chicken! \n\nPad Thai was yummy, the chicken and basil dish was delicious, the satay did not disappoint, and their chicken, mushroom and lemon grass soup had a pleasant tang to it.\n\nIt is a small space, but it's cozy with good service. It's SF, so parking is tricky unless you park down by Marina greens. \n\nI will definitely be back for their chicken yellow curry! The leftovers were just as delicious!", "author": "Ariadna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Very happy to have stumbled on to this place a short walk from our hotel.  Service was outstanding and our waitress was very knowledgeable about ingredients.  Normally, our daughter with a severe milk allergy orders Satay Chicken when eating Thai/Vietnamese...however, theirs contains condensed milk.  Thankfully, the waitress was aware of that or we would have had to break out the Epi-pen!!!  We never expected milk in that dish since it is dairy free everywhere else we have gone.  Instead, she devoured all of the meat and sauce out of the Beef and Brocc over rice.  Broccoli was bitter, but I loved it...kids, not so much.  Hubby and I shared Seafood Kra Tiem, brown rice, and Angel Wings.  Very yummy and filling!  We would definitely go back for the delicious food and friendly staff!", "author": "Joni L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "This is my Favorite Thai Restaurant in the marina. I order out at least once a week. The green curry and pad Thai are my most favorite items on the menu. The green curry is the perfect amount of spice with a ton of fresh veggies. Delivery is crazy fast too. Definitely check this place out!!", "author": "Alexandra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-07", "description": "Present were most of Shakespeare's seven ages of man, including grandmas and a squealing toddler. I was initially the sole Asian aside from the servers and the only non-White person aside from the servers and cook(s). I believe that hadn't happened since Osaka. http://www.yelp.com/biz/osaka-sushi-san-francisco#hrid:OgFekcP98oMmKDkyTqTGZQ\n\n#35 Pepper Garlic Dan Quayle $8.95 was savory and somewhat rich but also bony in a not-straightforward way. Quailman came with just a spoon and no knife. Among your options are using your hands, getting looks from other diners, and unimpressing your date. (But if you're dating here, I already doubt you're \"the one\".)\n\n#9 Angela Lansbury Wings $8.95 were the bomb. Their serving size was comparable to the quail's, so they might as well be an entree and not \"just\" an appetizer. Or the quail should be an appetizer. The wings contain pancit Shanghai. Ask for gapi (Thai relative of bagook), lemon, and chicharrón. The bell will ring like in It's a Wonderful Life.\n\nTip: Learn to play spoons because you'll end up with at least one for every dish. http://youtu.be/T0_zzCLLRvE", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "Their chicken coconut soup was awesome and their delivery is so fast! Their pad thai was not my favorite, their shrimp was very \"shrimpy/fishy\" if that makes sense, but then again I am picky with my seafood! Great takeout spot", "author": "mackenzie e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "a tucked away thai gem in the marina - we were seated instantly and our waiter was very attentive, quick to get our order and would bring tea and water refills without having to prompt. food was better than some of the other neighborhood thai spots - would recommend the fish soup and red curry. we dropped in while on whole30 and the chef was accommodating and allowed for several substitutions. will be back!", "author": "Alexandra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Walking up Lombard (and eventually on through to Lyon) meant that I randomly passed by Yukol Place.  I mentally tagged it as a reference point.\n\nSo, fast forward another hour or two (after completing the steps), and I was only thinking about dinner.  Turns out, I ended up here far sooner than originally anticipated!\n\nWe were able to sit in the front window and enjoy the street scene, although the ambiance in the restaurant was quite nice, too.\n\nThe service was great, and the food was also good.  It was a great local spot and the food was flavorful.  Granted, there's never enough of it, and it's never spicy enough, but at least it isn't bland like so many places around here fall into the trap of.", "author": "Jes G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Everyone here is SO nice, when I get take out or delivery it's always right and even early, when we eat there with our squirmy short attention span special snowflake, they bring dishes out quickly and put them away fork his grubby grabby hands and are so sweet to him.", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Omg this place was so yummy!!!!!! I seriously don't have anything bad to say, about it. We shared 5 entrees, two of us has thai coffee and tea & our bill was only $87! So with tip, $15 per person. So great. I'll be going back.", "author": "Amber M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "I moved into the neighborhood and was craving Thai food so I went to Yelp.  I had been to Blackwood many times and I wanted to try something new and this popped up.  It's sorta obscure to find because it's nestled on a stretch of Lombard that is usually either fast traffic or tech shuttles dropping off nearby.  I ordered the Pad Thai (#56) and the Phrik Khing Gai Kung (#19) for pick-up.  I was super in the mood for Pad Thai and unfortunately wasn't completely wow-ed by Yukol's but it was pretty good.  It has an authentic and casual feel to the restaurant and definitely see myself coming back here for Thai in the Marina.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Very Nice Thai restaurant. Our waitress was nice and friendly and service was great. Our water glasses never emptied. Our food, which was the papaya salad &chicken laab came out in less then 5 minutes. Our curry took a little longer but it was still good. Good Thai place in San Francisco:)", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "Delicious. Nice presentation . reasonable price .one nice waitress other bitchy one . over all very good", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Just had to give a 5 star review to a favorite spot that's never disappointed throughout the years. Very friendly service, calm and clean ambiance, and delicious food. The veggies are always crisp and fresh which always says a lot about the quality of food... Can't wait to go back again. Please support this wonderful family establishment.", "author": "Kylie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-01", "description": "We were timid to try a new Thai place because we are so loyal to our favorite place in Anaheim, but we ventured out tonight and it was a success! The soup was delicious and very lemony, the veggie eggrolls were awesome in that great dipping sauce, and the sautéed mixed vegetables were yummy too. They were very busy because it was New Year's Day but the service still managed to be friendly and fast. Great local joint!", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "Best peanut sauce I've ever had! \n\nStopped in for an early dinner on our last night in San Fran. We were the first ones there after they opened at 5pm. By the time we were finishing our meal, the place started to get packed. \n\nI had the Pad Kee Maou. Delicious! I live in San Diego and we have some pretty delicious Thai food but my meal was to die for! My fiancé had the Pad Krapao with ground chicken. So so so good! We also had the crunchy vegetable roll. Everything was so good! And the prices were definitely right. \n\nIf you're looking for good, authentic Thai food- this is the place! \n\nAnd make sure you get the peanut sauce!!", "author": "Shannon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "We have been going to Yukol Place for over 20 years and I have never been disappointed with the food, service and price. \n\nYukol is a master in the art of Thai cooking...having tried to cook it myself this is not easy to do.  She is like the character in Like Water For Chocolate...she is just truly a magical chef...she is also one of the sweetest people I have ever met.\n\nWhether you eat in or pick up to go...you can't go wrong.  Below is our standing order of favorite dishes:\n\nKatong Thong #8 (not always available)\nChicken Satay #2 ( a standard but her peanut sauce is beyond compare)\nLarb #4 (get the Duck it is amazing and I don't even like duck)\nKaeng Panang Beef #29 (YUM!)\nPad Krapao #34: (Sweet Basil Chicken)\nBrown and White Rice\n\nMy kids have been raised on Yukol Place and now fight for each dish with gusto!  I have to order double of #29 and #4 as they can't get enough and love the leftovers.\n \nYukol's is about the food not the ambiance even though she has put a lot of love into the interior and the staff are all sweet and kind.  An old fashioned family run business...a very rare indeed.", "author": "Cheryl R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "The Marina is a pretty sad place for Asian food.  It's either super white-washed, tasteless, or extremely expensive (usually a terrible combination of all three).  When Gatip Thai closed down, Husband and I panicked: where were we going to get our Thai food fix without spending an arm and a leg at Osha??\n\nSo we decided to explore the neighborhood a bit and ended up at Yukol Place.  It's relatively empty usually during the weeknights, but I noticed they do quite a bit of delivery or take-out service.  Great, because we get better service - and they are really wonderful and nice here.\n\nWe LOVE the crispy spring rolls, the fried shrimp appetizer, and the prawns in a clay pot with glass noodles.  Freaking delicious.  I also ordered a soup one time, which was basically a clear broth laden with glass noodles, chicken and pork, and lots of veggies.  The perfect chilly SF night meal (or if you're sick and want a nontraditional chicken noodle soup).\n\nPrices are super reasonable - definitely way less than Osha.  There's a pretty good selection of different meat or veggie dishes and curries.  Plus, the portions are generous - perfect for a starving CCG after a day of work and volunteering.\n\nSeriously friendly service - I'm a huge fan of this place, and I'm glad we can put it into our Thai food rotation.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "This is my go-to Thai restaurant and has been for years. Food is great (try the angel wings),  and they will have the best chicken and peanut sauce in town. Service is great. Nice atmosphere for a date, friends or alone. \n\nBest Thai in the north part of town.", "author": "Allan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "The food here is delicious! Very fresh and the flavors stood apart from any other Thai food I have tasted.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-27", "description": "This was my first meal in San Francisco and have to say was a little disappointed.  It looked from the outside like it could be a really great restaurant but I didn't enjoy my meal.\n\nI asked the waitress to recommend a spicy chicken dish, and she recommended the spicy chicken curry (or something along those lines).  When it came out, there were maybe 5 small pieces of chicken with the rest being green beans.  Very few other vegetables on the plate.... I felt like I got a large plate of green beans with a side of chicken.  The curry also did not taste very good.  \n\nThe menu was very confusing as well, with many of the dishes sounding alike.  The description of my dish was nothing like what I received.  The wait-staff was very nice however and the food came out reasonably quick.  Just was not impressed with the food or menu.", "author": "Kate U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "One of the best Thai dining experiences I've had in SF! A local neighborhood joint \"where everyone knows your name,\" Yukol is cute, intimate, and just plain tasty!\n\nWe ordered lettuce wraps to start with, which were a world apart from any other version of lettuce wraps I've ever tasted at an Asian restaurant! Each ingredient was presented individually in a long boat-like plate;  the minced chicken flavor was out of this world! Yum yum. \n\nWe also ordered the green curry (spicy!), pad thai, and a side of rice -- all of which were simply outstanding. Plentiful food for 3 people. I really enjoyed the cozy ambiance of the space, the service, and the meal.", "author": "Mansi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Happy, random choice when hunger made us goofy and slightly desperate. #28 and 59: red curry with vegetables (green beans, baby corn, squash), pineapple, and duck, and a salad (spinach leaves with toppings--peanuts, lemon, onion, bell pepper, ginger, toasted coconut, and tamarind). Delicious food, friendly and efficient service, but only one selection (Singha) of beer.\n\nSometimes random works out!", "author": "Suzanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Great Thai Food!\nHad the Tom Kha Gai soup and Kaeng Kiew Warn green curry.... Delicious.", "author": "Juliana I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-20", "description": "What happened to this place???? The food was horrible. I used to eat there lunch and it was one of my favorite Thai place. We went out to dinner and the food quality is not there anymore. I barley touched my food. I hope you will have another cook or something. Very disappointing!!", "author": "emukka y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "YUKOL PLACE THAI CUISINE\nThis is one of the best Thai restaurants I've eaten at. After a long day in the city, my friends and I were starving and were looking for some good Thai food to fill our growling stomachs! We walked by a couple Thai restaurants before deciding on Yukok Place Thai Cuisine, based on the number of clientele and nice-looking/authentic Thai environment and decorations. We were immediately greeted with friendly service, and without further adieu, we opened up one of the most fancy-looking Thai menus (with a portrait of a Thai woman and binded with wooden coverings on the outside). With lots of choices to choose from, we decided upon the following:\n\n1) Kaeng Karee Gai: boneless chicken in mild yellow curry with potato cubes -- this Thai curry was delicious!!! Very creamy, thick, and tasty, the curry was the perfect topping to the steamed rice. The curry was good enough that even without meat, I would enjoy it just with rice. Be that as it may, the chicken was tender and soft. Delicious! \n\n2) Ped Yang: boneless roast duck in honey, black bean and ginger sauce served in a bed of steamed spinach and cabbage -- this dish was an absolute delight! the duck was savory and the honey/black bean/ginger sauce gave it a nice sweetness.\n\n3) Three Amigos: combination of sautéed shrimp, chicken, and scallops -- with three choices of meat, what's there to complain about! Slightly spicy, this dish went well with rice. With a variety of veggies to round out the meatiness, the Three Amigos was an excellent House Special that everyone should order.\n\n4) Angel Wings: boneless chicken wings stuffed with silver noodles, black fungus and chicken, served with sweet and sour sauce -- this was one of the most unique appetizers that I have ever tried. Not your traditional chicken wings, these were stuffed and dipped in a sweet and sour sauce that was perfect! You can taste the crispiness of the roasted chicken wings with the chewiness of the stuffing!\n\n5) Pad Thai: pan-fried Thai style rice noodles with shrimp, tofu, ground peanuts, egg, and bean sprouts in tamarind sauce -- this was one of the best Pad Thai I have ever tasted! The noodles were delightfully chewy and the sweet sauce was perfect. They gave lots of shrimps in this dish, so if you're a seafood lover, try this Pad Thai!!! Add some lime, and it's perfection! Best of all, the Pad Thai wasn't dry at all! I enjoyed the Pad Thai so much, I had to order another one for take-out for lunch the following day!\n\nI love this place!!! Combined with the excellent ambiance of traditional Thai decorations, the service was very friendly; the owner even taught us how to say \"thank you\" in Thai (even though I already forgot how to say it)! The prices were very reasonable, ranging from $9.50-$12.00 a dish, on average. Give Yukol Place Thai Cuisine a try; you won't be sorry! You'll find yourself coming back over and over again!", "author": "Stanley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "When I'm otw home from work and too lazy to cook, I'll put a call into Yukol Thai Place 15/20 min before I'll be home. I order the pad Thai, yellow curry, side of roti and the chicken satay and by the time I'm home my door bell has rung and then sweet super efficient delivery guy from Yukol Thai has arrived. The food is always stellar and never disappoints. I also like eating in when I have the time but the delivery is my go to.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-01", "description": "Good eats, good price. Super dessert-- mango with sticky rice! Friendly, service-minded staff!", "author": "J H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Friendly and fast service.  Fresh and delicious food.  We had the spring rolls, pad thai with chicken, and steak with Chinese broccoli.  One of the most reasonably priced meals you can get in the Marina.  Will be back again soon.", "author": "Valerie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "This place is amazing.  Delicious food, great prices and super service.\n\nThe staff is always super friendly and have accommodated our last minute group lunches, which can be 6-12 people and also 6-12 cards to pay the check.  Never a complaint!\n\nThe food has never been disappointing.  I've gone here multiple times and it's always the same. I have never had a bad day.\n\nI usually go for the Pad See Ew with BBQ pork and fried egg on top.  But the crispy chicken, curry chicken and even the veggie options are fantastic.  \n\nAlso, you have to get the cracking thai crispy crackers as an appetizer. \n\nBut dont be in a rush - because good food takes time and sometimes the dishes may come out a little slow.\n\nNOM! NOM! NOM!!", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "I love Yukol Thai! They are my go-to for Thai food in the Marina. The food is always delicious, the takeout service extremely efficient and they usually beat the delivery time they quote. Favorites include the Little Buttercups, the Green Curry and their meat dish with peanut sauce over cabbage. Honestly, I haven't had anything I didn't like here. Their pricing is also quite reasonable for the quality. Unlike Blackwood Thai who is a total rip off! \n\nI am moving out of the city next month and I will seriously miss my weekly dose of Yukol!", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "Great thai delivery and/or takeout.\n\n#21 under house specialties is delicious.  Also try the pork thai fried rice (spicy), excellent!", "author": "Kate G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "This is a true 5 star restaurant both in food and service. The food is everything you would want in great Thai food very flavorful, fresh, and delicious. The service is always very friendly and more than willing to help with the menu. If your feeling thai food this is the best place in the city.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "Excellent Thai food at an affordable price. The food seemed quite authentic and had a wide selection. Everything my table ordered was amazing, especially the duck red curry. The portions were good, I eat quite a bit and I was pretty full by the end of the meal. The food came out promptly, the service was good and our waitress was friendly. If you're in the area and are looking for Thai food, I would recommend this place!", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Visiting from Tempe.\nWe chose our seat, enjoyed two hot soups (coconut / prawn was rich & slightly sour, yum!) to warm up after walking from Golden Gate Park.\nWaitress asked perfect questions, made special order (fish substitute for calamari */plus/* peanut-coconut sauce), and was down-to-earth...& professional.\n\nGreen Curry was perfect match w/ peanut-coconut sauce! \nEvery bite was fulfilling. Each sip of \"Thai tea\" was refreshing & tasty in it's own way.\nThank you...", "author": "D J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-17", "description": "Pad See Ew and Green Curry were both good. I was surprised at how generous they were with the shrimp in the Pad See Ew, most people are stingy and few give both shrimp and chicken. NOM.\n\nThe mango sticky rice was the highlight of the meal, they gave us so much!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Nice portions, great prices, and great service. Fried bananas for dessert were unexpectedly amazing.", "author": "Thomson Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "Seriously, some of the best Thai food I've ever had! I wish I could remember names of our dishes but I cant. Service was great and the place was quiet and inviting. I would definitely come back!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Food is killer. Ambiance is a bit dated or maybe a better term is Van Ness Authentic. Drink beers and order the green chili dish. Service is great and easy to communicate my nut allergy. I didn't die. Five stars.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-20", "description": "Although this tends to be a favorite Thai spot for locals living in the Marina, I can't seem to find a signature dish that makes me crave this place out of the two times I've been here.  The coconut milk soup helps you warm up on a cold night, but it's nothing worth savoring over.  II experimented with the garlic quail, which was tender and cooked well.  When I asked about the garlic quail, the waitress couldn't tell me much except it was good.  However, it was so difficult to eat that it ruined my appetite.  Even the dessert was just okay with large fried chunks of banana, paired with coconut ice cream and whipped cream.  I've had it made better with smaller slices of banana to complement the ice cream, which shoes this place may lack the initiative and attention to detail just to get the dish out.  \n\nService is fast and friendly, but not helpful for recommending good dishes.  The decor is simple and dimly lit with white Christmas lights.  Parking can be tough on the street unless you find a nearby garage.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "Compared to another Thai restaurant just a block away, Yukol Place appeared more welcoming.\n\nService was rather quick and the waitresses were very friendly. I ordered the Pad Kee Maou, and the serving size was more than I could handle, though I am a very light eater. It was very much worth the price, and the experience was wonderful.\n\nOf all the Thai restaurants that I've been to, this may become one of my favorites.", "author": "Bonita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Wow!  Service and food were great!  Ordered the seafood soup and the flavor and seafood quality were outstanding.  I'll definitely be back!", "author": "Aj M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Be aware they are no longer open for lunch hours!!! This broke our hearts since we frequently ordered work lunches from here. The You and Me Rolls are as amazing as others have said, as is their pumpkin curry (which is always on their \"specials\" menu). The portions are plentiful and great re-heated. My favorite Thai place in the city!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "4.5\n\nWe came in for our first meal here and enjoyed everything we had, and just ordered again for delivery. As far as Thai options go in the Marina, so far, after trying about 4-5 this is the best.", "author": "Captain B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "Love this place. Great spring rolls, soup is amazing, pad thai --Yum. Haven't had a bad dish. I've only done take out and delivery so I'm not sure what it's like to eat there. But I imagine it's great. The people are extremely nice in person or on the phone. What a gem this place is.", "author": "Samantha Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "These guys are awesome!!. Great food and excellent staff. They always remember what I order. Parking is a little tough but it's worth the hassle. Best Thai food I have found in the city.", "author": "Will S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "I like it, it is my goto place for lazy evenings takeaway.\nAll I tried was good, the LARB is great, and the soups have that real taste that is rare to find. This is real thai food, not a generic thai.", "author": "Yann K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "So yummy! I ordered from this place late at night for a to-go order. We got the pad thai, yellow curry and chinese cabbage in a light soybean sauce. Personally I thought the pad thai was as good as any other, but not remarkable. I also felt the same way about the yellow curry. But the chinese cabbage was amazing. I couldn't stop eating it until I was so full I was going to burst. The vegetables were green and tender, the sauce ultra light and tasty. Nothing we ordered was under flavored or salty which is fantastic. \n\nAdditionally, the people who work here are very, very nice. Everyone was smiling even though it was late in the day and I'm sure they were tired. They seemed genuinely happy that I, and every other customer was there.\n\nI would seriously go back to this place just for the good vibes they were all putting out.", "author": "Cori N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Everything we had was super delicious! The presentation was also very very nice. Service was wonderful. Would recommend. I have had better Thai ice tea before though. Very authentic!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-06", "description": "#12 and #15 every time.\n\nFor the uninitiated, that's the lettuce cups that you can only have \"in\"-restaurant that come with every conceivable fixing from peanuts to tiny limes to ginger pieces, and the tom kha gai soup.\n\nthey also have many very tasty and healthy options in the specials (like the #19, prawns, chicken, basil, ginger, chili with green beans). \n\nMy only advice, if you like it spicy (even moderately so), speak up! They play it safe, leaning strongly toward \"american-strength\" (i.e. pathetically non-spicy) if you don't but for us purists, can really kick it up several notches.\n\nPS: their Thai iced teas are HUGE. last night we chose to split one despite both harboring an unhealthy obsession with that concoction.\n\nMy favorite thai place on the northern side of SF, by far.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-04", "description": "I NEVER get full at a Thai restaurant, but when I had a lunch special of basil garlic chicken, I had leftovers. \ngood flavors,\npleasant service\nnice atmosphere.\ni will definitely come back here for more meals.\ni started with a Thai version of the Indian pancake dish, roti with a delicious yellow curry dipping sauce.\ni need more reasons to come to this part of town!", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-23", "description": "I ordered take out from here a little while ago and it was ok. Nothing special and there is another place that i liked better so I most likely won't come here ago.\n\nI ordered the shrimp pad thai with tofu which was ok. I ordered it spicy and it came with a side of spicy vinegar sauce so i could make it at spicy as i wanted. It didn't have the same peanutty sweetness that i am used to with pad thai. Shrimp was fresh and had great texture. Noodles were thin. Not the best pad thai but it was tasty. \n\nDelivery prices were good. \n\nAgain, I have been to other places that are so much better so i most likely will stick with them but if you need a Thai fix, this will hit the spot", "author": "Whitney S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-19", "description": "Ordered delivery from this place. The beef was flavorless, the noodles were cold and dripping with oil (check out my photos).\n\nWasn't cheap either.\n\nYUCK.", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "EXCELLENT, fresh Thai food delivered!  The Duck Larb is soooo yummy. I'd never had it, but went with other reviews. Very glad I did. It's the kind of dish you think about later. . Pad Thai very good. Delivery was when they promised and still hot. Try it!", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Best takeout Thai food in SF! Can't go wrong with the Pad Kee Mau, Pad Thai, Tom Yum Ga, or Curry's.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "When I found out that the parking at my hotel nearby only had first come/served parking, I knew I'd be on foot for my couple days in SF so finding a place to eat in close proximity was a must. Luckily this place was only about a block away and very good as well. I'm probably not the best judge of Thai food, but I know what I like and this hit all the marks. The service and decor were great and the food was perfect. I had the #34 PAD KRAPAO, a dish similar to what I usually get at Thai places even though it's never named the same. I ordered a side of steamed rice to go with it and when it all promptly arrived I wasn't disappointed. For desert, they had my favorite Thai concoction: Mango & Sticky rice, the portion for which was amazing, with no less than a whole mango!", "author": "Brian A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-27", "description": "I just ordered take out from here and I am so disappointed. It took one hour to arrive (although she warned us of that) and the food was completely taste-less. \n\nWe ordered the green curry with chicken (#26) and a four sauce shrimp dish (#22) and they were both so bland that neither were worth eating.\n\nGuess we'll stick with Osha Thai from now on!", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Ate here with my family of 9 from out of town. They hook us up with a nice table and the dishes we ordered, which we ordered a lot were tasty, fresh, and very flavorful. We eat Thai food frequently in Los Angeles and this was up there with the best of them. They were very accommodating and made us wanting to come back for more.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-01", "description": "Maybe I am spoiled because I have several amazing Thai food places in Fremont, but I was not thrilled by Yukol.\n\nTypically, I cannot finish an entire entree at restaurants & always have to get about half to go. Today, not only did I clean my plate, but I left a little hungry!\n\nI admit, I didn't order a noodle or rice dish, even so I felt the portion could have been more generous.\n\nMy house special #19 consisted of 3 yummy (but 3) prawns, a few slithers of chicken, some sauteed onions and bell peppers on a bed of green beans. The food was well prepared, but I would have liked a bit more.\n\nAlso, I disliked the fact that a scoop of brown rice costs an additional 2.50$....but I suppose this is fair game for a place in the Marina.\n\nPolite and quick service, the place was practically empty on a weekday evening.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "Woah!  This place blew me away.  My wife and I went there based on a Yelp search.  We got the U and Me Rolls (from the specials board) to start.  The portion was large and they were delicious.  Best roll/egg roll/spring roll/etc that I've ever had.  If you come here, get them.  We also had chicken Pad thai which was good, but I've never had bad pad thai.  Last, and best, we had the pumpkin curry which was FANTASTIC.  The curry had the perfect balance of sweetness and spice.  They put green bell peppers and basil in which really filled out the flavor.  I can't wait to come back to Yulol Place.\n\nAlso, the service was A+.  The waitresses seemed to be genuinely pleased that we enjoyed our dinner so much.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "My favorite Thai place! Food is amazing and staff is so nice. I live nearby and get take out/delivery a couple times a month. Green curry with chicken (sometimes I add prawns too), pad ke mow, pad Thai, rotti appetizer and mango sticky rice are my go to's. Never had a bad experience or meal here. Consistently fantastic!", "author": "R B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "While the service is sometimes just fine, the food is usually pretty good. Easy and yummy take out. BBQ pork is great.", "author": "Angie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "My friend and I wandered into Yukol after searching for \"soup\" on my Yelp app. We were craving something hot and comforting to help cure our sore throats, and ended up ordering the following:\n\n-Mieng mee krob (lettuce wrap with chicken & crispy noodles): A good appetizer for two. Chicken and crispy noodles were in separate dishes, and a platter of chopped limes, bell peppers, peanuts, and ginger were presented alongside. \n\n-Woon sen soup (glass noodle soup): Just what we needed-- hot, savory clear chicken broth with lots of yummy vegetables, tofu, chicken, and thin glass noodles. Portion would serve two, or three people at most.\n\n-Vegetarian pad thai: Good. The noodles are a lot thinner than I'm used to at other Thai restaurants, but the flavor was nice.\n\nYukol's exterior is unassuming, but inside it's warm, intimiate and inviting. Service is polite and friendly, and they were quick to refill our water and Thai Jasmine tea without us asking. If I lived in the Marina, I'd definitely come back again, or get takeout service.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "I can only speak for the Po Tak soup..... a Thai Tom Yam concoction loaded with seafood and mushrooms. Best I've had in years and probably since I was in Thailand twenty years ago. Lemony, earthy and sea flavors compete for attention on the tongue. So Good. Only looking for a light meal for one so order was such. But I'm betting they are good on all points.", "author": "Dana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "Yukol Thai was one of my favorite places to go get lunch with my bestie since we both work nearby. Since it changed its hours to dinner time only, we have been looking for another Thai place to fill the void but nothing compares! We frequented their lunch menu and everything is so flavorful and delicious, even their side salad that comes with a lunch dish is yummy. Staff is friendly and attentive. Decor needs a refresher but I'll take delicious food over decor any day! I miss my Yukol Thai!!! =(", "author": "Ruth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "Came here with the boyfriend last night. It was my 1st time trying this place and was impressed! There isn't a lot of Thai restaurant in the city that offers authentic taste, this one definitely made the list! \n\nOnce you open the door to Yukol Place you are greeted with a gush of curry smell. Yummmy! The place feels very classy with dim lighting and candle burning on every table. I loved how their napkin has a rose printed on there. \n\nWe ordered the Katong Thong for appetizer which is crispy buttercup filled with small dried shrimps, green peas, and diced chicken, served with cucumber salad on the side. YUMMMMYYY! It was SO delicious! We wanted to order another one but decided to wait and see if we still have room after we get our main dishes. \n\nI ordered the Kaeng Panang (spicy red curry) with chicken with bamboo shoot, carrot, and mushrooms, it was very tasteful. It was my first time trying red curry since i always order either the yellow or green curry at other Thai restaurants. It has just the right amount of spiciness for my taste, but the boyfriend said it could use a bit more kick. The chicken however was a bit on the dry side, but it was not horrible. I did see the table next to us ordered the Kaeng Ped which is boneless roast duck in red curry. I have to give that a try next time i come to Yukol. \n\nHe ordered the Pad Thai. I am not a big fan of Pad Thai because it's a bit too sweet for my taste. So the Pad Thai here was no difference to me. I took a few bites and went straight back to my delicious curry! \n\nThe servers here are all very nice. The service is quick and the dishes have good presentations. I highly recommend the Katong Thong and red curries! I will definitely be back for some more authentic Thai food!", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-08", "description": "This place is super cute! Because of it's location, I was expecting just okay Thai food, but it was really good! I ordered seafood kra tiem, which was scallop, prawn and calamari with chili paste and garlic. For that they get 3.5 stars. But where they really shone was on service. I was with a large group and we asked for individual checks. Not only did the waitress put in the extra work for the individual checks, the kitchen also managed to bring out all our dishes in a timely manner. I heart Yukol.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-10", "description": "My first review, so here we go :-)\n\nOrdered a SomTum salad and a green curry for delivery. Delivery was on time with what i have been told on the phone, great. During the phone call i was put on hold, i hung up after 4 minutes and tried again, probably they have been very busy at this time. Anyhow, the delivery person was very nice though.\n\nFood: The SomTum salad was kind of disappointing. Not tasteless but i was missing the usual heat, the sour taste of limes and the salty taste of the fish sauce. I had better ones (which is the reason for the three stars).\nThe green curry was very delicious, the right heat for a green curry, fresh ingredients and a very balanced taste. If i would have left out the SomTum salad this would have been a four star rating.\n\nGreat fact: The restaurant starts delivering at $15.", "author": "Ben O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-17", "description": "Someone at my office was in charge of ordering lunch and it was a huge mistake. I got the chicken curry, as I am not a fan of thai food. I have never had food poisoning so bad in all my life. That was the food I ate that day, so I know this is where is happened. I am still not back to normal and have missed work as result. I knew it tasted funny, but gave it the benefit of the doubt. Never again. it was delivery, and it was hot, so I can only assume the chicken was bad of undercooked. Which ever it was, take it as a warning.", "author": "Andy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-24", "description": "Thanks to all the great yelp reviews, we gave this place a try and are SO HAPPY for the great experience! \n\nI love Tom Yum Goong soup and this place had some of the best I have ever had! I highly highly recommend it! There were plenty of prawns and the broth was perfectly spicy and not overly sweet.  The crispy fish entree was a wonderful hit with our family as well. \n\nI will definitely come here again!", "author": "Ada G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "I live across the street, and this is my go-to place when I need food.  I'm a pretty picky eater and usually need the best food - Yukol is by far the quickest, most delicious, and best quality food I can get most conveniently.  Top-quality Thai place with extremely nice workers.  Whether you want Thai or just good food in general, I highly recommend it.\nI usually only write reviews about bad experiences, so this is a new one for me.  :P", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "I really enjoy this place.  My husband and I come here often, and they always remember us, where we sit and what we order.  \n\nWhat we like:\n- thai iced tea (the best I've had anywhere!)\n- chicken satay\n- tom kha gai (with shrimp)\n- shrimp pad thai\n- coconut ice cream (to die for!)\n\nWe also like their pla rad phrik, which is a crispy whole fish over veggies with a little kick to it.  Sometimes it's great, sometimes it's not.  At times, the fish seemed a little old, and therefore not very good.  Also, one time they accidentally gave us a TON of jalapeno peppers in the veggie mix, so it was impossible to eat.  \n\nDespite some inconsistencies, we enjoy this place and will return. The people here are so kind and we always feel right at home when we come here.", "author": "Jade F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-25", "description": "So disappointing I walked out after two spoons of soup. The soup tasted liked sour dirty water. The waiter insisted this was how Tom Yum should be and that \"coconut soup is not good for you; it makes you cough.\"  (Interestingly the coconut soup was served as part of the lunch combo.). I didn't even taste the green curry which came thoroughly curdled.  Spoiled ingredients?", "author": "Aimee F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "This is the best Thai place I have ever been to. \nThe hot thai tea was refilled constantly. \nI had Pad Thai and Tom Kai Pak. The Tom Kai Pak was perfect as was the Pad Thai. The sauce was excellent and the noodles were thinner than I am used to. The thin noodes made the texture silky. I could have done without the shrimp though, it tasted a little oily to me. However, I would give it a try again and see if it was a one time thing. \nFor dessert we had the coconut ice cream and fried banana. The ice cream was perfect and refreshing. The banana had a little too much dough around it though. I like a crispy banana with a light batter. \nThe staff is friendly and the ambiance is nice.", "author": "Elisabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Amazing food, great service! I love their pad Thai, which tastes very authentic. Generous portions and convenient takeout keep me coming back for more!", "author": "Emily V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "One of the best values in the city. Have been going there for almost 20 years and the quality remains high with prices very reasonable.", "author": "jack b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Delicious! Cute place with roses on the tables. Thai iced tea was good, as was the Pad Thai. I always start with Pad Thai-if they can't do that right, I leave. Also got #20 sweet and sour chicken and shrimp, pretty good, and #37 beef with Chinese broccoli- good buy almost too garlicky. Family style, no kids menu. Husband loved the constantly replenished hot tea. Water was lemony.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-19", "description": "First, the positives: Cute restaurant with decorations from Thailand. Attentive service.\n\nOn to the food: I've eaten at this restaurant several times over the years. During my most recent dining experience, the quality of the food was subpar. For example, the duck was 95% skin and 5% meat. The chicken was stringy. Bleh. For what they charge, the quality of the ingredients should be higher.\n\nIn the past when I've ordered rice, the rice came in pot; this past time we received one small pressed cup mound and that's it. It's plain rice, not caviar, so why be so stingy? I do not need to be put on a restricted carb diet.\n\nThere are better Thai restaurants in this city. I'll be skipping this one in the future.", "author": "Jolie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "Really delicious food, cozy place, great atmosphere.  They also do great take out.  This is the place I go with good friends to have a relaxing cozy dinner outside of the bustling consumer atmosphere of the Marina.  Great for families too, plenty of healthy options the kiddos will enjoy.  Super nice people too.", "author": "Janet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Definitely a fan.  The food is authentic and the service is genuine.  I'm going back!", "author": "Ken M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "All I have to say is - excellent service, delicious food, and quick delivery!! Happy to live nearby such a great Thai place.  Definitely 5 stars!", "author": "Sophia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "If you're looking for good Thai food at a great price- this is the place! At Yukol, you can enjoy a comfortable atmosphere (not pretentious), genuine service, and some tasty authentic Thai food. \n\nWe started with the Chicken Satay and were pleasantly surprised by the tender chicken and complex peanut dipping sauce paired with a delicate cucumber salad. \n\nFor the main course, we wanted to try both a noodle and curry dish so we opted for: #27 KAENG DANG ( Choice of beef, chicken, or pork in medium spicy red curry with bamboo shoots, cauliflower, baby corn, bell pepper, and a touch of basil) with chicken. \nWe also ordered the: # 56 PAD THAI ( Pan-fried Thai style rice noodles with shrimp, tofu, ground peanuts, egg and bean sprouts in tamarind sauce.) with chicken instead of shrimp as well as a side of rice.\nBoth dishes were packed with flavor and the generous portions were great for sharing. \n\nDue to the portion size we had some leftovers and opted to have them packed. The check was paid promptly and we waited several more minutes for our to-go bag. Assuming that they forgot we exited the restaurant (it was really not a big deal and the packed portion was very small). However, to our surprise what I believe was one of the owners followed us outside apologizing and handing us a full order of the delicious PAD THAI. Apparently there was some confusion in the kitchen and our to-go portion had been discarded so they took the time to fix a full order to-go. Not many restaurants offer this level of caring and service.\n\nOverall, the food was good and the service was great. The kitchen is extremely efficient- even with a packed dining room the food came out quickly and the service was attentive. We will definitely be back soon.", "author": "Cara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "I work in the area and I LOVE Thai food. I have tried many different places but I find this place to be the most consistent. The food is always good if not great, even with delivery. The price is pretty average for Thai but they give you a generous portion.\nI tend to order from this Thai place most.", "author": "Serene M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-18", "description": "I went here because it was mentioned favorably in a review of the hotel I was staying in.  They don't list beer or wine online, but there is a selection there. I ordered hot sake and the tom kha pak, which is vegetable but not vegetarian because it has fish sauce (nonnegotiable).  Disappointingly, I didn't realize I could order the curries on the menu w/o meat (but not w/o MSG).  The soup tasted fresh and great, and the service was good.", "author": "Shaleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "The staff-- Stephanie-- were extremely attentive and welcoming-- and it didn't hurt that the food was good too!", "author": "Conrad W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "Our go-to spot for Thai food in the city. I am a tough critic of Tom Kha Gai soup and Yukol have a tasty one. Not the fanciest place, but there's never a wait, servers are friendly, and prices are pretty reasonable. The Pad Thai and Green Curry dishes are our usual choices that are consistently good.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "Small place. The food and service were great. So many good flavors. Glad we got in on a Saturday night.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "Amazing Place!!  One of the better Thai restaurants I've been to.  I patronized this place recently with my girlfriend and fell  in love with it.  \n\nThe Food.  The food was exceptional.  I ordered the Kaeng Ped (Roasted Duck Curry) and a Thai Iced Tea, and my girlfriend chose the Pad Woon Sen.  Both were very flavorful. I ordered my hot, but wasn't really as hot as I prefer.  My girlfriend enjoyed her noodles as well.  For dessert we tried the fried banana with coconut ice cream.  It was delicious!  The bananas were a bit too ripe, but the batter itself was not soggy at all.\n\nThe Service. They were very friendly, and checked back regularly making sure everything was to our liking.  The food came promptly, and the waitresses were quick to retrieve our plates.\n\nThe Building.  The restaurant was my favorite part of the entire experience.  Very well decorated with a noticeable asian influence.  It is hard to find convenient parking, due to the shopping boutiques in the surrounding area, so your best bet is to park in one of the parking structures.\n\nOverall, this place may be my favorite Thai restaurant to date.  I would recommend them to anybody who loves great Thai cuisine.  I will most definitely be heading back there soon!", "author": "Christian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-25", "description": "Real kitchen nightmares stuff. The Tom Yum soup tastes like hot dishwater. This seems to be a case where to offset low prices for lunch the staff served sub par food to people in a hurry. As is the case with all controversies, the staff telling you the problem is with your sense of taste does little to allay the dispute. In the end they took the soup off the bill but not the uneaten entree. Marina restaurants to avoid is a growing list. Avoid.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "We were here on a short visit to San Francisco and thankfully stumbled across this place via Yelp.  The Tom Yum Goong was spectacular with a wonderful chilli spice.  The Panang Curry was perfect in every way.  If you're looking for great Thai in the Marina District stop here!", "author": "Michael U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Best thing about this place - they deliver! And have pretty good prices. A group of us at work order lunch from here on a regular basis. While other restaurants always seems to get at least one of our orders wrong, Yukol never fails! The food is yummy and delivered in a timely manner.", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "So I've been going here since I was 8 yrs old and still the best thai I've had in sf. Yukol is still in the kitchen and everything tastes as it did 20 yrs ago. The curry butter cups are a favorite of mine and the duck larb is the best in town. The rest of the staff are very friendly and have been there since the beginning. I always look forward to eating here and will always come for more.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "I love this place! The number 15 soup is TO DIE FOR. Everyone that works here is super nice and their takeout is FAST! Everything is very fresh... Not like a lot of other Thai places. My favorite Thai spot in the city!", "author": "Char K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "Best Thai food I have found in SF. Quick delivery and they always get the order correct. I order here once a week and my husband and I love it! Thank you :)", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "So delicious! I was going to go to Gatip because I heard that it was really good, but when we got there it was closed. My friend yelped to find the nearest Thai food place and she saw Yukol had really good reviews. We decided to go here and I'm so glad we did! The service was great, the atmosphere was great, the food came pretty fast and everyone was very friendly.  We ordered the Poh Pier Tod, Pad Kee Mao and the Phrik Khing Gai Kung. All three were very very tasty! Will definitely be back when ever I'm back in town!", "author": "Raphaelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-01", "description": "Unbelievable food here. \n\nThis place is in my top 5 restaurants list.\n\nThey are probably the best Thai food I've had so far.\n\nCurries are very flavorful as well as the soups here. \n\nI highly encourage giving it a try.", "author": "Jafar Amir Hanovic Ismailov M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "This place is a gem. We (13 people) showed up without reservations on a Thursday evening, no problem. The food looked appetizing and fresh and tasted deliciously. The service was prompt and courteous. I love Thai food and this place delivers. \n\nI had salmon green curry. Come hungry - leave satisfied.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-04", "description": "VERY DISAPPOINTING.  I ordered the green curry with eggplant.  They served me one small piece of eggplant, the rest of the dish was bok choy and bamboo shoots.  When I asked them \"where is the eggplant?\" they had some strange answers about where the eggplant was grown.  huh?  The veggies were boiled, not sauteed. The green curry was OK, nothing to get excited about.  I would NOT recommend this place.", "author": "Cindy U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "Oil and butter should be accents, not food groups. \n\nLook. I get it. I'm pickier than most when it comes to my definition of how food should be made. But Yukol used so much oil in my prawn, chicken and veggie dish (#19) that the food shined, my kitchen sink stained and an entire roll of paper towels was used cleaning up the mess. There is some sarcasm in that last one. Go with it.\n\nNo amount of friendly service and generous portions (both of which were true) can offset using that much completely unnecessary oil.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-16", "description": "Just got back from my first trip to Yukol, the owner's name... \n\ntom yum... Cristof (last reviewer) had it all right.. it's so flavorful it was ridiculous! haven't had such great soup in a long time. Our dinner party each ordered one dish...\n\nChicken yellow curry, traditional pad thai, house specialty of prawns and chicken in a sweet basil sauce with mushrooms, black fungus (another type of mushroom), etc\n\nLet me just say: wow! couldn't believe the chicken thighs fell off the bone, they were timed so perfectly. Really impressive prices for the ambience and the portions. Flavorful and done right. What a perfect place to go after the Presidio! Right on north side ofLombard, close to the trends of Chestnut", "author": "Jana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-14", "description": "Carb load time. It was less than 12 hours before the big race, and Lovie and I were ready for some no holds barred carb fest. Since we ate some rather dismal Spaghetti Factory spaghetti the night before, we were ready for a change. I brought up a Thai place that was in the area (Tom Yum), but to my disappointment, it closed down. This place was just steps away from our hotel, and looked pretty busy, so we thought, \"Why not?\"\n\nThe atmosphere was nice, cozy, romantically candlelit. We were seated next to the window next to another Asian girl-Caucasian guy couple, whom I noticed during our dining experience were pretty square. Oh well. \n\nThe service here is impeccable, along with the food:\n\nSoup:\nWe had the #16 Tom Yum Goong. A hot and sour prawn soup with lemongrass and tomatoes. Two words: yum yum! The perfect start to dinner on one chilly night. The spice and sour hit spots on the palate that I normally wouldn't have. Very similar to a Filipino soup dish that uses tamarind powder for the spice. The whole clay pot bowl was killed within minutes.\n\nMain Dishes:\n#24 Pad Ka Meur - chinese eggplant with prawn and chicken sauteed in a garlic chili sauce. This was delish! One of my favs, though, Lovie didn't care so much for it. The eggplant was cooked perfectly...still somewhat tender, but not mushy. \n\n#56 Pad Thai - Pad Thai me baby...I love how every came separated so I got to mix it. Since I'm not a big fan of bean sprouts, I was able to control the bean sproutage. \n\nAll this with cups of jasmine rice, a Tiger beer, and hot Thai tea, we demolished everything. And we couldn't beat the total price: $40.27. For Saturday night dinner for two in the city, that's pretty unheard of. We left with satisfied bellies, ready to race the next day!", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "We have been dining at Yukol for over 20 years and the food is still outstanding, fresh and delicious. The staff are friendly, service is excellent.", "author": "Barbara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-07", "description": "Pros:\nBest Thai delivery in northern SF, hands down. I would eat at their physical location, which is saying a lot for a delivery place. \n\nCons:\nThe curries can drip in the plastic bag and make a mess at home if you're not careful. \n\nFun:\nOff-menu items and their spicy red curry with duck (next time I'll do chicken though)", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-04", "description": "I like Yukol Place.  Based on the ambiance, food, and service, it's one of the best places for Thai on Lombard.  \n\nAs a tofu muncher, I give it four stars.  But if it means anything, my carnivorous friend gives this restaurant a five based on their tender beef, alone.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "We were quite hungry and looked for a place to eat up and around Lombart and ran into this place here.  Looked at the menu and also seen a Yelp sticker on the window so we decided to give it a shot.\nThe service was great and we got seated right away.  The waitresses are very friendly here.  Decor here is quite cool, not overdone and not too tacky.  \n\nOur food came very quick and looked like it was cooked from scratch.\nI was impressed with the taste of everything in it, nice portions, fresh veggies, and good tasting chicken and beef!  We ordered one green curry and a red one from what I remember and had brown rice on the side.\n\nOur server was kind enough to fill our plates herself with rice and even offered free refills on the rice a couple times for a big eater like myself :P\nThey are very attentive and kind so I will definitely come back to this place when I am in SF again :)", "author": "Roger M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-26", "description": "If I could only eat one ethnic food for the rest of my life, it would be Thai. That is, if I'm not in San Francisco for the rest of my life. The Thai food I've had here is nothing to write home about--and I e-mail home everyday.\n\nYukol Place isn't memorable in a good way, but not in a bad way either. The food has a home-cooked quality. We ordered the spring rolls, the red curry with chicken, and the crispy snapper. The spring rolls were served with the ubiquitous Thai sweet chili sauce, which makes everything taste good. None of us cared for the red curry that much--it was definitely not near the best I've had. The snapper was the standout dish. The fillets were deep-fried and then drenched in savory deep brown sauce with green beans--pretty delectable.\n\nThis restaurant is rated 4.5 stars, the highest for any Thai restaurant in the area. I'd give it two star relative to best Thai eateries I've been to around the world. Please tell me there's better out here in San Francisco! I'm looking specifically for a place with outstanding red curry, crispy chicken basil and of course, Pad Thai. Yeeelp me.", "author": "Liz T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "#29 Curry is Delicious.  Fast delivery. Fair prices.  Food is always REALLY good.  This is my go-to Thai place.", "author": "Sierra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-18", "description": "Good food, terrible terrible service.\n\nTook 20 mins just to get a soda.", "author": "kim k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "We stopped by here on our way to the BATS Improv Theater, about an hour before our show started. YELP reviews said it was good, and when we arrived it didn't seem too busy.  I got the Pad Khee Mao with chicken and shrimp and my BF got the Massaman curry and both dishes were delicious.  The mango sticky rice at the end was perfect and the sticky rice was even garnished with a little mint leaf - too cute.  Interior is traditionally decorated and service was real quick - we were in and out with our meals and dessert in 40 minutes.  Good reliable thai food, exactly what we wanted!", "author": "Mengo Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "I think the best part of this restaurant is that the service and the atmosphere is very homey. The people are all so nice here and love to make sure you have a good experience. One of our dishes was a little bit spicy and she offered to add some more of the meats and veggies into it to dilute the spice. They also gave us a great dessert on the house of sweet rice and mangoes, which was a great touch.\n\nHad: the Roti, and the number 18. The lettuce wraps are also pretty good. And for lunch they've got a great special combo set you can choose from.\n\nI still think that this could be a little more authentic, as I've had a lot of thai food and I think Brown Sugar in Boston is still one of my favorite places to eat at. The knock on here is that the menu is relatively small, and one of my friends ordered something that looked almost exactly like mine....", "author": "Jon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "Our classic Thai restaurant next to our place. Service is good, food is authentic and prices are definitely fine.", "author": "Lionel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "The food and service at the Yukol Place Thai Cuisine restaurant is really great. The waiters are friendly and the food is authentic. Highly recommend the Pad Thai. It was very flavorful and moist. The only setback was that we ordered a fried banana with coconut ice cream and they didn't have bananas.", "author": "Chloe K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "I gotta say...usually I'm disappointed by Thai food.  It always sounds so good in theory, then you get it and its just lackluster.\n\nHowever, Yukol, in my opinion is the best Thai I've ever had.  I'm not a Thai food expert, so all you Thai food enthusiasts may disagree.  But, for the everyday citizen looking for some quality Thai food that bursts with flavors...order from here.\n\nI especially like the Green Curry.  And, I usually DISLIKE Pad Thai.  However, I tried my friend's and it was the best I've ever had.  Get the sticky mango rice too.  Sooo good.  So much better than Osha.  Makes Osha look like PF Changs.  \n\nI do want to note that I've never eaten in-house, just delivery.  However, their delivery is clutch.  Yesssssss.", "author": "Genevieve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "My colleague and I were returning to San Rafael from a meeting in San Francisco and at 3 PM we hadn't had lunch.  Using his new iPhone he found Yukoi as we were driving down Lombard Street.  Just as they were about to put the closed sign in the door window, we knocked.  The friendly waitress let us in.  We were were the only two customers in the place.  Shortly after we sat down a well dressed woman knocked at the closed door.  We heard her explain to the waitress if she could order takeout for five as she was on her way to Napa!  Sure enough they let her in as she waited for her order.\n\nNeedless to say we were impressed but the biggest surprise of all was the lunch--complete with soup, salad and entree.  I have never seen such beautiful food.  Everything was utterly fresh, crisp, colorful.  The cooked vegetables were in a light transparent sauce and unforgettably delicious.  Why can't more restaurants be like this?", "author": "Gasper S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "Love this place! Was looking for a great Thai place in the area and found Yukol Place. On a Thursday night it was really quiet in the dining room, but lots of food going out for delivery. \n\nThe service was amazing, they were really attentive. The food was so reasonably priced and decent portions. Besides all of that it was delicious! Some of the best Thai food I have ever had. Even though their veggie menu is a bit limited, it seems like they can make alot of their dishes and sub in tofu as a protein. Even though it's a trek for me, I need to come back here.", "author": "J E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "I really liked this place.\nThe restaurant was not empty, but EXTREMELY quiet -- calming even.\nThe tom kha soup was delicious and chock full of veggies. I loved it. Mmmmm.\nMy green curry was mighty tasty. They used a lot of the same yummy veggies as were in the tom kha.\nThe thai brown rice was like MN wild rice.\nMy friend ordered poorly - sweet and sour veggies. It was KETCHUP HELL.\nThe waitress was awesome. She was nice, but unobtrusive, knowledgeable and wonderful.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "Looking for the best Thai place in San Francisco, this is one of the places that came up and it didn't disappoint.\n\nFor the appetizer got the roti, which wasn't what I was used to, but still very good. It was more like a pancake, vs a light flaky roti I was expecting. It was served with a light peanut sauce and was tasty.\n\nWe shared 3 entrees, the green curry, shrimp/chicken egglpant stir fry, and pepper grilled pork. All were spot on, the green curry had a good spice to it. The grilled pepper pork was probably the best dish, sliced thing yet still juicy. The stir fry was good, but lacked shrimp.\n\nAll in all, a good place for Thai.", "author": "Eddy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "Very charming place.\nStarted off with this really awesome salad with a blueberry vinaigrette. YES BLUEBERRY! The slivered almonds and cranberries were a great addition to the salad ( I know not very thai, but very delicious).\n\nServer recommended the bbq pork with fried rice. it was really good. The fried rice was really simple, but still very flavorful. Pork was cooked perfectly. The BF got the green curry. Full of perfectly cooked veggies and SPICY! Lots of thai chili's in it. but nonetheless delicious. Will definitely be coming back if we're ever in the neighborhood again.", "author": "Jen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-18", "description": "Really good Thai food and they are great for delivery (only within the Marina, though). I have ordered from them a number of times and highly recommend the Tom Kha coconut soup (I get a half order since I live alone and it is PLENTY), I also like the Pad Thai alot. Other things I have ordered that have never disappointed are the Adam and Eve Salad (I like this over the papaya salad) and the Green Curry (really flavorful, lots of chicken and veggies and not too spicy).\n\nWould love to actually go in and try other things on the menu sometime, rather than ordering takeout solo since its hard to try more than a few things if you live alone.\n\nVery friendly staff and fast delivery, thanks Yukol!", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "My favorite dish is the green curry and shrimp pad thai, It's sooo good that every time I go there I order the same thing. One of the best in the City so far.", "author": "Katelyn D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "A person from Thailand recommended this place.  The curry and mekrong I had was very good.  It's nice inside, but service can be slow.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-08", "description": "The service at this place is phenomenal. The waitresses are very friendly and attentive, they made sure my glass was full of water the second it was half full. Food came out really fast and it tasted good.", "author": "Kimberly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "I've been here to lunch, I've had them deliver dinner, and I've had takeout.  Their food is consistently delicious.  Their spicy eggplant with duck is not greasy like most duck dishes at Thai restaurants.  I enjoy their green curry and pad see ew.\n\nThey really are the best delivery place in the Marina/Cow Hollow/Pac Heights area.  In fact, if they would deliver to SoMa, I'd order from them more often.\n\nWriting this review makes me hungry for Yukoi Thai.", "author": "Becca L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-12", "description": "Best Thai food in the Marina!\n\nThe staff here are really friendly and nice.  My favorites are the curries, the green curry is really good and you can't go wrong with Pad Thai.  I have eaten here and had take out and I prefer to eat-in; for some reason the take out is just not as good.  The prices are not the cheapest but it's worth it!", "author": "Selena G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Ordered delivery a few days ago for dinner. When ordering Thai food I always get pad see yew which Yukol didnt have. So I settled for pad see mauo which was pretty darn tasty plus it was spicy (I love spice!). It had thick rice noodles with shrimp, chicken, and veggies in a garlic chili sauce. I also ordered param pak, assorted veggies and tofu with peanut sauce, which was also really good. The peanut sauce wasn't too thick and the veggies were fresh and crisp. \n\nThe food came quick, the servings pretty generous and reasonably priced. I will be ordering from here again when I want late night Thai food.", "author": "danielle l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "DEE-licious!  \n\nGood location, nice ambiance, friendly service, tasty food and affordable!  \n\nI also liked that they LISTENED to our party's specific request to take any and all peanut base out of the food due to my friend's severe allergy.  Thankfully we all made it out of there in peace (and full bellys) and did not have to call 911!  \n\nThanks Yukol Place!", "author": "Swetha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-25", "description": "My new fave Thai delivery! I got a terrible cold and craved nothing but spicy and soup - this place popped up as a delivery option and I can't believe it's been within blocks of my home for this long and I had no clue! We tried a red curry with chicken, basil beef and silver noodle soup - all delicious; it was exactly what I needed to help my sore throat and stuffed sinuses. Only reasons for a 4-star review: the portions were slightly smaller than I expected for the price, and the delivery took close to an hour.\n\nYukol Thai is now my go-to for Thai food, I can't wait to taste out the rest of the menu!", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "Excellent restaurant!! We had Chicken Pad Thai (instead of shrimp) and was delicious! A great reminder of our trip in Thailand a few years ago!", "author": "Jessy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "I was staying a couple doors down at the Days Inn and as I looked at the menu posted outside a patron entered and said \"It is so good, you have to try it.\"  I ordered #23 and it was delicious - prawns, chicken, coconut sauce, peanuts, spinach and cabbage.  The only bummer was the rice was additional...maybe that's a San Fran thing.", "author": "Julia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "Dear Yelpers,\n\nYou reviewed, and you delivered. Yukoi Thai did not disappoint!\n\nThe service was superb and meal was delectable. \n\nWe will UNDOUBTEDLY be back!", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "Yukol certainly brings its A game. Accordingly, they're a tried and true regular in the delivery rotation. \n\nTonight, we took Mom here after a busy day moving and it was fresh and tasty!  My favourites are your standard yellow thai curry (with chicken) and the Nuer Ob, marinated sirloin beef served on cabbage with chili sauce!", "author": "I. O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "I've been to this restaurant for lunch twice.  Not always crowded, but someone's always inside.  I'm not huge on Thai food like my girlfriend, but everytime i eat here, it's always good.  i've never had anything here i didn't like.  \n\nAlso, portions are large and the price is great.  The service here is very friendly.  So i recommend this restaurant!", "author": "George B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-22", "description": "Fantastic experience!\nWe live in the neighborhood, but had never tried this Thai restaurant. We were craving Asian food, sick of pizza and feeling adventurous. This was an incredible meal. Picking random meals (based on description) we had three delicious dishes and have a left over meal for tomorrow (or midnight). We had spring rolls, green papaya salad and pepper beef (the pad thai is for tomorrow). I was so impressed. The food was hot, delivered faster than we expected and utterly delicious. I'm putting them on autodail tomorrow!\nThe pepper beef came with a HOT sauce that I thoroughly enjoyed and included a large wedge of salad to wrap it in (I just ate the lettuce and had the beef on rice), the green papaya salad was generous and included plenty of peanuts. The spring rolls came with a sweet sauce and was vegetarian (I think). A great meal. One tip: don't try to eat it in bed! it does require dishes as the (carefully wrapped) meals we ordered had sauce.\nI'm very picky and this was a full scale winner.\nOh, and their website is very descriptive.", "author": "Judith B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "Just a little background, I'm absolutely in love with Thai food. Tom Yum, Pad Thai, Drunken Noodles, Larb, Basil anything, Pineapple Fried Rice, green curry, red curry, any curry will be deliciously shoved into my mouth.\n\nBest Thai place evar. Evar? Evar. Went here for a lovely birthday dinner with the lovely friends.\n\nThe place is cozy; not too small and not too big, and decorated beautifully. Our menus were actually made out of wood and opened on small hinges. I delight in the small details.\n\nService was impeccable. Waitresses were friendly and always made sure everything was ok, water glasses were always filled, and plates immediately taken away when we were finished with them. It really made me aware of just how much good service enhances the dining experience.\n\nDuck larb was too salty, but was definitely FLAVORFUL and delicious. Shredded duck meat tossed with mint and other herbs and seasoned with delicious sauce.. we wrapped a spoonful into small leaves of cabbage and chomped down. \n\nRed and green curries were the perfect size and complimented the jasmine rice perfectly. Not too creamy or sweet, and piled with vegetables and meat.\n\nTheir FISH. Omg their fish!! Crispily fried on the outside and TENDER and melt in your mouth delicious on the inside! Sweet and sour sauce and topped with string beans (my FAVORITE kind of beans!). I will eat this everyday. \n \nPad Thai was excellent, though nothing special.\n\nLove this place. If I lived in the Marina, I would just go here/get delivery all day everyday.\n\nP.S. They seemed to be trying for the fanciness a little too much with their plates. Big and taking-up-space rectangles that did some unwanted revolving while we ate.", "author": "Carolyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "One of the best Thai restaurants I've been to,  I always order fish cakes as they vary a lot between thai places.  Theirs are one of the best.    Hey, I  forgot my leftovers , I left the bag on the table,  damn it.    I'll be back soon.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "I called in an order for takeout, so I can't give a review on the full dining experience there quite yet.   But the food itself was very good.  Ordered some basic Pad Thai noodles and the Panang Curry with chicken.  The Pad Thai was very good, and had a very good appearance even in the takeout box.  The Panang was delish and I didn't want to stop eating it.  The portions are pretty generous, especially for the price.  I think it was about $7-$9 per entree (notttt bad).  Will definitely be back.  Definitely one of the good Thai places in the city.", "author": "Juliana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-08", "description": "Ok, I went to this place after I had spent years in a country that lacks Thai food and so maybe my expectations were too high. Or maybe I've been spoiled by a vacation in Thailand or living in Berkeley for 4 years, but either way after reading all the positive reviews from yelp my only reponse can be... seriously?!? My first time here was definitely a one star experience, but I was dragged back by a friend, the name of the restaurant hadn't rung a bell, but the minute I walked in, the lightbulb went off. But by then it was too late to walk out, and we had already spent a good hour arguing over where to eat in the first place.\n\nLuckily my 2nd experience was better than my 1st. But my expectations were extremely low and I was starving. \n\nStarted with Angel Wings - Which I had actually remembered having my first time, it's usually a really good thing or a really bad thing if I remember only one specific dish. In this case, it was a good thing, cause it was the best thing about the meal last time and the best thing about the meal this time. It was piping hot, the chicken was perfectly crispy, and the vermicelli misture inside was cooked wonderfully.\n\nKAENG DANG(Red curry with Pork) - last time I had the green with pork and it was very disappointing. But the red fared better, needed more spice though.\n\nPAD MA KEUR (Sautéed prawn and chicken with Japanese eggplant, egg, onion, and fresh basil in chili garlic sauce) - my friend's favorite dish. The eggplant was soooooo good because it soaked up all the wonderful flavors of the sauce, but the prawn and chicken were both overcooked. If I sat there and picked only at the veggies it woulda been the perfect dish.\n\nSticky Rice covered in Coconut sauce served with fresh mango. It's impossible to have a bad experience with this dish, unless you overcook the rice or something. I remember last time they had run out, so actually that was a bad experience, but this time they had it, and it was warm, gooey, and delicious.\n\nI am convinced that there is no fantastic Thai food in SF, only mediocre. Must drive to Berkeley in the future when the Thai cravings are a-calling.", "author": "Alison T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-17", "description": "Direct Access by Landmark Education brought us to the City for the weekend. Checking with Yelp we found Yukol Thai Cuisine a block from our Hotel. A reviewer recommended the Green Curry...thank you! The curry arrived hot and upon tasting I found a light, full flavored curry and coconut milk flavor that had just the right amount of 'heat'. The shrimp which were plentiful were done to perfection. Oh yes the Silver Rolls appetizer also arrived hot and were presented like a work of art. With the light but robust sweet chili dipping sauce it was a great prelude to the main course. The service was good and the ambiance is authentic, warm and inviting. The rest room might be the cleanest EVER!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-14", "description": "I've become a huge fan of this place for Thai food.. It's more than a typical hole-in-the-wall SF style but still very easy going.  Love the staff here..  Great to bring your folks here as well as have a party with friends, they're great with big groups.  We had a New Year eve dinner here with like 20 people and they were on point.\n\nFood wise is where they win for me.  They really do the spicy right and their dishes are the best tasting Thai food in SF in my opinion.. I'm not Thai though, so I'm not sure how authentic they are.", "author": "greg s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "This place always guarantees good food and great service.  We've been going there for 10+ years and always have the same waitress, she is super efficient and attentive.  I love their soup, duck curry, papaya salad and a fish dish (#50)... We live in San Jose, but it's totally worth the drive to SF for the food...", "author": "Lucy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-10", "description": "Super place!  We have been coming here for years.  Great food, atmosphere, super-clean, excellent prices.  \n\nRichard Clark", "author": "Richard C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-24", "description": "I'm a thai food fanatic, and am always looking for new places to experience. I ordered delivery from here last night, and this place was OK, but not great. Like it says for two starts \"Meh, I've experienced better.\" \n\nThe curry was really spicy (not to my taste) and not as sweet as typical. I didn't love it (and that's saying a lot coming from someone who LOVES thai food). The noodles were OK, but not great.  I was disappointed by the taste of the food.", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-16", "description": "Solid Thai cuisine. Best sit down and take-out Thai in Marina.", "author": "Kennie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Nice experience here.  The food was really good and the service was very good as well.  People are really nice and friendly, seems to be a family run business.  Definitely a place to visit when you go to San Francisco.", "author": "Angie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-25", "description": "I ordered chicken skewers and pad thai from here the other night. I like that their standard pad thai comes with shrimp only- no chicken. Overall, the food was a bit too greasy, but it sure hit the spot. Delivery is prompt.", "author": "Tina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-01", "description": "And... another amazing review for Yukol Place. The food is so good that I can't stop eating it and have to force myself to put it away. \n\nThe Pad Kee Maou is ridiculously delicious. It is actually addicting. Once you start eating it you can't stop until it's all gone... and the portions are huge! \n\nThe Pad Thai is amazing as well. They give you both shrimp and tofu and tons of it! \n\nThey are also the most reasonably priced Thai restaurant in the area. Thai is one of my favorite foods in the world and Yukol is definitely the best place to get Thai food!", "author": "Beth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "I've been to Thailand, absolutely love Thai food and this place is up there with the best I've ever had. Ordered delivery and less than 20 minutes later had some of the most delicious green curry chicken ever. Loaded with chicken and veggies and came piping hot, excellent flavor. Been very disappointed with so many other Thai spots I almost gave up on finding a place in SF. Definitely try Yukol Place!", "author": "KC D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-01", "description": "I hate to write a not good review after all of the good ones I read. \n\nI have had a lot of real Thai and a lot of American Thai and this was def American style Thai. Should have known based on the location, but it has so many good reviews. Should have know based on the location though.\n\nThe beef fried rice which is a core Thai dish was bland and a little dry, The pad thai was not great either. Flavor not really there.. Noodles clumped together. The yellow chicken curry was nice. The spring rolls were pretty good too, but the two main dishes were not good.\n\nIf you have eaten real Thai, I don't recommend this place. If you are really hungry and happen to be standing next to it then, give it a try.\n\nOh, they also took one hour to bring the food to Pac Heights.\n\nSo far the tastiest Thai I have had in SF, and to be honest I haven't had much, is Best of Thai noodle in the Haight. I ate there with my Thai friend who enjoyed it as well.", "author": "Claudia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "Sunny: Craving Thai food one night, we decided to order from Yukol. For 2 people, ordered green curry with a side of rice, garden rolls, and pad thai. We asked for these to be extra spicy. They arrived in ~40 minutes, with delicious smelling, piping hot thai food. The pad thai was the best I have tasted, and the curry with coconut milk was to die for!!! Absolutely delicious! The garden rolls came with a dip, and was still very crispy and hot. Overall, I absolutely look forward to eating these dishes again. \n\nNolan: I have been looking for a good Thai place since I moved to San Francisco, I was so happy when we tried Yukol Thai!  I have found an amazing local thai restaurant.  The pad thai and green curry were delectable.  The serving sizes were more then ample.  We were outside of their delivery range however they were still kind enough to deliver and the food was piping hot when it arrived.  We plan on getting the pad thai again and trying the red curry chicken.", "author": "SunnyandNolan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "Sawaadee Kap, Yukol. \n\nThis is the best Thai food I have had in SF in 12 years of living here. I had seen this place on Lombard a few times but never realized it was so good. In my opinion it was much better than Lemongrass, Pad Thai, Gaittiip and a few other unremarkable places I had tried around town though admittedly I have not been to any of those in the past two years. \n\nYukol has a very clean and serene interior with a distinctive Thai architecture feel to the building entrance. The service on a Sunday evening (few patrons) was fantastic and they literally filled our water glasses after every 1-2 sips and served multiple scoops of rice for us so needless to say they were extremely attentive though I do not know how the service would fare on a busy night (assuming they have those). \n\nI give Yukol 4 1/2 stars for taste/service/ambiance and 3 1/2 for value since the portions are just a bit small and sometimes the shrimp content in a dish is low (like 2 shrimps in the appetizer), though the prices are reasonable at $10-12 per med-small dish. \n\nFor something different and delicious try the Meekrob appetizer #7 (crispy noodles with chicken, shrimp and tofu mixed with a sweet and sour sauce). Yum. [Update note: This appetizer dish had more oil than I thought and although delicious I had an oily after taste for several hours after so go easy on the portions if you try it.]\n\nAlso amazing was the #24 House dish with eggplant, chicken, and shrimp. We also had the Pork Pad Krapow (#34) and while also good it was too similar to the eggplant dish so I probably should have ordered a curry or something more unique. \n\nI should note that all 3 dishes were a bit on the oily side though not as bad as many of the other Asian restaurants around town. I did not really see huge pools of oil or anything but I did notice an oil aftertaste that I had about 30 minutes after I finished eating so people may want to save that after dinner chocolate mint. \n\nOur total for the 2 entrees, brown rice, and the appetizer with 1 sweet Thai tea was $36 plus tip which seemed reasonable given the quality/taste/service and small amount of leftovers. \n\nI will definitely be going back to this place next time I am craving Thai food.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-30", "description": "My review haiku:\n\nClose to BATS improv!\nWhen these people say spicy\nThey really mean it", "author": "Austin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "After checking out several Thai places in the Bay area, this is the best so far.  Each item was very good.  If you like yours a little spicy, be sure to ask for it.  Appetizers were outstanding and the portions were large.  The entree' portions were not huge however.  Service was very good.\n\nPerhaps the best indicator was the fact that there were a lot of regulars who got very happy (and quiet) when their food arrived.  Based on conversations overheard, its perfectly acceptable to go off menu and ask for special preparation of your meal.", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-21", "description": "We came here for Father's Day dinner and everyone LOVED it!.  It's now our favorite Thai restaurant in the city.    Great food, excellent service!  What more can you ask for?\n\nWe started with these appetizers:\n1) Tom Yum Gong sum - Right balance of tart and spiciness\n2) Two of a kind - fried tofu and fried taro root; tofu was under seasoned but the taro was yummy!\n3) Grilled eggplant salad  - Flavor was great and the dressing was a little tangy which was appetizing, but it was a little bit too salty if you eat it with too much of the dressing\n\nFor entree we had:\n1) Green curry w/pork - liked the consistency, some places make it too watery or too thick.  This was just right\n2) Red pumpkin curry w/chicken - again, curry was great consistency.  we were surprised that this was spicier than the green curry which is typically spicier\n3) Pad thai - BEST WE HAD IN YEARS!!!  Right balance of tanginess from the taramind and the noodles were great texture, al dente\n4) Black pepper quail - This was OK, couldn't taste the black pepper\n5)  Crispy snapper w/green beans - Liked the flavor of this dish, would have liked to have a couple more pieces of fish\n\nFor dessert, we had the mango sticky rice which was decent.  We also had 3 beer for a total of $130 which includes tips already.  Pretty good deal!", "author": "Irene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-29", "description": "When I moved to San Francisco back in 2002 one of my first goals was to find my new favorite Thai spot. It turned out to be a pretty difficult feat. There are a TON of Thai restaurants in the city, and I tried quite a few of them before I happened upon Yukol Place. After having my expectations dashed time after time I was thrilled to find this little gem. \n\nThe dining room is intimate yet comfortable, and it's very clean. The staff is friendly and attentive. And the food, made from quality ingredients, is incredibly flavorful. I mean, really... it's DELICIOUS. I'm not an expert on authentic Thai cuisine, but I do know what I like. The only real knock on the place is that it could use a broader selection of dishes to choose from. The menu is just a little bit limited, but what they do they do well. \n\nYukol isn't as cheap as some of the other options in town, but you get what you pay for and really, it's not that pricey all things considered. Hands down, this is my favorite Thai restaurant in San Francisco.", "author": "Don W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-28", "description": "Amazing food. The larb gai and octopi salads to die for.\nThe panang curry is great as well.", "author": "Steph S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-29", "description": "I'm confused how this restaurant is a 4 star restaurant on Yelp.  Its solid, but I think of 4 star places as pretty darn good places, and I don't see this place as any more than average.\n\nI've had take out 3 times and have dined in once.  \n\nPros:\n* dine in, as usual, is a better experience.  Things don't glop together as much and the crispy stuff stays crispier.\n* Angel Wings - these are pretty good.  It would be nice if the portion was a little better.  its solid, not great though.\n* service dining in is attentive and the staff is friendly\n* they deliver - which is a nice bonus\n\nCons:\n* a lot of dishes are similar and not distinctive.  \n* the menu is fairly standard - you can get the usual Thai standards.  I guess that's a positive from a certain perspective (not mine though.)\n* personally, I've sampled maybe half their menu and I've not found one memorable dish that makes me come back.\n\nI guess that's my whole problem with them being a 4 star restaurant.  There's not one signature dish that I really was impressed by, nor does it represent a tremendous deal or anything.  it just blends in with the rash of so-so Thai food in this town (there are few better than mediocre, but that's another review.)  I guess most yelpers have lower standards.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-11", "description": "This is the best Thai delivery place in the area.  Dishes have great flavor and a good amount of spice.  It's affordable and delivery is fast!  My favorites are the Kaeng Dang (Spicy Red Curry) and Phrik Khing Gai Kung (Spicy Shrimp and Chicken with Veggies).", "author": "Christa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-15", "description": "By far the best Thai in the Marina.  Super fast delivery and consistently good food.", "author": "Jacqueline G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-21", "description": "I give this place three stars for the following reasons:\n\n2 stars for awesome food, it really was delicious. truly well done.\n\n1 star for atmosphere and price, super inexpensive for what you get, and its definitely a decent place of food. and the surroundings are well decorated.\n\nBUT\n\nI take away 2 stars for the absolute worst service EVER. I dont know if they were under staffed or didnt anticipate it being busy on a thursday night at 730-8 pm, but it was abysmal, do not plan on getting anything in a timely manner, or asking for anything like drink refills, etc.", "author": "Lauryn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "The food is SO much better than Osha, and much more reasonably priced. It's a local mom & pop, so there's that to tug at your heartstrings.\n\nWe had the coconut milk soup, which as someone else said is the best I've ever had in SF. Also had the panang curry; again, one of my favorites, and the best I've ever had. Pad thai was great, not too strong of a fish sauce flavor. We also had the phrik khing gai kung, which was prawns, chicken, green beans, mushrooms, red peppers, and tomatoes in this sweet-sour-spicy curry sauce (no coconut milk). That was probably the highlight of the night, my boyfriend WAY overate and nearly finished that dish. \n\nOne star removed because, while very polite and kind on the phone and in person, we were not given an option to pay with a credit card. When the delivery person came to the door and I held out my card, they said, \"Ohhhh. I won't be able to give a receipt, I'll have to make a slip on this one.\" When I said I wasn't asked on the phone how I'd be paying (they just said thank you and hung up), they said, \"Oh yes, because we prefer cash.\" I don't want to say it's sneaky, because they totally took my card, but that kind of omission isn't going to do anything but annoy the customer. But like I said, very nice and polite on all fronts. So if you order from them (and you SHOULD!) be sure to tell them you're paying with a credit card before they hang up.", "author": "Sheri B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-03", "description": "I was in search for a new Thai restaurant because my favorite one closed down more than a year ago. Tony V. brought us to Yukol and this is now my place to go the next time I have a craving.\n\nI HEART all the appetizers:\n* Fried Corn Cakes \"Tod Mon Kow Pod\" - it is corn & fried...what's not to love?\n* Chicken and Beef Satay w/ peanut sauce - good balance on the spices\n* Buttercups \"Katong Tong\" - omg....crispy cups filled with garlic shrimp, chicken, and curried veggies\n* You and Me Rolls - off the menu fried rolls wrapped w/ rice noodle....very good indeed\n* Adam and Eve Salad - similar to papaya salad but w/green mango, apples & prawns...also off the menu with great flavors\n* Green Papaya Salad \"Som Tom\" - this was good but I think I liked Adam and Eve more b/c it was a tad too spicy\n* Spicy Prawn Soup with Lemongrass \"Tom Yum Goong\" - I like the amount of tartness...mmm\n\nWas full from above but still really enjoyed:\n* Fried Snapper Fillets w/ Green Beans & chili paste \"Chu Chee Pla Crobb\" - like the snapper fried and with the sauce\n* Panang Beef Curry - sliced beef w/ carrots & mushrooms...beef was a bit over cooked b/c so thin but curry was great\n* Pad Thai - good solid dish\n* Pad Kee Mao - similar to Pad See Ew w/ thick rice noodles but  w/ basil and chili...wasn't as spicy as I preferred but still good b/c I love noodles\n\nRound of thanks to Tony V. again for the introduction and the friendly staff there!", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-05", "description": "Great Thai food and very attentive service. We left feeling so full we actually needed some time to digest before dessert at Ghiradelli.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "Delicious pad Thai...not overly MASSIVE portions like I'm used to. Pleasant staff which is a nice change from the restaurant I checked out yesterday. If I was a local this would definitely be my go to Thai spot!", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-16", "description": "Ive always thought the food here was alright, not really really good but not that bad...\n\nnot that bad until one night...while I was hanging out with Tim he ordered food from Yukol. He loves this place..anyhow though he let me eat this shredded meat dish..I think you eat with lettuce and wrap up the meat in it...doesnt matter..I also had a rice dish..\n\nAnyhow, I thought their was a funny sour smell with that shredded meat dish... but sometimes thai food has that smell...I should of listend to myself the first time. So..ate my food..hung out with Tim and went home. \n\nThat night, while I was sleeping I woke up with incredible pain in my stomach..I ran to the bathroom and well..lets just skip the details..\nand say that..I had fluids coming out from both ends.. AT THE SAME TIME!!!\n\nNOT A PRETTY SIGHT...so from that day on..Ive never really wanted to go eat Thai food..just the sound of it makes me cringe...Ive only been to one Thai place after this incident and that was Chabaa....even then I was still shakey..", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "I eat here about once a week! Their curries are great, its cozy inside, and it just feels fresh, for a good price! Their service is great also!\nI also like their appetizers, and soup! Basil chicken and noodles!", "author": "Jo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "Finally my SF Thai food quest is over!  \n\nThe pad see ew is made with authentic thick noodles, not the fettucine sized ones that most other Thai places serve.  The level of spice is perfect without being overbearing.  The spring rolls are more crispy than greasy.  Prices are looow, service is friendly, great lunch specials. \n\nI heard that they deliver too -- wow, first time I've ever wanted to live closer to the Marina.", "author": "Abby M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-22", "description": "Really really solid thai food.  I'm not a big thai person, but this place is really good.  It's the little details in the food that really showcase the stellar quality of this place.  For example, the vegetables are cooked just right -- not too raw and not too well done.  Prawns are fresh and shelled all the way to the end of the tail.  Dishes are well seasoned, but balanced; not too sweet and not too salty.  Pricing is very reasonable -- roughly $8-10 per dish.\n\nThey have a mango sticky rice dessert that sounds totally awesome, but didn't get a chance to try :(", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "Came here tonight with the boyfriend and was craving thai food! I had yelped thai food in the marina and I was torn between trying Yukol and Tom Yum for the first time...I went with Yukol. \n\nThe ambiance of the restaurant when we walked in was very warm--the employees greeted us instantly and the restaurant was quiet. We ordered the Tom Yum soup and pad thai and both were simply delisssh!! The soup was just perfect--the right amount of sweet to sour! (It's been tough to find good tom yum soup in SF) and the pad thai was super yummy as well. We didn't try dessert but will definately come back to try the fried banana with ice cream. Yum!", "author": "Joy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "Excellent Thai food. I'm a fan!..and I love the fact that they deliver. One of my favorite dishes is the Pad Woon Sen  (#55) Yummy. I wish I had some tonight.", "author": "Jade C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "So good... SF must be spoiled for great Thai if this isn't 5 stars every time, it destroys any Thai I've had outside of SF or NYC, and approaches the sainted SriPraPhai in Queens... Goodness, please move your restaurant to Denver! We had the Tod Mon (#3, fish cakes) to start, really good, and a sign of things to come. Then shared the Pad Kee Maou (#21-- sauteed rice noodles with chicken and shrimp in chili garlic sauce), Moo Kra Tiam (#39 -- thinly sliced pork), and Kaeng Panang (#29, penang curry). I'm not  a very good carnivore, so the revelation of the meal was the Moo Kra Tiam, simply some of the most flavorful meat I've ever had. I would never have ordered it, but so glad that our friend did (her family is from Thailand, and she knew what she was doing!). The Pad Kee Maou was also amazing (a bit like drunken noodles). The penang curry was also good, though not stratospheric like the other dishes. The atmosphere was also nice and what I like in a place, laid back, with more of an authentic family run feel to it, with really sweet and attentive staff. Just a really nice dinner at the end of a really nice day in SF...", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "I was dragged to this place by a hungry dining companion who always does her homework when it comes to food, so I should have known it would blow my mind. Given her intense foodie focus, I might even have predicted my appetite would be sparked just by the descriptions of the food by our super lovely server (who turned out to also be the talented chef!). We ate some delicious appetizer in little fried shells stuffed with curried potatoes and peas which was so, so tasty. Then terrific BBQ chicken and a seafood dish in which the scallops and cuttlefish were cooked to perfection. The chef proudly served my dining companion a couple pieces of pork which apparently had been marinated for a day or so. At this unexpected and apparently delicious treat, my companion was salivating and clearly regretting having brought me to this fine establishment, as I'm not into consuming mammals, so couldn't appreciate the deliciousness of this magical pork. I so wanted to try more dishes and will absolutely return soon--famished and ready to eat.", "author": "Corinne B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-06", "description": "Yelp 4.5 star average.. really? Zagat 24 food... really?? We must have stumbled into the wrong restaurant..\n\nServer-recommended special mango-apple salad was borderline edible - the taste and arrangement was somewhat creative but the prawn meat was NASTY. Bland taste and disgusting texture - chewy and dry (way way way overcooked or just nasty meat?)\n\nChicken green curry was also baaaad - one of the only times I haven't finished a meal. Lots of chicken, but super dry and tasteless. Curry itself was passable. \n\nPad thai again borderline disgusting; soaked through and through with oil, the same nasty prawns, unimpressive tofu.\n\nBoth of us had upset stomachs the whole night because of this meal. One star with no hesitation. Despite the food, good service.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-31", "description": "I can't believe I haven't written a review on this restaurant yet. Maybe it's because there are already 110 reviews. However, I have been coming to this restaurant since 1992 since it was around the corner on Scott St. I moved to the East Coast for 8 years and have eaten at hundreds of Thai restaurants, and nothing compares to Yukol Place. \n\nMy favorites have changed over the years. Back in the day, my father and my main staples were #11, #12, #24, #28 (just had #11 recently again, and it's still amazing!) Now, my husband and I tend to go for #3, #14, #26, #50. The fried bananas and coconut ice cream are fantastic (they make the ice cream there). I hate to admit they have a weakness, but once, about 4 years ago, I ordered a beef dish (don't remember which one), and the beef wasn't very good. Not sure if it was an off day, or what, since I never order beef anyway.\n\nYukol, the chef/owner, is really sweet and comes out often to greet her customers.\n\nOne last comment: bring back the tapioca pudding!", "author": "Jiga M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "Yum yum! Pad see ew! I can totally live off of it! Great service too!!!", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "Consistently good thai food for its value. My boyfriend lives nearby so we frequently get take-out or delivery from Yukol. Their curry and noodles dishes are consistently good. Service was a little slow and the waitresses were a little awkward for my liking. The atmosphere of the place is quiet and slow so it's not a place for a romantic date or a dinner before a girls night out. All in all, good neighborhood thai restaurant.", "author": "Hannah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "This place has delicious homey thai food. Its definitely comfort for me here. Green Curry, pad see yew and pad thai all delicious. I love coming here on a chilly foggy night for a night hot meal. I like that it's half the price of OSHA and tastes more homemade too", "author": "Shivani S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-18", "description": "Quick seating, delicious and inexpensive!  Went here on a Wednesday and the place was half full.  Four of us had 7 or 8 things and one drink and the bill was $70.\n\nThe coconut soup is some of the best I've ever had.  The green curry with duck, my thai food barometer, was very good though not special and not as good as Osha.  Everything else was high quality and tasty.   Service was a little slow but overall a good experience.  Not a place to go out of your way to travel to, but if I were a local I'd get takeout here often.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-26", "description": "Not impressed with the vegan selections, almost all of which contain fish sauce or egg.  I ordered the sweet and sour tofu, which was soggy and tasted too heavily of tomatoes.  My GF loved her vegetable soup, which to the waitresses credit they made without chicken broth.  \n\nThe decor and service were fantastic, but I've had way better thai food in this city.  The prices were average.", "author": "Craig R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "Not much of a fan of Thai food, but we were in SF and needed a place to eat. My uncle was wanting to eat asian food and he came all the way from the land of the Aussie. The 11 of us with two kids pile into this small restaurant. The lighting was so dim I could barely see anything. We finally sat down and started ordering. Everyone looked to me to order so I placed four dishes with two of each dish. The food was very good, but it didn't look like it was going to fill up 11 adults with two kids. Sure enough it did and we even had left overs to bring home. The bill came out to be $220. =O_o=. Only once in a lifetime.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "this place isn't packed on a monday night at 9pm.\n\nthe you and me rolls are delicious. the soup was also wonderful.  the pad thai was pretty normal pad thai, and the yellow curry with chicken came with a quarter chicken instead of chopped up bits of chicken.\n\noverall i had a good time, i'd go back or even grab some takeout from here.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-01", "description": "Sue (waitress with short hair) is wonderfully attentive. The pad thai is awesome (screw Osha!!!! ) and so are the curries.\n\nLunch specials are very reasonably priced; the blueberry mustard dressing with caramelized toasted almonds are SUCH a wonderful touch.\n\nI think on Friday afternoons there is an additional waitress (longer hair) who is not as competent as Sue.... but the food is consistently good, so I go to Yukol at least once a week.", "author": "dj z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "This place is awesome. Good classic Thai food that is not too greasy. I have never had anything here that I didn't like. Gotta try the Plah Pla Muek. Best of all, the staff here is super friendly. When eating in they don't rush you and delivery is always prompt and correct.", "author": "Henri G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-14", "description": "This is the best Thai experience I've had. The waitresses were all incredibly nice and attentive. The food here was great. I had the Larb (great), the Roti (awesome) and the Garden Rolls (great) for starters. I then had the Three Amigos (I know it's funny to get a spanish named dish in a Thai place) which was phenomenal. The taste was fantastic. The tea was great; everything was really just great.\nMy father had mentioned to the waitress that my wife had just graduated from medical school, so they gave us a special treat. We were all very touched. I recommend Yukol Place to everyone.", "author": "Erik S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-05", "description": "Meh - I have recently moved to the city from Emeryville and was excited for the plethora of food options in the city. I can only compare to the Gourmet Ghetto places in Berkeley which are pretty decent, but my experience here was nothing to rave about.\n\nPrompt phone service - good tip about your Credit Card from previous yelper. Over 1 hour delivery due to rain (I'm lazy I could have walked there, so they win for feeding me!) but this was explained to me - very helpful phone service, with accuracy.\n\nPad thai, yellow mild curry, rice, and Tom Kha Pak (veggies in coconut peanut sauce) none seemed to have much flavor. The curry was separated so it was an oil and watery base with chicken and a few potatoes - it could have used some carrots and onions, though the chicken was unbelievably tender! Mushy rice, pad thai is not the best  as the others explain, not sure what's up with that. Enjoyed half my plate and left it. Usually I'm going for seconds. \n\nReheated a quick plate for lunch the next day, and well, it was actually better. I thought this was only the case with pizza!", "author": "Sara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-06", "description": "One of my fav Thai restaurants in the Marina, SF and Bay Area!\n\nThe ambiance is very traditional Thai when you walk in as the staff is decked out in traditional garb. They are super friendly and cool. The restaurant is really clean and there are always fresh flowers in vases. I love that!\n\nHmm...onto the food.\nThe Appetizers are d-e-l-i-c-i-o-u-s! \nMy favs are:\nDuck Larb\nTodd Mon Kow Poad -Fresh corn mixed with ground chicken, fried\nKatong Tong - Crispy little butter cups filled with garlic shrimp, chicken, and curried\n* don't miss the butter cups, I don't know too many places that serve this in the area....they are to die for!\nSoups\nYou can't go wrong with the Tom Yum Goong. Make sure you get the seafood one..and of course SPICEY!\nDishes\nAll the curries are excellent and the perfect consistency - not too thick and very flavorful.\nMy two fav dishes are -\nThe grilled pork and the crispy fillet snapper with green beans.\n\nI love how the produce is so fresh at Yukol. You can always count on really fresh veggies. The cucumber salad is mmm good.\n\nAlways check out the specials. They had a soft shell crab special on there once and it was amazing. The desserts are also incredible. Mango with sticky rice....yum. Oh, and the Thai iced tea is just right. Not too sweet..not too creamy.\n\nThe staff is incredibly kind and patient. We were once there with a large group and several members of the party were a bit loud. The staff was really cool even though some members of our group might have been annoying and even a bit disruptive.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "This isn't Osha Thai.  This is the real deal.  If you want to feel like you have walked into someone's home for some authentic thai this is your place.  The atmosphere is simple, but the food is spectacular.\n\nThe curry is fantastic, but if you are still a Thai virgin you'll enjoy the Pad Thai as well (the california roll of thai)\n\nIf you are on Lombard (or even if you're not) and craving Thai - don't miss this spot.", "author": "Sara Ann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "Mango sticky rice dessert. Amazing.\n\nFood was good, but I most certainly remember the dessert most.\n\nNice decor and very homey. I like that.\n\nService is amazing. Really amazing.\n\nNeed I say more?", "author": "Dolores L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "We order out once a week from here!!  It is sooo good.  Tom Yum Soup, Pad Thai, Eggplant special with chicken and shrimp.... YUMMY!  The Curry is fantastic also! \n\nThe restaurant is great also!  Great atmosphere and friendly fast service!", "author": "Cristof E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "We've always liked Yukol's Place.  Definitely one of our fav Thai restaurants in the bay area.  I find dishes here more unique than your average Thai restaurant.  We LOVE their appetizers, which usually takes up half the dishes on our orders.  Here's a list of what we usually order -\n\n* U & Me Roll - rice noodles covering spring rolls with yummy veggies inside\n* Corn Cakes - Yummmm!  Very sweet corn w/some batter made into cakes that are approximately 3\" in diameter.\n* Buttercups - Absolutely must-have!  Little pastry cups with diced pork/veggies inside.  \n* Sliced pork & beef dipped in green chili sauce - There's a beef, and a pork dish.  Both are very yummy.  The pork one tastes a little like pork jerky.  The chili sauce hits the spot!\n* Fried fish with string beans on top \n\nStaff there is very nice and attentive.  Pricing is not bad at all at $11-30/person.  We've been here with big parties, as well as with friends w/kids.  They're always so sweet and accommodating.  \n\nFor those of you who haven't been here, we definitely recommend you to check it out!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "I've ordered from Yukol from years and it was only last week that I dined in.  I had family in town and we wanted to do something relaxed.  To my pleasant surprise, the restaurant had a wonderful atmosphere.  Fun and lively Thai decorations and great presentation for their food.  What's more is everything we ordered was excellent!", "author": "Susie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-18", "description": "Hidden in a small location, this Thai gem is worth the hunt! The food is very authentic and pleasing to your taste buds! We tried 7 different dishes and they were all very divine! Prices are reasonable and service is great!", "author": "linh d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "I've totally forgot about Yukol.  It's actually a favorite for one of my girlfriends and only discovered it when we went to Yukol for her bday last year.\n\nThe duck salad is awesome, nice and spicy but very refreshing.  We also had some fried appetizers, which included taro and that was really good too.  I do have mention that the service is very intimate, the decor of the restaurant is very lovely.  It's sort of a small restaurant and it appears people make reservations, but we've never had a problem getting seated.\n\nThe chicken curry and the garlic pork (at least I think this is it) is awesome.  Grilled pork can be dry, especially when it's thinly sliced, but it always comes out juicy and the flavoring is just right.  This isn't one of those Thai restaurants where I come to order something over rice or a noodle like pad thai or pad see eww, it's simply better than that.\n\nI'm glad I saw this on Yelp, will try to make a visit to this restaurant sometime soon.", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-31", "description": "Don't bother with this place.  It's a bit expensive and the food wasn't good.  We order the BBQ Chicken.  The chicken was flat and they put some weird sauce over the chicken.  Sometimes I thought I was eating crushed egg shells.  I'd go back if I was starving, they're the only place open and I had no gas.", "author": "Joan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-05", "description": "Your standard average thai restaurant.  Good food, good service, and cheap.  My friend and I split phad thai and the spring rolls.  Both quite delicious!  Plus, I really like the water glasses they use.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-03", "description": "Every time I try a new Thai place in the city I find myself comparing it to Yukol Place.  And Yukol place always wins.  I'm always impressed by the quality and consistency of the food, which is delivered at a reasonable price point.  \n\nDelivery is also above par.  Exceptional packaging, which makes a huge difference.  It's obvious that care is being taken to get the food to you in the same condition that you would expect if you were eating in their dining room.  \n\n5 stars, two thumbs way up, after 20 or so experiences I'm thoroughly impressed.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "I had to yelp this after I noticed my dear roommate (and elite yelper) Kaylan wrote hers.\nThis place is sooooo good, fresh, and savory! Their mango and shrimp salad comes with apples tossed in a light dressing which makes me forget Im eating take-out. I have to agree with other reviewers, their peanut sauce is delish! Basil chicken with brown rice, oh so good!\nGreat for take-out and the ambiance inside is quaint, however Ive never sat down and ate at the restaurant. Very impressed with this place, it rivals Osha now for me (which I love as well)!", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "Good service, great food. My go-to neighborhood Thai place. Recommend drunken noodles. I always dine in for the above average ambiance (for a Thai place).", "author": "Sally N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-29", "description": "This has been the best meal we have had in SF this trip. We went for lunch and $22 bought the two of use: \n- salad w/ hot and sour soup \n- salad, 2 veggie spring rolls, excellent cup of coconut milk soup, and great noodles w/ Asian broccoli and prawns. \n\nThe service was great too. It is pretty w/ some Thai textiles inside. We're fans. And it was in walking distance from our hotel. Darn great all 'round.", "author": "Ahava Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-15", "description": "The food here is really good, and the service is friendly and prompt.  I dig the interior, although sometimes, places decorated like this make me afraid to visit often because it feels like an event coming here.  OK, that's not necessarily true, as Bai Som Thai is decorated similarly and I don't feel uncomfortable walking into there.\n\nOK, so the food is good.  The service is good.  Nice vibe on a hit-or-miss part of Lombard.\n\nUPDATE:  7/2/12\n=============\n\nUnfortunately, I must issue a GRATUITOUS-MEAT ALERT for Yukol Place.  I understand that the VEGGIE'S section of the menu says that diners should alert their server if they cannot eat chicken broth, oyster sauce, and fish sauce.  Thanks for the warning, but when I alerted our server, she said the only items on the entire menu that could be made without fish sauce were Nos. 21 and 55.  Two items out of dozens?  Fine, except that neither of those items is listed under VEGGIE's, so it's a real possibility that the chef will be so focused on not using fish oil that he'll forget to hold the meat that normally comes with both dishes.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "Great Thai food and friendly folks.  Superior neighborhood place.  The \"You & Me\" rolls are wonderful also basil chicken!  Not expensive.  Great for before or after another event or for tourists who are staying in the neighborhood.  Very close to \"trendy\" Chestnut St., but quieter.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-15", "description": "Just had some simply scrumptious Pad Thai here during lunch. Great portion for lunch and to-go. Good prices. I love that they give you the warm noodle,tofu,scallion, peanut , your choice meat etc.mixture and then leave the sprouts crisp,cold on the side for you to mix in with the wedge of lime.\n\nI've been on a lime kick lately, maybe it was all those caipirinhas when I was in Brazil..", "author": "Tera M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "Delicious, cozy, inexpensive. Recommend the green & red curries, as well as the pad thai. Will return!", "author": "Ali G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "I used to come here frequently many years ago and was there again for the first time after 3 years last Friday. Nothing has changed. The food is still excellent and the service friendly. There were some authentic Thai people dining in the restaurant, which is always a good sign. \n\nWe had Pad Thai, chicken with Japanese eggplant, and Red Curry with chicken - all of which was filled with excellent flavors. \n\nI also liked that my eggplant dish didn't swim in a pool of grease as it does in many other places. \n\nI would highly recommend that you give this place with modest decor a try. I think you'll find it to be a good experience.", "author": "Jana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "This place is great. The service is very friendly and I love how they don't \"nickel and dime\" you to death - I ordered too much food so I decided to take home the leftovers. I asked for a little peanut sauce on the side (because I did manage to polish that off during the first go-around) and the very nice waitress put some in at no charge. This is what I'm talkin' about people!! - more restaurants need to do this type of thing. What did that cost them ? - $0.02 ?? - next to nothing basically - but what did it do? - made me a loyal customer. Other restaurants take note - throwing in a free bottle of beer once in a while, a free side of hollandaise sauce, some extra peanut sauce with a take-out order ---- that's what helps you build a loyal clientele. Know what I mean??", "author": "Ashleyanne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-19", "description": "Been here a few times, mostly getting take out. The food is awesome here. The Pad Thai and the Angel Wings are to die for! The only complaint i would have would be the actual service. It seemed a little slow, and i noticed that people who arrived after me were served first. Still a fan of this hidden jem. i will defiantly be going back!", "author": "Vanessa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-27", "description": "I love Thai fat noodles with chicken and basil with enough of a kick that you can still enjoy your food and feel some heat. \n\nExcellent Thai food, the service was friendly and accommodating. \n\nLunch specials were reasonable and it includes a small salad with the most delicious sweet toasted almonds.  \n\nOnly downer, when you have to pay a ridiculous 25cents for a lousy 10 minutes on a meter.  Eight quarters  only gives you and 1 hr and 20 minutes.  Pbbbfffftttttt.........!!!", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "Awesome service and great thai food, prices are good too", "author": "Monica A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-09", "description": "Maybe we ordered the wrong stuff, but the vege green curry was too spicy and actually had fish sauce in it, and the Chinese broccoli was bitter and tasted weird. We didn't like it.", "author": "Saul F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "Best Pad Thai in the city!", "author": "Mimi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "Since the closing of Narai, I've been in search of an authentic thai restaurant to satisfy my cravings for thai food. I think I may have just found it.\n\nThe interior decor is cozy. I love the painting of the thai lady on the menu. It's simple, yet elegant. If I had that painting, I'd definitely hang it up on my wall. Not sure my wife would agree and that's one reason why we need a bigger house.\n\nThe food is what has me wanting to come back for more though. I'd recommend anything on the menu. There wasn't a single dish I didn't like and I came here with three other big eaters, so we ordered quite a few items. Everything was very flavorful without being too salty.\n\nTo top off the five star rating, the prices are reasonable and the wait staff is very friendly and attentive.", "author": "Edward T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-26", "description": "Always order the Panang Curry with Chicken and the Pad Thai with Chicken. Brown rice for two, order one large (especially if your eating with a guy). \nThe delivery people are always nice and on time. Love this place!", "author": "Julia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "A small group of us hit this joint after a looong late morning on Alcatraz.  Our next stop was Muir Woods, but not before we grabbed ourselves some grub.\n\nWe arrived on the late side of lunch, but wow, how nice to get service with a smile.  Was the perfect pitstop.\n\nI had the green curry lunch.  The salad had a raspberry dressing, which didn't seem Thai, but whatever: it was yummy nonetheless.  Hubby had Thai basil chicken.  Food was hot but tasty.  I think all four of us cleaned our plates.", "author": "Goodbers G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-15", "description": "The best Thai food I have ever had.  A friend introduced me to this place when I lived in the East Bay.  It's was definitely worth the drive to the marina.  Now when I visit the Bay Area I make a point to come here.\n\nThe service is always quick and they are always more than willing to accommodate special requests (like no fish sauce for vegetarians).  Their specials always hit the spot, especially the curry corn cakes.", "author": "Annie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "Best Thai in San Francisco and most representative of what you'd find when you're there.  I assess Thai restaurants by their panang curry and Yukol made the grade.  Fresh ingredients are the key here and they do it well.", "author": "Will L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "edible, but average. \n\nthe duck curry was really oily and I could not eat the meat at all. I tried to but it tasted really weird and old, like the duck was cooked somewhere else, separate from the curry. \n\nStick to chicken or tofu. \nthe chicken in my silver noodles and the three shrimp were quite good, but the silver noodles, which I normally LOVE, were below average. \n\nthe green papaya salad--below average and not enough dressing. it's all about the dressing w/ the thai salad's afterall.\n..\neven the fried prawns app was only average.\n\nI thought the marina had better thai than other parts of the city, but I think I was wrong.", "author": "shanestar h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "I have been coming to this restaurant for almost 20 years, first when it was located on Scott Street btwn Lombard and Chestnut. I have eaten in most of the Thai places in SF, and live in NYC part time, and travel a lot for work and my wife and I have never had better Thai food than Yukol Place.  Their ingredients are fresh and the are full seasoned (not spicy if you ask them but a LOT of flavor).  I have brought dozens of folks to it over the years and they all have agreed that it's some of the best, and in some cases, original Thai places they've been to.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-04", "description": "3.5 kind of place.  Good Thai food - the Roti was super tasty as was the noodle dish we got (forgot the name but the only one with the flat wide noodles).  The service was excellent.  Prices incredibly affordable -- we got 4 or 5 dishes with drinks (wine for me, Thai tea for him) and dessert all for $50.  \nWill def. make trips back here -- apparently I need to try the green curry and since they do take-out it is more than likely that my next Yukol experience will be sometime soon!", "author": "Katie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-06", "description": "In my kick this week to yelp a bunch of places I've neglected to yelp, here's another.\n\nOne of my friends thinks Yukol is the best Thai place in the Marina/Cow Hollow area...while I'd love to hate on it and say that they got the \"Yuk\" part correct (because wouldn't that be clever and endearing???), the truth is that the food is solid.\n\nThey are nice.  They don't use white meat for the chicken dishes, but will let you substitute all white meat in the order.  \n\nThey  have an excellent \"MIENG MEE KROB,\" which in case you've never had, is one of my favorite Thai dishes, and thus, must be one of the best thai dishes out there because I rule.  It's a great appetizer.\n\nMy curry dish was not bad. However, other dishes I've tasted were not quite as great.  Why not more stars? Because I'd rather go to Gatip (roughly across the street and a few blocks down from Yukol) or Osha Thai, even though both are less convenient for me.  This doesn't mean I hate you though Yukol...please don't spit in my food or anything.", "author": "Brett J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-19", "description": "Excellent, excellent thai food. \n\nService is very good, atmosphere \"casual romantic\" - a place to go on a teenth date (if you get up to this many).\n\nI especially like their \"Japanese eggplant with chicken\". Also, the fried banana is something not to miss at the end of the dinner.\n\nMmm.", "author": "ivan s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-24", "description": "Yukol's Place Thai Cuisine\n\n\nThis place is acceptable.   Good, but not great.  I would place it mid-line with Thai restaurants I have been to in North America.  This is \"neighborhood Thai.\"  I would go again, but only if I was near by and only after I had tried other Thai places in the area.  This is not a place to drive across town to visit by any means.\n\nStaff are friendly, décor is mid-line.  Fresh flowers are a nice touch.  Food was good, but I noticed shortcuts in the preparation that told me the kitchen staff were cooking by rote and without any real sense of pride or passion.  I was also told sticky rice was available as a part of dessert only and not with meals.\n\nIn sum: Not a place to avoid by any means, but with so many options near by, it is not likely I will go back.", "author": "C. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "My mom and I went here for dinner, pretty solid.  First off, in parking-strapped Marina, there is a parking structure right around the corner, which is nice.  \n\nWe ordered the egg, lettuce, cucumber, and peanut sauce salad to start that was very good.  Hardly ever do you find a good salad in a Thai restuarant, I mean, sometimes you get the cucumber salad which is nice, but not really what we Americans look for in a salad.  Above dec.\n\nWe then had the coconut milk chicken curry soup which was good, not great.  I'd probably try something else next time, as this is a pretty standard fare at all Thai restaurants.  \n\nFor the main meal we had one of their \"house specials,\" a pan-fried flour noodle with chinese broccoli, egg, and some good spices.  It was a hot dish, but not too overwhelming that it blocked out the taste of the meal.  \n\nI would definitely come here again, looking to try all their other dishes, as they all seemed really good!", "author": "Ben K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "I like yummy Thai food.  I like having a calm stomach.  Yukoi allowed me to have both.  I am so happy with my experience, I have to share!\n\nFirst, I ordered late on a Sunday night.  They not only agreed to deliver after their normal delivery hours, they were nice enough to go out of their normal delivery range for me.  They were here fast, too!  (Ok, so I gave the driver a $10 tip.  What do you think average is?  $5? Am I off?)\n\nSecond, the food wasn't canned veggies sopping in oil and overly or under cooked noodles.  Fresh veggies: zucchini, Jullian carrots and green beans; fluffy sticky rice; and yummy flavor.\n \nMy vegan brother called his dish average.  He said it could have used more flavor.    \n\nI liked the flavor of the yellow curry and the chicken wasn't all fat and nasty chunks.\n\nI always order the pad sew ew as a staple, almost as a matter of principle to measure against the next time I order it.  The veggies were better than almost any other place I have tried here and the tofu was done well, but there wasn't much there.\n\nI wasn't in love with the veggie rolls, but the sauce was nice.\n\nAlso, nothing was spicy, but I didn't order it spicy. I guess this is a good thing for people who don't like spice.\n\nOh, I almost forgot...their website was down so I couldn't order from a menu.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "The Panang and Green Curry are both solid choices.  I can't comment much on the dine-in experience since I've never actually eaten there, but as a take-out connoisseur and frequent visitor I've gotta give Yukol Place 5 enthusiastic stars.", "author": "Brett N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "Had the cashew nut chicken and chicken w/ black fungus which both looked and tasted pretty much the same . Both dishes tasted decent although it seemed to be lacking some flavor .... also , the chicken was overcooked . The #1 crispy rolls which were very yummy though and the thai iced tea was decent .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "recommended for takeout - delicious and efficient.\n\npad kee mao with chicken was one of the best.", "author": "Josie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "Goodness, mmmmm I had a good experience here, inexpensive, super speedy service, happy worker, while I'm starving... hey hey, can't ask for more!", "author": "Monika T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-06", "description": "We went here last night and everything was great, especially the service. The place was completely full and we were treated very well. The food was delicious and all of the staff was very nice. Will definitely go back if we are in the area again.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-13", "description": "First off I would like to say that Thai food is one of my favorite cuisines. Probably number two on my top five list with Korean food taking a slim lead. So I'm pretty critical about Thai food. I went here during lunch with my cousin who recommended this place. First off, the decor is so charming! It's a small intimate setting, but places like this are my favorite. I ordered chicken green curry and I assumed it would be a really small portion because it was on the lunch menu. OHHH MY GOODNESS. It was not even small at all. The green curry came in a bowl with a side rice and they were not skimpy on the chicken. It was THE best green curry I've had. I cannot even begin to explain my experience to you. Loved it loved it loved it.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-26", "description": "I thought the food was pretty good, I am a vegetarian and they had a pretty good selection.  I did find that they put a bit too much cilantro in their soup... \n\nService was good, food not bad, decor average.\n\nCheers, \n\nAndrew", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "Love it. The sticky rice mango pudding is delish.\nEverything tastes great... the best Thai food i've eaten in the city.", "author": "A T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-20", "description": "We visited this place while in S.F. on our honeymoon. Thai food is my fave.....the service was great, the food was yummy, the atmosphere was cute. We loved our stuff. I would go back time & again!", "author": "Marisa T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-20", "description": "Don't know why this had good review, it was close to awful!  Tried angel wings based on reviews, decent but nothing to brag about.  The chicken larb was soaked with fish sauce to the point it's almost inedible (and I LOVE fish sauce)!  The green chicken curry was tasteless except for the hot spice.  The place was too dark. Will not come back here.  So many more better places in the city.", "author": "Grace M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "Solid 4 stars.  These guys take big old pieces of shrimp and fry them up in crispy noodles--  I've never seen this done before and I like it.  Overall, everything was hot and tasty and the ambiance was relaxed and friendly.  Definitely a good affordable choice when you're in the Marina area.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "Just ordered from here after reading other reviews on Yelp and we weren't disappointed!  \n\nThe delivery was fast and friendly.  We had the Tom Kha Gai and crispy rolls to start which were both great.  The green curry was delicious too.  The Pad Woon Sen was good, but just a little boring.  But I look forward to trying the Pad Kee Maou next time which was what I actually wanted but it was not in the 'noodle' section on the website.\n\nWe will order from here again.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-10", "description": "After a long day in the city, we were craving Thai, and this hit the spot! The servers were very polite and prompt on filling drinks and taking care of our needs. Very delicious Thai food! The chicken coconut soup was fantastic! The perfect mix of spices, slightly on the spicy side, with warm, robust coconut milk flavor, and chunky pieces of meat, mushrooms, etc. The Pud Thai was very flavorful and didn't have that day old taste that it can get. The atmosphere and decor was a weird mix of \"traditional\" Thai, but comfortable. We'll definitely go back!", "author": "Jeromy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-20", "description": "Seriously good Thai food. The special with eggplant, chicken and prawns is just as good as Lemongrass and the service is excellent. When I stop in for take out I have 5 people sweetly smiling and offering tea or water. Very nice people, affordable and a welcoming retreat from Marina crowds.", "author": "polina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "My friends and I came upon Yukol Place by accident, but we had a great dinner. The food was really good and the service was awesome. The kitchen had run out of the special on the menu, but the chef made something else for us and it was delicious. Our lovely waitress had everything on the menu memorized and gave great recommendations for everyone at the table, even taking allergies and spice preferences into consideration. I loved the red curry chicken dish I ordered. I'd definitely recommend this place for a good, casual Thai meal.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "I'm in search of my favorite ethnic cusine and so far, for thai this is the spot.\nI've had take out twice and both times, everything was deliciious. the green curry, eggplant with chicken, the pad thai, angel wings were all very solid.   \n\nThe food was ready, hot and portions are a good size. I also like Osha on Union, but this is better value and probably better tasting.\n \nI could give it five stars, but then there is nothing that compares to thai food served on the beaches of Thailand.", "author": "K L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "Since I moved from Brazil to San Francisco I come here often! It's so traditional and real... they have flowers in all tables, classical music in the background, some welcoming goddess facing the door and the service was always great! The food makes me happy, specially the pad kee mao! I plan to come back a lot of times...", "author": "Marcella N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-06", "description": "This place is good.  I was pleasntly surprised by the quality of their food.  The Green Curry sauce was fantastic.  Some good spice and flavor.  I enjoyed all of our dishes and the coccunut soup was not too bad also.  The service was solid and with the check you get mini knockoff peppermint patties which are great.  Reasonable prices and good food.  I will be back.", "author": "Harry E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-13", "description": "Business must be really good when they refuse to deliver only a mile from their location - advise finding a place that actually WANTS customers!", "author": "Jim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-22", "description": "Yukol has been my favorite neighborhood Thai restaurant for 15 years! The staff is very friendly and the food never disappoints. The mango with sticky rice (and I also order a scoop of coconut ice  cream to go on top) is simply to die for!", "author": "Angela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "I tried this place based on yelp reviews and it was even better than I had hoped!  I went on a relatively slow Sunday night.  Service was good and the food was excellent!  I am hoping to make this place my go-to for Thai.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "Found this when looking for Thai after Exploratrium closed. Easy several block walk from museum. Prompt service and excellent food. Salmon curry was special of the night and was great. Duck curry equally yummy. Flavorful, appropriate portions and family friendly. Will go back when in the neighborhood.", "author": "Ken C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-26", "description": "This is the place i usually go if i want to sit down and enjoy some thai.  Their curries are awesome (especially the green curry).  I highly recommend the pad kee mao.  It is about a dollar more per entree than a couple other places in the near area, but i think that it is worth the price.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-09", "description": "We come here for lunch often. Not a bad place compared to others in the area.  3 stars for forgetting to put baby corn in a baby corn dish!", "author": "V s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-06", "description": "Like 1 liter of oil and tiny bit of curry? Perfect place for you. At least we got our money back.", "author": "Fred D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-10", "description": "This is the kind of fabulous local restaurant that you look for when you move to a new town or neighborhood.  Friendly service, great food, and a pleasant, if not particularly interesting, environment.  The curries and soups are excellent and the seafood is very fresh.  If you really like your Thai food spicy, make sure you drive that point home clearly and ask for it \"Thai hot, not wimpy American hot\".  They'll accomodate.  One slight disappointment was their Pad Thai - but since you can get that anywhere, it's not a big loss - could also have just been an off night, so don't hesitate to give them a try.  In the short time I've lived in SF, I've become a regular!", "author": "Josh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "Nice atmosphere with seemingly random table and wall art, but I wouldn't have it any other way. Staff is super friendly. Good food. I may be a bit biased just because I like the area it's in. It's also nice that theres a public parking structure at the end of the block, even though it may be full.", "author": "Will T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-29", "description": "I am still waiting for my order of Pad Thai and Pad See Ew...it has been over an hour and a half!! They told us it would take 30-45 minutes...I called them several times, and they apologized and said it would only be another 15 mins. 40 mins later I called once again and told them that I wanted to cancel my order (it was getting very late), and was only told 'sorry about that'. No offer to give us the food for free or anything...\n\nI can't rate the food as I never saw any of it...", "author": "Paige K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-09", "description": "When I think about eating Thai, Yukol Place is always the first place I think of- it just depends where I am in the city and how long I'm willing to wait to eat while in transit.\n\nI'm not a fan of the restaurant location being right on Lombard street, which makes parking difficult, but the restaurant itself is nicely decorated with traditional Thai paintings and wood carvings. There are never large crowds at the restaurant, which people walking by might think the food's not that great, but it really is.\n\nThe menu is traditional Thai and I'm sure you could get many of the dishes at other higher end Thai restaurants, but Yukol just does it so well. I don't remember the names of the three dishes I always get but I believe they're #22, #17 and #36, but don't trust me on that. \n\nThe servers are very friendly and attentive, but not overbearing.", "author": "Samantha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-07", "description": "For years my buddie has been talking about this place. Well, since it is right around the corner from my house........it only took me like 2 years to get over there. And my friend was right........this place kicks ass. If you love Thai food I don't think you should take the 2 year wait that I did.", "author": "tom h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-23", "description": "*Updated!*\n\nMy first visit only warranted a 3.  The food wasn't great, but decent.  The last visit changed my opinion.  I'm not sure if it is a hit and miss situation, but I'm leaning towards it being a dish selection issue.  \n\nLook & Feel:  The place is not what you would expect from the outside.  It's clean and decorated nicely.  You can definitely show up casual and feel right at home.  \n\nService:  the wait staff was great.  Water was consistently filled, rice was served, and plates were cleared timely.  The place was not super busy, so that could have been why we received extra attention.  The place started to fill as we left and most customers looked like repeat visitors.  \n\nFood:  I wouldn't consider myself an expert on Thai food, but I have visited many places all throughout the bay area and think I have a good handle on what is top notch.   The marinated beef dish seemed dry, although the accompanying chili sauce was excellent and the flavor was good.  We had the Pad See Maoeu (flat rice noodles) and that was tasty, but was overwhelmed with veggies.  The balance of sweetness was spot on, but it just seemed like I wanted more noodles.  We had to have a curry dish to round things out and the duck got the nod.  As far as the curry goes, it had great flavor.  There was a nice heat to it and felt balanced.  As for the duck, 95% of it was butchered well but I did get a big chunk of ligament which required removal.  I topped off my meal with a hot thai coffee, which came nicely presented.  I'd say this was my highlight of this dining adventure.  Upon my 2nd visit, I had the pad thai, boneless curry chicken w/potatoes, and a corn/chicken/pork appetizer that looked like a deep fried fritter.  All of those dishes were excellent.  The chicken was tender, the pad thai was  not overloaded with fish sauce, and the curry sauce was perfect.  \n\nPricing:  we got out of there for $45 with tip.  This included 3 dishes, a glass of wine, and my coffee.  For the marina, this is pretty hard to beat.  Unless of course, you go to the other thai place (Gatip).\n\nStick with the standard Thai dishes and you won't be disappointed.", "author": "Simon Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-25", "description": "Far and away our favorite Thai place.  Excellent food, great prices, consistent service, lovely decor.  We come back all the time.", "author": "Beth T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-26", "description": "Decent Thai food restaurant. Nothing special. Service was good and friendly.", "author": "k x."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-05", "description": "Didn't love the food but it was decent for the price.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-06", "description": "I know...satay is so pedestrian.  But it rocks here.  and the peanut dipping sauce is amazing.  i could have that with rice.  to continue, calamari salad (nice spice), and the thai egg rolls are all great starters.  Went with eggplant and shrimp, seafood claypot, pad thai (because I love pad thai) and beef with red curry.  Everything was GREAT.  there wasn't one thing i'd say was \"ehh\" about it.  And we were celebrating my husband's birthday, and they presented the cake and even sang.  The people are lovely and so kind.  Attentive service AND great food?!  a definite keeper!", "author": "Sonia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "I really liked one of the green curries...it was really tasty. I have had better pad thai other places, but the curry was really great. I'd go back to try some of the other dishes.", "author": "Glaciala A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-27", "description": "I love Thai food, and this place is awesome!! It has pretty good prices, especially considering its location. Plus, the food is incredible! I have been here a few times, and every time it has been delicious. The first time we went, it was at lunch, so the atmosphere was very casual. The next time, we went for dinner, and it actually had ambiance! It was romantic and sweet, with candles and dimmed lights. I loved it. It was a great touch and just added to the great food and service. The only downside is parking... once, we wound up driving around for 30 minutes looking for parking. But it's not really Yukol Place's fault that there's no parking... right? Bottom line is, this is top of the line Thai food in SF--if you haven't tried it, you need to.", "author": "Bridgette A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-26", "description": "SO delicious and good prices. Found the place via Yelp, so thanks to the previous reviewers. the beginning part of dinner would leave one with reservations, but the food turned out so yummy and the bill was surprisingly small that I felt compelled to share my experience and highly recommend that you try it too. \n\nI went on a Monday around 7pm and the place was deserted except one couple.  There were multiple take-out orders though, but it was upsetting when those customers placed their order after mine but got their food first. \n\nAnother thing, I despise the outrageous charge for rice ($1.50 for white rice  and $2.50 for brown), so I planned on getting a noodle dish to avoid it. My husband and his brother got #18 (wide noodles with chicken, shrimp, basil) that they thought were fantastic. I got #21 (chicken, Japanese eggplant, bell peppers, basil) that I thought came with noodles. When I found out it didn't, I asked for some plain thin rice noodles, which I wasn't happy about at first, but found it a worthwhile move in the end. My dish was SO good I didn't want to stop eating. Hope the restaurant would consider making it standard to include noodles with dish #21. \n\nOverall spent $24 (that included 15% tip) for three people's dinners plus one drink. My order was big enough to have lunch the next day too. Would definitely come back when I'm in SF again.", "author": "Helen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-24", "description": "Really good neighborhood find.  It's really warm and cozy inside.  Always friendly service.  The seasoned cornish game hen is awesome.  The green curry is nice and spicy.  The beef sirloin in garlic hot sauce is great.  Oh and the Tom Ka Gai soup is sooo good.  They deliver, too.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-10", "description": "Friendly service, delicious Thai Food. Good for take out or dining in.", "author": "Mellie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-19", "description": "4.5 stars\n\nhave had delivery from here a few hundred times and have been sooo impressed!! some of the best peanut sauce I have EVER had!! and they make sure and put TONS of it on their salad & pad thai is really good (and great leftover!).\nthey have perfected their delivery service as they can drop off a couple of thai iced teas with the lids taped so as not to spill, no prob lickity split.\nfriendly service, A+ peanut sauce, great food!!\ni am happy =)\nthe only bad thing i could say is the tofu was a bit soggy in my salad the other night. =(", "author": "Kaylan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-04", "description": "To add my $0.02, this place is tasty as the other reviewers write...AND they deliver to my 'hood. KEY. I choose them over the 2 other Thai places within walking distance of my in Lower Pac Heights b/c of taste & portion size.", "author": "Liz K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-23", "description": "I had one of the worst nights of my life here. It was my birthday to boot. Not to blame the restaurant but the our waitress had the exact same voice and intonations as a landlord that evicted me, my boyfriend at the time hooked up with one of my favorite new friends, and the food was mediocre. Not that i could even eat much of it. I did like some spicy shrimp dish but here in the bay Area where there is a Thai Restaurant every block, dont bother coming here.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-14", "description": "I love this place.  The staff are super friendly and courteous.  It's a family owned business that consistently serves up great Thai food and reasonable prices.  They are super friendly and I will go nowhere else for my Thai food.  I have been going there for over 10 years and hope they stay around forever!", "author": "Channie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "This was the best Thai food I've had in the Bay Area. The waitstaff was very friendly, the food was delivered fast and everything so was fresh and tasty. I think everyone should go there. It was YUM!", "author": "Jasmine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-15", "description": "I have eaten here so many times since I moved to Northern California that I have lost track. We live over an hour from the city, but make the trek just to eat here. GET THE YOU and ME rolls!! I spelled it wrong, sorry. Everything here is superb and the service couldn't be better. The best Thai food we have had in the bay area!", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-24", "description": "So, I was very excited about this place, hearing good things from my friends and all.  Above the small amount of vegetarian items on the menu there was a disclaimer \"please tell wait staff if you cannot eat animal ingredients such as fish sauce, chicken stock, etc. so we can accommodate you.\" Well everything was made with the fish sauce except about two dishes, which diminished their vegetarian section by about 80%. There were only two dishes that were completely veg! Also, they ran out of tofu! Who runs out of tofu at a thai place? The food was whatevs. Extra star for the yummzy brown rice. So many better Thai places in the city!", "author": "sirena m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "I like this place. The food is very good, the price is right and the people are incredibly nice and accommodating. \n     I found them while searching through the SF Chronicle ratings. If you haven't noticed there are very few 2 1/2 stars with only 2$$. This is one of them. I have to agree with the Chronicle review. I have brought several friends here and they all rave about it.\n   My favorite are their green curry dishes.", "author": "Stella N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-06", "description": "Nuer Ob (the beef with pepper and thai spices) is great! Tasty, tender, and flavorful.  The other dishes I've had, amongst them, green curry beef and the chicken stir fry dishes, are just okay.  The restaurant is casual, oddly decorated and quiet, (usually couples it seems).", "author": "Ben D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "This place delivered delicious Thai food to our house!  We loved everything, yum.  I will order from Yukol Thai again!\n\n26.   KAENG KIEW WARN - Choice of beef, chicken, or pork in spicy curry with green bean, bamboo shoots, eggplant, cauliflower, zucchini, baby corn and a touch of basil.\n\n32.   GAI PAD KHING - Sautéed sliced chicken with ginger, onions, tomatoes and black fungus.  \n\n56.   PAD THAI - Pan-fried Thai style rice noodles with shrimp, tofu, ground peanuts, tofu, egg and bean sprouts in tamarind sauce.", "author": "Leah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "We were the first to arrive at 5pm on Saturday right when they opened.  In a matter of 10 minutes, 4 more groups showed up.  This must be a popular place.  The restaurant was very clean and cozy.  The service was on point and the food arrived quicker then expected.  We ordered #53 (sizzling seafood plate with chili sauce $14) and #28 (Duck curry made with coconut milk $11).  I can't explain how good the food tasted.  Very flavorful.  The dishes were big enough for 2 people to share and have some leftovers.  Price was very reasonable for 2 plates and 2 servings of rice ($31).  Location is right off the Golden Gate bridge on Lombard.  I will be back for more of that coconut sauce.  Oh and we asked for a little less spice in our dishes and it came out perfect.  I heard they have pretty spicy food here.", "author": "nima s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-22", "description": "Do not order any of the prawn dishes. The red curry prawn dish came with maybe three prawns and a lot of green beans. Very disappointing.", "author": "Kim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-11", "description": "This place is damn good for your local thai joint. I am a spring roll junkie (and snob) so I know that I have found a good place when I actually love the spring rolls.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-19", "description": "Little diamond in the rough. The nicest service, very affordable, appetizers are great, so far everything was great... can't give this place enough praise.", "author": "Cary Elizabeth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-20", "description": "I've only ever ordered take out from here.  Admittedly, I am not the most adventurous food person, so I claim no knowledge of its authenticity.  But, I really enjoy the pad thai (very flavorful compared to my previous delivery place) and the garden rolls.  Relatively prompt delivery (30 - 60 minutes depending on the time of day).  Friendly and efficient phone service.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-30", "description": "Yummy yummy Yukol! Oh how I love this place. They have a huge menu chock full of goodness. Their salads are unreal. Everything I've ordered is great. And I wash it all down with a delicious Saketini.\n\nThey also do takeout and delivery.", "author": "Robyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-12", "description": "I LOVE YOKUL PLACE. The service is always friendly. It is always time to have dinner at Yokul Place. I have been coming to this restaurant since i was a grade school student. This place introduced me to the rainbow of curry. Green, Red, and Yellow curry, all delicious in their own way. My favorite is the duck curry. Angel wings, fish cakes, and the papaya salad are always tasty treats to start your meal. Tom Yum Goong and Pad Thai never fail. Add curry and copious amounts of rice, and you have yourself the most perfect Thai food experience available in San Francisco.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-15", "description": "Yukol's Place Rocks! A friendly place to dine that features good food at an affordable price. The lovely staff always giggle when I speak Thai ... does that mean my Thai is that bad or that good??? We live in the 'hood so we go there regularly for their curries and specials. On a cold foggy night Tom Yum soup warms the body and the soul ... peppery and hot! The food is yummy and the ingredients are always fresh. Sawadee!", "author": "Felix R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "This is a great Thai place.  Nice atmosphere to sit down, but even better if you call and get it to go at home.  Big fan.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "This is one of those places you aren't expecting to be excited by, but end up making it one of your usual places for either dining in or taking out. The combination of low key atmosphere, delicious food, great wait staff, and decent prices makes it my new favorite local spot for Thai food.", "author": "Beth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-08", "description": "I love this place. My first experience was during one of the power outages in December. \n\nIt had been a great day: I braved traffic to drive all the way to Half Moon Bay for work. I thought I was going to die but I refused to turn back. I made it through the downed trees, over Devil's Slide-that was shut down later in the day-and got to work to find the power out. No one called to say - \"Erin, don't drive 2 hours because the powers out!\" Well they couldn't. So I don't fully blame them. \nI got home to enjoy the peace and quiet of the Presidio. I had a great storm day planned out that involved movies, hot chocolate and naps. But alas! I arrived home like a warrior returning from battle to find the power out there too. \nLater that night as the sun went down (was it even out that day?) my roommate and I decided to brave the weather. We rewarded ourselves first at Final Final with a few drinks and then headed towards the Marina to find food. We saw Yukol from far away because of a tree that had fallen across the doorway. There were still a decent amount of people inside despite the obstacles so we settled on Yukol.\nThe staff was very friendly and prompt. They were kind enough to let us sit down even though half of our group was missing. We held the table for a while without ordering and they didn't seem to mind. I think they could tell we'd nearly been blown away that day.\nThe food was also fantastic. The medium spicy curry with baby corn and mushrooms was awesome! Their Pad Thai was far more flavorful than most, which was a great surprise. I, like most people, always order Pad Thai and I've been getting bored. But Yukol renewed my love.  Not that I would've stopped ordering it because I've been bored, but it's still nice to know that it can be made right. We also ordered one of their specials. I think it was a lobster spring roll of some sort. The cook came out to say hi and ask how everything was! That's not something I experience too often in Thai restaurants so I was quite stoked.\n\nMy love of Be My Guest Thai has been transferred to Yukol. They have it all (unlike some loves that choose to play with my heart) Yukol delivers and has great food!", "author": "Erin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "My boyfriend had been coming here for years and introduced me to it and i took one bite of their  curry buttercups...i almost fell out of my seat they were so good!  Best duck larb in town too, no joke!  Great service, super friendly staff.", "author": "Steph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-23", "description": "The food is delicious -- love their red curry (esp. the Kaeng Pak)!  Also, the family that runs it couldn't be nicer. \n\n Came home from work one day, starving and a little cranky.  Took the bus from work to Yukol to pick up dinner and was not looking forward to the longish walk home.  While waiting a couple minutes for the food, got to chatting with one of the women who work there, who asked where I lived, and when she heard, how/where I'd been able to park.  \n\nWhen she found out I actually didn't have a car with me, she insisted that they give me a ride home when they took the next delivery!   Being exhausted and hungry after a long day at work,  not having to walk home in heels was a dream come true.  And of course, when I got there, the dinner was tasty as ever!", "author": "Alex Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "Great atmosphere. There are 20 tables and can be busy. Food is vey tasty and very authentic. Price is very reasonable. Will go there again if return to SF.", "author": "iris c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-04", "description": "well, they didn't have my all time fav, Pad Kra Pow (no clue how to spell that), but we did devour some delish Panang Curry with Pad Kee Mao (again don't judge the spelling)... fantastic friendly service and waitress even corrected some of the thai words werer using and taught us some thai swear words!", "author": "Gabrielle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "Best Thai food my wife and I have ever had...Even though we are not intense Thai food eaters, the Coconut soup just rocks, even according to my wife who doesn't like soup.  Place is a quaint little hole in the wall, parking in the area is difficult at best as is most of downtown SF.", "author": "Brad M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-30", "description": "This was the first Thai delivery restaurant I tried in San Francisco and I haven't tried anything else since! I'm a big fan of Sa Bai Nang (#13) and Pad Ma Keur (#24). Staff is always sincere, always gets my order right and always delivers in the time noted. I really want to eat-in to compare!", "author": "Heather P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-17", "description": "For all practical purposes this is the best Thai restaurant in SF.  Wonderful dishes that appeal to anyone famliiar with authentic Thai food and anyone who like Thai food. This is just a good restaurant. The service is wonderful. The prices are reasonable and the portions are generous. Yukol is a fantastic chef who preseves authentic Thai taste while innovating and appealing to everyone.  The \"You and Me\" roll is a splendid creation. Arroy mak.", "author": "Snubby J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-11", "description": "Consistently the best Thai food in the city.  Definitely a local restaurant feel (I've had the same waitress every time).  The curries are great and they deliver locally on orders over $15.", "author": "T H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-15", "description": "Too good!!  I like going in there and experimenting with dishes I've never tried before, which is usually a HUGE no-no for asian & thai restaurants.  But somehow, it has paid off every time -- I suggest asking the wait staff for their recommendations.", "author": "Kevin V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-19", "description": "Had the pad see ew dish (named differently on the menu), and the green curry with duck.  Both pretty good in comparison to other thai restaurant in the city, a bit expensive as well, but hey its the Marina so what can you really expect.  Very clean decor and has the feel of a cozy local restaurant, so overall very worthy of a 4 star rating, IMO.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "just had my birthday dinner here the other day, the mood and lighting was great, pad see eww with tofu was yummy i recommend this place for a date or group festivity", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "I went to this restaurant last night with my boyfriend and it was some amazing thai food.  I was very pleased with the awesome food and the great service.  Being a Tuesday night we were pretty much the only ones in the restaurant, but they were very attentive to us instead of just ignoring us.  \nAll the food was great but the shrimp rice rolls we had for an appetizer were amazing.\nOverall a great place to eat... highly recommended!", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-20", "description": "We went here last week and it was just as good as the last time we went (2 yrs ago). Aggh life with a child. \n\nTheir food is awesome and oh so fresh. Check the board for their specials. I really liked the fried spring rolls wrapped in a fresh noodle. They had a fried trout topped with green mango...nice and tangy. My other fav is the calimari salad. Not sure how they cook it but it's not fried and not chewy, but rather tendor served with a Thai vinagrette of sorts. Great service. Also try the steamed brown rice instead of the white. It's better for you and tastes great. Best brown rice I've ever had.\n\nThey were very nice to my noisy 1 1/2 yr old son (sorry fellow diners), but its not really a place to bring lil' ones since the atmosphere is rather nice and it made me feel rather guilty. They even had a Superman placemat for the boy. Thats just...well...super.\n\nOne of my favorite Thai joints. Worth the hunt for parking on Lombard.", "author": "ant m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-21", "description": "Sick and home alone tonight so I decided to try a new neighborhood thai restaurant for some comfort food: soup and curry. I ordered the Thom Kha Gai soup (vegetarian) and the Kaeng Panang Curry. I specifically requested the curry to be as mild as possible as I can't handle too spicy. \nI started with the soup and I was very pleased with it. It consisted of a variety of fresh veggies and had just the right amount of spice. Next and finally, I moved on to the main course: the curry. I took one bite and immediately felt a burst of fire in my mouth. I couldn't take another bite and my mouth and lips are still burning from the spicyness. :( I am not one to call and complain but I decided to at least call to let them know. I certainly wasn't going to walk back down there and get another but maybe they would offer me a discount or something for next time. I called and was very nice. I said to the girl that answered that it was my first time ordering at the restaurant as I was looking for a new thai spot. I told her that the soup was excellent but although I had requested that the curry be as mild as possible it was fire hot. She apologized, didn't offer me a thing and said goodbye. This was rather dissappointing as at least if they had good customer service I would give them another chance. I am actually full from the soup but I have a whole container of curry sitting before me. What a waste of $19... I won't be going back.", "author": "Shaida M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-21", "description": "I'm new to town and to yelp but felt compelled to sign up so I could review this place. Our group needed to get some dinner without an hour long wait on a Friday night and one of them had heard of this place. We got several appetizers to share and each got a main dish. I had the #34 (can't remember its real name) and it was absolutely delicious. To top it all off, the service was fast and friendly.\n\nA few nights later, my roommate and I couldn't quit talking about it so we ordered some dishes for delivery, and they were just as good. A word of warning, though, if you ask for something \"extra spicy,\" they won't hold back.", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-27", "description": "I had ordered from here as all the reviews were positive.  \n\nI ordered my food at 715pm.  They stated 45 mintues for delivery. At 830, they still weren't at my house.  I called them, and they said they were on there way.  At 845, they arrived.  To say the least the food was very cold.  The delivery woman was nice and apologized for being late.  We ordered the shrimp rolls, pad thai, and the spicky beef green curry with brown rice and 2 diet cokes.  One of the cokes were warm (blah!).  The rolls were cold, so they weren't good.  I'm sure if they were warmer or even hot, they would be tastey.  The curry was great.  I ordered it more spicy, and it was good.  The pad thai was fair.  I've had way better.  \n\nI won't order from here again.  Maybe the food is better eating in.", "author": "Vicky H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "Yummy!  Calamari salad is excellent.   Everything else I've tried is good, whole Pompano with green beans stands out.  The service is very friendly and familiar.  A step up from most Thai spots.", "author": "The I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-15", "description": "the employees here are super nice. \n\ni got take out, food was prepared super fast and hot.\n\nfood was good, but not the best ive had but still recommended.\n\nplace was packed.", "author": "Ming W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "Can't believe I just found this place. Best Thai in the city, hands down.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "The food in this place is so good it brings tears to your eyes. I eat there everytime I am in SF. Several times a visit as a matter of fact. I am not particularly a fan of Thai Food, I like all food types but I just love good food. The Adam and Eve salad here is too good to describe. Perfect is the only word I can think of. The staff is really nice and when I have eaten from their recommendations I have never been anything less than thrilled. Little hole in the wall with great food. Prices aren't bad either. One person can have a great and I mean GREAT meal for less than $20. I am not sure you can get enough at McDonalds for that much anymore. San Francisco is packed with good restaurants but this is my favorite.", "author": "Doyle O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-15", "description": "This place is great, and no longer a secret. As others mention the staff is awesome, and one family I think. My favorites are the Beef Nuer Ob and the Corn cakes are great but you can't really get the latter to go or they'll get soggy.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "I've eaten here frequently over the last 4 years and have always loved the food and service, whether dining in or getting it to go.  And yes, I'm very friendly with the staff and Yukol herself, as I've been there so many times.  Sue and Puey are awesome!", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-10", "description": "Simply among the best Thai food places in the entire city.  I used to live around the corner and ate here 2-3 times a week.  Consistently outstanding.  Even though I live in Glen Park now, I still try to visit Yukol as often as possible.  The pad thai is hands down the best in the city (sorry Osha...but it is true).  Don't stop at Go - proceed directly to Yukol.", "author": "Aaron D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "I've never actually eaten at this restaurant, but it's the best Thai delivery I've found in the Marina/Cow Hollow area. I love Thai food, have spent a month eating in Thailand, and have a fairly high bar for Thai food. Compared to the best, I'd give this a three. Compared to alternatives in the area, I'd give it a five.", "author": "Look and C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-17", "description": "not very authentic, delivery was reasonable, price was rather high for simple un-complex, run of the mill thai food.", "author": "Haoming C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "I LOVE their Pad Thai and could eat it every night! (that's why they get 5 stars)! It's quick, easy, and they don't slather their food in oil. I also loved it because I could ask for something to be prepared with less oil. I love the staff. Their Thai food is some of the best around - then again, I usually stick to one thing when I go Thai - Pad Thai. My friends have had other stuff, curry, etc. which they have liked as well.", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "woo hooo great Thai food in the Marina... just happened to walk by and noticed that it got a good zagat review....of course I didn't notice that was 2003....\n\nmeh...it couldn't have gotten that bad now could it? =) thought we'd give a go anyways and well it didn't disappoint. Everything we had was delicious...I ate until I almost exploded. My favorite was probably the yellow curry", "author": "Joy Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-24", "description": "this is the type of place that serves a lot of starch - rice noodles, rice, & not so much veggies. they're very sweet (the wait staff that is, although come to think of it, the food was too), service was good & caring, but there's only so much they can do to make up for a big fat plate of rice w/ some tofu/shrimp on the side. and i ambitiously got the tom yum - not really sour, a huge full bowl of rice noodles, that swelled up absorbing all broth. i was only there for lunch, and only once, but i won't go back.", "author": "Kim Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-24", "description": "easily the best thai food in SF.. maybe the bay...  very consistant quality.  most of the staff is genuinely friendly...  they know how to work hot peppers into the  flavor and not just having hot for the sake of hot...  SUE is very pleasant....  everyhting ive had has been awesome....  and ive had A LOT off the menu....", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-02", "description": "mmm...yummy....spring rolls, cucumber salad, pad thai, green curry with prawns, tom kha gai soup--everything was great, and the staff was super friendly.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-18", "description": "Upscale and super clean atmosphere. The decorations are top notch, and the bathroom is immaculate. Service is quality, our waitress Pui was super nice! Only came here for lunch, got one of the specials which was cheap and huge. Next time will try dinner!", "author": "M. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-21", "description": "yummmmmm. best thai ive had in a long time!\n\ngreat service, great food, great prices!\n\nthe chicken coconut soup is amazing.\n\nAll in (with tax and tip) $60 for 1 appetizer, soup, 2 entrees, and 4 beers.", "author": "Kay T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "Very good Thai food for the price.  My favorite place in the neighborhood, particularly for delivery.  The tom-yum soup is quite good and their curries are excellent too.  Yes, its not the best Thai food but a great value for the money as compared to others in the 'hood.  I recommend it!", "author": "Mike D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-03", "description": "Second Thai lunch on Lombard with my colleagues and they brought me here, I was not disappointed. The cuisine was excellent, very tasty, and the flavors really enjoyable. I will get there again :)", "author": "Cedrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "authentic, inexpensive thai with smiling service.  what it lacks in ambiance, it makes up for in taste.  we've been a bunch of times and have never been disappointed...i recommend any of the curry dishes and the special rolls they sometimes have on their hand written menu.  can't remember the name of them, but i think they're pretty regular (possibly the \"you & me rolls' others have talked about)...delicious.  wine selection is limited, but very reasonably priced.  all around very good!", "author": "Niki G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-03", "description": "I love thai food, so I'm a bit picky about which thai restaurants I go to. I really loved the two times I've been to Yukol Place--the food is very good! Especially the curry.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-02", "description": "A few friends and I ordered takeout from Yukol Place and I was extremely dissatisfied with the meal. I've lived in the city for 6 months and this was the worst food I've had since moving here! Cheap but the food is pretty terrible.", "author": "L B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-05", "description": "Whatever Yukol might lack in ambiance due to its unfortunate Lombard St. location, it more than makes up for with fantastic food and friendly, fast service. The dishes consistently combine fresh ingredients in great sweet and savory combinations, and I've always been impressed with the quality of meat in their dishes. I have never gone wrong trying one of their specials, either. Lastly, it's cheap, especially for a popular Marina place. Try everything.  I haven't been to Kwanjai, so I can't compare.  I'm all for competition, but Yukol is excellent enough that I don't need to dabble away.", "author": "jack r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-21", "description": "Minutes from the golden gate bridge, Yukol Place is located in the crappy motel section of lombard street.  America's Best Motel, The Travelodge and the Sea Captain inn are all just blocks away! More significantly, Yukol Place is also located on the same block as two other Thai eateries.  I have tried them all,and it is only yukol I have given my repeat business, as everything they have is quite delicious.  Try the tom ka gai and any of their Thai Curry offerings.", "author": "Mark K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "great thai food! i just went there the other day for lunch. the duck item on the lunch menu was super good. crispy skin, boneless meat, and awesome awesome sauce, served on a bed a spinach and cabbage that are perfectly cooked. my friend had the pad thai and it was super good too, well may be it's a bit on the oily side, but still, it was really yummy. sticky rice mango was also super good. not too much of the coconut milk sauce, and the mango was just really sweet. thai iced coffee was also superb, just the right amount coffee, milk and sugar. excellent service too. they keep my water glass filled, even after we give them the money and tips. everything was reasonably priced. i definitely recommend this place.", "author": "A K."}
