{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "SF trip with my sister and niece.  They wanted to have the egg tarts from a Chinatown bakery.  The first one we wanted to get it from had a line out the door.  It was probably due to the Moon Festival street fair going one.  \n\nWe decided to get it from Yummy Bakery and Cafe.  No line.  Able to buy my egg tarts and eat it immediately. The egg tarts were hot from the heated unit.  The crust was flakey and crisp.  The egg custard was a good texture. Stiff, but creamy when bitten into. More like a custard pie texture than firm texture.  The custard was also not too sweet, which can be a problem.   \n\nOverall a very good egg tart and without the long wait.", "author": "Marck N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Friendly and quick service +1\nHas great egg sammies, according to my coworker +1\nGreat prices +1\nA short walk from work +1\n\nI wanted to get some savory buns for my coworkers and this place certainly delivered, as one them had to go get some more the following morning! Glad I could introduce them to this little cafe around the corner.", "author": "Sam Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "My spouse saw someone on the street with a loaf of green colored sponge cake. Decided to ask what it was and hit the jackpot - Pandan sponge cake. The lady then pointed us to this small bakery on Jackson street.\nIt was a pleasant surprise to find this gem. They not only served traditional Chinese baked goods. They also make more creative baked goods such as pandan sponge cake, egg white egg tart, etc.\nThe pandan sponge cake smelled good, had great pandan leaf flavor, and was so soft. It melts in our mouth. Unfortunately,  we could only get one (the last one for the day - it sold out just after lunch hours).\nWe also love the egg white egg tarts. They are as good (or better) than their regular egg tarts but not as sweet. It is option for more health conscious or calories counting customers. \nDefinitely worth exploring more in the future.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "$1.50 per egg tart. I've never tired the egg whites only tart. The regular egg tarts (yellow) were okay. Nothing like the ones I had in Hong Kong or Macau, but they were decent. They were more on the mushier side, but still a nice treat! Ordered a box of 16 for our training class, and they enjoyed them.", "author": "Angellica Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Great: Hong Kong hot milk tea, regular egg tarts.\n\nAverage: coconut tarts.\n\nMeh: pineapple buns of any sort.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-29", "description": "Tried the pumpkin roll, taro roll and the sponge cake. Have to say the bread was very fresh and super soft but the flavor was bland. Still worth the carbs.", "author": "Kathya C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Came here and bought white egg tarts for a party. They were a hit!  I also had the milk tea and bbq pork pineapple bun. Both delicious!", "author": "Mui Mui K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "My colleagues swear this is the best bakery in Chinatown. There are times when they brought me assorted pastries and treats from here. And every single items they have brought me were incredible and not like any other pastry than any Chinese bakery. \n\nAmong the bakery's tasty treats are the custard tarts in both regular and egg white version. If Golden Gate Bakery, located up the hill and also known for their egg tarts is closed, the tarts and other treats also goes really fast from here.   \n\nMy latest visit was to check out the bakery's version of the hot dog bun. For $1.50, the bread is a cheesy flavor. Not many bakeries make the bread with the intense cheese flavor. And the bread level is just right and not over excessive. This treat may not be attractive, but the hot dog bun from here is one of the better tasting treat I have had in a long time. \n\nI also brought a couple more and take home and put those bad boys in the oven. The toasted bread tasted like an Asiago bagel. And the hot dog was grilled nicely. Either way you do it, the hot dog bun is legit. \n\nThere are many Chinese bakeries in Chinatown and throughout the city and Bay Area. My colleagues were dead on. Yummy Bakery is one of the newest and better bakery I have had in ages.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Went back to this bakery today AGAIN !! Just for their egg white tarts. Still warm when I got them & I can't wait to get home so I ate one in the car !! Definitely worth the 40 minutes drive for me !!", "author": "Annie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Always gotta get my egg white dan tats when in Chinatown! I always come here for their white egg tarts, which are such a cool novelty! Not a huge flavor difference with regular egg tarts, but the texture is so smooth and creamy. I've brought this to a few of my egg tart snob friends who think it compares to Golden Gate Bakery! Definitely come here to skip the crazy lines/wait times. BUT! You may need to call them in advance to reserve some white egg tarts as they sell out fast!", "author": "Carolyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "My review is only for the egg white egg tarts here (yes, apparently those are a thing!).\n\nMy coworkers and I were grabbing lunch nearby in Chinatown and decided to stop by here and try the egg white egg tarts. They have regular ones as well, and both types go for $1.50/each which isn't bad.\n\nI quickly skimmed their selections and it looked like they have most of the standard sweet and salty offerings of any Chinese bakery.\n\nWe were told it'd be another 10 minutes or so for the egg white egg tart to be ready, so we waited outside as it is a very small space inside with only 2 tiny tables.\n\nWe got our egg tarts to go and ate them at the office. Texture-wise, I couldn't tell any difference between these and regular egg tarts, but I did think they were much less sweet (i.e.not sweet enough) than what I'm used to. It's one of those things where I'm glad I tried it once for the novelty of it, but next time I'm sticking to my regular egg tarts!", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "I came here for the .....and the drinks  the...... and the drinks. \nTrey Songz was clearly talking about the Egg tarts and the drinks.\n\nI came here and I saw the $1.50 price tag and saw they (egg tarts need love too)  were in oven waiting ever so patiently.  I wish all bakeries kept them warm because they taste so much better WARM don't you agree??\n\nOrdered two (because I don't like change , they don't need love) and I was on my way. \n\nPretty darn good I must say! \n\nRod's  Oak/SF Chinatown Egg Tart Rankings: (b/c I love lists and want to save you time) \n1 Mr.Bread\n2 Golden Gate Bakery\n3 Yummy Bakery \n4 New Hollywood Bakery\n5 Ruby King Bakery\n6 Napolean Super Bakery\n7 Sheng Kee Bakery \n8 Wonder Food Bakery \n9 Sum Yee Pastry\n10 Grand Mission Donuts and Bakery\n\n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. \n\nHere is a look at how I rank the SF Bakeries I've visited and I indicated what they're known for or a dish I recommend:\n\nRod's SF Bakery rankings (and what they're known for or what I like). ?) Follow my profile to see my most recent reviews I hope I can be helpful since so many Yelpers have helped me discover new places. \n1 Neighbor Bakehouse=cinammon almond bostock\n2 B Patisserie=Choco Bannana croissant\n3 Zanze's Cheesecake=Regular cheesecake\n4 Ariscault =Croissant\n5 Yasukochis=Coffee Crunch Cake\n6 Chili Pies Baking Co=Pies\n7 Dynamo Donuts=donuts\n8 Golden Gate Bakery=Egg tart\n9 Mr Holmes Bakehouse=Green tea croissant ,Cruffin, \n10 La Luna Cupcakes=cupcakes\n11 Three Babes Bakeshop=pies\n12 Anthony's Cookies=Cookies\n13 New Hollywood Bakery=Egg tart\n14 Dianda's Italian American Pastry=Napoleon , Cannoli\n15 Mission Pies=Banana Cream Pie\n16 Schubert=Swedish Princess cake\n17 Yummy Bakery=egg tarts\n18 Stella Pastry & Café=Cannoli , Tiramisu\n19 Craftsman & Wolves=Rebel within\n20 Bob's Donut & Pastry Shop=any donut \n21 Noe Valley Bakery=dipped cupcake\n22 Café Greco=Cannoli \n23 Kings Bakery=Tres leches cake\n24 Benkyodo Co=mochi\n25 Cupcake cove=cupcakes\n26 Cups and Cakes Bakery=cupcakes\n27 Good Mong Kok Bakery=dim sum\n28 Karas cupcake=cupcakes\n29 Mission Minis=cupcakes\n30 Sift Dessert=cupcakes\n31 Tartine Bakery=lemon tart\n32 Jane The Bakery=matcha twist , cardamom Lattice Bun\n33 Café Madeline=various goods\n34 Panaderia La Mexicana=mexican sweet bread\n35 Hot cookie=Cookies\n36 Les Gourmands Bakery=Croissant\n37 Mee Mee Bakery=Cow ears", "author": "Rod M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "Yummy Bakery and Café is a yet another Chinese bakery on Jackson just before Kearney in SF Chinatown.  Unlike other places it is mainly a bakery without a separate Café section. My first visit to Yummy Bakery and Café was a couple of months ago when I was doing the rounds of all the bakeries in Chinatown to find a replacement for Golden Gate as I had no intention of standing in line for 45 minutes to get egg tarts and that too when they are not on vacation.\n\nI decided to get my standard order of 3 egg tarts. I was told that if I bought 4 I could get a box so I got 4. I also got a hot dog bun. The egg tarts had the flaky/crunchy crust like Golden Gate and were placed in a heated case. They seemed to have been sitting there for some time as they felt a little dry and dehydrated. They were not bad just not as good as AA Bakery's which I preferred over these. The hot dog bun was also not fresh. \n\nPrice wise the egg tarts were about $1.50 a pop which still makes then about 20% cheaper than Golden Gate but almost 35% more expensive than AA Bakery. Overall this is not a bad bakery. It's just that it is up against so much competition which is a lot better than it.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Mornings can't get much better than after picking up a bun from Yummy Bakery on the way to work. Walking to Fidi in the brisk morning air holding a warm bun truly makes the start of a great day. \n\nI'm a sweet breakfast gal. I alternate between the taro and the pumpkin bun, my two favorites. They are not overly sweet, and taste authentic to the original source. The bread is soooo soft and fluffy, and proportioned well to the yummy paste inside. Nom.\n\nOther items on their menu have also been good, including the mushroom & cheese bun, and the ham & cheese bun. \n\nFor $1.50 or less to fill you up through lunchtime, this is my go-to breakfast at least once a week. :)", "author": "Vickie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "I really like their Japanese style cheese cake! Light and fluffy. $3.75 per slice", "author": "Sunny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "So delicious!!! Bacon and cheese bun fresh out of the oven was amazing and only &1.50!! Gotta come back to this place soon.", "author": "Zach S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Love their yummy egg tarts . You have to call in early to reserve if you need large quantities.", "author": "Yilun W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "We like the wife cakes from Yummy Bakery. This place was recommended by a local. $1.40 for the small ones. I can't remember the pricing for the big ones. They have other bakery options as well, but we mainly come here for wife cakes (melon cakes). You can pre-order if you're gonna order a lot. \n\nThey also have \"regular yellow\" eggtarts and \"white\" eggtarts. The tarts are a little bit more expensive than other bakeries in Chinatown, however, other places do not have the yellow/white tart options. \n\nService was fast and friendly. Cash only.", "author": "Jenny Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "I've had my fair share of egg tarts, as I am pretty much in the heart of Chinatown, lol. I've had some that were so-so and others that were just the bees knees. \n\nAnd I am actually in like with these egg tarts! I've tried the regular egg tarts and the egg white tarts. The crust is nice, buttery, and flaky just the way I like my crusts. To my surprise, the egg white tart was just as good as the regular egg tart. I would think that the absence of yolks would make the biggest difference and alter the taste of the entire thing, but wow was I wrong. \n\nThe egg tarts are great. The other baked goods, I'm not too sure. But I guess I'll just have to try :)", "author": "Meghan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "Very good bakery. Price is good too. I went there three times so far and the egg tarts were always freshly from oven, warm and fluffy. Only drawback is cash only.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "BEST PINEAPPLE BUN in all of China Town.  I usually go to Eastern Bakery but just happen to chance upon Yummy Bakery the other day.  The buns are $1 each as of Friday and are bigger (a nice oval shape) and soft, perfect out of the toaster oven the next day.  \n\nThey also serve standard egg custards as well as the less fattening Egg White custards.  Golden Gate Bakery still hands down makes the best but Yummy Bakery's version is a close second.  \n\nThe location is an easy walk from the Ferry Building and just a block from Portsmouth Square parking structure.  This will forever be my go-to bakery whenever I am near China Town.", "author": "Betsy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "The egg white Don Tat exists and it's very good. The crust doesn't hold a lighter to Golden Gate Bakery's crust but man is the egg white custard good. There's also rarely a line. Give it a shot. I'll pay $1.50 for happiness every chance I get.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Their egg tarts here are delicious! They come with white or the regular yellow. The white ones are less sweet which I prefer. The employees are super friendly.", "author": "Priscilla D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "came here on wednesday in the afternoon. a lot of items have already been sold out. kind of disappointed. when we got there, initially there are not a lot of ppl, but within 3 mins, suddenly a bunch of ppl came waiting for the egg tart, there is only one server serving everyone. It's really slow.... especially, the lady in front of me ordered 20+ egg tarts. \nsince the egg tart just came out from oven, the server had to take each one of them from the mold one by one, and it really takes a long time... \n\nWe ended up getting the remaining two egg tarts and hk milk tea. \nEgg tart is really good but i can get the similar egg tart in other chinese bakery too without waiting......\nIt's a little bit not worth it. But since it's the first time eating egg-white egg tart, it's ok to do it once. But i probably won't come back again if the line is long and only one ppl serving all the customers.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "My review is solely for their egg tarts. We are in search for the replacement of Golden gate bakery as they are always closed or with long lines. Again today, we are fed up that Golden gate bakery is \"on vacation\" and so want to try other egg tart places. We tried so far 5 others places and Yummy Bakery's egg tarts are the best. So worth of our time! \n\nBest of all, Yummy Bakery is opened and you walk in and out. No frustration, no line, no disappointment! Just a nice warm custard tart! EMM.... so satisfy and it will be my to go place to take our friends and family to satify our egg tart crave.", "author": "Ping T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Their ham and shredded pork roll is my favorite thing to order from this bakery. \n\nI'm not a fan of Asian fruit cakes but I needed to purchase a birthday cake near my office and this place came to mind. $25 for an 8\" Asian fruit birthday cake. It was ready in an hour.\n\nNot a fan, but they sell egg white egg tarts here.", "author": "Alice X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Nice, small place with a pretty good selection and cheap. I had probably 4 different pastries here and they were all good. I'd come back next time I'm in SF.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "From Mrs M. \"I was hungry and looking for breakfast and followed my nose to The Yummy\".\n\n\"I was impressed with how clean it was and the variety of baked goods offered so early in the morning.\"\n\n\"I don't what they are called but the blueberry and cream cheese pastries are amazing.\"\n\n\"And as I walked through the Hilton to my conference, eating my prize other people stopped and asked me where I got this.....I smiled, ate and kept moving.\"\n\nMrs. M took me back the next day and we got the green tea roll, a perfect spiral filled with cream filling. Wow!\n\nThink green tea heaven meets twinkies!\n\nBring cash - only - also English is NOT their strong suit - point - order - pay (cash) and eat.", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-25", "description": "Small and some what home style baking. Nothing special. Limited selection.unfriendly servers!", "author": "Bob W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Best Asian bakery we found, and we tried a few. The pineapple bun was the best we had but it was fresh out of the oven which may have been why.", "author": "Chad E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Best egg custard tarts I've ever eaten in my life!  They were still warm when we got them -- flaky pastry,  perfect custard.  In the 10 minutes we sat eating our tarts, 2 other parties came into the bakery ordering only custard tarts as well.", "author": "Alison C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "Meet Ron the ChigagoOn loved the experience picking out the pastries! Sample SanFran!", "author": "Abby A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Came here for egg tarts. Hot and fresh in the oven. Choice of yellow tarts or egg white tarts--went with the egg white. Not overly sweet but texture and crust were on point. I heard the yellow tarts were sweeter. I believe they were 1.50 each. Since golden gate bakery is always on vacation, this place is the place to be.", "author": "F K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "We stayed at Hilton in Chinatown and looked for a nice place for breakfast. We found this little nice Chinese bakery and we just loved it. We ended up coming back here every day during our entire stay. It's a plus that they are open on Christmas day.   Be advised that they only accept cash.", "author": "Joshihiro H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "This place is the quintessential Chinatown hole in the wall... with amazing food :) I have tried a selection of their take-away loafs, a pumpkin pastry, a cake roll, and some garlic bread. All of these tasted fresh, the pastries itself were light and buttery, and the deserts will not weigh you down like bricks.\n\nBut you don't have to take my word for it. By the time I arrive at 3 on a Saturday, everything was almost GONE.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Stay away from the other bakery tourist traps. Instead of waiting in line for a century, come to Yummy Bakery on Jackson Street. If you aren't looking you might even miss this tiny storefront of goodness.\n\nTry their blueberry cheesecakes as they are, surprisingly, good. A pineapple bun fresh from the oven or a shredded pork bun or a taro bun is surely a don't miss. Their loaves of bread for takeaway are also amazing as well.\n\nThis may not have the fame of other Chinatown bakeries but it sure beats in quality and service.", "author": "Junming G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Good go-to place for Chinese buns/pastries. Decent prices and lots of flavors (pumpkin, purple yam, ham and cheese, mushroom, pineapple bun, etc etc). Never had a pastry that I didn't like here! If you go here at the right time (when a new batch has been made recently and is still piping hot), egg tarts/egg white tarts are 150/10 and on par with Golden Gate Bakery. \n\nService can be rude at times, but you're not here for that, are you?", "author": "Rona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "I had a pineapple bun fresh out of the oven. It was AMAZING! I will definitely be coming back.", "author": "Meimei M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "Pretty decent! \n\nMy office usually gets buns from here when we feel like impressing people...or just feeding community. The baos here are pretty big - people usually split the buns here so they can have more variety. \n\nI've had the taro bun, egg tart, bbq pork, and onion pork sung. All are pretty delicious. Price-wise, also decent. I just purchased about 8 baos and 3 egg tarts, and my grand total was about $12 bucks. Pretty affordable! Especially since that box I got was noticeably heavy (I'd guess 3-4 lbs). All of their foods are labeled in Chinese and English, so I've noticed a lot of FiDi folks coming here. I guess its less intimidating when there's English with it. But please. Don't call it Char Siew. Just say BBQ Pork. \n\nAlso! Their boxes are awesome! Take out, their small boxes are fold-able with handle, so it makes it super easy to carry and transport.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-14", "description": "Service has definitely gone worse.  I usually buy enough to fit in a box.  Before I had to purchase $7 to get a box and now I have to buy $8.  I'm sorry, but the last few times I arrived, nothing was available and yet I requested a box they wouldn't give me a box...", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "We went to this bakery like 10 minutes before closing so there wasn't much inventory left. I got a pineapple bun with cha siu pork in it. I actually thought it was pretty good (even though I don't normally get pork in my bun). The bread portion was still really soft and the crust was just right.\n\nI should come back when the buns are fresh!", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "We happened to see this place because we had lunch across the street at a Shanghai restaurant, but we didn't go check it out. But later on, we were in the area again walking around and decided to see what they had to offer. \n\nIt's a small Chinese bakery and kinda dated; nothing too fancy. But the gems are actually under the countertop behind the glass windows. We didn't want to buy a lot being a 1st timer, so we opted for the Pineapple BBQ Pork Bun which was awesome! There was juicy chaisu inside and the bun was warm with that crispy sweet coating on top. I also ordered the Red Bean Turtle bun which was super cute. I used to boycott red bean anything when I was a child, b/c I ate it frequently, but it's not too bad being older and haven't eaten it in over 10 years. The bread was moist and dense. It makes for a good on the road snack. \n\nI'm willing to make a comeback next time to try out the other buns and their cakes looked delicious as well!!!", "author": "Gloria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Excellent bakery in Chinatown. Custom order a birthday cake, they did a very good job on what I asked for. I would definitely reorder from Here in the future. Good Job.", "author": "Cadee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Probably one of the best pineapple buns I've had in a long time. The top is very crispy, and the bread is very soft and fluffy. I happen to stop in when the buns came out fresh from the oven not too long ago, so mine was warm when I bought it. Couldn't resist, and took a bite, and it was delicious!!! Ate the whole thing before I left the store. Not to mention it was only 75 cents for that bun. To me (who always buys buns in the south bay), that was really cheap. To my mom who shops all over Chinatown,  it was 10 cents more than other places/more expensive.Either way, totally worth it for me! I also bought a pork sung by for the hubby, and even after toasting it the next day in the toaster oven, it was still really good. They are also known for their egg white tart, so give that a try as well!\n\nUpdate: They have a pineapple bbq pork bun that my husband LOVES. Another must try.", "author": "Louisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "A client recently brought fresh baked buns for us here and they were soft and delicious, with just enough of bounce to the bread when you chew. \nI had a mushroom cheese Bao, mmmm a more rare variety I have not seen else where. Reminded me of a cream of mushroom soup, yummy! \n\nMy mom also loves their milk custard tarts, since we don't eat eggs this is a great alternative not typically found anywhere else.", "author": "Gwendolyn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "Egg white tarts: eggy, dense, crusty crust. Love it. \n\nChicken bun: the bread itself is soft yet chewy and the filling is tasty but there could have been more of it.\n\nService: Helpful but when I was putting my hand out to get my change, the lady just dropped it on top of the bakery display case next to my hand. A bit odd. \n\nI'll be back to try the Japanese style cheesecake that other reviews have mentioned.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-05", "description": "25-minute wait for Great Eastern restaurant down the street so we walked here to wait.\n\nWe got a Cocktail Bun & Japanese-style Cheesecake. The Cocktail Bun was similar to the Coconut Buns I fell in love with in London's Chinatown. However their filling here was minimal. Overall though it was good. A solid \"B\" grade.\n\nThe Japanese-style cheesecake SOUNDED enticing but it was very sweet/cakey... more cheesy and filling. I'll give it a \"C-\"", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "Cream Horn - this pastry item is closely similar to the Buttermilk Bun I see at other bakeries in Chinatown. I came in today and ordered a Cream Horn - once in a while, we all need a little sugary craving to satisfy that sweet tooth.\n\nI do like how the staff here keeps this bakery clean. I am someone who prefer going to a bakery to get the item I want and go. If you want to go to a bakery with no lines, then I'd recommend coming to Yummy Bakery and Cafe. Some of the Chinatown Bakeries I've been to are busy most of the time. I like how this bakery is right up the street from Quickly Kobe Bento. I'll come here again when I want to satisfy my pastry cravings. Overall, good service here so it is a bakery worth visiting.\n\nEDIT FOR 0 3 / 1 6 / 2 0 1 3 :\nThird time coming here today and second pastry item - Cream and Jam Bun. This and the Cream Horn I got on my second visit was perfect. Very good bakery to visit for your pastry satisfaction. One downer here is that this bakery a little small but it is not as busy as Golden Gate Bakery and Napoleon Super Bakery. Right next door to Kay Cheung so it is very easy to find.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-25", "description": "Nothing was open on Christmas day, so I ended up going to China town. Unlike a lot of folks, I'm not a huge fan of this bakery. I ordered the Cheese & Mushroom bun, but it was kinda oily, and oozing with butter. \n\nThe nice lady working behind the counter asked me if I would like to try the Hong Kong Style Tea, so I decided to order that one too. \n\nWhen I sat down, I noticed how dirty the tables were. That was kind of a turn off for me. The Hong Kong Style Tea was too sweet, so I didn't finish it. I don't like teas with milk and sugar, so I didn't care for it. \n\nI prefer to drink my tea in pure form without any type of sweeteners. \n\nHowever, I must admit that they do offer quality sustenance and dirt cheap prices.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "I really really want to keep this a secret, but just can't do it in good conscience. I come here just for the egg custard tart. They offer an all egg white version for those fearful of yolks. Personally I like the regular, \"yellow egg tart\" more. Almost as good as Golden Gate's, but GG's dan tat is still the one to beat. Price has steadily gone up though still more affordable than Golden Gate's. Definitely good enough to satisfy the palate when GG is not open. These are getting popular so they often sell out by 4pm.", "author": "Lil D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Small bakery cafe. The only place i know that serve two kind of egg custard regular and egg whites. Delicious egg custard and flake crust. Prices are inexpensive.", "author": "Gruber T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "Noticed this bakery on my way to the Golden Gate Bakery on my first Egg Tart quest.  Of course, once I reached GGB, they were closed (thanks for the heads-up, Yelpers!).  Ok, no problem, turned around and visited YBC.  Tried several of YBC's items:\n\n1.  Pineapple BBQ Pork bun.  4 stars, no gristle or fat.\n2.  Ham and cheese bun.  4 stars.\n3.  Coconut cake.  3 stars, there were only two left, so not right out of the oven.\n4.  Almond cookie.  4 stars, taste good but not overly sweet.\n\nThe chinese woman who helped us was polite and smiling, and while we were eating our treats at one of the small tables, the bakers brought in 3 or 4 different items to replenish the stock on display.  I noticed later that they also serve Egg Tarts (not on display, but from a sign on the wall) which I will try next time.  I assume they make their Egg Tarts fresh to compete with GGB.\n\nMinus one star for the coffee/liquid splashes on the wall next to the dine-in tables, it was really dirty.  My suggestion to YBC is to take some 409 cleaner and wipe down the walls once or twice a year next to the tables where people eat.  Those stains look like they have been building up for years.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "This was my first trip to Chinatown in SF, and I must say, it is of the cleaner ones I've visited. If you're not specifically hungry for pho or chickens dangling in the windows, I definitely recommend popping into this bakery. There are many types of baked sweets as well as rolls of various flavors. For example, I ordered a sponge cake, red bean crab roll and a flakey cone with cream in it. That crab roll was amazing. My boyfriend and I were quickly refueled with a tasty carbo load for only $4.35!", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "Now I come to this new Chinese bakery, http://media2.px.yelpcdn.com/bphoto/YwWxIJH1FePIM9cF3BeByg/l to buy egg white tarts ($1.10) http://media4.ct.yelpcdn.com/bphoto/B4LlQuS8WxjqTbpOn3CKPw/l (or regular egg tarts) and other HK-style goodies, whenever Golden Gate Bakery is on vacation. The store is very clean and they use pretty nice packaging. Really nice and friendly service too. Mother and daughter handle the counter, while the father manages the baking facilities in South SF.\n\nAs other reviewers have mentioned the Japanese style cheesecake ($12) http://media4.px.yelpcdn.com/bphoto/pLIYZFYJPjBU20bPoT7DKQ/l is also very good. It's light and non-gooey, unlike the stuff u get at places like Nijiya Market. And now u can also buy it by the slice ($2 each).\n\nSchedule posted is 7am-7pm daily, but the daughter said that many times they stay open until 8 or 9pm.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Their Mushroom & cheese bun is better than most pizzas here in San Francisco.  Also, their BBQ pork bun flavor, price, & texture far surpasses the 10 places I have been to.  Outstanding customer service & flavor for the price.", "author": "Martin A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-07", "description": "Cockroach seen in the right side glass food case! While I really like their egg tarts and pineapple pork buns, I just  can't enjoy the food knowing there must be even more roaches hiding behind the scenes.", "author": "Miriam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Great egg tarts, other goodies also tasty, and quick service. Plus, they were open when Golden Gate wasn't!", "author": "Scott M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "Yummy, Yummy, Yummy\nI got tarts in my tummy,\nAnd I feel like a-eatin' more.\nCustard's such a sweet thing,\nGood enough to eat thing\nAnd that's just a-what I'm gonna do.\nOoh love to lick it,\nOoh love to chew it,\nOoh tart, I love ya so.\nOoh tart, you're sweeter,\nSweeter than sugar.\nOoh tart, I wont let you go....\nhttp://www.youtube.com/watch?v=s47v4ZAu8ww&feature=related\n\nOK, I finished my karaoke performance. So what's so earth-shattering about a new bakery in Chinatown? Not that much except this one is nicely situated between two of the only eateries that serve steamed chicken, Hunan Homes and Great Eastern. Who cares, you ask? Well, after downing something as healthy as steamed chicken, I feel I'm worthy of something sweet as a chaser.\n\nThey serve egg white custards, coconut tarts, raspberry mousse, Japanese-style cheesecake, and basically any baked good you can think of in a Chinese bakery. The cafe part is a stretch since there are three small tables against the wall. The display case is what you'll spend time perusing before purchase, and since most of the items are $1.10, gluttony is a constant threat.\n\nNothing is terribly exceptional like the Egg-Custard Tarts at Golden Gate Bakery, but they provide the perfect steamed chicken chaser if you are so inclined. Jamie W. and I packed ours in a little bag and controlled ourselves until we got to a bench in Washington Square Park where we promptly Hoovered them even if the Blueberry Cake Roll was a tad stale.\n\nSWEETS - 4 stars...sweet and cheap like a hooker on a loading dock after the fleet's come in\nAMBIANCE - 3.5 stars...a clean space for now\nSERVICE - 3 stars...she just pulls 'em out of the case and puts 'em in a bag\nTOTAL - 4 stars...hard to resist $1.10 snacks in this economy", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-10", "description": "I liked their egg white custard more than a regular egg custard - from anywhere. The egg white custard was not eggy tasting, and was a larger version of the egg custards at dimsum. \n\nNormally, I don't eat single-serve mousse and so thought they were a pricey, maybe, maybe not ($2.30 each for the raspberry flavored one)? However, it was good. Not too rich, and rather fluffy. The HK-milk-teas ($2.50 each?) we ordered was made-to-order fresh, though was lukewarm.\n\nFriendly owners (totally a family-run shop) who stay open late as long as there are customers still inside the place. I'd return if in the area.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "Excellent baked (didnt see any steamed) buns from cha xiu to red bean fillings. The bread wasnt too sweet, super soft and most importantly, fresh out of the oven at 7am.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "This is the only bakery I know that sells egg white egg tarts! It's delicious (or should I say yummy) and I feel a little less guilty indulging this pastry. Their coffee cheesecake, which I don't think is made in house, is delicious as well and it's located in the fridge by the door. I also got the almond-brandy bun and red bean roll. Cash only!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "HK milk tea = win. Piping hot!  \n\nButter and jam bun = delicious (usually get it for my cw)\n\nChinese fruit cake...I ordered the 8 inch at 10 am...and they had it ready for me at 1 pm.  They had to make it from order. $25.00. Well worth it.   \n\nService = friendly.\n\nThis place remains CASH ONLY. English and Chinese languages spoken.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "They're neighbors (on the next block) of the chinese village association that I belong to, so I sometimes grab a snack here.\n\nI've tried a few things - \n- cream buns\n- custard egg tarts\n- baked pork buns\n\nDepending on your timing, some of their items are just out of the oven - and warm. Regardless though, everything I've tried is soft and fresh.\n\nMake note - \n- They only accept cash. \n- They're clean.\n\nThey only have a coupla tables for seating, though I wouldn't worry 'bout beatin the crowd. Seems people are in/out with the to-go items, and don't seem to sit for chit-chat. \n\nWalk maybe a coupla blocks, and enjoy it outdoors at Portsmouth Square!", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-26", "description": "This is a great stop to have some sweets and hot milk tea after having some Dim Sum in C-town.  Their egg custard tarts come in traditional yellow, and they also have an egg white version which is light and airy.  Both are good and not too sweet - which is what I prefer.  \n\nWe came in for hot milk tea one time and they were giving out samples for their wheat bread that just came straight from the oven - SO good!  I am not a big fan of wheat bread, but I would definitely wouldn't mind theirs for making sandwiches.  Its smooth (not gritty as most wheat loaves are) and fluffy.  My favorite item is their pork bun - delicious even when toasted at home, and does not have that crazy red food coloring you find at most asian bakeries, and theirs definitely blow the others I have tasted out of the water!\n\nMy only wish is that they were closer to me!  :(", "author": "Teresa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "Yummy bakery is a clean looking cafe with higher priced/higher end? pastires ( $1+)\ncan only rate them 3.5 stars. rounding up to 4 to distinguish them from average bakeries.\n\neats:\n-schredded pork buns(1.25)\nschredded pork resembles the \"sung\" taiwanese put in their porridge. interesting \nsnack for the mornings. would rebuy\n-chicken bun(1)\nbaked bun with cubed chicken  and veggies inside. better than average.\nwouldn't rebuy\n\ncrumbs:\n-no cheap eats here, more innovative fare\n-look for treasures in a haystack.\n-quality ingredients used. pastries fresh\n-would revisit should i have time to browse and ponder my choices.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "You have to appreciate certain businesses and their marketing efforts to name their place according to their food, so it's very poignant that this bakery call themselves the YUMMY Bakery because that's what they are -  a bakery that serves YUMMY goodies. \n\nI wonder if any eatery would call themselves 'OFF THE FLOOR' or 'THE DUMP'?\n\nAnyhow, back to this bakery - terrific selection of items, from the staple pork bun to the egg tarts to all the other buns under the sun (guys, no innuendo here - I don't pun on my buns) I finally figured out how to endear myself to my non-Asian co-workers, feed them stereotypical Chinese pastries for breakfast and they'll love you forever.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Fresh baked bread. What else could you ask for? The lady behind the counter could be perceived as harsh, but don't mess around, know what you want to order and it should be fine! Cash only, so don't forget!!", "author": "Tracy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "This bakery has the BEST freshly baked yummy products...\n\nOne I love in particular:  mushrooms sauteed in a tasty (light) butter cream sauce and cheese baked in bread.  I can easily eat two of them in a sitting.\n\nAnd the prices are FANTASTIC!  $1.25 each...each of these in any other bakery would be at least double in price.\n\nThey have lots of different types of fresh baked bread.  The bakery is on site...so if they run out of anything, they are baking a fresh batch tout suite.", "author": "Georgina V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "This simple little Chinese Bakery shop isn't as well known as some others closer to Grant street in Chinatown. But when I walked by Eastern on Grant, there was 1 person working and 12 people waiting. I didn't have the time for that, more hangriness wasn't my goal. So I came in here, with no wait, and got a taro flavored pastry. Sweet! (as in Nice! and not too sweet, but satisfied my need for carbs!)", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "I need to start talking this place up!  I have been going here for a while and just love, love it!  Even though it's on the edge of Chinatown it isn't tourist at all, it's the good stuff.  \n\nIf you are looking for sweet, I'd recommend the Mocha Bun (my favorite), the blueberry bun, their coconut tart thing is delightful and not overly sweet.  On the savory side, I'm obsessed with their corn and cheese bun (OMG).  I honestly haven't had anything that didn't satisfy me.  I think this place definitely competes with Golden Gate, so come here just because you like good food or because the line at Golden Gate is too long, either one is a great excuse.", "author": "Casie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "This is a review for their Japanese cheesecake.  Really I don't know what the difference between asian and anglo cheesecakes are.  DH claims that it's because there's a hint of coconut in the cheesecake.  I do know that Yummy Bakery's cheesecake is light and not as dense as American cheesecakes.\n\nCake was fresh and yummy.  DH said this was the best cheesecake he ever had.  Definitely get the cheesecake here folks!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "One of my favorite places for Asian baked goodies! I love their egg white custard tarts; I don't know any other bakeries in the bay that serves this :) \n\nThe staff also told me the taro and pumpkin are freshly cooked and mashed into paste for their baked buns!", "author": "Sally N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "After lunch at New Woey Loy Goey Restaurant we walked back down the street and stopped at Yummy Bakery & Cafe.\n\nI read they have Egg White Tarts so had to try it.  Lots of baked items in glass cases.\n\nI asked for 1 Egg White Tart they sell for $1.10. Girl went into the back & got me a warm one.  That was nice.  Tasted good, not very sweet.\n\nChewy Cookie .60 - interesting taste, not my fav.  Salty, sweet, meat tasting - maybe lard.   Skip it!\n\nThey have milk tea & even Japanese Cheesecake.\n\nMy total $1.70.  I paid Cash.  They have some tables to eat at.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Cheesecake? Cheesecake! All the C-town faves, and the Hong Kong style milk-tea (港式奶茶) is authentic. Small, only three tables, but very good pastries.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-21", "description": "We tried to go to Golden Gate Bakery but it was closed the day after Thanksgiving.  There were a couple people in front of us and then I ordered about 7 things to try with my family.  The bill was around $6.  I loved the taro bun.  Did not like the wife cake.", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "The New York cheese cake was so so.  But the place looks nice.   I will try something else next time.", "author": "Emma C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "Had my first experience with egg white tarts here and now I'm hooked. Loved them even more than regular tarts!\n\nCame here after I walked to Golden Gate Bakery and found that they were on vacation (Monday of Thanksgivings week). The outside is completely unassuming and isn't set up like a usually self serve bakery. Everything is in a display case and the very nice lady behind the counter serves you. While this can take a little longer if there's a crowd, it keeps the baked goods from getting poked and handled by many people. The bakery also felt clean and all the baked good were very fresh. This is not something that I can say about all Asian bakeries. \n\nThe old lady behind the counter communicated with me in a mix of Cantonese, English, and Mandarin. Somehow we understood each other. \n\nLoved the experience and will definitely be back again!", "author": "Lucy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-17", "description": "I keep forgetting that in order to get the best goodies from a bakery, you have to go in the morning.  It's like going to the pound late Sunday afternoon; all the cute kittens are gone, and you're left with a grouchy fat cat who wants to slash your face off and then hide in the corner.\n\nI ran away from Yummy Bakery and Cafe yesterday before it could slash me in the face, but not before snagging a box of pineapple cakes.  When I walked in around 2 pm, half of the shelves sat empty, and there were two ladies who were behind the counter.  After perusing through the baked goods and deciding that I didn't want any buns or rolls, I saw the pineapple cakes (they also had green tea, strawberry, taro and honeydew flavor).\n\nPineapple cakes are one of those things that I ate a lot as a kid, because any time there was some kind of special occasion, people would give us a box of them.  A buttery shortbread-like casing, and sweet pineapple jelly on the inside.. a combination I just never got sick of.  Then I moved away from home and never came across them until yesterday.  The cakes take maybe about 3 bites to finish, and they're sold in a box of 3 for $2.50.  Definitely a fan.\n\nYummy sits at 3 stars for now, so hopefully I'll be able to up the rating when I go back sometime in the morning.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "Egg white egg tarts....just because Dr. Oz says egg whites are lower in calories than whole eggs does not mean these baked goods are healthy; these egg tarts are decadent and can become addicting. I would say they almost rival the well known egg tarts from Golden Gate Bakery. \n\nPROs & CONs:\n+The custard is not too sweet and has a smooth texture. It also has a pleasant egg-y flavor\n+/- The crust is flaky but it was not as crisp as I was hoping it would be. \n\nFinal words: If you want get some egg tarts without waiting in a ridiculous line; this is your bakery. Based on the egg tarts, Yummy deserves 4 stars!", "author": "Thank Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-28", "description": "It's a cash only joint which is pretty much common in Chinatown, not to mention most Asian stores that do not want to pay any extra fees and/or taxes for having a device to make it a more pleasant and convenient experience to random patrons.  \n\nThis was my last stop before deciding to walk to my car to head back to San Jose but after waiting more than 5 minutes.. I walked out and here's why: \n\n- 2 people at the counter, 1 helping an idiot taking forever to order and the other tended to Chinese-speaking customers REGARDLESS of the line that was in place.\n\nAfter being ignored.. I don't care if this is a 5-star establishment.. I've had it and walked out and I don't intend to go back to give this place a chance.  I do not care about how service can't be expected from Asian establishments but - eff that.", "author": "Tram N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "DELICIOUS! Super cheap too! Found this place walking in Chinatown, and next time I'm in the area I will most definitely be back. Pretty much everything is $1 or around that. If you're looking for pastries, a snack, or just something new I'd recommend this place.\n\n\nOh and it's CASH ONLY, no cards.", "author": "Nancy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-12", "description": "Came here mainly to try the egg white tarts. \n\nAs far as the bakery goes - the lady behind the counter is really nice and super helpful. \n\nThe tart itself = didn't care for too much. The custard is nice and smooth. But the crust too soft - wish it was more flaky. The flavor of the custard was a little mild/bland compared to normal egg tarts. First time trying them so don't know if they're suppose to taste that way. But wouldn't care to have egg white tarts again based on the ones I had here.", "author": "Welmond C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "This is my new favorite place to get egg tarts. Move over golden gate. Hong Kong style pastries, fresh bread. If they have something that just came out of the oven, get it and eat it while it's still warm. Yum!", "author": "Kiki J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "This is my new favorite bakery in Chinatown. It's very clean. I know, you want old and dirty when you're visiting Chinatown because that means good, but new and clean is good too!\n\nMust get first: Japanese cheesecake.\nMust get also: Blueberry mousse, chestnut cake, pineapple bun, egg white tart. Okay, just get everything!\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "(See pics)\n\nIt's not very common to have a new Hong Kong modern baking style bakery in Chinatown (slightly more yellow toned and firmer.) Even they have \"cafe\" attached to the name it's more of a true bakery with the whole baking happening in the back. This is when you know you will get the freshest!\n\nI was so ecstatic looking at the egg custards (also in the egg white style!), less common green onion rolls, dried Chinese shredded pork rolls, the more traditional pineapple buns, sweet coconut custards, etc.\n\nIn the fridge they also have Japanese style cheesecake (the whole is 12 dollars and you can only get the whole), a pretty good selection of sliced cakes such as chestnut cakes and other very colourful ones.\n\nThey all looked and tasted very yummy. I bought a about a dozen of different ones and ate them all in a couple days.\n\nThere are a couple tables on the side if you want to have a Chinese milk tea / coffee milk tea while savoring the food and watching the 2 girls trying hard to serve all the customers. The wait was just a little bit as some people were buying a dozen of each items!", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-25", "description": "Awesome little cafe with a couple tables on the inside but not really a great dine in environment.  More for grabbing something out of their more than adequately stocked bakery which if full of melt in your mouth bakery products which can be either savory (like their shredded pork buns) or sweet (like their buns like the Mexican stick).\n\nAlso have some good hong kong milk tea to sip on as well as some usually fresh but less than stellar coffee.  A good morning stop on your way through chinatown.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "Delicious bakery with a good range of desserts! \nI really like the fact that besides the usual egg tarts containing the yellow yolk, they offer a \"healthier\" option with egg whites only!", "author": "Hin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "This place is gradually winning me over as my favorite bakery in Chinatown.  They also have a couple of tables for eating on the spot if you're in the mood for a cafe, but it's not really an eat-in environment; I'd definitely recommend a \"grab and go\" experience.  \n\nAll in all, I recommend it most for their pastries & other dessert items - I think their jam cake is my favorite, but honestly I've never had anything bad here.  Gradually trying everything they offer has been a lot of fun so far.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-30", "description": "In this world, there are two types of Cha sui bow: steamed and baked.  This restaurant serves the best baked cha sui bow ever - as you will read in other reviews.  Why is it better? Because the other bakeries use a mix of pork and that nasty hoisin sauce.  When you open the \"other\" bow, you will see this redish mass of meat and sauce.  It's good - but it isn't at all like you get at Yummy Bakery.  Here the filling is neatly sliced pieces of pork in their own sauce.  That sauce allows you to identify the meat you are getting as very tasty pork.  If you do not know what I mean, go to Anna Bakery a few blocks over and get one of their bow, and get a Yummy bow.  Break them open, taste them and then get back to me.\n\nI also like the paper cup the bow is baked in at Yummy Bakery.  They are not those cheap paper cups that tear and stick to the bun but some classy paper cups that allow that precious bow to (though lately, I've seen the paper cups are not as classy as a month ago).  Again, compare Anna Bakery with Yummy.  (See my review/movie of Anna)", "author": "Steve S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-15", "description": "Pros:\n- Their Japanese style cheesecake is really good.  A piece = $2.25 & a whole cheesecake = $12.00. \n\nCons:\n- Their egg-white custard tart tasted a little off.  Maybe it was under-baked?\n- Their chocolate covered eclair looked good, except it's not filled with custard. =o\\\n\nNote:  I'm not positive since I paid in cash but this place might be cash only.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "First time coming here after an amazing experience at Hunan Homes just up the street.\nWhen I came in, I was invited by the sweet aroma of freshly baked goods. \n\nJust judging from the amount of people crowding around the glass display, I was excited to try as many things as I can. Alas, my wallet did not agree with me, so I had to make the difficult choice of picking no more than two.\n\nI decided to play it safe with one egg tart, and for the second I went (slightly) bolder with a coconut tart..both were extremely flaky and light, and not overbearingly sweet. I loved the smell and taste of the coconut, and you can never go wrong with egg tart. \n\nIt was a good little dessert after my lunch, and I'm definitely excited to try more pastries in the future.", "author": "Jeffrey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "I originally wanted to go to golden gate bakery for egg tart but it was closed for vacation. So the local uber driver recommended this bakery to me. It was only a block away. The bakery was small but had a large variety of pastries. I got a dozen of their egg tarts and it was amazing! The egg tart was the size of my palm and it had the perfect amount of sweetness. I loved every bite of it. I also got 2 other pastries but they weren't anything special. The staff was very friendly as well. I would definitely come back for the egg tarts.", "author": "Kimie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-10", "description": "If you're sick of eating donuts then go Yummy because their pineapple buns are amazing, especially the cream filled ones.  Really great if you have a sweet tooth.  Their pork bun is delicious and makes for a great lunch.  This place is far from healthy, but I don't know too many bakeries that are.  \n\nAdded bonus for \"Dude Where's My Car\" fans.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-20", "description": "I've been coming here whenever I am craving for their egg white tarts.  Recently, there's been a new lady cashier (she has short hair) and she's been pretty rude the last few times I've been there.  Anyhow, the egg white tarts weren't good.  The custard was dry and it looked so bad that they should have tossed it.  But she decided it was good enough to sell.  With this sort of attitude and quality/inconsistency, I don't know how they'll be able to survive.  I won't be coming here anymore.", "author": "Katniss B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-11", "description": "Been coming here for a while and they have the best pork buns, and mushroom and cheese buns. HOWEVER the cashier lady is freakin rude!  \nBitch please! I am a paying customer, and YOU are not giving me Shit for free. \n\nhave you ever heard of service with a F'ing smile?  rudely pointing a sign penned down in chinese that you charge for a bag because is the new law is something I AM WELL AWARE OF!!\nI live in the city, so maybe using common sense and bagging my $15  worth of assorted buns in a big bag as opposed to 8-9 different small bags would be helpful. I DONT mind paying $0.10 cents!!", "author": "Claudia E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "Loved the egg tarts!  I say the egg tarts are comparable to Golden Gate and they are as yummy.  This place has 2 different kinds of egg tarts and I've only tried one.  No long line and friendly service.  Only thing with this place is there aren't a lot of bakery selections to choose from, except for buns.  This place is recommended and will definitely come back the next time I am in the city.", "author": "Helle Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-04", "description": "A solid bakery only a few blocks from the office. It has green onion roll, garlic bread, egg tarts, and even taro bun which is hard to find in any sf/oakland chinatown. It looks a little strange and unappetizing though but I'll try it eventually.", "author": "Ingrid K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-03", "description": "Saw this place while walking around and saw the egg tarts! Egg tart was really good and cake slices were soft and moist!", "author": "Jill C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "This bakery was right time with there daily fresh baked goods. I was very very happy with them. Good stuff.", "author": "D S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "I stopped by & picked up 4 slices of cheesecake to go.  They had some funky flavors like mango.  That night we shared the 4 slices.  I think that the raspberry chocolate may have been the winner, but all 4 were great.\n\nI saw some comments about service on Yelp, but my service was fine & they were fairly busy.\n\nJust remember to bring cash since they don't take credit cards.\n\nI'll be back", "author": "Phillip A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "Got a pork bun, pumkin bun and a dried pork bun...they were all very good and the total came out to $3.50. A nice clean and quiet bakery, unlike the craziness on Stockton St! The have pretty cakes as well.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "I've always known about their \"little chicken cookies\" (savory, fatty chewy cookies that probably contain fatty pork and five spice) but their baked buns are just as fun. They have a great variety of buns--some original, some are knockoffs of other famous bakeries, all tasty. I'm particularly giddy for their savory items. Looking forward to trying their pineapple bbq pork buns, they are always out when I visit!", "author": "Andrey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "Went here yesterday (Sunday) and they were closing up, but still let us come in and buy stuff (it was around 9:30).\n\nAverage prices, around $1.00-$1.50 for most things. Got a normal egg tart, and she threw in a free egg white tart to try.. it was yummy! And they're probably healthier than normal egg tarts too.. definitely will come back here next time I'm in Chinatown.", "author": "Trisha Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-18", "description": "A tale of two cocktail buns consumed during a mid-afternoon break that's semi-skimpy on the fillings, however fresh and tasty, as well as affordable. YBC has a nice assortment of baked goods...gave my eye-balls a workout.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-22", "description": "I've always been an honest man to tell you the truth so I am not going to stop now. I dropped by Yummy Bakery only after seeing Golden Gate Bakery is on vacation for the 52nd time this year. I was rejected, spurned, crushed and so I desperately seek a rebound bakery. \n\nAnd there was Yummy, strutting her stuff through their shop window luring me in with the smell of freshly baked buns. There was no line, just me and the kind lady who works there eager to help. I bent over at the display case and carefully examined their offerings of baked goods - I see the usual suspects (red bean and egg tarts), the bread rolls and the LOLWUTs (turtle and crab shaped buns). There are so many choices but only an appetite for one so I had to choose wisely...and the red bean came away victorious!\n\nIt was only 80 cents...Macklemore would be proud the way I thrift shopped for food! I don't want to cheat on Golden Gate just yet by trying Yummy's egg white tarts but a man can only be tempted by that custard bastard for so long.", "author": "Roy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-11", "description": "Much better than expected. Tried various pastries and all were good. Perfect for when Golden Gate Bakery decides to close because they've earned enough money for a vacation, which seems to be frequent.", "author": "Sabi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "I am rating this place only for the pork bun( cha sew pow)! I walked by this place randomly and asked them how much there pork bun was it was $1.00, which I thought was kind of pricey for Chinatown. So I bought only one and roamed chinatown. IT was sooo good. It was warm, fresh from the heating thing they had, the meat was chunky, not too sweet nor salty, just right. it melted in my mouth, the bun itself was shiney and beautiful, food can never look so sexy as these buns, HA. \n\nSo I searched high and low in Chinatown for a better price pork bun and tasting and I didn't find any. Now when I pay them a visit I only buy increments of 3 or more. I even took a picture of it and made it my wallpaper on my phone and the baker guy saw and laughed at me. So from now on, they know I'm the Cha Sew Pow girl! LOVE IT.", "author": "Tam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "It's not like Golden Gate Bakery but I like to say it's just as good =) I've tried the regular egg tart anddd the egg WHITE egg tarts, I really liked it. The crust was flakey just the way an egg tart should me, it's not greasy/oily, and its FRESH! It's so hard to find bakeries with fresh goods nowadays, but this place constantly brings out fresh baking goods, And today, I tried their new cheesecakes, chinese/asian style, =) at first look it looks like any other cakes, but the lady said it was cheesecake, it was moist......very moist and cheesecake tasting....i really really like it, because Im a cheesecake fan =P On top of that I love how this place gives out stuff to try!!! Today they gave me an almond cookie to try, and it was GOOD. Please swing by this place if you're around the area and give it a try, I mean at least I like this place and definitely try their egg white tart!", "author": "Helen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "I originally heard about this bakery from a friend of mine. When I entered, there was a family sitting down... but other than that, it was pretty empty. The ladies behind the counter were pretty nice; they gave me a lot of time to decide what I wanted to order. In the end, I bought a large tiger roll (in the fridge area) $5 and a paper cake ($1) The taste was very good, quite fresh and not stale at all.", "author": "Connie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "Tried an egg-white egg tart for the first time and really Iiked it. It was so popular that I joined a couple other people waiting in line for a fresh batch to come out of their kitchen. I ended up buying half dozen and shared them around the office! Yum! \n\nAlso bought a few other pastries and bread, all fresh and pretty high quality. recommend it.", "author": "Ada W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "I can't comment on service, because even though I have tried the pastries from this bakery on numerous occasions, I've never actually had to step foot into the store.  \n\nWith that said, I've walked by Yummy a lot - it's new, looks clean, and I've never seen a ridiculous long line (read: I'd rather come here than wait forever just to get an egg tart from the overrated Golden Gate Bakery a few blocks away).\n\nI've had the sweet \"toast\" which comes packaged in a bag - it's not so much toast as a cookie with a sugary coating on top that goes well with coffee or tea in the morning.  \n\nThey also have an egg white egg tart (which as others have mentioned is delicious).  I'm not sure it's all that much healthier as it's still pretty sweet...but I'll keep telling myself I'm doing myself a favor ;)  The egg-white egg tarts look a little bit weird because of its color, but I've learned that you definitely can't judge an egg-tart by its color: definitely give it a try!\n\nI also tried their banana nut bread/cake which comes in a very small, cute package.  I would save yourself the calories and go with something else.  There were too many nuts in my humble opinion...and the sweetness wasn't well blended.  Some parts were too sweet and others just tasted bland.\n\nOverall, a good bakery.  Welcome, welcome!! :)", "author": "Alvina W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-05", "description": "Summary: Decent Chinese bakery with a slightly different selection than most, but nothing too special.\n\nRead a review of this place on SF Weekly's blog about their egg white tarts, so stopped by to try them out. They were decent, but not particularly exciting. If anything, they might have been drier and less flakier than other nearby Chinese bakeries. Golden Gate is still the gold standard for egg tarts.\n\nOther pastries (I had a taro bun) were decent, but again, not differentiated.\n\nThey did have an interesting selection that I hadn't seen elsewhere, like blueberry buns. Didn't get a chance to try them yet though.", "author": "Gary Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "Was walking by and decide to buy some bun. Tasted ok. Nothing too special but its close to work and cheap if you want some snack.", "author": "Try E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "Close tie between this place and Napoleon Bakery on Stockton Street.  Napoleon's egg tarts have the flakey crusts.  Although Yummy's egg tarts do not, the custard is SENSATIONAL!  Plus, the fact that this place carries egg tarts made in both (just) egg whites and regular style, makes my taste buds scream, \"YES!!!\"", "author": "Virginia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "Wasn't thrilled with last night's purchase -- two items were dry to the point of being hockey pucks but this morning?  So fresh and \"yummy\". Cheap lunch can be had with the hotdog roll.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-28", "description": "Almost 8 months that I haven't been visit to Yummy Bakery and I have been craving for their Egg white tart for a while. Remember the first time when they just grand opening I went there and enjoy their egg white tart which I think is taste better then Golden Gate egg tart. But just I hate driving down to Chinatown. Just for egg tart?! No way...\n\nSo today I had pass by and I was so exciting to get some Egg white Tart. Ordered half dozen wanna to share with my family's. Me and my sister both had one after we got home. NASTY! Taste has been change! HORRIBLE! I bet the baking person has been change! Because It totally taste so much different.\n\nThis one is so NASTY! \n\nThe puff of it, is thick and taste powdery.\nEgg white taste sour. Doesn't taste any egg and sweetness. And me and my sister figure it out the sour taste of it must be make from cream cheese &/or sour cream that's why it taste like sour. At the beginning we both thought the taste turn old that's why it had the weird taste.\n\nAlmost got Ham&Egg bun, Hotdog bun and a pack of morning bun.\nBread are dry and not soft at all. Before when it is grand opening it was Fresh and Soft. Now.................. this store is going down. =(\n\nVery Disappointing.\nSorry I am not coming back to this place.", "author": "Joyce W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "i've been coming here for the past few months after i discovered that they have pretty decent egg tarts.  both the white and yellow egg tarts are fairly well made and flaky, and the custard is very soft.  the tarts themselves are like a 4 out of 5.  decent price.\n\ni tried a few other things as well, with mixed results.  taro bun was decent.  sponge cake was pretty good the first time.  second time, i discovered a large piece of green \"lint\" buried deep inside the sponge cake - that was nasty and disappointing.  \n\nhowever, what is really unfortunate about this bakery is the one older, short haired lady that i see sometimes.  (there is another younger, much friendlier and decent lady that works there too.)  the old lady has absolutely NO concept of customer service and her demeanor is downright hideous.  on both occasions, i entered the place with no other customers around.  first, it took her forever to acknowledge my presence.  then, when i asked for 4 egg tarts in a small plastic container, this crazy lady jabbers semi-coherently about needing to charge for a bag, even when i was pointing physically to those little plastic containers sitting right next to the tarts!  i asked her to use those containers, and she tried her best to completely not use them and instead stuff 4 fragile and greasy egg tarts in a small paper bag!!!  is she f'ing out of her mind???  the other time, she only wanted to sell me tarts in a box if i got 8 or more, not the 4 that i requested.  by contrast, the other younger worker always placed my tarts in a plastic container, separating the tarts with a pre-cut piece of paper plate without any hesitation or attitude.  \n\nbecause of this older lady behind the counter, i will not patronize this place if she is behind the counter.  in fact, i may never return.  this woman is toxic to this otherwise semi-decent bakery.", "author": "Boris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-01", "description": "Cash and carry dim sum.  I think my inlaws hated it!  I was only fine.  It's food not at its best...", "author": "Cathaleya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "This is one of the cleaner bakeries in Chinatown. The woman who works here is very pushy. The place is cleaner, but comes at a price. It is a little more expensive than the other bakeries around.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Affordable and delicious. Must try their lotus bean cake, very tasty.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-02", "description": "Someone got me a slice of their cheesecake. shit! it was awesome! didnt think I would enjoy it so much. I mean cheesecake from a chinese bakery?? \nbut nevertheless I gave it a try since it was in my fridge and all.  I couldn't stop eating it. I just killed the entire slice. I dont regret a single bite!!", "author": "AhLin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "This bakery was recommended to me by our waitress where we had breakfast.  After we told her about the long line of Golden Gate, she pointed us to this little paradise of bake goods in San Francisco Chinatown.    Both the egg white and custard carts were amazing.  They are flavorful but not too sweet.  BBQ buns were off the chain good.  It was still very soft and moist the next morning.  Will definitely come back when visit SF again.", "author": "E W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "This is one of my favorite bakeries/cafes in SF Chinatown.  Their egg tarts are some of the best I've had and I love getting their HK milk tea.  It's also one of the few places where you can get egg white tarts  They have an incredible variety of other items, all of which make for good treats to buy for friends and family.  The boxes which they give out their food in is not your typical pink box either; they're good quality and good design.\n\nThe drawback I have is that it's not a good sit down spot, even there are a couple of tables and chairs, and some items could be a tad too sweet, like the pineapple bbq pork bun.", "author": "Cliff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-05", "description": "I like their mango pancake, Japanese-style cheese cake, egg custard tarts and moon cake.   Their buns are fresh and tasty.", "author": "Wynman N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "My boyfriend & I was on a hunt for some egg tarts. The lady was very kind and gave us suggestions on what to purchase. We purchased the egg tarts, turtle bun (with red bean filing), and a few more that I can't remember from the top of my head. All in all, the pastries were very tasty and we will definitely be back to try the rest of their selections (baked goods).", "author": "Hien V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-07", "description": "$1.10 for egg white custard? sounds expensive considering we're in Chinatown...BUT the service was sooo amazing!\nThe lil old lady gave us fresh out of the kitchen custard, eventho there were two left in the display...and she brought them to our table, boxed it up and bagged it for us. No waiting at the cash register for us! Incredibly polite and sincere... that's what i call service with a smile:)\nOh and FYI, egg white custard... DELICIOUS! esp fresh and steaming hot!", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "Finally tried their egg white dan tats and I was a bit disappointed. It was a nickle cheaper than the regular ones at golden gate, but it just tasted bland. Maybe I just like eating unhealthy :P I bought some from both bakeries just to compare and the golden gate ones went twice as fast. Their other buns are pretty decent and they have a lot more selections than golden gate, but as far as dan tat goes, i'll go up the block to golden gate.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "This review is for the pineapple pork bun...Yes u heard me right PINEAPPLE PORK BUN, it's a nice balance of salty & sweet... yum yum", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-08", "description": "Had a chesnut bun, coworker had a cream bun.\n\nWe both agreed that they were tasteless and bland. This is coming from someone who likes bland food. I have to say that there is not too much selection and from the samples that I have had they are not very good. If you want bland tasteless baked goods then this is your place.\n\nThey'll also blatently disregard you if you don't speak Chinese to them.\n\nTry going to Washington Bakery where there's a much better selection, or really of the other Chinese bakeries around. There are way too many to waste your time at one that is subpar.", "author": "Lilly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-22", "description": "Stopped by after reading sfoodie's article on this place. Got the eggwhite tart as recommended. Fresh from the oven w gooey eggwhites! The bread part isn't as sweet/glazed as other bakeries'...hence the one less star. But yummy nonetheless and I feel healthy after eating it! Score.", "author": "Ami Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-23", "description": "Hi, \n\nI thought this place was over priced and tasteless.  I had the sticky bun and it was no good.  The prices where high and they hardly spoke any English.  I would not recommend this bakery.", "author": "Nina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "Clean and friendly. BBQ pork bun was good, even though I like Blossom Bakery's better by a little. Great egg tarts. Overall, I really like Yummy Bakery.", "author": "Todd H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "Visited here three times, twice in the afternoon and once in the evening.  Ordered the coconut and ham and cheese buns and the Mexico stick.  All three were AMAZING.  The bread was soft--nearly melting in my mouth, and obviously fresh.  At only about a dollar a piece, they were very cheap (at least to an Alaskan).  The customer service was curt, likely because I didn't speak Chinese.  The bread was so good, I bought a couple extra for my dessert and plane trip home.", "author": "Tasha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "You must try their cheesecake. It's a tasty steal at $2 a slice or $12 for entire cake! They also have some cute cakes like tiramisu and chocolate mousse.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-11", "description": "I'm sure the baked goods are pretty good based on the reviews, but I'm giving this place 2 stars (read update below, changed it to 1 star) for the milk tea I got.\n\nAfter lunch, I was craving some milk tea and decided to give this place a shot. I ordered a cold milk tea, and the woman nodded and went to the back. After a couple minutes, I see her return with a cup half full of ice. Next, she poured a healthy amount of condensed milk into a glass and added some boiling water; she stirred this concoction for several seconds. Then she went to the fridge and got a pitcher of what looked like some sort of tea. Then she turned her back to me and tasted the tea. She went back to the fridge and grabbed the other pitcher of what looked like tea, and tasted that one as well. Then she tasted the first one again, and decided to pour that one in the cup of ice. Finally she added some of the condensed milk/hot water mixture until the color looked right. She handed it to me like nothing was out of the ordinary. All told, it took about 6 minutes to prepare the drink and it cost a relatively expensive $2.50. The only redeeming part of this is that it actually roughly resembled milk tea.\n\nOh yeah, and I just got back from the restroom after my stomach told me I needed to go. Needless to say, I won't be going back.\n\n***** UPDATE, 3 hours later *****\nI'm changing my review to 1 star because my stomach has felt like crap ever since I drank the milk tea from this place. She must've been tasting the two teas to determine which one seemed more fresh. The answer is neither. UGH! Time to run back to the restroom.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "i can only speak for my breakfast experience here, and it's good. their buns are highly expensive compared to other chinese bakeries, but the service here in the morning is better than any other bakery; they NEVER make you wait like some stockton or pacific street bakery.  i always get the egg salad bun and the pumpkin bun, which are highly delicious and Fresh.  one of these days, i'll try their visually appealing mango cake as well.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-27", "description": "Something is missing in their buns.  Their buns are dry and light in weight.  The egg tarts also lack in texture.  Not bad for Chinatown, but not great either.", "author": "susan g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-11", "description": "They have the best Mexican stick bun and Japanese style cheesecake. Most of their buns are light compared to most bakeries. I also really like their 1/2 milk tea 1/2 coffee. The only bad thing is their buns don't stay hot.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-14", "description": "I love their Milk Tea.  It's not too strong and not too sweet.  It's just right.  Their Japanese cheesecake is okay but for some reason mine had a gritty texture.  Still their milk tea makes up for it.  What can I say, I'm a sucker for good milk tea. =)", "author": "Satori P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "Very good red bean bun. Nice ladies.", "author": "Honey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "Such a clean place!  And chairs and tables to sit!  Sure, Golden Gate Bakery has the best egg tarts, but here is a nice atmosphere, plenty of space to order or settle down, and the egg tarts are usual or just egg white!  When I ordered the white egg tart, she marched over to the kitchen to and pulled a hot one out!  She can even count her change without a register, so it was a smooth transaction.  I handed her a large bill for $1.10, and she insisted on me giving her .10 so I'd get change in ones.  Sweet, my favorite kind of change.  (I've had ladies cheat me outta change before).  Too bad I checked this place out last of 5 bakeries, or I would have spent my money just here instead of the others (besides Golden Gate Bakery egg tart, of course).  If you are solely hunting the bakeries out for egg tarts like me, you need to try the ones here!", "author": "Missa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-18", "description": "We came in the bakery in around 9 am.  All the bread and baked goods were fresh out of the oven.  The bread were soft and inexpensive.  Definitely YUMMY!", "author": "Melody C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-15", "description": "Been a customer for a couple month now, and have tasted the followings:\n- milk tart ($1.1) - good\n- egg tart ($1.1) - very good\n- pineapple bun ($0.6) - ok\n- Mexico bun ($0.6) - very good\n- cheesecake ($2) - OK, very light. not recommend\n- blueberry cheese bun ($1.2) - very oily. not tasty. not recommend\n- HK style milk tea ($1.8) - average. I hate they add sugar to my milk tea. I prefer to have only condensed milk.\n\nI'm going to give this cafe 3 stars because the buns and tarts are good but not awesome. They are not warm, which I like, In addition, the prices are little higher than most bakeries in Chinatown.", "author": "Ed W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-28", "description": "My husband and I used to go there every month while visiting Chinatown. We like their egg white tarts in flaky shells as not too many places have it. And they don't make it too sweet just as we like. We liked their selections and service was great in begining when they first opened. They occassionally and selectively give out discount around evening time to some frequently visited customers (or if you are lucky) to get rid of some buns or to give away some buns just coz. But once we came around evening times, not to mention no discount when I asked even though I purchased a lot, they didn't have too great of an attitude towards us and stressed the point they never give out any discount or buns (which we know it is not true).  But what got me upset was I recently went back again and asked for 6 buns and I found there were only 3 buns in the bag when I got home. Obviously, the girl misunderstood me even though I spoke loud and clear in Chinese.  That time, I had to walk up and down the hills of Chinatown in heels to look for that place and I didnt' plan to just buy 3 buns. It really wasted my time and efforts.  Anyways, on a second thought about this place, their buns aren't cheap and their quality (size, taste, and freshness) is not above average compare to other bakeries around the area.  I don't think I will go back to them as I am disappointed that they can't up keep their quality and service.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "I've never actually stepped inside this bakery and have only had the egg white tarts that my parents buy whenever they're in town, but these tarts are bomb (they are the flaky crust type) and inexpensive.", "author": "Tracy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-16", "description": "i give one star because of the way they do business..probably because my husband and I were the only caucasians in the store, they sold us a $5.00 for 2 small tarts ..    When I said\" Wow that's not cheap!!, the young lady replied \" But you're paying for the 2\"...Thanks dumb...I can do the math , it's still $2.50 for a small freakin' tart...I expect to pay that price at the Ferry Building, which make sense, but here no...\nThey didn't even have their price on the  goods they sold us..while all the others baked goods were at the top $1.00 a piece..They're a freaking small chinatown bakery...Place at the Ferry Building have better stuff for the same amount or less...\nI know I should have say 'no thanks! bye..'..What they sell is not even great,  just barely o.k...\nSave yourself a trip for that price, just go to a real french bakery, you'll probably pay almost the same price, but at least it will be yummy and taste like real pastries....not sponges.", "author": "luna s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "Try their Chinese Toast and their Caterpillar Buns.  (Mo Mo Chong).  Their pastries are cute with really cute names.", "author": "Bonnie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-11", "description": "Don't like cold pork buns--not at all.", "author": "Anton W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-10", "description": "Love it! Love the egg white tart! I was there 5ish... wanted to buy more than a dozen egg white tart for family... they only had 13 for me... the owner was so nice, treated me to one of his product-- birdnest egg tart. He said he will  start selling them in a few days. I tried it and love it too! Will go back to get both the egg white tart and the bird nest egg tart next time!  They have great customer service, very friendly people. Price is very reasonable. It looks very clean and well lit compare to many bakeries in Chinatown. (since they have only been opened for 6 months)They have a lot of interesting pastries, such as coffee walnut roll.  Make sure you try this bakery (esp  when Golden Gate Bakery is always closed, this is a very good alternative when they are closed or if you just simple don't want to stand in line!)", "author": "sam l."}
