{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "Solid spot for weekday lunch with convenient grab-and-go bento boxes.\n\nSort of hidden along Harrison Street, I probably wouldn't have discovered Zen Izakaya if it weren't for Mealpal but I'm glad I did. Great bento bozes with lots of variety. From a variety of mains like grilled salmon and saba to takoyaki to deep-fried horse mackerel (ajipura) accompanied by a plethora of sides like fried tofu, calamari, tamago, pot stickers, salad and more. They switch it up quite frequently which is nice. Fret not if you're not on Mealpal, grab-and-go bento boxes are $10 for lunch and you have quite a few choices for the entree. \n\nHaven't actually eaten in but the space looks nice and the folks that work here are very friendly. Still, I thoroughly enjoy Zen Izakaya as a speedy and delicious take-out lunch option.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "I'm a little bitter about Zen Izakaya only giving me 11 out of the 12 nigiris that I paid for in my omakase set (I just realized when I was editing my photo).. but aside from that, Zen Izakaya is a solid sushi spot. \n\nThe 12 piece omakase nigiri is definitely a weeknight #treatyoself kind of meal. $46 is on the pricier side (to add salt to the wound of only receiving 11..), however the slices of fish were generously cut which was a plus. \n\nFish quality seemed above average compared to some other casual sushi spots in the city. I was pleasantly surprised by the quality of the salmon. The uni was another pleasant surprise - no weird/fishy taste here! They harvest (is harvest the right word?) their ikura themselves from salmon that they get in - kewl!\n\nOverall, solid spot, just be sure to count what you're served lol. Definitely take advantage of the complimentary beer with Yelp check-in!", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "I got a MealPal salmon bento box at Zen Izakaya and was very impressed with the amount of delicious food! The pickup was fast since the food was already prepared in advance and ready to go.\n\nI like how they packed on a bit of variety in this which was a nice touch. In addition to the perfectly cooked piece of salmon, there was a piece of fried tofu, pickled veggies, one gyoza, a few pieces of fried calamari, two octopus balls, a small salad w/ tomato, and seasoned rice. \n\nI would definitely recommend getting this as a meal and also plan to dine in for some more extensive options. They have a happy hour menu with very reasonable pricing and would like to give their udon a try.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "We ordered and had just gotten our food. They started cleaning the grills with some really harsh chemicals. Hot grills + cleaning fluid. I got an asthma attack, and a pretty nasty one at that, as the air was flooded with this fog. You can imagine. \n We had to leave about five minutes into getting our food. No apology, they were trying to clear the place out. Well, they succeeded. When I mentioned this to them, they offered to call me an ambulance, and that was it. Just incredibly awful. I would never go here again.", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "I have been to this place multiple times and they never fail me with their food services.  I would like to compliment to one of the best server, Noa (Hope I spell his name correctly).  He has the best smile and friendly attitude toward my friends and my kids.  He came to check on us almost every 15 mins to see how we are doing.  Overall, I feel like home whenever we dine there!  Our favorite Japanese restaurant in town.  We will be coming back with our friends more often!", "author": "Marie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "My gf yelped found a gem.\nFrom beginning to end this place was amazing with staff making us feel like family. \n\nSashimi was very fresh and waygu beef melted in your mouth on the hot stone that came with it for a wonderful experience. \n\nThis place is small but make it up in a big way with fresh items and wonderful service. \n\nThe only part I feel they should change is the size of their sashimi (you could turn some of the sashimi into 3 pieces to make it bite size) \n\nIf you're in the area give them a try. Definitely be back when we are in town.", "author": "Thomas N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Wow! Another great restaurant led by chef Sano!! This place is new and has better vibe than their other resto in Millbrae. \nStopped by tonight for dinner and ordered the following:\nTako karaage- fried baby octopus\nButakani- braised pork belly. So incredibly good. \nChirashi - fresh and delicious\nMini unagi with udon Donburi- yummy for me!!\nEnjoyed visiting an old friend and truly enjoyed our dinner. Great flavors, fresh sashimi, fast and excellent service. What more can you ask for?\nParking wasn't so difficult and parking meters are free after 6 pm. \nStop by and enjoy this new place.  Trust!", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "Nothing specials, just mediocre sushi. Server is quite nice. \nNigiri sushi & the rolls are not that impressive, especially the rolls.\nThe bake mackerel is a bit smell fishy.\nI am hopeless to try the other items in the menu.\nWill not be back again.", "author": "Irene X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Good place for cheap, low-key happy hour and nice service. \n\nMy boyfriend and I stopped here Monday during HH time before walking over to the Giants game. Seated immediately. There were both apps and rolls on the menu for $4.99. We got 2 apps: fried octopus (avg) and potato croquette (yum). We also ordered 3 rolls: spicy tuna, rock & roll (has eel), and a fried shrimp roll. All 3 were your average rolls - good and affordable if you have a craving for sushi. Got free beers for checking into Yelp! \n\nNice folks who work here, too.", "author": "Thu P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Continuing to fuel the salmon cravings (fish--omega-3 fatty acids--happiness; I swear there's a link somewhere). I got a salmon don and amaebi order from this spot.\n\nThe smoked salmon was different than other spots that I'd had-- not salty, only smoky. I wonder if they do it in house.\n\nThe amaebi wasn't particularly creamy, but seemed fresh enough.\n\n3.5/5-- didn't love it, but it wasn't bad either. I'll probably be back given that it's in the neighborhood!", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Went here on a Saturday night around 6pm. Early enough to beat the crowd so my party of 6 was seated right away! Very cute&cozy atmosphere, friendly service, and loved how the TV was showing a Japanese food network. \nGET THE EDAMAME!!!! Holy lord the Edamame was a life changer. I wish i remember the names of what we ordered, but I'll just post pics of my favorite things. The fish was all really fresh, i definitely recommend all the sashimi creations. We also got the duck, and that was bomb. Also had to try the tempura cheesecake??? Never heard of that before but it was crispy and melty. Flavorful but not overpowering. Overall, this was like a sleeper hit. The location is surprising, but the food and service are honestly like 10 stars if i could do that.", "author": "Mimi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-02", "description": "Checked out Zen with the boyfriend during their happy hour on a random Tuesday because we always pass by during our trips to Whole Foods. Nice contemporary spot with lots of options for food during their happy hour where most dishes are only $4.99!\n\nGot the following $4.99 dishes:\n- Takoyaki -- not bad\n- Gyoza -- not bad\n- Rock & Roll -- bf liked this\n- California Roll -- bf liked this\n- Edamame -- lightly salted, can't really mess this dish up\n- Goma-Ae -- the spinach was lost in the sesame sauces, a bit too sesame heavy for me\n- Agedashi Tofu -- really wanted to like this, but it lacked in flavor\n\nBf also ordered the Udon with Chicken ($15) which had a light & decently flavored broth with lots of red onions & fish cakes. Unfortunately the chicken didn't impress me, on the bland side for my taste. Wouldn't order it with chicken again, perhaps with another meat option.\n\nOverall, would come back for happy hour prices, service, & perhaps reorder the takoyaki & udon.", "author": "Carol N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Came with a party of 5 on a Wednesday night. Found free street parking. The waitress asked us if we wanted hot tea or iced water. We got both. Since it was our 1st time there, she made some recommendations on their most popular items such as the PepperTail. We ended up ordering that as well as the..\n\nStarters:\nAge Dashi Tofu - $7.50\nBaked Corn Butter w Cheese - $8.50\nDeep Fried Oysters - $11.50\n\nHouse Creations: \nWagyu Beef Steak 8oz - $36\nDuck Breast & Foie Gras - $34\nGrilled Scallops w Garlic Basil Panko - $24.95\n\nRolls:\nFunky Dragon - 18.95\nSex on the Bossanova - 18.95\nLover's Cove - $18.50\n\nDessert: \nRed Bean Ice Cream - $4.00\n\nWe also got Toro & Uni (both Seasonal). The grilled scallops were delicious! The sashimi, uni & toro tasted really fresh and had a great texture. For the Wagyu, the garlic teriyaki sauce was a\nbit too heavy for me but overall, great food & service!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "My team came here for lunch and asked for the wagyu beef - which is only available during dinner. It was kind enough for them to allow us to still order the food. However, it was definitely not wagyu beef. The table spent over $500 for this entree, wagyu beef steak. Wagyu beef typically only has some seasoning; salt and pepper. But this dish had a garlic sauce on top of it (probably to cover up that it wasn't actually wagyu beef). The yellowfin tuna and hamachi were both good. I would recommend eating the sushi dishes, not the wagyu beef steak entree.", "author": "Julie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Hey yelp,\n\nWas recommended this location by a friend. Was weirded out by the location at first, thought I was in the wrong place. Upon entering, it was actually cool. \n\nLots of wine and sake, I just got a Yuzu Shochu for myself, which was great! Waiter recommended one of the Ginjos, I think, so shared that with my girlfriend. \n\nFoodwise, we got the Papaya Splash, Lovely Night Roll and the Wasabi Salmon. The papaya Splash wasn't my favorite, too fruity and tangy, but my girlfriend loved it for exactly those reasons. I liked the presentation though. The Lovely Night Roll was good, but completely outshined by the Wasabi Salmon. My girlfriend hates wasabi, so I got it all to myself. If you enjoy real wasabi, not the fake stuff they give in many restaurants, then this is the dish for you. The wasabi was the perfect amount to not overpower the salmon. The flavor was enhanced with soy sauce, but it's one of those dishes that doesn't need it. The fish overall had great texture- you could tell it was fresh. \n\nFor dessert we got red bean taiyaki. It was presented with blueberries and whipped cream. Weird.. but it actually paired really well with the red bean! Would get that again. And will now buy blueberries when I get red bean desserts at the market lol\n\nOverall, a great place for a date. Prompt service, and the staff was knowledgeable enough to recommend something we loved after we talked about what we were looking for!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "This place is great. Came in on a Saturday with a small group of friends and were seated pretty promptly. We ordered a handful of their newer items by recommendation of the staff.\n\nFirst two things to come out were the Asparagus Gomaae & Garlic Edamame. The latter definitely being something of interest due to garlic flavor being enhanced by the butter.\n\nWhat followed was the Pepper Tail & Wasabi Salmon. Both were just absolutely amazing, with the pepper tail being complimented by lemon juice & jalapeno and the wasabi salmon being accompanied by fresh wasabi (not the paste that you normally expect from lower-end japanese establishments). Definitely recommend getting either of these two if you're into raw fish at all.\n\nThe third set of items were the Tonkatsu & Duck Breast Roasted. Though I had personal reservations with the tonkatsu, it was overall pretty good. The pork itself was really nice and tender, the breading wasn't too heavy, and the demiglas sauce is where this dish is taking in a different direction. Instead of the tangy, heavy sauces that we're used to from other locations, the demiglas is lightly sweet and very easy on the stomach. It is best followed by sushi, as I've been informed by the staff. The duck breast was absolutely wonderful, paired with garlic chips made for a great deep flavor profile. My friends definitely enjoyed adding some of the demiglas sauce onto the duck, which made it even better in my opinion.\n\nAs extras, I ordered Toro Nigiri & Corn Cheese. The toro I requested lightly seared (imo brings it to way higher level due to some oils coming out in the searing process) and the corn cheese could honestly have been a bit sweeter (totally personal preference) but was still awesome to have.\n\nThe staff were very attentive and we were treated very well during our time there. I would very much recommend this place to those seeking high quality cuisine.\n\nThank you!", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "To start off, I should mention that this place is quite expensive. For one person, I'd say expect to spend something like $25-$35 here before drinks for a normal meal. For example, a unagi donburi (BBQ eel bowl) is usually $12-$15 at your typical family-owned sushi restaurant but $20-$25 here depending on if you get the mini or the large. \n\nBut once in a while it's worth it to pay up, because this place is not your normal sushi restaurant. I might go as far as to say what they do is akin to sushi art; they do try to experiment with different flavors to delectably innovative results. Nothing is too in-your-face per se, but the differences are delicate enough to be familiar yet *better*. I'd definitely come here again, but only on special occasions.\n\nIf you're looking for recommendations, I'd try the rolls (I like the Rock 'N Roll) and the chef's creations. The noodles and the rice bowls are more typical.", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "My friend from Sacramento came to visit and we came to check out this spot. \n\nWe got the fried shrimp heads, uni, salmon dish, and assorted sashimi. We also got the waygu beef on the hot stone.\n\nI'm impressed with the waygu beef, they are pretty generous with the portion and it was fun to cook the meat. I don't think I've been to a Japanese place that had this on the menu. It was fun.\n\nThe fish was fresh and tasty. I would def come back.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-17", "description": "Food: 3.5/5 \nService: 0/5\nAmbiance: Casual \n\nWaitress named \"Season\" or the girl with the Balenciaga shoes kept bringing food we did not order. Not only that but she kept insisting our table to purchase the $200 bottle of sake and if we did the underaged people were allowed drink it as well. One of the people in our group ordered a beef dish but once it came out it wasn't even the right one. She then tells us that it's not available after she brings out a different dish. Why didn't she just tell us in the beginning that it's not available?", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "I came here for happy hour sushi before an event at Wood Thumb. The prices are great and the sushi was fine, nothing amazing, nothing terrible. $4.99 for spicy tuna with cucumber, shrimp tempura, eel, and california roll. We also got the fried oysters for $5, but they were kind of weird.\n\nI be their regular sushi rolls are good, but they were all $18 which is insanely high.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "Service: Ordered takeout which was grab and go! \nAtmosphere: looked nice but can't say much because I had take out :)\nFood: very American Japanese~ you get the option of brown or white rice but that's the only take out option available. I realized after finishing my lunch that the meat was mostly fat rather than actual meat which was a little disappointing.", "author": "Maddy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "Review is only based on to-go lunch bento of the day which was beef with a little salmon, sides were burdock salad, seaweed salad, creamy corn salad, spicy shirataki noodles, tamago egg , karaage, fried squid tentacles and daikon pickles (the yellow ones).\n\nThere are a couple of bento places in FiDi and Soma area that are $10, but I think the one at Zen's was the best. It was about a 15 min walk from the office and lunch bento seem like the thing, as the restaurant was empty (dine in at lunch time, would be hard in that area, but I would not mind if I had the time).\n\nI wish they has a Twitter or Instagram to tell me what the daily bento's are so I do not have to call them everyday to find out what it is. Bento is fresher then Japa Curry, as they do not have to refrigerate it the same way as Japacurry, so the rice or protein is not as hard. The beef was cooked with onions and was delicious.  The salmon was a little over, and a little smokey. I loved the karaage, fried squid tentacles and spicy shirataki noodles.", "author": "Mei L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-29", "description": "Came for happy hour which was pretty good (although I wish they had more sushi selection). The garlic edamame they recommended wasn't as good as just regular edamame. \n\nGood service", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "Their entrees and lunch menu is quite confusing on the ingredients served up.  For example, we ordered up chef's special and there was just a fusion of different Asian food on one platter!  I've never seen anything like it.  It was unique, but I'm at a Japanese restaurant so I was expecting more along the lines of Japanese tapa bits as a taste sampler!\n\nOther than a twisted menu, their rolls are good and they offer sashimi variety.\n\nBento boxes are made ready to grab 'n' go for the quick lunch run!\n\nWagyu beef on sizzling stone is apparently their signature, but that's more on the dinner regime if I was to order it.\n\nThere was one server that was a bit on the clumsy side.  Other than that, nice atmosphere and good place for sushi.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Interior - Beautiful, small, modern, and romantic. \n\nService - Wonderful, kind, and helpful. One of the chefs marked off a dollar for our nigiri just for talking with them.\n\nTofu Pizza - Fried tofu as the crust, marinara on top, and choice of meat. Tastes satisfying and filling. \n\nHamachi and Toro Nigiri - Thick, chunky, savory slices of fish with a little bit of rice. Delicious. \n\nZen Sunomono - Food art that tastes as good as it looks. It was refreshing with hints of lime and cucumber.\n\nSalmon Kama - Do not order. It was bony. \n\nSpinach with Sesame - Looks like poop, but the sauce was fantastic. Don't eat the bright stuff on the side. This was my favorite dish.", "author": "Ee Vonn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Delicious bento! Picked up some of their daily meals from Mealpal and was so happily surprised to find fresh and delicious favorites in my box.\n\nSalmon wasn't damp or soggy like I usually expect from places around here. It was perfectly seasoned with just a bit of salt, firm, and had slightly crispy skin.\n\nTakoyaki batter tasted fresh, had some great veggie pieces folded in, and of course had decent sized pieces of octopus.\n\nI adore the fresh pickled vegetables, tamagoyaki (super sweet and delicious!), tomato, and other sides that come with the lunch. One of the few places that actually remembers how important variety and quality are over the quantity of food.\n\nI could easily come here for lunch several times a week.", "author": "Nikki L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-28", "description": "This place is more like a 3.5 Stars kind of place....\nTheir Chazuke Onigiri soup with Ikura was BOMB.COM. I would come back and eat just this! X3! \n\nMy husband and I ordered 15 pcs Sashimi and I was sorely disappointed that there was no julienned daikon to go with the fish. They used fresh wasabi which means they care about the details, but not having something to pair the sashimi with was a shame. \n\nTheir service was BAD...so bad that half the time the Owner (which I'm assuming was the Gentlemen  sitting at the table by the door) kept pointing his hands in different directions to let the server girls know which table needed attention. Sad. While we were eating; a group of diners walked in. Nobody noticed them for a couple minutes while 3 waitresses, 2 sushi bar chefs were all watching TV...wow. I felt bad for those people.", "author": "Kay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Came here for the grand opening and had a really good experience. The service was amazing - everyone was extremely nice and attentive, and the owner even came around and took a shot of sake with us during our meal. We ordered:\n\n- Octopus wasabi\n- Sashimi platter\n- Wagyu beef on the sizzling stone\n- Ankimo\n\nMy favorite was by far the wagyu - the dish comes with 2 dipping sauces and you lightly sear the wagyu on the hot stone at the table. The sashimi was also good, but the temperature was slightly off (a bit on the cold side).\n\nVery modern interior and the restaurant was kept very tidy overall. Will definitely come back!", "author": "Angela K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "We live less than a block away from this place, and my Japanese wifey frequently gets a craving for some good sushi.  We decided to check this place out because we got a flyer advertising their \"grand opening\" in the mail.  \n\nWe've been here twice now, and have had different experiences each time.  The first time, the service was slow, and the prices were high.  We debated going back because the food was so good... but, we didn't want to wait 15-20 minutes for a sushi roll, or 30 minutes for the check.  \n\nWe caved and went back with a third person, and I'm glad we did.  I read some yelp reviews which stated that the service had improved, and the prices were more reasonable.  The waitress let us try this expensive, high quality sake that she recommended, even though we didn't want to order it.  It was GOOD! We ended up ordering another similar sake that was still really good.  \n\nThe starters are good, and are a nice size for sharing.  The sushi rolls are good, and leave you wanting more despite how full you are.  The fish is fresh and very flavorful.  If you like fresh and flavorful Japanese food, this is your spot.  \n\nI'm knocking one star off because we weren't allowed to use our coupon and I didn't understand why (apparently because the only full priced item we ordered was an appetizer?).  We weren't told until we were presented with the bill.  The waitress told us to come back again and use it (okay...clearly a business move).  I have to say, the staff was also more friendly this time around (compared to the first time), but this interaction rubbed me the wrong way.  \n\nI'll think twice about going back, but only because it's close by and the food was memorable.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-22", "description": "Don't go this restaurant!!!!\nI ate Kakiage Soba at this restaurant. And All noodles are chopped like my attached photo. I think it's a garbage of soba. It's definitely not $15 soba. I'm really disappointed and I will never go. \n\nそばを茹でたあとのカスが約15ドルもするそばとして提供されました。日本人スタッフがいるレストランとしてはありえないクオリティです。非常にがっかりしました。こんなものを日本食と提供するのは恥ずかしいです。二度と行きません。", "author": "Katsuya H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-28", "description": "I want to give this place a 3.5 cause I wouldn't mind coming back for a lunch, if I happen to be hungry in that area.\n\nFirst off, the menu is confusing AF.  It's huge, and  it's formatted as a giant block of text.  It's a lot of fusion-y foods which I'm not generally a fan of, but still tastes pretty good.\n\nWe had\n- Fried squid\n- Karaage\n- Carbonara Udon\n- Dancin' in the night roll (not sure if I have that name right)\n- Saba, Walu, and Inari nigiri\n\nFried foods were solid, Carbonara was surprising good, nigiris were skippable.  It was good but nothing to write home about.", "author": "Sean Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I have been to Zen Izakaya multiple times (at least 4) now for group lunches, they never fail with their food. Even though this is an Izakaya, sushi is amazingly fresh, their Chirashi is one of the best I have had in the city and everything I have tried from their apps to their bento boxes have never failed. Definitely worth the trip from wherever you are in the Bay Area. Parking is actually not bad during non-peak or non-ballgame days.", "author": "Julie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "This is a review for their lunch, which had a much more limited menu than their dinner.\n\nThe place was bigger than I expected, which looked pretty tiny from the outside. They have a long sushi bar as well as some booth & chair tables.\n\nI ordered the sashimi plate which came with rice, salad, and miso soup, which is normally pretty standard quality, but this soup was especially good. There's something special in that dashi.\n\nThe sashimi was good quality and varied enough with your standard American sushi fish (salmon, red tuna, albacore, hamachi).\n\n$21 is not an everyday lunch, but they do sell some cheaper bento boxes so I'll be coming back sometime soon.", "author": "Carlin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "Modern (borderline hipster) Japanese, if you like that kind of stuff.\n\nDinner here was pretty solid, but maybe not as true to traditional Japanese flavors as I wanted it to be.  Still, the wagyu beef you cook yourself on a sizzling stone slab was pretty damn delicious.  We also got the Nuevo Zen roll and the Wasabi Salmon.  Prices are steep, it was almost $20 for 5 pieces of salmon sashimi?!  But if, like me, you're celebrating a birthday and your friend is paying, go to town!\n\nService was nice, our glasses were never empty and food came out fast.  \n\nTips and Tricks\n-If you've got a seat in the waiting area, just ask your server if you can eat at that table.  Beat the wait!\n-Already crowded by the time we got there at 6pm, ended up waiting even with a reservation\n-Dessert is pretty, but nothing spectacular", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "Totally ruined my best friends birthday party. I made a reservation for 9 ppl today and spoke to Ricardo twice about today and they're closed. So disappointing.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Got a salmon Bento Box through mealpal from this place. It is quite tasty, and visually pleasing. It's certainly one of the better value in the mealpal program.", "author": "Lionel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "Overall a solid bowl of ramen. The classic bowl had great flavor, a rich broth and pretty tasty noodles. The vibe is a little more like a loud bar than an intimate ramen place but if you're going for more than a few drinks and want to slurp some noodles along the way, this is the place for it.\n\nMy real only complaint was the spicy levels. I ordered spicy ramen ($.50) plus an add-on of extra spicy ($1.00) and it STILL wasn't spicy. I had to ask the busy wait staff for another add-on to even get it to a normal level of spicy. If you love spicy, you really have to pay extra to get it. \n\nEven still, it's a good bowl of ramen and worth the trip if you're in SOMA.", "author": "Loryn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "I was surprised at the quality of the food and friendly service. The Donburi with Unagi, Uni, and salmon rose was fresh and tasty. The Krazy Dragon roll with shrimp tempura, spicy tuna, unagi, and salmon roe was delicious and portion was just right. I would order for delivery next time.", "author": "N A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Just came back from lunch at Zen and honestly, it was not very good. The Daily Special came with \"chicken teriyaki, salmon teriyaki, and beef teriyaki.\" Sounds like an amazing deal for $14, right? But the chicken was completely cold and the salmon was hard. Only the beef was tasty, albeit extremely fatty.\n\nThe salad that it came with was ok. The miso soup may have been the best part. I gave this place one try and that's enough.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Service is great, I had my CC book a table for 7, and got a private room, it's almost like japanese style, table with cushion and feet dangles down. The food selection is not bad, some small bites to bigger bites. \n\nLots of rolls were really good, the hot stone wagyu beef was a favorite amongst the friends. \n\nThe yuzu aladdin and the sparkling was so good, I ordered 3 case of the sparking online. \n\nKarage was so so, wings looked good, tofu was flavorful.\n\nThe cheesecake ice cream was really good, it's like cheesecake that's frozen and cut into chunks. \n\nIf you check into yelp, you get free beer or sake. \n\nWe came here for a birthday, and they gave us sake on the house.", "author": "Minerva L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "This place definitely is overpriced -- most of the rolls are in the range of 19$. Here's what I got: (prices not including tip/tax)\nAnkimo with uni (21.50$): only 4 small pieces. Nicely textured, and the taste was amazing. However, the price feels kind of ridiculous.\nIkezo sparkling sake, yuzu flavor (8$): free with yelp check-in! I liked this a lot; it has little jelly bits in it. \nChicken karaage (10$): pretty decent. There's a normal amount of food for the price, and the pieces of chicken were reasonably crisp. Not much flavor though.\nTea (2$): I hate when tea is offered as if it's free, but then there's a secret charge for it. It's not nice enough to be worth 2$ either. \n\nThe service was a little spotty. When I first sat down, the service was prompt, but by the end of my meal, I tried for like 10 minutes to get my check. Nothing super out of the ordinary at a normal restaurant, but I felt like it was worth noting based on how pricey this place was.", "author": "Helena Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-20", "description": "Interesting place. Food was really good but service was really bad.\n\nTorn.\n\nWaitress didn't give us the time of day. We had to keep flagging her down. It was like we weren't even there and it wasn't even that busy as we were the last customers to sit down for the evening. \n\nThe best thing was the free beer for checking in on Yelp. I was starving and I figured I would drink that while we waited for service. \n\nI'd probably give this place another try if I lived in the area. But I don't so probably won't come back unless I happen to be at the Whole Foods around the corner.", "author": "Song C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "Food:\nMade with fresh, solid ingredients. They pay attention to plating and decoration, which is important for the price (easily $50/per person without drinks because portions are tiny).\n1. Wagyu beef on sizzling stone: the fat is evenly distributed and is of good ratio versus lean meat. The result is super tender meat that's just perfection alone, without the sauces. \n2. Tako yaki: delicious and authentic  \n3. Scallop appetizer: served on sliced avocado, fish roe, and special aioli sauce. This was my favorite dish, simply perfection. \n4. Nigiri: we had sweet shrimp, scallop, sea urchin, and tako. Ingredients were fresh and the prices are steep ($7-9 for a set of 2) \n5. Dessert: red bean pastry desert was pre-made and stale. It seems like an after thought, not on the same level as the rest of the dishes in the restaurant.\n\nService: \nI would give one star for the service. They are severely understaffed and everyone tends to all the tables, resulting in things falling through the cracks. I will explain why: \n1. It took 5 minutes after sitting down for anyone to acknowledge us and bringing water. \n2. After we placed our order, it took 50 minutes for the food to arrive. No one came checking on us during this time. \n3. When food finally came, the server realized how unhappy we were and offered to give us a free appetizer and half off one entree. We appreciate him trying to make it up to us, that's why I would still go back if I'm in the neighborhood.  \n4. The waiters didn't look us at all while serving/talking to us. They always looked like their names were being called somewhere else, which isn't the case. It felt incredibly odd. \n5. We had to ask for water 3 times throughout the meal(due to the long wait). They don't refill water unless you ask. \n\nOverall, though food was mostly delicious, they are not consistent. And for the price they charge, service does not measure up.", "author": "Tata X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "When companies give interviews, they use 2 stars for weak no but can be convinced otherwise, 4 stars for weak hire but can be convinced otherwise and 3 for no opinion. \n\nI'm using 3 stars here for no opinion. This japanese restaurant recently opened up in my neighborhood so my bf and I checked it out on a last minute whim. We didn't have to make reservations ahead of time, although they do take it, which is nice. The reason why I give 3 stars here is because of waitress we had. \n\nmost japanese restaurants do not use dairy, but this place is more of an asian fusion japanese restaurant. I was extra careful when ordering.\n\nI recently developed a very serious allergy to dairy which I've gone to doctors multiple times and avoiding it to a T. I'm not on some \"healthy\" diet here. I asked the waitress multiple times and emphasized that I have a FOOD ALLERGY. and she told me \"oh everything on the menu is pretty self-explanatory. it's very straight forward if it contains dairy it would state it as such.) She repeated the same statement multiple times when I wanted to double check which items had dairy and which didn't.\n\nSo my bf and i decided to share a couple items. Everytime she came back, I'd confirm with her about the dairy situation. I think at this point she was somewhat annoyed at me since it was so \"self explanatory.\" We got a few items to share: a roll, the hamachi kama, and chicken breast. \n\nWhen the chicken breast came, I was about to take a bite until I noticed the crust looked oddly like cheese. On the menu, the chicken breast stated \"panko crust\" and no where on the menu did it state \"WITH CHEESE.\" I was furious at this point! Not so STRAIGHTFORWARD at all is it?!? \n\nWhen I called her over to talk about the situation. She was extremely defensive about how the menu changes and she had no idea we would share. \n\nlet's take a moment here and talk about kitchen laws. If someone states a food allergy, the restaurant is required to pass a note to the kitchen and keep certain food at a distance during preparation. Not only was the cheese not kept at a distance, it was cooked into our food! If I had a peanut allergy or if I had a air-restricting allergy and I didn't notice the cheese, I could have died. \n\nShe went to her manager who came by and gave us a reasonable apology. \n\nI wanted to give this restaurant 1 star, but I thought the manager was very professional about the situation and comped our meal. So I'm giving 3 stars for no opinion on the restaurant. Boyfriend said the food was pretty good overall, but I'm going to have to need more data points because this first one is definitely a -2 stars.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "Zen Izakaya is just around the block from our house and we had been interested in trying it out for some time.  The overall experience was decent but nothing that would draw me back.  It seemed like the servers were very new as it took a long time to take our order and from there on out we had to flag someone down when we wanted something.  I ordered the salmon mini don and it was a good mix of all the ingredients.  It would have been nice if the salmon was chopped into smaller pieces but luckily it was easily to separate myself.  My wife had the spicy poke-don and she said she enjoyed it as well.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "So, plus side: great food, sushi omakase was pretty good and they had fresh and tasty oh-toro.\n\nAlso prices were high but not unreasonable.\n\nOn the minus side: no reservations, service at the bar was very limited, sushi (rolls in particular) is very Americanized, desserts are subpar, many typical izakaya items such as yakitori are absent. Also the place feels like a diner more than an izakaya.", "author": "Stefano Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-27", "description": "Not really $$, more like $$$, but food was good.\n\nI'd skip on the sushi rolls and go for either the cooked meats or the nigiri (didn't try but we sat at the sushi bar and it looked good\n\nFor the best value for money here, I'd go with the appetizers. Compared to everything else, the portions are relatively bigger. We had the pork belly, and with some rice, it could be a meal for 1.\n\nNext came the sushi roll. We ordered the hello beautiful roll with salmon and kiwi. I wouldn't recommend the rolls, at around $17-18 each, they are pricey and small. There was more kiwi than fish and the fusion was not my favorite. \n\nWe also tried the wagyu on stone plate, as recommended by other yelpers. It's certainly unique, and a fun experience. The meat is well marbled and great, but the price is $$$$. \n\nNot sure that I'd come again for dinner, but would like to try out the $10'lunch Bento boxes.", "author": "Cynthia X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "Awesome Izakaya place in the South Beach area. \n\nThis place is new, but it's already established itself as one of the top options for Japanese cuisine. I had the opportunity to sit at the sushi bar, which was really cool because I got to see the chefs prepare all the food right in front of my eyes. \n\nThe main chef in the restaurant is this super nice dude who puts so much heart and attention into all of his dishes. I watched him create the sashimi special, a monster ice plated dish with an art exhibition made out of seafood on top, and every step of the way, he made sure everything had to go exactly where it was supposed to. If he thought something was missing, he'd redo the entire part again, and the presentation was just breathtaking. The dish seemed to be a bustling city of activity (ironically though, since all the seafood on it was dead).\n\nI didn't have the luxury of ordering such a magnificent dish, since I was alone, so I settled for one of their sushi rolls. I ordered the OMG Roll, which is great for those who love fish, and really enjoyed it. It was presented in a pyramid fashion, which is different from what you'd normally expect, but the toppings, the sauce, and how everything was wrapped together was awesome. Also, a surprise for me was the wasabi. Their wasabi is not too strong, and had enough flavor that enhanced my sushi eating experience. \n\nOverall, the service was actually pretty slow here...they didn't start making my roll until 30 minutes in, but at least the food was excellent and the chef was an awesome guy. Will want to come back to try some of their sashimi, but hopefully with speeder service.", "author": "Michael Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-28", "description": "Great find in an unusual location. Good rolls and great service. Very interesting and unusual combinations\n\nUpdate: food and service were good but they have to do something about ventilation. My clothes and hair smelled like I was working in the kitchen. The place is small there should have better ventilation for the kitchen.", "author": "Bia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Ok listen up guys this place is gr8 m8....is what I want to say, but that'd be lazy. \n\nCame in around 7PM on a Monday with a group of 5, was seated in the private room in the back. Host greeted us and seated us swiftly. Our server(s) brought drinks almost immediately and were attentive the entire night. \n\nI don't recall what some of the food items we had were, but the Stone-cooked Wagyu was amazing. Matcha salt and a couple of sauces were provided in addition to the vegetables you could heat up on the stone. We also tried the saba-- which was torched in front of us. Not too fishy and had great flavor. \n\nSushi from Chef Kiku-San is wonderful as always, presentation on point and tastes as fresh as can be. We saw this in the nigiri platter that was brought out to us. In addition to that our two rolls were equally as delicious, if I could recall the names I would-- one was stacked high with fried noodle bits. \n\nOur party got to indulge in quite a few drinks throughout our meal, an assortment of sake and cocktails caused us to enjoy our visit even more than we should have. In the beginning we tried the calpico, lychee, and mango shochu cocktails which were sweet and not overly strong. We chased those down with a few sake bombs, and a couple of bottles of sake our server recommended to us. I can honestly say that only 3/5 of our party made it through the night to eat the dessert of ice cream mochi and cheesecake bites. Good thing too, since I and another had to scrape from the bottom of the dish for more!\n\nOverall it was gr8 m8.", "author": "Jelena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Went there for the first time during lunch today, and I ordered the Toro Don, which seemed surprisingly cheap at less than $20 for the entire dish. When I received it, I noticed that there was only normal tuna instead of toro (tuna belly) along with other fish (salmon, yellow tail).\n\nI told the waitress that I had ordered the Toro Don in hopes of trying the toro. Although the waitress explained the name was a misprint (most likely supposed to say Trio rather than Toro), she communicated the mishap to the chef, who generously sent out toro sashimi to me for free anyway to apologize for the mistake! A very kind and unexpected gesture for a first-time visitor.", "author": "Kathleen Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "It's nice to see more Japanese restaurants opening up in Soma, but Zen was a bit disappointing for me. I think it's quite pricey and the food is just ok.\n\nI ordered the sex on something role (can't remember :p). For $18.50, it was actually really basic. It was a bit of salmon/asparagus on the inside and a small slice of tuna/mango on top, and topped off with garlic cream sauce and wasabi. The wasabi was too much and I had remove it.  \n\nWe also ordered the lychee soju which was only 3 shots worth of alcohol. It was tasty, but again overpriced.\n\nService was nice and the decor is intimate. I probably wouldn't come back unless for convenience.", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Ordered the duck breast with potatoes. The duck is normally not a easy dish to cook but the chef handles it well, it tastes well. What makes me less satisfied with the dish is the potato's portion is too small and only a few pieces, and the same with broccoli. for a person like me who really need carbohydrate I am little disappointed. I also ordered the tuna nigiri, it is large and fresh enough and satisfying.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "Satisfactory Japanese izakaya food in a modern setting. \n\nSaba Mackerel on Mixed greens (4/5) - they serve it sashimi style and then torch it in front of you. Cool presentation and great flavor\n\nHamachikama (4/5) - large chunk of fish collar. Was a tad too broiled but still juicy nonetheless. Good portion\n\nSea bass chazuke (3.5) - well presented but felt the broth didn't jive as well with the fish as I would have liked. \n\nSake steamed clams (3/5) - nice portion but the broth felt a little off balanced\n\nKarrage (3/5) - seemed closer to just amateur home made breaded chicken fried", "author": "Victor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Writing the review only for the lunch bento. I love bento and it brings me the memory of Japan. For $10 you get a decent size bento with grilled salmon, fried fish, a few piece of tempura, tsukemono, a tamago and other small sides. Really good deal for a quick lunch. I think the quality is better than the japacurry truck's bento. \n\nI came to the restaurant around noon and there were only 5 bento left.", "author": "Ruxin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "Just know this place isn't built for take out. They will mess up your order and delay your food. Never again. And they remade it and my other part was cold. Cmon", "author": "Ben B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Four blocks from home. Good walking exercise with a cane. Tried online reservation but not avail via OT so we arrived and waited at the bar. Long lines so we decided to just stay at the bar. I got a free beer for my friends by check-in. Wagyu beef on the hot stone over bed of salt are famous so we tried it. Poketini, fried oysters, sashimi, wasabi octopus, jelly fish, special order of mussels, several rolls, 12 piece sushi omakase(big portion), and chicken karage. Wonderful bday special include great tea ice cream, strawberry/green tea/mango mochi, frozen cheesecake ice-cream and fresh fruits. Sushi chefs and staff all sang bday song together. Very attentive. My friends all said the food are yummy. I will return again once taste buds are norm again.", "author": "Vee V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Update:\nI'm updating my review to 5 stars.  They've stepped up the service a notch and the food tastes better than I remember. Their gyoza is the best in town and the house salad with citrus dressing has a very delicious, unique taste.  Presentation of all the plates are nice too.  \n\nGyoza: 8/10\nMixed green salad with citrus dressing: 9/10\nBeef tongue: 8/10\nSpicy tail: 2/10\nSpicy tuna roll 5/10\n\nAll in all I was happy with my dinner here. Was just hoping for a better spicy yellow tail", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "Food is good, especially the tofu and whichever rolls we got, though slightly overpriced for the more casual atmosphere.", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Great food and great service. \nVery attentive staff and clearly experienced sushi chef.", "author": "Jacob F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-14", "description": "very disappointed. though with friendly staff, the food was mediocre at best but extremely overpriced. a $6 miso soup, really? all the sushi rolls we ordered tasted the same, and the heavy cream-based sauce they put on really ruins the freshness of the ingredients. it's the type of restaurants that is disguised in fancy plating and decor but lacks in quality.", "author": "Lu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "Recommended by friends , so I made a reservation for 6 people today, when get there it was not so busy on Saturday night, stone burning wagyu is highly recommended, sashimi was fresh, appetizer toro tartar is the best, service was so attentive, definitely come back.", "author": "Martin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "One of the most interesting Japanese restaurants that I have been to. My usual go to places are for good sushi and sashimi. This place serves yummy dishes that are beautiful in presentation. The dishes really are as good as they look. Parking was surprisingly easy and only a few blocks walk to Market st.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Good sushi, great garlic edamame, AMAZING service. Our server, Ricky, totally made the visit. He even went so far as to custom-make two types of sushi for me when I couldn't make up my mind. Thank you, Ricky!", "author": "Madeline P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Zen Izakaya has a large $10 bento box that I got for lunch. It changes every day, but usually has a good assortment of homestyle Japanese fare such as baked salmon, rice w/ furikake, and pickled daikon.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-27", "description": "Servers are horrible. Food is okay, but that all goes away to the service level of this place. I never understood why the server had to be so rude when I came to some of our questions about the dishes. Also, what the heck kind of Japanese restaurant doesn't serve rice COMPLIMENTARY with their katsu entrees or teriyaki chicken?! I have never ever ever experienced  place that doesn't offer rice with those two specific meals ever before in the whole entire world!\nThe reason I give a 2-star versus a 1 is the unique style of menu they have to offer. I admit that majority of their menu items are really unique and provide a nice flavor combo, but man do they have to really step it up with the quality of service that they are providing through the people that are supposed to be representing your business! \nOnce that shapes up, and they start being less stingy with their menu items and food, I can consider giving them a better review. But it all honesty, it'll stay this way for a while. Also I have to give this place s break because my first, and only visit, was definitely not one where I feel welcomed to coming back too", "author": "Nick A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "DO NOT GO HERE! Went to this place last night and had the worst sushi experience I've ever had in SF. We weren't aloud to sit at the sushi bar as we requested because the man behind the counter was cleaning and said he'd splash us with water if we sat there. \nWe proceeded to sit down as we realized the entire restaurant reeked of bleach. Our food was covered in this awful smell of soap. Then to finish off our meal we were forced to pay for our food before we were finished eating and it still wasn't even closing time. \nThis place is not an authentic Japanese restaurant and it shows in the lack of service and professionalism. I would never go back", "author": "Jeshua R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "My favorite place for poke salad. They are quick, cheap, and great service. There isn't usually a wait, but the atmosphere is really nice. They give you a generous amount of fish for the price.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "I love their bento box lunch option! It's always very tasty and filling...and only $10!! It is a little misleading from the outside because it appears that you have a bunch of options, but in fact they only make one type of bento box each day. They are definitely for the more adventurous eaters out there - I wouldn't recommend it if you are picky. \n\nI haven't tried their sit-down meals, but the prices looked a little high for a lunch time spot (for me, at least). I not usually in the area for dinner, but seems like a good place to grab a bite.", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Zen is a dependable, tasty and reasonable price-value Japanese bistro. Excellent lunch grab and go bento for $10. Wide range of dine-in sushi rolls. Surprising oysters on the half shell as well.\n\nService is consistently good. Front and back office are well run. Only feedback is that it is a bit noisy, not excessively so for an izakaya (high volume music videos), and the ventilation is always poor (smells consistently like refried oil inside). \n\nAll things considered, a great local joint. Recommend and would come back!", "author": "Gavin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Amazing Japanese fusion restaurant. Definitely an A+. Food was pretty good in terms of taste, but the real winning quality was the presentation. I felt like I was eating food at a Michelin based on the presentation. \n\nThe creativity in the menu made ordering so hard. I literally wanted to try everything!!! I'll definitely be back for the Millefeuille and the Stone Beef.\n\nAmbience: Super popping. so pretty busy and servers seemed swamped. Date night: maybe. Night out with friends: Yes!!! Big selection of drinks.\n\nPrice: Pricey, be prepared to drop a 20-30 per person without drinks...\n\nWill visit again!", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-28", "description": "Disappointed. I really wanted to check out this new place! Went there for dinner:\nThe food is good but nothing incredible (got a couple of rolls and done gyoza). However, it's unbelievably overpriced. \nThe prices clearly don't match the rest: the service is pretty slow, the restaurant is the type of casual ones you would go for lunch but too casual for dinner (nothing cozy at all, kind of messy), the menu is a piece of paper, black and white, exactly like the one you'd get to order pizza to go.\nI guess they haven't found their branding yet, but they should probably optimize their service/ interior/ ambiance or decrease their prices. Right now, something is off.", "author": "Carole P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "I stopped for lunch on a Wednesday in early June. We walked in and a waiter lead us to a table right away. We ordered chicken kara-age (appetizer) and I ordered tonkatsu pork with curry (asking to replace the white rice with a salad because at the time I was on a particular diet). The chicken kara-age was nothing out of the ordinary. It did not taste bad but it was \"stringy\" rather than lean, the latter being typical with chicken. The tonkatsu pork arrived on top of a salad with no condiment (dry - no oil or anything else) and with a small bowl of curry. The dish itself was tasty but the pork was somewhat hard and the portion was a little small (I think no more than 7 or 8 slices of meat - with the rice it would have probably been more filling). The food was good but I thought the menu was somewhat limited (you cannot order less than 5 pieces of sashimi). The waiter, a Chinese guy, had limited verbal English abilities so ordering was a little challenging. I give the place 3 3/4 stars.", "author": "X. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Great place, great food, great staff.....All I can say is, \"FANTASTIC\"!  Best Japanese restaurant in town!", "author": "Marie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-04", "description": "This review is mostly regarding the sushi and the service. Lets start with what they do well. The restaurant is clean, bright, and generally has a nice vibe to it. I came in for my lunch break to try the sushi. Had a lunch combo that came with 3x3 basic rolls, a salad, and a miso soup (California, spicy tuna, and shrimp tempura). It was some of the blandest most uninteresting sushi I've ever had, even as these most basic rolls go. Maybe their fancier rolls are better, I can't say. \n       The main reason for the 2 star is for an incredibly awkward experience where the server who spoke very poor English placed a 2 piece sashimi in front of me. I thought it was complimentary because I declined the salad that came with my combo. I figured it was a substitution or something. Maybe a minute goes by, she snatches the sashimi back without saying anything, and promptly gives it to the guy sitting two seats next to me at the bar. We just sort of awkwardly stared at each other. I'm sorry, but are you fucking kidding me? You don't put food in front of a customer, and then take it back with no explanation. You definitely don't give said food to another customer. Major health code concern there. Will never be returning.", "author": "Yanni D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "I thought this place was overpriced for what it was! I think it's more of a $$$ place than a $$ place. Here is what I ordered..\n\nTonkatsu ($20) - the tonkatsu was dry, not juicy \nBlue Fin Toro Tartare ($25) - this was good but a very small amount of tartare with avocado on the bottom, it also only came with 4 chips. I asked for more chips though\nUdon Carbonara  ($17) - this was extremely overpriced, as it was just udon with cream sauce and veggies, no meat whatsoever. This looked like it should cost $12\nAnkimo ($21.50) - this was extremely overpriced. This only came with 4 pieces of ankimo and it was dry without the ponzu sauce. I had to request it from the waiter. I think ankimo is usually $10-12 at other Japanese places\nSeared Yaki Roll ($19.50) - this roll was yummy! But once again $20 for a roll is kind of overpriced for a $$ sign place. I think $15-17 max is more expected\n\nOverall, I've had much better Japanese food for a better price elsewhere (like Zushi Puzzle, sooo good)", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-24", "description": "Nice service but totally overpriced for non quality food which is not very tasty and easy", "author": "Why-Tie Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-06", "description": "Have had more and much better sushi for half the price. The servings are incredibly small so don't come hungry, and while I understand that small portions are characteristic of fine dining, this was not fine dining. I expected traditional, simple sushi but Zen Izakaya seems to serve more Asian fusion-inspired dishes. \n\nThe plating was truthfully very picturesque but the flavors were underwhelming. The papaya-crab salad California roll was no better than a roll at a standard sushi joint. In addition, the service was slow and the waiting times long. Have had better Japanese food!", "author": "Arielle I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Came here for dinner, had a spread of different nigiri and an octopus appetizer. Sushi was really fresh. Pricey but in line with most sushi places around here.", "author": "Debra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Great ambience! Hip atmosphere! Great for weekend garthering or just simply want something light and tasty! And parking is super easy along the street there are plenty of parking!", "author": "Michelle Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "My girlfriend and I were here for dinner back yesterday. We were too busy at the time and we might have gone too far. Originally we wanted to order a sake. But we only have 2 people. My girlfriend ordered a glass of white wine. He was worried that we couldn't finish drinking. She told us there was a vial. No need to order 720ml. Very attentive waitress. Her name was season. But then we still drank 3 bottles. Although a bit expensive. I will be back because the taste of food is so delicious", "author": "Johnny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "Saw this business on the hot and new business along with the stone wagyu beef photos so I came to check it out. the check in offer (free beer) gives you options of any beer, and when they didn't have the small bottle for my roommates choice, they just gave her a 700ml bottle so we weren't complaining, but they still apologized for not having the right size!\n\nThe wagyu beef stone plate was an interesting dish I wanted to try despite the hefty price tag ($30 or something) and it was decent! Visually tasty, and actually serves a large quantity of meat. My friend got a corn cheese dish (not as good as Korean bars, but tasted very very buttery and good). I also got some nigiris, which were also decent. Salmon that day was fire. Food I would say is 3.5 stars ish, especially considering the price tag, but the service was amazing! rounding up.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "The kara-age was probably the worst, most inauthentic I've ever had. Being at an izakaya, I was expecting juicy, marinated dark meat with crisp fried breading.  What I got instead was white meat, brined at best, with some uninspiring breading (I was getting chicken tenders vibes). I was the most excited for the fried chicken so this was definitely the biggest let down for me. I'd give the kara-age alone 1.5 stars. \n\nOther than that, I ordered the beef tendon nikomi, along with some sake toro (salmon belly) and unagi (eel) sushi. The beef tendon dish was fine, and my sushi was good (though their sushi rice was also lackluster). \n\nI might come back to try the hirame (flounder) sushi, since they were out and I haven't found many other places that serve it, and potentially some entrees, but my expectations have been set for any future visits.", "author": "Billy Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-26", "description": "Super un-organized. Made a reservation for 8. Arrived at 7:30 and wait until 8:20. Until 8:30pm still no one gave us a menu. Menu was way too big and not readable. Host was totally not experienced. OMG roll was good but over-priced at 19.5. Beef tongue was dry and super over-priced at $25 with such a small portion. Duck udon was just ok, but also over-priced.", "author": "Anya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-13", "description": "The good:\nThe wagyu beef is a must.\nTempura salmon skin roll is also good!\nPlace looks clean as well, I have no complains.\n\nThe bad:\nCame there around 5:05 PM, store opened at 5.\nEntered the restaurant and I feel oil in the air.\nIt was so thick. No idea why they could have that problem.\nAfterwards, my jacket smelled like oil, including the backpack that I carried with me.\n\nI also asked for a hand roll with shrimp tempura and avocado and anything else that the chef thinks would be good. In the end, they just brought me non-tempura shrimp with some stuff. I wanted shrimp tempura inside the hand roll since I wanted it to be crunchy. Not a big deal, just unfortunate.", "author": "Ardo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Wow! Izakaya (and free beer with your yelp check in ) next to the office! This amazing place just opened 5 weeks ago. Great staff, great food. If you are in hurry yummy bento box are made daily and available starting 11.30am...", "author": "tuan t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "The food is outstanding.  There are a lot of dishes I haven't seen in other izakayas.  My favorite was the scallops with avocado.  I'm not sure if they smoked the avocado or what but it added the perfect flavor.  We also had the pork belly salad, ankimo topped with ikura, and the wagyu beef, which you cook at the table and is a customer favorite.  The cheesecake ice cream was a perfect ending to the meal.\n\nThis place gets five stars not only for the food, but for the friendly staff and owner, Benny.  They made us feel very welcome and were very kind.  There are many other things on the menu I want to try, including the sushi.  I also hear they have bento-type lunch specials for takeout.  We'll be back for sure.", "author": "Neill T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "My favorite place for my sashimi crave. I love the chef choice sashimi special, every time have different combinations from the chef's creation, always surprised and satisfied. Service excellent and friendly.", "author": "Jeffrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "I was starving and stumble into zen izakaya but the restaurant already closed between lunch and dinner. The owner was kind enough to sell me one bentobox to go. It was probably one of the best bentobox I tried in sf. Quality of its food and presentation are very close what you would experience in Tokyo.", "author": "Komendi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Amazing food and service!! All the dishes are super creative and fun. My favorites are the blue fun tuna tare tare, wagyu beef barbecued on hot stone, beef tendon and the beef tongue pop pie. The service is also on point, our waitress kept on coming back and checking on us to make sure we are having a pleasant dining experience. I was really blown away by Zen Izakaya!", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "This is a really nice, new Japanese place in soma. They have some classics by also innovative rolls and mains. All food tasted very clean and flavorful. Great addition to the neighborhood. Also, they have fresh oysters.\n\nWe added the scallops dish at the end. Amazing flavors of burnt scallops on avocado with roe. The best.", "author": "Heiko L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Soft opening! Very clean and the ankimo/uni was very fresh! I've never had curry beef made with wagyu! So delicious! Will be here again for lunch and dinner!!", "author": "Alan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "Great food and really friendly service! Definitely on the pricey side, but they had 4 really great (and interesting) veggie rolls which you don't usually see at sushi places.\n\nThe chicken wings were spicier than we expected, so be prepared for that!", "author": "Sonali D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Very unique and delicious sushi rolls and flavors. We will definitely be back. Some of their rolls include kiwi and kiwi sauce and while it sounded crazy to us, we decided to try it and are so glad we did. Tasted amazing!", "author": "Ani A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "4.5 stars! but I like to round up!\n\nI came here for lunch today with a friend. I got the nigiri roll and lunch combo which was 18 dollars. Which comes with three pieces of a salmon roll, three pieces of a California roll, it came with albacore, hamachi, salmon, and tuna I believe. I kind of would have liked there to be more items on the lunch menu, but I suppose that was reserved for dinner.\n\nThe quality of the fish was pretty good! Not the best I've had but definitely one of the better ones I've had and worth the money. I appreciated the thickness of the nigiri.\n\nThe only reason I took off half a star was that the service was just okay. I've worked in a restaurant before and I think a restaurant of this status should have better service! I liked how quick everything was. Just would have preferred friendlier service and efficient bussing of my miso soup and salad plates before they give you the main entree. I'm just probably just being picky though!", "author": "Tin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Really delicious fish! Had some sake nigiri and it was the best I've had in a year. The Zen nuevo roll was also wonderful. Would definitely recommend eating here. Service was also good.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Really nice feel when you walk in. I live a minute walk away (above the whole foods) so catching dinner here was bound to happen. Staff and chefs were extremely helpful when it came to ordering. Each plate that came out was just as good as the last. Highly recommend the kobe plate.", "author": "Tommy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Fresh food, wonderful services, great ambiances. I have really enjoyed my dinner there.(‾  ‾)", "author": "Billy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Wagyu A5, can I say more? This place defines quality food. Would definitely come back anytime I'm craving for amazing desserts and tapas. \n\nService was also 5 stars!", "author": "Xer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Great food, service nice, music slightly too loud. Will return.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "A bit pricey, but have some nice Japanese food here. Ordered stone burning wagyu beef, tasted great! Loved that eating with white rice.", "author": "Shinji K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Excellent Japanese restaurant that is less of an Izakaya and more of a generalized Japanese food menu. Very nice decor and presentation. The staff was also on point. \n\nFood was great, but pretty pricey. Would have loved to try more but it would break the bank. Probably be back every now and again when I feel like an upscale dinner and don't mind paying for it.", "author": "Logan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "This place's name is misleading, in my opinion, as it does not really remind me of an izakaya. Still, if you are looking to try a Japanese restaurant, this one could be a good try.\n\nThe table service was okay and the service upon entrance definitely needs improving. Near the entrance, there was a reception desk on which there was a sign saying 'please wait to be seated.' No one was sitting behind the reception desk and so I just followed the sign's instruction, sat on a chair near the reception desk, and waited for someone from the restaurant to take me to a table. However, for 10 minutes, no one came to me. I thought the place could be busy so I just patiently sat there. When someone finally came and realized that I was waiting for a table, he said he thought I was waiting for my take-out order. While I am sure that the mistake was unintentional, the restaurant could have been done much better. With the 'please wait to be seated' sign there, how was I supposed to know that I should immediately go into the dining area, called a staff and asked to be seated?\n\nThe food was decent. The nigiri rice was tight enough so that the rice didn't fall apart when picked up, which was a plus. However, the rice was also too tight such that the rice tasted 'lumpy'. Still, overall the sushi was okay. Additionally, for rolls, I wish the chefs didn't put avocado in every roll...\n\nI went to this place during the lunch time and thus the experience was somewhat incomplete, since the dinner menu is much larger than its lunch menu. Hopefully, next time the experience would be better from the beginning.", "author": "Sydney C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Causal dining with high quality authentic Japanese food and service. I love the gyozas I had. Reminds me of Japan.", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-20", "description": "Stopped by for lunch and had their main Ramen dish recently.  Overall, was well prepared and quite tasty but was on the smallish side.  For about $14.50 though, quite overpriced and frankly not a good value for the money.  Good atmosphere, clean place and friendly staff make it a decent lunch stop, just not the best.", "author": "Bentley L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "Pretty new restaurant - I believe they said they opened about 4 weeks ago. Came here for dinner we started to order two things for appetizers, both of which they had run out of, along with a couple other appetizers and rolls. Fine, we chose other appetizers - gyoza and chicken nuggets, which were both good. My husband and I then ordered 3 rolls and 2 orders of salmon nigiri to share. It was delicious but way too much food. We can usually have a couple rolls each at least, but these rolls are very heavy. Zen doesn't have a lot of the basic rolls that you usually see, such as salmon avocado, spicy crunchy shrimp, California roll, etc. Their rolls are very unique but each roll has a ton of ingredients, which ends up making it heavy. I would come back again, but I recommend starting with one roll at a time, especially since each roll is $17-$20.", "author": "Gauri B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "Disappointing experience. Japan is like a second home to me. I grew up eating Japanese food at home even in the states too so I was very excited when I heard an Izakaya-style restaurant was opening up close by. I was incredibly disappointed with the quality of food as well as the pricing for such low quality food. Nothing I ate was in the slightest authentic-tasting. I recommend these chefs spend a little more time visiting and learning how Izakaya style restaurants prepare food in Japan. The karage/ fried chicken was nothing like what you'd find in Japan. I think this was the most shocking of all the dishes we tried. They honestly looked like microwaveable chicken fingers. The only thing we did enjoy was the garlic edamame. Hoping things will improve~", "author": "Kylee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "My favorite Japanese place to dine at in the neighborhood. I live a block away and really started trying them at the beginning when they first opened. The food quality never disappoints. Every dish they make is perfect and delicious both in presentation and taste. My only problem is how to stop myself from going back too often", "author": "Li L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "Been here 3 times (2x dinner, 1x lunch) since the opening and I really want to love them because the food is 5-star delicious but they are experiencing pretty bad growing pains. The overall experience was underwhelming each time.\n\nMinus 1 star for service: Today we stood at the entrance for 10 minutes, ignored by all the kitchen staff, before we were finally greeted. Another 15 minutes before we were seated. And they weren't even full! The waiter forgot to bring water even after I asked, I had to flag someone down to request plates and soy sauce dishes, the waiter tried to take my soup and salad before I was done, my tea cup was empty more often than not, etc.\n\nMinus 1 star for price: Considering the mundane fare and poor service, they are overpriced. Sushi lunch combo $18, sashimi lunch combo $21, chirashi $21.\n\nWith some changes, Zen Izakaya has the potential be a 5-star spot. But right now, SF definitely has better and cheaper options.", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-21", "description": "The sushi was good (not great - I'd say 3-4 stars quality), but it was completely overpriced. $19 for one sushi roll?! I know it's San Francisco, but come on.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-16", "description": "Let's get straight to the anecdotal facts. This is a fusion Japanese restaurant. Their chicken teriyaki is a la carte, which was not specified on the menu. Extremely overpriced for an la carte without your standard miso and rice. Taste of the food was rather ordinary and does not justify its price. The portion of the cod was simply half a filet at the expense of your liver. You're welcome.", "author": "Chris O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Tired of typing paragraphs. Just giving 5 stars to express how I felt about this restaurant;) and some pics.......", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "I ate here 3 days in a row. Amazing amazing food. I'm trying not to go back to look like a stalker. But my gosh this place is great. Love the salmon sashimi", "author": "Prasad N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "I've been here so many times that the staff are beginning to remember my face. Sometimes they miss an order or drink here and there. But food is as legit as it can get. I never fail to get the wagyu on hot stone. You must order it! Sprinkle that matcha sea salt like salt bae. Dab some ponzu jelly and let the seared wagyu melt in your mouth. You're welcome.", "author": "Momo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "It's fine. The uni and unagi chirashi bowl is pretty good. Except it's kind of an expensive place for what you get", "author": "Martha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "We were driving through San Fran on our way to Oregon, and we didn't expect to find such a great restaurant through Yelp.  But, wow, were we excited.  I've worked in Japan, and this food tasted so authentically Japanese.  Thumbs up you the chef and all the staff.   When we're back in town,  for sure,  well be coming back.   We didn't put 4 stars, though, because the bathrooms weren't up to 5 star standards.", "author": "Jacqueline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "this is a really good place \nmy dad always goes here it is a fantastic place \nthe sushi are fabulous \nthe sashimi are wonderful\nthe drinks are delish \nthe food is above the top", "author": "Becca D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "Potstickers are amazing.  House salad with citrus dressing was really good and fresh. Sushi could use some work.  The beef tongue was good too but a little too sweet for my taste.", "author": "Nazanin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Everything is delicious! My husband, friend and I had such a great time and everything we tried tasted so good! I highly recommend this place to anyone. It is well worth the price. I recommend the beef tongue stichyuu and the stone burning wagyuu beef. The waiters were really nice too! You have to try the Buta Kakuni!!! So good!!!!", "author": "Natalie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Went for dinner with co-workers here and have to say this is probably some of the best quality sushi I've ever had in sf. The salmon tempura roll, the toro tuna, and the wagyu beef was amazing. The fish was so fresh. Highly recommend! Kind of a hole in the wall and on a random block in the city but totally worth it!", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-02", "description": "Food's alright. Spicy chicken wings are good. Would not recommend roast duck. Skip the corn cheese", "author": "Khin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Awesome sushi night. We booked a group of 8 and had the private back room with TV, air purifier, and more privacy. Food was solid and inexpensive, paid about 60$ per person for an assortment of rolls, appetizers, and beef cooked on hot stone. Service staff was really kind and patient. Will definitely be back.", "author": "Eddie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Great find. Off the beaten path, but that's part of the attraction. Lots of locals, so figured it would be good. And it was.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "The ambiance is nice. The waitstaff lags a bit from time to time the few times I been here. The food is great but the menu changed a couple of times so I am not sure if my opinion is valid. What I have had I can say the chefs are good at what they do. I have yet to find something I didn't enjoy. The restaurant gets hot from the lack of circulation but that is minor issue. The TV bugs out often and I am the kind of person who stares at the TV while I eat so that is also a semi issue in my opinion. One restroom for the whole restaurant there is a wait for it 60% of the time. That is pretty much it. Good food and environment is worth going back too.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-28", "description": "$75 + tip +2 hours + mediocre food + Go away hungry = Zen Izakaya!\n\nMy girlfriend and I are now home, unfulfilled in every sense of the word, after an attempt at dinner at Zen Izakaya. A waste of time and money...\n\nWe called a few times to double check they were open and no one answered. We only live a few blocks away, so figured we'd make the walk.\n\nWe walked in; no host/hostess...and stood there for several minutes (trying to be polite as the sign says please wait to be seated). Finally, after a lengthy wait, we went over to the sushi bar and asked if someone could attend to us. The chef politely said \"just a minute\"...a few minutes later, what turned out to be our waiter came over and took our name, telling us it would be ~15 minutes...\n\nWe were eventually sat (not quite 15 minutes) and waited for 10-15 minutes before the same gentlemen came and asked if we would like to order drinks and/or appetizers. We ordered 3 appetizers and he said he would put those in right away, and he'd be right back to take our order.\n\n10 minutes goes by, and he returns, with our waters...and proceeds to take our order. We ordered 2 sushi rolls and 2 items from the \"house specials\" menu.\n\nAfter 20 minutes, we got the roll and one of the house special items...strange, what happened to those appetizers?\n\nAnother 10 minutes goes by, and we get one of the appetizers\n\nAnother 10 and we get the last item we'd receive tonight, the gyoza (wow...how does gyoze take this long?!)\n\nHe did come out an apologize for the delay, explaining the chef was training someone and he'd be giving us a discount on the bill for the inconvenience...being profusely apologetic...\n\nAnother 20 minutes goes by, and still no more food...which is strange because the table next to us was just sat...hmmm, how did they already get a sushi roll when our second we put in for over an hour ago?!\n\nWe brought this to the attention of our waiter...and he again apologized, assuring us the last 2 items, the chickn kaaragge and the other roll would come out soon.\n\nanother 15 minutes goes by and we were just fed up (no pun intended, since we weren't actually fed!)...\n\nso over 1.5 hours since we got there, we got 2 appetizers and 2 of the house specialty dishes (one of which was the hamachi)...not even close enough to fill us up...\n\nWe ended up walking next door to whole foods, buying groceries, and I came home to cook something lite to finish off dinner.\n\nOh, and the discount, he waived the gyoza...really? that's it? $75 + tip to wait nearly 2 hours and go have to go grocery shopping next door because you were not satisfied...What a crock! The last time I had not nearly as bad of experience they comped the entire bill for wasting my time!\n\nOh, and the 4 dishes we did have...3 of the 4, mediocre would be a compliment. The 4th, mediocre is just the right adjective.", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "If you go in at lunch or right at 5, the cuts of fish they give you are huuuuge! I've been here 6 times in the month and a half I've been in San Francisco and haven't been disappointed once. Only downside is the entire place smells like oil so you will leave with your clothes and hair smelling like a restaurant. But in my opinion that's a small price to pay for some delicious sushi.", "author": "Lucy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "Over priced, low quality sushi. Even though I live a block away, I'll probably never go back. Service was meh. Ambience and decor did not match the pricing.\n\n$18 on average for their special rolls. None of them were particularly good. They tried to make them a little unconventional, but unfortunately, their attempted creativity didn't land with me. One roll that stood out had a \"red wine\" sauce, and in reality, it tasted more like cranberry jam on a sushi roll, and it just tasted odd. Another roll was loaded with basil inside, and it's flavour overpowerwe that of the fish and other contents. Again, the risk didn't pay off.\n\nWe also ordered a seaweed salad, which was a tiny portion. Again, I think they tried to make the presentation look special and served the appetizer in what looked like a small cocktail glass. As a result, the portion was a miss, and the two of us barely had a mouthful each.\n\nAs for their regular nigiri, nothing special here. The fish wasn't great. Had a saba, which they they torched and ruin the flavour of the fish. The salmon sushi was the only decent thing. Portion was average, but way too much rice, and each order was about $7-8.", "author": "Raph T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "They told us 30 minutes wait for a table of 6. We waited an hour as 3 other parties got seated. There was an un-bused table open in front of our eyes. If you come here with a group, basically expect double the wait time they tell you.", "author": "Steven Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Wonderful service and amazing food.  Try the funky dragon and pepper tail.  The buta kakuni was very tasty.  They service some of the best sushi I've tasted.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "I love that they serve gourmet food in a casual environment.   Everything was delicious and unique!  The pork belly salad came with a generous serving of meat which was not oily at all.  The scallops served over seared avocado and topped with caviar were amazing-probably my favorite of all the dishes.  I loved cooking the Wagyu at the table over a hot stone.  Lastly, the cheesecake ice cream was yummy too.  Cannot find these dishes at another restaurant and they were ALL delicious.  Will definitely return soon!", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-16", "description": "I feel conflicted. The food here was actually decent, but way over priced. The restaurant seemed like it wanted to be upscale, with smaller portions sizes and higher prices, but the environment was severely lacking, with its paper menus and sticky tables.\n\nThe wagyu sizzling stone cooked beef dish was tasty, but the sizzling stone gimmick was rather annoying, as the stone would cool down very quickly and we would have to wait for the waiter to come bring us a new one. \n\nWe saw advertisement for $10 lunch bento boxes, which sound like they might fit the restaurant style better. The dinner however, cost us about $40 per person, and we left unsatisfied.", "author": "Hope Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Very cool place with amazing and unique sushi along with the traditional. If you're looking for something that can be both traditional and adventurous this is the place!", "author": "Sean N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "All about the food: the sushi is really fresh. The miso soup is really tasty and fresh. I would have hoped for more seaweed. The deep fry chicken was too peppery, would have prefer it less peppery. Would definitely try the rolls and the house creation next time!", "author": "Lena W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Works of art that are unbelievably fresh and delicious! Some of the best nigiri and sushi I have ever eaten. I was also quite stunned at the amazing presentation and care given to each of the dishes. Highly recommended.", "author": "Steven K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Perfection. From the sashimi to the waghu beef. Everything was perfection. The sashimi I with a plum sauce was sour and sweet, while the beef steak with a teriyaki fried Claris sauce was sweet and oh so yummy. Definitely coming back here again.", "author": "Knastayyy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Fresh food, wonderful services, great ambiances. I have really enjoyed my lunch there.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "I suppose if you are in a bind, (no access to Uber/Lyft, you just torn a hamstring or broke a leg, or something else limiting your mobility, but you still have your credit card), this is an okay place to eat since there isn't much in that area of SOMA. If you have options though, go somewhere else.  \n\nThe service is okay.  There was someone there to take our order, get us the check, but no check in's. I am not high maintenance, so that's enough services for me.  \nThe menu is huge and confusing. They cover rolls, sashimi, entrees, a bunch of random apps.  Nothing about this place is what you'd exactly think of as Izakaya.  I am skeptical of places with huge menus. It's a small kitchen and you can't do everything well. The menu screams of a restaurant that's trying too hard.\n\nThe food was average at best.  We got the Wasabi Salmon, fried crawfish, age dashi tofu, beef tendon (just to be a little adventurous) and some sake. Salmon and sake were good, the rest were in the C+ range.  \n \nThis place is also surprisingly expensive. It really is on the low end of the $$$ range. This was not a lot of food and cost a bit over $80.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "I've been here twice with very big groups. We requested the private room in the back, which is SO much fun. The waiters are amazing - they are extremely attentive, patient, and fun despite having to deal with very large, very loud, and very needy groups. I would absolutely come again for the back room. The wagyu beef is melt-in-your-mouth amazing and they have a great sake selection!", "author": "Tandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "This place was great. The hosts were kind and the food was top notch in both taste and presentation. You can't leave the place without trying out the wagyu beef. I've tried a lot of places that claim to serve wagyu, but nothing came close to this. Highly recommend. \n\nIt's a nice and cozy place, but a bit small so you might have to wait on busier nights. I believe you can make reservations for the rooms in the back so if you have a large party I'd go with that.", "author": "Phillip G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "There was a bit of waiting time but the food was def worth the wait.  Pork Belly was juicy and tender.  Spicy Chicken Wings were finger licking good.  Their Spicy Yu-ke Tuna was surprisingly tasty and flavorful.  The stand out dish had to be the Stone Burning Wagyu Beef.  We will definitely be back for more!\n\nOur waitress Zoe was amazing.  She really made our dining experience delightful!", "author": "Ray C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Our new favorite sushi in soma! Very unique and tasty rolls. We tried dancing all night roll which was AMAZING! Definitely will go back!", "author": "Nahal S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "This is a $ ambiance restaurant with $$ quality food with $$$$ prices. Entree for $21.50 came with 4 pieces that was mostly badly cut cucumber and no memorable taste. After spending $60 I had to go to another place for dinner. They're trying to bank on downtown location assuming all techies are fools when it comes to food", "author": "Deepa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Zen Izakaya is an awesome Japanese restaurant in San Francisco in a good SoMa location. Their rolls depart slightly from the sushi house standard in a refreshing manner. Waitstaff did a nice job attending to our table. We also enjoyed a large amount of complementary beer, which I suspect will not be the case in the future but was welcome nonetheless. We will likely return in the future at perhaps a once per year frequency.", "author": "Geoffrey Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "We came here before 6pm on a weekend as we were in the area. Just had a 5 minute wait for table for 2 though the place was smallish and crowded. Food was great but very pricey. Couldn't help but re-order the beef tendons which were very more-ish. Tako wasabi's my other love and it was on point here.", "author": "Lindt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Came here last minute with some friends visiting and got the private room with Ricky serving, had the best time food was amazing and Ricky was helpful af. Came here a second time with coworkers and booked the private room again ...omg food is amazing (A5 wagyu and more) and Felix kept us hecka drunk.... I'm lit as we speak omw home and love this place!", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Great sushi.  Service is a bit rough.  Front of the house needs more training, but I still recommend it.  Maguro and Salmon were both some of the best I've had, and \"The Scallops\" were fantastic.", "author": "Kitty W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "All in all a great Japanese restaurant in SOMA. Especially love the lunch bento boxes, but there are a limited number so it pays to go early for these.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Fantastic dinner at Zen! All the food was wonderful, Asparagas, Edamome, super rolls. Many sake choices and great service. Can't wait to go again!", "author": "Liz W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-01", "description": "I came in for their grab-and-go bento advertised on their website, they also had a sign showing the same items . Not a SINGLE one listed was offered today, instead they had a spam masibi (spelling ?) and vegitable fry (whatever that is). Their regular menu items were super pricey... feels like the classic bait and switch to me. I will not be coming back.", "author": "Mair S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Great new neighborhood place where you can always get a table. Not sure why it doesn't get more traffic because it has better food than other Japanese restaurants in the area.  Good happy hour specials and nice presentation.", "author": "C T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "I'm always excited when a new neighborhood Japanese restaurant opens up! The rolls were a bit overpriced for what they were, but still delicious. The real gem is their spicy fried chicken wings. They were so damn good that we ordered a second plate. $10 for a good size portion. I don't think this sport will be my go to for a quick and simple sushi meal, as their menu is geared towards fusion style plates. Still highly recommend you try it!", "author": "Mileen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Came here with my mom and sister for dinner. It was super yummy. Portions are bigger than normal and happy hour from 5-6:30pm is sooo good! Our server was so sweet too! My mom knocked over her water glass and they were so nice when cleaning it up. Food is delicious!! Tried Shochu for the first time and it was really good! Highly recommend the Mango!", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "I just ate there for the first time, and had a fantastic lunch. The service was wonderful and the food was so fresh and delicious. I've worked at 3rd & Townsend for a long time now, there are not too many sushi places around this neighborhood ( I am over the over-priced awful Nama Sushi on King Street!) so I was very happy to find this place. Prices are ok, but if you want to spend a little more, and have a fantastic, healthy meal with great service then save your pennies, this place is worth it!", "author": "Coco F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "We recently moved to SF and live in the neighborhood and stopped in to check it out. Prices were kind of high but food was excellent. The Wagyu beef was delicious. Decor is kind of plain but I guess nice for an Izakaya style restaurant and seating is comfortable. It was nice to have a Japanese server which made the experience more authentic. We didn't get the rolls but will get that next time because they did look pretty good.", "author": "Liz W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "The food is tasty and the quality is great but I wouldn't go back for the steep prices. I think it should be $$$ rather than $$. We had the ankimo, the beef tongue pot pie, burdock root salad and pepper tail. Bill comes to around $90. Also it's not what I'd expect for an izakaya. Guess it's more tailored to an American style Japanese restaurant with sushi rolls, udon, and nigiri offered as well as some izakaya style elements with small appetizers.", "author": "Godzilla C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-30", "description": "The food is just weird. I've been here twice. Disappointed both times. Random flavors that just don't go together well.", "author": "Nors P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "Service is great, staff is very professional, and the food is to die for. I'm gonna be a regular here. Try the steak!", "author": "Albert R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Great sushi place. Has fresh oysters, a great sake/wine/beer menu, and great service. Miso soup and uni were excellent.", "author": "Mardo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "Great food and great drinks. Our service was prompt and the prices seemed reasonable for the quality of the food. I'll definitely be going here again.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "This restaurant's boss has creative mind on cooking Japanese food. He adds a little bit of local style on  traditional Japanese which attract more and more local people come in. Good taste! !", "author": "Monica Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "It's awesome to have a solid local sushi place in the neighborhood. Something mid SOMA was really lacking.", "author": "Yahoo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-06", "description": "The food is okay - a bit overpriced. We saw a hair in garlic edamame and the waiter took it back to the kitchen to replace with a new dish and took it off the bill. In addition, the place has poor vent and I kept coughing when I first sat down. The neighborhood really needs a good Japanese restaurant and too bad this one isn't quite the one...", "author": "Ruth W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-02", "description": "Def not a 4.5 star place. Very limited and not very exciting lunch menu. Got the spicy sashimi salad don. They don't tell you what fish is in it, depends on whatever is fresh they said. More like whatever is left over :( most of the fish were not good... Mushy fish, kind of gross.", "author": "Angela Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-07", "description": "The server was new and did not give us the full menu, so we had to order from a very limited menu. The food was overpriced given its poor quality. Would not recommend.", "author": "J T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "Delicious food with lots of interesting flavours. The service was great. A bit pricey in my opinion for the amount of food. The restaurant desperately needs better ventilation, though. We left with our clothes stinking of fish and grilled wagyu meat from the neighbouring tables. I had to wash all my clothes as soon as I got home.", "author": "John M."}
