{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "I'm regular customer here. They always did a good service but today there is a server who unfriendliness. In normally server wore the black shirt but today the server didn't ware there uniform. \nI came with my friend 5 people I have a server who I never see him before.\nHe start with throw menu on the table. \nHe didn't check any food we order.\nHe have very bad service mind.\nHe serve food likely serve for his dog.\nFinally he keep the food that unfinished and give me a check that include 18% tips.\n\nThey improved their service and the test of food is really good.", "author": "Chinnakrit W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-26", "description": "Was a frequent customer but will no longer order from here. Not only did they deliver my food 15 minutes late, but they forgot the beef that I had ordered. Then they refused to redeliver the correct order. Thanks for nothing. They must HATE repeat customers. Will be ordering from nearby Cocobang or another competent Korean spot. \n\nAnd avoid the corn cheese!!!", "author": "Ai N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Bad service, bad price\n  Price did not reflect the menu and they came up with a lame excuse to fit the overpriced amount.\n Basically the waiter made up a rule to fit the price.  Meal was $11.99.  $1 for adding the noodles and $1 more for the meat.  So total should be $13.99.  waiter said the price was $14.99 since it's $1 for adding the first item and $2 more for adding a second item. Therefore, the waiter said the total should be $14.99. WTF.  This was clearly not mentioned in the menu.\n\nAlso, the waiter walked by our table many times without asking to take our order.  The waiters always kept their heads down so they would not have to look up and see customers waving to them to to help or take the order.  When wanted extra rice, I had to. Go to cashier to ask for that and the bill.  I practically served myself so I should just tip myself.", "author": "Sidney C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "Best spot for Korean in the downtown area, hands down!\n\nVibes of this spot reminds me of Tonight soju bar (in Sunset Area) Super dark atmosphere, lots of people talking, chillin' & feaaaasting!\n\nThe food is pretty dang good here, galbi tang was REALLY memorable & huge. Hands down my favorite dish here! The cheese corn is suuuper bomb here as well - its huge, sweet & seems to be the closest taste of my time in Korea.\n\nNot sure why this place isn't as popular, but I love the food here!", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-08", "description": "Zzan was the second Korean restaurant that was thrown up by Yelp, when searching for Korean food in Nob Hill, that I tried for lunch a couple of days ago. It seems to be a new restaurant that has a more clean, open and modern look. It's not too big and at the peak lunch hour seemed to be pretty full. I think you can walk in and take any open seat after which the server will come with water and the menu. The menu is typical of Korean restaurants and includes Kalbi, Galbi, Bulgogi, bibimbap, japchae, sundubu along with a bunch of snack type items to be had with drinks like Korean Fried Chicken, Cream Corn, kimchee pancake, steamed egg etc.\n\nI decided to get the subdubu or the soft tofu soup with beef ($11.95). Five minutes after ordering I got the banchan and then the waiting started and continued for almost 20 minutes till I got my piping hot sundubu.\n\nI got five different types of banchan each of which had a decent serving size. I didn't like the kimchi that much as I would have preferred it to be a little more fermented. The sundubu also lacked intense flavors and tasted flat. It was definitely not bad just that it lacked the zing associated with good sundubu.\n\nPrice wise it was about 20% more than 707 Sutter and 10% more than Cocobang, it's two nearest competitors. Service was slow. Getting the banchan took time, getting the sundubu took ages and finally even clearing the check seemed to happen in slow motion. I was almost relieved to be finally out when everything was done with. Taste wise also I liked the subdubu at 707 Sutter a lot better than what I got here. Zzan is another place that is A-Ok at best.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "i've been here a few times and i always forget to check in because im drunk xD i always crave korean food when im drunk.\n\nI didnt really have a good experience this last time i went because of one of the workers was being very rude to us. she didn't acknowledge us even though she very obviously heard us... just kept walking away... and even when we got her attention, she just said \"hold on\" and kept walking lol we had to wait until the other server there walked by so he could help us out. i dont understand why she was being that way.\n\nbut anyways this place has some really good korean food and cheap beer! $15 for a pitcher of sapporo. I've tried their ddukboki, karaage (i always get this! very crispy and yummy), sea snail, boodae jjigae. All are very good! Not like Korea good though... but im really glad more places like this are opening up in norcal! woot!", "author": "Yeonhwa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "We went to San Francisco on Christmas, so there were not a lot of places open. Luckily this place was open and right by the hostel we were staying at.\nWe got the seasoned fried chicken and soft tofu stew. I felt like the food was decent, but the prices for what we got was too expensive. \nThe chicken was delicious and the sauce was sweet and flavorful. The soft tofu stew came in four options. They had kimchi, vegetables, beef, and pork. We got the kimchi. It was good. They gave us a raw egg to put into the stew. Also, the side dishes were pretty good. \nI would say the service was slow and the place was a tad too loud with all the Korean music. However, if I was in the mood to drink and hang out, I think it would be a fun place to stop by for drinks.", "author": "Jane P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "There were six banchan presented when I sat at the table.  Colorful and tasty, I gobbled them up!\n\nI love spicy kimchi pancake, and I ordered the one with with seafood.\n\nIt looked delicious!  Unfortunately there wasn't much variety of seafood.  It was filled primarily with squid (I spied one shrimp in the half I ate) and was so greasy, it came out painfully the next morning.\n\nKinda makes me want to not try anything else. I prefer 707 Sutter.", "author": "Sondra H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "The smallest portion of food is here. Everything looks like snacks. I dont know what for they keep this price. It takes too long to get served. Not comfortable seats. Small tables.", "author": "Timurlan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Zzan is my favorite Korean restaurant in SF! I come here at least 5-6x a month. Aside from the food, I love their ambiance as it's good for drinking soju and I enjoy the friendly staff. There is usually a line on Friday and Saturday nights but it's worth the wait!!", "author": "Heera L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Stir Fried Creamy Rice Cake\nStir Fried Creamy Rice Cake\nStir Fried Creamy Rice Cake\n\nis the best and only forever", "author": "Yoli X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Ok, let's be honest -- Kfood scene in SF is so lacking. What a sad reality. With that said, Zzan is my go-to place for takeout dinners, especially when I feel under the weather and need a hearty dose of hot, spicy soup to comfort my body. I get their kimchi stew as I very much prefer their version of this stew among other places in SF. As for the other dishes, they are quite average (but not horrible) -- which is saying a lot since some the SF Kfood places are simply unspeakable...!", "author": "Lindsey O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "We had kimchi fried rice, yuk-ge-jang, fried chicken, etc.\n All foods were awesome! My son who doesn't like kimchi said it's delicious. Dduk-bok-ki was the best among our orders. It's spicy but you can taste real Korean spicy food!", "author": "Jieun C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-09", "description": "Came here for last minute lunch with some friends on a Friday. I actually had Korean dinner the night before at Foxsister so it was nice to have a comparison and price wise, this place was much better. The lunch for three people here was half the price as dinner for two at Foxsister.\n\nThe food here is actually very good but the waitress was not that friendly which would bring my four stars to a three. I was craving japchae and couldn't find it anywhere on the menu so I asked the waitress and she looked at me like I was an idiot when I asked her and looked angry when I asked if I could order it. Good lord. So unnecessary. \n\nI got the veggie bimbimbap for lunch and then the japchae which was HUGE. Good thing my cousin ended up joining and we split both dishes and we were crazy stuffed by the end of it and couldn't even finish it. The banchan was aplenty but was too scared to ask the waitress for more after she kept giving me dirty looks god knows why. \n\nNo issues otherwise, would def come back again. I love cheap korean food and it was very tasty here.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "It's cool to have a place open so late at night. I always prefer this kind of bar slash restaurant comparing to traditional bar. It's good for two person and it's also great for a group of people hang out, drinking, having conversations. One star down is for their food being over-flavored (too salty). Another star down is for shortage of waiters. Only two to three waiters are handling all tables. I still like this places because they offer a variety of choices and they are very authentic. Open late is a big plus, since this should those kind of place you go after late night concert.", "author": "Yanzhong L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "I visited Zzan with with my girlfriend and close friend from high school, and we had a terrific experience. Prior to our visit, my friend informed me that Zzan stayed true to authentic Korean food, which would be unlike other Korean places I'd visited in the past. In hindsight, I completely agree! For context, Zzan is tucked away on a side street with minimal street parking, so it can be a little tough to get there. That being said, the interior is dimly lit with LEDs and has tables scattered on both sides. We were seated after roughly 30 minutes, which appears to be the norm considering the ample customer demand. Our waitress was considerate, through a little hard to hear in the hustle-and-bustle of the restaurant. We started off by ordering vegetable tempura and fried calamari, which were quickly brought out. The tempura was light and flaky, while the calamari was large and tender. We followed-up with an order of spicy fried chicken that was both crisp and flavorful. The bill was a little higher than other places I'd been to in the past, but the food quality more than made up for it. Overall, I highly recommend visiting Zzan if you're in the area and craving authentic Korean food.", "author": "Murali V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "I dunno who the low star haters are. I lived in or within delivery distance of Los Angeles Koreatown for years and I am willing to testify on behalf of Zzan - for bone broth style soups, this place meets the absolute gold standard - perfectly spicy and not too oily, nourishing AF. Also, their delivery packaging is top notch, and they deliver on time.", "author": "Aditya A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-21", "description": "First time here with my hubby on a Sunday .\nWasn't busy , so was lucky to get a good \nspot . Food was great . Ordered a bibimbap\nw/ c was a lot & my hubby got a beef stew \nnoodle soup ! We enjoyed it a lot . Made us \nboth so full . We had to walk around to lighten\nour stomachs.", "author": "Gloria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "The following review is based on my last visit to San Fran in April of this year:  \n\nIt was a tiny little place, mostly younger patrons with younger \"vibe\" BUT food was amazing. My older parents, in their mid 70s, loved everything on their menu. The best part was friendly staffs -- they were very attentive to my parents. The worst part was my parents didn't want to go any other restaurant.", "author": "Jandi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "The kimchi fried rice (w/ spam), creamy teokbokki(10/10), boneless chicken, and cheese corn were soooooo good! It was our first time coming here and there weren't many people at that time. The atmosphere was really nice, darker lighting with light korean music at the background. The banchan portion was really small but we don't really finish it so that's alright lol. Customer service was pretty good. It was really hot that day so I just wish that they'd give out (cold) water. Overall experience was great and I want to come back next time and order the really yummy foods!", "author": "Sofia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "There's an unspoken triangle in Lower Nob Hill where the hipster Asians traverse usually in packs. It's not quite the Bermuda Triangle because these youngsters don't unfortunately disappear into the abyss but rather multiple exponentially usually by text until you find yourself waiting endlessly out on the street for your number at Cocobang. You pick up '58' and the young Asian host just said '7'. Let's just call it the Korean Triangle - the popular Cocobang on the right, 707 Sutter on the top, and to the left, the newest and youngest of the bunch, Zzan. You can tell this is where all the hyperactive whippersnappers go because all three are open until 2AM, Cocobang until 4AM.\n\nI was intending to go to Cocobang but saw the crowd outside on their smartphones and scurried away. This is actually a more spacious spot than Cocobang and also a lot darker. It was easy to get a table right away here, too easy as a matter of fact, which initially concerned me. I was seated at a large, conspicuous table next to two post-adolescent Asian girls spewing profanity to each other. They were clearly the best of friends. I was perusing the multi-page menu, and as is the usual protocol, I was handed the Banchan plates moments after I told them what I wanted. Just five of them, the usual suspects including kimchi and bean sprouts and all good munchies, along with the dipping sauces for what I ordered (photo: http://bit.ly/2mddh8o).\n\nMy first dish was the $5.95 Potato Croquettes which looked perfectly round and content sitting on a sparse gathering of shredded cabbage (photo: http://bit.ly/2mwZIDs). It came with some kind of chili sauce with a mayo-like center. It was decently crispy, nothing extraordinary when it came to flavor. My main dish was the $15.95 Jok Bal, always an ambitious undertaking since it's a dish meant for a small Korean village. It's pig trotters braised in soy sauce and garlic and sliced up on a big platter (photo: http://bit.ly/2lNK082). This one was again decent, a bit dry, and surprisingly without lettuce wraps since I assume they were not saucy enough to warrant them. Oh my, here comes an army of skinny Asian youth. Perhaps they can take photos and graze on the leftovers.\n\nFOOD - 3 stars...moderately moderate Korean food for young Asians, old ones like me need not apply\nAMBIANCE - 2.5 stars...dark, clubby with tables too close together\nSERVICE - 2.5 stars...intermittent\nTOTAL - 3 stars...they give you a lot of piggy and taters for sure", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "Best Korean BBQ in the area, my favorite comfort food after a long day of work or perhaps having had too much to drink! Rice cake skewers, corn cheese and anything pork:) you can't go wrong no matter what you get though.", "author": "Morgan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-02", "description": "Great that it's open for late night delivery, perhaps not the best Korean delivery food I've ever had.  Ordered via UberEats, so this review is solely based on food.\n\n- Fried Chicken with Soy Garlic Sauce ($14.95 + $1 for sauce) - a pretty decent serving of 8 pieces, so good for sharing between two people plus one more dish or so.  Slightly on the expensive side vs. other Korean fried chicken (KFC) places I know.  While the sauce was thick and delicious, and the chicken meat delicious, the skin was a disappointment.  I've done take-outs with KFC before and was satisfied, but this time the skin was not crispy at all, almost on the verge of being flabby.  A shame, considering how much we liked the sauce and such.  \n\n- Japchae / pan fried clear noodle ($10.95) - good soy flavor, though a bit on the oily side for my taste.  Also would have preferred if there were more veggies and meat in it; seemed like they were being stingy on those.  \n\nAll in all, while I appreciate them being open late in case I get late-night Korean food cravings, didn't quite satisfy my cravings.  Think I would prefer to order / go elsewhere for my KFC or japchae, but would consider this spot if I need a quick fix late at night and I'm lazy in my apartment.", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Came on Sunday night at 7pm. Only two tables were taken. We three got seated quickly and ordered cheese corn, bibibam, tofu soup and seafood ramen. The side dishes were just okay compared to other korean restaurant, but the food we ordered was super tasty. I especially liked the cheese corn and bibibam. To be honest, I really want to give 5 stars, but the service was just mediocre. Please note that the tip was already added to the check, and it was 18% of the whole bill. The server who gave us the check didn't even remind us. And we have to ask for sure. Down for this. As the food indeed stood out, we were fine with the bill.", "author": "Shiyun L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "This hit the spot after drinking. Had the cheesy corn, bulgogi, and dubboki (spicy rice cakes).\n\nI'd rec getting cheesy corn and spicy rice cakes but was not a fan of the bulgogi. The meat tasted right but it was chopped up which I didn't like.\n\nPrice wise it's about right. Service was pretty slow (too many tables, not enough servers).", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Pretty good/decent. Nothing serious to complain about. Staff if cool, chill vibe. Food could be a bit more flavorful though.", "author": "Cecile .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Skip: the chicken karraage. More batter than meat.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "I LOVE coming here, they're open later than normal San Francisco restaurants, and also open on most holidays like Christmas, NYE, etc. Their selection is great, and everything is tasty. Definitely a shorter line than Cocobang, and I think the food is on par. \n\nOur go to order is beef short rib soup and an order of their fried chicken with soy garlic sauce on the side. The beef short rib soup is clear, but the broth so rich and flavorful. The beef is soft and tender, with some tasty bits of daikon radish and egg, and clear noodle. It offsets the crunchy, tasty fried chicken, too. The portion is quite large, perfect for two people. \n\nI'm a huge fan of their kimchi pancake and combination pancake, although the seafood pancake doesn't have alot of seafood at all (a few pieces of octopus legs and 2 shrimp). Their bibimbap is quite good, not the best.", "author": "Ke C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "the kinda korean late night spot where you'll actually find Koreans eating and drinking. The anju (Korean cuisine to accompany alcohol) options are delicious. Prices are a tad high but not unreasonably so, and the good food and fun ambiance makes it worth it. My friends and I shared the honghap tang (mussel soup) and nakji bokkeum (stir-fried octopus w noodles--as much as I feel guilty for eating such an intelligent creature, it's so delicious and worth it) to accompany our many bottles of Chamisul Fresh soju and Hite beers. If you don't like soju shots, try Chamisul Fresh mixed with Korean beer (so-maek, short for soju-maekju, or soju-beer). Or try a flavored soju--they're all deliciously light and not sugary.  \n\nPS. Cocobang is overrated and more and more inauthentic these days. Try Zzan instead.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "there are many korean restaurants which close late night in downtown. this one is one of my favorite. selections are good, and taste of foods are also above average. if you want some korean food or any food for late night in down town, you should try this place. they also have beers on tap and korean soju. love to drink at late night here. so  here are my rates.\nfood 4/5\nservice 5/5\ninterior 2/5\nlocation 5/5\nhour 5/5\nprice 5/5\n\nit is 4.5/5", "author": "Chris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-06", "description": "Ok so this is probably some of the worst Korean food I've had. The clear noodle (japchae) isn't quite flavorless, but it is not good...the kimchi fried rice is also not good...\nI feel like they're both missing key ingredients....\nI'm honestly sad that I spent the money on this... and I was super excited for Korean food today...", "author": "Alexandra R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Great service and food! Would definitely recommend to others. Prices are reasonable and atmosphere is welcoming.", "author": "Yani D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-03", "description": "Incredibly lackluster. Ordered from eat24 and will never order from again. While the delivery was fast and seamless, the food was terrible. I ordered the galbi, the jjampong, and fried chicken in soy garlic sauce. The galbi was the only thing that was semi-good. Not terrible, not the best I've had. I felt this tasted like the frozen ones you can buy and make yourself from Trader Joe's. The fried chicken was not anything close to Korean Fried Chicken. I get it, I ordered it for delivery, but I've ordered fried chicken before that took a longer time to be delivered and was still crispy. This wasn't crispy at all. It was more like roasted chicken wings tossed in a sweet/salty sauce. The jjampong was terrible; the broth had no absolutely no flavor. All in all, I spent about $50+. Terrible waste of money.", "author": "Kelsey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Discovered this place on Yelp when I was looking for food with high protein after my workout at 24 hour fitness down the block. Zzan was pretty new back then and looking at those tofu and egg pictures, decided to give this place a try!\n\n* * * EXPERIENCE * * *\nPros:\n- Friendly and very attentive staff\n- Varieties on menu\n- Good atmosphere for hipsters gathering\n\nCons: Can't think of any!\n\n* * * FOOD * * *\nSeafood Tofu Soup: A-.\nTofu was very soft. Lots of seafood inside, the shrimps used were pretty fresh. Tasty soup!\n\nSteamed Egg: A-.\nLove their steamed egg! The bowl was pretty big, and saltiness was just about right. The puffiness of egg was to the point.\n\nOne of my favorite Korean food places in SF!", "author": "Simon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Love their ...\n* Beef Soft Tofu Soup with Kimchi\n* Corn with Cheese", "author": "Mindy - Oishii Moments S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "I throw my bd party here. Everything was so lovely\nTheir food r fantastic and waitress always tried to help us\nI made the right decision to choose this place\nEven it was too small but waitress, she tried to help us all the time\nThank u guys u made my day", "author": "Yokyok N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Thx yelp.. K-pop meets korean food.\n\nCool korean pop, hip hop videos playing on the wall...\n\nFun place, very reasonable prices. Mix of korean and non korean 20/30 yr olds...sort of trendy crowd.\n\nFriendly service,  nice cold beer/shoju. Plenty of food.\n\nRepresenting Hawaii we had the \"army\" soup..\nMix of all that is found in a mamasans kitchen sink..\n-veggies (nicely cut and arranged and a great assortment enoki, won bok, carrots, green onion etc)\n-hot dog\n-spam\n-ramen\n-beef\nAnd the list goes on and on.  Lovely broth with a\nSlight kick of heat...Great korean sides. Also had the rice cake yakitori app.. (Like fried mochi with sweet/hot sauce) yum.\n\nId come back.. Great job guys!  Venture beyond \"trendy\" new american gastro pub stuff and give this place a shot..", "author": "Jodi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "Came here with my sister's and it was packed! The wait for our tables came by quite fast. Food was good and it's a good environment to come w/ friends or family for a drink or more! I'd suggest if you have a big crowd come early or see if they are willing to reserve.", "author": "Kristina X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-03", "description": "The No1DP and I only had a couple of hours left in SF and given SFO's limited lunch options in the international terminal I wanted to have my last meal within the confines of the city. A quick Yelp search revealed this spot within a 5 minute walk of the hotel.\n\nThough the full menu was available we opted for the lunch menu. We got the same item - beef spicy soft tofu soup ($10.95). Side soup was an egg miso, which was a bit watery with bits of egg white. They gave us four small banchans to munch on in addition to the soup and egg. The No1DP didn't crack an egg onto his soup.\n\nSoup was okay. For a soft tofu soup there was LOTS of tofu. I actually could eat the soup without rice as there was already lots of carb. Very underwhelmed by the amount of beef. Spice level was decent though the No1DP was surprised on how spicy it was. \n\nThis serving, though average by my regular lunch standards certainly beats any lunch option I can find at SFO and certainly cheaper. For a quick lunch it certainly did its job of satisfying my appetite.", "author": "Isabella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "Probably my favorite Korean joint now.  Food was sooo fresh  and fairly priced considering it's downtown.", "author": "Mg M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "Zzan is a solid option when its one of those \"Oh crap it's Wednesday, there is no way I am cooking and I want something tasty but am not getting in an Uber\" moments. \n\nNOTE: This review is for take-out, not dine in. \n\nWe got the bibimbap and they were generous with the portion size and great with the veggies but the beef was a bit sauce-heavy/ had some binder and over-sweetness going on. Full disclosure, \"overly sweet\" is one of my most common issues with food, so this may be my personal taste. The presentation was impressive for to-go (although it was not ready at pickup time, they finalized the last components real quick-like!) \n\nThe yam noodles were delicious as usual, albeit with a heavy slick of oil, but let's be honest- nobody orders them as health food!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Food is really good here and the service is great. It's a loud and lively atmosphere with good Korean dishes. I only go here for this one waitress though. She already rejected me like twice, but Idc.", "author": "TJ P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "Zzan is one of my boyfriend's favorite location and he absolutely loves this place. We come here pretty often, and there is usually no wait. They have flavored but not yogurt based soju. So you can get bottles of soju with flavor like peach, pineapple etc, but it's clear. I've brought my co workers and friends to this location and they've all loved it. When I come here, I usually get the chicken wings, theyre amazing! It's a must try. We end up getting at least one bottle of clear flavored soju, along with dubboki, with ramen added. It's amazing!! They have pretty quick service, the staff is friendly, and I definitely am a repeat customer to this location. I really recommend this location to anyone that has not tried it. Cocobang is nearby and that is a primary choice for most, but if Cocobang is busy, which it is usually, then come here, and try this!!\n\nPrice and value 5/5\nTaste 4/5\nService 4/5", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "With a futuristic \"Blade Runner\"-esque atmosphere, Zzan is an interesting restaurant that probably resembles a Korean pub with its constant stream of largely-projected K-pop MVs on the wall. Perhaps that was why my parent were taken aback initially at this decor that was clearly targeted to youngsters - blame me for not researching too thoroughly. Thankfully, because of my ignorance and stubbornness to stay, I discovered this delicious Korean restaurant in the Union Square area!\n\nThe menu is brief but straightforward: you want bibimap, KFC, or stir-fry? Then you'll easily find it on here! Despite its futuristic decor, you can find your favorite classic Korean dishes. \n\nAlthough the price was a bit higher than I would like - about $12 per entree on average, I was surprised by the portions: the bibimap was generously sized and the KFC order came with so many large pieces! The tofu soup was disappointingly small but I was too happy with the rest of the meal to care. As impressive as the portions, the bibimap was particularly delicious and the taste even differed between a seafood bibimap and a pork bibimap! I am usually indifferent about Korean cuisine because of my frequent disappointments with other places, but few restaurants like Zzan always reminded me to give this cuisine another chance.\n\nWhile the decor was probably not geared toward family dining, it's not necessarily a hindrance. With the portion considered, the price was rather reasonable, but the deliciousness of the food certainly is worth it! If you are looking for a delicious Korean meal around Union Square, Zzan is it.\n\n---\ntl;dr version:\n1) Futuristic K-pop themed restaurant\n2) Reasonably priced, generously portioned, delicious food!", "author": "Jay Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "Came on a Tuesday night around 7:00? It was crazy busy, put our name and phone down on a waiting list. Decide to go next door to have a drink & to wait for our turn.. 8 o'clock rolls around and still no call we decide to walk back. I guess they forgot to call us because almost all the tables have different people... we got dat immediately because of good timing there was literally one table open and another waiting line beginning. The waitress that took my name down saw us and sat us. We ordered the Kalbi, pork belly, tofu stew, pan fried dumplings, and spicy rice cakes.. everything was yummy. The rice cakes were really spicy but good. We also ordered peach soju which was nice. Waitresses were busy (there were only 2) but got us everything we needed!", "author": "Andrea F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Pretty tiny place for how much people want to eat here. should relocate to a bigger area. Food was real good. Service was great. Great place to be loud haha Kpop playing through a projector onto a wall. Entertaining I suppose. Yo get the corn with cheese! Also get the rice cake! I love Korean food and this place nailed it! Soju bottles were like $10-$13 each. They got pitchers of soju! A must!  My friends and i really enjoyed the plate of skewers. Everyone around us seemed to have gotten this hot steaming bowl of noodles, regrets, should have gotten that too haha.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-05", "description": "Why is this so loud?!? Mind you there was about 4 separate parties here.\n\nCame here for a late dinner with the bad because cocobang was too crowded.\n\nPlace is small.\n\nWe got the cheese corn- looked way better in pictures, and it tasted like it was cooked hours ago and put back in the microwave when we ordered it.\nSpicy chicken karage- good amount of spice and good crunchy texture\nFried rice omelet with spam- I wish they used more egg for the actual omelet but overall I enjoyed this \n\nWe sat towards the back and it was so hard to get our servers attention. We noticed she was at the table behind us DRINKING with probably some regulars or people that work there?\nThis really annoyed us. She would quickly walk past us it was hard to get her attention.\nDon't see myself coming back as none of the food was to die for.", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "I came in here with a group of friends looking grab some food and drinks. Happily satisfied with the service as they brought out our orders of soju and Cass beer. We ordered quite a bit of food: kimchi fried rice, spicy rice cakes, japchae, combination skewers, cheese corn, and more. It was an amazing time especially with the alcohol we ordered. Food was on point and nothing to complain about. If you're around SF, definitely a place to hit up", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-16", "description": "This place has a similar ambiance to 707 Sutter; both have dimmed lighting, huge projector playing K-POP music videos and similar menus. \nHowever, Zzan is a lot smaller and has better side dishes. I was surprised that they didn't give us kimchi in our banchan so we asked for it and they have it to us. \n\nI ordered the Seafood Tofu Soup and I thought it lacked in flavor meanwhile, my bf's Tofu Soup w/ Pork had little to no flavor..\nAlso ordered the spicy rice cakes and we both thought the sauce was too sweet compared to other places.", "author": "Leilani Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "Really mediocre and flavorless food. Mediocre service. They don't take Amex. Seriously this makes it sound like a Korean joint at a Des Moines shopping center circa 1987. Who goes here?", "author": "Tad D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "Another entry into the list of late night Korean spots in downtown.  On the smaller side, but a little bigger than Cocobang, Zzan was able to accommodate our large group as a walk in.  Granted it was a holiday sunday and not much was going on downtown.  Service is quick and friendly.\n\nWe had a bunch of soju and beer which is pretty much the same at all the Korean bars, but Zzan has a buy 6 soju bottles for $50.  Which was decent.   \n\nThe food hit on few parts.  The steam pork feet cuts was pretty good and good sized portion.  The chicken gizzards were amazing.  Good drinking food.  The fried chicken was on the spicy side, but one of the better ones I've had in the city.  \n\nThe miss was on the kimchi fried rice, I thought it was a bit bland.  We ordered the brisket soup too, but I don't remember it as a stand out, but it wasn't bad, I just don't remember...\n\nOverall a decent spot to go to if the 707 is busy or not open.", "author": "Veasna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "Finally a good Korean restaurant in San Francisco. \n\nGreat Kimchee with plenty of flavor and just the right amount of heat.\n\nThe Good:\n\nBulgogi BBQ - Excellent\n\nCorn with cheese - Wasn't expecting too much but it was great\n\nStone Bowl Bibim Bap - Excellent\n\nSpicy Clear Noodle - Excellent\n\nChicken Skewers - Succulent tasty thigh meet - excellent\n\nGrilled Asparagus and Bacon - Excellent\n\n\nThe No So Good:\n\nSteamed Korean Sausage - Did not like this. Not enough flavor in the meat, too much fat, which all doesn't turn out so well when steamed.\n\nThis is my new favorite Korean restaurant in the downtown San Francisco area.", "author": "David T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-10", "description": "Another just A-OK Kpopish restaurant to go with Cocobang and 707 Sutter. They have a decent lunch menu with different options like lunch boxes with bulgoki, chicken, spicy pork and short ribs. \n\nI had the army stew for $11.95 and it was small for the price. It had instant ramen noodles, spam, hot dog and kimchi. The broth was just ok not spicy at all. The side dishes were only 5, kimchi, fishcake, bean sprouts, japchae and carrotts marinaded in soy sauce/vinegar. They were all on the bland side. \n\nThe food took a long time to come out and the male server acknowedged it and apologized. It wasn't even busy at 12:30 pm with 3 other tables that recieved most of their food already. If the food takes 30 minutes to come out I expect it to be good but it was just ok. \n\nHe did give 10% off the bill which was a nice gesture. Service was not the greatest, he brought the banchan out to a lady that arrived after us a lot quicker than he did for us and checked up on other tables but failed to come to our table. Perhaps, he felt bad it took so long.\n\n3.5 stars at best but if in area, rather go to 707 or Coco.", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "The bulgogi and bibimbap were delicious! The service was friendly and efficient. Prices reasonable. We enjoyed eating amongst so many young, happy Koreans!", "author": "Gina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": ":: The Menusic Of Erich Zzan ::\n\nYet when I ate at that highest of all table windows, ate while the customers sputtered and the insane kpop howled with the night-wind, I saw no sf spread below, and no homeless gleaming from remembered streets, but only the blackness of food illimitable; unimagined food alive with projection and music, and having semblance to every k-resto on these blocks.\n\nFormer fashion model turned dad(!) leaves cocobang & opens his first solo venture. Ambitiously big menu in the process of thinning & improving; you've seen these dishes before.\n\n(^_^) Pig Feet / Jokbal $15.95 (http://bit.ly/1LvxXRZ)\nOrson from US Acres.\n\n(^_^) Blood Intestine / Sundae $10.95 (http://bit.ly/1L5283L)\nUse your other food's dip sauces.\n\n(^_^) Meme Typeface / Impact (http://bit.ly/1L528kd)\nYou had me at Impact typed menu.\n\n(-_^) Karaage Spicy \"Source\" $10.95 (http://bit.ly/1iLy3tK)\nSweet & sour chicken, minus sour.\n\nAnd as I sat there eating in hanger, the wind blew out both the customers in that ancient peaked resto, leaving me in savage and penetrable dishes with chaos and pandemonium before me, and the daemon madness of that night-baying kpop behind me.\n\n#fulldisclosure 4th star bc our runway days together #goodtimes #nobromo #yesstylemo", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-22", "description": "Service is awful!!!! Unfriendly server. Would never go there again. \n\nWe were the only two waiting and keep waving to be seated. But they are all busy working and I understand, it's okay. We stand there for like 5 minutes. Then comes a couple and the server come immediately and send them to a table. \n\nI'm kind of angry and ask why, he asked 【\"why are you angry and shout? Do you want to eat or not? Can't you just wait one more second?\" 】In a very impolite and unfriendly way. \n\nThen we waited another 5 more minutes, with no sign of being taken to a seat. So we leave. Very disappointed. \n\nPlease, I just wanted to be treated fairly. Of course I come here to eat. Is this your way of treating the consumer? Shame on you!", "author": "Myra Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-09", "description": "Don't go here!! This place is the worst! I'm usually not too hard on restaurants but we have tried this place a few times because we like to help local businesses and it's one of the only Korean options by our place. The staff is the rudest I have ever experienced, and the food is mediocre. \n\nIn addition, a few of the times we tried to give them business through eat24, we Ordered online and they cancelled our order saying their kitchen was \"broken\". My husband was already at the restaurant to pick up the food, and their kitchen was definitely NOT broken as they had customers eating. Shame on you zzann! \n\nI would rate this place a zero if I could.", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Love the fried chicken and corn cheese over here!!!!!! Amazing !!", "author": "Judy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Their servers are friendly and attentive and their chicken wings are bomb! Other must trys: stone bowl bibimbap, soy garlic wings, beef rib soup, and everything else :)", "author": "Sui N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-09", "description": "Don't go to this restaurant unless you want to get food poisoned like me! Dirty tableware, smelly water and stale food!", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "I was reluctant on coming here because I read previous reviews on how rude the staff was here ... but luckily, that did not happen to me (and fingers crossed it never will) \n\nSo I came here for dinner one night, and to my delight, it wasn't busy with customers-- not sure if that's a reoccurring theme or not, considering it's tucked away on Post St. \n\nThe staff was attentive, and I appreciated how they frequently checked in on my boyfriend and I. The food came very quickly, and it was all so tasty! I recommend all of it:\n\n- pan fried dumpling \n- clear noodle \n- beef short BBQ \n\nI especially like the song selection; they played a lot of hip-hop and rap music. The way the lighting is set up makes your photos look like you're in a hot club or something, I love it! The pricing is pretty decent, too, for Korean food.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Food is delicious! Perfect for drunchies, but also for a casual meal. I wouldn't say the food is traditionally Korean, but it is tasty. I personally like Zzan more than Coco Bang. I think Zzan's food is more flavorful. Music is loud Kpop, perfect place to drink and pregame before going out, or to postgame since they are open late. Definitely not quiet or classy, but they have great food!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "TL;DR - Best korean food in union square when you're pumped full of alcohol.\n\nMy favorite watering hole is a mere two blocks from Zzan and (unfortunately) I find myself here more often than I would like...\n\nTaking off stars for:\n1. Lack of cleanliness. Its like a dive bar vibe... except I'm eating food.\n2. Awkward kpop music videos. Stop showing me stick thin girls while I gorge myself on corn cheese, galbi and all the carbs. \n\nRegardless, the food is pretty solid Korean bar-ish food. You've got the corn cheese, budaejiggae, kimchi fried rice. Yum.\n\nThe service we get is 50/50. Sometimes we are ignored, sometimes we get stellar service. In the end, it doesn't matter because all my hypothalamus wants is for this greasy, salty food to get in my tummy and to food coma immediately after.", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "I spent Memorial Day weekend in the Bay Area and had my first meal at Zzan. I flew into SF on a late weekday night and was craving something warm and soupy, and my friend took me here for some homey Korean food. The inside of the restaurant was super loud with a bunch of diners still eating away at 11PM and K-pop booming in the background. We were seated immediately. I ordered the Soondubu w/ beef because it fulfilled the \"warm\" and \"soup\" criteria. It took awhile for the dish to come out, but I was really impressed by the flavors. In fact, I'm pretty sure it was the best Soondubu I've ever had. I burned most my tongue because I gulped it down so quickly. Would definitely recommend this joint for yummy Korean food!", "author": "Diane M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-06", "description": "Came here with friends on a Saturday night. It wasn't as busy as I expected and we were able to be seated immediately. We ordered 3 dishes to share: soft tofu soup, combination (kimchi and seafood) pancake and soy chicken. \n\nThe foot itself was kind of disappointing. The soft tofu soup had huge chunks of tofu that didn't seem like they were cut up at all. It was suppose to be seafood soup but there was barely any seafood. The kimchi pancake was on the bland side, but with the sauce it was pretty tasty. As for the chicken, it was the biggest disappointing out of our 3 dishes. The skin was seasoned but the meat itself was very bland and hard to chew.\n\nI'd probably come back for drunchies but probably not for an actual dinner.", "author": "Cassie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-26", "description": "I came here for lunch one weekend with my girlfriends. We were the only table for quite awhile. \n\nAtmosphere was nice, Korean music was playing constantly, place was clean, waitstaff was friendly and attentive. \n\nFood was mostly great! Good banchan and soondubu & soybean paste stew. Ordered the seafood pajeon as an appetizer- was completely uncooked in the entire middle so that was really disappointing especially since we were the only table there. \n\nWill wait awhile and try them again later once they've been open longer.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Came here on a Saturday night and it was busy! Buuuut the servers were very polite even though they said it would be an hour wait, we waited around 30-45 minutes for a table. They were quick to take our order. We ordered the spicy rice cakes, Kim Chee fried rice, jjapaghetti and corn and cheese. Every dish was delicious. I always order spicy rice cakes at every Korean spot I go, and these were just the right amount of chewy and spice. They had music videos playing in the background and toned down lighting. If you want a night out with your significant other or a small group of 4-5, this place is perfect. They had a variety of beers and flavored soju. Overall, I really enjoyed the food. Will definitely be coming back.", "author": "Sammie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "I don't have much experience with Korean food but this place was pretty good. Service was great and quick and the food came out pretty quickly. We ordered the Soft Tofu soup (vegetarian) and the Spicy Chewy Noodle (Vegetarian). They can make several of their dishes vegetarian which is great! However, they have us a couple small appetizers like seaweed and kimchi and also included fish cakes which was a little odd. I didn't know if these were standard sides or were meant to go with one of the dishes. \n\nWhile the soup was just ok, I really enjoyed the sticky noodle and the spicy sauce it came with.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "It was awful, the food was food's quality was pretty good but now these days just getting worst! \nThey put less ramen there and charges the same price!", "author": "Iris S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-13", "description": "Honestly, the food is bad. Either salty or no taste at all.\n\nAlso, I order their drink special, a liter HITE beer plus soju for $19.95. Several order of it actually. But on the bill they charged separately, and when I inquired, they said they cant change it because the manager wasnt there. wtf? OK I will pay for it and give you that much less in tips.", "author": "Tj K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "The creamy rice cake was delicious - however, not super vegetarian friendly.  Some of their food WILL have meat even though it's not mentioned at ALL in the description of the food item.  I had to send mine back because they randomly added bacon in it without ever mentioning that it has it.  Their broths are beef-based so you need to specifically ask for a veggie broth if you are a vegetarian.\n\nThe ambiance is fun, but it's really loud in there.  There's fun k-pop playing on a projector that could use a decrease of quite a few decibels.", "author": "Guy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "Second time I've ordered for delivery that the order took 90 minutes and that the (small) soup container was 2/3 full. Won't be ordering again.", "author": "Molly Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-27", "description": "I didn't want to complain the restaurant, but the delivery food looked like a disaster. Maybe I will choose to eat at restaurant next time. The delivery service is disappointed.", "author": "Xiuling X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-17", "description": "Reading yelpers claiming this is the best Korean food in this area, we decided to stop since we were in this area. Dead smack during lunch time where there were only 2 tables are filled should be a red flag. Ah, you never know unless you tried it. That's what we did, so we ordered:\n\n* Japchae - I've made this at home numerous times and it's my first time eating it from a Korean restaurant. Is this supposed to be that sweet? I can't taste a thing from this dish except sweetness. Seriously, sugar overload. \n\n* Bulgogi BBQ - meh. Beef was bland, and fully cooked served on a cast iron platter (and not even sizzling!). Especially the beef was thinly shredded, it came out liked a tattered mess, just the presentation itself was not appealing.\n\n* Spicy tofu soup with ramen - Ramen is literally the instant noodles they stuck in the soup. Though this is spicy tofu soup, but wasn't too spicy which was appreciated. Lots of tofu and not much else.\n\n* Chicken bibimap - ordered with the stone bowl, again, no big deal. I've had better. Chicken was meh. Just get the stone bowl for the crunchy rice at the bottom. Add that to the spicy tofu soup was a great way to have the rice.\n\n* Banchans - not much variety either.\n\nAt the end of our meal, we found ourselves the only ones in the restaurant. The chef and the only waiter stepped outside taking smoke break - another red flag. Sorry, way to many great Korean restaurants in the city, chances of us coming back is very slim.", "author": "Em T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Delicious food and very friendly service! Highly recommend to check it out. \n\nI came here via Allset app (order your lunch in advance) and when we came everything were all set and waited for us. Food is very tasty, portions are huge and the stuff is very attentive. Great place for your lunch break!", "author": "Anna I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "I was surprised to see this place didn't have more positive reviews as the food and service were excellent. I highly recommend it. We were wondering around trying to find somewhere decent without a crazy wait and after striking out several times wandered in and got a table immediately. Focus in on the bibimbop, salad with beef while your chicken wings cool down and then of course the k-pop videos that have you scratching your head wondering if those girls are 13 or 30.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "We shared a seafood stew and the grilled pork belly. Both were fantastic. Service was friendly and quick. Ask for some extra kimchee and pair your meal with some soju and you've hit a home run.", "author": "Roger B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "Very meh. Ordered takeout from here on a night I was craving Korean hard and couldn't make it out and it barely checked the box.\n\nThe seafood pancake was soggy and falling apart and the bibimbap chicken was mostly flavorless. Luckily it came with bibimbap sauce so I drowned the dish in it and that seemed to do the trick.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-14", "description": "I love every food there but... especially for foreigners, be careful! There is a server who is really unkind, sometimes rude ^^ Other servers are very fine, but the impolite server doesn't seem to wanna sell something or smile ^^ If my brain works well, I remember the server's name is Jay. Whenever I go there with foreign friends and there he is, I get ashamed of introducing that Korean restaurant ^^ Does the owner like it? Wow incredible ^^\n                        ^^...   ?        ,        ,    ,               ...                  ?                      ^^     ,      ,                ?     ?  ?     ?               ,      ,     ...   ^^", "author": "Winning C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "I found zzan on yelp while I was starving around the downtown area and craving asian food. I think the asian food selection around this area is limited and zzan's about a 10-15 min walk away from market street. I liked the food overall. We ordered the seafood pancake, short rib soup, and bibimbap. \n\nThey play loud korean music to emulate party-like korean restaurants. I would say it's not bad for a Korean restaurant within walking distance of union square. Would come back next time I'm craving asian food and too lazy to go over to the richmond.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "Pro Tip: Order the Korean chicken wings. They are amaaaaaaaazing!\n\nAfter a long flight to San Francisco I came here with a friend to grab some late night grub. The interior is super casual and a bit divey but being hypnotized by K-Pop videos makes everything disappear in the background. We ordered some shochu which was very reasonable at $13 a carafe along with an array of dishes such as the Korean chicken wings, kim chee fried rice and spicy chewy noodles. Earnestly all I need after a hard day are those chicken wings and a big bowl of rice. A word to the wise, don't get all your dishes spicy because I think you need the contrast of plain and spicy or else your entire meal starts tasting like one big mess. Banchan was not the best I've ever had, but I did enjoy the radishes which were served with those amazing chicken wings.", "author": "Emi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I don't know why they have such bad rating from some people. You're not going here to have authentic Korean food. It's more about the young and trendy atmosphere with decent Korean food to have with soju. I love their music selection too. Service, never had problem with. Just because they don't smile doesn't mean they are being rude to you. I've had non-korean friends visit here and they had great time there and never complained about service. \n\nIf you want authentic Korean food, go to Han Il Kwan. \nIf you want decent korean food AND rolls, go to Izakaya Ninja. \nIf you want Korean style friend chicken, go to Cocobang. \nIf you want decent korean food with fun soju drinking time with friends, definitely go here, ZZAN.", "author": "Sm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "Ok I'm writing this review based on reading some negative things. That didnt speak to my experience at all. Though they seemed overwhelmed a bit, the staff was friendly and accommodating and apologetic and checked in multiple times.\n\nI ordered assorted seafood with noodle (togo) and whole octopus stirfry (stay). Both were delicious, flavorful and portion size matched the price. Ban chon was very good. Rice and noodles were fresh. \n\nYou have a choice of cocobang and 707 in the immediate area and i would easily choose Zzan. Cocobang was good but not memorable (save for the long wait) and my one experience at 707 was unfriendly, overpriced and bulgogi was near-beef jerky dry. Seriously, it felt like the leftover bulgogi from the grill. I will say their seafood pancake was good.\n\nI don't go to restaurants twice unless I had an exceptional experience. I've been to Zzan twice in two days and will likely order again in the next couple days.", "author": "stuart l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Really excited to see a new Korean spot pop up in the Lower Nob Hill Area!\n\nThe 2 other places I usually go to are Jin Mi or 707 Sutter. Jin Mi can be hard to get to since it's in a pretty rough neck of the TL, and 707 can get really busy.\n\nZzan provides the trendy fun atmosphere of 707, and they have the food to back them up.\n\nBe greeted by dark walls which highlight the K-pop music videos playing on the screen. Energetic servers quickly come by to take your order and poor beer.\n\nSo far I've tried their Jap Chae, tofu soup, and Hot Stone Bibimbap.\nWhen I told them I was vegetarian, they even made sure to swap out the side dishes to make sure they were all veggie-friendly. A small touch I really appreciated.\n\nEverything is cooked well, served hot, and really spicy-just the way I like it.\nIt is open super late as well, 2am on most nights. \n\nThe times I've been here, every table is filled, but the wait isn't too bad.\nThis is now one of my favorite new spots in town!", "author": "Lanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "The chicken was great. I got there at 530pm and it was just about full. If you're going during dinner rush expect a bit of a wait.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "You're go to late night Korean mini bar!\n\nBasic Korean dishes, condiments aren't a lot but it will do.\n\nCame here mainly just for the soju but the cheese corn and pigs feet are worth a try! Will be back on my late nights in the city.", "author": "Connie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Stopped in for a quick lunch. The Bibimbop box with kimchee and veggies was just fantastic. Topped it off with an ice cold Sapporo. Quick and friendly service. Very small but cozy.", "author": "Katie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Random Saturday night shenanigans and we ended up here because we wanted dduk bbok ki and kkampunggi (spicy rice cakes and korean fried wings). \n\nSomehow between 3 girls we had 2 things of flavored soju, some kind of raspberry wine as well and this was well after taking shots and having drinks at 3 other places previously. \n\nNeedless to say we were having a good time.  I love how they have korean and american music playing with their music videos projected on the wall.  \n\nLet's talk food though: Banchan: pretty good and they kept coming out as we were munching on them.  They also have REAL kkamppungi (korean chicken wings) rather than the cut up pieces of chicken they have at other places.  The amount of wings was ridiculous! They were perfectly seasoned and crunchy, came out piping hot!  We also got ddukbokki which was good too- little different with a little more sweetness than usual which was perfecto.  \n\nDrinks: Strawberry soju was bomb.  Yogurt soju was to me- okay.  They tend to blend their flavored sojus which is different than what I'm used to in ktown in LA, but I'm not hating on it.  Makes sure that it's extra cold. ;)  It made it harder to shoot, which I guess was a good thing or else I would've been further gone quicker.  I do like the flavored soju they do here only because it's a little less sweet than usual. This is a good thing as I don't like overly sweet. \n\nService: 100%  Andy oppa's the best. :)", "author": "Meena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "The best korean food in SF!\n\nits one of me and my husband's favorite places to drink and eat!  and we are always so happy with the food and kind services there.\n\nthey have mostly everything from Korean meals to drinks & snacks, everything on the menu is delicious but our favorite is cheese bul dak(spicy grilled chicken) Must try!!\n\nI also highly recommend this restaurant to anyone who wants to have a great experience by awesome proud staff!", "author": "Maki J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-20", "description": "The individual dishes are really good, and the staff are super friendly.  However, the bento boxes have much to be desired.  The pork katsu was too dry.  The fried pancakes were drowning in cooking oil.  The fried pot stickers weren't bad.  If they can improve the bento boxes, that'd be great.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Strong spice broth. Perfect taste for the one who like strong favor. It was the best kimchi stew(with pork belly) I ever had.", "author": "IT F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Ordered via Yelp Eat24. Craved for seafood pancake, tofu soup, Kim Chee fried rice and boiled calamari!  Drooling just thinking about these k-food! Been doing loads of delivery and this was a yummy spot.", "author": "Vee V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "Too much attitude on the phone! I saw a picture of their beef noodle on Yelp, and bae and I were out late in SF. Wanted some late night viddles, so I pulled out my trusty Yelp app (of course) and took a look. My sweetie had his Yelp on too, and he called first. I could hear through the phone and my bf asked him what different kinds of noodles they had, and he said \"Well, this is a Korean place... did you know that?\" \"Uh.. well I just wanted to know if you had different kinds? Like chicken or\" \"I think you want a Chinese place. We don't have noodles like that.\" Boom...and he hung up. We were both kinda like damn... ok. Maybe I'll have better luck if I call. Nope. \"Hi there! (I even lifted my voice 2 octaves to sound more fresh and friendly) what kind of noodles do you have?\" \"Sigh\" (Uh oh. He must have known I was with the last call)  \"We don't have noodles\". In the nastiest tone. Then hung up. Wow. Fuuuuuck you too I guess? Customer service starts on the phone. Get into it.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-30", "description": "Bad Korean food I have ever had.\nI ordered plain fried chicken ( $1 extra for the sauce) and it was very bland no taste at all.", "author": "Misstar C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "A much needed new spot in DTSF! Service is superb any day you go in, even on a busy Saturday evening! \n\nMust try their iced soju that comes in a variety of flavors--kiwi, mango, peach, guava, and strawberry. \n\nLove the ban chan (appetizer dishes)--Kimchee tasted fresh! \n\nGalbi was made to perfection--tender and juicy. \n\nCombination tofu soup had everything I asked for--from beef to seafood. Make sure to get the extra spicy! \n\nKimchee fried rice--can never go wrong with this! Again, fresh Kimchee goes a long way.\n\nWould definitely come back!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "Great food, great service, interesting atmosphere.  Love that it stays open late, highly recommended.\n\nI think the prices are very reasonable\n\nOnly minor thing was the food was a bit too salty", "author": "Jorlyn W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "Worst Korean restaurant ever! I had an army soup yesterday and I spent the whole night vomiting. The kimchi they served has gone bad. The ingredients in the soup must have gone bad too. It was really spicy thus the bad taste was not easy to recognize. Please stop poisoning your customer!!!", "author": "Grace X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "I'm Korean and this place makes me happy- going back tonite. We had mackerel, kimchi pancake and Bi bim bop- all yummy. Soju was great too!", "author": "Jungah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "It's not a trip to San Francisco if I am not dancing to K-Pop and eating Korean food with my number 1 volcano goddess. It's just the way we do things.* I'm surprised to see the star rating for Zzan. I really enjoyed myself.\n\nThe space is unassuming. I like that what the restaurant didn't put into decor and fancy jibber jabber, they put into a huge-a$$ TV that played hit after hit of K-Pop. #priorities Even though I was sad that I didn't hear/see one Miss A joint while we were there, there was plenty of infectiously ridiculous music to keep me entertained and ADHD-addled. As is our tradition, my friend and I started with a carafe of soju... that turned into carafeS of soju. We can't help it. When flavors come in peach and strawberry and are so bright and colorful... and the music video are so bright and colorful... you're in too deep. You just have to keep drinking. You can't fight the moonlight.\n\nDrAnks flowin' and dubs bumpin', it was a smart idea to get some food in the belly. Thing is, when you're tipping back the drAnks and paying more attention to the 2946 members of the latest K-Pop boy band on the large video screen, you over order. You might try to eat everything on the table but you will fail. At least it'll taste good as you admit defeat. Far and away, you have the get the chicken wings (obviously from mutant chickens, given the enormous size of the wings. I'm not complaining). We ordered the soy garlic wings and let me tell you this: in the 7 years we have been friends, we've never had an argument. In trying to determine who was going to eat the last wing, we almost came to blows. I decided to be a Southern gentleman and let her have it.** I don't think I would have given up so easily if it weren't for the kimchi fried rice I was killing. Oh, and what was that? Spicy noodles to slurp on their own or make a carb monster and mix them with my kimchi fried rice? Don't mind if I do both. \n\nThis meal was an embarrassment of gluttony. Despite being members of the clean plate club, we couldn't finish... our food. The soju, we kept flowing and put a hurt on it. Again, #priorities.\n\n*We've come a long way from burgers and shakes.\n**She kicked my butt.", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Drool over the menu, curse everyone and their mothers while you wait forever for the food, then forgive them all over again when the food arrives.\n\nOn a Saturday night here once my partner and I waited an hour after ordering before the food arrived.  It was completely unacceptable.  At the same time, the soup they make here is my lifeblood.  I'm so conflicted about this restaurant.  I don't know how authentically Korean this food is, but I want to try everything on the menu.\n\n\n---- Small Plates ----\n\nSteamed Egg Custard: 3 stars\nThe egg was a bit coarse.  I prefer a silkier texture, like Chinese egg tofu.\n\n\n---- Soup ----\n\nBeef Brisket Soup: 5 stars\nIt's like everything you could possibly want in a soup.\n\nDumpling Soup:  4 stars\nPork dumplings and tender beef brisket in an eggy soup.\n\n\n---- BBQ Hot Plates ----\n\nPork Belly: 3 stars\nOn the dry side.\n\nSpicy Pork BBQ: 4 stars\nDelicious tender BBQ pork, but you'll be disappointed if you wanted something spicy.\n\n\n---- Stir-Fried ----\n\nCombination Pancake: 4.5 stars\nKimchi and seafood.  So yummy.\n\nSpicy Pork Clear Noodles: 4.5 stars\nI love chapchae. Not too spicy for me, which means it's pretty darn mild.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-27", "description": "New Korean on the block. Clearly they are still working some kinks out. With 707 and Cocobang around the corner, they will have to step up their game to win in the competition. Place is big, a little smaller than 707, but twice the size of Coco. Pretty big menu with happy hour drinks on tap. Like the others, K-pop music videos are projected onto the wall for your dining entertainment.\n\nOrdered:\nSpicy pork noodle: Good flavoring, nothing spectacular.\n\nSoon do bu: The initial soup was burnt. It came boiling and the bowl was popping from the tray. The taste was over powered by the charred burnt taste...I wasn't about to spend $13 on uneaten soup. We had to send it back and the waitress was very apologetic. Our burnt soup was replaced by a new one and she even gave us a new egg to drop in. Unfortunately, for me the flavor was a bit lacking. My favorite tofu soup in the area still has to be from 707. \n\nThey have a pretty reasonable lunch menu that I have yet to try. The place is promising, hopefully with time things will improve!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "I had an urge for some Korean food, so I went to Cocobang. It was crowded and I had to wait. So I walked around the block and discovered ZZAN. Got seated immediately. \nOrdered some fried chicken, which was very good. We also had the beef bulgogi and spicy ramen, awesome!!! I was really glad I came. The service was fast and friendly. There were two guys that was really fun and efficient. Yogurt soju was the bomb.\nI was very hungry and I was not disappointed.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "First time here. Wouldn't come back. Very low lighting inside the building. Service was friendly and prompt. But the food was not the freshest the kimchi fried rice had good flavor but was a little underwhelming. And the spicy pork BBQ was almost all spice with not much other flavors.", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Awesome spot! Good vibe, and they got Kpop music videos on the wall playing. The music does play a little loud, though. Favorite dish has to be the creamy rice cake. Also got the skewers, which were bomb, but their wings were not as good as their other dishes. It felt like they used bad oil when cooking them.", "author": "Do P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "The soft tofu stew here tastes great. The waitress gave us seafood pancake after we waited quite some time for our food to be served. Good service", "author": "Annie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "A new Korean eatery is in the neighborhood yay!  I stopped by during the week for their lunch specials.  I loved the salad and banchan included.  The meat portion (I had the BBQ chicken) was a bit small, but for the lunch special price, I can't complain.  Service was friendly, prompt and checked on me as needed.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "This place is across the street from the hotel we stayed at and after a full day we needed some late night eats. Zzan did not disappoint! The kimchi fried rice was delicious, beer was cold and they had hip hop music videos projected on the wall. Perfect little spot", "author": "Lizzy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-12", "description": "Came here on a Thursday night and most of the place was not busy at all so it was nice. The food itself is ok. We got the budaejjigae, wings, pancake and some other items i forget. Place is kind of small so only long narrow tables. We had a group of 8 and sharing food was a bit of a pickle when it came to passing things back and forth. A round table would have definitely made a better experience but that would never fit in there. Overall it was a pleasant experience but I wouldn't say it was amazing. The staff was just two guys for the night and service a tad slow but bearable. I wish they had the Korean buttons you can press for service.", "author": "edward k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Another legit Korean hang out venue in my area! *Raise my soju cup in celebration*\nZzan's Korean fried chicken was soooo delicious! Before I knew it, I almost single handedly downed the whole thing. The staffs are friendly and attentive. I'll be back for more soju bombs and delicious goodness!", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-20", "description": "Food is good but service is really bad! \nNo one come to take my order. When I tried to tell them I'm ready. They told me wait and just talked with their co worker. Ignore the customer.", "author": "Aunggie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "Came here with a colleague for dinner. We opted for the pitcher, which is more like a 64oz plastic bottle of beer. Ordered some food. The spicy chicken dish with cheese was awesome, my friends beef bolgogi was decent. I will be back for that tasty chicken! so hot!", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Never been here but delivered twice to my high rise. I love the authenticity of Korean flavors and no Asian Fusion crap. I'm Korean American for 42 years and would really appreciate if the restaurant would add the Korean name of the dishes because I am not familiar with the exact ingredients....my mom just cooked and we never asked. Please add a little Korean comment for Korean American people who want the words Jaja myun or Kimchi Jija...Galbi, bulgogi, soon dubu jijee. Dopokee....please. That would be the bomb!!! Korean and American ordering. Thai , Vietnamese, Indian restaurants don't make up goofy names for their dishes.  Only Korean, Chinese and Japanese restaurants make up goofy dishes.\n\nDragon Roll\nSeafood Pancake\nTempura Rolls\nKung Pow\nGeneral's  Chicken\nLaughing Duck\n\nWhat the crimmeny happened to Asian cuisine and the unique names. Let's all speak in Spanish too at Asian Restaurants because it's cool to be bi-lingual. Ok. My post is long enough. Pahhha hahaha!", "author": "Kathy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "I went here with my family for Christmas Eve dinner. We were seated immediately. We ordered bulgogi beef, spicy pork, potstickers, calamari, and tofu soup. The service was quick and the food was delicious! The price was also very reasonable for the generous amount of food.\n\nThis is a great dining spot for people in their 20s. Rap music was played accompanied by music videos projected on the wall. The lighting was dim and it created a really hip ambiance.\n\nI will definitely come back next time I visit San Francisco. Would definitely recommend to friends and family.", "author": "Drake S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Had the Bibimbap.  Arrived in a beautiful bento box! Everything in the box complimented the amazingly marinated beef short ribs!  Warm friendly quick service! Yummy!!!", "author": "Koichi D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-20", "description": "Dear Zzan manager, I expect a reply. 0 STARS! Just paid $11 for what was supposed to be Steamed Sausage with vegetables with a sauce. THIS is what I got. One sausage link that has been sliced in to pieces with a sprinkling of dry, shredded lettuce?! It's cold. It's rubbery, yet dry. Has NO flavor. And does not even resemble the picture that is posted in their pictures of this item. Not in any way. Taste is disgusting, and this is deceptive and such a ripoff.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "Inconsistent. First time I came here back when they had just opened, the tofu soup was very flavorful and had a nice spiciness to it - in my opinion, it was one of the best I'd had in the city. Came here last night and it was SUPER watered down. No spiciness, no salt, and just very little flavor. I added kimchi to the soup to give it some excitement. \n\nI think they're understaffed/experiencing growing pains. The place is gaining traction so they need to staff up (service was very slow even though the wait staff was working very hard) and maintain consistency in food quality despite high customer volume. \n\nHope they can get back to where they were when they first opened.", "author": "Jeffrey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "I swear, ZZan has the best Korean food in the area. I lived in Korea for a few years and this place does it right and for fair prices. \n\nMust haves:\n\nFried chicken. The soy ginger sauce is sweet. The spicy sauce is the bomb. For $14 you get a giant pile of wings and drummies. Fried crispy.\n\nClear noodles with beef (jop chae). Best dish on the menu. Includes soy-based bulgogi, onions and mushrooms. To die for.\n\nBeef brisket soup (yuk kae jung). Mind blowing soup. Very spicy but a large bowl of soup that will cure any ailment or hangover.\n\nPancakes (pah jun). I really enjoy the seafood one with chunks of octopus. The kimchi one is also delicious.\n\nMeh.\n\nSpicy pork. Served sizzling and with rice. The flavor just isn't there and it's not really spicy. The price is high at $16.\n\nGo here. Eat the food. Listen to some K pop.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "I'm from LA which I guess means that my Korean food standards are fairly high. \n\nI got the tofu with dumplings, which tasted a little off. I can't put my finger to it but it didn't taste like \"home\" if I could call it that. \n\nMy friend got the bibimbap and enjoyed it, and I've heard that the bulgogi is great so I may just have ordered the wrong dish.\n\nI guess I'll have to come back to find out!", "author": "Anna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "The best Korean food that I have ever had.  Shame I had to fly out to San Francisco to have it.  Anytime you want to open up a place in the Lou, that would be great.   Thanks for the wonderful food, great service and beautiful atmosphere!!!", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "My friends and I came in on a Friday evening and I was surprised to see the restaurant was not very full. The service was great and our food came out very quickly after we ordered. Zzan has a late night vibe, as the restaurant is narrow and dark, and there are large TVs playing various Korean music videos on the wall.\n\nI got the dolsot bulgogi bibimbap and my friend got the tofu soup with dumplings. My friend thought her soup was okay but I thought the bulgogi bibimbap was really good because the meat was so flavorful and well marinated. (Some places cheat and make the bulgogi in the bibimbap drier with less flavor.) This place was great!", "author": "Rica Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Ahhhhh Zzan!!! I have not stepped inside this restaurant yet, to be truthful, but I had deliveries from Postmates , and I have to say I love the food here. \nThe best one ,of course, is the kalbi. It was excellent each and every time I ordered it. Finger licking excellent, if you asked me. The chicken was good too, so tender and juicy. The pork belly was another favorite. And the bibimbap was flavorful,with all the vegetables, I only wish they had cooked it longer in the stone pot, because I love the crusty rice. \nThe one star off was for the inconsistency on the amount of rice given. The very last delivery, there was not enough rice. Maybe I should put a note next time when ordering.", "author": "lovetoeat a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "This is my new favorite resturant.  The creamy rice cake noodles are so good. The service is on point and the prices are reasonable. I would recommend this spot to everyone, whether it be for a small meal and a beer or a nice family dinner.", "author": "C H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Looking for some Pho close to the hotel I called no joy and tried this place instead. Great beef brisket soup! Very hearty and flavorful.  The place has K Pop videos on the wall. Has a dark vibe like Pulp Fiction. The menu choices are vast so they have something for everyone.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Solid. Cocobang and 707 needed some healthy competition, and here it is -- \"ZZAN!\"\n\nThis isn't really a place to take your entire family and expect 900 side dishes to be refilled 7x during your stay. Come, drink, snack, enjoy the buzz. This family-run joint serves up recognizable Korean fare at (sad to say) average SF prices. \n\nDishes had on first visit:\n- Army stew (budaejjigae): looks are deceiving. Fed 3 of us until we were stuffed. At $25.95, it's cheaper than Toyose and Playground, I believe.\n- Chicken karaage with spicy sauce (#69) $10.95. Yummy! Reminded me of a Korean version of General Tso.\n\nThey have a few beers on tap, soju cocktails, and tons of other dishes I need to try on my next visit. Banchan selection could be better (unripe kimchi gives me sadface), and averages around ~3 dishes.\n\nFast, friendly service and loud KPOP music videos being projected onto the wall. I'll be baaaack.\n\nThe 1 star reviews are obviously written by Zzan's competitors in this hood (no reviews or friends and/or highly rating 707? OOoooook). That's really low and lame.\n\n--Edited--\n\nAdditional dishes tried:\n- Creamy ddukbokki (\"Stir Fried Creamy Rice Cake\" on the menu) $12.95. YUMMY! I wasn't expecting to like this but was like ddukbokki and carbonara (bacon included) and it was both spicy and the right amount of salty. The ddukbokki (rice cakes) were cooked over more than the standard chewiness, but I actually liked it and the consistency reminded me of gnocchi.\n- Yukgaejang (\"Beef Brisket Soup\" on the menu) $12.95. It had a good, mildly spicy flavor and the beef was really tender. But it was lacking a few classic ingredients so it was only OK.\n- Pan Fried Dumping $7.95. Very tasty and beefy. The skins were not dry on the outside like gyoza in some places I've had before. Decent starter to whet your table's appetites. (Full disclosure, though - I am obsessed with dumplings.)", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Zaan is a pretty cool place that has a video project of music videos. The inside is kind of dark and lit up with florescent lights. There's enough tables inside to fit around 20 people. It's good for large parties also since the tables can be pushed together for larger parties.\n\n== Food ==\n\nThe bulgogi was pretty good. The beef was a bit too chewy though. The rice I got was overcooked. The side dishes were pretty standard. Kimchi, pickled something, fish cakes, some greens, and some white clear stuff.\n\n== Service ==\n\nFood came out pretty fast and the service is pretty good.\n\n== Overall ==\n\nPretty good place to grab some Korean food. The atmosphere is the biggest selling point of this place.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "They skimp on the meat in the dishes. \nWe got the kim chi friend rice with spam and you can barely taste or find any spam. This was also the same case for the beef tofu soup. \n\nThe chicken wings were also saucy, but the chicken itself was a lot more difficult to pull off the bones. In addition, the meat was dry. \n\nGave it a try, but Cocobang or 707 would be better options.", "author": "Suzie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-13", "description": "The waiter here sucks and he's very rude. He was trying to kick us out because they were \"busy\".... even though they had plenty of empty tables. Left a bad tip and he threw it.", "author": "Jaewon K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-11", "description": "This is for Zzan's delivery business which is the most unorganized delivery service I've encountered so far in SF. I put in my order of only THREE items at around 840 pm on a Thursday night and the estimated time of arrival was supposed to be 945. Fine, an hour... That was okay with me since most businesses always say that but usually do come faster. Around 940, I messaged eat24 who assured me the order was on the way. At 10, the order was still not here so I called the restaurant who informed me that the order was still there and the person from eat24 didn't pick it up yet. I was livid at this point and immediately messaged eat24 who was also confused about why the order was so delayed. \n\nAt around 10:05, the order did come but boy, did it come with serious errors. First of all, I ordered the seafood soontofu which was an extra dollar but I got the veggie one. Kimchi fried rice came with pork when I specifically stated beef. That's 2 of the 3 dishes which I also had to pay extra for! The food was also mediocre and everything was either too saucy or too salty. \n\nThe girl who I called at Zzan earlier called me back and said it was their mistake. They messed up my order which is why they thought it wasn't delivered - she offered to send the dish again but I declined. Save yourself the trouble and don't bother ordering from this place.", "author": "Sherina Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-11", "description": "Terrible service on delivery. Either pork in my vegetarian food or smashed up food from inappropriate packaging. ALWAYS leaking everywhere. And NEVER wants to be responsible blames it on delivery service and they are wasting my time in the middle of the night after ruining my dinner refusing to give a refund. Food half the time tastes terrible this place is off my list forever", "author": "Hyun B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "Came here because 707 was closed on Thanksgiving Eve. Zzan is really small and the decor is kind of confused but it doesn't take away from the typical K-bar experience. There were only two waitresses and they were super busy and backed up the whole night. When I went to the restroom, I also peeked into the kitchen and saw that there were only two cooks as well. Hats off to them for handling that large dinner/late-night munchies rush! At one point, they even ran out of dishes and had to serve on paper places. \n\nOnto the food -- between my friend and me, we got an order of the chicken wings with soy glaze, kimchi fried rice with spicy pork, soondubu jiggae with beef (mild), and a pitcher of mango soju.\n\nTheir chicken wings are really big and plump but the soy glaze costed extra and wasn't particularly tasty. Even though I ordered the soondubu jiggae mild, it came pretty spicy. I'm wondering if they forgot that I ordered it mild or if their mild is more spicy than what I'm used to with other places. Their kimchi fried rice was standard. Mango soju was very icy and towards the end, super thick and syrupy. I might stick with Yogurt soju next time. \n\nBy the way, their banchan is ON POINT!! Kimchi and radish kimchi were some of the tastiest I've had in a long, long time!", "author": "Maggi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Zzan has been an itch I've had for a few months.  I'd come to San Francisco last year for a wedding and the weekend was packed so I made a mental note to come back.  \n\nHaving eaten Korean food my whole life I also didn't want it to disappoint.  Great news it doesn't!  We walked in with no reservations and were seated immediately.  Drink and food orders were do e at the same time.  It looked like they had a couple different soju flavors.  Didn't try em but it's soju.  \n\nWife and I had the shrimp tempura, kimchi pancake and stone pot bibimbap.  Everything was great, wife loved the shrimp tempura as well as the kimchi pancake.  They come out hot and fresh!  The bibimbap was delicious as well.  \n\nOverall I loved it, it can't beat mom's but it's pretty darn great.  Give it a shot and you'll love it.", "author": "Stan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Walked in here unexpected. The place is brand soak in new. I'm so excited that another legit Korean spot is here! No more long lines in the cold for some ddukbbokggi.\n\nCame in was seated promptly. Friendly staff, manager was spot on with service. Had creamy ddukbbokggi. Let me tell you, best in SF. Come try it.\n\nWill definitely be back. Seating is plentiful and you are not all up on the people next to you. My new spot.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "MY FAVORITE Korean k-pop place. They get you in pretty quickly. The food is ON POINT. Every single thing we've ordered we've loved. Favorites are Army Soup, Corn Cheese, Spicy Clear Noodle with Kimchi, Pork Bibimbap in the thick pot so it has super crusty rice bits. I am salivating just thinking about it. \n\nThe service is always quick awesome. I imagine one of the guys is the owner because he's always super personable and funny. One of those places thats so yummy and great you don't want people to know about it and crowd it out but it's kinda too late, everyone already loves it.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Best when drunk but is always yummy and good for group events . You don't BBQ yourself so they bring everything out to u but the short ribs and seafood pancakes are to die for!!!", "author": "Felicia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-26", "description": "We ordered delivery from Zzan, so granted it's probably not their best performance.  Food was good and I'd definitely be up for it again, but just nothing special.  Unfortunately, the tofu soup spilled in the bag, so it was a bit of a mess.  My spicy pork stir fry was tasty, but not really that spicy.  Delivery also took almost 90 minutes, which seems a bit long.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-23", "description": "I love Korean Food & eaten it in three countries. \nBibimbap is very simple - basically vegetables usually arranged nicely on top of rice with an egg and some soya bean/ red pepper sauce to mix in.\nWe ordered this for our vegetarian daughter & asked that it not have mushrooms. When it arrived WITH lots of mushrooms, we politely sent it back to the kitchen. Rather than making a new bowl someone just picked off the first layer of most visible mushrooms and brought it back to the table. Once my daughter started mixing up the vegetables & egg into the rice ( which is the customary way to enjoy this dish), she found more mushrooms. This time she just picked them out herself but really didn't enjoy the dish as the taste of the mushrooms spreads.  \nYes, we could have sent the dish back a second time but it gets stressful to keep doing that. \nMy husbands beef ribs were nicely marinated.\nMy \"seafood\" bibimbap had far too much hot sauce, 2 shrimps and a few tiny pencil eraser size pieces of squid.\nSide dishes were tiny and most lacking in flavour & imagination. Kimchi, bean sprouts, zucchini & seaweed. The seaweed was pretty good.", "author": "Robin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-25", "description": "Zzan feels more like a late night k-diner (is that a thing?) for college kids than a restaurant suitable for dinner. I think it's because they gave so few banchan (side dishes) that it felt like we weren't in an authentic Korean restaurant, even though it's run by Koreans and 90% of the patrons were Korean. \n\nDespite the lacking banchan, the tofu soup and beef soup were pretty good in terms of portion size and taste! All in all, I would go back for a late night bite but would stick to other K restaurants in inner richmond or inner sunset for a \"real dinner\"", "author": "Adrienne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Came here on a Saturday and got seated right away.\n\nOrdered the pork feet it was good\nOrder the fish cake soup was good\nSpicy Chicken with cheese sounds weird but it was delicious. \n if it was a sandwich I would be all over it . Im sure someone has it somewhere\nMy friends liked the cheese corn\nChicken gizzards were ok\nThey did a very very good job with their small side dishes .\n\nFirst time I've been to a Korean restaurant with an all English menu \n\nServers were very nice :)\n\nI would come back", "author": "DOM d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "3 stars only bc i was hungry and the food was ok. It's also close to shopping in the Powell area if you want to get away from the over priced food courts in the shopping centers. \n\nWhat I didn't like was the fact that: \n1. They messed up our order (luckily it was the same price as what we originally ordered) \n2. Service is sooooo slow here. Waited over 15mins to get our orders taken. There's only one waitress helping all the tables it seems. \n3. I had to get up twice to ask for an extra spoon.", "author": "Kim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "I very much enjoyed this place! Their bulgogi is so yummy and croquettes are a MUST! Love that this place is open til 2 am too!", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "Have been here a couple times and it's always great!\n\nI'm not an expert on Korean food but everything I've had here is delicious and flavorful. The service is always fast and the prices are pretty reasonable. The K pop videos in the background are a little distracting but make for a fun atmosphere.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-04", "description": "The service was extremely slow on a Saturday evening at 7:00pm. The waiter was rude and unprofessional. The rice cake skewers that we ordered as appetizers came out five minutes after the entrée. The food was good but having to wait longer than we should killed it for us. The waiter also mixed up our check with another table. I did not feel welcome at this restaurant nor would I recommend it to anyone.", "author": "Clf L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "Good lunch spot in SF. Very close to downtown area.\nBBQ chicken and short ribs lunch boxes are very good and healthy.\nSoups and noodles are tasty specially for cold/rainy weather.", "author": "J Phoenix B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "The food was amazing, and the service was great! The rice cakes were by far the best! Hesitated at first, but definitely glad we tried them. I had the spicy tofu soup, and the bf had the ramen seafood. All came out to $40, and portion sizes were well more than enough. Definitely recommend this place for the food and service.", "author": "Stephanie V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-06", "description": "Food was fine but they have shady business practice. I dined there by myself and they included the tip in the charge AND the receipt was saying it's a \"PRE\"-tip amount (see my pic). I usually don't really look close at the receipt and was writing my tip amount but then realized that the bill shouldn't be above $20 and found out that they already included the tip and didn't tell me anything about it (and it was saying the total bill amount was a pre-tip amount).", "author": "Anony B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-22", "description": "I only come here out of necessity not because of the food. This place never has a long line, and at 2am in the morning that is something you are definitely looking for. There is something off about the taste here. I can't really figure it out, but the cheese corn tastes like plastic to me. There's no sweetness, just a major disappointment. In fact most of the dishes that I've had here don't really live up to my standard of Korean food. However, that's not to say I won't be back here. Typically I go to Cocobang around the corner, but their line is always ridiculously long. Thus, Zzan is an acceptable replacement, or at least I think it is... If you are looking for a legit Korean dining experience this is not the place for that; however, if you are looking to get sub-par Korean food after a night of drinking... I mean I wouldn't say no haha.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "Just ordered two dishes to go. Short ribs and kimchee fried rice. The short ribs were $22, and I kid you not, there are 12 cut up pieces of short rib that came out about 3 minutes after the order was put in. Obviously made well ahead, dry and not all that tasty, but the shocking thing is that it weighs about 5 ounces! Shocking rip off, and will never get one penny more from me! You have been warned about this place so no whining when you are royally ripped off! Kimchee fried rice was adequate", "author": "terence r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "Good Korean fare but NOT family friendly for vacationeers. We were heading to the Rove Kitchen but it was closed so we decided to head across the street to Zzan. They have all the mainstays bulgogi, bibimbap and kimchee pajun. All were excellent especially the pajun. Nice and crispy. However, they should have said 18 and over only because the videos they were projecting on the wall were all MA rated with rappers spewing out one F bomb after another. It was not K-Pop. Plenty of shaking booty and gold rings. So if you have kids under 14, I would come back on a day without them.", "author": "Alan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-07", "description": "They try to be nice. They let you sit while you wait.\nThe wait for takeout is horrendously long. Like...I could have just gotten served instead.\nThe food variety is good, prices are decent.\n\nWhen this place first opened, the fish roe soup was great. It had crabs in it!\nNow it doesn't. I guess they figured they don't have to work so hard anymore. It's just watered down stuff.\n\nThe bibimbap was good, but I never got it a second time because the first time I chewed on a LOT of dirt in their spinach. Wash your veggies, please.\n\nThe noise level and lighting emulate a youth-catered Korean pub. I would like to go in to eat but I can never stay because of the crazy music and lights. I guess they only cater to 19-year-olds.", "author": "Sera L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "I love that this place is so close to my apartment. I am always craving Korean food, and unfortunately, I haven't really found excellent Korean food in the city. Nothing really compared to the LA area. So I was really excited when I found this place. It's not the absolute best Korean food I've ever had, but it's very authentic and the prices don't break the bank. They have awesome lunch specials where you can get a good amount of food for $11-$12. So far, I have tried their lunch special Army Soup and Tofu Soup. Both are good and spicy! The girl who is there during lunch is very nice and I plan to stop by any chance I get during the week. It is also good to note that their lunch special are only on weekdays, and they are open late every day so its a good place to go after a night at Ruby Skye or a Polk Street bar.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "My new favorite Korean restaurant in the city!\nAwesome fried chicken, soup, and everything else was great, too.\nI'll definitely come back to try some more dishes.", "author": "Shunji T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Went in at 1030pm, place wasn't too busy. Interior was dark and had korean music videos playing on the walls. Seating was very comfortable and spacious. The menu was simple and the food super fresh and delicious. My friends and I ordered the spicy pork bulgogi, kimchi fried rice, spicy bbq chicken with cheese, soft tofu soup with kimchi, and potato croquettes. The servers were attentive and the food was served fast. This is definitely a place to go to if you want some late night eats with a low key atmosphere.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "Tasted ok, but the portions were tiny and the \"runny egg\" on top of everything was only half cooked. The white was still runny.  Won't be coming back.", "author": "Charles N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-01", "description": "Good enough but not great. The dishes are not better tasting or have higher quality than the other places around the lower nob hill neighborhood. The banchan has improved since i first went but thats not saying much. The richmond district still has the best korean food.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Came here last night with a group of drunk friends and it was so good!! We had the army soup, spicy fried chicken, ttukboki, and fried rice. This will be my new go-to over Sutter 707 (not a fan) and Cocobang. My favorite was the ttukboki, which was a total surprise. One of my friends is a k-town LA boy and even he was impressed.  We also got a pitcher, and of course, as I was serving my friends, I spilled the first cup. What a party foul, i know... BUT they were kind enough to give us a new pitcher! Did not expect that, that is true Korean-style service. I definitely recommend this place!", "author": "Jennie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "I was trying to find a really great Korean place close to home and this one was perfect!! A block away!! The food is amazing!! - only BUT, was the VERY poor service that I took two stars out.", "author": "Jocelyn Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "My husband and I first came here on a night the wait at cocobang was long and we were too lazy and hungry to wait.  We were pleasantly surprised about how good everything was.  They had a similar atmosphere and banchan to cocobang.  The Spicy fried chicken was really good.  Not as sweet as we are used to, but definitely delicious.  The pan fried clear noodle there is really good.  Some other favorites are the sweet creamy pan fried rice cakes and their $0.75 wings on Tuesdays (The soy garlic is a fav).  We have been back several times and are glad we gave it a try.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "I was in SF for a business trip and ate here 3 times over 4 days. So it is pretty good. If you are w a crowd suggest Army Stew, chicken wings, gal Bi and bul go gi were spot on. Had two of their soups, reminded me of my mom's cooking. Which was a good thing. Having tried several Korean restaurants near by, this one is far the best!  It was loud, I asked them to turn the videos down and I think they did? Don't know it was still loud.", "author": "Soo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Definitely one of my favorite Korean restaurants in San Francisco. Some of the dishes are authentic and some are modern/slightly Americanized but the menu is HUGE and there is a wide enough selection to fulfill any Korean craving you may have. I had the creamy rice cakes (with FRESH, not frozen rice cakes AND bacon!), seafood bim bim bop, egg souffle, chicken wings and seafood pancake... WOW. All cooked to perfection and so full of flavor! The service is fast, attentive, and very friendly. Yes, Zzan gets busy and yes, so do the servers, but any good restaurant that's full of customers will be a little loud and bustley at times. Overall, its a great atmosphere to eat and drink and the bill won't wipe out your bank account.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Still got the game. Cocobang and 707 can move aside. Budak was the bomb-julio. Ramen with rice cake was gangsta.", "author": "Koalie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-25", "description": "Tooooooooo slow! I sat in the restaurant for forty minutes and they did not bring any food out!! There are only two waitress.", "author": "Tracy X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Great food and service, also beer on tap. Their spicy fried chicken is delicious as well as their army base soup. Will definitely be back to try more of the menu. Coco Bang and 707 have some new competition in the neighborhood. If you are in the area you should stop by ZZAN.", "author": "Wei W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-23", "description": "As far as Korean BBQ, it's one of the worst I've ever had. All the meat had fat dangling from it. The service was average to poor and the prices were exorbitant for the location. We ordered two dishes, the second one came out about 10 minutes after the first one.  Not a good experience at all.", "author": "Paula A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "I was under the weather and needed a hot soup that will make me sweat before I go to bed. The server was kind enough to suggest beef brisket soup as it is spicy and should help with the cold. The portion was huge, but I almost finished it all, as it was pretty flavorful! Now I'm home under the blanket hoping I feel better soon.", "author": "Aya J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-23", "description": "Pretty bad delivery food quality. Worst soft tofu soup I've ever had (all broth, barely any veggies, seafood, or even tofu), asked for side dishes (reason why I ordered, expecting several as they would serve if you sat down) and gave me just fish cake (cheap.) Steamed egg was literally just egg steamed with no veggies but a few scallions. Low quality and skimpy food. Will not order from Zzan again.", "author": "Kira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "I live across the street and just tried this out yesterday. It was awesome! Quality Korean food, very sweet and helpful staff, no wait, food came out quickly. Reasonable prices. I'll definitely be a regular here. Welcome to the neighborhood, ZZAN!", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-01", "description": "Honestly, I came by here because 707 was closed for the night and I was craving Korean food, so seeing that this place had recently opened up my girlfriend and I decided to try it out. \n\nZzan is a small place - the sign says it only fits 44 people - and the interior is a strange combination of newer, modern lighting and walls that seem to suggest the previous ownership was that of a middle eastern or Indian restaurant. There aren't many tables, and your wait will be significantly longer if a large group happens to snag up some of the precious real estate inside, but for a group of 2 our wait was only about 30 minutes at 8pm on weeknight. In case you didn't know, there is a small podium set up in the left corner hidden by a table (really?) that has a waiting list for you to put your party down on. There has got to be a better way/place for that to be... but it may just be the inefficient layout of the place. They seem a little understaffed so service was slow when we went. The kitchen seemed to be the limiting factor with efficiency and the girls were running between tables and the cashier asking a lot of questions, but they were super nice with seating and service. \n\nFood-wise, I have no complaints. We started out with an order of the chicken wings which are HUGE. Probably some of the biggest wings I've ever been served at any restaurant. Bigger than 707, and 3 or 4 times bigger than what you would get from a place like Wingstop. And they were delicious. I'm definitely coming back for those.\nWe also got the kimchi fried rice and a tofu soup bowl because we were cold and hungry and need to pack on the winter insulation. While neither stood out, both were good and satisfying. We did order the soup mild, and it came out pretty red and spicy, which I would have called medium at most other places. Maybe this was a mistake, maybe Zzan just likes to turn up the heat, but thats not a deal breaker. \n\nOh, and anther thing that I feel I need to mention - the waitress was amazing at refilling our banchan. We never even needed to ask. More tip for her just for that, since for some reason that is a big part of my Korean food experience. \n\nMango soju was pretty good. It came out a little icy at the top, which I'm not not-used to, but the bottom of the pitcher was pretty thick. I should have thinned it with water or something, but that seems like something you aren't supposed to do...\n\nSo yes, I will come here again and hopefully try some of their other dishes. Oh, and did you know that they have TUESDAY WING DAY??? 0.75 per wing ($2 on top of that) but if they are the same wings that I got from my regular order I'm DEFINITELY COMING BACK FOR THAT!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "Vegetarian and Vegan friendly! Great bibimbap for the right price, and the stone bowl stays very hot. The banchan is also a plus. Flavors are on point. Happy hour until 8. Convenient hours and good service. KPop video wall is a plus for entertainment. Overall, an excellent experience. Would come back again with friends. I could imagine that the late hours on weekends means a full house. I prefer this place more than 707.", "author": "Kayla F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-24", "description": "Came here with my willingness to try their food during Thanksgiving. Waiter told to wait for 10-15 mins. As we saw them started putting utensils on the table, we walked into the restaurant. However, we were asked to wait outside for more time during winter time, which we did. We kept waiting for 10 more mins and they welcomed a group of 3 people which belong to same culture background as the restaurant. We walked in to question them why let other people in first. They told us that group came 30 mins ago and they just came back. Excuse me???? They left and they can still get their seats? That doesn't make sense to me. We questioned again the table that they were preparing for? We were told that's reserved. During the whole process, waiters were not polite and welcoming. It appeared that they don't care your business. Won't give it a try although I pass by here everyday from work. Do not recommend.", "author": "Wei C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "I can only vouch for the soft tofu soup, but it was some of the best I've had in a long time. Awesome for a cold rainy night. The ambiance here is kind of weird (bad techno music?) but worth it for the soup.", "author": "Jo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "Nasty nasty nasty nasty nasty nasty.... coco bang is much better. Service is better than the foods. We ordered stir fry octopus with noodle which i was exciting about, it turns out BLEEEEEH. Beef dumpling taste like frozen food, calamari tempura its alright.... the rice dish came 30 min later n they forgot my hubby dinner. :( i guess this is why i hate going to new a restaurant.! I wont recommend this place at all !!!!", "author": "Nita D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "As a Korean who has spent half her life in Korea, I have been unimpressed with the Korean food in San Francisco. Zzan is mediocre, plain and simple, but it hits the spot when cravings call. The big thing has been a lack of flavor in every dish I've ordered -- even the bbibimbap was bland, and that's where I draw the line. I will return to Zzan, inevitably as I cannot escape the beckoning of meals that remind me of home. However, I do hope that the quality and flavor of the food improves with each visit.", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "Service is lacking.  They dont even pick up the phone sometimes.  I think they have staffing problems.  As a result, they have this hurry up unfriendliness attitude.  The food is pretty good though.  I would still come back for take-outs.  Not a place I would highly recommend though.", "author": "Jack T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-09", "description": "I live in the neighborhood and was craving ramen, but stumbled across this new place so decided to give it a shot. My roommate got the bibimbap and I got a tofu soup with ramen noodles and veggies. I was excited for all the side dishes that typically come with Korean food, but there were only 3 different kinds. I asked if there were others and she said there was one more - a potato dish- but that she didn't think that we would like it. What?? Why would we not like it? And why would you say that to us and not bring it to us? I asked for her to bring it and it was tasty - the regular sweet, miso-y potato you get at all Korean restaurants. My roommate's bibimbap looked great, and she said it was great, but my tofu soup was lacking. It hit the spot on a cold day, but it was pricey for what it was. Next time, I'll check out a different Korean place.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "Terrible. Actually first time I can think of being this disappointed in an SF restaurant. The food was extremely spicy, despite picking \"mild\". When I said something they said \"oh that's just the way it is, we get a lot of complaints about that.\" Huh? If you get complaints, notate that an item is spicy, especially when \"mild\" is an option. They had four people talk to me, and only the fourth offered a resolution. The quality and portion sizes were also very bad and small. Would definitely not go back nor recommend.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Great-tasting Korean food, including traditional items like Korean Sausage. The music was a bit too loud to talk at times, but I am guessing they are still finding their optimal vibe. With a mix of Korean and other music videos projected on the wall, you can get your fix of Korean boy/girl bands as a side dish.", "author": "Max M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "Yum!  Another solid casual Korean spot with the favorites: gal bi, jap chae, jjam bong, and soon doo boo.  We didn't try everything yet, but the dishes we had were flavorful and hit the spot.  Service is super friendly and helpful.  Our order took a little longer than I expected, but not so long that it was unreasonable.  Also, you get a little less selection of banchan than other places, but the quality was pretty good so better than a big plate of wilted veggie sides.  We'll definitely be back!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "Best late night Korean food in town! Great food, beer on tap, awesome service from owner Shawn. Try their kalbi tang, kararage, and korean sausage. Forget 707 and Cocobleh! Zzan is the real deal!", "author": "zhen t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "So happy this place opened up around the corner from my home. The food is amazing, some of the best Korean food I've ever had. Special shout out to Ara, she's so sweet and helpful. Love, love , love this place!!", "author": "paul b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-21", "description": "It holds some good HEALTHY Korean food in the Nob Hill area. You can see  and taste that it has low grease and that everything is fresh. They are super friendly and they always make sure you have a good time! Go Zzan for opening late as well!", "author": "Joseph V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "I just ordered the kimchee chigae (stew) thru DoorDash app and it was one of the best I've ever had. Arrived on time, was still hot, and came with 2 banchan sides (that were delish) and rice. The stew had a great flavor from the pork belly they used. The real way to make it! I don't know much about the rest of the food but their kimchee soup gets 5 stars. Com som nee dah!", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "Lovely place, big seating area so you can avoid waiting. Meat lovers are gonna enjoy the variety of chicken they have here. We had the bibimbap (authentically hot and crispy at the bottom) and the chicken and cheese - it's like eating elevated pizza without the crust.", "author": "Isabella D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-10", "description": "I was ordered for pick up but when I pick the food back to my home I find it only one coke but I ordered two. And also no chopsticks and napkin. It's a bad experience and I  don't have any mood to eat the food", "author": "Yue J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Love this place. Not too much Korean food options around, but this is my go-to place. Usually get the vegetable tofu soup and pork belly to go, but came in for dinner today and was really happy with the service. Everyone was very nice, quick, and attentive.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-21", "description": "Worst Korean food I've ever inhaled. The beef short rib. Was tough. They have discovered the step past well done", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "I would give no stars if I could. Worse korean food in SF. Everything tasted like it was frozen and made from not fresh ingredients. Portions were big but if you are looking for real korean food this is not the right place.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "Nice place inside, good service, fun K-pop videos but not too noisy, and food was very good. Definitely worth coming back.", "author": "Ron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Corn and melted cheese!!! Everything was so tasty! Now one of my favorite Korean restaurants. The service was great as well!", "author": "Juliane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I love creamy tteokbeoki and tofu soup. Its my favorite korean food! great servics and I like that they have alot of apps that I could order the food", "author": "Terisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Been to Seoul and Busan and points in between.  This is real.  Good. Low key and solid.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "I've looked for Korean BBQ in the city and finally found this place!! Their short ribs are amazing!!!", "author": "Abby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "My favorite cream ddeokbokki! Perfect for SF :) So good and cant wait to come back! Make sure to try it when you come!!", "author": "Silvia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "Great korean food and service. Service was fast. Server keep refilling our water and also mixing our drink which is cool!", "author": "Jason H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-29", "description": "Do not order pick up from this place. On busy nights (usually most nights), your wait time can be expected to be any where from 2-2.5 times what the cashier tells you. The food is mediocre at best.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-31", "description": "beware, the noise level is nuts.  too many drunk people and the noise travels.  food is not bad, tasty and alot of choices and server seems nice.  helpful but probably need more help. price is not expense but not cheap.  opens late, so it's good for late night but again, the noise is just a bit too much.", "author": "Food Is L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "Korean food is my favorite and I lived in Korea for almost a year so I know what good Korean food is. I ordered the kalbi. The menu had a section called small plates with dukpokki on it. Thinking this was appetizer size I ordered that as well.  The kalbi was good. Typical of what you find in the US when cooked in the kitchen and not at the table. The dukpokki was amazing!! I haven't had any that good since I was in Korea. And I've had it all over from coast to coast. And it was a huge bowl, not the \"small plate\" I was expecting. I ate it and took most of my kalbi to go.  The kimchi was also very good. A little salty, but all the right flavors and actually  fermented. Kimchi is just not kimchi without that zing on your tongue. I was very pleasantly surprised as it looked like it would just be another watered down, wanna-be, trendy Korean place. I read a few reviews here afterwards and all the bad ones ordered things that are not traditional Korean dishes. I imagine they need to have those dishes for those with \"American\" palates.", "author": "Jeffrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "you should try dolsot bibibab with bulgogi. don't forget gochujang when you mix it :)", "author": "Trent L."}
